{"abs":"This work is devoted to the development of a new and efficient procedure for the construction of adaptive model-based designs of experiments. This work couples kriging theory with design of experiments optimization techniques and its originality relies on two main ingredients: (i) the definition of a general criterion in the objective function that allows one to take into account the analyst’s choices in order to explore critical regions, and (ii) an efficient numerical implementation including a stabilization step to avoid numerical problems due to kriging matrix inversion and a computational cost reduction strategy that allows for the model’s use in industrial applications. After a full description of these key points, the resulting efficient algorithm is applied to extend over a territory in France a network of probes for environmental monitoring. This study leads to a final design of experiments where the new probes are located in undersampled regions of high population density. Moreover, it can be performed with an affordable computational cost, which is not the case with classical approaches based on an optimization over the whole domain.","title":"Construction and Efficient Implementation of Adaptive Objective-Based Designs of Experiments","id":272040385,"url":"https://www.researchgate.net/publication/272040385_Construction_and_Efficient_Implementation_of_Adaptive_Objective-Based_Designs_of_Experiments","names":["Léticia Buslig","Jean Baccou","Victor Picheny","Mathematical geosciences"],"references":{"252662894":"Improving an Ergonomics Testing Procedure via Approximation-based Adaptive Experimental Design","45904702":"A Computationally Stable Approach to Gaussian Process Interpolation of\nDeterministic Computer Simulation Data","216301383":"Exploration of Metamodeling Sampling Criteria for Constrained Global Optimization","45167926":"Second-Phase Sampling Designs for Non-Stationary Spatial Variables","238677918":"Random Number Generation and Quasi-Monte Carlo Methods. SIAM, Philadelphia","31641483":"Statistics for Spatial Data / N. Cressie.","260278602":"Design and Modeling for Computer Experiments","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","238354904":"Efficient Updating of Kriging Estimates and Variances","285829273":"IPSN method for uncertainty and sensitivity analysis and the associated software: SUNSET","267652901":"Conditioning of coefficient matrices of Ordinary Kriging","222306962":"Optimal selection of number, location of rainfall gauges for areal rainfall estimation using geostatistics and simulated annealing","224839861":"Geostatistics for Natural Resource Evaluation","245829939":"D-Optimality for Regression Designs: A Review","226789843":"On the condition number of covariance matrices in kriging, estimation, and simulation of random fields","3319717":"Computation of the condition number of a nonsingular symmetric Toeplitz matrix with the Levinson-Durbin algorithm","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","265681709":"D-Optimality for Regression Designs: A Review","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","225331924":"The kriging update equations and their application to the selection of neighboring data","226798104":"Simulation of mineral grades with hard and soft conditioning data: Application to a porphyry copper deposit","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","224840024":"Response Surface Methodology (RSM): Process and Product Optimization Using Designed Experiments","227093590":"Conditioning of the stationary kriging matrices for some well-known covariance models"},"citedIn":{"265013708":"Development and validation of a dynamic metamodel based on stochastic radial basis functions and uncertainty quantification"},"index":102}