{"abs":"In this work we consider a class of uncertainty quantification problems where the system performance or reliability is characterized by a scalar parameter $y$. The performance parameter $y$ is random due to the presence of various sources of uncertainty in the system, and our goal is to estimate the probability density function (PDF) of $y$. We propose to use the multicanonical Monte Carlo (MMC) method, a special type of adaptive importance sampling algorithm, to compute the PDF of interest. Moreover, we develop an adaptive algorithm to construct local Gaussian process surrogates to further accelerate the MMC iterations. With numerical examples we demonstrate that the proposed method can achieve several orders of magnitudes of speedup over the standard Monte Carlo method.","title":"A surrogate accelerated multicanonical Monte Carlo method for uncertainty quantification","id":281312187,"url":"https://www.researchgate.net/publication/281312187_A_surrogate_accelerated_multicanonical_Monte_Carlo_method_for_uncertainty_quantification","names":["Keyi Wu","Jinglai li"],"references":{"13245163":"Multicanonical Ensemble: A New Approach to Simulate First-Order Phase Transitions","267120362":"Multicanonical MCMC for sampling rare events: An illustrative review","228645474":"Searching for Rare Growth Factors Using Multicanonical Monte Carlo Methods","245366298":"Chen, W.: Sequential Optimization and Reliability Assessment method for Efficient Probabilistic Design. ASME J Mech Des 126, 225-233","228372762":"SOA Intensity Noise Suppression in Spectrum Sliced Systems: A Multicanonical Monte Carlo Simulator of Extremely Low BER","200043083":"Applied Groundwater Modeling Simulating Flow and Advective Transport","222071733":"Multicanonical algorithms for 1st order phase-transitions","220206985":"An efficient surrogate-based method for computing rare failure probability","260107754":"Asymptotically Exact MCMC Algorithms via Local Approximations of Computationally Intensive Models","226031060":"Sequential Monte Carlo for rare event estimation","268547438":"Markov Chain Monte Carlo Simulations And Their Statistical Analysis: With Web-Based Fortran Code","1953133":"Multicanonical Monte Carlo Simulations","253180263":"A Guide to Monte Carlo Simulations in Statistical Physics","220649778":"“Kriging: A Method of Interpolation For Geographical Information Systems,”","9032348":"Use of multicanonical Monte Carlo simulations to obtain accurate bit error rates in optical communications systems","236843208":"Kriging Models for Global Approximation in Simulation-Based Multidisciplinary Design Optimization","224121731":"A Fresh Look at Multicanonical Monte Carlo from a Telecom Perspective","243769567":"A Framework for Decision-Based Engineering Design","23576607":"An advanced probabilistic structural analysis method for implicit performance functions. AIAA J","222780925":"A new adaptive importance sampling scheme","45903815":"Free Energy Methods for Bayesian Inference: Efficient Exploration of\nUnivariate Gaussian Mixture Posteriors","228609755":"Optimization of Conditional Value-At-Risk","3291374":"Multicanonical communication system modeling - Application to PMD statistics","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation"},"citedIn":{},"index":103}