{"abs":"In this paper many convergence issues concerning the implementation of the Gibbs sampler are investigated. Exact computable rates of convergence for Gaussian target distributions are obtained. Different random and non-random updating strategies and blocking combinations are compared using the rates. The effect of dimensionality and correlation structure on the convergence rates are studied. Some examples are considered to demonstrate the results. For a Gaussian image analysis problem several updating strategies are described and compared. For problems in Bayesian linear models several possible parameterizations are analysed in terms of their convergence rates characterizing the optimal choice.","title":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","id":227611763,"url":"https://www.researchgate.net/publication/227611763_Updating_Schemes_Correlation_Structure_Blocking_and_Parametization_for_the_Gibbs_Sampler","names":["G. O. Roberts","S. K. Sahu","Journal Of The Royal Statistical Society"],"references":{"38357609":"Markov Chains for Exploring Posterior Distributions","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","265620657":"Bayesian Computation and Stochastic Systems","2599041":"How Many Iterations in the Gibbs Sampler?","13277506":"Multigrid Monte Carlo method. Conceptual foundations","244465562":"Iterative Solution of Large Linear Systems, Academic Press, New York","266452842":"Image Analysis, Random Fields and Dynamic Monte Carlo Methods: A Mathematical Introduction, Springer-Verlag, Berlin","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","31186037":"Efficient Parametrisations for Normal Linear Mixed Models","44478088":"Non-negative matrices and markov chains / E. Seneta","2520884":"Coordinate Selection Rules for Gibbs Sampling","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","2606836":"Suppressing Random Walks in Markov Chain Monte Carlo Using Ordered Overrelaxation","205716410":"Matrix Iterative Analysis","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","242436300":"Graphical Models In Applied Multivariate Statistics"},"citedIn":{"227735956":"Bayesian classification of Neolithic tools","220286758":"Parallel multivariate slice sampling","6810720":"Spatial Association between Speciated Fine Particles and Mortality","2644004":"Bayesian State-Space Modelling of Spatio-Temporal Non-Gaussian Radar Returns","226235248":"Markov Chain Monte Carlo","31123925":"Generalised Gibbs sampler and multigrid Monte Carlo for Bayesian computation","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","4899423":"Implementing componentwise Hastings algorithms","41029732":"Bayesian Calibration of Microsimulation Models","262145463":"Markov Chain Monte Carlo Algorithms for Lattice Gaussian Sampling","38326864":"Ordering and Improving the Performance of Monte Carlo Markov Chains","279364285":"Linear Models","247470302":"Seeking Efficient Data Augmentation Schemes via Conditional and Marginal Augmentation","2642998":"Analysis of systematic scan Metropolis algorithms using Iwahori-Hecke algebra techniques","238879773":"Approximate Predetermined Convergence Properties of the Gibbs Sampler","272381468":"A Bayesian method for analyzing combinations of continuous, ordinal, and nominal categorical data with missing values","228395966":"Adaptive Metropolis-Hastings samplers for the Bayesian analysis of large linear Gaussian systems","46583525":"Estimating Discrete Markov Models From Various Incomplete Data Schemes","2762752":"Over-relaxation methods and Metropolis-Hastings coupled Markov chains for Monte Carlo simulation","236640823":"A Method for Efficiently Sampling From Distributions With Correlated Dimensions","242966101":"Convergence rate of Gibbs sampler and its application","5201017":"Analytic convergence rates and parameterisation issues for the Gibbs sampler applied to state space models","223756128":"MCMC methods for restoration of nonlinearly distorted autoregressive signals","4746879":"Monte Carlo State-Space Likelihoods by Weighted Posterior Kernel Density Estimation","2834451":"Alternating Subspace-Spanning Resampling to Accelerate Markov Chain Monte Carlo Simulation","24065365":"Bayesian prediction in growth-curve models with correlated errors","225134928":"Two-dimensional generalisations of dynamic programming for image analysis","6627416":"Bayesian analysis of non-homogeneous Markov chains: Application to mental health data","7327313":"An introduction to Bayesian hierarchical models with an application in theory of signal detection","244953817":"A Comparison of Bayesian and Likelihood-Based Methods for Fitting Multilevel Models","238596731":"Control variates for estimation based on reversible Markov chain Monte Carlo samplers","268314554":"Applied Bayesian Models","282651805":"The Lognormal Race: A cognitive-process model of choice and latency with desirable psychometric properties.","268296620":"Blocking Gibbs Sampling for Inference in Large and Complex Bayesian Networks With Applications in Genetics","226235688":"Rate of Convergence of the Gibbs Sampler in the Gaussian Case","227704772":"Bayesian Modelling of Prehistoric Corbelled Domes","259740973":"Bayesian Nonparametric Inverse Reinforcement Learning","267454376":"Using a Birth-Death Process to Account for Reporting Errors in Longitudinal Self-reported Counts of Behavior","220515711":"Learning author-topic models from text corpora","279382779":"Some Results from Classical Statistics","279350011":"General Regression Models","2341501":"A Divide And Conquer Algorithm For Exact Simulation Of General Gaussian Markov Random Field","41760796":"Phylogeography Takes a Relaxed Random Walk in Continuous Space and Time","222430515":"Does a Gibbs sampler approach to spatial Poisson regression models outperform a single site MH sampler?","42639103":"Bayesian Inference of Genetic Parameters Based on Conditional Decompositions of Multivariate Normal Distributions","279364319":"Some Linear Algebra","279364317":"Bayesian Inference","4772040":"Fast sampling of Gaussian Markov random fields","252275592":"Bayesian Time-Series Model for Short-Term Traffic Flow Forecasting","275055334":"A note on one of the Markov chain Monte Carlo novice\u0027s questions","8489477":"A blocking Gibbs sampling method to detect major genes with phenotypic data from a diallel mating","3318455":"A peak preserving algorithm for the removal of colored noise from signals","269987999":"Bayesian Selection of Systemic Risk Networks","4772034":"Non-Gaussian OU Based Models and Some of Their Uses in Financial Economics","23633914":"Subsampling the Gibbs sampler: variance reduction","279321652":"geoCount: An R Package for the Analysis of Geostatistical Count Data","262019845":"On reparametrization and the Gibbs sampler","265227088":"The Generalized Multiset Sampler: Theory and Its Application","2581125":"Fast Sampling Of Gaussian Markov Random Fields With Applications","279364111":"Functions of Normal Random Variables","222918115":"Uncertainty assessment and data worth in groundwater flow and mass transport modeling using a blocking Markov chain Monte Carlo method","279364109":"Springer Series in Statistics","267437407":"Convergence in Variance of Chebyshev Accelerated Gibbs Samplers","33956535":"Exploiting graph cutsets for sampling-based approximations in Bayesian networks /","243103436":"Large-Sample Joint Posterior Approximations When Full Conditionals Are Approximately Normal","260529973":"Qualitative inequalities for squared partial correlations of a Gaussian random vector","222838780":"A sparse matrix approach to Bayesian computation in large linear models","279394835":"Binary Data Models","264925564":"Convergence of conditional Metropolis-Hastings samplers","24063446":"Bayesian modeling of measurement error in predictor variables","2822288":"Comparing Solution Methodologies for Speech Enhancement within a Bayesian Framework","275103966":"A fast universal self-tuned sampler within Gibbs sampling","38348534":"Backfitting in smoothing spline ANOVA","227701075":"Classical model selection via simulated annealing","258229158":"Comment on article by Polson and Scott","2753768":"Markov chain Monte Carlo and Rao--Blackwellization","45933694":"Control Variates for Reversible MCMC Samplers","261563221":"An external field prior for the hidden Potts model, with application to cone-beam computed tomography","273788050":"Automated Parameter Blocking for Efficient Markov-Chain Monte Carlo Sampling","257644445":"Bayesian semi-supervised learning with support vector machine","222549388":"Approximate Bayesian inference for hierarchical Gaussian Markov random fields","45130367":"Markov Chain Monte Carlo Technology","239756954":"To Center or Not to Center: That is Not the Question — An Ancillarity-Sufficiency Interweaving Strategy (ASIS) for Boosting MCMC Efficiency","2242295":"Conditional simulation from highly structured Gaussian systems, with application to blocking-MCMC for the Bayesian analysis of very large linear models","272479976":"Bayesian Graphical Models for STructural Vector Autoregressive Processes","259537838":"Resolving the Antarctic contribution to sea-level rise: A hierarchical modelling framework","222652819":"Inference with Non-Gaussian Ornstein-Uhlenbeck Processes for Stochastic Volatility","225090994":"Fast Markov chain Monte Carlo sampling for sparse Bayesian inference in\nhigh-dimensional inverse problems using L1-type priors","41011885":"General quantitative genetic methods for comparative biology: phylogenies, taxonomies and multi-trait models for continuous and categorical characters. J Evol Biol","265623304":"Sampling Gaussian Distributions in Krylov Spaces with Conjugate Gradients","8070309":"Gaggiotti OE, Brooks SP, Amos W, Harwood J. Combining demographic, environmental and genetic data to test hypotheses about colonization events in metapopulations. Mol Ecol 13: 811-825","229752658":"Markov Chain Monte Carlo","38339757":"Analysis of a nonreversible Markov chain sampler","257665456":"Iterative Numerical Methods for Sampling from High Dimensional Gaussian Distributions","228649291":"Bayesian Structural Equation Modeling","5207229":"Closed-form likelihoods for Arnason--Schwarz models","279364179":"Springer Series in Statistics","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","2572508":"Approximating Hidden Gaussian Markov Random Fields","45858374":"Rates of convergence of some multivariate Markov chains with polynomial eigenfunctions","24063377":"Bayesian Estimation of a Multilevel IRT Model Using Gibbs Sampling","222923854":"Using the Gibbs sampler for conditional simulation of Gaussian-based random fields","50996224":"Handbook of Monte Carlo Methods","279352747":"Springer Series in Statistics","274404171":"Bayesian Nonparametric Reward Learning From Demonstration","2748219":"Identifiability, Improper Priors and Gibbs Sampling for Generalized Linear Models","222605911":"Geometric Ergodicity of Gibbs and Block Gibbs Samplers for a Hierarchical Random Effects Model","23644795":"Optimizing random scan Gibbs samplers","40883579":"Simulation of geological domains using the plurigaussian model: New developments and computer programs","4772191":"Bayesian Inference for Non-Gaussian Ornstein-Uhlenbeck Stochastic Volatility Processes","228589752":"Nesting EM algorithms for computational efficiency","254296113":"Covariance Decompositions for Accurate Computation in Bayesian Scale-Usage Models","2655031":"Information bounds for Gibbs samplers","243103580":"Hierarchical Bayesian Neural Networks","45884317":"Non-parametric Deprojection of Surface Brightness Profiles of Galaxies in Generalised Geometries","228341429":"Bayesian Functional ANOVA Modeling Using Gaussian Process Prior Distributions","251425239":"Bayesian calibration of a large-scale geothermal reservoir model by a new adaptive delayed acceptance Metropolis Hastings algorithm","280773011":"Adaptive Multiple Importance Sampling for Gaussian Processes","1762088":"A General Framework for the Parametrization of Hierarchical Models","229760130":"Gibbs Sampling","4772221":"Approximating hidden Gaussian Markov random fields","288151569":"Monte Carlo Methods and Bayesian Computation: Overview","235726671":"Correction: Variable transformation to obtain geometric ergodicity in the random-walk Metropolis algorithm","257665567":"Efficient MCMC Sampling in Dynamic Mixture Models","242082086":"An introduction to YADAS","254296186":"Structured Markov Chain Monte Carlo","4772123":"Efficient construction of reversible MCMC proposal distributions","6668081":"A bivariate quantitative genetic model for a threshold trait and a survival trait","266604220":"An efficient Gibbs sampler for structural inference in Bayesian networks","243043108":"A note on Markov chain Monte Carlo sweep strategies","248808844":"Discharge-Dependent Pollutant Dispersion in Rivers: Estimation of the Aggregated Dead Zone Parameters with Surrogate Data","244902905":"Cutset Sampling for Bayesian Networks","233266308":"Preserving spatial structure for inverse stochastic simulation using blocking Markov chain Monte Carlo method","250754966":"Ch. 9. Empirical estimators based on MCMC data","257252414":"Parallel Bayesian inference of range and reflectance from LaDAR profiles","2258770":"On MCMC Sampling in Hierarchical Longitudinal Models","255970354":"Backward Simulation Methods for Monte Carlo Statistical Inference","51247739":"Allele coding in genomic evaluation","225775628":"Implementing random scan Gibbs samplers","2129242":"Optimal scaling for partially updating MCMC algorithms","279346653":"Springer Series in Statistics","220286558":"Efficient Markov chain Monte Carlo with incomplete multinomial data. Stat Comput","2501030":"A comparison of Bayesian and likelihood-based methods for fitting multilevel models","227787799":"Implementation issues for Markov Chain Monte Carlo methods in random regression test‐day models","264906830":"A switching Markov Chain Monte Carlo method for statistical identifiability of nonlinear pharmacokinetics models","255716024":"Profile-Based LC-MS data alignment--a Bayesian approach","45857597":"Transposable Regularized Covariance Models with an Application to Missing Data Imputation","255646388":"On computation using Gibbs sampling for multilevel models","24148216":"Component-Wise Markov Chain Monte Carlo: Uniform and Geometric Ergodicity under Mixing and Composition","255644850":"Studio della convergenza nell\u0027analisi di immagini digitali","271952315":"Simulating Large Gaussian Random Vectors Subject to Inequality Constraints by Gibbs Sampling","227577858":"Markov-chain Monte Carlo: Some practical implications of theoretical results","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","7732716":"Joint Bayesian Estimation of Alignment and Phylogeny","251858074":"A method of backward probabilistic logic reasoning of decision problems","279382845":"Springer Series in Statistics","226798104":"Simulation of mineral grades with hard and soft conditioning data: Application to a porphyry copper deposit","228550146":"Approximation Algorithms for Probabilistic Reasoning: Sampling and Iterative Inference","254778500":"Bayesian tests on components of the compound symmetry covariance matrix","24063682":"Signal Detection Models with Random Participant and Item Effects","2214798":"Stability of the Gibbs Sampler for Bayesian Hierarchical Models","49463106":"Novel statistical methods for analysing proteomic and clinical data associated with pregnancy-related diseases","257940719":"Monte Carlo Methods in Bayesian Statistics","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","256938721":"An enhanced Gibbs sampler algorithm for non-conditional simulation of Gaussian random vectors","228611091":"Model-based analysis to improve the performance of iterative simulations","200744515":"An analysis of contrastive divergence learning in gaussian boltzmann machines","7623619":"Bayesian neural networks for bivariate binary data: An application to prostate cancer study","7952835":"Stochastic Models for Horizontal Gene Transfer: Taking a Random Walk Through Tree Space","2241439":"General over-relaxation Markov chain Monte Carlo algorithms for Gaussian densities","37995006":"Graphical models for visual object recognition and tracking","48172385":"Discrimination for Two Way Models with Insurance Application","277932847":"The Generalized Multiset Sampler","229057639":"Photosolvolysis of 9-fluorenol derivatives in aqueous solution - exploratory studies of reactivity of photogenerated 9-fluorenyl cations.","283526438":"Estimation of evolutionary parameters using short, random and partial sequences from mixed samples of anonymous individuals","260169284":"The Lognormal Race: A Cognitive-Process Model of Choice and Latency with Desirable Psychometric Properties","289826945":"Case Studies in Bayesian Statistical Modelling and Analysis","262576238":"Automated Factor Slice Sampling","228163664":"A Bayesian High-Frequency Estimator of the Multivariate Covariance of Noisy and Asynchronous Returns","2360808":"Simulation-Based Methods for Blind Maximum-Likelihood Filter Identification","279389035":"Springer Series in Statistics","236625364":"Block-Relaxation Approaches for Fitting the INDCLUS Model","245582195":"Variable-at-a-time Implementations of Metropolis-Hastings","257936014":"Rejoinder for: A Vine-copula Based Adaptive MCMC Sampler for Efficient Inference of Dynamical Systems","224091784":"Markov Chain Monte Carlo Detectors for Channels With Intersymbol Interference","33028131":"Introducing and evaluating a Gibbs sampler for spatial Poisson regression models","227648587":"Some algebra and geometry for hierarchical models, applied to diagnostics","4993431":"Bayesian analysis of single-molecule experimental data","248132886":"Towards Automatic Reversible Jump Markov Chain Monte Carlo","285355231":"Subjective and Objective Bayesian Statistics: Principles, Models, and Applications, Second Edition","7322033":"A bivariate quantitative genetic model for a linear Gaussian trait and a survival trait","220226754":"Simulation-based methods for blind maximum-likelihood filter identification","223097006":"A Bayesian approach to estimate the marginal loss distributions in operational risk management","221926622":"Applications of Graphical Clustering Algorithms in Genome Wide Association Mapping","242923415":"On convergence of the EM algorithmand the Gibbs sampler","4749733":"Parameterisation and efficient MCMC estimation of non-Gaussian state space models","229900871":"Discussion on the paper by Brooks, Giudici and Roberts","279350098":"General Regression Models","227393143":"A Bayesian model for classifying all differentially expressed proteins simultaneously in 2D PAGE gels","225152145":"A note on data augmentation and iterative simulation for survival rate estimation"},"index":11}