{"abs":"Subset Simulation is an adaptive simulation method that efficiently solves structural reliability problems with many random variables. The method requires sampling from conditional distributions, which is achieved through Markov Chain Monte Carlo (MCMC) algorithms. This paper discusses different MCMC algorithms proposed for Subset Simulation and introduces a novel approach for MCMC sampling in the standard normal space. Two variants of the algorithm are proposed: A basic variant, which is simpler than existing algorithms with equal accuracy and efficiency, and a more efficient variant with adaptive scaling. It is demonstrated that the proposed algorithm improves the accuracy of Subset Simulation, without the need for additional model evaluations.","title":"MCMC algorithms for Subset Simulation","id":279070817,"url":"https://www.researchgate.net/publication/279070817_MCMC_algorithms_for_Subset_Simulation","names":["Iason Papaioannou","Wolfgang Betz","Kilian Zwirglmaier","Daniel Straub","Probabilistic Engineering Mechanics"],"references":{"229350702":"Modified Metropolis–Hastings algorithm with reduced chain correlation for efficient subset simulation","230872901":"Stochastic Finite Elements","228280215":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","49458431":"A tutorial on adaptive MCMC","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","223106779":"Important sampling in high dimensions","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","228810298":"Geometric insight into the challenges of solving high-dimensional reliability problems","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","51945859":"Bayesian Post-Processor and other Enhancements of Subset Simulation for\nEstimating Failure Probabilities in High Dimensions","38357609":"Markov Chains for Exploring Posterior Distributions","239387109":"Optimal Importance-Sampling Density Estimator","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","222378983":"The role of the design point for calculating failure probabilities in view of dimensionality and structural nonlinearities","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","226031060":"Sequential Monte Carlo for rare event estimation","270435244":"Updating first- and second-order reliability estimates by importance sampling.","2750746":"Regeneration in Markov Chain Samplers","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","222780925":"A new adaptive importance sampling scheme","245210913":"Application of spherical subset simulation method and auxiliary domain method on a benchmark reliability study","38322292":"An Adaptive Metropolis Algorithm","221990278":"Implementing advanced Monte Carlo simulation under spreadsheet environment","285327420":"Structural reliability under incomplete information","245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","200105001":"Equation of State by Fast Computing Machines","222165872":"Reliability analysis—A review and some perspectives","271816316":"Modification of Estimates of Parameters in the Construction of Genetic Selection Indices (\u0027Bending\u0027)","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","283763647":"Zon-normal dependent vectors in structural safety","243739482":"Efficient Metropolis Jumping Rules","222933783":"Asymptotic sampling for high-dimensional reliability analysis","226385182":"Componentwise adaptation for high dimensional MCMC. Comput Stat","239666344":"Regression and Classification Using Gaussian Process Priors","224877317":"Equation of State Calculations by Fast Computing Machines","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","265620657":"Bayesian Computation and Stochastic Systems","210222819":"Simulation and the Monte Carlo Method","257007034":"Cross-entropy-based adaptive importance sampling using Gaussian mixture","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","282494905":"Optimal scaling of discrete approximations to Langevin diffusions","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","251516554":"Discussion of paper by F. Miao and M. Ghosn “Modified subset simulation method for reliability analysis of structural systems”, Structural Safety, 33:251–260, 2011","285364218":"Biometrika","238878661":"Acceptance–Rejection Sampling Made Easy","228974174":"Modified Metropolis-Hastings algorithm with delayed rejection","4993330":"Sequential Monte Carlo Samplers","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","251516547":"Modified subset simulation method for reliability analysis of structural systems"},"citedIn":{"284924665":"Rare Event Simulation in Finite-Infinite Dimensional Space","291012395":"On MCMC algorithm for Subset Simulation"},"index":111}