{"abs":"Specification of the linear predictor for a generalised linear model requires determining which variables to include. We consider Bayesian strategies for performing this variable selection. In particular we focus on approaches based on the Gibbs sampler. Such approaches may be implemented using the publically available software BUGS. We illustrate the methods using a simple example. BUGS code is provided in an appendix. 1 Introduction In a Bayesian analysis of a generalised linear model, model uncertainty may be incorporated coherently by specifying prior probabilities for plausible models and calculating posterior probabilities using f(mjy) \u003d f(m)f(yjm) P m2M f(m)f(y jm) ; m 2 M (1.1) where m denotes the model, M is the set of all models under consideration, f (m) is the prior probability of model m and f (yjm; fi m ) the likelihood of the data y under model m. The observed data y contribute to the posterior model probabilities through f(yjm), the marginal likelihood calculated...","title":"Bayesian Variable Selection Using the Gibbs Sampler","id":2504967,"url":"https://www.researchgate.net/publication/2504967_Bayesian_Variable_Selection_Using_the_Gibbs_Sampler","names":["Petros Dellaportas","Jonathan J. Forster","Ioannis Ntzoufras"],"references":{"46951148":"Glim: An Introduction","2523045":"Calibration and Empirical Bayes Variable Selection","237131111":"Nonparametric regression using Bayesian variable selection","23741295":"Variable Selection in Regression Models","222485349":"A Method for Simultaneous Variable Selection and Outlier Identification in Linear Regression;","38359714":"Elicitation of Prior Distributions for Variable-Selection Problems in Regression","31373938":"Calibration and Empirical Bayes Variable Selection","254287396":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","2299598":"Model Selection and Accounting for Model Uncertainty in Linear Regression Models","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","220286515":"On Bayesian model and variable selection using MCMC","224881809":"Approaches for Bayesian Variable Selection","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","5285799":"Categorical data analysis","2813202":"Bayesian Variable Selection with Related Predictors","238727682":"Variable Selection Via Gibbs Sampling","238655585":"Bayesian Variable Selection in Linear Regression","265505742":"Assessment and Propagation of Model Uncertainty (with Discussion)","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","2820788":"Accounting for Model Uncertainty in Poisson Regression Models: Particulate Matter and Mortality in Birmingham, Alabama"},"citedIn":{"23684393":"A Bayesian approach to gene-gene and gene-environment interactions in chronic fatigue syndrome","51106506":"Inferring the time-invariant topology of a nonlinear sparse gene regulatory network using fully Bayesian spline autoregression","225100712":"Reversible jump methods for generalised linear models and generalised linear mixed models","222309062":"Bayesian inference in non-homogeneous Markov mixtures of periodic autoregressions with state-dependent exogenous variables","254778981":"BAYESIAN ANALYSIS OF CORRELATED PROPORTIONS","8344181":"Sillanpää MJ, Bhattacharjee M. Bayesian association-based fine mapping in small chromosomal segments. Genetics 169: 427-439","250823487":"References and Bibliography for the Tutorial on MCMC Bayesian Model and Variable Selection","51962709":"A Bayesian Joinpoint regression model with an unknown number of\nbreak-points","229238054":"Bayesian Methods for DNA Microarray Data Analysis","261568774":"Hierarchical modelling of population growth rate from individual capture-recapture data","256005588":"A hierarchical generalized linear model with variable selection: studying the response of a representative fish assemblage for large European rivers in a multi-pressure context. Stoch Env Res Risk Assess 1:16","27383414":"Bayesian Inference for the RC(m) Association Model","263063668":"On Sampling Strategies in Bayesian Variable Selection Problems With Large Model Spaces","5142805":"Gibbs variable selection using BUGS","283668212":"Nonparametric Variable Selection, Clustering and Prediction for Large Biological Datasets","272030187":"Mapping species distributions in one dimension by non-homogeneous hidden Markov models: The case of freshwater pearl mussels in the River Dee","259699623":"Disease Mapping and Regression with Count Data in the Presence of Overdispersion and Spatial Autocorrelation: A Bayesian Model Averaging Approach","261714566":"Bayesian model selection: The steepest mountain to climb","220504900":"Bayesian Variable Selection in Markov Mixture Models","228623812":"Adaptive Bayesian criteria in variable selection for generalized linear models","223094952":"Bayesian estimation of unrestricted and order-restricted association models for a two-way contingency table","51643833":"Identification of Significant Genes in Genomics Using Bayesian Variable Selection Methods","48194418":"Inferences in Bayesian variable selection problems with large model\nspaces","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","258229268":"A Review of Bayesian Variable Selection Methods: What, How and Which.","228705104":"A hierarchical bayes approach to variable selection for generalized linear models","262326614":"Modelling species abundance in a river by Negative Binomial hidden Markov models","271932161":"Bayesian variable selection in a class of mixture models for ordinal data: a comparative study","7949964":"Inferring Genetic Regulatory Logic from Expression Data","222703615":"Autocorrelation offsets zero-inflation in models of tropical saplings density","29749119":"Meta-Analysis of Diagnostic Test Data: Modern Statistical Approaches","228383201":"Bayesian computational methods in biomedical research","227618092":"Structural equation models for area health outcomes with model selection"},"index":113}