{"abs":"A vast literature in statistics, biometrics, and econometrics is concerned with the analysis of binary and polychotomous response data. The classical approach fits a categorical response regression model using maximum likelihood, and inferences about the model are based on the associated asymptotic theory. The accuracy of classical confidence statements is questionable for small sample sizes. In this article, exact Bayesian methods for modeling categorical response data are developed using the idea of data augmentation. The general approach can be summarized as follows. The probit regression model for binary outcomes is seen to have an underlying normal regression structure on latent continuous data. Values of the latent data can be simulated from suitable truncated normal distributions. If the latent data are known, then the posterior distribution of the parameters can be computed using standard results for normal linear models. Draws from this posterior are used to sample new latent data, and the process is iterated with Gibbs sampling. This data augmentation approach provides a general framework for analyzing binary regression models. It leads to the same simplification achieved earlier for censored regression models. Under the proposed framework, the class of probit regression models can be enlarged by using mixtures of normal distributions to model the latent data. In this normal mixture class, one can investigate the sensitivity of the parameter estimates to the choice of “link function,” which relates the linear regression estimate to the fitted probabilities. In addition, this approach allows one to easily fit Bayesian hierarchical models. One specific model considered here reflects the belief that the vector of regression coefficients lies on a smaller dimension linear subspace. The methods can also be generalized to multinomial response models with J \u003e 2 categories. In the ordered multinomial model, the J categories are ordered and a model is written linking the cumulative response probabilities with the linear regression structure. In the unordered multinomial model, the latent variables have a multivariate normal distribution with unknown variance-covariance matrix. For both multinomial models, the data augmentation method combined with Gibbs sampling is outlined. This approach is especially attractive for the multivariate probit model, where calculating the likelihood can be difficult.","title":"Bayesian Analysis of Binary and Polychotomous Response Data","id":242530111,"url":"https://www.researchgate.net/publication/242530111_Bayesian_Analysis_of_Binary_and_Polychotomous_Response_Data","names":["Jim Albert","Siddhartha Chib","Journal of the American Statistical Association"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","265672532":"Bayesian Inference for Generalized Linear and Proportional Hazards Models via Gibbs Sampling","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","254287149":"Generalized Linear Models With Random Effects; A Gibbs Sampling Approach","49308789":"The Analysis of Binary Data","5176584":"A Conditional Profit Model for Qualitative Choice: Discrete Decisions Recognizing Interdependence and Heterogeneous Preferences","264966220":"A Bayesian Approach to Outlier Detection and Residual Analysis","247554889":"Small Sample Properties of Probit Model Estimators","31478761":"A Remark on the Shape of the Logistic Distribution","227862750":"Inference for Non-Conjugate Bayesian Models Using the Gibbs Sampler","22146202":"A Generalization of the Probit and Logit Methods for Dose Response Curves","268490386":"Applications of a Method for the Efficient Computation of Posterior Distributions”, Applied Statistics, 31, 214-225","222652438":"A Bayesian Analysis of the Multinomial Probit Model with Fully Identified Parameters","265585217":"Bayesian analysis of the multinomial probit model","222351959":"“Bayes Inference in the Tobit Censored Regression Model.”","225304570":"Non-Uniform Random Variate Generation","238523242":"Posterior Computations for Censored Regression Data","243651483":"Bayesian Analysis of Regression Error Terms","230786735":"Conditional Logit Analysis of Qualitative Choice Behavior","240312637":"The Generalization of Probit Analysis to the Case of Multiple Responses","256557498":"Bayesian Analysis of Dichotomous Quantal Response Models","243766391":"Efficient Simulation from the Multivariate Normal and Student-t Distributions Subject to Linear Constraints","267182429":"“Bayes Estimates for the Linear Model.”","51992811":"Econometric Analysis","246005917":"Econometric Analysis","233212767":"A Statistical Model for the Analysis of Ordinal Level Dependent Variables","263072663":"Generalized Linear Model","269010353":"Classical and modern regression with applications. Boston: PWS-KENT","236853411":"“Regression Models for Ordinal Data (with Discussion),”","51992999":"Limited-Dependent And Qualitative Variables In Econometrics","23382491":"The estimation from individual records of the relationship between dose and quantal response","243689785":"Illustration of Bayesian Inference in Normal Data Models Using Gibbs Sampling"},"citedIn":{"1759256":"A flexible Bayesian generalized linear model for dichotomous response data with an application to text categorization","220894504":"A Sequential Dynamic Multi-class Model and Recursive Filtering by Variational Bayesian Methods.","254070567":"Bayesian Procedures as a Numerical Tool for the Estimation of Dynamic Discrete Choice Models","51051264":"Bayesian inference for an adaptive Ordered Probit model: An application to Brain Computer Interfacing","222569806":"Do emotions matter? Coherent preferences under anchoring and emotional effects","31123925":"Generalised Gibbs sampler and multigrid Monte Carlo for Bayesian computation","2551863":"DNA Microarray Data Analysis and Regression Modeling for Genetic Expression Profiling","222237998":"Estimating the cross-sectional market response to an endogenous event: Naked vs. underwritten calls of convertible bonds","4747355":"Bayes Inference Via Gibbs Sampling of Autoregressive Time Series Subject to Markov Mean and Variance Shifts","227388830":"Modeling Ordered Choices: A Primer","229100978":"Bayesian Auxiliary Variable Models for Binary and Multinomial Regression","277026966":"Modeling people with motor disabilities to empower the automatic accessibility and ergonomic assessment of new products","34929154":"Bayesian P-Splines in Structured Additive Regression Models","227425689":"A Bayesian approach for analyzing case 2 interval-censored data under the semiparametric proportional odds model","249657082":"Servizi di trasporto e meccanismi di scelta individuali: il ruolo dei cutoff","228879800":"Modeling and predicting extrapolated probabilities with outlooks. Statistica Sinica 18","228986299":"Bayesian Matching for Causal Inference","28131724":"A new marketing segmentation approach based on marginal individual utilities: Applying CRM is not a chimera anymore","46095005":"Multiclass Relevance Vector Machines: Sparsity and Accuracy","228963713":"The Trace Restriction: An Alternative Identification Strategy for the Bayesian Multinomial Probit Model","277291171":"Deliverable: D6.1 Editors:","228433337":"Logistic regression modeling of proteomic mass spectra in a case-control study on diagnosis for colon cancer","226424154":"A hierarchical model for ordinal matrix factorization","255588125":"CS535D Project: Bayesian Logistic Regression through Auxiliary Variables","4771939":"Prior Elicitation, Variable Selection and Bayesian Computation for Logistic Regression Models","227702201":"High dimensional structured additive regression models: Bayesian regularization, smoothing and predictive performance","23511370":"New Results On Censored Regression with Applications to Transactions Costs, Household Decisions and Food Purchases","272029722":"Joint modeling of cross-sectional health outcomes and longitudinal predictors via mixtures of means and variances","254287621":"Gibbs Sampler Convergence Criteria","8687785":"Genetic evaluation of calving to first insemination using natural and artificial insemination mating data","48200433":"A study of variable selection using -prior distribution with ridge parameter","4816998":"Linear mixed models with skew-elliptical distributions: A Bayesian approach","225512773":"Investigating Tropical Deforestation Using Two-Stage Spatial Misaligned Regression Models","249728726":"Building a Science of World PoliticsEmerging Methodologies And The Study Of Conflict","26421671":"An Introduction to the DA-T Gibbs Sampler for the Two-Parameter Logistic (2PL) Model and Beyond","254424863":"Contest Functions: Theoretical Foundations and Issues in Estimation","48376535":"A Bayesian Model of Sample Selection with a Discrete Outcome Variable","30865889":"Transaction Arrangements and Quality Management Strategies in British-Brazilian Fruit Trade","5009531":"Leading Indicators: What Have We Learned?","8144965":"Genetic analysis of age at first service, return rate, litter size, and weaning-to-first service interval of gilts and sows","51890988":"Consistency of Markov chain quasi-Monte Carlo on continuous state","6627416":"Bayesian analysis of non-homogeneous Markov chains: Application to mental health data","2476058":"Sparse Bayesian Classifiers for Text Categorization","28121581":"Actualización de las preferencias en los procesos iterativos de valoración contingente","242075182":"Bayesian Modeling of Treatment Response Data from Eligibility Trials","268314554":"Applied Bayesian Models","223835411":"Application of azo dyes as dosimetric indicators for enhanced photocatalytic solar disinfection (ENPHOSODIS)","252618567":"Discussion of Allenby, Chen and Yang","236639827":"Bayesian modeling of the dependence in longitudinal data via partial autocorrelations and marginal variances","237629027":"Bayesian Inference in Large Hierarchical Spatial Da ta Structures","239568395":"All students who have taken the departmental qualifying examination at the Ph. D. level are eligible for this Seminar/Study Group. Those who are required to take Professor Just\u0027s AREC869J may register for his course but attend the Seminar/Study Group to receive credit","228623852":"Nonparametric Bayesian modeling for multivariate ordinal data","257679127":"Bayesian Hierarchical Multivariate Formulation with Factor Analysis for Nested Ordinal Data","5175299":"Duration Dependent Markov-Switching Vector Autoregression: Properties, Bayesian Inference, Software and Application","266502061":"Fast Bayesian Inference for Non-Conjugate Gaussian Process Regression","5144604":"Computational Issues in the Sequential Probit Model: A Monte Carlo Study","23511346":"Adopting Organic Agriculture: An Investigation Using the Theory of Planned Behaviour","263163898":"Bayesian Spatial Classification","237071991":"Transdimensional Sampling Algorithms for Bayesian Variable Selection in Classification Problems With Many More Variables Than Observations","4986907":"Was There a Riverside Miracle? A Hierarchical Framework for Evaluating Programs With Grouped Data","26898883":"Bayesian model-based approaches with MCMC computation to some bioinformatics problems","229860842":"How Big is Your Neighbourhood? Spatial Implications of Market Participation Among Filipino Smallholders","221660522":"Fast simulation of truncated Gaussian distributions","223606031":"Abstract NIR and mass spectra classification: Bayesian methods for wavelet-based feature selection","23742775":"Bayesian Modelling of Catch in a Northwest Atlantic Fishery","5296141":"Zhou X, Liu S, Kim ES, Herbst RS, Lee JJBayesian adaptive design for targeted therapy development in lung cancer - a step toward personalized medicine. Clin Trials 5: 181-193","26898885":"Regression analysis with longitudinal measurements","254113658":"Bayesian Analysis of Multilevel Probit Models for Data With Friendship Dependencies","6449154":"Interval estimation for individual categories in cumulative logit models","228425215":"M\u0026a incentives and outcomes: Evidence from the mutual fund industry","229676506":"Binary quantile regression: a Bayesian approach based on the asymmetric Laplace distribution. J Appl Econom","242097667":"Mixed Logit with Bounded Distributions of Partworths","237534789":"Modeling Preference Changes via a Hidden Markov Item Response Theory Model","228683212":"Estimating Arizona Residents\u0027 Willingness to Pay to Invest in Research and Development in Solar Energy","45877970":"Importance sampling methods for Bayesian discrimination between embedded models","228543985":"Modeling bivariate longitudinal diagnostic outcome data in the absence of a gold standard","51948407":"Multiple Gaussian Process Models","43072224":"A Hierarchical Bayesian Model for Spatial Prediction of Multivariate Non‐Gaussian Random Fields","24054045":"The Monte Carlo EM method for estimating multinomial probit latent variable models","2633823":"A Random Effects Multinomial Probit Model of Car Ownership Choice","244954849":"A Decision-theoretic Approach to Program Evaluation","2824273":"Automating the Measurement of Linguistic Features to Help Classify Texts as Technical","255733572":"Computer-aided diagnosis system: A Bayesian hybrid classification method","221226321":"Inferring Sparse Kernel Combinations and Relevance Vectors: An Application to Subcellular Localization of Proteins","228066791":"Efficient Bayesian joint models for group randomized trials with multiple observation times and multiple outcomes","254287784":"Using Historical Controls to Adjust for Covariates in Trend Tests for Binary Data","259119089":"Bayesian binary regression with exponential power link","276916226":"Response surface methodology considering Poisson and Weibull regression models: a case study","4745422":"Empirical Bayes and Item-Clustering Effects in a Latent Variable Hierarchical Model: A Case Study From the National Assessment of Educational Progress","259119095":"State space mixed models for binary responses with scale mixture of normal distributions links","273914068":"Asymptotic Properties of Monte Carlo Strategies for a Cumulative Link Model","5152969":"Models of Multi-Category Choice Behavior","31146325":"Solidary and Functional Costs: Explaining the Presidential Appointment Contradiction","229238054":"Bayesian Methods for DNA Microarray Data Analysis","243050220":"Bayesian analysis of correlated mixed categorical data by incoporating historical prior information","254287806":"Variable Selection and Function Estimation in Additive Nonparametric Regression Using a Data-Based Prior","222531035":"Estimation on Stated-Preference Experiments Constructed from Revealed-Preference Choices","221615533":"Learning click models via probit bayesian inference","39424709":"Modelos multivariantes para variables ordinales: Aplicaciones en estudios de calidad de servicio","237012669":"Prediction with Missing Data via Bayesian Additive Regression Trees","4993261":"Modelling Spatially Correlated Data via Mixtures: A Bayesian Approach","40118982":"Discussion on the meeting on \u0027Statistical modelling and analysis of genetic data\u0027","4993262":"Particle Filtering for Partially Observed Gaussian State Space Models","287123903":"Inferring Ideological Ambiguity from Survey Data","278913085":"Bayesian variable selection in multinomial probit model for classifying high-dimensional data","240111339":"MCMC estimation in","4993258":"Broman, K.W. \u0026 Speed, T.P. A model selection approach for the identification of quantitative trait loci in experimental crosses. J. R. Stat. Soc. Ser. B Stat. Methodol. 64, 641-656","280057879":"Identifying biotic interactions which drive the spatial distribution of a mosquito community","2420867":"Modeling Customer Survey Data","48177783":"Sparse Partitioning: Nonlinear regression with binary or tertiary\npredictors, with application to association studies","4772065":"Model selection in spline nonparametric regression","235255468":"INTRODUCTION","258150346":"The Generalized Multilevel Facets Model for Longitudinal Data","257044472":"A comparison of different Bayesian design criteria for setting up stated preference studies","244526648":"Voter Choice in Multi-Party Democracies: A Test of Competing Theories and Models","285089877":"Bayesian Estimation of a Multi-unidimensional Graded Response IRT Model","251303511":"Classical and Bayesian Analysis of a Probit Panel Data Model with Unobserved Individual Heterogeneity and Autocorrelated Errors","31355251":"Bayesian Factor Analysis for Mixed Ordinal Continuous Response","36143753":"Heterogeneity in motorists\u0027 preferences for travel time and time reliability : empirical finding from multiple survey data sets and its policy implications /","222692840":"Variable selection for multivariate logistic regression models","26532154":"Gene Prediction Using Multinomial Probit Regression with Bayesian Gene Selection","225682909":"Modeling migraine severity with autoregressive ordered probit models","233076052":"Binary regression with a class of skewed t link models","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","12757104":"Bayesian analysis of prevalence with covariates using simulation-based techniques: Applications to HIV screening","4993278":"A theory of statistical models for Monte Carlo integration","231894369":"Business-cycle filtering of macroeconomic data via a latent business-cycle index","222418421":"A Bayesian approach to nonlinear probit gene selection and classification","24136132":"Bayesian Analysis of a Probit Panel Data Model with Unobserved Individual Heterogeneity and Autocorrelated Errors","220659091":"Moment-to-Moment Optimal Branding in TV Commercials: Preventing Avoidance by Pulsing","46529139":"Parsimonious Estimation of the Covariance Matrix in Multinomial Probit Models","253034403":"The Dual Spatial Autoregressive Probit Model with an Application to the 2001 Congressional Farm Bill","263452426":"Variable selection for multivariate generalized linear models","5103863":"Intra-Household Allocation and Consumption of WIC-Approved Foods: A Bayesian Approach","24068563":"Valuing drinking water quality improvement using a Bayesian analysis of the multinomial probit model","45529611":"On resolving the Savage–Dickey paradox","11796489":"Sequential Ordinal Modeling with Applications to Survival Data","254287766":"A New Skewed Link Model for Dichotomous Quantal Response Data","266913622":"Bayesian nonparametric estimation of targeted agent effects on biomarker change to predict clinical outcome: Bayesian Nonparametric Estimation of Targeted Agent Effects","263417715":"Mixed-Effects Models for Mental Health Services Research","277149764":"BayesX : Analyzing Bayesian Structured Additive Regression Models","220286432":"Efficient sampling schemes for Bayesian MARS models with many predictors","266463011":"Is there a Causal Effect of Working Part-time on Today\u0027s and Future Wages?","4993160":"Generalized linear mixed models for ordered responses in complex multilevel structures: Effects beneath the school or college in education","222668163":"Clipped latent-variable model for spatially correlated ordered categorical data","222176761":"The MCMC and SML estimation of a self-selection model with two outcomes","228341083":"Nonparametric Bayesian kernel models","277297231":"A Full Gibbs Sampler for a Multinomial Probit Model with Endogeneity.” Available on request from the first author","249179666":"The Problem with Boys: Bridewealth Accumulation, Sibling Gender, and the Propensity to Participate in Cattle Raiding among the Kuria of Tanzania","10606703":"Bayesian Latent Variable Models for Median Regression on Multiple Outcomes","221787638":"Hardening Email Security via Bayesian Additive Regression Trees","261537624":"Accounting for missing data when assessing availability in animal population surveys: An application to ice-associated seals in the Bering Sea","10606702":"Bayesian Inference on Order Constrained Parameters in Generalized Linear Models","45130367":"Markov Chain Monte Carlo Technology","239756954":"To Center or Not to Center: That is Not the Question — An Ancillarity-Sufficiency Interweaving Strategy (ASIS) for Boosting MCMC Efficiency","239859354":"Statistical Analysis For Longitudinal Counting Data in the Presence of a Covariate Considering Different \"Frailty\" Models","51403714":"Flexible Random Intercept Models for Binary Outcomes Using Mixtures of Normals","8579156":"Selection bias found in interpreting analyses with missing data for the prehospital index for trauma","261402447":"Diagnostics for Statistical Variable Selection Methods for Prediction of Peptic Ulcer Disease in Helicobacter pylori Infection","252927951":"Joint Modeling of Dynamic and Cross-Sectional Heterogeneity: Introducing Hidden Markov Panel Models","232906044":"Kernelized Bayesian Matrix Factorization","7409809":"Success at first insemination in Australian Angus cattle: Analysis of uncertain binary responses","10858562":"Multivariate Bayesian analysis of Gaussian, right censored Gaussian, ordered categorical and binary traits using Gibbs sampling","274026674":"Understanding merger incentives and outcomes in the US mutual fund industry","254445507":"Forecasting National Recessions Using State‐Level Data","271579333":"Selection bias found in interpreting analyses with missing data for the prehospital index for trauma","39729845":"Locally Adaptive Nonparametric Binary Regression","5206179":"Discrete Choice Method With Simulation","222416300":"Generalized Structured Additive Regression Based on Bayesian P-Splines","265119523":"Measuring Legislative Preferences","254287815":"Fitting Full-Information Item Factor Models and an Empirical Investigation of Bridge Sampling","221619674":"Randomized Pruning: Efficiently Calculating Expectations in Large Dynamic Programs.","51231742":"An Efficient Stochastic Search for Bayesian Variable Selection with High-Dimensional Correlated Predictors","229750084":"Bayesian Estimation of Limited Dependent Variable Spatial Autoregressive Model","222408118":"A discrete–continuous model of households’ vehicle choice and usage, with an application to the effects of residential density","37675718":"Using Data Augmentation and Stochastic Differential Equations in Spatio Temporal Modeling","237295322":"On The Specification, Identification, and Estimation of Discrete Choice Models: Classical and Bayesian Perspectives","224881767":"Adaptive Sparseness for Supervised Learning ´","228936868":"Efficient Bayesian model averaging in factor analysis","277291397":"Bayesian Inference in the Multivariate Probit Model Estimation of the Correlation Matrix","251921927":"Convergence rates and asymptotic standard errors for MCMC algorithms for Bayesian probit regression","227427469":"Determinants of a Digital Divide in Sub-Saharan Africa: A Spatial Econometric Analysis of Cell Phone Coverage","247877571":"BAYESIAN HIERARCHICAL ANALYSIS OF POLYCHOTOMOUS ITEM RESPONSES","5095754":"Estimating distributions of treatment effects with an application to the returns to schooling and measurement of the effects of uncertainty on college choice","45495231":"Using Testlet Response Theory to analyze data from a survey of attitude change among breast cancer survivors","51841565":"Simulation study for analysis of binary responses in the presence of extreme case problems","228887726":"Bayesian Approach to Zero-Inflated Ordered Probit Models, with an Application","264232627":"The heterogeneous effects of guardian supervision on adolescent driver-injury seventies: A finite-mixture random-parameters approach","276261243":"A Markov switching factor-augmented VAR model for analyzing US business cycles and monetary policy","10897835":"Generalized covariance-adjusted canonical correlation analysis with application to psychiatry","261688983":"Evaluation of the Bayesian and Maximum Likelihood Approaches in Analyzing Structural Equation Models with Small Sample Sizes","222626890":"Properties of Prior and Posterior Distributions for Multivariate Categorical Response Data Models","222522444":"A hierarchical Bayesian model of wildfire in a Mediterranean biodiversity hotspot","282362308":"Understanding Local Regulation of Fracking: A Spatial Econometric Approach","6826360":"A comparison between multivariate Slash, Student\u0027s t and probit threshold models for analysis of clinical mastitis in first lactation cows","41012065":"Bayesian Analysis of Nosocomial Infection Risk and Length of Stay in a Department of General and Digestive Surgery","6826361":"Bayes factor for testing the genetic background of quantitative threshold traits","266262219":"The Overlooked Potential of Generalized Linear Models in Astronomy - I: Binomial Regression","226634903":"Leveraging Information Across Categories","30480582":"Quantitative approaches for profit maximization in direct marketing","242075514":"“Quantitative Leverage Through Qualitative Knowledge: Augmenting the Statistical Analysis of Complex Cases","256761434":"A tutorial on the Bayesian approach for analyzing structural equation models","250185712":"A Mixed Effects Randomized Item Response Model","223335509":"Bayesian prediction of clipped Gaussian random elds","231212246":"Study Designs and Statistical Analyses for Biomarker Research","233835729":"Modèles à variables latentes en génétique des populations","254993937":"Bayesian Estimation of MultiStage Selection Models: Application to Door-to-Door Fundraising","7381331":"Locally Adaptive Function Estimation for Binary Regression Models","230706405":"Exact Hamiltonian Monte Carlo for Truncated Multivariate Gaussians","42976169":"Bayesian phase II adaptive randomization by jointly modeling time-to-event efficacy and binary toxicity","235796267":"Cows and herds constitute distinct hierarchical levels of heterogeneity in the variability of and association between milk yield and pregnancy outcome in dairy cows","222569571":"Non-price equilibria for non-marketed goods","220363786":"Bayesian Inference for Categorical Data Analysis","7381337":"On the Multivariate Probit Model for Exchangeable Binary Data with Covariates","4993382":"Bayesian modeling of catch in a northwest Atlantic fishery","230249621":"The impact of entry costs on export market participation in agriculture","259524182":"Spatial dependence of production choice: application of Bayesian Spatial Autoregressive Probit Model on smallholder rubber producers","3940627":"Bayesian learning of sparse classifiers","5142908":"BayesX: Analyzing Bayesian Structural Additive Regression Models","271874310":"Bayesian estimation of panel data fractional response models with endogeneity: an application to standardized test rates","11159961":"Disease Mapping of Stage-Specific Cancer Incidence Data","222682225":"Analyzing Tourists\u0027 Satisfaction: A Multivariate Ordered Probit Approach","23646300":"Climbing the Drug Staircase: A Bayesian Analysis of the Initiation of Hard Drug Use","228031650":"Bayesian Methods for Microarray Data","5206392":"Dating and forecasting turning points by Bayesian clustering with dynamic structure: A suggestion with an application to Austrian data","242462538":"Monetary valuation of informal carers\u0027 needs using a discrete choice experiment","4743539":"The Matrix Stick-Breaking Process: Flexible Bayes Meta-Analysis","47868903":"Multinomial Inverse Regression for Text Analysis","288151569":"Monte Carlo Methods and Bayesian Computation: Overview","4993393":"Assessment of Athens” metro passenger behavior via a multiranked probit model","258438695":"Modeling thermal comfort holistically: Bayesian estimation of thermal sensation, acceptability, and preference distributions for office building occupants","259718715":"Probit models for capture-recapture data subject to imperfect detection, individual heterogeneity, and misidentification","228963558":"Monte Carlo integration with Markov chain","220654693":"A sparse multinomial probit model for classification","222266491":"Bayesian inference of binary regression models with parametric link","231621771":"Hierarchical multinomial processing tree models: A latent-trait approach.","5177608":"Including Prior Information in Probit Model Estimation","6940962":"Bayesian variable selection for the analysis of microarray data with censored outcome","227630301":"Inference in Dynamic Discrete Choice Models With Serially orrelated Unobserved State Variables","227359965":"What are the consequences of consequentiality?","233362618":"A Framework for Skew-Probit Links in Binary Regression","250185661":"A Growth Model for Multilevel Ordinal Data","271626596":"Bayesian Methods for Analyzing Structural Equation Models With Covariates, Interaction, and Quadratic Latent Variables","228451531":"A Dynamic Hierarchical Bayesian Model for the Probability of Default","247877520":"A BAYESIAN MARGINAL INFERENCE IN ESTIMATING ITEM PARAMETERS USING THE GIBBS SAMPLER","5132569":"Bayesian Econometrics","45863906":"Notes on Using Control Variates for Estimation with Reversible MCMC Samplers","23767094":"Iwata H, Ebana K, Fukuoka S, Jannink J-L, Hayashi T. Bayesian multilocus association mapping on ordinal and censored traits and its application to the analysis of genetic variation among Oryza sativa L. germplasms. Theor Appl Genet 118: 865-880","49658794":"A latent model approach to define event onset time in the presence of measurement error","5687606":"Bayesian Optimal Design for Phase II Screening Trials","24418327":"A Bayesian Latent Variable Mixture Model for Longitudinal Fetal Growth","4725036":"Binomial Autoregressive Moving Average Models With an Application to U.S. Recessions","233024650":"Bayesian regression analysis of data with censored initiating and terminating times: Applications to AIDS","240262975":"Statistical analysis of nonlinear factor analysis models","228685006":"Civil war, interstate conflict, and tenure","221883464":"Monotonic Bayesian Semiparametric Benchmark? Dose Analysis","227544291":"An efficient computational approach for prior sensitivity analysis and cross‐validation","2816351":"Bayesian Analysis of Ordered Categorical Data From Industrial Experiments","228809941":"Estimation and Inference Are Missing Data Problems: Unifying Social Science Statistics via Bayesian Simulation","46312377":"Multidimensional IRT models with skew distributions for latent traits.","228660442":"Alternative prior distributions for variable selection with very many more variables than observations","5146933":"Repeated Dichotomous Choice Formats for Elicitation of Willingness to Pay: Simultaneous Estimation and Anchoring Effect","266323618":"Spatial Relationships in Choosing to Conserve Soil in Smallholder Rubber Farming","4895031":"Default Estimation and Expert Information: All Likely Dataset Analysis and Robust Validation","277023228":"TPRM: Tensor partition regression models with applications in imaging biomarker detection","2120097":"Multiprocess parallel antithetic coupling for backward and forward Markov Chain Monte Carlo","256374469":"Nonparametric vector autoregressions: Specification, estimation, and inference","249694054":"A Unified Maximum Likelihood Approach for Analyzing Structural Equation Models With Missing Nonstandard Data","5775837":"Mapping Quantitative Trait Loci From a Single-Tail Sample of the Phenotype Distribution Including Survival Data","5132747":"Estimation, Learning and Parameters of Interest in a Multiple Outcome Selection Model","228240415":"Markov Chain Monte Carlo Methods in Corporate Finance","257160921":"Measuring the consumer benefits of improving farm animal welfare to inform welfare labelling","243779339":"Analysis of Multivariate Probit Models","224896235":"Back to Basics for Bayesian Model Building in Genomic Selection","225314019":"Testlet Response Theory: An Analog for the 3PL Model Useful in Testlet-Based Adaptive Testing","240689109":"Extratropical Transition of Southwest Pacific Tropical Cyclones. Part I: Climatology and Mean Structure Changes","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","256374484":"Information Processing Pattern and Propensity to Buy: An Investigation of Online Point-of-Purchase Behavior","2632123":"Bayesian Analysis Of Golf","249999218":"Semiparametric Bayesian models for clustering and classification in presence of unbalanced in-hospital survival","267740769":"Bayesian Disease Classification Using Copy Number Data","47797068":"Modeling large scale species abundance with latent spatial processes","5165528":"Multinomial Probit Estimation of Spatially Interdependent Choices: An Empirical Comparison of Two New Techniques","5165529":"Échantillonnage de Gibbs et autres applications économétriques des chaînes markoviennes","263153207":"A Bayesian Approach to Finite Mixture Models in Bioassay via Data Augmentation and Gibbs Sampling and Its Application to Insecticide Resistance","4739537":"Demand, Supply and Willingness-to-Pay for Extension Services in an Emerging-Market Setting","239783888":"Gibbs Sampling for the Probit Regression Model with Gaussian Markov Random Field Latent Variables","227486736":"Contractualisation et diffusion spatiale des mesures agro-environnementales herbagères","5142993":"Multilevel IRT Modeling in Practice with the Package mlirt","228733954":"Bayesian Modeling in the Social Sciences: an introduction to Markov-Chain Monte Carlo","41509849":"Joint modeling of intercourse behavior and human fecundability using structural equation models","256452329":"Bayesian random threshold estimation in a Cox proportional hazards cure model","235601835":"Estimators of Binary Spatial Autoregressive Models: A Monte Carlo Study","224926921":"Nonparametric Bayesian Approaches to Non-homogeneous Hidden Markov\nModels","222659812":"Variance components of fertility in Spanish Landrace pigs","23511236":"HOW BIG IS YOUR NEIGHBORHOOD? SPATIAL IMPLICATIONS OF MARKET PARTICIPATION BY SMALLHOLDER LIVESTOCK PRODUCERS","235521962":"Bayesian Case Influence Measures for Statistical Models With Missing Data","228387896":"Bayesian approach to zero-inflated bivariate ordered probit regression model, with an application to tobacco","47373174":"Using Parallel Computation to Improve Independent Metropolis–Hastings Based Estimation","290109678":"Modeling Customer Survey Data","4950509":"Aggregate price shocks and financial stability: the United Kingdom 1796-1999","228918274":"Civil war, tenure, and interstate insecurity","4725216":"Bayesian and Non-Bayesian Approaches to Scientific Modeling and Inference in Economics and Econometrics","15526213":"Multiple-trait genetic evaluation for one polychotomous trait and several continuous traits with missing data and unequal models.","6015474":"Multivariate Bernoulli Mixture Models with Application to Postmortem Tissue Studies in Schizophrenia","11589914":"Bayesian Analysis of Liability of Clinical Mastitis in Norwegian Cattle with a Threshold Model: Effects of Data Sampling Method and Model Specification","222403820":"MCMC Algorithms for constrained variance matrices","24015043":"Bayesian Option Pricing Using Mixed Normal Heteroskedasticity Models","267415135":"Consideration set of automobiles: Purchase feedback and exclusivity in formation","254287495":"A Maximum Entropy Approach to Recovering Information From Multinomial Response Data","24080605":"A further extension of duration-dependent models","266546768":"Bayesian Robustness and Bayesian Nonparametrics","2601375":"Estimating Ratios of Normalizing Constants for Densities with Different Dimensions","224355558":"A distributed architecture for phishing detection using Bayesian Additive Regression Trees","223319286":"A Bayesian analysis of a simultaneous equations model for insurance rate-making","241143779":"Probit and Logit Models: Differences in the Multivariate Realm","251277124":"APTS Statistical Modelling: Bibliography","222581893":"Nonparametric binary regression using a Gaussian process prior","242239410":"A generalized skew probit class link for binary regression","254383853":"MARKOV CHAIN MONTE CARLO ALGORITHMS USING COMPLETELY UNIFORMLY DISTRIBUTED DRIVING SEQUENCES","226872384":"Mapping Pre-European Settlement Vegetation at Fine Resolutions Using a Hierarchical Bayesian Model and GIS","228869219":"Financial Development and Convergence Clubs","272820618":"Bayesian semi-parametric symmetric models for binary data","243048371":"An index sampling algorithm for the bayesian analysis of a class of model selection problems","228064326":"Predicting drug-target interactions from chemical and genomic kernels using Bayesian matrix factorization","46537493":"Approximate Bayesian Inference for Latent Gaussian Models by Using Integrated Nested Laplace Approximations","6889914":"Major gene detection for fusiform rust resistance using Bayesian complex segregation analysis in loblolly pine","228990076":"Fitting and comparison of models for multivariate ordinal outcomes","271630827":"Variational approximations in geoadditive latent Gaussian regression: mean and quantile regression","228385856":"Adaptive Monte Carlo for Bayesian Variable Selection in Regression Models","254287606":"Bayesian Tobit Modeling of Longitudinal Ordinal Clinical Trial Compliance Data With Nonignorable Missingness","2910706":"An EM Algorithm for Joint Feature Selection and","4772246":"Bayesian classification of tumors using gene expression data","4854165":"An Econometric Model of Birth Inputs and Outputs for Native Americans","12351837":"Sterility due to inhibition of sperm motility by oral administration of benzene chromatographic fraction of the chloroform extract of the seeds of Carica papaya in rats","249657088":"Scelte di trasporto e modelli a scelta discreta","254287562":"Modeling Household Purchase Behavior with Logistic Normal Regression","4993448":"Estimating percentile-specific treatment effects in counterfactual models: A case-study of micronutrient supplementation, birth weight and infant mortality","227617909":"Longitudinal Poisson modeling: an application for CD4 counting in HIV-infected patients","5132713":"Bayesian Analysis of Treatment Effects in an Ordered Potential Outcomes Model","236150772":"A censored random coefficients model for the detection of zero willingness to pay","222063830":"Simulated latent variable estimation of models with ordered categorial data","2542029":"Skewness and Fat Tails in Discrete Choice Models","4854177":"Bayesian Analysis of a Self-Selection Model with Multiple Outcomes Using Simulation-Based Estimation: An Application to the Demand for Health Care","266622472":"Generalized Estimating Equations to Binary Probit Model","228699212":"Semiparametric Hierarchical Bayes Analysis of Discrete Panel Data with State Dependence and Serial Correlation","222817462":"Mean-field variational approximate Bayesian inference for latent variable models","223511713":"Computational Techniques for Spatial Logistic Regression with Large Datasets","11594052":"Bayesian Modeling of the Level and Duration of Fertility in the Menstrual Cycle","7371141":"Bayesian Inferences on Umbrella Orderings","233778199":"Lower posterior death probabilities from a quick medical response in road traffic accidents","11594059":"Threshold Model for Misclassified Binary Responses with Applications to Animal Breeding","28078167":"Preference heterogeneity and willingness to pay for travel time","33028108":"Simultaneous probability statements for Bayesian P-splines","4993456":"Model-based estimates of the finite population mean for two-stage cluster samples with unit non-response","51511570":"Sparse Variational Analysis of Linear Mixed Models for Large Data Sets.","249285849":"Modeling Heterogeneity and Serial Correlation in Binary Time-Series Cross-sectional Data: A Bayesian Multilevel Model with AR(p) Errors","220286757":"The one-step-late PXEM algorithm","242386039":"Capturing Patterns of Spatial and Temporal Autocorrelation in Ordered Response Data, Using a Bayesian Approach: A Case Study of Land Use Changes in Austin, Texas","4909635":"How Much Does the Far Future Matter? A Hierarchical Bayesian Analysis of the Public\u0027s Willingness to Mitigate Ecological Impacts of Climate Change","234162172":"Nesting Monte Carlo EM for high-dimensional item factor analysis","23554925":"Staging of upper limb lymphedema from routine lymphoscintigraphic examinations","265987537":"Multilevel Factor analysis models for continuous and discrete data","282999504":"Multiply imputing missing values in data sets with mixed measurement scales using a sequence of generalised linear models","258254196":"Bivariate cumulative probit model for the comparison of neuronal encoding hypotheses","4909659":"Reassessing Brand Loyalty, Price Sensitivity, and Merchandising Effects on Consumer Brand Choice","242916462":"‘Nash Equilibrium in Multiparty Comeptition with ‘Stochastic’ Voters‘","237427763":"An MCMC Algorithm for Estimating Multivariate Mixed Response Types at 2 Levels","4854367":"Bayesian solutions to graduate admissions and related selection problems","228652982":"Spike and slab prior distributions for simultaneous Bayesian hypothesis testing, model selection, and prediction, of nonlinear outcomes","222484308":"An Exact Likelihood Analysis of the Multinomial Probit Model","4868690":"A decision theoretic framework for profit maximization in direct marketing","267214327":"Bayesian Conditional Density Filtering","279356093":"Generalized Linear Models","220286781":"Generic reversible jump MCMC using graphical models. pp. EPH-2005-01","261631364":"Quality Dimensions in E-Commerce Software Tools: An Empirical Analysis of North American and Japanese Markets","228671362":"Bayesian modeling of joint and conditional distributions","233326539":"Formulation and Application of the Hierarchical Generalized Random-Situation Random-Weight MIRID","267222473":"BAYESIAN MODEL CHECKING IN MULTIVARIATE DISCRETE REGRESSION PROBLEMS","228607876":"Trucking Industry Adoption . . .","12442267":"Random Effects in Censored Ordinal Regression: Latent Structure and Bayesian Approach","263288215":"Addressing misclassification for binary data: Probit and t-link regressions","220286729":"Improved auxiliary mixture sampling for hierarchical models of non-Gaussian data. Statistics and Computing, 19, 479-492","251438294":"A Rasch Model for Detecting Learning While Solving an Intelligence Test","266165747":"17 Hierarchical Item Response Theory Models","255622419":"Marginally Specified Hierarchical Models for Relational Data","228056997":"HMO Selection and Medicare Costs: Bayesian MCMC Estimation of a Robust Panel Data Tobit Model with Survival","226074442":"Predicting the Spatial Distribution of Ground Flora on Large Domains Using a Hierarchical Bayesian Model","265076216":"neucom14 HeZhang","4848243":"Monte Carlo evaluation of multivariate Student\u0027s t probabilities","5151348":"Flexible mixture modelling of stochastic frontiers","48167141":"Zero Variance Markov Chain Monte Carlo for Bayesian Estimators","24052562":"Joint Bayesian Analysis of Factor Scores and Structural Parameters in the Factor Analysis Model","256994668":"Bayesian estimation of exchange rate regime choice with spatial effect","221548404":"Bayesian Additive Regression Trees-Based Spam Detection for Enhanced Email Privacy.","51233101":"A Latent Model for Prioritization of SNPs for Functional Studies","265620884":"Bayesian mixture of splines for spatially adaptive nonparametric regression","2417260":"Sampling Based Approach For One-Hit and Multi-Hit Models in Quantal Bioassay","285735759":"Same concerns, same responses? A Bayesian quantile regression analysis of the determinants for supporting nuclear power generation in Japan","220499817":"Variational Bayesian Multinomial Probit Regression with Gaussian Process Priors","46493835":"Bayesian binary kernel probit model for microarray based cancer classification and gene selection","251583665":"Bayesian versus Classical Approaches to Inference: Theory and Applications","44261619":"Continuation-ratio Model for Categorical Data: A Gibbs Sampling Approach","38322200":"Posterior consistency for semi-parametric regression problems","244253918":"Data Augmentation for the Bayesian Analysis of Multinomial Logit Models","251870545":"Semiparametric analysis of multi-rater data","236334147":"Spatial occupancy models for large data sets","26809295":"Dynamic Model for Multivariate Markers of Fecundability","229738473":"Geoadditive Bayesian models for forestry defoliation data: A case study","15200959":"Bayesian hierarchical analysis of within-units variances in repeated measures experiments","4749841":"Bayesian significance testing and multiple comparisons from MCMC outputs","24064820":"State space mixed models for longitudinal observations with binary and binomial responses","228964347":"… Spatial Ordered Probit Model: Methods For Capturing Patterns Of Spatial And Temporal Autocorrelation In Ordered Response Data, Using Bayesian Estimation","13546158":"Use of ordinal categorical variables in skeletal assesment of sex from the cranium","227602419":"Bayesian analysis of the SUR Tobit model","227651573":"Using a New Statistical Model for Testlets to Score TOEFL","264113626":"Imputation for Binary or Ordered Categorical Traits Based on the Bayesian Threshold Model","1737341":"Vaart, A.W., van Zanten, J.H: Rates of contraction of posterior distributions based on Gaussian process priors. Ann. Statist. 36, 1435-1463","228562936":"Bayesian Variable Selection for Random Intercept Modeling of Gaussian and Non‐Gaussian Data","23743234":"MCMC Methods for Fitting and Comparing Multinomial Response Models","30864316":"Television and Internet Commercials Avoidance.","4815394":"A Computationally Practical Simulation Estimator for Panel Data","8233494":"Genetic Analysis of Male and Female Fertility Using Longitudinal Binary Data","228429814":"Are CEOs Charged for Stock-Based Pay? An Instrumental Variable Analysis","257641783":"Augmenting discrete-choice data to identify common preference scales for inter-subject analyses","265483708":"Orthogonal Data Augmentation for Bayesian Model Averaging","228675534":"An Empirical Comparison of Methods for Computing Bayes Factors in Generalized Linear Mixed Models","46536886":"A Truncated-Probit Item Response Model for Estimating Psychophysical Thresholds","30864295":"Statistical Methods for Missing Data in Complex Sample Surveys.","223033146":"Pattern recognition with a Bayesian kernel combination machine. Pattern Recogn Lett","263345604":"Tuning Parameter Selector for the Penalized Likelihood Method in Multivariate Generalized Linear Models","238879815":"Sampling Correlation Matrices in Bayesian Models With Correlated Latent Variables","271659595":"Bayesian analysis of some models that use the asymmetric exponential power distribution","51988837":"Mixed Beta Regression: A Bayesian Perspective","222416701":"Is Housing the Business Cycle? Evidence from US Cities","221157294":"Bayesian Dimension Reduction Models for Microarray Data.","225890289":"Advances in random utility models report of the workshop on advances in random utility models duke invitational symposium on choice modeling behavior","10600998":"Modelling multiple ovulation, fertilization, and embryo loss in human fertility studies","220215207":"Using Gaussian process based kernel classifiers for credit rating forecasting","280773173":"Scalable Bayesian Kernel Models with Variable Selection","227413765":"A Bayesian approach to model-based clustering for binary panel probit models","2396841":"Crossbred Cow Adoption and Milk Market Participation in a Multivariate Count Data Framework","253754767":"Specification and Inference in Nonparametric Additive Regression","8907286":"Using simulation-based inference with panel data in health economics","7490272":"A simulation study for the analysis of uncertain binary responses: Application to first insemination success in beef cattle","248390749":"Chapter 2","242531553":"A Stochastic Frontier Model for Discrete Ordinal Outcomes: A Health Production Function","5233370":"Bayesian Variable and Model Selection Methods for Genetic Association Studies","46538833":"Bayesian Inference for Ordered Response Data wit a Dynamic Spatial-Ordered Probit Model","51384711":"Fixed and Random Effects Selection in Linear and Logistic Models","24083446":"A Note on a Bayesian Approach to a Dichotomous Choice Environmental Valuation Model","257678786":"Modeling Associations Among Multivariate Longitudinal Categorical Variables in Survey Data: A Semiparametric Bayesian Approach","5903046":"Multistage sampling for latent variable models","256662994":"Variational Inference for Count Response Semiparametric Regression","228609854":"Local government competition for economic development","8423966":"Joint Classifier and Feature Optimization for Comprehensive Cancer Diagnosis Using Gene Expression Data","220219326":"Logistic regression in sealed-bid auctions with multiple rounds: Application in Korean court auction","262677814":"Discussion: \"A significance test for the lasso\"","228151046":"When are Your Customers Active and is Their Buying Regular or Random? An Erlang Mixture State-Switching Model for Customer Scoring","271753874":"Improving the Data Augmentation Algorithm in the Two-Block Setup","45387798":"A Random Intercepts-Functional Slopes Model for Flexible Assessment of Susceptibility in Longitudinal Designs","222662627":"Semiparametric Bayesian inference in smooth coefficient models","226852648":"Agent-Based Inference for Animal Movement and Selection","4915941":"The decline in the volatility of the business cycles in the UK","46454891":"Money growth and inflation: A regime switching approach","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","228628242":"A general decision theoretic formulation of procedures controlling FDR and FNR from a Bayesian perspective","227276601":"An Introduction to MCMC for Machine Learning","263345408":"Composite Likelihood Estimation for Multivariate Probit Latent Traits Models","8534582":"Bayesian analysis of two-level nonlinear structural equation models with continuous and polytomous data","251659700":"PUK27 TIME SAVINGS WITH Q4W (ONCE-MONTHLY) C.E.R.A.: A TIME AND MOTION STUDY CONDUCTED IN HEMODIALYSIS CENTRES IN FIVE EUROPEAN COUNTRIES","47642721":"Bayesian Variable Selection for Latent Class Models","7109333":"Hoti F, Sillanpää MJ. Bayesian mapping of genotype × expression interactions in quantitative and qualitative traits. Heredity 97: 4-18","228251427":"of LaborMisreported Schooling, Multiple Measures and Returns to Educational Qualifications","247389188":"Reparameterizing the generalized linear model to accelerate Gibbs sampler convergence","264023302":"Effects of Financial College Tuition Support by Korean Parents using a Hierarchical Bayes Model","267707727":"Nonparametric Bayesian Methods for Multiple Imputation of Large Scale Incomplete Categorical Data in Panel Studies","255655296":"Adaptive Monte Carlo for Binary Regression with Many Regressors","24054737":"Bayesian Estimation of Duration Models: An Application of the Multiperiod Probit Model.","227442481":"Bayesian Estimation of Bid Sequences in Internet Auctions Using a Generalized Record-Breaking Model","23176096":"Bayesian hierarchically weighted finite mixture models for samples of distributions","46819336":"Bayesian Nonparametric Regression Analysis of Data with Random Effects Covariates from Longitudinal Measurements","260662602":"Investigating the Disagreement Between Clinicians’ Ratings of Patients in ICUs","222828428":"Problematic effects of aggregation in z ROC analysis and a hierarchical modeling solution","224810915":"Hierarchical Bayesian modeling of heterogeneous cluster- and subject-level associations between continuous and binary outcomes in dairy production","257310096":"Variable Selection for Nonparametric Gaussian Process Priors: Models and Computational Strategies","236082394":"Genome-wide association study of Infectious Bovine Keratoconjunctivitis in Angus cattle","3193594":"Adaptive Sparseness for Supervised Learning","228806505":"Nonparametric Bayesian Modeling for Multivariate Ordinal Data","264535311":"Bayesian Nonparametric Modeling for Multivariate Ordinal Regression","250076202":"New tools for insight from ecological models and data 1","46434325":"Simulation based bayesian econometric inference: principles and some recent computational advances","235758812":"Gold as an Inflation Hedge in a Time-Varying Coefficient Framework","264803609":"Bayesian structural equation model","267566368":"Bayesian Nonparametric Modelling for Spatial Data Using Dirichlet Processes","4772506":"Diagnostic checks for discrete data regression models using posterior predictive simulations","44843129":"Explaining Variational Approximations","285768669":"Preference Instability, Consumption and Online Rating Behavior","254414323":"APPLYING BAYESIAN ORDINAL REGRESSION TO ICAP MALADAPTIVE BEHAVIOR SUBSCALES","43511886":"Comparison of three expert elicitation methods for logistic regression on predicting the presence of the threatened brush-tailed rock-wallaby Petrogale penicillata","234127149":"Integrated Analysis of Content and Construct Validity of Psychometric Instruments","2708210":"Bayesian Inference for Some Mixture Problems in Quality and Reliability","265819396":"THEORETICAL AND METHODOLOGICAL DEVELOPMENTS FOR MARKOV CHAIN MONTE CARLO ALGORITHMS FOR BAYESIAN REGRESSION","262868343":"Bayesian Analysis for Masked System Failure Data using Non-Identical Weibull Models","227024725":"Nobile, A.: A hybrid Markov chain for the Bayesian analysis of the multinomial probit model. Stat. Comput. 8, 229-242","2325245":"Bayesian Regression Analysis in the \"Large p, Small n\" Paradigm with Application in DNA Microarray Studies","265311538":"DISCRETE DURATION MODEL HAVING AUTOREGRESSIVE RANDOM EFFECTS WITH APPLICATION TO JAPANESE DIFFUSION INDEX","269726448":"Bayesian structured additive distributional regression for multivariate responses","48906254":"マーケティング・サイエンスにおける離散選択モデルの展望","40867978":"A Latent Variable Approach to Multivariate Quantitative Trait Loci","262323524":"Credit Rating Change Modeling Using News and Financial Ratios","223643580":"A Bayesian approach to the spatial representation of market structure from consumer choice data","228454261":"Causal effects from panel data in randomized experiments with partial compliance","237311183":"for Motherhood in West Germany after 1945 - A Comparative Analysis of Cohorts Born in 1934-1971","223936435":"153 O - In vitro electromotive administration of mitomycin C in human bladder wall","228454262":"Calculating Causal Effects from Panel Data in Eligibility Designs","281084461":"Nonparametric Bayesian Models With Focused Clustering for Mixed Ordinal and Nominal Data","268274960":"ACCOUNTING FOR SPACE IN INTRAMETROPOLITAN HOUSEHOLD LOCATION CHOICES","26901365":"Bayesian methods in bioinformatics","228562796":"An Accept-Reject Algorithm For the Positive Multivariate Normal Distribution","259372419":"Political Ambition and Legislative Behavior in the European Parliament","234137346":"On a multivariate log-gamma distribution and the use of the distribution in the Bayesian analysis","24064919":"Classical and Modern Business Cycle Measurement: The European Case","4854451":"Program evaluation as a decision problem","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","44654672":"A Bayesian Two‐Part Latent Class Model for Longitudinal Medical Expenditure Data: Assessing the Impact of Mental Health and Substance Abuse Parity","277291643":"The Bayesian Elastic Net: Classifying . . .","251735551":"Discrete Choice Modeling for Transportation","257404328":"Probabilistic and discriminative group-wise feature selection methods for credit risk analysis","4991821":"Returns to Schooling and Bayesian Model Averaging: A Union of Two Literatures","4756297":"Model-Based Clustering of Multiple Time Series","279458734":"Leave Pima Indians alone: binary regression as a benchmark for Bayesian computation","3550001":"CAD and performance of the ultrawide-band GaAs FET amplifiers","51490843":"Multiclass Sparse Bayesian Regression for fMRI-Based Prediction","223643230":"Nonparametric function estimation subject to monotonicity, convexity and other shape constraints","232005343":"Congressional Decision Making and the Separation of Powers","4746051":"Predictive Variable Selection in Generalized Linear Models","23642723":"Modeling conditional dependence between tests: A multiple latent variable model","227323523":"Parametric Link Modification of Both Tails in Binary Regression","228337292":"Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection","246959532":"A Bayesian MultiLevel Factor Analytic Model of Consumer Price Sensitivities Across Categories","281963480":"Analysis of Job Satisfaction: The Case of Japanese Private Companies","238656814":"Large-Scale Bayesian Logistic Regression for Text Cat egorization","228834996":"The analysis of bayesian probit regression of binary and polychotomous response data","49709550":"Association of Modifiable and Nonmodifiable Factors with Vitamin D Status in Pregnant Women and Neonates in Oakland, CA","11248562":"Generalizing a neuropsychological model of visual categorization to auditory categorization of vowels","220870195":"Model the Relationship Between Gene Expression and TFBSs Using a Simplified Neural Network with Bayesian Variable Selection.","228642491":"Spatially Adaptive Bayesian Penalized Regression Splines (P-splines)","259824743":"Clustering South African Households Based on their Asset Status Using Latent Variable Models","243043681":"A Bayesian Approach for Nonlinear Structural Equation Models With Dichotomous Variables Using Logit and Probit Links","285463070":"Bayesian longitudinal item response modeling with restricted covariance pattern structures","242077043":"Learning About Unobserved Heterogeneity in Returns to Schooling1","4899669":"Bayesian computation for logistic regression","26899129":"Wavelet methods and statistical applications: network security and bioinformatics","229025410":"“Bayesian Analysis for Political Research","226713254":"Accelerating Monte Carlo Markov Chain Convergence for Cumulative-Link Generalized Linear Models","243043673":"Bayesian Analysis of Structural Equation Model With Fixed Covariates","271590170":"A Bayesian approach for the analysis of triadic data in cognitive social structures","223841917":"Model Uncertainty and Race and Gender Heterogeneity in the College Entry Decision","228095667":"Bayesian Efficient Multiple Kernel Learning","280685457":"Program evaluation as a decision problem. J Econom 125(1-2):141-173","227442339":"A Choice Model with Conjunctive, Disjunctive, and Compensatory Screening Rules","274094950":"Bayesian Model Choice in Cumulative Link Ordinal Regression Models","5090173":"Firm Innovation Strategies: a Spatial Cohort Multinomial Probit Approach","5155708":"Multiparty Electoral Competition in the Netherlands and Germany: A Model Based on Multinomial Probit.","23650908":"Effect of the threshold nature of traits on heritability estimates obtained by linear model","270594839":"A Common Jump Factor Stochastic Volatility Model","49625549":"Analysis of large truck crash severity using heteroskedastic ordered probit models","251776057":"A Plasma NH3process to improve the reliability of 0.35μm P+Poly-gate nitrided oxide P-MOSFET\u0027s","228198048":"Voter Choice in a New Democracy: The 2006 Mexican Presidential Election","4914039":"Modelling the Evolution of Distributions: An Application to Major League Baseball","223577619":"A Bayesian propensity score adjustment for latent variable modeling and MCMC algorithm","228972260":"Bayesian analysis of structural changes: Historical changes in US presidential uses of force abroad","228452060":"Secure Bayesian model averaging for horizontally partitioned data","225838644":"Univariate Bayesian nonparametric binary regression with application in environmental management","23743016":"Time Series Modeling with Duration Dependent Markov-Switching Vector Autoregressions: MCMC Inference, Software and Applications","222238330":"Business Cycle Durations","257756184":"Semiparametric Bayesian joint modeling of a binary and continuous outcome with applications in toxicological risk assessment","13261708":"Applying Bayesian Ideas to the Development of Medical Guidelines","260838602":"How Large is Congressional Dependence in Agriculture? Bayesian Inference about ‘Scale’ and ‘Scope’ in Measuring a Spatial Externality","222840335":"Combining feature spaces for classification","237258083":"A Thesis Presented to The Academic Faculty","51527765":"DPpackage: Bayesian Non- and Semi-parametric Modelling in R.","47278489":"Approximation of conditional densities by smooth mixture of regressions","280970227":"Bayesian Variable Selection with Structure Learning: Applications in Integrative Genomics","283677604":"Bayesian Analysis of Curves Shape Variation Through Registration and Regression","1903443":"Variational Inference for Large-Scale Models of Discrete Choice","244100546":"Gene expression analysis: Joint feature selection and classifler design","23652902":"Average Causal Effects From Nonrandomized Studies: A Practical Guide and Simulated Example","2636665":"Long-Lead Prediction of Pacific SSTs via Bayesian Dynamic Modeling","221775465":"Hierarchical Bayesian formulations for selecting variables in regression models","4852510":"Kalman filtering with truncated normal state variables for Bayesian estimation of macroeconomic models","23550515":"Determinants of a digital divide in Sub-Saharan Africa : a spatial econometric analysis of cell phone coverage","254610553":"Bayesian inference in modeling recreation demand","242447653":"Statutory Battles and Constitutional Wars: Congress and the Supreme Court","227548871":"Bayesian inference strategies for the prediction of genetic merit using threshold models with an application to calving ease scores in Italian Piemontese cattle","262841597":"The analysis of vehicle crash injury-severity data: A Markov switching approach with road-segment heterogeneity","255577186":"BAYESIAN METHODS TO IMPUTE MISSING COVARIATES FOR CAUSAL INFERENCE AND MODEL SELECTION","227366615":"Improving the Nutrient Content of Food through Genetic Modification: Evidence from Experimental Auctions on Consumer Acceptance","24031797":"Bayesian nonparametric functional analysis through density estimation","227548875":"To simulate or NOMINATE?","263580910":"Inferring constructs of effective teaching from classroom observations: An application of Bayesian exploratory factor analysis without restrictions","24095282":"Alternative Computational Approaches to Inference in the Multinomial Probit Model","4991761":"The Multinomial Probit Model Revisited: A Discussion of Parameter Estimability, Identification and Specification Testing","4776747":"Forecasting manufacturing output growth using firm-level survey data’, The Manchester School 73","51384438":"Item Factor Analysis: Current Approaches and Future Directions","243043604":"A Bayesian Approach for Analyzing Hierarchical Data With Missing Outcomes Through Structural Equation Models","227352295":"Characteristics of innovating firms in Tunisia: The essential role of external knowledge sources","4862758":"Women, work, and motherhood: changing employment penalties for motherhood in West Germany after 1945 - a comparative analysis of cohorts born in 1934-1971","230794925":"Bayesian variable selection for spatially dependent generalized linear\nmodels","228923080":"Capturing patterns of spatial and temporal autocorrelation in ordered response data, using a Bayesian approach: A case study of land use changes in Austin, …","4723493":"On the Predictive Distributions of Outcome Gains in the Presence of an Unidentified Parameter","230663890":"Econometric Analysis of Stated-Preference Experiments Constructed from Revealed-Preference Choices","255173723":"Efficient Data Augmentation in Dynamic Models for Binary and Count Data","2401108":"Dynamic Ideal Point Estimation Via Markov Chain Monte Carlo for the U.S. Supreme Court, 1953–1999","282764200":"Socioeconomic Factors Affecting Intensity of Market Participation among Smallholder Yam-Based System Farmers in Oyo North Area of Nigeria","10615762":"Kilpikari R, Sillanpää MJ. Bayesian analysis of multilocus association in quantitative and qualitative traits. Genet Epidemiol 25: 122-135","45130179":"The Decline in German Output Volatility: A Bayesian Analysis","27710162":"Discussion of the paper “ANOVA: Why it is more important than ever” by Andrew Gelman.","23755284":"Determinants and Costs of Current Account Reversals under Heterogeneity and Serial Correlation","282520488":"A Logistic Regression Model with a Hierarchical Random Error Term for Analyzing the Utilization of Public Transport","236203414":"Bayesian Inference for Logistic Regression Models Using Sequential Posterior Simulation","253836451":"A Model for Statistical Inference based on Mixed Mode Interviewing","220286627":"Bayesian fractional polynomials","227692049":"Bagehot or Bailout? An Analysis of Government Responses to Banking Crises","259091700":"Consumer Response to Package Downsizing: Evidence from the Chicago Ice Cream Market","4719567":"Analyzing Ultimatum Bargaining: A Bayesian Approach to the Comparison of Two Potency Curves Under Shape Constraint","228701737":"Losing Muslim Hearts and Minds: Religiosity, Elite Competition, and Anti-Americanism in the Islamic World","237639072":"Diagnostic Scores Augmented Using Multidimensional Item Response Theory: Preliminary Investigation of MCMC Strategies","23644900":"Non-parametric kernel regression for multinomial data","220286636":"Semi-parametric analysis of multi-rater data","227442179":"The “Shopping Basket.” A Model for Multi-Category Purchase Incidence Decisions","23743205":"Bayesian Analysis of Multivariate Probit Models","271412130":"Consideration sets, intentions and the inclusion of ?don\u0027t know? in a two-stage model for voter choice","269415297":"A Bayesian Multinomial Probit MODEL FOR THE ANALYSIS OF PANEL CHOICE DATA","37632430":"Bayesian Nonparametrics","220286640":"Jim Albert: Bayesian computation with R.","26898952":"Bayesian models for DNA microarray data analysis","4914136":"Gibbs Sampling for Bayesian Non-Conjugate and Hierarchical Models by Using Auxiliary Variables","259171552":"A Bayesian spatial model with auxiliary covariates to assess and adjust nonignorable nonresponse","5155805":"Modeling Simultaneity in Survey Data","277961477":"High precipitation and seeded species competition reduce seeded shrub establishment during dryland restoration","221288100":"Iterative Node Deployment in an Unknown Environment.","222944989":"Bayesian analysis of the ordered probit model with endogenous selection","237823416":"Bayesian Inference Via Variational Approximations","228744759":"Incorporating pro-environmental preferences toward green automobile technologies through a Bayesian Hybrid Choice Model","259548384":"Estimation of State-Space Models with Endogenous Markov Regime Switching Parameters","267715695":"SOME ADVANCES IN BAYESIAN NONPARAMETRIC MODELING","243764509":"Marginal likelihood from the Gibbs output. J Am Stat Assoc","24083189":"Predicting adverse infant health outcomes using routine screening variables: Modelling the impact of interpendent risk factors","251579747":"Making Strategic Connections: Stimulative Policies for a Dynamic Network","32895595":"2001 Lawrence R. Klein lecture: estimating distributions of treatment effects with an application to the returns to schooling and measurement of the effects of uncertainty on college choice","258229444":"Flexible Bayesian Human Fecundity Models","282295155":"Variational methods for fitting complex Bayesian mixed effects models to health data","12137245":"Anxiolytic-antidepressant activity of Withania somnifera glycowithanolides: An experimental study","223682291":"Beta-MPT: Multinomial processing tree models for addressing individual differences","5155817":"Bayesian estimation of multivariate-normal models when dimensions are absent","5155814":"Closed-form Bayesian inferences for the logit model via polynomial expansions","228355639":"Analysis of Additive Instrumental Variable Models","5155811":"Modeling preference evolution in discrete choice models: A Bayesian state-space approach","227825210":"An analysis of hatching success in the Great Reed Warbler Acrocephalus arundinaceus","262386701":"Use of robust multivariate linear mixed models for estimation of genetic parameters for carcass traits in beef cattle","235296183":"MCMC perspectives on simulated likelihood estimation","8995646":"Fine-Scale Mapping of Disease Genes with Multiple Mutations via Spatial Clustering Techniques","253873305":"Bayesian Approach to Zero-Inflated Ordered Probit Model (Preliminary; Please do not cite)","267461704":"Basic and Advanced Bayesian Structural Equation Modeling: With Applications in the Medical and Behavioral Sciences","4895728":"Bayesian model determination for binary-time-series data with applications","41152968":"Bayesian Structural Equations Modeling for Ordinal Response Data with Missing Responses and Missing Covariates","227370546":"Market timing under multiple economic regimes","37675393":"Model Selection and Multivariate Inference Using Data Multiply Imputed for Disclosure Limitation and Nonresponse","1917916":"A theoretical comparison of the data augmentation, marginal augmentation and PX-DA algorithms","251444536":"Bayesian Inference in the Sample Selection and Two-Part Models","2468833":"On Bayesian Analysis Of Multi-Rater Ordinal Data: An Application To Automated Essay Grading","225844914":"Multiparty Electoral Competition in the Netherlands and Germany: A Model Based on Multinomial Probit","8905536":"Mapping Multiple Quantitative Trait Loci for Ordinal Traits","220286697":"Analyzing space-time sensor network data under suppression and failure in transmission","228910702":"A Bayesian Probit Model with Spatial Dependencies","232396304":"A new formulation of stress–strength reliability in a regression setup","5045127":"Business Cycle Turning Points: Two Empirical Business Cycle Model Approaches","4719491":"Exact Structural Inference in Optimal Job-Search Models","228869736":"A Bayesian random effects model for survival probabilities after Acute Myocardial Infarction","227540545":"Signals from the Tenth Justice: The Political Role of the Solicitor General in Supreme Court Decision Making","1919954":"Demystifying Double Robustness: A Comparison of Alternative Strategies for Estimating a Population Mean from Incomplete Data","4791195":"What are the Advantages of MCMC Based Inference in Latent Variable Models?","245030222":"PUMA: A Unified Framework for Penalized Multiple Regression Analysis of GWAS Data","237417982":"Medidas de Pol´ itica Monet´ aria e a Func ¸ ˜ ao de Reac ¸ ˜ ao do Banco Central no Brasil","228150854":"Estimating SEM with Ordinal Data and Scale Usage Heterogeneity","2323395":"The Eect of Priors on Approximate Bayes Factors from MCMC Output","262157377":"Rejoinder – An approach for identifying and predicting economic recessions in real-time using time–frequency functional models","12614434":"Accounting for unreported and missing intercourse in human fertility studies","4744107":"Are Points in Tennis Independent and Identically Distributed? Evidence From a Dynamic Binary Panel Data Model","225146509":"A Gibbs sampler for mixed logit analysis of differentiated product markets using aggregate data","259550353":"A Unifying Framework for Marginalised Random-Intercept Models of Correlated Binary Outcomes","232918543":"LOGICOIL - Multi-state prediction of coiled-coil oligomeric state","23184016":"Developments in statistical analysis in quantitative genetics","277742459":"Essays on the Bayesian Inequality Restricted Estimation","227442297":"Massively Categorical Variables: Revealing the Information in Zip Codes","226055822":"Exact Inference Using Variable Integrating Constant Importance Distributions","228984414":"Bayesian modeling of mortgage prepayment rates","241143207":"Bayesian Methods for Function Estimation","40026522":"Bayesian variable selection for disease classification using gene expression data","228449895":"Hierarchically Supervised Latent Dirichlet Allocation","227442293":"Measuring Heterogeneous Reservation Prices for Product Bundles","222539455":"‘Tropical deforestation in Madagascar: Analysis using hierarchical, spatially explicit Bayesian regression models’","1919968":"Rejoinder: Demystifying Double Robustness: A Comparison of Alternative Strategies for Estimating a Population Mean from Incomplete Data","5473196":"Girolami, M.: Probabilistic multi-class multi-kernel learning: On protein fold recognition and remote homology detection. Bioinformatics 24(10), 1264-1270","40023651":"Assessing Toxicities in a Clinical Trial: Bayesian Inference for Ordinal Data Nested within Categories","24063342":"Bayesian analysis of order-statistics models for ranking data","6450275":"Association Mapping via Regularized Regression Analysis of Single-Nucleotide–Polymorphism Haplotypes in Variable-Sized Sliding Windows","245576354":"Weak Convergence of Markov Chain Monte Carlo Methods and its Application to Regular Gibbs Sampler","228909472":"Climbing the Drug Staircase: An Analysis of Accessibility, Proneness and Previous Cannabis Use on the Initiation of Hard Drug Use","257762137":"Who performs a stronger response to whom? Detecting individual competitive actions and reactions","227361163":"Forecasting macro variables with a Qual VAR business cycle turning point index","273685591":"A Bayesian Approach for the Identification of Genes and Gene-level SNP Aggregates in a Genetic Analysis of Cancer Data","247503560":"The Multigroup Multilevel Categorical Latent Growth Curve Models","46532303":"Analyzing the Swiss Business Cycle","220055830":"Data augmentation strategies for the Bayesian spatial probit regression model","8504460":"Genetic Parameters for Stillbirth in Danish Holstein Cows Using a Bayesian Threshold Model","266623977":"Non-proportional odds multivariate logistic regression of ordinal family data","259517304":"Heterogeneity and emotions in the valuation of non-use damages caused by oil spills","41823857":"Photoacoustic discrimination of vascular and pigmented lesions using classical and Bayesian methods","23752058":"Exploring Network Effects of Point-to-Point Networks: An Investigation of the Spatial Entry Patterns of Southwest Airlines","264168364":"Korean Welfare Panel Data: A Computational Bayesian Method for Ordered Probit Random Effects Models","228729271":"DDMSVAR for Ox: a Software for Time Series Modeling with Duration Dependent Markov-Switching Vector Autoregressions","24063352":"Bayesian factor analysis for multilevel binary observations","279905463":"Bayesian estimation of limited dependent variable spatial autoregressive models","224940402":"Predicting treatment efficacy via quantitative magnetic resonance imaging: A Bayesian joint model","2538552":"Adaptive Sparseness Using Jeffreys Prior","228813245":"Convergence Failures in Logistic Regression","282240204":"Identifying oncogenes as features for clinical cancer prognosis by Bayesian nonparametric variable selection algorithm","251800354":"Default Priors and Ecien t Posterior Computation in Bayesian Factor Analysis","238864925":"Bayesian estimation of the polychoric correlation coefficient","45274768":"Detection of Viruses Via Statistical Gene Expression Analysis","267963355":"Spatial diffusion and adoption determinants of European agri-environmental supports related to extensive grazing in France","226392413":"The Economics of Non-Market Goods and Resources","227369384":"Rao-Blackwellization for Bayesian Variable Selection and Model Averaging in Linear and Binary Regression: A Novel Data Augmentation Approach","272194591":"Functional Gaussian Process Model for Bayesian Nonparametric Analysis","242997843":"Preserving data utility via BART","244953776":"A Comparison of Hierarchical Bayes and Maximum Simulated Likelihood for Mixed Logit","24063302":"A Bayesian Random Effects Model for Testlets","222828898":"Modeling and calculating the effect of treatment at baseline from panel outcomes","230859240":"Real-Time Semiparametric Regression","227606975":"Bayesian Estimation of Dynamic Discrete Choice Models","262830980":"Computational Bayesian Statistics in Transportation Modeling: From Road Safety Analysis to Discrete Choice","288918806":"Identifying key drivers and bottlenecks in the adoption of E-book readers in Korea","264958949":"Regression: Models, Methods and Applications","8623282":"Threshold-linear analysis of measures of fertility in artificial insemination data and days to calving in beef cattle","7773253":"Multilevel IRT using dichotomous and polytomous items","237308433":"REALCOM: methodology for realistically complex multilevel modelling Training materials manual","247837425":"A Hierarchical Bayes Model for Assortment Choice","24001881":"Bayesian Variable Selection with Joint Modeling of Categorical and Survival Outcomes: An Application to Individualizing Chemotherapy Treatment in Advanced Colorectal Cancer","237283868":"Max-Planck-Institut für demografische Forschung Max Planck Institute for Demographic Research Konrad-Zuse-Strasse 1 · D-18057 Rostock · GERMANY","46438141":"Estimation of Sample Selection Models With Two Selection Mechanisms","220055844":"A note on mean-field variational approximations in Bayesian probit models","265579496":"A BAYESIAN ANALYSIS OF ENDOGENOUS SWITCHING MODELS FOR COUNT DATA","261673892":"Accounting for uncertainty in willingness to pay for environmental benefits","39181928":"Preferencias imprecisas y contexto en la valoración de la salud","7605321":"Estimation of the false negative fraction of a diagnostic kit through Bayesian regression model averaging","4914292":"Convergence rates and asymptotic standard errors for Markov chain Monte Carlo algorithms for Bayesian probit regression","220320097":"Bayesian Generalized Kernel Models.","251626175":"9319 POSTER A Regional Review of Outcomes of Systemic Therapy in Patients With Metastatic Malignant Melanoma","221661557":"Wiki Surveys: Open and Quantifiable Social Data Collection","257338133":"Maximum likelihood estimation of multinomial probit factor analysis models for multivariate t-distribution","260012860":"Spatial Autoregressive Models with Unknown Heteroskedasticity: A Comparison of Bayesian and Robust GMM Approach","228426202":"Parametric Discrete Choice Models Based on the Scale Mixtures of Multivariate Normal Distributions (running title: Parametric Discrete Choice Models)","247837327":"Multivariate Analysis of Multiple Response Data","227369415":"Variational Bayesian Inference for Parametric and Nonparametric Regression With Missing Data","227598811":"Sampling schemes for generalized linear Dirichlet process random effects models","264291212":"How Many Countries for Multilevel Modeling? A Comparison of Frequentist and Bayesian Approaches","46530187":"Bayesian estimation of a random effects heteroscedastic probit model","6777896":"Bayesian analysis of structural equation models with multinomial variables and an application to type 2 diabetic nephropathy","221530471":"Joint classifier and feature optimization for cancer diagnosis using gene expression data","257800974":"Ecological Prediction With Nonlinear Multivariate Time-Frequency Functional Data Models","51507012":"Reconciling multiple data sources to improve accuracy of large-scale prediction of forest disease incidence","247837331":"Model of Brand Choice with a No-Purchase Option Calibrated to Scanner-Panel Data","262331380":"An approach for identifying and predicting economic recessions in real-time using time–frequency functional models","228753909":"Bayesian Inference for Discrete Mixed Graph Models: Normit Networks, Observable Independencies and Infinite Mixtures","228452810":"Endogenous Jurisprudential Regimes","2696305":"Bayesian Methods for Cumulative, Sequential and Two-Step Ordinal Data Regression Models. Technical Report","235764308":"Does the effect of micronutrient supplementation on neonatal survival vary with respect to the percentiles of the birth weight distribution?","262579196":"Explaining Return Times for Wildfires","223781130":"A Bayesian dichotomous model with asymmetric link for fraud in insurance","279633140":"Bayesian Additive Regression Trees using Bayesian Model Averaging","221346158":"Quadratically gated mixture of experts for incomplete data classification","228454909":"Educational attainment and labor market outcomes: estimating distributions of the returns to educational interventions","233335177":"Probit and Logit Model Selection","228315646":"An Alternative Bayesian Approach to Structural Breaks in Time Series Models","278318323":"Bayesian Analysis of Treatment Effect Models","277196003":"Posterior predictive model checking for multidimensionality in item response theory and Bayesian networks","46450348":"Regionality Revisited: An Examination of the Direction of Spread of Currency Crisis","4758562":"Assessing the role of option grants to CEOs: How important is heterogeneity?","260289516":"Cross-Domain Multitask Learning with Latent Probit Models","241074734":"C-Section Numbers Unaffected by Fetal Pulse Oximetry","267391872":"A Bayesian spatial probit estimation of Free Trade Agreement contagion","258845468":"An assessor-specific Bayesian multi-threshold mixed model for analyzing ordered categorical traits in tree breeding","4969529":"Measuring legal systems","228352488":"An Introduction to Bayesian Inference via Variational Approximations","51871587":"Objective Bayes Model Selection in Probit Models","242524673":"BAYESIAN MODELS AND MACHINE LEARNING WITH GENE EXPRESSION ANALYSIS APPLICATIONS","2442323":"Monte Carlo Estimation of Bayesian Credible and HPD Intervals","278332641":"A Constructive Spatio-Temporal Approach to Modeling Spatial Covariance","2470994":"A general class of hierarchical ordinal regression models with applications to correlated ROC analysis","227789291":"A Multithreshold Model for Sensory Analysis","230613444":"Genetic parameters for paratuberculosis infection and effect of infection on production traits in Israeli Holsteins","235399805":"Model Feedback in Bayesian Propensity Score Estimation","228862425":"Crash Injury Severity Analysis Using Bayesian Ordered Probit Models","241722088":"The Notion of \"Composite Reliability\" and Its Hierarchical Bayes Estimation","240382675":"Longitudinal analysis of clinical mastitis at different stages of lactation in Norwegian Cattle","220055964":"Model selection in binary and tobit quantile regression using the Gibbs sampler","262822699":"DSGE Models with Student-t errors","267027304":"Semi-parametric Selection Models for Potentially Non-ignorable Attrition in Panel Studies with Refreshment Samples","24063469":"On the Use of Heterogeneous Thresholds Ordinal Regression Models to Account for Individual Differences in Response Style","13550666":"Bayesian Analysis of Twinning and Ovulation Rates Using a Multiple-Trait Threshold Model and Gibbs Sampling","6874348":"A multivariate model for ordinal trait analysis. Heredity","263353142":"Estimation methods for multivariate Tobit confirmatory factor analysis","265073481":"Understanding Emotional Impact of Images Using Bayesian Multiple Kernel Learning","237597359":"Gibbs Sampling for a Duration Dependent Markov Switching Model with an Application to the U.S. Business Cycle","47160901":"Bayesian analysis of calving ease score and birth weights","242518776":"The Bayesian Elastic Net: Classifying MultiTask Gene-Expression Data","256484293":"Genetic parameters for clinical mastitis in Holstein-Friesians in the United Kingdom: A Bayesian analysis","2649254":"Markov Switching Time Series Models with Application to a Daily Runoff Series","46546505":"Estimation of Taiwan’s binary monetary policy reaction function","272678097":"Policy Tool Bundling: Predicting the Selection and Impact of Policy Instruments Using Bayesian Methods Policy Tool Bundling: Predicting the Selection and Impact of Policy Instruments Using Bayesian Methods","228811058":"Changepoint Analysis of Binary and Ordinal Probit Models: An Application to Bank Rate Policy Under the Interwar Gold Standard","44676671":"Localizing Putative Markers in Genetic Association Studies by Incorporating Linkage Disequilibrium into Bayesian Hierarchical Models","267561834":"Predictive Alternatives in Bayesian Model Selection","2403516":"The Dimensions of Supreme Court Decision Making: Again Revisiting The Judicial Mind","23508476":"The Double Hurdle Model in the Presence of Fixed Costs","24104436":"Demand Estimation With Heterogeneous Consumers and Unobserved Product Characteristics: A Hedonic Approach.","13474897":"Bayesian Analysis via Gibbs Sampling of Susceptibility to Intramammary Infection in Holstein Cattle","268282722":"Hierarchical Bayesian Model for Rare Variant Association Analysis Integrating Genotype Uncertainty in Human Sequence Data","4855018":"Analysis of treatment response data without the joint distribution of potential outcomes","259285972":"Comparing Small- and Large-Scale Models of Multicategory Buying Behavior","247728741":"Comparing Multiunidimensional and Unidimensional Item Response Theory Models","281240673":"Cascaded H-Bridge Multilevel Inverter System Fault Diagnosis Using a PCA and Multiclass Relevance Vector Machine Approach","286481841":"Bayesian Estimation with Combined Empirical Prior Distribution for a Multinomial Logit Model","266865483":"A Hierarchical Bayes Approach to a Study of Hospital Variation in Surgical Procedures","2397315":"Bayesian Semiparametric Regression Analysis of Multicategorical Time-Space Data","228626697":"Sequential Monte Carlo for Bayesian Computation","2612365":"Bayesian Estimation and Model Choice in Item Response Models","13765753":"Bayesian Inference of Variance Components for Litter Size in Rasa Aragonesa Sheep","228622607":"Gene expression-based glioma classification using hierarchical Bayesian Vector machines","26631460":"On biased inferences about variance components in the binary threshold model","259580874":"Bayesian dynamic probit models for the analysis of longitudinal data","253565866":"A Conjoint Approach to Multipart Pricing","279464976":"Adoption of Certified Organic Production: Evidence from Mexico","262968086":"Designing observational biologging studies to assess the causal effect of instrumentation","230840697":"Kärkkäinen HP, Sillanpää MJ.. Robustness of Bayesian multilocus association models to cryptic relatedness. Ann Hum Genet 76: 510-523","24063440":"Model comparison of nonlinear latent variables models with fixed covariates","228131161":"Strategic and Financial Bidders in Takeover Auctions","4744329":"Marginal Likelihood From the Metropolis-Hastings Output","254184418":"Some observations on the definition and estimation of effect sizes","51709904":"Bayesian Multitask Classification With Gaussian Process Priors","260305733":"Multilevel factor analytic models for assessing the relationship between nurse-reported adverse events and patient safety","226826572":"Data Augmentation and MCMC for Binary and Multinomial Logit Models","4729985":"Markov Chain Monte Carlo Simulation Methods in Econometrics","2469097":"An Alternative to Traditional GPA for Evaluating Student Performance","267979573":"Spatio-temporal regression on compositional covariates: modeling vegetation in a gypsum outcrop","257016705":"Bayesian multi-regime smooth transition regression with ordered categorical variables","41453225":"A Note on the Existence of the Posteriors for One-way Random Effect Probit Models.","230594927":"Experience from the post-test analysis of MEGAPIE","267971370":"Strategy for Modelling Nonrandom Missing Data Mechanisms in Observational Studies Using Bayesian Methods","243042991":"Modeling a mixture of ordinal and continuous repeated measures","5139610":"Bayesian Estimation of Discrete Duration Models","24063419":"A MCMC-method for models with continuous latent responses","222431638":"Parametric Links for Binary Choice Models: a Fisherian–Bayesian Colloquy","2632957":"Bayesian Residual Analysis For Binary Response Regression Models","226627927":"Data augmentation, frequentist estimation, and the Bayesian analysis of multinomial logit models","277298256":"Spatial Econometrics","5139609":"A Dynamic Multinomial Probit Model for Brand Choice with Different Long-Run and Short-Run Effects of Marketing Mix Variables","6417593":"Inter-rater reliability of pressure ulcer staging: Ordinal probit Bayesian hierarchical model that allows for uncertain rater response","24063413":"Analysis of structural equation model with ignorable missing continuous and polytomous data","4893841":"The Impact of Feature Advertising on Customer Store Choice","2807030":"Generalized Nonlinear Modelling With Multivariate Smoothing Splines.","228096327":"The Indexing of the SDSS Science Archive","268325663":"Symmetric Bayesian Multinomial Probit Models","251462175":"27 The Bayesian Approach to Experimental Data Analysis","264956713":"Multiple Imputation And Its Application","26631538":"Mixed effects linear models with t-distributions for quantitative genetic analysis: A Bayesian approach","222695842":"A Hierarchical Bayes Model of Choice between Supermarket Formats","242612883":"I may throw you out. Come to our organizational meeting prepared to choose your topic. Before our organizational meeting read (Sims lecture should help you choose)","26631536":"Attenuating effects of preferential treatment with Student-t mixed linear models: A simulation study","228008305":"The Monetary Policy Reaction Function for Taiwan: A Narrative Approach","1754364":"Construction of weakly CUD sequences for MCMC sampling","4746415":"Bayesian Modeling of Markers of Day-Specific Fertility","266083126":"Influence of artificial food provisioning from fisheries on killer whale reproductive output","35481334":"Major gene detection for fusiform rust resistance using segregation analysis and linkage analysis in loblolly pine [electronic resource] /","24063363":"A Bayesian analysis of finite mixtures in the LISREL model","23772551":"AJAE Appendix: Utility in Willingness to Pay Space: A Tool to Address Confounding Random Scale Effects in Destination Choice to the Alps","266076978":"Ordinal Data Models","223877558":"Some aspects of the history of Bayesian information processing","268024598":"Selection of Important Metabolites Using a Bayesian Hierarchical Model","6808712":"Multi-class cancer classification using multinomial probit regression with Bayesian gene selection","8111240":"Bayesian latent variable models for mixed discrete outcomes","238508738":"BAYESIAN ADDITIVE REGRESSION KERNELS","12837942":"Threshold-Linear Versus Linear-Linear Analysis of Birth Weight and Calving Ease Using an Animal Model: I. Variance Component Estimation","234043652":"A Modular Mind? A Test Using Individual Data from Seven Primate Species","237562591":"Existence of the MLE and propriety of posteriors for a general multinomial choice model 1 Running head: Multinomial choice models","33683192":"Analyse d\u0027événement et dépendances temporelles des rentabilités boursières","44688978":"Joint modeling of performance and subjective reporting to assess sensitivity to drug-induced sleepiness","284165131":"Generalizing boundaries for triangular designs, and efficacy estimation at extended follow-ups","227369331":"Probabilistic Weather Forecasting for Winter Road Maintenance","260535161":"Bayesian Supervised Dimensionality Reduction","5156172":"The Practice Boundaries of Advanced Practice Nurses: An Economic and Legal Analysis","4998479":"European Business Cycles: New Indices and Analysis Of Their Synchronicity","7501172":"A method for predicting disease subtypes in presence of misclassification among training samples using gene expression: application to human breast cancer","273149248":"Addressing Missing Data in Patient-Reported Outcome Measures (PROMS): Implications for the Use of PROMS for Comparing Provider Performance","230705351":"Comparing multi-unidimensional and unidimensional IRT models","46583745":"A mixed effect model for longitudinal relational and network data, with applications to international trade and conflict","24065127":"The Analysis of Ordered Categorical Data: An Overview and a Survey of Recent Developments","227528838":"Dynamic Limited Dependent Variable Modeling and U.S. Monetary Policy","253286932":"Estimation and Model Choice in Nonparametric Additive Regression","222691402":"Chapter 16 Leading Indicators","44130220":"Bayesian Dynamic Panel-Ordered Probit Model and Its Application to Subjective Well-Being","45932460":"Bayesian Model Selection for Beta Autoregressive Processes","272819538":"Inference on mode preferences, vehicle purchases, and the energy paradox using a Bayesian structural choice model","261649033":"Bayesian Variable Selection and Model Averaging in High-Dimensional Multinomial Nonparametric Regression","254947873":"Bargaining and the Nature of War","2334007":"Bayesian Smoothing of Histograms","7183737":"Bayesian Variable Selection for Gene Expression Modeling With Regulatory Motif Binding Sites in Neuroinflammatory Events","259510883":"Efficient estimation of the link function parameter in a robust Bayesian binary regression model","24079482":"Using simulation methods for bayesian econometric models: inference, development and communication: some comments","277693848":"Identification and MCMC Estimation of Bivariate Probit Models with Partial Observability","46434258":"Incorporating responsiveness to marketing efforts in brand choice modelling","24079480":"Using Simulation Methods for Bayesian Econometric Models","243102565":"Modelling transport mode decisions using hierarchical logistic regression models with spatial and cluster effects","225941615":"Preference Heterogeneity and Willingness to Pay for Travel Time Savings","41910119":"Outlier detection for a hierarchical Bayes model in a study of hospital variation in surgical procedures","263029428":"Bayesian Analysis of binary panel probit models: the case of measurement error and missing values in explaining factors, NEPS Working Paper Series","262578879":"Performances of Bayesian model selection criteria for generalized linear models with non-ignorably missing covariates","262150841":"Combining information from two data sources with misreporting and incompleteness to assess hospice-use among cancer patients: A multiple imputation approach","48183237":"Bayesian Nonparametric Covariance Regression","238658338":"Modelos para Dados Categoricos com Estrutura Temporal","223594572":"Variable selection in qualitative models via an entropic explanatory power","226478174":"Markov Chain Monte Carlo","43098032":"Dental caries analysis in 3–5 years old children: A spatial modelling","2352391":"Evaluation in Multi-Site Programs","257553021":"Partially Adaptive Estimation of Interval Censored Regression Models","4986217":"Assessing Heterogeneity in Discrete Choice Models Using a Dirichlet Process Prior","24128600":"Bayesian Sampling Algorithms for the Sample Selection and Two-Part Models","4783456":"Is a Voluntary Approach An Effective Environmental Policy Instrument? A Case for Environmental Management Systems","261253819":"A Latent Gaussian Process Model with Application to Monitoring Clinical Trials","222752877":"A Monte Carlo EM method for estimating multinomial probit models","260026964":"Bayesian hierarchical age-period-cohort models with time-structured effects: An application to religious voting in the US, 1972–2008","224839754":"Explaining the Gibbs sampler. Am Stat","5184895":"Demand Estimation With Heterogenous Consumers and Unobserved Product Characteristics: A Hedonic Approach. Working Paper","24083551":"The most-cited statistical papers","29664501":"Dynamic Segmentation using Markov-Switching Model","239059726":"The Econometric Approach to Efficiency Analysis","26631335":"Estimation of variance components of threshold characters by marginal posterior modes and means via Gibbs Sampling","227705002":"Univariate and multirater ordinal cumulative link regression with covariate specific cutpoints","4263291":"An Assessment of Alternative Strategies for Constructing EMD-Based Kernel Functions for Use in an SVM for Image Classification","265122545":"Application of Sparse Bayesian Generalized Linear Model to Gene Expression Data for Classification of Prostate Cancer Subtypes","40822609":"A Comparison of Bayesian and Sampling Theory Inferences in a Probit Model","261761701":"A Fully Nonparametric Modeling Approach to Binary Regression","237204322":"When and Why Democracies Consolidate: Coups, Incumbent Takeovers, and Democratic Survival","267424434":"Multivariate multilevel latent Gaussian process model to evaluate wetland condition","283954607":"A Bayesian Approach to Demand Estimation","255668857":"Lecture 3: Bayesian estimation of spatial regression models","228344025":"Modeling Structural Changes: Bayesian Estimation of Multiple Changepoint Models and State Space Models","263486193":"Panel probit with flexible correlated effects: Quantifying technology spillovers in the presence of latent heterogeneity","7288103":"Bayesian dynamic modeling of latent trait distributions","7882033":"Bivariate Analysis of Liability to Clinical Mastitis and to Culling in First-Lactation Cows","12217840":"Statistical analysis of non-linear equation models with continuous and polytomous data","220735587":"Nonparametric Bayesian feature selection for multi-task learning.","228958440":"Hierarchical Parametric Models for Social Dilemma Games","5049600":"Mixture of normals probit models","272215412":"Use and Interpretation of Spatial Autoregressive Probit Models","247491473":"Evaluation of psychopharmacological effects of Linn. extract","4920602":"Computing marginal likelihoods from a single MCMC output","281488789":"Efficient estimation and prediction for the Bayesian binary spatial model with flexible link functions","222652438":"A Bayesian Analysis of the Multinomial Probit Model with Fully Identified Parameters","237245296":"A Flexible Skewed Link Function for Binary Response Data","10710518":"Bayesian model selection for mixtures of structural equation models with an unknown number of components","5139739":"Do dropouts suffer from dropping out? Estimation and prediction of outcome gains in generalized selection models","239522576":"A Simple Class of Bayesian Nonparametric Autoregression Models","5211414":"European Business Cycles: New Indices and Their Synchronicity","258228792":"BART: Bayesian additive regression trees","266285698":"A Study of the Probit Model with Latent Variables in Phase I Clinical Trials","221665366":"A new Monte Carlo sampling in Bayesian probit regression","10876352":"Genetic Change for Clinical Mastitis in Norwegian Cattle: a Threshold Model Analysis","10597828":"Longitudinal random effects model for genetic analysis of binary data with application to mastitis in dairy cattle","24439825":"Identifying Biomarkers from Mass Spectrometry Data with Ordinal Outcome","263471826":"Bayesian Survival Modelling of University Outcomes","37988133":"Random effects models for ordinal data","10597830":"Cumulative t-link threshold models for the genetic analysis of calving ease scores","280221145":"Non-asymptotic convergence analysis for the Unadjusted Langevin Algorithm","5127460":"Simultaneous probability statements for Bayesian P-splines","228970697":"The Dynamics of Multinationals Expansion in the European Pharmaceutical Industry (DRAFT)","28325084":"A Bayesian semiparametric latent variable model for binary, ordinal and continuous response","271703388":"Development of sparse Bayesian multinomial generalized linear model for multi-class prediction","263303873":"A Gibbs sampler for Bayesian analysis of site‐occupancy data","24361987":"Bayesian Analysis of Multivariate Nominal Measures Using Multivariate Multinomial Probit Models","228759760":"A note on variational approximate bayesian inference for latent variable models","263703245":"Statistical methods for modeling the risk of runway excursions","253983395":"PREDICTING DEFAULT PROBABILITIES USING BALANCE SHEET INDICATORS","262609445":"Heritability estimation of osteoarthritis in the pig-tailed macaque (Macaca Nemestrina) with a look toward future data collection","51234441":"Modeling Adverse Birth Outcomes via Confirmatory Factor Quantile Regression","254313133":"Dimensional Reduction for Latent Scores Modeling Using Recursive Integration","226658308":"Panel Data Modeling and Inference: A Bayesian Primer","276508156":"Mapping the spatial distribution of a disease-transmitting insect in the presence of surveillance error and missing data","264122934":"Nonparametric Variable Selection, Clustering and Prediction for High-Dimensional Regression","237656994":"Web-based Supplementary Materials for Modeling Complex Phenotypes: Generalized Linear Models Using Spectrogram Predictors of Animal Communication Signals","2469295":"Prediction Via Orthogonalized Model Mixing","265378395":"A Bayesian approach for predicting material accounting misstatements","266023504":"A Fully Bayesian Sparse Probit Model for Text Categorization","37257139":"A comparison of the performance of testlet-based computer adaptive tests and multistage tests","5139907":"Bayesian analysis of the two-part model with endogeneity: Application to health care expenditure","239768538":"U.S. demand for organic and conventional vegetables: A Bayesian censored system approach","261882381":"Relating Nanoparticle Properties to Biological Outcomes in Exposure Escalation Experiments","263408160":"A model for spatio-temporal clustering using multinomial probit regression: Application to avalanche counts","256500444":"Variable selection methods for developing a biomarker panel for prediction of dengue hemorrhagic fever","222566609":"‘Interdependent Preferential Trade Membership: An Empirical Analysis’","226201838":"Crown condition as a function of soil, site and tree characteristics","10976561":"Gene selection: A Bayesian variable selection approach","264243799":"Self-Assessed Social Position and Poverty","227612680":"Foreign Exchange Intervention by the Bank of Japan: Bayesian Analysis Using a Bivariate Stochastic Volatility Model","241724403":"Toward BlackBox Sampling: A Random-Direction Interior-Point Markov Chain Approach","248761160":"Generalized extreme value regression for ordinal response data","6397437":"Consequences of Selection for Yield Traits on Calving Ease Performance","2469306":"Existence of the MLE and propriety of posteriors for a general multinomial choice model","51050154":"Protein interaction detection in sentences via Gaussian Processes: a preliminary evaluation","260643369":"Bayesian hierarchical structured variable selection methods with application to MIP studies in breast cancer","242449361":"Bayesian Estimation of Covariance Matrices when Dimensions are Absent","257409778":"Sequential Monte Carlo Bandits","253821572":"The data augmentation algorithm: Theory and methodology","237550477":"The Heterogeneous Eects of Training Incidence and Duration on Labor Market Transitions1","281427297":"Intrinsic Bayesian Analysis for Occupancy Models","230865006":"A Multinomial Ordinal Probit Model with Singular Value Decomposition Method for a Multinomial Trait","51046074":"QTL mapping in outbred half-sib families using Bayesian model selection","280218882":"Multivariate cumulative probit for age estimation using ordinal categorical data","256539387":"Genomic prediction of trait segregation in a progeny population: A case study of Japanese pear (Pyrus pyrifolia)","228143147":"Do We Halo or Form? A Bayesian Mixture Model for Customer Satisfaction Data","5047806":"Conditional Heteroscedasticity in Qualitative Response Models of Time Series: A Gibbs-Sampling Approach to the Bank Prime Rate","227465275":"Risk and Return Characteristics of Venture Capital-Backed Entrepreneurial Companies","7626178":"Bayesian Analysis for Generalized Linear Models with Nonignorably Missing Covariates","23694545":"Processing Data from Social Dilemma Experiments: A Bayesian Comparison of Parametric Estimators","43353901":"A jackknife-like method for classification and uncertainty assessment of multi-category tumor samples using gene expression information","274269669":"Dynamic Forecasts of Qualitative Variables","4902391":"Multinomial probit estimation without nuisance parameters","4859380":"A Bayesian Multidimensional Scaling Procedure for the Spatial Analysis of Revealed Choice Data","4742646":"Bayesian Multivariate Isotonic Regression Splines: Applications to Carcinogenicity Studies","232863779":"Scale Perception Bias in the Valuation of Environmental Risks","255613695":"Labor Market Integration of German Immigrants and their Children : Does Personality Matter?","35925984":"Bayesian model checking strategies for dichotomous item response theory models [electronic resource] /","276202931":"Current complexity: a tool for assessing the complexity of organic molecules","255656685":"On Bayesian Variable Selection: Methods and Implementations for Genetic Association Studies 1","228808817":"Multi-Task Classification for Incomplete Data","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","227369051":"Using Infer.NET for Statistical Analyses","228798580":"Bayesian Analysis of Interval Counts with Surrogate Data on the Latency Times","258697906":"Predicting Emotional States of Images Using Bayesian Multiple Kernel Learning","259441327":"Objective Bayesian Variable Selection in Well-Formulated Models","5139860":"High school completion and future youth unemployment: new evidence from High School and Beyond","40892340":"The Rise of Markov Chain Monte Carlo Estimation for Psychometric Modeling","232275971":"Plackett-Luce regression: A new Bayesian model for polychotomous data","232095753":"Bayesian Estimation of Categorical Dynamic Factor Models","267377202":"Efficient Kernel Methods for Statistical Detection","285355231":"Subjective and Objective Bayesian Statistics: Principles, Models, and Applications, Second Edition","228092024":"Bayesian Multicategory Support Vector Machines","228941892":"“Improving Judicial Ideal Point Estimates with a More Realistic Model of Opinion Content","221520085":"A Noise-aware click model for web search","227450988":"MCMCpack: Markov chain Monte Carlo in R","35659716":"Hierarchical binary spatial regression models with cluster effects /","2663884":"Bayesian Inference for Semiparametric Binary Regression","222689441":"Design of complex systems in the presence of large uncertainties: A statistical approach","265171499":"Generalized linear mixed models for correlated binary data with t-link","4842927":"Link function selection in stochastic multicriteria decision making models","228554873":"Binary and Ordinal Time Series with AR (p) Errors: Bayesian Model Determination for Latent High-Order Markov Process","263500380":"A Bayesian Method of Estimating Kappa Coefficient with Application to a Rheumatoid Arthritis Study","228964431":"Canadian consumers\u0027 perceptual and attitudinal responses toward green automobile technologies: an application of Hybrid Choice Models","272391632":"Detecting short-term cyclical topic dynamics in the user-generated content and news","282803511":"A Gibbs Sampler for the (Extended) Marginal Rasch Model","46438186":"A Vehicle Ownership and Utilization Choice Model with Edogenous Residential Density","222953662":"A spatial structural equation model for health outcomes","282811695":"An approximate marginal logistic distribution for the analysis of longitudinal ordinal data","222701744":"Trucking industry adoption of information technology: A multivariate discrete choice model","228313197":"On the Estimation of Selection Models When Participation is Endogenous and Misclassified","254212830":"Comments on article by Celeux et al","259635840":"An adaptive spatial model for precipitation data from multiple satellites over large regions","227639403":"Bayesian estimation of Thurstonian ranking models based on the Gibbs sampler","4724148":"Bayesian Analysis of Interval Data Contingent Valuation Models and Pricing Policies","220055776":"Bayesian curve estimation by model averaging","2866644":"Bayesian Inference for Political Science Panel Data","270509536":"Bayesian Quantile Regression for Ordinal Models","46435524":"Shopping Cost and Brand Exploration in Online Grocery","250755312":"26 Bayesian Psychometric Modeling From An Evidence-Centered Design Perspective","254611758":"Improving nutrient content through genetic modification: Evidence from experimental auctions on consumer acceptance and willingness to pay for intragenic foods","255172914":"Entrepreneurial decisions: insights into the use of support services for new business creation","233395168":"Integrative Bayesian Analysis of High-Dimensional Multi-platform Genomics Data","254452001":"Simultaneous causality between health status and employment status within the population aged 30-59 in France","226235248":"Markov Chain Monte Carlo","264952262":"Existence of MLE and posteriors for a recognition-memory model","227447681":"An Empirical Analysis of Mobile Voice Service and SMS: A Structural Model","5129793":"Two-Sided Matching and Spread Determinants in the Loan Market","2348595":"Inferring Hospital Quality from Patient Discharge Records Using a Bayesian Selection Model","4347474":"A Latent Model Approach to Study Postural Instability for Parkinson\u0027s Disease","227419036":"Regionality revisited: An examination of the direction of spread of currency crises","228950966":"Attribute-based consideration sets","224709489":"Adaptive Bayesian Procedures Using Random Series Priors","228631480":"Modeling migraine severity with autoregressive ordered probit models","5047892":"Forecasting macro variables with a Qual VAR business cycle turning point index","33028076":"Modeling Transport Mode Decisions Using Hierarchical Binary Spatial Regression Models with Cluster Effects","228526980":"Discrete choice models based on the scale mixture of multivariate normal distributions","241846391":"AN INTRODUCTION TO THE DAT GIBBS SAMPLER FOR THE TWO-PARAMETER LOGISTIC (2PL) MODEL AND ITS APPLICATION","229964713":"Testing for trends in the violatin frequency of an environmental threshold in rivers","283115201":"Multivariate Stochastic Process Models for Correlated Responses of Mixed Type","13733582":"Reducing the incidence of epileptic seizures in the Belgian Tervuren through selection","233720817":"A unifying representation for a class of dependent random measures","272381468":"A Bayesian method for analyzing combinations of continuous, ordinal, and nominal categorical data with missing values","233763791":"Bayesian Learning of Noisy Markov Decision Processes","228625281":"Estimation of Semiparametric Models in the Presence of Endogeneity and Sample Selection","226337625":"“Bayesian Inference for Finite Mixture Models of Generalized Linear Models with Random Effects.”","8373851":"Bayesian Variable Selection in Multinomial Probit Models to Identify Molecular Signatures of Disease Stage","250755285":"7 Electronic Essay Grading","49833183":"Bayesian Models and Decision Algorithms for Complex Early Phase Clinical Trials","227390373":"Introduction to Bayesian Econometrics","284919507":"A Computational Bayesian Method for Generalized Semiparametric Regression Models","51240231":"Metagenes Associated with Survival in Non-Small Cell Lung Cancer","230597523":"BAYESIAN IRT MODELS INCORPORATING GENERAL AND SPECIFIC ABILITIES","222315377":"Dynamic latent trait models: An application to Latin American banking crises","228735888":"Panel Probit with Flexible Correlated Effects","8373835":"Bayesian Modeling of Multiple Lesion Onset and Growth from Interval-Censored Data","4740733":"Bayesian Spatial Probit Estimation: A Primer and an Application to HYV Rice Adoption","249037024":"Congressional Ideology and Administrative Oversight in the New Deal Era","284077782":"Addressing voice recording replications for Parkinson’s disease detection","266217959":"Analysis Of Variance – Why it is More Important Than Ever","227781545":"New Orleans Business Recovery in the Aftermath of Hurrican Katrina","228877215":"A Bayesian approach to parameter estimation in binary logit and probit models","5047923":"WORKING PAPER SERIES Business Cycle Detrending of Macroeconomic Data Via A Latent Business Cycle Index","221813510":"A Bayesian Semiparametric Approach for Incorporating Longitudinal Information on Exposure History for Inference in Case-Control Studies","237672469":"Estimation and Welfare Analysis in a System of Correlated Count Outcomes1","10673890":"In Vitro Study of Guide Wire Entrapment in Currently Available Inferior Vena Cava Filters","237113441":"IDEOLOGY, PARTY AND THE CREATION OF THE ANTISLAVERY COALITION1","23635755":"Efficient Gibbs sampler for Bayesian analysis of a sample selection model","6886957":"Random Regression Models for Male and Female Fertility Evaluation Using Longitudinal Binary Data","26277845":"A Bayesian Hierarchical Model for Classification with Selection of Functional Predictors","228989930":"On estimation of hybrid choice models","222493452":"Markov chain Monte Carlo and model of consideration set and parameter heterogeneity","238696553":"Applications of Mixed-E®ect Models","2805375":"A General Bayesian Model for Testlets: Theory and Applications","250396858":"Monitoring Message Streams: Algorithmic Methods for Automatic Processing of Messages","226200364":"Information, Power, and War","46494876":"Additive cubic spline regression with Dirichlet process mixture errors","229039101":"Bayesian analysis of binary regression using symmetric and asymmetric links","255586663":"Statistical Analysis and Interpretation of Discrete Compositional Data","270528066":"Vessel speed restrictions reduce risk of collision-related mortality for North Atlantic right whales","223654665":"Consideration sets, intentions and the inclusion of “don\u0027t know” in a two-stage model for voter choice","227711948":"Modeling Clustered Ordered Categorical Data: A Survey","229723119":"Bayesian analysis of outlier problems using divergence measures","5207568":"Generalized Spatial Dirichlet Process Models","28213199":"Nuevas técnicas de estadística espacial para la detección de clusters residenciales de población inmigrante","220361536":"Bayesian inference for an adaptive Ordered Probit model: An application to Brain Computer Interfacing.","280104656":"Evaluating the Causal Effect of University Grants on Student Dropout: Evidence from a Regression Discontinuity Design Using Principal Stratification","45901023":"On computational tools for Bayesian data analysis","272264793":"Life on the bubble: Who’s in and who’s out of March Madness?","273303081":"Cascaded H-Bridge Multilevel Inverter System Fault Diagnosis Using a PCA and Multi-class Relevance Vector Machine Approach","4902445":"Simulation estimation of dynamic discrete choice panel models with accelerated importance samplers","233360259":"A Gibbs Sampling Algorithm for a Changing Regression Model with Pooled Binary Response Data","234783637":"Does Ownership Affect the Variability of the Production Process? Evidence from International Courier Services","265644454":"Vertical-likelihood Monte Carlo","228565993":"Some improved estimators in logistic regression model","225260308":"A Noninformative Prior for Neural Networks","232813466":"An exploration of fixed and random effects selection for longitudinal binary outcomes in the presence of nonignorable dropout","5140019":"Semiparametric Bayesian inference for dynamic Tobit panel data models with unobserved heterogeneity","259098894":"On the Spatial Correlation of International Conflict Initiation and Other Binary and Dyadic Dependent Variables","282775130":"Genomic Prediction Models for Count Data","5197518":"Estimating Distributions of Treatment Effects with an Application to the Returns to Schooling and Measurement of the Effects of Uncertainty on College","247507011":"The smile of the tourist: The relationship between price sensitivity and expenses","33027954":"Model Selection for Dags via RJMCMC for the Discrete and Mixed Case","282000968":"Crossbred cow adoption and its correlates: Countable adoption specification search in Sri Lanka\u0027s small holder dairy sector","227427081":"The Maximum Approximate Composite Marginal Likelihood (MACML) Estimation of Multinomial Probit-Based Unordered Response Choice Models","250185825":"Accommodating Missing Data in Mixture Models for Classification by Opinion-Changing Behavior","251726217":"Integrity of Phonation Induced UES Contractile Response in Patients With Gastroesophageal Reflux Disease (GERD)","283840096":"BAYESIAN ESTIMATION OF A MULTI-UNIDIMENSIONAL GRADED RESPONSE IRT MODEL","4724419":"Dynamic Forecasts of Qualitative Variables: A Qual VAR Model of U.S. Recessions","259510780":"Coupled dimensionality reduction and classification for supervised and semi-supervised multilabel learning","274728684":"Detecting outlying trials in network meta-analysis: J. ZHANG, H. FU AND B. P. CARLIN","221619128":"Nonparametric Latent Feature Models for Link Prediction.","241826023":"A Hierarchical Generalized Linear Model of Random Differential Item Functioning for Polytomous Items: A Bayesian Multilevel Approach","264429907":"Whole-Genome Analyses of Lung Function, Height and Smoking","51934602":"Infinite Tucker Decomposition: Nonparametric Bayesian Models for\nMultiway Data Analysis","230699860":"A Hierarchical Modeling Framework for Multiple Observer Transect Surveys","2471602":"Operationalizing and Testing Spatial Theories of Voting","276172513":"Data augmentation and parameter expansion for independent or spatially correlated ordinal data","282218057":"A Bayesian approach for inducing sparsity in generalized linear models with multi-category response","48194627":"Bayesian Variable Selection for Probit Mixed Models Applied to Gene\nSelection","265095505":"Drug susceptibility prediction against a panel of drugs using kernelized Bayesian multitask learning","24127471":"A Gibbs Sampler for Mixed Logit Analysis of Differentiated Product Markets Using Aggregate Data","24178645":"Bayesian Nonparametric Functional Data Analysis Through Density Estimation.","222413799":"Multivariate dynamic model for ordinal outcomes","263252246":"Monte Carlo Evaluations of Multivariate Normal Probabilities","51373478":"Economic evaluation of health effects with preference imprecision","228934414":"Estimating disaggregate models using aggregate data through augmentation of individual choice","8251094":"Cancer classification and prediction using logistic regression with Bayesian gene selection","228162357":"Comparing Nominate and Ideal: Points of Difference and Monte Carlo Tests","49796186":"Bayesian Variable Selection via Particle Stochastic Search","228375346":"Multilevel models with multivariate mixed response types.” Statistical Modelling","51690938":"A Bayesian approach to risk-adjusted outcome monitoring in healthcare","265939306":"Bayesian Inference in Applications of Singular Value Decomposition to Biology","250755140":"Modeling and Analysis for Categorical Response Data","222546933":"Analysis of treatment response data from eligibility designs","24129479":"A Dynamic Tobit Model for the Open Market Desk\u0027s Daily Reaction Function","254435730":"Psychological Factors and Labour Market Outcomes: The Case of Immigrants and their Children in Germany","220056484":"A unified Bayesian inference on treatment means with order constraints","228541219":"Estimation and Inference via Bayesian Simulation: An Introduction to Markov Chain Monte Carlo","279668244":"Strategic Research Connections: Implementing Funding Policy in a Dynamic Network","4746999":"Nonlinear and Nonparametric Regression and Instrumental Variables","220320670":"Variational Bridge Regression.","23949266":"Bayesian multinomial regression with class-specific predictor selection","238504183":"Bayesian analysis for extreme climatic events: A review","33027894":"Bayesian Semiparametric Regression Analysis of Multicategorical Time-Space Data","45933694":"Control Variates for Reversible MCMC Samplers","224848803":"Stochastic model search with binary outcomes for genome-wide association studies","239745164":"A Classical MCMC Approach to the Estimation of Limited Dependent Variable Models of Time Series","14284318":"Multiple-Trait Gibbs Sampler for Animal Models: Flexible Programs for Bayesian and Likelihood-Based (Co)Variance Component Inference","227347274":"Utility in Willingness to Pay Space: A Tool to Address Confounding Random Scale Effects in Destination Choice to the Alps","250185774":"A Bayesian Approach to Ranking and Rater Evaluation: An Application to Grant Reviews","47541273":"How a Bayesian Might Estimate the Distribution of Cronbach’s Alpha From Ordinal-Dynamic Scaled Data A Case Study Measuring Nursing Home Resident Quality of Life","26822484":"Modeling Complex Phenotypes: Generalized Linear Models Using Spectrogram Predictors of Animal Communication Signals","2690791":"A Bayesian Approach to Robust Binary Nonparametric Regression","13663745":"Generalized Linear Mixed Models in Dairy Cattle Breeding","264241425":"A Bayesian Nonparametric Approach for the Analysis of Multiple Categorical Item Responses","267852069":"Modelos Grafos para Expressão Gênica","11300478":"Yi N, Xu S. Mapping quantitative trait loci with epistatic effects. Genet Res 79: 185-198","251641901":"Protective effect of telmisartan on pancreatic β cells of type 2 diabetic rats","225321915":"Modeling local growth control decisions in a multi-city case: Do spatial interactions and lobbying efforts matter?","46494736":"Spatial econometric analysis of location drivers in a renewable resource-based industry: The U.S. South Lumber Industry","223265688":"Hierarchical Analysis of SUR Models with Extensions to Correlated Serial Errors and Time-Varying Parameter Models","51887552":"Parameter Expansion and Efficient Inference","237467903":"A Multilevel Factor Model for Mixed Binary and Ordinal Indicators of Women\u0027s Status","245581946":"Bayesian Estimation of Normal Ogive Item Response Curves Using Gibbs Sampling","270671614":"Adaptive Clinical Trials","263428435":"Estimation and efficiency measurement in stochastic production frontiers with ordinal outcomes","226874212":"Classification with Bayesian MARS","276893280":"Understanding emotional impact of images using Bayesian multiple kernel learning","222817186":"Bayesian model determination for multivariate ordinal and binary data","33027856":"A latent variable probit model for multivariate ordered categorical responses","46455854":"A Practitioner\u0027s Guide to Bayesian Estimation of Discrete Choice Dynamic Programming Models","2713283":"Prediction Using Orthogonalized Model Mixing","226958188":"Hierarchical Multinomial Processing Tree Models: A Latent-Trait Approach","2567883":"Bayesian Learning about Ideal Points of U.S. Supreme Court Justices, 1953-1999","280536660":"Clustered data analysis under miscategorized ordinal outcomes and missing covariates","224811926":"Bayesian Kernel Mixtures for Counts","41708684":"Analyse de séquences de variables aléatoires hydrologiques à l’aide de modèles de changement de régime exploitant des variables atmosphériques","5764775":"Monitoring late-onset toxicity in phase I trials using predicted risks","281042480":"Is What You Choose What You Want? – Outlier Detection in Choice-Based Conjoint","254386648":"DEMAND FOR BREAKFAST CEREALS: WHOLE GRAINS GUIDANCE AND FOOD CHOICE","254382554":"Market Timing across Multiple Economic Regimes","251639816":"Measuring Inequality of Subjective Well-being: A Bayesian Approach","228598616":"Nonlinear-Probit Gene Classification Using Mutual-Information and Wavelet Based Feature Selection","232256303":"A Bayesian semiparametric approach with change points for spatial ordinal data","265892131":"A Full Gibbs Sampler for the Bayesian Multinomial Probit Switching Model","4859569":"Bayesian Analysis of Cross-Section and Clustered Data Treatment Models","26902369":"Bayesian variable selection in clustering via dirichlet process mixture models","236853474":"Multilevel Structural Equation Models for the Analysis of Comparative Data on Educational Performance","257665447":"Multilevel structured additive regression","7990919":"A Bayesian approach to joint feature selection and classifier design","23504485":"EXPLAINING HOUSEHOLD LOCATION CHOICES USING A SPATIAL PROBIT MODEL","237441314":"Technical Report An Evaluation of Gaussian Processes for Sentence Classication and Protein Interaction Detection","262277287":"Efficient MCMC for binomial logit models","254212142":"A Skew Item Response Model","266219732":"The Adoption and use of Computers in Agriculture in England and Wales","2807585":"Bayesian Identification of Outliers in Computerized Adaptive Tests","271664954":"Bayesian asymmetric logit model for detecting risk factors in motor ratemaking","228459155":"A hierarchical random-effects model for survival in patients with Acute Myocardial Infarction","2565943":"Shrinkage Estimator Generalizations of Proximal Support Vector Machines","257044546":"A new approach to specify and estimate non-normally mixed multinomial probit models","254212149":"Scalable Variational Inference for Bayesian Variable Selection in Regression, and Its Accuracy in Genetic Association Studies","4986708":"Inference in Semiparametric Dynamic Models for Binary Longitudinal Data","23133816":"Statistical analysis of the National Institutes of Health peer review system","254296113":"Covariance Decompositions for Accurate Computation in Bayesian Scale-Usage Models","228465287":"Duration-dependent Markov-switching VAR models with applications to the business cycle analysis","254212157":"Nonparametric estimation of the distribution function in contingent valuation models","220504633":"Bayesian Method to Detect Outliers for Ordinal Data","280233872":"2nd version (July 2015)","24075849":"Time-varying discrete monetary policy reaction functions","279385985":"Categorical Regression Models","238012680":"Approximating the marginal likelihood using copula","5195624":"Aggregate Price Shocks and Financial Instability: An Historical Analysis","261171385":"Analyzing Probit Bayes Estimator for Flexible Covariance Structures in Discrete Choice Modeling","41141593":"Eco-label Adoption in an Interdependent World","227701432":"A modern Bayesian look at the multi‐armed bandit","284172250":"Standardizing Plasmodium falciparum infection prevalence measured via microscopy versus rapid diagnostic test","48180723":"Generalized extreme value regression for binary response data: An\napplication to B2B electronic payments system adoption","247245203":"On Bayesian Analysis of Multirater Ordinal Data: An Application to Automated Essay Grading","14098424":"Factors Affecting Susceptibility to Intramammary Infection and Mastitis: An Approximate Bayesian Analysis","257146979":"A Bayesian Analysis of Payday Loans and Their Regulation","224983641":"Multilevel Latent Gaussian Process Model for Mixed Discrete and Continuous Multivariate Response Data","262092974":"Bayesian Latent Factor Regression for Functional and Longitudinal Data","259926092":"Direct Sampling","235432253":"Spatial Discrete Choice and Spatial Limited Dependent Variable Models: a\nreview with an emphasis on the use in Regional Health Economics","227349179":"Modeling Multivariate Distributions Using Copulas: Applications in Marketing","2737937":"Bayesian Nonparametric Binary Response Regression Models with Application in Environmental Management","222005763":"Semiparametric Bayes Analysis of Longitudinal Data Treatment Models","263512205":"A Bayesian Nonparametric Model for Spatially Distributed Multivariate Binary Data with Application to a Multidrug-Resistant Tuberculosis (MDR-TB) Study","223492718":"Bayesian identification, selection and estimation of semiparametric functions in high-dimensional additive models","6438691":"Analysis of Fertility and Dystocia in Holsteins Using Recursive Models to Handle Censored and Categorical Data","2852713":"A Simulation Approach to Convergence Rates for Markov Chain Monte Carlo Algorithms","2860905":"Women, Work, and Motherhood: Changing Employment Penalties for Motherhood in West Germany after 1945 - A Comparative Analysis of Cohorts Born in 1934-1971","227375816":"Bayesian geoadditive sample selection models","2365292":"Bayesian Analysis Of A Random Link Function In Binary Response Regression","254384224":"Household food expenditures in the United States: A Bayesian MCMC approach to censored equation systems","259397689":"marked: An R package for maximum likelihood and Markov Chain Monte Carlo analysis of capture-recapture data","6395697":"A periodic analysis of longitudinal binary responses: A case study of clinical mastitis in Norwegian Red cows","228915958":"Bayesian Estimation of an Asymmetric Employment Adjustment Model","263225570":"Bayesian semiparametric models for nonignorable missing mechanisms in generalized linear models","236132672":"A model for analyzing spatially correlated binary data clustered in uncorrelated lattices","6668081":"A bivariate quantitative genetic model for a threshold trait and a survival trait","237570429":"So the Reviewer Told You to Use a Selection Model? Selection Models and the Study of International Relations","228862706":"Implementations of the MCEM algorithm","247837084":"Split Questionnaire Design for Massive Surveys","227390163":"Discrete Choice Methods With Simulation","277163994":"EFFECT OF CATEGORIZATION ON TYPE I ERROR AND POWER IN ORDINAL INDICATOR LATENT MEANS MODELS FOR BETWEEN-SUBJECTS DESIGNS","228387582":"A simple distribution-free test for nonnested hypotheses","4804394":"Are credit constraints in Italy really more binding in the South?","5289782":"Meta-Analysis of Studies with Missing Data","2828108":"Mixture Models in the Exploration of Structure-Activity Relationships in Drug Design","247837101":"A General Choice Model for Bundles with Multiple-Category Products: Application to Market Segmentation and Optimal Pricing for Bundles","4742945":"Two-Sided Estimation of Mate Preferences for Similarities in Age, Education, and Religion","254449728":"Binary quantile regression: A Bayesian approach based on the asymmetric Laplace density","225415685":"A Markov Chain Monte Carlo Approach to Confirmatory Item Factor Analysis","248398244":"An Integrative Framework for Bayesian Variable Selection with Informative Priors for Identifying Genes and Pathways","35282282":"Bayesian estimation of Thurstonian ranking models based on the Gibbs sampler /","267223197":"Sampling Strategies for MCMC","2258770":"On MCMC Sampling in Hierarchical Longitudinal Models","240802089":"Generating Multiple Imputations for Matrix Sampling Data Analyzed With Item Response Models","5162811":"Robust Benefit Function Transfer: A Bayesian Model Averaging Approach","251725940":"Curcumin Affords Gastroprotection Against Acute Gastric Lesions Induced by Acid-Independent and Acid-Dependent Ulcerogens. Involvement of Prostaglandins, Sensory Neuropeptides and Vanilloid TRPV-1 Receptors","228168417":"Estimating Loan-to-Value Distributions","24075799":"Modeling Unobserved Heterogeneity in Contingent Valuation of Health Risks","260389119":"ESSAYS ON MODEL SELECTION USING BAYESIAN INFERENCE","255613117":"A Bayesian Method for Finding Interactions in Genomic Studies","221336243":"Classification of Protein Interaction Sentences via Gaussian Processes","277694223":"Statistical Diagnostics for Cancer: Analyzing High-Dimensional Data","265658448":"Essays on IT-Mediated Phenomena: IT Knowledge Management, Mobile Telecommunication, and E-Commerce","274141138":"Modelling short- and long-term characteristics of follicle stimulating hormone as predictors of severe hot flashes in the Penn Ovarian Aging Study","23647983":"Public support for reducing US reliance on fossil fuels: investigating household willingness-to-pay for energy research and development. Ecol Econ","8996609":"Missing-value estimation using linear and non-linear regression with Bayesian gene selection. Bioinformatics 19: 2302-2307","229880377":"Tobit Estimation with Unknown Point of Censoring with an Application to Milk Market Participation in the Ethiopian Highlands","232024670":"The Coalition Merchants: The Ideological Roots of the Civil Rights Realignment","228958760":"Dating US Business Cycles with Macro Factors","259508473":"Bayesian model diagnostics using functional Bregman divergence","247837002":"Internet Recommendation Systems","235315606":"Analysis of multi-category purchase incidence decisions using IRI market basket data","227998214":"Robit Regression: A Simple Robust Alternative to Logistic and Probit Regression","35247496":"Modeling the distribution of ground flora on large spatial domains in the Missouri Ozarks [microform] /","49821033":"Predictions of Native American Population Structure Using Linguistic Covariates in a Hidden Regression Framework","2453431":"A Sequential Particle Filter Method for Static Models","226535955":"Bayesian Model Uncertainty in Mixed Effects Models","227602948":"Bayesian analysis of the dividend behaviour","220320438":"Bayesian Generalized Kernel Mixed Models","227564041":"Simulation‐Based Bayesian Econometric Inference: Principles and Some Recent Computational Advances","222966481":"Estimating Demand Systems When Outcomes Are Correlated Counts","282130251":"Bayesian framework for parametric bivariate accelerated lifetime modeling and its application to hospital acquired infections","8525598":"Bayesian Isotonic Regression and Trend Analysis","285779607":"Physicians\u0027 financial incentives and treatment choices in heart attack management","40689101":"Computational Systems Bioinformatics and Bioimaging for Pathway Analysis and Drug Screening","228272703":"Bayesian Forecasting of Federal Funds Target Rate Decisions","227598900":"State space mixed models for longitudinal observations with binary and binomial responses","8185816":"Modelling neuromotor ratings with floor-effects","283668300":"Spatial Species Sampling and Product Partition Models","255623321":"ESTUDIO DE LA RELACIÓN GENÉTICA ENTRE LOS CARACTERES FACILIDAD DE PARTO MATERNA Y FERTILIDAD DE LA HEMBRA EN EL GANADO VACUNO LECHERO DE LA CAPV","265386100":"The Bayesian Approach to Experimental Data Analysis","4741102":"A revised Tobit procedure for mitigating bias in the presence of non-zero censoring with an application to milk-market participation in the Ethiopian highlands","221336215":"Definition of Valid Proteomic Biomarkers: A Bayesian Solution.","236274108":"Exact estimation procedures in a spatial mixed-effects probit model with binary outcomes","4986853":"Conditional Heteroscedasticity in Qualitative Response Models of Time Series: A Gibbs-Sampling Approach to the Bank Prime Rate","51127456":"Bayesian data augmentation methods for the synthesis of qualitative and quantitative research findings","24067777":"Modelling firm innovation using panel probit estimators","281091950":"A BAYESIAN APPROACH FOR ITEM RESPONSE THEORY IN ASSESSING THE PROGRESS TEST IN MEDICAL STUDENTS","238432646":"Information and Economic Interdependence","240208352":"A statistical model for discriminating between subliminal and near-liminal performance","254288028":"A Hierarchical Latent Variable Model for Ordinal Data from a Customer Satisfaction Survey with “No Answer” Responses","263213061":"Integrated analysis of content and construct validity of psychometric instruments","28323334":"Clustering Partition Models for Discrete Structures with Applications in Geographical Epidemiology","8453942":"Gene selection using a two-Level hierarchical Bayesian model","49517893":"Non-parametric Bayesian Learning with Incomplete Data","277704507":"Bayesian Analysis of Sample Selection Models","268075075":"Human Behavior \u0026 Low Energy Architecture: Linking Environmental Adaptation, Personal Comfort, \u0026 Energy Use in the Built Environment","29654654":"Dimension Reduction with Linear Discriminant Functions Based on an Odds Ratio Parameterization","228479525":"Does Ethnic Solidarity Facilitate Electoral Support for Nation-Building Policies?: Evidence from a Political Experiment","266627160":"Elucidation of Pathways Driving Asthma Pathogenesis: Development of a Systems-Level Analytic Strategy","254040216":"A UNIFIED BAYESIAN APPROACH FOR ANALYZING CORRELATED ORDINAL RESPONSE DATA","222087811":"Estimation in the probit normal model for binary outcomes using the SAEM algorithm","228368988":"Bayesian inference in a sample selection model","24063662":"A Bayesian Semiparametric Latent Variable Model for Mixed Responses","5154700":"Local Choice of Property Taxation: Evidence from Norway","279310176":"Objective Variables for Probabilistic Revenue Maximization in Second-Price Auctions with Reserve","282941210":"Multimark: An R package for analysis of capture-recapture data consisting of multiple \"noninvasive\" marks","228643433":"Bridging Institutions and Time: Creating Comparable Preference Estimates for Presidents, Senators, and Justices, 1946–2002","1738705":"Bayesball: A Bayesian hierarchical model for evaluating fielding in major league baseball","6152077":"Bayesian Modeling of Multiple Episode Occurrence and Severity with a Terminating Event","258660538":"Modeling Seasonal Tropical Cyclone Activity in the Fiji Region as a Binary Classification Problem","229712483":"Bayesian Methods for Categorical Data","286994121":"High-Dimensional Bayesian Classifiers Using Non-Local Priors","5414785":"Fitting Genetic Models to Twin Data with Binary and Ordered Categorical Responses: A Comparison of Structural Equation Modelling and Bayesian Hierarchical Models","222241513":"New information technology systems and a Bayesian hierarchical bivariate probit model for profiling surgeon quality at a large hospital","237423088":"Posterior Predictive Model Checking for Multidimensionality in Item Response Theory","280975209":"A dose–schedule finding design for phase I–II clinical trials","46443795":"Unpleasant surprises : sovereign default determinants and prospects","6324152":"Bayesian Mapping of Genomewide Interacting Quantitative Trait Loci for Ordinal Traits","4896662":"Bayesian Inference for Hospital Quality in a Selection Model","228643454":"Politics and Macroeconomic Performance in the United States: Cycles and Long-Run Outcomes","260317275":"Estimators of binary spatial autoregressive models: A Monte Carlo study","222655141":"Bayesian modeling of several covariance matrices and some results on propriety of the posterior for linear regression with correlated and/or heterogeneous errors","41164180":"Correction for Covariate Measurement Error in Nonparametric Longitudinal Regression","24063630":"Semiparametric Thurstonian Models for Recurrent Choices: A Bayesian Analysis","241643910":"Recovery of Graded Response Model Parameters: A Comparison of Marginal Maximum Likelihood and Markov Chain Monte Carlo Estimation","266477571":"Probit Normal Correlated Topic Model","233146881":"To Bayes or Not to Bayes, From Whether to When: Applications of Bayesian Methodology to Modeling","221967070":"Bayesian semiparametric regression models for evaluating pathway effects on continuous and binary clinical outcomes","10567492":"Bayesian Analysis of Structural Equation Models with Dichotomous Variables","222526116":"‘Policy options promoting market participation among small-holder livestock producers: A case study from the Philippines’","221346521":"The matrix stick-breaking process for flexible multi-task learning","222515881":"Conditional independence of multivariate binary data with an application in caries research","254384326":"Bayesian estimation of non-stationary Markov models combining micro and macro data","257814700":"Bayesian Nonparametric Models for Multiway Data Analysis","4822971":"A Bayesian multinomial probit analysis of voter choice in Chile’s 2005 presidential election","11061086":"Central nervous system activity of Leucas inflata Benth. In mice","4769726":"How Smart is Smart Money? A Two-Sided Matching Model of Venture Capital","34487799":"Essays on quantitative marketing models and Monte Carlo integration methods /","227682926":"Bayesian Semiparametric Analysis of Developmental Toxicology Data","220504793":"A New Multinomial Model and a Zero Variance Estimation","228915803":"Consumer Search and Propensity to Buy"},"index":114}