{"abs":"Ways of obtaining approximate Bayes factors for generalized linear models are described, based on the Laplace method for integrals. I propose a new approximation which uses only the output of standard computer programs such as GLIM; this appears to be quite accurate. A reference set of proper priors is suggested, both to represent the situation where there is not much prior information, and to assess the sensitivity of the results to the prior distribution. The methods can be used when the dispersion parameter is unknown, when there is overdispersion, to compare link functions, and to compare error distributions and variance functions. The methods can be used to implement the Bayesian approach to accounting for model uncertainty. I describe an application to inference about relative risks in the presence of control factors where model uncertainty is large and important. Software to implement the methods is available at no cost from StatLib. Contents 1 Introduction 1 2 Bayes Factors ...","title":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","id":2747511,"url":"https://www.researchgate.net/publication/2747511_Approximate_Bayes_Factors_and_Accounting_for_Model_Uncertainty_in_Generalized_Linear_Models","names":["Adrian E. Raftery","Biometrika"],"references":{"243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","2592036":"Strategies for Graphical Model Selection","265443477":"Testing precise hypotheses. With comments and a rejoinder by the authors","230675253":"Statistical Decision Theory and Bayesian Analysis. Springer, New York","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","44543848":"Specification searches : ad hoc inference with nonexperimental data / Edward E. Leamer","48213072":"The Theory of Probability","38363676":"Uncertainty, Policy Analysis and Statistics (c/r: P276–291)","38358303":"‘Estimating the Dimension of A Model,’","245581819":"Bayes Factors and Model Uncertainty","38358928":"Quasi-Likelihood Functions","239665490":"Goodness of Link Tets for Generalized Linear Models","243081761":"A Comment on D. V. Lindley\u0027s Statistical Paradox","260161183":"Approximate Bayes Factors and Orthogonal Parameters, with Application to Testing Equality of Two Binomial Proportions","267444240":"Bayes factors for non-homogeneous Poisson processes with vague prior information","267475473":"Generalized linear models: Scale parameters, outlier accomodation and prior distributions","228434680":"Bayesian analysis of a change-point Poisson process","2867469":"Bayesian Graphical Models for Discrete Data","265365434":"Information Measures and Model Selection","2299598":"Model Selection and Accounting for Model Uncertainty in Linear Regression Models","4855480":"A Comparison of the Information and Posterior Probability Criteria for Model Selection","246094110":"Estimating a Product of Means: Bayesian Analysis with Reference Priors","20907786":"Model selection and the estimation of odds ratios in the presence of extraneous factors.","243687932":"Reference Posterior Distributions for Bayesian Inference","243777276":"Testing a Point Null Hypothesis: The Irreconcilability of P Values and Evidence","51999462":"Graphical Models in Applied Multivariate Statistics. John Wiley, Chichester"},"citedIn":{"228317081":"The Good and the Bad of Value Investing: Applying a Bayesian Approach to Develop Enhancement Models","229142954":"Diplopie intermittente dans le regard à droite : quels diagnostics possibles ?","4899407":"Assessment of two approximation methods for computing posterior model probabilities","13219532":"Criticism of a hierarchical model using Bayes factors","228528537":"IMPROVING NONLINEAR PROCESS MODELING USING MULTIPLE NEURAL NETWORK COMBINATION THROUGH BAYESIAN MODEL AVERAGING (BMA)","258871656":"Bayesian parameter inference for dynamic infectious disease modelling: Rotavirus in Germany","2311716":"The Variable Selection Problem","277298831":"Bayesian Model Averaging","259156859":"Kin-cohort Estimate of Penetrance with Piecewise Weibull Model","2625570":"Effects Of Ambient Fine And Coarse Particles On Mortality In Phoenix, Arizona","226262902":"Operational Research Approach to Decision Making","5553247":"Quantitative trait loci for fertility traits in Finnish Ayrshire cattle","7445628":"A Bayesian Approach for Discriminating Among Alternative Inheritance Hypotheses in Plant Polyploids: The Allotetraploid Origin of Genus Borderea (Dioscoreaceae)","7732347":"Imputation and Variable Selection in Linear Regression Models with Missing Covariates","277893278":"Statistical Colocalization of Genetic Risk Variants for Related Autoimmune Diseases in the Context of Common Controls","263475622":"Comorbidity and Insurance as Predictors of Disability After Traumatic Brain Injury","228652982":"Spike and slab prior distributions for simultaneous Bayesian hypothesis testing, model selection, and prediction, of nonlinear outcomes","228796853":"Automatic Bayesian model averaging for linear regression and applications in Bayesian curve fitting","2790973":"Bayesian Model Averaging in Proportional Hazard Models: Assessing Stroke Risk","42108565":"Richness, origin and structure of an Eimeria community in a population of Eastern cottontail ( Sylvilagus floridanus) introduced into Italy","267711468":"A Bayesian model averaging approach to the dumping severity data over hierarchical log-linear models","259567971":"Modelling survival data to account for model uncertainty: A single model or model averaging?","228879800":"Modeling and predicting extrapolated probabilities with outlooks. Statistica Sinica 18","269286928":"Bayesian variable selection in generalized additive partial linear models","229390259":"Oceanic–atmospheric modes of variability and their influence on riverine input to coastal Louisiana and Mississippi","250291956":"A Weakly Informative Default Prior Distribution for Logistic and Other Regression Models.","261100465":"Working memory updating involves item-specific removal. Journal of Memory and Language, 74, 1-15","24142162":"Determining Growth Determinants: Default Priors and Predictive Performance in Bayesian Model Averaging","243050078":"Applied regression analysis bibliography update 1994-97","225934677":"Bayesian Model Comparison of Structural Equation Models","2555394":"Minimum Message Length Inference: Theory and Applications","249912513":"A Range Image Segmentation Algorithm Based on Gaussian Mixture Model","270969346":"Phase I trial design for drug combinations with Bayesian model averaging","243103323":"Simulation Pseudo-Bias Correction to the Harmonic Mean Estimator of Integrated Likelihoods","222485349":"A Method for Simultaneous Variable Selection and Outlier Identification in Linear Regression;","7522901":"Gearing up for genome-wide gene-association studies","251220177":"Methodology for Bayesian Model Averaging: An Update","24065350":"A Simulation-Intensive Approach for Checking Hierarchical Models","45867665":"Bayesian variable selection using cost-adjusted BIC, with application to cost-effective measurement of quality of health care","4771939":"Prior Elicitation, Variable Selection and Bayesian Computation for Logistic Regression Models","242412099":"Bayesian and non-Bayesian techniques applied to censored survival data with missing values","236028451":"Testosterone Levels Are Negatively Associated with Fatherhood, but Positively Related to Offspring Count in Fathers","254297884":"Identification of quantitative trait loci for canine hip dysplasia by two sequential multipoint linkage analyses","6869087":"Bayesian Covariance Selection in Generalized Linear Mixed Models","2622481":"Accounting for Model Uncertainty in Survival Analysis Improves Predictive Performance","46554876":"Streaky Hitting in Baseball","266469341":"INTEGRATING SUBSURFACE OCEAN TEMPERATURES IN THE STATISTICAL PREDICTION OF ENSO AND AUSTRALIAN RAINFALL \u0026 STREAMFLOW","222626683":"Mixtures of spatial and unstructured effects for spatially discontinuous health outcomes","23645015":"Approximating posterior probabilities in a linear model with possibly noninvertible moving average errors","10673890":"In Vitro Study of Guide Wire Entrapment in Currently Available Inferior Vena Cava Filters","223215887":"The deductive phase of statistical analysis via predictive simulations: Test, validation and control of a linear model with autocorrelated errors representing a food process","6531617":"Bayesian Methods for Highly Correlated Exposure Data","51179343":"Daytime Habitat Selection by Introduced Eastern Cottontail Sylvilagus floridanus and Native European Hare Lepus europaeus in Northern Italy","269768785":"Clock model makes a large difference to age estimates of long-stemmed clades with no internal calibration: A test using Australian grasstrees","31476134":"Biometrika Centenary: Theory and general methodology","24171318":"Bayesian model averaging in meta-analysis: Vitamin E supplementation and mortality","49622205":"A Meta-Analytic Investigation of the Structure of Posttraumatic Stress Disorder Symptoms","243770060":"Model Selection: An Integral Part of Inference","226645466":"Monitoring Suicide Mortality: A Bayesian Approach","233654197":"Ecological predictions lead to the discovery of a benthic-limnetic species pair of threespine stickleback in Little Quarry Lake, British Columbia","249693883":"Adjusting for Overdispersion in an Analysis of Comparative Social Mobility","6235654":"Randomized Phase II Study of Gemcitabine and Docetaxel Compared With Gemcitabine Alone in Patients With Metastatic Soft Tissue Sarcomas: Results of Sarcoma Alliance for Research Through Collaboration Study 002","229783019":"Reply to comment on ‘Associations between air pollution and hospital visits for cardiovascular diseases in the elderly in Sydney using Bayesian statistical methods’","233537975":"Early Prediction of Gestational Diabetes Mellitus in Vietnam Clinical impact of currently recommended diagnostic criteria","267762089":"Weighted-average least squares (WALS): A survey","235633749":"Efficient Approximations for the Marginal Likelihood of Incomplete Data\nGiven a Bayesian Network","282978493":"Climate-related hydrological regimes and their effects on abundance of juvenile blue crabs (Callinectes sapidus) in the northcentral Gulf of Mexico","38326824":"Bayesian Model Averaging: A Tutorial","5124654":"Growth Empirics Under Model Uncertainty: Is Africa Different?","24422165":"Bayesian Variable Selection and Computation for Generalized Linear Models with Conjugate Priors","249693827":"Bayesian Analysis of Event History Models with Unobserved Heterogeneity via Markov Chain Monte Carlo: Application to the Explanation of Fertility Decline","249693825":"Bayes Factors and BIC: Comment on \"A Critique of the Bayesian Information Criterion for Model Selection\"","228623812":"Adaptive Bayesian criteria in variable selection for generalized linear models","2568259":"Choosing the Link Function and Accounting for Link Uncertainty in Generalized Linear Models using Bayes Factors","12450523":"Comparing the performance of two indices for spatial model selection: application to two mortality data.","258671875":"Bayesian Approach to Quantifying Epistemic Uncertainty in a Processor Availability Model","23170317":"The Effects of Accessory Stimuli on Information Processing: Evidence from Electrophysiology and a Diffusion Model Analysis","220124531":"Iterative Bayesian Model Averaging: a method for the application of survival analysis to high-dimensional microarray data","2468939":"A Framework for Nonparametric Regression Using Neural Networks","259925265":"A LASSO-Based Diagnostic Framework for Multivariate Statistical Process Control","236157539":"The Selection of Prior Distributions by Formal Rules","237799517":"MODELSELECTIONAND ACCOUNTINGFOR MODEL UNCERTAINTYIN LINEAR REGRESSIONMODELS","2590804":"Model Selection for Generalized Linear Models via GLIB, with Application to Epidemiology","6440983":"Bayesian Model Averaging in Time-Series Studies of Air Pollution and Mortality","236157541":"The Intrinsic Bayes Factor for Model Selection and Prediction","259118855":"Marginal reversible jump Markov chain Monte Carlo with application to motor unit number estimation","4914226":"Local model uncertainty and incomplete-data bias","5293096":"Some notes on parametric link functions in clinical research","268579962":"Efficient Bayesian Estimates for Discrimination among Topologically Different Systems Biology Models","241606685":"Speciflcation of prior distributions under model uncertainty","237198431":"Model Uncertainty and Bayesian Model Averaged Benchmark Dose Estimation for Continuous Data","220492122":"Modeling of multi-strata forest fire severity using Landsat TM Data","2730071":"Markov Chain Monte Carlo Model Determination for Hierarchical and Graphical Log-linear Models","251528319":"Bayesian variable selection using a cost-penalised approach, with application to cost-eective measurement of quality of health care","234135926":"\"Banking, debt and currency crisis: early warning indicators for developed countries\"","6565602":"“Education and Black-White Interracial Marriage.”","1920149":"Analysis of Comparative Data with Hierarchical Autocorrelation","228974892":"Bayesian Inference for Geostatistical Regression Models","215785045":"Prevalence of Low Physical Activity and its Relation to Social Environment in Deprived Areas in the London Borough of Redbridge","35704492":"Plausible prediction by Bayesian inference /","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","257017311":"Modified versions of the Bayesian Information Criterion for sparse Generalized Linear Models","229238054":"Bayesian Methods for DNA Microarray Data Analysis","46447703":"Default Priors and Predictive Performance in Bayesian Model Averaging, with Application to Growth Determinants","2326192":"Testing Nonnested Models of International Relations: Reevaluating Realism","222651857":"Bayesian model choice based on Monte Carlo estimates of posterior model probabilities","2372273":"Bayesian Variable Selection and the Swendsen-Wang Algorithm","5233370":"Bayesian Variable and Model Selection Methods for Genetic Association Studies","5654720":"Imputing missing genotypic data of single-nucleotide polymorphisms using neural networks","277725205":"Adaptive radiations in butterflies: Evolutionary history of the genus Erebia (Nymphalidae: Satyrinae)","222359513":"Problèmes méthodologiques dans les études écologiques santé–environnement","233192319":"Stochastic Search Variable Selection for Log-linear Models","220055942":"Default Bayesian model determination methods for generalised linear mixed models","222408157":"Testing functional forms in energy modeling: An application of the Bayesian approach to U.S. electricity demand","230001448":"On the application of the CES-D with the elderly: Dimensional structure and artifacts resulting from oppositely worded items","2678454":"Bayesian Tests And Model Diagnostics In Conditionally Independent Hierarchical Models","13537360":"Multi-centre analysis revisited","233185657":"Modelling skewness and kurtosis with the BCPE density in GAMLSS","2820788":"Accounting for Model Uncertainty in Poisson Regression Models: Particulate Matter and Mortality in Birmingham, Alabama","272847586":"Testing hypotheses about medical test accuracy: considerations for design and inference","279515661":"Identifying Operational Design Factors that Influence GAGD Process Performance in a Heterogeneous Oil Sandstone Reservoir Using Bayesian Model Averaging","2614914":"Hypothesis Testing and Model Selection Via Posterior Simulation","258150346":"The Generalized Multilevel Facets Model for Longitudinal Data","229104909":"Generalizing parametric models by introducing trial-by-trial parameter variability: The case of TVA","2295951":"Bayesian Analysis of Multivariate Mortality Data With Large Families","51690938":"A Bayesian approach to risk-adjusted outcome monitoring in healthcare","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","221338499":"Methods in Case-Based Classification in Bioinformatics: Lessons Learned","226662705":"Model-based Clustering with Noise: Bayesian Inference and Estimation","268236616":"Transformation-based model averaged tail area inference","280240640":"On Effect Measures, Heterogeneity, and the Laws of Nature","49729091":"The Role of the Noradrenergic System in the Exploration–Exploitation Trade-Off: A Psychopharmacological Study","11452953":"Assessment of Response Bias in Mild Head Injury: Beyond Malingering Tests","250755141":"Bayesian Methods and Simulation-Based Computation for Contingency Tables","250750538":"Analyzing Quantitative Trait Loci for the Arabidopsis thaliana using Markov Chain Monte Carlo Model Composition with restricted and unrestricted model spaces","259354573":"An Overview of Bayesian Methods for Neural Spike Train Analysis","256756212":"Forecasting streamflows in Australia using the tropical Indo-Pacific thermocline as predictor","255597952":"Bayesian Model Averaging for Multiple Structural Change Models","223163378":"Fluctuations in glycosylated hemoglobin (HbA1C) as a predictor for the development of diabetic nephropathy in type 1 diabetic patients","254308247":"State-Space Modeling of Animal Movement and Mortality with Application to Salmon","2744553":"Simulation Based Model Checking for Hierarchical Models","238504183":"Bayesian analysis for extreme climatic events: A review","263613815":"Bayes factors","233259814":"A Criterion for Optimal Predictive Model Selection","223191439":"Bayesian Change-Point Analysis in Hydrometeorological Time Series. Part 2. Comparison of Change-Point Models and Forecasting","228429663":"Instructions on how to use the gamlss package in R Second Edition","11611253":"Variable selection and Bayesian model averaging in case-control studies","226096061":"An Anthology of Probabilistic Models for Medical Informatics","2583278":"Bayesian Variable and Transformation Selection in Linear Regression","216769057":"Quantifying Hypoxia Impacts on an Estuarine Demersal Community Using a Hierarchical Ensemble Approach","233494305":"Efficient Approximations for the Marginal Likelihood of Bayesian Networks with Hidden Variables","221533689":"Quantitative Trait Loci Analysis Using a Bayesian Framework.","2579177":"On the Accuracy of Stochastic Complexity Approximations","23954850":"Bayesian projection approaches to variable selection and exploring model uncertainty","255578592":"The Use of Bayesian Model Averaging to Better Represent Uncertainty in Ecological Models","279636087":"Effects of variation in nest curtain design on pre-laying behaviour of domestic hens","24016270":"Approximate Bayesian Inference in Spatial Generalized Linear Mixed Models","249734144":"Determinants of Support for EU Membership in Turkey","264312610":"Banking, Debt, and Currency Crises in Developed Countries: Stylized Facts and Early Warning Indicators","8211097":"Comparison of Bayesian model averaging and stepwise methods for model selection in logistic regression. Stats Med","222997934":"Application of generalized link functions in developing accident prediction models","251760617":"Model weights for model choice and averaging","228676937":"Combining methods in supervised classification: A comparative study on discrete and continuous problems","243767404":"The Schwarz Criterion and Related Methods for Normal Linear Models","222708653":"Benchmark priors for Bayesian Model Averaging. J Econom 100: 381-427","2299598":"Model Selection and Accounting for Model Uncertainty in Linear Regression Models","222366124":"Bayesian Analysis of The Error Correction Model","228705104":"A hierarchical bayes approach to variable selection for generalized linear models","265642784":"Memory Without Consolidation: Temporal Distinctiveness Explains Retroactive Interference","256919978":"On the consistency of coordinate-independent sparse estimation with BIC","4745396":"Modeling the Survival of Chinook Salmon Smolts Outmigrating Through the Lower Sacramento River System","2738903":"Estimating Bayes Factors via Posterior Simulation With the Laplace-Metropolis Estimator","233837302":"Integrating fossils with molecular phylogenies improves inference of trait evolution","265922771":"Bayesian Risk Management -\"Frequency Does Not Make You Smarter\"","4746051":"Predictive Variable Selection in Generalized Linear Models","227689113":"Generalized additive models for location, scale and shape (GAMLSS). R J Stat Softw","254287396":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","258855011":"Evaluating Predictors of Dispersion: A Comparison of Dominance Analysis and Bayesian Model Averaging","242126689":"Analysis of Association Studies: Candidate Regions and Quantitative Traits","239348043":"A Bayesian approach for quantification of model uncetainty","220286515":"On Bayesian model and variable selection using MCMC","259385446":"Bayesian Model Selection in Complex Linear Systems, as Illustrated in Genetic Association Studies","266262219":"The Overlooked Potential of Generalized Linear Models in Astronomy - I: Binomial Regression","237556528":"CHANGEPOINT AND CHANGECURVE MODELINGIN STOCHASTICPROCESSES AND SPATIAL STATISTICS","51816975":"Bayesian Multimodel Inference for Geostatistical Regression Models","251144675":"Combining Models in Discrete Discriminant Analysis Through a Committee of Methods","249612285":"A Consensus Model for Seasonal Hurricane Prediction","257435719":"Bayesian learning of inverted Dirichlet mixtures for SVM kernels generation","2504967":"Bayesian Variable Selection Using the Gibbs Sampler","51049000":"Evolved Structure of Language Shows Lineage-Specific Trends in Word-Order Universals","5591409":"Single nucleotide polymorphisms refine QTL intervals for hip joint laxity in dogs","239591779":"Multimodel Inference for Reserving","230631067":"[Bayesian Model Averaging: A Tutorial]: Comment","220363786":"Bayesian Inference for Categorical Data Analysis","257460849":"Statistical strategies for constructing health risk models with multiple pollutants and their interactions: Possible choices and comparisons","44631939":"Quantitative Trait Nucleotide Analysis Using Bayesian Model Selection","32897246":"Changes in post-marital residence precede changes In descent systems in Austronesian societies","251103708":"A Comparative Study on Discrete Discriminant Analysis through a Hierarchical Coupling Approach","2844935":"Inference in Model-Based Cluster Analysis","50906662":"A Bayesian Model Averaging Approach for Estimating the Relative Risk of Mortality Associated with Heat Waves in 105 U.S. Cities","44696452":"A Bayesian model averaging approach with non-informative priors for cost-effectiveness analyses","268069578":"Biometrika highlights from volume 28 onwards","3411717":"Model uncertainty: Theory and practical implications","2612499":"Bayesian Model Averaging for Linear Regression Models","265577696":"Statistical Modelling using GAMLSS in R","235509564":"Bridging stylized facts in finance and data non-stationarities","262903964":"Climate-related hydrological regimes and their effects on abundance of juvenile blue crabs ( Callinectes sapidus ) in the northcentral Gulf of Mexico","228313260":"Limited Information Bayesian Model Averaging for Dynamic Panels with an Application to a Trade Gravity Model","252506166":"Partner wealth predicts self-reported orgasm frequency in a sample of Chinese women","255622657":"Approximate Predictive Densities and Fully Bayes Variable Selection in Generalized Linear Models","222077953":"Same or different? Insights into the etiology of phonological awareness and rapid naming","228825757":"Bayesian Models for Variable Selection that Incorporate Biological Information","5207408":"Adaptive sampling for Bayesian variable selection","38012164":"Bayesian model selection using test statistics","228452060":"Secure Bayesian model averaging for horizontally partitioned data","232740510":"Gowell CP, Quinn TP, Taylor EB.. Coexistence and origin of trophic ecotypes of pygmy whitefish, Prosopium coulterii, in a south-western Alaskan lake. J Evol Biol 25: 2432-2448","227649236":"Bayesian Model Averaging in Proprtional Hazard Models: Assessing the Risk of a Stroke","7070510":"Frequentist Model-averaged Estimators and Tests for Univariate Twin Models","243784641":"AN ASSESSMENT OF BAYESIAN MODEL-AVERAGED LOGISTIC REGRESSION FOR INTENSIVE-CARE PROGNOSIS","227518149":"Statistics In Sociology, 1950–2000: A Selective Review","226673352":"Bayesian Model Selection in Factor Analytic Models","237866342":"Evidence for associations between SilviScan-measured wood properties and intraring checking in a study of twenty-nine 6-year-old Pinus radiata","1743700":"Constraining Coronal Heating: Employing Bayesian Analysis Techniques to Improve the Determination of Solar Atmospheric Plasma Parameters","222433293":"Model combining in factorial data analysis","226371629":"Bayesian Variable Selection in Generalized Linear Mixed Models","222824987":"Bayesian model comparison based on expected posterior priors for discrete decomposable graphical models","13404564":"Heritability Estimates from Human Twin Data by Incorporating Historical Prior Information","24031798":"Wilcoxon-type generalized Bayesian information criterion","255577186":"BAYESIAN METHODS TO IMPUTE MISSING COVARIATES FOR CAUSAL INFERENCE AND MODEL SELECTION","221654124":"Information Mining Platforms: An Infrastructure for KDD Rapid Deployment.","5142805":"Gibbs variable selection using BUGS","278637511":"Water Science and Technology Library","23634485":"Some connections between Bayesian and non-Bayesian methods for regression model selection","5123856":"Is Growth Enough? Macroeconomic Policy and Poverty Reduction","255736929":"Testosterone Levels Are Negatively Associated with Childlessness in Males, but Positively Related to Offspring Count in Fathers","228974330":"A Bayesian Model Averaging Approach to Enhance Value Investment","220056190":"Bayesian projection approaches to variable selection in generalized linear models","51691632":"Two-Level Stochastic Search Variable Selection in GLMs with Missing Predictors","7241993":"INAUGURAL ARTICLE by a Recently Elected Academy Member:Linkage analysis of quantitative traits for obesity, diabetes, hypertension, and dyslipidemia on the island of Kosrae, Federated States of Micronesia","270671178":"Does Capital at Home Matter More Than Capital at School? The Case of Adolescent Alcohol and Marijuana Use","46430120":"Using the Bayesian information criterion to develop two-stage model-robust and model-sensitive designs","4993312":"Model determination for categorical data with factor level merging","7865109":"Model Uncertainty and Risk Estimation for Experimental Studies of Quantal Responses","281808801":"Spatial Bayesian variable selection and grouping for high-dimensional scalar-on-image regression","38958883":"What Distinguishes Weight-Loss Maintainers from the Treatment-Seeking Obese? Analysis of Environmental, Behavioral, and Psychosocial Variables in Diverse Populations","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","23141910":"Multiple Parameterization for Hydraulic Conductivity Identification","232284321":"A solution to separation for clustered binary data","2598236":"Event History Modeling of World Fertility Survey Data","253595233":"The Interracial Context of Educational Partnering within Marriage","14027690":"Predictive Model Selection for Repeated Measures Random Effects Models Using Bayes Factors","271928247":"Assessment of regression kriging for spatial interpolation – comparisons of seven GIS interpolation methods","241753578":"Using Model Selection Algorthims to Obtain Reliable Coefficient Estimates","5207498":"Forming post-strata via Bayesian treed capture-recapture models","263428150":"Model averaging estimation of generalized linear models with imputed covariates","2468771":"Model Uncertainty and Health Effect Studies for Particulate Matter","11822908":"A multiple imputation strategy for incomplete longitudinal data","259420414":"A \u0027Gendered Need\u0027 explanation does not fully explain lineage based differences in grandparental investment found in a large british cohort study","2607534":"Comparing Bayesian Model Class Selection Criteria by Discrete Finite Mixtures","2469295":"Prediction Via Orthogonalized Model Mixing","8465162":"Concentration of Antipneumococcal Antibodies as a Serological Correlate of Protection: An Application to Acute Otitis Media","2468777":"Strategies for Model Mixing in Generalized Linear Models","51850395":"Morphology informed by phylogeny reveals unexpected patterns of species differentiation in the aquatic moss Rhynchostegium riparioides s.l","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","225264894":"An Empirical Analysis of Software Life Spans to Determine the Planning Horizon for New Software","226535955":"Bayesian Model Uncertainty in Mixed Effects Models","227694086":"Theory \u0026 Methods: Bayesian variable selection in logistic regression: predicting company earnings direction","237062582":"pokrovsky-jb","263153207":"A Bayesian Approach to Finite Mixture Models in Bioassay via Data Augmentation and Gibbs Sampling and Its Application to Insecticide Resistance","263599150":"Modeling spatiotemporal trends in the productivity of North Pacific Salmon","249611642":"Bayesian Rainfall Variability Analysis in West Africa along Cross Sections in Space Time Grid Boxes","229676586":"Bayesian Methods for Contingency Tables","220521151":"Model Selection for Neural Network Classification.","271889839":"Does capital at home matter more than capital at school? Social capital effects on academic achievement","228310534":"Determinants of Foreign Direct Investment","222642394":"Bayesian model comparison in generalized linear models across multiple groups","4725224":"Benchmark Priors for Bayesian Model Averaging","2750856":"Covariate Selection in Hierarchical Models of Hospital Admission Counts: A Bayes Factor Approach","225694418":"New Statistical models for long-range forecasting of southwest monsoon rainfall over India","285657255":"Mathematical Models of Cooperative Work in Product Development Projects","241103868":"157 O - A new approach to refractory carcinoma of the prostate: microtubular inhibition with estramustine and vinorelbin","223775476":"Dick, E. J. Beyond ‘lognormal versus gamma\u0027: discrimination among error distributions for generalized linear models. Fisheries Research","252679341":"Quantifying Multiple Types of Uncertainty in Physics-Based Simulation Using Bayesian Model Averaging","231946359":"Filling in the Blanks: A New Method for Estimating Campaign Effects","23694543":"Meta-Regression and Benefit Transfer: Data Space, Model Space, and the Quest for ‘Optimal Scope’","23301323":"Bayesian variable selection for the Cox regression model with missing covariates","242471385":"Two-wayBayesianhierarchicalphylogeneticmodels:Anapplicationto theco-evolutionofgp120andgp41duringandafterenfuvirtide treatment","23218895":"Bayesian adaptive model selection for optimizing group sequential clinical trials","257940719":"Monte Carlo Methods in Bayesian Statistics","5164029":"Bayesian Analysis of Stochastic \u0026 Deterministic Processes in the Error Correction Model","2469266":"Bayesian Model Averaging and Model Search Strategies","44573471":"Two-way Bayesian hierarchical phylogenetic models: An application to the co-evolution of gp120 and gp41 during and after enfuvirtide treatment","259119817":"Modeling and prediction of natural gas fracking pad landscapes in the Marcellus Shale region, USA","228204579":"Selection vs. Averaging of Logistic Credit Risk Models","235489200":"Surface and grain-boundary scattering in nanometric Cu films","227780654":"Comparing the performance of two indices for spatial model selection: application to two mortality data","246764811":"Marginal Likelihood for a Class of Bayesian Generalized Linear Models","226160836":"Likelihood Ratio Testing for Zero Variance Components in Linear Mixed Models","12337533":"When Should Epidemiologic Regressions Use Random Coefficients?","228597350":"The Practical Implementation of Bayesian Model Selection","229708918":"Model Uncertainty","23690926":"In search of an environmental Kuznets curve in sulphur dioxide concentrations: A Bayesian model averaging approach","254287072":"Statistics in Sociology, 1950–2000","258450606":"Reply to comment by Ming Ye et al. on “Inverse groundwater modeling for hydraulic conductivity estimation using Bayesian model averaging and variance window”","281395468":"Biogeography of the Gondwanan genus Lomatia (Proteaceae): Vicariance at continental and intercontinental scales","250823487":"References and Bibliography for the Tutorial on MCMC Bayesian Model and Variable Selection","38140811":"A generalization of BIC for the general exponential family","203394513":"Molecular Phylogenetic Analyses in Court Trials","255585515":"Application of Multinomial and Ordinal Regressions to the Data of Japanese Female Labor Market","257196165":"Bayesian variable selection in generalized linear models using a combination of stochastic optimization methods","227016794":"Determinants of foreign direct investment","249611573":"Bayesian Change-Point Analysis of Tropical Cyclone Activity: The Central North Pacific Case","2641407":"Bayesian Selection of Log-Linear Models","221203704":"Case Based Reasoning with Bayesian Model Averaging: An Improved Method for Survival Analysis on Microarray Data","2800624":"Applications of Hybrid Monte Carlo to Bayesian Generalized Linear Models: Quasicomplete Separation and Neural Networks","246845290":"Model selection in random e ects models for directed graphs using approximated Bayes factors","2689012":"Bayesian Testing and Estimation of Association in a Two-Way Contingency Table","278161227":"Confirmatory Factor Analyses of DSM-5 Posttraumatic Stress Disorder Symptoms in Psychiatric Samples Differing in Criterion A Status","2323395":"The Eect of Priors on Approximate Bayes Factors from MCMC Output","280972638":"Growth Determinants Revisited Using Limited-Information Bayesian Model Averaging","23400065":"Finding factors influencing risk: comparing Bayesian stochastic search and standard variable selection methods applied to logistic regression models of cases and controls. Stat Med","2766796":"Bayes Factors and BIC: Comment on Weakliem","6162360":"Imputation-Based Analysis of Association Studies: Candidate Regions and Quantitative Traits","24063622":"Bayesian Analysis of Nonlinear Structural Equation Models with Nonignorable Missing Data","51073248":"Approximate Predictive Densities and Their Applications in Generalized Linear Models","4742563":"Recidivism and Social Interactions","227617914":"Extended Bayesian model averaging for heritability in twin studies","23788166":"Model-Averaged Benchmark Concentration Estimates for Continuous Response Data Arising from Epidemiological Studies","261371512":"Trial-by-Trial Fluctuations in CNV Amplitude Reflect Anticipatory Adjustment of Response Caution.","240410554":"A meta-assessment for elasmobranchs based on dietary data and Bayesian networks","5005730":"Determinants Of Economic Growth: A Bayesian Panel Data Approach","221810377":"Model Selection and Psychological Theory: A Discussion of the Differences Between the Akaike Information Criterion (AIC) and the Bayesian Information Criterion (BIC)","49620737":"A genome-wide scan for tying-up syndrome in Japanese Thoroughbreds","228368488":"Bayesian Assessment of the Distribution of Insurance Claim Counts Using Reversible Jump MCMC","30483495":"Model selection in random effects models for directed graphs using approximated Bayes factors","222570173":"Markov-Switching Model Selection Using Kullback–Leibler Divergence","5991841":"Exploring Fast Computational Strategies for Probabilistic Phylogenetic Analysis","271776712":"Analysis of Cross-Classifications of Counts Using Models for Marginal Distributions: An Application to Trends in Attitudes on Legalized Abortion","4742579":"Bayesian Model Averaging With Applications to Benchmark Dose Estimation for Arsenic in Drinking Water","5124530":"A Bayesian Approach to Model Uncertainty","243102595":"Bayesian Analysis of Autocorrelated Ordered Categorical Data for Industrial Quality Monitoring"},"index":118}