{"abs":"In numerical dosimetry, the recent advances in high performance computing led to a strong reduction of the required computational time to assess the specific absorption rate (SAR) characterizing the human exposure to electromagnetic waves. However, this procedure remains time-consuming and a single simulation can request several hours. As a consequence, the influence of uncertain input parameters on the SAR cannot be analyzed using crude Monte Carlo simulation. The solution presented here to perform such an analysis is surrogate modeling. This paper proposes a novel approach to build such a surrogate model from a design of experiments. Considering a sparse representation of the polynomial chaos expansions using least-angle regression as a selection algorithm to retain the most influential polynomials, this paper proposes to use the selected polynomials as regression functions for the universal Kriging model. The leave-one-out cross validation is used to select the optimal number of polynomials in the deterministic part of the Kriging model. The proposed approach, called LARS-Kriging-PC modeling, is applied to three benchmark examples and then to a full-scale metamodeling problem involving the exposure of a numerical fetus model to a femtocell device. The performances of the LARS-Kriging-PC are compared to an ordinary Kriging model and to a classical sparse polynomial chaos expansion. The LARS-Kriging-PC appears to have better performances than the two other approaches. A significant accuracy improvement is observed compared to the ordinary Kriging or to the sparse polynomial chaos depending on the studied case. This approach seems to be an optimal solution between the two other classical approaches. A global sensitivity analysis is finally performed on the LARS-Kriging-PC model of the fetus exposure problem.","title":"A new surrogate modeling technique combining Kriging and polynomial chaos expansions – Application to uncertainty analysis in computational dosimetry","id":272101816,"url":"https://www.researchgate.net/publication/272101816_A_new_surrogate_modeling_technique_combining_Kriging_and_polynomial_chaos_expansions_-_Application_to_uncertainty_analysis_in_computational_dosimetry","names":["Pierric Kersaudy","Bruno Sudret","Nadège Varsier","Odile Picon","Joe Wiart","Journal of Computational Physics"],"references":{"45923006":"A Non-adapted Sparse Approximation of PDEs with Stochastic Inputs","234385530":"Spherical Near-Field Antenna Measurements","4772685":"Estimating percentiles of uncertain computer code outputs","3147062":"On Implementing a Numeric Huygen\u0027s Source Scheme in a Finite Difference Program to Illuminate Scattering Bodies","202924434":"Computational Electrodynamics: The Finite-Differnce Time-Domain Method","245893283":"Designs for Computer Experiments","255173563":"A weighted L1-minimization approach for sparse polynomial chaos expansions","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","51991936":"The Wiener--Askey Polynomial Chaos for Stochastic Differential Equations","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","216301381":"The Design and Analysis Computer Experiments","240445429":"Sparse polynomial chaos expansions and adaptive stochastic finite element using a regression approach","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","257159925":"Uncertainty quantification for criticality problems using non-intrusive and adaptive Polynomial Chaos techniques","222535147":"Global sensitivity indices for nonlinear mathematical models and their Monte Carlo estimates. Math Comput Sim 55(1-3):271-280","254331268":"Sequential Design and Analysis of High-Accuracy and Low-Accuracy Computer Codes","222526449":"Global sensitivity analysis using polynomial chaos expansion","270367529":"Handbook of Mathematical Functions with Formulas, Graphs, and Mathematical Tables","234168780":"Cross Validation and Maximum Likelihood estimation of hyper-parameters of Gaussian processes with model misspecification","222906224":"Optimal Latin-hypercube designs for computer experiments","260145082":"Uncertainty propagation and sensitivity analysis in mechanical models -- Contributions to structural reliability and stochastic spectral methods","44695145":"Whole-Body Pregnant Woman Modeling By Digital Geometry Processing With Detailed Uterofetal Unit Based on Medical Images","3148405":"Total-Field versus Scattered-Field Finite-Difference Codes: A Comparative Assessment","41781559":"Gaussian Process for Machine Learning","215514388":"A Perfect Matched Layer for the Absorption of Electromagnetic Waves","251620910":"Efficient surrogate models for reliability analysis of systems with multiple failure modes","235324242":"Sensitivity Analysis","257672078":"Simplified pregnant woman models for the fetus exposure assessment","282714892":"The Homogeneous Chaos","224184453":"Influence of Plane-Wave Incidence Angle on Whole Body and Local Exposure at 2100 MHz","220411897":"Physical Systems with Random Uncertainties: Chaos Representations with Arbitrary Probability Measure","223355915":"“Adaptive sparse polynomial chaos expansions based on Least Angle Regression”","5293491":"Analysis of RF exposure in the head tissues of children and adults","264857903":"Blind Kriging: A New Method for Developing Metamodels","223079085":"An adaptive algorithm to build up sparse polynomial chaos expansions for stochastic finite element analysis","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","216756610":"Optimal Latin-hypercube designs for computer experiments","238365018":"Uncertainty Analysis of Transport-Transformation Models","226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","251012102":"Stochastic finite element: A non intrusive approach by regression","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","226970613":"Cross validation of Kriging in a unique neighborhood","228494572":"Adaptive Response Surface Method Using Inherited Latin Hypercube Design Points","223307324":"A Stochastic Projection Method for Fluid Flow: II. Random Process","5484331":"Variability analysis of SAR from 20 MHz to 2.4 GHz for different adult and child models using FDTD","4749622":"An efficient methodology for modeling complex computer codes with Gaussian processes"},"citedIn":{"280998620":"Surrogate Model Application to the Identification of Optimal Groundwater Exploitation Scheme Based on Regression Kriging Method-A Case Study of Western Jilin Province","284788378":"Low-Rank Tensor Approximations versus Polynomial Chaos Expansions for Meta-Modeling in High-Dimensional Spaces","283031609":"CF-Kriging surrogate model based on the combination forecasting method","280310254":"Estimating the small failure probability of a nuclear passive safety system by means of an efficient Adaptive Metamodel-Based Subset Importance Sampling method","282633028":"Polynomial chaos expansion in structural dynamics: Accelerating the convergence of the first two statistical moment sequences"},"index":119}