{"abs":"We consider basic ergodicity properties of adaptive MCMC algorithms under minimal assumptions, using coupling constructions. We prove convergence in distribution and a weak law of large numbers. We also give counter-examples to demonstrate that the assumptions we make are not redundant.","title":"Coupling and Ergodicity of Adaptive MCMC","id":245810545,"url":"https://www.researchgate.net/publication/245810545_Coupling_and_Ergodicity_of_Adaptive_MCMC","names":["Gareth O. Roberts","S. Rosenthal"],"references":{"227423307":"Polynomial ergodicity of Markov transition kernels","220345321":"A note on disagreement percolation","228280215":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","244492575":"Quantitative Convergence Rates of Markov Chains: A Simple Account","2118639":"Baxendale, P.H.: Renewal theory and computable convergence rates for geometrically ergodic Markov chains. Ann. Appl. Probab. 15(1B), 700-738","243773142":"A Modern Approach to Probability Theory","38350298":"Convergence properties of perturbed Markov chains","244475140":"On the ergodicity properties of some adaptive Markov Chain Monte Carlo algorithms","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","2574717":"Controlled MCMC for optimal sampling","38339733":"Polynomial Convergence Rates of Markov Chains","257146993":"Corrigendum to “Bounds on regeneration times and convergence rates for Markov chains” : [Stochastic Processes and their Applications 80 (1999) 211–229]","245198655":"Adaptive Markov Chain Monte Carlo","200111118":"Markov Chains and Stochastic Stability","38357612":"Discussion: Markov Chains for Exploring Posterior Distributions","2111878":"General state space Markov chains and MCMC algorithms","227425256":"One-shot coupling for certain stochastic recursive sequences","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","3114818":"A Stochastic Approximation Method","241475543":"Identification of Regeneration Times in MCMC Simulation, With Application to Adaptive Schemes","2241494":"Computable Bounds For Subgeometrical And Geometrical Ergodicity","271513115":"Bounds on regeneration times and convergence rates for Markov chainsfn1fn1Work supported in part by NSF Grant DMS 9504561 and EPSRC grant GR/J19900.","38322292":"An Adaptive Metropolis Algorithm","2852694":"Faithful Couplings of Markov Chains: Now Equals Forever"},"citedIn":{"28361010":"Adaptive MCMC Methods With Applications in Environmental and Geophysical Model","227522317":"Particle Markov Chain Monte Carlo . . .","241251938":"OPTIMAL SCALING OF METROPOLIS-COUPLED MARKOV CHAIN MONTE CARLO","245491746":"Non-linear Markov Chain Monte Carlo","224983659":"On the stability of some controlled Markov chains and its applications\nto stochastic approximation with Markovian dynamic","226284538":"Markov Chain Monte Carlo Algorithms: Theory and Practice","237819558":"Des R esultats th eoriques sur les algorithmes","265756763":"An ergodicity result for Adaptive Langevin Algorithms","228280215":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","51978901":"Comparison between Standard and Adaptive MCMC via their diffusion limits","49458431":"A tutorial on adaptive MCMC","225619581":"Analysis of Clustered Binary Data With Unequal Cluster Sizes: A Semiparametric Bayesian Approach","228337292":"Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","273157850":"Accelerating Metropolis-Hastings algorithms by Delayed Acceptance","51893775":"Density Estimation and Classification via Bayesian Nonparametric\nLearning of Affine Subspaces","234140271":"Diffusive Limits for Adaptive MCMC for Normal Target densities","228573826":"On Adaptive Metropolis-Hastings Methods","228573824":"Tuning of Markov chain Monte Carlo algorithms using copulas","46583525":"Estimating Discrete Markov Models From Various Incomplete Data Schemes","242698835":"INVERSION DE DONNEES IRMf. ESTIMATION ET SELECTION DE MODELES","279260160":"The Nearest Neighbor entropy estimate: an adequate tool for adaptive MCMC evaluation","264851808":"Quasi-Newton Methods for Markov Chain Monte Carlo","228789130":"Examples of adaptive MCMC","277238063":"Lower bounds on the convergence rates of adaptive MCMC methods","251425239":"Bayesian calibration of a large-scale geothermal reservoir model by a new adaptive delayed acceptance Metropolis Hastings algorithm","257665515":"An adaptive approach to Langevin MCMC","51916712":"On nonlinear Markov chain Monte Carlo","232063589":"Adaptive MCMC with online relabeling (Extended version)","24148035":"Adaptive independent Metropolis--Hastings","237323280":"SUPPLEMENT TO \"INFERENCE IN DYNAMIC DISCRETE CHOICE MODELS WITH SERIALLY CORRELATED UNOBSERVED STATE VARIABLES\" (Econometrica, Vol. 77, No. 5, September 2009, 1665-1682)","45903114":"A copula based approach to adaptive sampling","260524720":"Time-dependent reliability analysis using Bayesian MCMC on the reduction of reservoir storage by sedimentation","259695171":"GPS-ABC: Gaussian Process Surrogate Approximate Bayesian Computation","3434638":"A low complexity user scheduling algorithm for uplink multiuser MIMO systems","220286618":"Metropolis-Hastings algorithms with adaptive proposals","257665561":"Bayesian Parameter Inference for Partially Observed Stopped Processes","257665567":"Efficient MCMC Sampling in Dynamic Mixture Models","241756333":"Parallel hierarchical sampling: A general-purpose interacting Markov chains Monte Carlo algorithm","229159790":"Bayesian adaptive Markov chain Monte Carlo estimation of genetic parameters","228665450":"Parameter inference for stopped processes","227630301":"Inference in Dynamic Discrete Choice Models With Serially orrelated Unobserved State Variables","256919966":"In mixed company: Bayesian inference for conditional copulas models with discrete and continuous outcomes","278629589":"Simulation Based Nearest Neighbor Entropy Estimation for (Adaptive) MCMC Evaluation","4812038":"AMCMC: An R interface for adaptive MCMC","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","268474963":"Extracting the Italian output gap: a Bayesian approach","228714354":"Bayesian models for sparse regression analysis of high dimensional data","228910961":"The Wang-Landau algorithm in general state spaces: applications and convergence analysis","266060557":"A note on formal constructions of sequential conditional couplings","220286454":"Towards optimal scaling of Metropolis-coupled Markov chain Monte Carlo","24111924":"An Adaptive Version for the Metropolis Adjusted Langevin Algorithm with a Truncated Drift","50981205":"Adaptive Error Modelling in MCMC Sampling for Large Scale Inverse Problems","45881822":"Limit theorems for some adaptive MCMC algorithms with subgeometric kernels: Part II","253441016":"Optimal Proposal Distributions and Adaptive MCMC","23757708":"A cautionary tale on the efficiency of some adaptive Monte Carlo schemes","5271479":"Extension of the SAEM algorithm for nonlinear mixed models with 2 levels of random effects","29605163":"Des Résultats théoriques sur les algorithmes Monte Carlo par chaînes de Markov","221986001":"Hierarchical multispectral galaxy decomposition using a MCMC algorithm with multiple temperature simulated annealing","1742454":"Limit theorems for some adaptive MCMC algorithms with subgeometric kernels (II","265179939":"Some Results on the Ergodicity of Adaptive MCMC Algorithms","220286671":"On population-based simulation for static inference","220129006":"A Stochastic Optimization Approach for Joint Relay Assignment and Power Allocation in Orthogonal Amplify-and-Forward Cooperative Wireless Networks","228447342":"Nonparametric Bayes Regression and Classification Through Mixtures of Product Kernels","251458824":"Explicit control of subgeometric ergodicity","267706508":"Joint Modeling of a Matrix with Associated Text via Latent Binary Features","257069355":"Dynamic Blocking and Collapsing for Gibbs Sampling","5848742":"BGX: a Bioconductor package for the Bayesian integrated analysis of Affymetrix GeneChips","221344846":"Tree-Structured Infinite Sparse Factor Model"},"index":130}