{"abs":"Markov chain Monte Carlo (MCMC) methods are currently enjoying a surge of interest within the statistical community. The goal of this work is to formalize and support two distinct adaptive strategies that typically accelerate the convergence of an MCMC algorithm. One approach is through resampling; the other incorporates adaptive switching of the transition kernel. Support is both by analytic arguments and simulation study. Application is envisioned in low-dimensional but nontrivial problems. Two pathological illustrations are presented. Connections with reparameterization are discussed as well as possible difficulties with infinitely often adaptation.","title":"On Markov Chain Monte Carlo Acceleration","id":247011232,"url":"https://www.researchgate.net/publication/247011232_On_Markov_Chain_Monte_Carlo_Acceleration","names":["Alan E. Gelfand","Sujit K. Sahu","Journal of Computational and Graphical Statistics"],"references":{"227424526":"Simple conditions for the convergence of the Gibbs sampler and Metropolis–Hastings algorithm","38363016":"Geometric Bounds for Eigenvalues of Markov Chains","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","261593363":"Stochastic Simulation","245773359":"Consistency conditions for probability estimators and integrals of density estimators","240205403":"Random polynomial time algorithms for sampling from joint distributions","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","221669734":"Equations of State Calculations by Fast Computing Machines","38363224":"Inference From Iterative Simulation Using Multiple Sequences","246784422":"Maximum-likelihood estimation for constrained- or missing-data models","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","244475332":"On the Convergence of Successive Substitution Sampling","225304570":"Non-Uniform Random Variate Generation","224817276":"Nonparametric Density Estimation: The L1 View","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","38357609":"Markov Chains for Exploring Posterior Distributions","261625017":"Density Estimation for Statistics and Data Analysis","2599041":"How Many Iterations in the Gibbs Sampler?","235361263":"Bayesian Statistics Without Tears: A Sampling-Resampling Perspective","243776875":"Spatial Statistics and Bayesian Computing","246972427":"Nonparametric Density Estimation: The L1 View","245943504":"DISCUSSION ON THE MEETING ON THE GIBBS SAMPLER AND OTHER MARKOV CHAIN-MONTE CARLO METHODS","246157584":"Facilitating the Gibbs Sampler: The Gibbs Stopper and the Griddy-Gibbs Sampler","216636373":"Constrained Monte Carlo Maximum LIkelihood for Dependent Data","243657400":"Finite Markov Processes and Their Applications. Wiley, New York"},"citedIn":{"50893706":"Automatic Step Size Selection in Random Walk Metropolis Algorithms","228716583":"Selection of a Metropolis-Hastings simulation strategy via an entropy convergence criterion","222167092":"On the latent estimation of nonlinear population dynamics using Bayesian and non-Bayesian state-space models","2767014":"Some Adaptive Monte Carlo Methods for Bayesian Inference","220637994":"How to sample from a truncated distribution if you must","228280215":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","49458431":"A tutorial on adaptive MCMC","31123925":"Generalised Gibbs sampler and multigrid Monte Carlo for Bayesian computation","228337292":"Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection","273157850":"Accelerating Metropolis-Hastings algorithms by Delayed Acceptance","266562928":"Practical options for selecting data-driven or physics-based prognostics algorithms with reviews","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","228395966":"Adaptive Metropolis-Hastings samplers for the Bayesian analysis of large linear Gaussian systems","2127878":"Selection of a MCMC simulation strategy via an entropy convergence criterion","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","4020757":"Density estimation for measurement purposes and convergence improvement using MCMC","10783373":"Exploring heterogeneity in tumour data using Markov chain Monte Carlo","277238063":"Lower bounds on the convergence rates of adaptive MCMC methods","3091331":"Markov Chain Monte Carlo Posterior Density Approximation for a Groove-Dimensioning Purpose","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","227276601":"An Introduction to MCMC for Machine Learning","241475543":"Identification of Regeneration Times in MCMC Simulation, With Application to Adaptive Schemes","45864462":"Regeneration and Fixed-Width Analysis of Markov Chain Monte Carlo Algorithms","254323613":"The posterior probability distribution of traffic flow: A new scheme for the assignment of stochastic traffic flow","241355476":"Bayesian inference in physics","268458166":"Options for Prognostics Methods: A review of data-driven and physics-based prognostics","220286618":"Metropolis-Hastings algorithms with adaptive proposals","38322292":"An Adaptive Metropolis Algorithm","47934875":"Adaptive Markov Chain Monte Carlo Algorithms with Geophysical Applications","23977647":"Controlled MCMC for Optimal Sampling","2608740":"Inference and Monitoring Convergence (chapter for Gilks, Richardson, and Spiegelhalter book)","277286467":"Applying MCMC Methods to . . .","4897039":"On the influence of the proposal distributions on a reversible jump MCMC algorithm applied to the detection of multiple change-points","228859874":"How to compare MCMC simulation strategies?","4719491":"Exact Structural Inference in Optimal Job-Search Models","273703579":"Gradient-free MCMC Methods for Dynamic Causal Modelling.","277332043":"A Robust MCMC-based Method for Piecemeal Estimation of Distributional Features in Continuous Data","26763849":"Uncovering mental representations with Markov chain Monte Carlo","271620582":"Assessing convergence of the Markov chain Monte Carlo algorithms: A review","250185919":"Experiences With Markov Chain Monte Carlo Convergence Assessment in Two Psychometric Examples","2574717":"Controlled MCMC for optimal sampling","227368919":"[Review] Bayesian Methods: A Social and Behavioral Sciences Approach","228397889":"Ergodicity of Adaptive Monte Carlo","4993296":"On the use of local optimizations within Metropolis-Hastings updates","43500657":"Adaptive independence samplers","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","259088770":"The 1-1000μm spectral energy distributions of far-infrared galaxies","270008555":"A self-cognizant dynamic system approach for prognostics and health management","280496847":"Gradient-based MCMC samplers for Dynamic Causal Modelling"},"index":135}