{"abs":"In this paper, we shall optimize the efficiency of Metropolis algorithms for multidimensional target distributions with scaling terms possibly depending on the dimension. We propose a method for determining the appropriate form for the scaling of the proposal distribution as a function of the dimension, which leads to the proof of an asymptotic diffusion theorem. We show that when there does not exist any component with a scaling term significantly smaller than the others, the asymptotically optimal acceptance rate is the well-known 0.234.","title":"Bédard, M.: Weak convergence of metropolis algorithms for non-i.i.d. target distributions. Ann. Appl. Probab. 17, 1222-1244","id":1771219,"url":"https://www.researchgate.net/publication/1771219_Bedard_M_Weak_convergence_of_metropolis_algorithms_for_non-iid_target_distributions_Ann_Appl_Probab_17_1222-1244","names":["Mylène Bédard","The Annals of Applied Probability"],"references":{"38363050":"[Bayesian Computation and Stochastic Systems]: Comment","4771819":"Probability and Random Processes","243103678":"[Bayesian Computation and Stochastic Systems]: Rejoinder","2113732":"Optimal Scaling of Mala for Nonlinear Regression","2111878":"General state space Markov chains and MCMC algorithms","236157562":"Markov Processes: Characterization and Convergence","245994595":"Efficient Sampling Using Metropolis Algorithms: Applications of Optimal Scaling Results","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","243776875":"Spatial Statistics and Bayesian Computing","243787882":"OPTIMAL SCALING OF MALA FOR NONLINEAR REGRESSION1","235726242":"A First Look at Rigorous Probability Theory","221669734":"Equations of State Calculations by Fast Computing Machines","227425151":"From Metropolis to Diffusions: Gibbs States and Optimal Scaling. Stochastic Process","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","2129242":"Optimal scaling for partially updating MCMC algorithms","222298844":"Optimal acceptance rates for Metropolis algorithms: Movin beyond 0.234","2834582":"Scaling Limits for the Transient Phase of Local Metropolis-Hastings Algorithms"},"citedIn":{"229316328":"Scaling analysis of multiple-try MCMC methods","237486625":"MCMC in High Dimensions","257620188":"Scaling Analysis of Delayed Rejection MCMC Methods","225997183":"Computational Complexity of Metropolis-Hastings Methods in High Dimensions","245994595":"Efficient Sampling Using Metropolis Algorithms: Applications of Optimal Scaling Results","50235701":"Optimal scaling and diffusion limits for the Langevin algorithm in high dimensions. Ann. Appl. Probab. 22, 2320-2356","227719006":"Optimal scaling of Metropolis algorithms: Heading toward general target distributions","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","45895665":"Adaptive Gibbs samplers","49458431":"A tutorial on adaptive MCMC","231049995":"Revised and Extended Analysis of Eight-times Ionized Barium: Ba IX and Nine-times Ionized Barium: Ba X","228343756":"MCMC Methods for Sampling Function Space","45907693":"Diffusion limits of the random walk Metropolis algorithm in high dimensions authors. Ann. Appl. Probab. 22, 881-930","45866217":"Optimal scalings for local Metropolis--Hastings chains on nonproduct targets in high dimensions","47843593":"The Random Walk Metropolis: Linking Theory and Practice Through a Case Study","225635105":"Optimal Scaling of Random Walk Metropolis Algorithms with Non-Gaussian Proposals","265028824":"Weak Convergence and Optimal Proposals for Monte Carlo Algorithms","233967527":"Optimal scaling for the transient phase of Metropolis Hastings algorithms: The longtime behavior","232143555":"Observing the Galaxy\u0027s massive black hole with gravitational wave bursts","245025933":"On Optimal Scaling of Additive Transformation Based Markov Chain Monte Carlo","242267303":"Sampling Function Space: MCMC in High Dimensions","267469417":"Error bounds and normalising constants for sequential Monte Carlo samplers in high dimensions","259742946":"Minimising MCMC Variance via Diffusion Limits, with an Application to Simulated Tempering by","222298844":"Optimal acceptance rates for Metropolis algorithms: Movin beyond 0.234","275897326":"A Survey of Stochastic Simulation and Optimization Methods in Signal Processing","232276216":"Optimal scaling of random walk Metropolis algorithms with discontinuous\ntarget densities","30045859":"Optimal Scaling for Random Walk Metropolis on Spherically Constrained Target Densities","228789130":"Examples of adaptive MCMC","50425579":"On the Stability of Sequential Monte Carlo Methods in High Dimensions","251211218":"On a Directionally Adjusted Metropolis-Hastings Algorithm","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","45870805":"Optimal scaling of the random walk Metropolis on elliptically symmetric unimodal targets","277289463":"Optimal scaling of Metropolis algorithms: is 0.234 as robust as believed?","239593783":"Methodology for Inference on the Markov Modulated Poisson Process and Theory for Optimal Scaling of the Random Walk Metropolis","262071405":"On Optimal Scaling of Additive Transformation Based Markov Chain Monte Carlo Under Non-Regular Cases","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","237312400":"MCMC Methods in High Dimension","258234143":"Optimal scaling of the random walk Metropolis: general criteria for the 0.234 acceptance rule","232718818":"Optimal scaling for the transient phase of the random walk Metropolis algorithm: The mean-field limit","271855369":"Bayesian computation: a perspective on the current state, and sampling backwards and forwards","48198752":"Adaptive Gibbs samplers and related MCMC methods"},"index":137}