{"abs":"Markov chain Monte Carlo using the Metropolis-Hastings algorithm is a general method for the simulation of stochastic processes having probability densities known up to a constant of proportionality. Despite recent advances in its theory, the practice has remained controversial. This article makes the case for basing all inference on one long run of the Markov chain and estimating the Monte Carlo error by standard nonparametric methods well-known in the time-series and operations research literature. In passing it touches on the Kipnis-Varadhan central limit theorem for reversible Markov chains, on some new variance estimators, on judging the relative efficiency of competing Monte Carlo schemes, on methods for constructing more rapidly mixing Markov chains and on diagnostics for Markov chain Monte Carlo.","title":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","id":38363225,"url":"https://www.researchgate.net/publication/38363225_Practical_Markov_Chain_Monte_Carlo_Stat_Sci_7_473-483","names":["Charles J. Geyer","Statistical Science"],"references":{},"citedIn":{"233453038":"Bayesian inference for multinomial populations under stochastic ordering","38326862":"Honest Exploration of Intractable Probability Distributions Via Markov Chain Monte Carlo","261117851":"Thirty years of “Batch Size Effects”","228627884":"Standard error estimation of 3PL IRT true score equating with an MCMC method","261253021":"A prefetching technique for prediction of porous media flows","261728138":"Improper and proper posteriors with improper priors in a hierarchical model with a beta-binomial likelihood","251404008":"Whither PQL?","229100978":"Bayesian Auxiliary Variable Models for Binary and Multinomial Regression","285368599":"Engineering Optimization","242536034":"Estimation of Bayes Factors in a Class of Hierarchical Random Effects Models Using a Geometrically Ergodic MCMC Algorithm","256663380":"Spherical Hamiltonian Monte Carlo for Constrained Target Distributions","260003686":"Empirical Bayes unfolding of elementary particle spectra at the Large Hadron Collider","38357609":"Markov Chains for Exploring Posterior Distributions","233858512":"Parameter estimation for crop models","4773994":"MCMC for integer-valued ARMA processes","224642372":"A CAN-based distributed control system for upper limb myoelectric prosthesis","2676740":"Ordering, Slicing And Splitting Monte Carlo Markov Chains","12019865":"Dual Screening","12019847":"Modeling a Poisson Forest in Variable Elevations: A Nonparametric Bayesian Approach","222817655":"Stochastic spectral method for efficient Bayesian solution of inverse problems","279392403":"Missing Data","51211066":"Does storage time in LN2 influence survival and pregnancy outcome of vitrified rabbit embryos?","255649541":"Direction Choice for Accelerated Convergence in Hit-and-Run Sampling","3137557":"Predicting dose-time profiles of solar energetic particle events using Bayesian forecasting methods","232998360":"The Monte Carlo Newton Raphson algorithm","34552372":"Phylogenetic tree construction using markov chain monte carlo /","265089008":"On Marshal-Olkin Generalized exponential distribution","237000221":"Proximal Markov chain Monte Carlo algorithms","229709297":"Bayesian estimation of molecular evolutionary trees.","237059681":"Approximation of sojourn-times via maximal couplings: Motif frequency distributions","245583586":"Benchmark Estimation for Markov Chain Monte Carlo Samples","269000780":"Bayesian Item Response Modeling: Theory and Applications","253646678":"Nested sampling for parameter inference in systems biology: Application to an exemplar circadian model","8657101":"Bayesian hierarchical error model for analysis of gene expression data","239568395":"All students who have taken the departmental qualifying examination at the Ph. D. level are eligible for this Seminar/Study Group. Those who are required to take Professor Just\u0027s AREC869J may register for his course but attend the Seminar/Study Group to receive credit","223823129":"Bayesian models for spatial incidence: A case study of suicide using the BUGS program","27685366":"Computational studies of protein-ligand molecular recognition","263983085":"Emergence of power-law and two-phase behavior in financial market fluctuations","275363896":"Langevin and Hamiltonian based Sequential MCMC for Efficient Bayesian Filtering in High-dimensional Spaces","237071991":"Transdimensional Sampling Algorithms for Bayesian Variable Selection in Classification Problems With Many More Variables Than Observations","228097476":"Study of using marker assisted selection on a beef cattle breeding program by model comparison","229709292":"Meta‐analysis for complex inheritance.","228568513":"MCMC Methods for MLP-network and Gaussian Process and Stuff – A documentation for Matlab","47518346":"Efficient Markov Chain Monte Carlo Methods for Decoding Neural Spike Trains","2908236":"Exploring Imprecise Probability Assessments Based on Linear Constraints","255051600":"Genetic analysis of clinical mastitis in different risk periods by linear and threshold models","10883267":"A Bayesian analysis of the effect of selection for growth rate on growth curves in rabbits Genet","10881217":"Factors related to the risk of neonatal mortality, birth-weight and serum immunoglobulin concentration in lambs in the UK","267042694":"Bayesian Inference for Generalized Extreme Value Distributions via Hamiltonian Monte Carlo","285368687":"Engineering Optimization","265326496":"Some Bayesian inferences for von Mises distribution","222430515":"Does a Gibbs sampler approach to spatial Poisson regression models outperform a single site MH sampler?","46383792":"Investigating agreement between different data sources using Bayesian state-space models: An application to estimating NE Atlantic mackerel catch and stock abundance","222557497":"Convergence results for the -SA-ES using the theory of -irreducible Markov chains","229694922":"Genetic evaluation of dairy cattle for conformation traits using random regression models","1886305":"Tests of Bayesian Model Selection Techniques for Gravitational Wave Astronomy","2730071":"Markov Chain Monte Carlo Model Determination for Hierarchical and Graphical Log-linear Models","251569792":"Estimates of genetic parameters for stayability to consecutive calvings of Canadian Simmentals by random regression models","2459813":"Some Initial Remarks","231966032":"Effect of founder allele survival and inbreeding depression on litter size in a closed line of Large White pigs","37984969":"Stochastic Geometry, Data Structures and Applications of Ancestral Selection Graphs","14073945":"Binning Clones by Hybridization with Complex Probes: Statistical Refinement of an Inner Product Mapping Method","228687158":"A Hierarchical IRT Model for Criterion-Referenced Measurement","5572812":"Efficiency of Markov Chain Monte Carlo Tree Proposals in Bayesian Phylogenetics","224316868":"Reducing the run-time of MCMC programs by multithreading on SMP architectures","11106355":"Inbreeding effects on the parameters of the growth function in three strains of Iberian pigs","257218506":"Impact of uncertainty in expected return estimation on stock price volatility","14346363":"Simultaneously Modelling Censored Survival Data and Repeatedly Measured Covariates: a Gibbs Sampling Approach","264683361":"A Bayesian Approach to Modelling Reticulation Events with Application to the Ribosomal Protein Gene rps11 of Flowering Plants","225166786":"Stochastic adaptive selection of weights in the simulated tempering algorithm. J. Ital. Stat. Soc. 7(1), 27-55","6754509":"Analysis of litter size and days to lambing in the Ripollesa ewe. I. Comparison of models with linear and threshold approaches","235357868":"A Bayesian Nonparametric Meta-Analysis Model","31355250":"Introduction to the Special Issue","264546164":"Comparison between genetic parameters of cheese yield and nutrient recovery or whey loss traits measured from individual model cheese-making methods or predicted from unprocessed bovine milk samples using Fourier-transform infrared spectroscopy","33956535":"Exploiting graph cutsets for sampling-based approximations in Bayesian networks /","240535268":"A preliminary Bayesian analysis of incomplete longitudinal data from a small sample: Methodological advances in an international comparative study of educational inequality","223380964":"Multiple trait genetic analysis of underlying biological variables of production functions","226428363":"Mixture modelling of recurrent event times with long-term survivors: Analysis of Hutterite birth intervals","267439942":"Hyperparameter and model selection for nonparametric Bayes problems via Radon-Nikodym derivatives","228635927":"“Advances in Bayesian Time Series Modeling and the Study of Politics: Theory Testing, Forecasting, and Policy Analysis","249865773":"A Monte Carlo approach to the joint estimation of reservoir and elastic parameters from seismic amplitudes","229266784":"Bayesian analysis for uncertainty estimation of a canopy transpiration model","250404390":"Expressions for the Markov Chain CLT Variance","45130367":"Markov Chain Monte Carlo Technology","2283757":"Parameter Expansion for Data Augmentation","35484366":"Incorporation of genetic marker information in estimating model parameters for complex traits with data from large complex pedigrees e [electronic resource] /","226190755":"Spontaneous Magnetization in the Plane","226973021":"Facilitation of plant species richness and endangered species by a tussock grass in a moist tall grassland revealed using hierarchical Bayesian analysis","2302206":"A Forward Monte Carlo Method For Solving Influence Diagrams Using Local Computation","229582192":"Variation of the Maximum Likelihood Score.","237741771":"GENOTYPE X SPERM DOSAGE INTERACTION ON REPRODUCTIVE PERFORMANCE AFTER ARTIFICIAL INSEMINATION. 2. MALE LITTER SIZE","235880175":"Statistical methods for the meta-analysis of diagnostic tests must take into account the use of surrogate standards","24236437":"Discrete- and Continuous-Time Probabilistic Models and Algorithms for Inferring Neuronal UP and DOWN States","224386475":"Evolutionary MCMC Particle Filtering for Target Cluster Tracking","265015090":"Applications and Analysis of Bio-Inspired Eagle Strategy for Engineering Optimization","251342338":"Order-Constrained Bayes Inference for Dichotomous Models of Unidimensional Nonparametric IRT","23255448":"Identification of Single-Nucleotide Polymorphism in the Progesterone Receptor Gene and Its Association With Reproductive Traits in Rabbits","243103367":"Multivariate Normal Slice Sampling","236003054":"Bridges between deterministic and probabilistic models for binary data","235601674":"Exploiting the Past to Reduce Delay in CSMA Scheduling: A High-order Markov Chain Approach","42390407":"TRACER. A new approach to comparative modeling that combines threading with free-space conformational sampling","273140036":"A comparison of methods for whole-genome QTL mapping using dense markers in four livestock species","282622417":"Comparison between different statistical models for the prediction of direct genetic component on embryo establishment and survival in Italian Brown Swiss dairy cattle","6609262":"Segregation Analysis of Blood Oxygen Saturation in Broilers Suggests a Major Gene Influence on Ascites","51520028":"Genetic parameters of coagulation properties, milk yield, quality, and acidity estimated using coagulating and noncoagulating milk information in Brown Swiss and Holstein-Friesian cows","261688983":"Evaluation of the Bayesian and Maximum Likelihood Approaches in Analyzing Structural Equation Models with Small Sample Sizes","51520029":"Short communication: Statistical models for the analysis of coagulation traits using coagulating and noncoagulating milk information","256761437":"On a signal detection approach to -alternative forced choice with bias, with maximum likelihood and Bayesian approaches to estimation","23634041":"Smoothed Langevin proposals in Metropolis-Hastings algorithms","6826361":"Bayes factor for testing the genetic background of quantitative threshold traits","230954198":"Layering in crumpled sheets","227695751":"A Bayesian analysis of response to selection for uterine capacity in rabbits","259106407":"Fast quantum Monte Carlo on a GPU","263163577":"Semi-Separable Hamiltonian Monte Carlo for Inference in Bayesian Hierarchical Models","4772191":"Bayesian Inference for Non-Gaussian Ornstein-Uhlenbeck Stochastic Volatility Processes","247011232":"On Markov Chain Monte Carlo Acceleration","47819717":"Graphical Comparison of MCMC Performance","225080398":"Identifying targets of multiple co-regulating transcription factors from expression time-series by Bayesian model comparison","225068109":"Estimation of (co)variances for genomic regions of flexible sizes: Application to complex infectious udder diseases in dairy cattle","4993380":"Bayesian cure rate models for malignant melanoma: A case study of ECOG trial E1690","263736976":"A Bayesian Method of Change-point Estimation with Recurrent Regimes: Application to GARCH Models","5142883":"Lisp-Stat to Java to R","1737000":"Variance bounding Markov chains","271808768":"Partition Models in the Analysis of Autoradiographic Images","262264466":"Asymptotic Variance of Stationary Reversible and Normal Markov Processes","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","17911844":"Pulpal and periapical tissue response to butyl 2-cyanoacrylate","266964703":"Statistical Methods in Imaging","5661025":"Statistical estimation of transmission loss from geoacoustic inversion using a towed array","267196115":"MULTIPLE IMPUTATION FOR MARGINAL AND MIXED MODELS IN LONGITUDINAL DATA WITH INFORMATIVE MISSINGNESS","41712450":"Using a Bayesian approach to parameter estimation; Comparison of GLUE and MCMC methods","284076460":"Regression analysis of correlated circular data based on the multivariate von Mises distribution","228963558":"Monte Carlo integration with Markov chain","227673297":"Dated ancestral trees from binary trait data and their application to the diversification of languages","235726671":"Correction: Variable transformation to obtain geometric ergodicity in the random-walk Metropolis algorithm","23978027":"Convergence controls for MCMC algorithms with applications to hidden Markov chains","6152475":"Individual efficiency for the use of feed resources in rabbits","270741861":"RACOG and wRACOG: Two probabilistic oversampling techniques","6193424":"Analysis of beef cattle longitudinal data applying a nonlinear model","15333818":"An algorithm for Monte Carlo Estimations of genotype probabilities on complex pedigrees","245366732":"A Design-Driven Validation Approach Using Bayesian Prediction Models","12018145":"Exact Tests of Goodness of Fit of Log‐Linear Models for Rates","226862291":"Bayesian Analysis of the Discovery Process Model Using Markov Chain Monte Carlo","250754966":"Ch. 9. Empirical estimators based on MCMC data","283525504":"Fully Bayesian inference for α-stable distributions using a Poisson series representation","223579192":"Genetic evaluation of beef cattle accounting for uncertain paternity","4993312":"Model determination for categorical data with factor level merging","26603769":"A Bayesian Algorithm for Functional Mapping of Dynamic Complex Traits","268293776":"ANÁLISE DE CONFIABILIDADE POPULACIONAL PELO HIBRIDISMO ENTRE REDES BAYESIANAS E BOOTSTRAP PARAMÉTRICO","291422259":"Genetic and environmental relationships of different measures of individual cheese yield and curd nutrients recovery with coagulation properties of bovine milk","243787752":"Bayesian Estimation of Movement and Survival Probabilities from Capture- Recapture Data","252880481":"Strategies for MCMC computation in quantitative genetics","6840604":"Physiologically‐Based Pharmacokinetic Modeling of Benzene in Humans: A Bayesian Approach","2842974":"Geometric Ergodicity and Hybrid Markov Chains","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","51247739":"Allele coding in genomic evaluation","251520901":"Bayesian model selection for logistic regression models with random intercept","229100766":"Rao-Blackwellisation of Sampling Schemes","266397338":"Multiple-time-stepping generalized hybrid Monte Carlo methods","46494533":"Bayesian analysis of non-linear structural equation models with non-ignorable missing outcomes from reproductive dispersion models","265295442":"On the Equivalence Between Deep NADE and Generative Stochastic Networks","249694054":"A Unified Maximum Likelihood Approach for Analyzing Structural Equation Models With Missing Nonstandard Data","227787799":"Implementation issues for Markov Chain Monte Carlo methods in random regression test‐day models","2853283":"Genealogies from Time-Stamped Sequence Data","222704844":"Parallel and interacting Markov chain Monte Carlo algorithm","5179841":"Estimation of Hyperbolic Diffusion Using MCMC Method","264627787":"Guiding functional connectivity estimation by structural connectivity in MEG: An application to discrimination of Mild Cognitive Impaired conditions.","8182259":"Bayesian Estimation of Ancestral Character States on Phylogenies","47729484":"Bayesian inference of genetic parameters for test-day milk yield, milk quality traits, and somatic cell score in Burlina cows","239755230":"On the performance of the gibbs sampler for the multivariate normal distribution","243767057":"An Introduction to Model-Based Geostatistics","258787067":"Present kinematics of the Tjörnes Fracture Zone, North Iceland, from campaign and continuous GPS measurements","8085988":"Genetic parameters of fertility in two lines of rabbit of different reproductive potential","222659812":"Variance components of fertility in Spanish Landrace pigs","271557006":"wRACOG: A Gibbs Sampling-Based Oversampling Technique","221176972":"Literature Clustering using Citation Semantics","228387896":"Bayesian approach to zero-inflated bivariate ordered probit regression model, with an application to tobacco","2111878":"General state space Markov chains and MCMC algorithms","220269702":"Estimating and sampling graphs with multidimensional random walks.","34032557":"Genetic linkage analysis based on identity by descent using Markov chain Monte Carlo sampling on large pedigrees [microform].","228754444":"Bayesian Estimation and Model Selection of Multivariate Linear Model with Polytomous Variables","254287512":"Maximum Likelihood Estimation Under Order Restrictions by the Prior Feedback Method","241475543":"Identification of Regeneration Times in MCMC Simulation, With Application to Adaptive Schemes","245135151":"Bayesian inference of BWR model parameters by Markov chain Monte Carlo","2763166":"Von Mises type statistics for single site updated local interaction random fields","251817653":"Simulation and modelling of virtual operators for workspace design","256231165":"Review essay","223319286":"A Bayesian analysis of a simultaneous equations model for insurance rate-making","227617835":"A Bayesian method for query approximation","254287511":"Studying Convergence of Markov Chain Monte Carlo Algorithms Using Coupled Sample Paths","11245930":"Estimating Mutation Parameters, Population History and Genealogy Simultaneously From Temporally Spaced Sequence Data","3242488":"Multistage Network With Globally Controlled Switching Stages and Its Implementation Using Optical Multi-Interconnection Modules","237619175":"Presented in Partial Fulfillment of the Requirements for the Degree Doctor of Philosophy in the Graduate School of The Ohio State University","220867812":"Evolutionary Monte Carlo Based Techniques for First Passage Time Problems in Credit Risk and Other Applications in Finance","243048371":"An index sampling algorithm for the bayesian analysis of a class of model selection problems","2380273":"A Gibbs Sampling Approach To Cointegration","27814013":"Bayesian off-line detection of multiple change-points corrupted by multiplicative noise: Application to SAR image edge detection","223409286":"A comparison of hybrid strategies for Gibbs sampling in mixed graphical models","271620582":"Assessing convergence of the Markov chain Monte Carlo algorithms: A review","235923411":"Variance reduction of estimators arising from Metropolis-Hastings algorithms","228385856":"Adaptive Monte Carlo for Bayesian Variable Selection in Regression Models","2296318":"Semiparametric Bayesian Analysis Of Survival Data","258125503":"Recognizing Uncertainty in the Q-Matrix via a Bayesian Extension of the DINA Model","265317902":"Markov Chain Monte Carlo and Numerical Differential Equations","254287606":"Bayesian Tobit Modeling of Longitudinal Ordinal Clinical Trial Compliance Data With Nonignorable Missingness","2509304":"Bayesian Variable Selection for Proportional Hazards Models","2390468":"On the Index of Dissimilarity for Lack of Fit in Log Linear Models","264287779":"Analysis of non-stationary climate-related extreme events considering climate change scenarios: an application for multi-hazard assessment in the Dar es Salaam region, Tanzania","230720548":"A MATLAB package for Markov chain Monte Carlo with a multi-unidimensional IRT model","1769970":"Random Close Packing of Granular Matter","3232218":"Estimation of Transmission Loss in the Presence of Geoacoustic Inversion Uncertainty","260370026":"Optimal experiment design for model selection in biochemical networks","238866383":"Selection of importance weights for Monte Carlo estimation of normalizing constants","26806381":"METABOLICA: A statistical research tool for analyzing metabolic networks","224881809":"Approaches for Bayesian Variable Selection","246769485":"Markov chain Monte Carlo exact inference for social networks","47737637":"Parallel Markov Chain Monte Carlo","230599747":"Large-Scale Spatial and Temporal Genetic Diversity of Feline Calicivirus","51570960":"Genetic evaluation combining purebred and crossbred data in a pig breeding scheme","233426925":"Lagrangian Dynamical Monte Carlo","220286758":"Parallel multivariate slice sampling","247317686":"Chapter 15 Monte carlo simulation and numerical integration","220286764":"Markov chain Monte Carlo exact inference for binomial and multinomial logistic regression models","268426736":"Parallel Bayesian MCMC Imputation for Multiple Distributed Lag Models: A Case Study in Environmental Epidemiology","23176055":"Comparison of different nonlinear functions to describe Nelore cattle growth","2552381":"MCMC Methods for Financial Econometrics","11066036":"Potential Applications and Pitfalls of Bayesian Inference of Phylogeny","265702859":"Geometric Ergodicity of van Dyk and Meng\u0027s Algorithm for the Multivariate Student\u0027s t Model","7094862":"Bayesian Analysis of Correlated Evolution of Discrete Characters by Reversible‐Jump Markov Chain Monte Carlo","7526993":"Free energy landscape and folding mechanism of a β‐hairpin in explicit water: A replica exchange molecular dynamics study","233326539":"Formulation and Application of the Hierarchical Generalized Random-Situation Random-Weight MIRID","243770531":"Monte Carlo Exact Tests for Square Contingency Tables","220286729":"Improved auxiliary mixture sampling for hierarchical models of non-Gaussian data. Statistics and Computing, 19, 479-492","10783373":"Exploring heterogeneity in tumour data using Markov chain Monte Carlo","268056022":"A time series model for precipitation based on disaggregation and lognormal point processes","30518271":"Modélisation de signaux fortement non stationnaires à phase et à amplitude locales polynomiales.","262849950":"Interspecific relationships and environmentally driven catchabilities estimated from fisheries data","254078238":"A Negative Binomial Regression Model for Accuracy Tests","7756365":"Developing an Efficient Model to Select Emergency Department Patient Satisfaction Improvement Strategies","24052562":"Joint Bayesian Analysis of Factor Scores and Structural Parameters in the Factor Analysis Model","228026282":"Applications of the Malecot model for allelic association.","228683678":"A BAYESIAN METHODOLOGY FOR DYNAMIC MODELLING","229779441":"Non‐independence of parental transmissions in the transmission disequilibrium test (TDT).","257461533":"Genetic parameters of different measures of cheese yield and milk nutrient recovery from an individual model cheese-manufacturing process","232994731":"The Bayesian Framework for Inverse Problems in Heat Transfer","229443559":"Cluster analysis of the polygene system of determination of a quantitative trait.","228655087":"Genetic analysis of clinical mastitis during different risk periods in Finnish Ayrshire","11473632":"On Estimation and Prediction for Spatial Generalized Linear Mixed Models","41015329":"On the separation of preferences among marked point process wager alternatives","269933135":"Adaptive confidence bands for Markov chains and diffusions: Estimating the invariant measure and the drift","252804430":"Alpha-Helix Formation in C-Peptide Rnase-A Investigated by Parallel Tempering Simulations","225261327":"Geometric Ergodicity of Metropolis-Hastings Algorithms for Conditional Simulation in Generalized Linear Mixed Models","263896537":"Crossbreeding effects on pig growth and carcass traits from two Iberian strains","46538914":"Population-based reversible jump Markov chain Monte Carlo methods for Bayesian variable selection and evaluation under cost limit restrictions","241681409":"Re-considering the variance parameterization in multiple precision models","257807674":"Posterior Analysis of Stochastic Frontier Models with Truncated Normal Errors","2705984":"Processing simulation output by Riemann sums","46538923":"Racial disparities in risks of mortality in a sample of the US Medicare population","228667343":"An MCMC model search algorithm for regression problems","223749926":"Bayesian estimation of genetic parameters for test day records in dairy cattle using linear hierarchical models","8344077":"A Phylogenetic Mixture Model for Detecting Pattern-Heterogeneity in Gene Sequence or Character-State Data","228921302":"Sequential Monte Carlo Methods for Normalized Random Measure with Independent Increments Mixtures","224560918":"A Distributed Dynamical Scheme for Fastest Mixing Markov Chains","250918016":"plom-pipe: Bayesian inference for compartmental models, with a Unix flavour","226094860":"Statistical inference and Monte Carlo algorithms","280496847":"Gradient-based MCMC samplers for Dynamic Causal Modelling","228704219":"On Variance Conditions for Markov Chain CLTs","24052500":"A Method for Testing Nested Point Null Hypotheses Using Multiple Bayes Factor","275055333":"On a generalization of the preconditioned Crank-Nicolson Metropolis algorithm","7654130":"Genetic Parameters for Female Fertility Traits and a Fertility Index in Spanish Dairy Cattle","222662604":"Variational approximations in Bayesian model selection for finite mixture distributions. Comput Stat Data Anal","261717268":"Parameter-Independent Model Reduction of Transient Groundwater Flow Models: Application to Inverse Problems","46463060":"A forecast simulation analysis of the next-generation DVD market based on consumer preference data","29813588":"Estimating the parameters of gravitational waves from neutron stars using an adaptive MCMC method","227034907":"Regenerative Markov Chain Monte Carlo Methods for Pharmacokinetic/Pharmacodynamic Estimation","277234193":"Improved Credit Scoring with Multilevel Statistical Modelling","261051671":"On the estimation accuracy of degree distributions from graph sampling","228294402":"A Structural Model of Segregation in Social Networks","233394035":"Genetic analysis of rennet coagulation time, curd-firming rate, and curd firmness assessed over an extended testing period using mechanical and near-infrared instruments","11543083":"Bayesian estimation and test for factor analysis model with continuous and polytomous data in several populations","220309437":"Interpretation of Pooling Experiments Using the Markov Chain Monte Carlo Method.","3652267":"A neural network application in signal timing control","228540162":"Bayesian Methods in Conservation Biology","13847118":"Advances in statistical methods to map QTL in outbred populations","258147837":"Application of Gibbs sampling for inference in a mixed major gene-polygenic inheritance model in animal populations","1747588":"Random Loose Packing in Granular Matter","51935677":"Reverse engineering gene regulatory networks using approximate Bayesian\ncomputation","2364034":"Geometric ergodicity of Metropolis-Hastings algorithms for conditional simulation in generalised linear mixed models","50362795":"Use of genomic models to study genetic control of environmental variance","252497315":"Monte Carlo Minimization for One Step Ahead Sequential Control","225931206":"Modeling the distribution of plant species using autologistic regression model","257013216":"A semiparametric Bayesian approach to joint mean and variance models","228968214":"Neural network imputation in complex survey design","8534582":"Bayesian analysis of two-level nonlinear structural equation models with continuous and polytomous data","266798417":"Bayesian Inference for Lithium-Ion Cell Parameter Estimation","265428325":"A Regeneration Proof of the Central Limit Theorem for Uniformly Ergodic Markov Chains","268354889":"An Application of a Special Two-Class Item Response Model Using Markov Chain Monte Carlo Method","8534586":"Bayesian model comparison of nonlinear latent variable models with missing continuous and ordinal categorical data","263230729":"A Fresh Look at the Running Time Analysis for the Gibbs Sampler","247389188":"Reparameterizing the generalized linear model to accelerate Gibbs sampler convergence","255655296":"Adaptive Monte Carlo for Binary Regression with Many Regressors","285215678":"A GUI platform for uncertainty quantification of complex dynamical models","225929143":"Fisheries Stock Assessment and Decision Analysis: The Bayesian Approach","265952538":"Convergence properties of Hit-and-Run samplers","3316474":"Bayesan estimation of parameters of a damped sinusoidal model by a Markov chain Monte Carlo method","236461267":"Enhanced Modeling via Network Theory: Adaptive Sampling of Markov State Models","273703579":"Gradient-free MCMC Methods for Dynamic Causal Modelling.","236145885":"Genetic analysis of female fertility traits in Canadian Simmentals Author(s): Jamrozik, J (Jamrozik, J.)[ 1 ] ; McGrath, S (McGrath, S.)[ 2 ] ; Kemp, RA (Kemp, R. A.)[ 2 ] ; Miller, SP (Miller, S. P.)[ 1 ] Source: LIVESTOCK SCIENCE Volume: 150 Issue: 1-3 Pages: 302-309 Published: DEC 2012","2257650":"Prior Information and Generalized Questions","51814854":"Genetic basis of semen traits and their relationship with growth rate in rabbits","232064768":"Use of multivariate factor analysis to define new indicator variables for milk composition and coagulation properties in Brown Swiss cows","8233642":"Divergence Population Genetics of Chimpanzees","8669789":"Elliptical selection experiment for the estimation of genetic parameters of the growth rate and feed conversion ratio in rabbits","224577468":"The Gaussian mixture MCMC particle algorithm for dynamic cluster tracking","254057924":"Application of Stochastic Inversion to Casing Effect Correction in Through Casing Induction Logging","229752658":"Markov Chain Monte Carlo","230657884":"SIMONA 1.0: An efficient and versatile framework for stochastic simulations of molecular and nanoscale systems","38322349":"Estimating the Second Largest Eigenvalue of a Markov Transition Matrix","24052612":"Packing Densities and Simulated Tempering for Hard Core Gibbs Point Processes","242986132":"Use of the Gibbs sampler to invert large, possibly sparse, positive definite matrices","254295513":"Hypothesis Tests of Convergence in Markov Chain Monte Carlo","253742574":"Bayesian inference and Markov chain Monte Carlo in imaging","31327020":"Computational complexity of Markov chain Monte Carlo methods for finite Markov random fields","5231289":"Regional analysis of road mortality in Europe","2261724":"Markov Chain Monte Carlo For The Bayesian Analysis Of Evolutionary Trees From Aligned Molecular Sequences","2738903":"Estimating Bayes Factors via Posterior Simulation With the Laplace-Metropolis Estimator","223596113":"Chapter 56. Computationally Intensive Methods for Integration in Econometrics*","220286501":"Imaging convex quadrilateral inclusions in uniform conductors from electrical boundary measurements","262044826":"Comparison of a genetic group and Unknown paternity models for growth traits in Nellore cattle.","34416906":"Bayesian strategies for gravitational radiation data analysis /","26335899":"Respondent Driven Sampling as Markov Chain Monte Carlo","2796321":"Dynamic Conditional Independence Models And Markov Chain Monte Carlo Methods","7254882":"Computing Bayes Factors Using Thermodynamic Integration","265780422":"Combining Standard Block Analyses With Spatial Analyses Under a Random Effects Model","23270000":"A Monte Carlo method for calculating Bayesian uncertainties in internal dosimetry","239392092":"A stochastic framework for embodied greenhouse gas emissions modelling of construction materials","220286523":"A case study in non-centering for data augmentation: Stochastic epidemics","245542334":"Model-based stochastic inversion of coil impedance for determination of tube inner radius and electromagnetic properties","265364685":"Product Partition Models for Normal Means","252228631":"To Bridge, to Warp or to Wrap?","243049827":"Analysis of clustered ordinal data with subclusters via a Bayesian hierachical model","2655031":"Information bounds for Gibbs samplers","220286526":"Bayesian analysis of spatial point processes in the neighbourhood of Voronoi networks","265366770":"Bayesian Analysis of Linear and Non-Linear Population Models by Using the Gibbs Sampler","226713254":"Accelerating Monte Carlo Markov Chain Convergence for Cumulative-Link Generalized Linear Models","243043673":"Bayesian Analysis of Structural Equation Model With Fixed Covariates","266497221":"MCMC (ε − α)−APPROXIMATION UNDER DRIFT CONDITION WITH APPLICATION TO GIBBS SAMPLERS FOR A HIERARCHICAL RANDOM EFFECTS MODEL","258229332":"Discussion: Markov Chains for Exploring Posterior Distributions","271694592":"Suggestions for Presenting the Results of Data Analyses","44677531":"Approximate inference for disease mapping with sparse Gaussian processes","220286482":"Markov Chain Monte Carlo in small worlds","222946943":"Bayesian Inference in Econometric Models with Symmetric Stable Disturbances","229774980":"A Bayesian criterion for simplicity in inverse problem parametrization","220286488":"Bayesian marginal inference via Candidate\u0027s formula","228681368":"Bayesian Inference in Public Administration Research: Substantive Differences from Somewhat Different Assumptions","51101744":"Genetic parameters of carcass and meat quality traits of double muscled Piemontese cattle","273519472":"New recursive estimators of the time-average variance constant","253652000":"FILTRAGEM E ESTIMACAO DE ESTADOS COM RESTRICOES APLICADO AO SLAM VISUAL","1821477":"Spontaneous magnetisation in the plane","259286090":"A Direct Utility Model for Asymmetric Complements","2343778":"Reparameterisation Issues in Mixture Modelling and Their Bearing on MCMC Algorithms","228312786":"To Bridge, to Warp or to Wrap? A Comperative Study of Monte Carlo Methods for Efficient Evaluation of Marginal Likelihood","2136938":"Markov Chain Monte Carlo: Can We Trust the Third Significant Figure?","222946821":"The fitting of parameter-constrained demographic models","263726325":"Bayesian estimation of the random coefficients logit from aggregate count data","221965922":"Advanced MCMC Methods for Sampling on Diffusion Pathspace","243043616":"Bayesian image analysis with coloured Voronoi tessellations and a view to applications in reservoir modelling","227358416":"Efficient Posterior Simulation for Cointegrated Models with Priors on the Cointegration Space","41406762":"Balancing Simulation Accuracy and Efficiency with the Amber United Atom Force Field","268573532":"A Monte Carlo Simulation of the Kriging Model","246187468":"Conditional Independence Models for Epidemiological Studies withCovariates Measurement Error","233725580":"Finite Adaptation and Multistep Moves in the Metropolis-Hastings Algorithm for Variable Selection in Genome-Wide Association Analysis","14336953":"The population risk as an explanatory variable in research synthesis of clinical trials","266237115":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","37996837":"Studies integrating geometry, probability, and optimization under convexity","229891797":"Parameter Estimation in the Error‐in‐Variables Models Using the Gibbs Sampler","24146454":"Crossbreeding parameters for growth and feed consumption traits from a five diallel mating scheme in rabbits","243043604":"A Bayesian Approach for Analyzing Hierarchical Data With Missing Outcomes Through Structural Equation Models","257252414":"Parallel Bayesian inference of range and reflectance from LaDAR profiles","229873374":"Parsimonious Bayesian Markov Chain Monte Carlo inversion in a nonlinear geophysical problem","258229268":"A Review of Bayesian Variable Selection Methods: What, How and Which.","233741983":"Random regression analyses of feed intake of individually tested beef steers","224140841":"On the parallelisation of MCMC by speculative chain execution","266296486":"YADA Manual — Computational Details","220286555":"Application of a predictive distribution formula to Bayesian computation for incomplete data models","270703448":"An integrated Bayesian approach for passenger flow assignment in metro networks","220286558":"Efficient Markov chain Monte Carlo with incomplete multinomial data. Stat Comput","267570290":"Walk, Not Wait: Faster Sampling Over Online Social Networks","45900090":"Estimating and Sampling Graphs with Multidimensional Random Walks","222973644":"Block length selection in the bootstrap for time series. Computnl Statist","264295495":"European Mathematical Genetics Meeting","224141012":"On the parallelisation of MCMC-based image processing","227442179":"The “Shopping Basket.” A Model for Multi-Category Purchase Incidence Decisions","228150807":"A Category-Level Model of Asymmetric Complements","231831105":"Immunological traits have the potential to improve selection of pigs for resistance to clinical and subclinical disease","26538501":"Elrm: Software Implementating Exact-Like Inference for Logistic Regression Models","2470839":"Bayesian Image Classification with Baddeley\u0027s Delta Loss","5155805":"Modeling Simultaneity in Survey Data","259742946":"Minimising MCMC Variance via Diffusion Limits, with an Application to Simulated Tempering by","261309450":"Exploiting user mobility for wireless content delivery","4914135":"Maximizing generalized linear mixed models with an automated Monte Carlo EM algorithm","228550146":"Approximation Algorithms for Probabilistic Reasoning: Sampling and Iterative Inference","278733571":"Hamiltonian Monte Carlo Acceleration Using Neural Network Surrogate functions","45799716":"Genotype × AI conditions interaction for male effect on fertility and prolificacy","3318674":"Bayesian inference of network loss and delay characteristics with applications to TCP performance prediction","220286601":"On learning strategies for Evolutionary Monte Carlo","4746208":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","2515852":"Bayesian Inference for Agricultural Field Experiments","2257801":"Bayesian inference for ion channel gating mechanisms directly from single channel recordings, using Markov chain Monte Carlo","257940719":"Monte Carlo Methods in Bayesian Statistics","271668099":"Bayesian analysis of joint mean and covariance models for longitudinal data","245099823":"Gibbs sampling of climatic trends and periodicities","236086692":"Parameter uncertainty in biochemical models described by ordinary differential equations","220286614":"Bayesian estimation and stochastic model specification search for dynamic survival models","267461704":"Basic and Advanced Bayesian Structural Equation Modeling: With Applications in the Medical and Behavioral Sciences","227571246":"Finite sample properties of tests for allelic association.","230587904":"Conclusions via unique predictions obtained despite unidentifiability - New definitions and a general method","50940086":"Near-infrared reflectance spectroscopy predictions as indicator traits in breeding programs for enhanced beef quality","264385539":"Extra Chance Hybrid Monte Carlo","1917916":"A theoretical comparison of the data augmentation, marginal augmentation and PX-DA algorithms","30513687":"Modèles variationnels et bayésiens pour le débruitage d\u0027images : de la variation totale vers les moyennes non-locales","259554495":"Influences Of Availability On Parameter Estimates From Site Occupancy Models With Application To Submersed Aquatic Vegetation","5182364":"Bayesian estimation of finite mixtures of gaussian mixtures","47843593":"The Random Walk Metropolis: Linking Theory and Practice Through a Case Study","286218970":"Melanoma Cell Colony Expansion Parameters Revealed by Approximate Bayesian Computation","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","228677239":"A new analysis of experimental data on olivine rheology","5372809":"Efficiency of alternative MCMC strategies illustrated using the reaction norm model","260400217":"Statistical Models for Infectious Disease Surveillance Counts","265511950":"Convergence of hybrid slice sampling via spectral gap","46434599":"A Comparative Study of Monte Carlo Methods for Efficient Evaluation of Marginal Likelihoods","228562553":"Evolutionary Monte Carlo Methods for Clustering","223745712":"Bayesian Analysis of lifetime performance and prolificacy in Landrace sows using linear mixed model with censoring","225146509":"A Gibbs sampler for mixed logit analysis of differentiated product markets using aggregate data","220427973":"Structured Learning and Prediction in Computer Vision","257719476":"Multiple Markov Chains Monte Carlo Approach for Flow Forecasting in Porous Media*","2581454":"Phylogenetic Tree Construction Using Markov Chain Monte Carlo","259550353":"A Unifying Framework for Marginalised Random-Intercept Models of Correlated Binary Outcomes","286227172":"Pseudo-Marginal Bayesian Multiple-Class Multiple-Kernel Learning for Neuroimaging Data","8893291":"Binary latent variable modeling and its application in the study of air pollution in Hong Kong","51835111":"Genetic analysis of fertility in the Italian Brown Swiss population using different models and trait definitions","26745449":"Predictive ability and covariance parameters of dynamic linear models for analysis of longitudinal traits1","10810197":"On Flexible finite polygenic models for multiple-trait evaluation","23184016":"Developments in statistical analysis in quantitative genetics","2855903":"Rates of Convergence for Gibbs Sampling for Variance Component Models","277742459":"Essays on the Bayesian Inequality Restricted Estimation","226055822":"Exact Inference Using Variable Integrating Constant Importance Distributions","222674621":"The effect of selection for growth rate on carcass composition and meat characteristics of rabbits","233815575":"Lecture Notes in Computer Science","230690364":"Efficient MCMC for Climate Model Parameter Estimation: Parallel Adaptive Chains and Early Rejection","14068523":"Estimates of Genetic Parameters for a Test Day Model with Random Regressions for Yield Traits of First Lactation Holsteins","227151477":"Statistical Rule Induction in the Presence of Prior Information: The Bayesian Record Linkage Problem","221851962":"A method for calculating Bayesian uncertainties on internal doses resulting from complex occupational exposures","227735956":"Bayesian classification of Neolithic tools","2911269":"Approximation Algorithms for Probabilistic Reasoning:","5553245":"A comparison of strategies for Markov Chain Monte Carlo computation in quantitative genetics","38348355":"Antithetic coupling of two Gibbs sampler chains","8504459":"Random Regression Test-Day Models with Residuals Following a Student\u0027s-t Distribution","220354866":"Nonstandard Central Limit Theorems for Markov Chains.","15185142":"Censored survival models for genetic epidemiology: A Gibbs sampling approach","24063352":"Bayesian factor analysis for multilevel binary observations","51969792":"Spectral Gaps for a Metropolis-Hastings Algorithm in Infinite Dimensions","51640074":"The relevance of echocardiography heart measures for breeding against the risk of subaortic and pulmonic stenosis in Boxer dogs","277677204":"Zero Variance Differential Geometric Markov Chain Monte Carlo Algorithms","263760802":"Are Independent Parameter Draws Necessary for Multiple Imputation?","216844535":"Quantitative comparison of canopy conductance models using a Baysian approach","6999157":"Approximate Likelihood-Ratio Test for Branches: A Fast, Accurate, and Powerful Alternative","10679485":"Bowen-Conradi syndrome: A clinical and genetic study","265778166":"Bayesian Estimation for the Three-Parameter Weibull Distribution with Tree Diameter Data","272260120":"An Entropy Based Methodology for Valuation of Demand Uncertainty Reduction","8119391":"Using temporally spaced sequences to simultaneously estimate migration rates, mutation rate and population sizes in measurably evolving populations","277679273":"Bayesian Computation Via Markov Chain Monte Carlo","11435147":"Multiple trait model combining random regressions for daily feed intake with single measured performance traits of growing pigs","11435144":"Bayesian QTL mapping using skewed Student-t distributions","261329845":"Topological Mapping and Scene Recognition With Lightweight Color Descriptors for an Omnidirectional Camera","8469673":"Multilocus Methods for Estimating Population Sizes, Migration Rates and Divergence Time, With Applications to the Divergence of Drosophila pseudoobscura and D. persimilis","222943584":"A New Algorithm for Global Optimization: Molecular-Inspired Parallel Tempering","5110883":"On the computational complexity of MCMC-based estimators in large samples","222671220":"Bayesian hidden Markov Model for DNA segmentation : A prior sensitivity analysis","222833017":"On the index of dissimilarity for lack of fit in loglinear and log-multiplicative models","228618642":"On some method for diagnosing convergence in MCMC setups via atoms and renewal sets","226335049":"A review of Markov Chain Monte Carlo and information theory tools for inverse problems in subsurface flow","24065360":"Improper and proper posteriors with improper priors in a Poisson-gamma hierarchical model","241060376":"Inference for a Generalized Gibbsian Distribution on Channel Networks","2354286":"Bayesian Comparison of Econometric Models","251626158":"9243 POSTER Psychosocial Effect and Evaluation of the Health-related Quality of Life in Patients With Non-Hodgkin Lymphoma","248914562":"Bayesian Inference on Variance and Covariance Components for Traits Influenced by Maternal and Direct Genetic Effects, Using the Gibbs Sampler","12344555":"Yi N, Xu S. Bayesian mapping of quantitative trait loci under the Identity-by-Descent-based variance component model. Genetics 156: 411-422","1735757":"Bayesian outlier detection in Capital Asset Pricing Model","257800970":"A Continuous Time-and-State Epidemic Model Fitted to Ordinal Categorical Data Observed on a Lattice at Discrete Times","242295337":"Advances in Markov chain Monte Carlo methods","234070443":"Capturing the time-varying drivers of an epidemic using stochastic dynamical systems","4742161":"Generalized Poststratification and Importance Sampling for Subsampled Markov Chain Monte Carlo Estimation","257338124":"Parameter estimation in stochastic differential equations with Markov chain Monte Carlo and non-linear Kalman filtering","6188033":"Bayesian inference in a piecewise Weibull proportional hazards model with unknown change points","5452859":"Genetic parameters related to environmental variability of weight traits in a selection experiment for weight gain in mice; signs of correlated canalised response","229046733":"A Bayesian Approach for Multigroup Nonlinear Factor Analysis","258282249":"Bayes in biological anthropology, Yearb","2683972":"Hybrid Propagation in Junction Trees","40869379":"In vivo development of vitrified rabbit embryos: Effects on prenatal survival and placental development","45864661":"Nonasymptotic bounds on the estimation error for regenerative MCMC algorithms","233103764":"The Monte Carlo EM method for estimating multivariate tobit latent variable models","232710574":"On the value of conditioning data to reduce conceptual model uncertainty in groundwater modeling","3857486":"On MCMC sampling in Bayesian MLP neural networks","277708025":"Markov Chain Monte Carlo (MCMC)Based in part on the article “Markov chain Monte Carlo (MCMC)” by Galin L. Jones and James P. Hobert, which appeared in the Encyclopedia of Environmetrics .","11787461":"Sampling genotypes in large pedigrees with loops","279968982":"Fast sampling in a linear-Gaussian inverse problem","251626116":"9138 POSTER Frequency of EGFR Mutations in Greek Non-Small-Cell Lung Cancer (NSCLC) Patients","11304144":"Bayesian Prediction of Spatial Count Data Using Generalised Linear Mixed Models","253719395":"Characterization of permeability and porosity from nanosensor observations","49806985":"Estimation of reliability in a three-factor model","2864212":"Possible biases induced by MCMC convergence diagnostics","227424526":"Simple conditions for the convergence of the Gibbs sampler and Metropolis–Hastings algorithm","226965767":"A Phylogenetic Mixture Model for Heterotachy","239037117":"Computing Bayes Factors Using a Generalization of the Savage-Dickey Density Ratio","2469030":"Subsampling the Gibbs Sampler","254905269":"Bayesian Analysis of Instrumental Variable Models: Acceptance-Rejection within Direct Monte Carlo","242254584":"Modelos Dinamicos n˜ ao Lineares: Uma Aplicac¸˜ao em Modelos de Volatilidade","51918736":"Classification of molecular sequence data using Bayesian phylogenetic mixture models","4893891":"Bayesian ordinal and binary regression models with a parametric family of mixture links","23145965":"Statistical Prediction and Molecular Dynamics Simulation","24063457":"Markov Chain estimation for test theory without an answer key","242254560":"Markov Chain Monte Carlo Methods for Statistical Inference","2520242":"Image Sequence Restoration Using Gibbs Distributions","7298298":"Exploring protein energy landscapes with hierarchical clustering","230582565":"Assessing uncertainties in a conceptual water balance model using Bayesian methodology","2286722":"Posterior Predictive Assessment of Model Fitness Via Realized Discrepancies","229521678":"Exact Sampling From Anti-Monotone Systems","2858125":"The Estimation of Phase-type Related Functionals Using Markov Chain Monte Carlo Methods","13843581":"Markov Chain Monte Carlo Methods for Radiation Hybrid Mapping","220182961":"Morphologically Constrained GRFs: Applications to Texture Synthesis and Analysis","200027971":"Selection for ovulation rate in rabbits","235979455":"Nature-Inspired Metaheuristic Algorithms","51990441":"Split HMC for Gaussian Process Models","2847898":"Shift-Coupling and Convergence Rates of Ergodic Averages","227703075":"Mode jumping proposals in MCMC","31135087":"On the Applicability of Regenerative Simulation in Markov Chain Monte Carlo","45864462":"Regeneration and Fixed-Width Analysis of Markov Chain Monte Carlo Algorithms","7072979":"Bayesian analysis of structural equation models with mixed exponential family and ordered categorical data","2469023":"Incorporating Toxicity Grade Information in the Continual Reassessment Method","2483358":"Bayesian Nonparametric Estimation via Gibbs Sampling for Coherent Systems with Redundancy","2395290":"A Coupling-Regeneration Scheme for Diagnosing Convergence in Markov Chain Monte Carlo Algorithms","247503363":"Comparison of Approaches in Estimating Interaction and Quadratic Effects of Latent Variables","226826572":"Data Augmentation and MCMC for Binary and Multinomial Logit Models","4729985":"Markov Chain Monte Carlo Simulation Methods in Econometrics","279270510":"Prediction and Structural Uncertainty Analyses of Artificial Neural Networks Using Hierarchical Bayesian Model Averaging","2747621":"Monte Carlo error estimation for multivariate Markov chains","266271496":"On the Design of Methods to Estimate Network Characteristics","38348447":"Convergence and accuracy of Gibbs sampling for conditional distributions in generalized linear models","12291181":"Performance of Markov Chain–Monte Carlo Approaches for Mapping Genes in Oligogenic Models with an Unknown Number of Loci","222652819":"Inference with Non-Gaussian Ornstein-Uhlenbeck Processes for Stochastic Volatility","266060557":"A note on formal constructions of sequential conditional couplings","26631502":"Breeding value estimation with incomplete marker data","24063413":"Analysis of structural equation model with ignorable missing continuous and polytomous data","29605155":"Estimation des paramètres du modèle de Mallows-Bradley-Terry par le maximum de vraisemblance","3079375":"Stochastic approximation algorithms for partition function estimation of Gibbs random fields","265882424":"The self-avoiding walk. Reprint of the 1996 edition","229007685":"Genetic correlation between growth and female and male contributions to fertility in rabbit","242612883":"I may throw you out. Come to our organizational meeting prepared to choose your topic. Before our organizational meeting read (Sims lecture should help you choose)","2647246":"Probabilistic Networks","228571511":"Bayesian Adaptive Hamiltonian Monte Carlo with an Application to High-Dimensional BEKK GARCH Models","258446220":"Searching for efficient Markov chain Monte Carlo proposal kernels","24063363":"A Bayesian analysis of finite mixtures in the LISREL model","23946653":"Economic Feasibility of Ethanol Production from Sweet Sorghum Juice in Texas","12837942":"Threshold-Linear Versus Linear-Linear Analysis of Birth Weight and Calving Ease Using an Animal Model: I. Variance Component Estimation","277560432":"An integrative statistical model for inferring strain admixture within clinical Plasmodium falciparum isolates","252428814":"Algorithms and Monte Carlo Methods in Computational Biology","229431462":"Multi-Stage Monte Carlo Method for Solving Influence Diagrams Using Local Computation","225239143":"On directional Metropolis–Hastings algorithms","15130090":"Monte Carlo Estimation of Mixed Models for Large Complex Pedigrees","227688607":"Bayesian analysis of the additive mixed model for randomized block designs","228659372":"Direct space methods of structure solution from powder diffraction: Principles, guidelines and perspectives","4898116":"Maximum likelihood estimation and model comparison of nonlinear structural equation models with continuous and polytomous variables","272819538":"Inference on mode preferences, vehicle purchases, and the energy paradox using a Bayesian structural choice model","233871585":"An Empirical Study of w-Cutset Sampling for Bayesian Networks","237579064":"GENOTYPE X SPERM DOSAGE INTERACTION ON REPRODUCTIVE PERFORMANCE AFTER ARTIFICIAL INSEMINATION. 1. MALE FERTILITY","265528000":"Monte Carlo Standard Errors for Markov Chain Monte Carlo","259510883":"Efficient estimation of the link function parameter in a robust Bayesian binary regression model","24079482":"Using simulation methods for bayesian econometric models: inference, development and communication: some comments","254212659":"Flexible paleoclimate age-depth models using an autoregressive gamma process","2633022":"Hierarchical Models: A Current Computational Perspective","24079480":"Using Simulation Methods for Bayesian Econometric Models","259555940":"Estimates and standard errors for ratios of normalizing constants from multiple Markov chains via regeneration","238725927":"Metropolis-Hastings Markov Chain Monte Carlo","226162789":"Multipoint linkage analysis by block Gibbs sampling","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","227578032":"Evolutionarily stable stealing: Game theory applied to kleptoparasitism","41574232":"Outils d\u0027évaluation de la qualité d\u0027un paramétrage de propriétés visuelles : cas des textures couleur","7198031":"Sex Ratio Variation in Iberian Pigs","2465037":"Bayesian Phylogenetic Inference via Markov Chain Monte Carlo Methods","2733313":"Computational Aspects of Nonparametric Bayesian Analysis with Applications to the Modeling of Multiple Binary Sequences","260039254":"Analysis of the transcriptome of adult Dictyocaulus filaria and comparison with Dictyocaulus viviparus, with a focus on molecules involved in host–parasite interactions","7837021":"Estimates of Genetic Parameters for Canadian Holstein Female Reproduction Traits","2778374":"Methods for Approximating Integrals in Statistics with Special Emphasis on Bayesian Integration Problems","2866438":"Shift-Coupling and Convergence Rates of Ergodic Averages","234043612":"Trans-Generational Effect of Maternal Lactation during Pregnancy: A Holstein Cow Model","258818626":"Efficiency Analysis of Swarm Intelligence and Randomization Techniques","2356497":"A Simple Method for Finding a Legal Configuration in Complex Bayesian Networks","259832388":"The Gaussian mixture MCMC particle algorithm for dynamic cluster tracking","228343973":"A multivariate probit latent variable model for analyzing dichotomous response","5207408":"Adaptive sampling for Bayesian variable selection","256702989":"SATMC: Spectral energy distribution Analysis Through Markov Chains","23634990":"Convergence of posterioris for discretized log Gaussian Cox process","12217840":"Statistical analysis of non-linear equation models with continuous and polytomous data","228462802":"Relationship between bid-ask spreads and fluctuations in market prices","6855974":"A Bayesian Compound Stochastic Process for Modeling Nonstationary and Nonhomogeneous Sequence Evolution","226853076":"Using hidden Markov chains and empirical Bayes change-point estimation for transect data","267242174":"State Space Models for Exponential Family Data","45860846":"Riemannian Manifold Hamiltonian Monte Carlo","228167872":"MCMC Methods for Continuous-Time Financial Econometrics","238398319":"Assessing Psychiatric Morbidity from Community Registers: Methods for Bayesian Adjustment","222332956":"Stochastic thermal history.1.Constraining heat flow histories and their uncertainty","244902905":"Cutset Sampling for Bayesian Networks","2645324":"On the Use of Auxiliary Variables in Markov Chain Monte Carlo Sampling","265675441":"Bayesian Inference of Viral Recombination: Topology distance between DNA segments and its distribution DNA","46544800":"A New Test for Nonstationarity Against the Stable Alternative","258247188":"On the use of marginal posteriors in marginal likelihood estimation via importance-sampling","12957111":"Estimation of Genetic and Phenotypic Parameters for Clinical Mastitis, Somatic Cell Production Deviance, and Protein Yield in Dairy Cattle Using Gibbs Sampling","6927642":"Searching for Convergence in Phylogenetic Markov Chain Monte Carlo","24439808":"Estimating Population Parameters using the Structured Serial Coalescent with Bayesian MCMC Inference when some Demes are Hidden","260295415":"Data assimilation to reduce uncertainty of crop model prediction Convolution Particle Filtering","14314913":"Interpretation of Pooling Experiments Using the Markov Chain Monte Carlo Method","220170339":"Parameter Identification in Degradation Modeling by Reversible-Jump Markov Chain Monte Carlo","24065262":"Estimation of a normal mixture model through Gibbs sampling and Prior Feedback","224868581":"On the Assessment of Monte Carlo Error in Simulation-Based Statistical Analyses","236118942":"MCMC Bayesian Estimation in FIEGARCH Models","222552269":"Bayesian clustering for row effects models","5127617":"Bridge estimation of the probability density at a point","227577858":"Markov-chain Monte Carlo: Some practical implications of theoretical results","41480173":"Safety verification and failure analysis of goal-based hybrid control systems","267670113":"Stochastic Approximation in Monte Carlo Computation","264147494":"Investigation of Biases for Variance Components on Multiple Traits with Varying Number of Categories in Threshold Models Using Bayesian Inferences","2342329":"Blocking Gibbs Sampling for Linkage Analysis in Large Pedigrees with Many Loops","13507924":"A Bayesian hierarchical survival model for the institutional effects in a multi-centre cancer clinical trial","241724403":"Toward BlackBox Sampling: A Random-Direction Interior-Point Markov Chain Approach","266076736":"A Gibbs Sampling Approach To Cointegration","50853531":"Dynamic Markov Bases","277075228":"PRELIMINARY RESULTS IN A DIVERGENT SELECTION EXPERIMENT ON VARIANCE OF LITTER SIZE IN RABBITS. II. RESPONSE TO SELECTION","235625384":"Environmental Kuznets curves: Bayesian evidence from switching regime models Efthymios Mike Tsionas, George E. Halkos Energy Economics. 02/2001; 23(2):191-210.","230547481":"On thinning of chains in MCMC","11052302":"Multivariate analysis of litter size for multiple parities with production traits in pigs: I. Bayesian variance component estimation","42366752":"Markov chain montecarlo method applied to rounding zeros of compositional data: first approach","222062746":"Application of a multimodel approach to account for conceptual model and scenario uncertainties in groundwater modelling","11052303":"Multivariate analysis of litter size for multiple parities with production traits in pigs: II. Response to selection for litter size and correlated response to production traits","227696696":"Bayesian MCMC Mapping of Quantitative Trait Loci in a Half-Sib Design: A Graphical Model Perspective","11050244":"Numerical Study of the Entropy Loss of Dimerization and the Folding Thermodynamics of the GCN4 Leucine Zipper","235111342":"Paired Comparison Models with Time-Varying Parameters","240917490":"Random Walks, Lévy Flights, Markov Chains and Metaheuristic Optimization","220846233":"Multivalent Random Walkers — A Model for Deoxyribozyme Walkers","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","242332610":"Fighting against uncertainty: An essential issue in bioinformatics","38322172":"Self regenerative Markov chain Monte Carlo with adaption","7599557":"Number of Inseminations to Conception in Holstein Cows Using Censored Records and Time-Dependent Covariates","220104871":"Convergence of concurrent Markov chain Monte-Carlo algorithms","243102663":"Markov Chain Monte Carlo in Stastical Mechanics","11613452":"Genetic parameters of a random regression model for daily feed intake of performance tested French Landrace and Large White growing pigs","255249035":"Computationally efficient Bayesian inference for inverse problems","270597533":"Price discovery under crisis: uncovering the determinant factors of prices using efficient Bayesian model selection methods","241724374":"Conditioning in Markov Chain Monte Carlo","11379986":"Shaw FH, Geyer CJ, Shaw RG. A comprehensive model of mutations affecting fitness and inferences for Arabidopsis Thaliana. Genetics 155: 369-378","228751459":"Gibbs Sampling Methods for Bayesian Quantile Regression","226173117":"Exploring quasi Monte Carlo for marginal density approximation","221851890":"An Integrated Strategy for Prediction Uncertainty Analysis","6946215":"Evidence for attractors in English intonation. J Acoust Soc Am","51953356":"Issues in Designing Hybrid Algorithms","233336893":"Bayesian Analysis of Quality Adjusted Lifetime (QAL) Data","2254324":"Self Regenerative Markov Chain Monte Carlo","2811376":"Markov Chain Monte Carlo for Statistical Inference","38363029":"Convergence Control Methods for Markov Chain Monte Carlo Algorithms","257493689":"Finding Donors by Relationship Fundraising","2663884":"Bayesian Inference for Semiparametric Binary Regression","268376599":"CONVERGENCE RATES AND REGENERATION OF THE BLOCK GIBBS SAMPLER FOR BAYESIAN RANDOM EFFECTS MODELS","227686522":"From words to dates: Water into wine, mathemagic orphylogeneticinference","257718964":"Context-Dependent Evolutionary Models for Non-Coding Sequences: An Overview of Several Decades of Research and an Analysis of Laurasiatheria and Primate Evolution","257159865":"Bayesian inference along Markov Chain Monte Carlo approach for PWR core loading pattern optimization","3747286":"Bayesian estimation of abrupt changes contaminated by multiplicative noise using MCMC","238689222":"Bayesian Filtering: From Kalman Filters to Particle Filters, and Beyond","238583869":"Quantitative Genetics Genomics and the Future of Plant Breeding","11130543":"Monte Carlo Exact Methods Used for Analysing Interethnic Unions in Great Britain","45890747":"Thermal Conductivity of the Toda Lattice with Conservative Noise","220637994":"How to sample from a truncated distribution if you must","233866237":"Optimisation via Slice Sampling","234005501":"Optimal Estimation of Free Energies and Stationary Densities from Multiple Biased Simulations","251707668":"Evaluation of an average numerator relationship matrix model and a Bayesian hierarchical model for growth traits in Nellore cattle with uncertain paternity","228694966":"Estimation of the Asymptotic Variance in the CLT for Markov Chains","251779350":"MCMC Package Example (Version 0.7-3)","229790634":"Efficiency and Convergence Properties of Slice Samplers","44651701":"A model for psychiatric questionnaires with embarrassing items","225719147":"Multi-step samplers for improving efficiency in probabilistic geophysical inference","226337625":"“Bayesian Inference for Finite Mixture Models of Generalized Linear Models with Random Effects.”","6944335":"Genetic Parameters for Health Traits and Their Relationship to Different Persistency Traits in German Holstein Dairy Cattle","2641423":"Stochastic Programming by Monte Carlo Simulation Methods","227390373":"Introduction to Bayesian Econometrics","237631488":"MONTE CARLO MARKOV CHAIN EXACT INFERENCE FOR BINOMIAL REGRESSION MODELS","265417213":"Probabilistic methods of analysis for the time series Moran scatterplot quadrant signature","247789811":"The Bayesian Analysis of Population Pharmacokinetic Models","49849551":"Weighted Maximum Posterior Marginals for Random Fields Using an Ensemble of Conditional Densities From Multiple Markov Chain Monte Carlo Simulations","227173309":"Computing the Cramer-Rao Bound of Markov Random Field Parameters: Application to the Ising and the Potts Models","14040815":"Uimari P, Hoeschele I. Mapping-linked quantitative trait loci using Bayesian analysis and Markov chain Monte Carlo algorithms. Genetics 146: 735-743","221973249":"Genetic determinism for within-litter birth weight variation and its relationship with litter weight and litter size in the Ripollesa ewe breed","51485995":"Restricting inbreeding while maintaining selection response for weight gain in Mus musculus","231861226":"Sources of sire-specific genetic variance for birth and weaning weight in Bruna dels Pirineus beef calves","43652260":"Projective re-normalization for improving the behavior of a homogeneous conic linear system","229759984":"Genetic Anticipation in Familial Hodgkin\u0027s disease.","2608740":"Inference and Monitoring Convergence (chapter for Gilks, Richardson, and Spiegelhalter book)","234113968":"Probabilistic prediction of neurological disorders with a statistical\nassessment of neuroimaging data modalities","228869100":"Bayesian Inference and Markov Chain Monte Carlo by Example","2295402":"Blocking Gibbs Sampling in Very Large Probabilistic Expert Systems","50304179":"Computer image analysis traits of cross-sectioned dry-cured hams: A genetic analysis","260043058":"LONG-TERM and transgenerational effects OF cryopreservation ON rabbit embryos","2651751":"Discrete Morphological Size Distributions and Densities: Estimation Techniques and Applications","5389853":"Molecular Demographic History Oo the Annual Sunflowers Helianthus Annuus and H. Petiolaris—Large Effective Population Sizes and Rates of Long-Term Gene Flow","242939947":"Bayesian Mapping of Lichens Growing on Trees","257337604":"MCMC using Markov bases for computing -values in decomposable log-linear models","15111858":"A Bayesian Analysis of Institutional Effects in a Multicenter Cancer Clinical Trial","27248583":"Efficient Posterior Simulation for Cointegrated Models with Priors On the Cointegration Space","228094913":"Social moderation of the relation between community violence exposure and depressive symptoms in an urban adolescent sample.","267655568":"Small Area Inference for Binary Variables in the National Health Interview Survey","261755376":"Combining test statistics and models in bootstrapped model rejection: It is a balancing act","38069288":"Genomic DNA fingerprinting of indigenous chicken breeds with molecular markers designed on interspersed repeats","47160483":"Blocking Gibbs sampling in the mixed inheritance model using graph theory","4996640":"Control Variates for the Metropolis-Hastings Algorithm","277178088":"Essays on the economics of racial segregation","247152854":"The Containment Condition and AdapFail algorithms","2541138":"BUGS for a Bayesian Analysis of Stochastic Volatility Models","6397461":"Wilkinson, D. J. Bayesian methods in bioinformatics and computational systems biology. Brief. Bioinformatics 8, 109-116","225686278":"Empirical Bayes analysis of unreplicated microarray data","232743848":"Laplace Approximation for Logistic Gaussian Process Density Estimation and Regression","237525072":"EDITORIALS When Is a Confirmatory Randomized Clinical Trial Needed?","51914081":"Split Hamiltonian Monte Carlo","247331015":"Rank-Based Inference in the Proportional Hazards Model for Interval Censored Data","23256863":"Bayesian threshold analysis of direct and maternal genetic parameters for piglet mortality at farrowing in Large White, Landrace, and Pietrain populations","265290158":"Direct Utility Models for Asymmetric Complements","242356465":"BMC4: Spatial analysis of area data, part 2a","264528192":"European Mathematical Genetics Meeting","227687191":"A Hierarchical Bayesian Model to Predict the Duration of Immunity to Haemophilus Influenzas Type B","2795170":"Comparison of Birth-and-Death and Metropolis-Hastings Markov chain Monte Carlo for the Strauss process","226863885":"Gibbs sampler for computing and propagating large covariance matrices","228676395":"Splitting and Merging Components of a Nonconjugate Dirichlet Process Mixture Model","23633914":"Subsampling the Gibbs sampler: variance reduction","280589868":"Strong Consistency of Multivariate Spectral Variance Estimators in Markov Chain Monte Carlo","220505009":"A Stochastic Simulation Approach to Model Selection for Stochastic Volatility Models","230873947":"Estimating Risk Determinants of HIV and TB in South Africa","222575583":"Rigorous confidence bounds for MCMC under a geometric drift condition","2531002":"Hybrid Propagation in Junction Trees","24127471":"A Gibbs Sampler for Mixed Logit Analysis of Differentiated Product Markets Using Aggregate Data","15226443":"Analysis of longitudinal data: Random coefficient regression modelling","222516199":"Accuracy of posterior approximations via χ2 and harmonic divergences","243963941":"Bayesian Inference for partially observed SDEs Driven by Fractional Brownian Motion","223063037":"Bayesian estimation of kinetic rate constants in a food-web model of polycyclic aromatic hydrocarbon bioaccumulation","264956285":"An Iterative Monte Carlo Scheme for Generating Lie Group-Valued Random Variables","5140209":"Bayesian Treatment of the Independent Student Linear Model","262052190":"Parameter estimation via stochastic variants of the ECM algorithm with applications to plant growth modeling","268650178":"An introduction to MCMC","227693396":"Bayesian image analysis with Markov chain Monte Carlo and coloured continuum triangulation models","49734716":"Bayesian Inference for Comorbid Disease Risks Using Marginal Disease Risks and Correlation Information From a Separate Source","2277097":"Bayesian Smoothing in the Estimation of the Pair Potential Function of Gibbs Point Processes","249866280":"Petrophysical seismic inversion conditioned to well-log data: Methods and application to a gas reservoir","251502642":"Selective breeding provides an approach to increase resistance of rainbow trout (Oncorhynchus mykiss) to the diseases, enteric redmouth disease, rainbow trout fry syndrome, and viral haemorrhagic septicaemia","13663745":"Generalized Linear Mixed Models in Dairy Cattle Breeding","263774569":"RMCMC: A system for updating Bayesian models","26820429":"Mid-infrared spectroscopy predictions as indicator traits in breeding programs for enhanced coagulation properties of milk. J Dairy Sci","13663749":"Bayesian Analysis of Wood\u0027s Lactation Curve for Spanish Dairy Cows","271783653":"Identifying Active Faults by Improving Earthquake Locations with InSAR Data and Bayesian Estimation: The 2004 Tabuk (Saudi Arabia) Earthquake Sequence","237775093":"Maximum Likelihood Estimation for a Parametric Dispersal Model for Haploid Organisms Technical Report # 362","232225545":"Optimal design of stimulus experiments for robust discrimination of biochemical reaction networks","230884130":"Bayesian inference for a nonlinear mixed-effects Tobit model with multivariate skew-t distributions: Application to AIDS studies","230531934":"Manifold MCMC for Mixtures","222817186":"Bayesian model determination for multivariate ordinal and binary data","267409685":"9 HSTFMG*aeechj+ Bayesian Spatial and Temporal Epidemiology of Non-communicable Diseases and Mortality","51078637":"Different ways to model biological relationships between fertility and pH of the semen in rabbits","270595784":"Parameter and uncertainty estimation for maize, peanut and cotton using the SALUS crop model","13069869":"Bayesian Analysis of Birth Weight and Litter Size in Baluchi Sheep Using Gibbs Sampling","238866647":"Bayesian analysis of an intervened poisson distribution","26294138":"Genetic correlations between pathogen-specific mastitis and somatic cell count in Danish Holsteins","2272980":"An Adaptive Quasi Monte Carlo Alternative to Metropolis","280329794":"Emulation of Higher-Order Tensors in Manifold Monte Carlo Methods for Bayesian Inverse Problems","226243460":"Quantitative Non-Geometric Convergence Bounds for Independence Samplers","47428650":"Altered Function and Connectivity of the Medial Frontal Cortex in Pediatric Obsessive-Compulsive Disorder","225497994":"Computing p-values in conditional independence models for a contingency table","222837683":"Approximate accuracies of prediction from random regression models","274730652":"Precomputing Strategy for Hamiltonian Monte Carlo Method Based on Regularity in Parameter Space","225860489":"A process-convolution approach to modelling temperatures in the North Atlantic Ocean (Disc: P191-192)","232975072":"Bayesian Analysis of Semiparametric Mixed-Effects Models for Zero-Inflated Count Data","2672427":"Parallel computing and Monte Carlo algorithms","260640906":"SCoPE: An efficient method of Cosmological Parameter Estimation","262277287":"Efficient MCMC for binomial logit models","221864510":"A Bayesian Approach to Targeted Experiment Design","4986693":"Fixed-Width Output Analysis for Markov Chain Monte Carlo","265922771":"Bayesian Risk Management -\"Frequency Does Not Make You Smarter\"","222933575":"Bayesian inference for a stochastic logistic model with switching points","242577766":"Annealing Markov Chain Monte Carlo with Applications to Ancestral Inference","41465196":"Estimation of breeding values from large-sized routine carcass data in Japanese Black cattle using Bayesian analysis","265060568":"Infinite-state Markov-switching for dynamic volatility and correlation models","45872557":"Random close packing in a granular model","249047490":"Bayesian mixed‐effects model analysis of a censored normal distribution with animal breeding applications","283824112":"A fast and efficient Gibbs sampler for BayesB in whole-genome analyses","229708441":"Segregation analysis of animal pedigree data.","243769770":"Statistical Inference from Genetic Data on Pedigrees","26631847":"Genetic parameters of a random regression model for daily feed intake of performance tested French Landrace and Large White growing pigs","261218467":"Incorporating heifer feed efficiency in the Australian selection index using genomic selection","258103382":"A Monte Carlo method for Bayesian analysis of linkage between single markers and quantitative trait loci. II. A simulation study","228588201":"Fitting Mixed-Effects Models Using Efficient EM-Type Algorithms","23633488":"Geometric convergence of the Metropolis-Hastings simulation algorithm","271855369":"Bayesian computation: a perspective on the current state, and sampling backwards and forwards","241090915":"Upper airway obstruction in handicapped persons","41465159":"Investigation of Gibbs sampling conditions to estimate variance components from Japanese Black carcass field data","265390225":"The investigation of the secondary structure propensities and free-energy landscapes of peptide ligands by replica exchange molecular dynamics simulations","8070969":"Hey J, Won Y-J, Sivasundar A, Nielsen R, Markert JA. Using nuclear haplotypes with microsatellites to study gene flow between recently separated Cichlid species. Mol Ecol 13: 909-919","238672251":"BMC4: Spatial analysis of area dataa","2852713":"A Simulation Approach to Convergence Rates for Markov Chain Monte Carlo Algorithms","233112233":"Using the gibbs sampler to simulate from the bayes estimate of a decreasing density","235245911":"DP-FACT: Towards topological mapping and scene recognition with color for omnidirectional camera","2766713":"Antithetic Coupling Of Gibbs Sampler Chains","228586179":"Bayesian Parameter Estimation in Ising and Potts Models: A Comparative Study with Applications to Protein Modeling","240802107":"Bayesian Inference with Probability Matrix Decomposition Models","242231569":"Postwar Slowdowns and Long-Run Growth: A Bayesian Approach of Structural-Break Models","252059749":"BAYESIAN ESTIMATION OF SOFT-CORE POTENTIAL MODELS FOR SPATIAL POINT PATTERNS","238866776":"Bayesian analysis of the multivariate Poisson distribution","265525433":"Bayesian Inverse Problems with Monte Carlo Forward Models","248258982":"Use of Bayesian analysis of growth functions to estimate crossbreeding parameters in Iberian pigs","238328159":"Fisher, Haldane and Wright in the decade 1922-1932","51498109":"Using the product threshold model for estimating separately the effect of temperature on male and female fertility","227693310":"A Study of Deleterious Gene Structure in Plants Using Markov Chain Monte Carlo","261669108":"Maximum Likelihood Analysis of Nonlinear Structural Equation Models With Dichotomous Variables","45440472":"An application of change-point recursive models to the relationship between litter size and number of stillborns in pigs","257099836":"Characterising geotechnical model uncertainty by hybrid Markov Chain Monte Carlo simulation","37377354":"Comparison of Two Methods for Calculating the Partition Functions of Various Spatial Statistical Models","239593783":"Methodology for Inference on the Markov Modulated Poisson Process and Theory for Optimal Scaling of the Random Walk Metropolis","228023014":"Block updating in constrained Markov chain Monte carlo sampling with application to pedigree analysis.","230294216":"Impact of variation in length of individual testing periods on estimation of (co)variance components of a random regression model for feed intake of growing pigs","49808781":"Effect of cleavage enzyme, search algorithm and decoy database on mass spectrometric identification of wheat gluten proteins","1957728":"A Monte Carlo algorithm for efficient large matrix inversion","251930745":"Block Gibbs Sampling for Bayesian Random Effects Models With Improper Priors: Convergence and Regeneration","44805417":"The stability of African savannas: Insights from the indirect estimation of the parameters of a dynamic model","2576292":"Bayesian Poisson Regression using the Gibbs Sampler: Sensitivity Analysis through Dynamic Graphics","225954547":"A Statistical Model to Detect DRG Upcoding","23547619":"Postwar Slowdowns and Long-Run Growth: A Bayesian Analysis of Structural-Break Models","261763101":"Bayesian calibration of power plant models for accurate performance prediction","34270594":"Genetic evaluation for traits with repeated time-dependent observations (longitudinal data), with an application to feed intake of pigs","248799558":"Lithologic tomography: From plural geophysical data to lithology estimation","26658309":"Mapping multiple quantitative trait loci under Bayes error control†","225252094":"Optimal Bandwidth Selection for Density-Based Clustering","7282683":"Proceedings of the SMBE Tri-National Young Investigators\u0027 Workshop 2005. Coalescent-based estimation of population parameters when the number of demes changes over time.","246921504":"Conditional expectations and residual analysis for the linear model","228055566":"Inference for Ancestral Populations.","242088399":"PARÁMETROS GENÉTICOS DE LA FERTILIDAD EN DOS LÍNEAS DE CONEJO DE DIFERENTE APTITUD","2676619":"Modeling the History of Diabetic Retinopathy","228272703":"Bayesian Forecasting of Federal Funds Target Rate Decisions","222667491":"Bayesian inference for differential equations","222704365":"Bayesian analysis of nested logit models by Markov Chain Monte Carlo","6588361":"Bayes factor for testing between different structures of random genetic groups: A case study using weaning weight in Bruna dels Pirineus beef cattle","225047239":"Influence of zona pellucida thickness on fertilization, embryo implantation and birth","242561472":"Computer Intensive Methods \u0026 Spatial Statistics with an emphasis on perfect simulation and spatial point processes","226091726":"The Dynamics and Equilibria of Day-to-Day Assignment Models","280329996":"Estimation and uncertainty of reversible Markov models","4986866":"A Bayesian Time Series Model of Multiple Structural Changes in Level, Trend, and Variance","11267861":"Statistical analysis for estimating heterogeneity of the Korean population in DNA typing using STR loci","24233652":"Identifiability of parameters and behaviour of MCMC chains: A case study using the reaction norm model","227686996":"Non‐parametric Bayesian Estimation of a Spatial Poisson Intensity","221729521":"Test-day somatic cell score, fat-to-protein ratio and milk yield as indicator traits for sub-clinical mastitis in dairy cattle","236251608":"High-Dimensional Bayesian Parameter Estimation: Case Study for a Model of JAK2/STAT5 Signaling.","45933935":"Bootstrap Markov chain Monte Carlo 1 Bootstrap Markov chain Monte Carlo and optimal solutions for the Law of Categorical Judgment (Corrected)","230570605":"The Megamaser Cosmology Project. V. An Angular Diameter Distance to NGC\n6264 at 140 Mpc","258082998":"The Symplectic Geometry of Closed Equilateral Random Walks in 3-Space","221973228":"Genetic parameters for pathogen-specific mastitis resistance in Danish Holstein Cattle","26711631":"Speciation in the Deep Sea: Multi-Locus Analysis of Divergence and Gene Flow between Two Hybridizing Species of Hydrothermal Vent Mussels","236177867":"The Effect of Improper Priors on Gibbs Sampling in Hierarchical Linear Mixed Models","11384695":"Hoti FJ, Sillanpää MJ, Holmström L. A note on estimating the posterior density of a quantitative trait locus from a Markov chain Monte Carlo sample. Genet Epidemiol 22: 369-376","240642445":"Estimation of variance components for Nordic red cattle test-day model: Bayesian Gibbs sampler vs. Monte Carlo EM REML","263063668":"On Sampling Strategies in Bayesian Variable Selection Problems With Large Model Spaces","23633587":"Last passage time for the empirical mean of some mixing processes","233146881":"To Bayes or Not to Bayes, From Whether to When: Applications of Bayesian Methodology to Modeling","24086155":"Bayesian analysis of the factor model with finance applications","221967070":"Bayesian semiparametric regression models for evaluating pathway effects on continuous and binary clinical outcomes","10567492":"Bayesian Analysis of Structural Equation Models with Dichotomous Variables","28266057":"Selección divergente para la variabilidad ambiental del tamaño de camada en conejo. Resultados preliminares.","229610057":"MCMC methods for assessing departures from HW and gametic equilibrium.","239294884":"Functional Compatibility, Markov Chains, and Gibbs Sampling with Improper Posteriors","238684637":"Projective Pre-Conditioners for Improving the Behavior of a Homogeneous Conic Linear System","40144268":"Breeding value estimation with incomplete marker data.","24063622":"Bayesian Analysis of Nonlinear Structural Equation Models with Nonignorable Missing Data","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","47637799":"A Comparison of Methods for Computing Autocorrelation Time","226261640":"Efficient sampling from the posterior distribution in generalized linear mixed models. Statistics and Computing, 7, 57-68","241631634":"An efficient probing mechanism for next generation mobile broadband systems","261105768":"Bayesian scrutiny of simple rainfall–runoff models used in forest water management","2504666":"Markov Chain Monte Carlo in Practice: A Roundtable Discussion"},"index":138}