{"abs":"A good choice of the proposal distribution is crucial for the rapid convergence of the Metropolis algorithm. In this paper, given a family of parametric Markovian kernels, we develop an adaptive algorithm for finding the kernel that maximizes the expected squared jumped distance, an ob jective function that characterizes the Markov chain under its d-dimensional stationary distribution. We demonstrate the effectiveness of our method in several examples.","title":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","id":228280215,"url":"https://www.researchgate.net/publication/228280215_Adaptively_Scaling_the_Metropolis_Algorithm_Using_Expected_Squared_Jumped_Distance","names":["Andrew Gelman","Cristian Pasarica","Statistica Sinica"],"references":{"2699816":"Stochastic Volatility: Likelihood Inference And Comparison With Arch Models","5127626":"Ordering and improving Monte Carlo Markov chains performance","200105001":"Equation of State by Fast Computing Machines","2762543":"Adaptive proposal distribution for random walk Metropolis algorithm. Comput Stat","2306150":"On the Convergence of Monte Carlo Maximum Likelihood Calculations","265369049":"Slice sampling. (With discussions and rejoinder)","3027172":"Algorithms for minimization without derivatives","4895745":"Bayesian Inference in Econometric Models Using Monte Carlo Integration","248413507":"Weighted Average Importance Sampling and Defensive Mixture Distributions","38322438":"On adaptive Markov chain Monte Carlo algorithms","215755923":"In Numerical Receipts in C: The Art of Scientific Computing","221669734":"Equations of State Calculations by Fast Computing Machines","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","220343668":"Population Markov Chain Monte Carlo","246097597":"Estimation and optimization of functions","245810545":"Coupling and Ergodicity of Adaptive MCMC","238291363":"Optimally combining importance sampling techniques for Monte Carlo rendering","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","247011232":"On Markov Chain Monte Carlo Acceleration","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","2574717":"Controlled MCMC for optimal sampling","220286586":"Dram: efficient adaptive MCMC","8525599":"Bayesian Analysis of Serial Dilution Assays","243739482":"Efficient Metropolis Jumping Rules","200111118":"Markov Chains and Stochastic Stability","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","243776875":"Spatial Statistics and Bayesian Computing","246323870":"Gilks WR: Efficient Metropolis jumping rules","241475543":"Identification of Regeneration Times in MCMC Simulation, With Application to Adaptive Schemes","4995513":"Stochastic Volatility: Likelihood Inference and Comparison with ARCH Models","45622656":"Monte Carlo Statistical Methods","285364218":"Biometrika","220695966":"Sampling Techniques, 3rd Edition.","216636373":"Constrained Monte Carlo Maximum LIkelihood for Dependent Data","38322292":"An Adaptive Metropolis Algorithm"},"citedIn":{"259712955":"emcee: The MCMC Hammer","50893706":"Automatic Step Size Selection in Random Walk Metropolis Algorithms","279070817":"MCMC algorithms for Subset Simulation","245994595":"Efficient Sampling Using Metropolis Algorithms: Applications of Optimal Scaling Results","259536819":"On the empirical efficiency of local MCMC algorithms with pools of proposals","51978901":"Comparison between Standard and Adaptive MCMC via their diffusion limits","227719006":"Optimal scaling of Metropolis algorithms: Heading toward general target distributions","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","49458431":"A tutorial on adaptive MCMC","228739696":"Bayesian Inference for Irreducible Diffusion Processes Using the Pseudo-Marginal Approach","239542933":"Adaptive MCMC: Background, Theory, and Simulations","257943561":"Quantile hydrologic model selection and model structure deficiency assessment: 1. Theory","245810545":"Coupling and Ergodicity of Adaptive MCMC","230106656":"Rupture directivity of microearthquakes on the San Andreas Fault from spectral ratio inversion","268881052":"A general construction for parallelizing Metropolis-Hastings algorithms","41035177":"Accelerating Markov Chain Monte Carlo Simulation by Differential Evolution with Self-Adaptive Randomized Subspce Sampling","248132886":"Towards Automatic Reversible Jump Markov Chain Monte Carlo","277292763":"Chapter Y of The Handbook of Applied Bayesian Analysis","233725580":"Finite Adaptation and Multistep Moves in the Metropolis-Hastings Algorithm for Variable Selection in Genome-Wide Association Analysis","253441016":"Optimal Proposal Distributions and Adaptive MCMC","269998132":"Particle Metropolis adjusted Langevin algorithms","278682424":"Estimation of realized stochastic volatility models using Hamiltonian Monte Carlo-Based methods","45916313":"An Adaptive Sequential Monte Carlo Sampler","43500657":"Adaptive independence samplers","2127878":"Selection of a MCMC simulation strategy via an entropy convergence criterion","228867471":"Bayesian computation and the linear model","235703008":"Adaptive Hamiltonian and Riemann Manifold Monte Carlo Samplers","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","277289463":"Optimal scaling of Metropolis algorithms: is 0.234 as robust as believed?","280496847":"Gradient-based MCMC samplers for Dynamic Causal Modelling","5207408":"Adaptive sampling for Bayesian variable selection","236687972":"Adaptive Metropolis-Hastings Sampling using Reversible Dependent Mixture Proposals"},"index":139}