{"abs":"The aim of this paper is to demonstrate the R package conting for the Bayesian analysis of complete and incomplete contingency tables using hierarchical log-linear models. This package allows a user to identify interactions between categorical factors (via complete contingency tables) and to estimate closed population sizes using capture-recapture studies (via incomplete contingency tables). The models are fitted using Markov chain Monte Carlo methods. In particular, implementations of the Metropolis-Hastings and reversible jump algorithms appropriate for log-linear models are employed. The conting package is demonstrated on four real examples.","title":"conting: An R Package for Bayesian Analysis of Complete and Incomplete Contingency Tables","id":262875505,"url":"https://www.researchgate.net/publication/262875505_conting_An_R_Package_for_Bayesian_Analysis_of_Complete_and_Incomplete_Contingency_Tables","names":["Antony M Overstall","Ruth King","Journal of statistical software"],"references":{"271688625":"Incomplete Contingency Tables","225100712":"Reversible jump methods for generalised linear models and generalised linear mixed models","7639414":"Prior Information in Behavioral Capture-Recapture Methods: Demographic Influences on Drug Injectors\u0027 Propensity to Be Listed in Data Sources and Their Drug-related Mortality","237014562":"Injecting drug users in Scotland, 2006: Listing, number, demography, and opiate-related death-rates","242430455":"An R and S-Plus Companion to Applied Regression","222572162":"Bayesian inference for Poisson and multinomial log-linear models","235425989":"The R Development Core Team R: A Language and Environment for Statistical Computing. Volume 1 2010","38359812":"Hyper Markov Laws in the Statistical Analysis of Decomposable Graphical Models","221995881":"Bayesian Data Analysis, London","245345867":"An Introduction to Categorical Data Analysis 18-26","23500723":"Estimating current injectors in Scotland and their drug-related death rate by sex, region and age-group via Bayesian capture-recapture methods","243787602":"A Note on the Bayesian Analysis of Population Size","252572883":"Kendall\u0027s Advanced Theory of Statistics, Vol. 2B: Bayesian Inference","239029977":"On assessing Prior Distributions and Bayesian Regression Analysis with g-Prior Distributions","31327028":"Bayesian methods for estimation of the size of a closed population","259111130":"Incomplete contingency tables with censored cells with application to estimating the number of people who inject drugs in Scotland","247932523":"The Multiple Recapture Census for Closed Populations and Incomplete 2 k Contingency Tables","2834503":"Trans-Dimensional Markov Chain Monte Carlo","261766519":"A default prior distribution for contingency tables with dependent factor levels","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","236157539":"The Selection of Prior Distributions by Formal Rules","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","226261640":"Efficient sampling from the posterior distribution in generalized linear mixed models. Statistics and Computing, 7, 57-68","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","263072663":"Generalized Linear Model","239038211":"A Fast Procedure for Model Search in Multidimensional Contingency Tables","45933889":"Hyper-g Priors for Generalized Linear Models"},"citedIn":{"279034517":"A note on modelling incomplete contingency tables with censored cells","265644521":"On the correspondence between Bayesian log-linear and logistic regression models with g-priors","277960238":"Combination or Differentiation? Two theories of processing order in classification"},"index":141}