{"abs":"We propose a general class of flexible models for longitudinal data with special emphasis on discrete-time survival data. The model is a finite mixture model where the subjects are allowed to move between components through time. The time-varying probabilities of component memberships is modeled as a function of subject-specific time-varying covariates. This allows for interesting within-subject dynamics and manageable computations even with a large number of subjects. Each parameter in the component densities and in the mixing function is connected to its own set of covariates through a link function. The models are estimated using a Bayesian approach via a highly efficient Markov Chain Monte Carlo (MCMC) algorithm with tailored proposals and variable selection in all set of covariates. The focus of the paper is on models for discrete-time survival data with an application to bankruptcy prediction for Swedish firms, using both exponential and Weibull mixture components. The dynamic mixture-of-experts models are shown to have an interesting interpretation and to dramatically improve the out-of-sample predictive density forecasts compared to models with time-invariant mixture probabilities.","title":"Dynamic Mixture-of-Experts Models for Longitudinal and Discrete-time Survival Data","id":259757304,"url":"https://www.researchgate.net/publication/259757304_Dynamic_Mixture-of-Experts_Models_for_Longitudinal_and_Discrete-time_Survival_Data","names":["Matias Quiroz","Mattias Villani","SSRN Electronic Journal"],"references":{"46494854":"Regression density estimation using smooth adaptive Gaussian mixtures","228670437":"Discrete-Time Survival Mixture Analysis","243103227":"Sampling Schemes for Bayesian Variable Selection in Generalized Linear Models","229809333":"Bayesian Survival Analysis","227661917":"Green, P.J.: On Bayesian analysis of mixtures with an unknown number of components (with discussion). J. Roy. Stat. Soc. B. 59, 731-792","38365401":"Statistical Inference for Probability Functions of Finite State Markov Chains","243762774":"Discrete-Time Methods for the Analysis of Event Histories","3769512":"Hierarchical Mixtures of Experts and the EM Algorithm","222708116":"Interpretation and inference in mixture models: Simple MCMC works","228217856":"Taking the Twists into Account: Predicting Firm Bankruptcy Risk with Splines of Financial Ratios","222666782":"Smoothly Mixing Regressions","227458475":"State Space Models With Regime Switching: Classical and Gibbs Sampling Approaches With Applications","225709201":"‘The Impact of Heterogeneity in Individual Frailty on the Dynamics of Mortality’","2557903":"Mixture Models in Econometric Duration Analysis","228312370":"Modeling Conditional Densities Using Finite Smooth Mixtures","238679433":"Regression Models and Life Table","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","38327033":"Markov Chain Monte Carlo Methods and the Label Switching Problem in Bayesian Mixture Modeling","222007433":"‘Unemployment Duration, Unemployment Benefits and Labor Market Programs in Sweden’","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","4814397":"Econometric Methods for Duration of Unemployment","226261640":"Efficient sampling from the posterior distribution in generalized linear mixed models. Statistics and Computing, 7, 57-68","271760455":"Bayes Factors in Practice","23531026":"Firm Default and Aggregate Fluctuations","257146980":"Generalized smooth finite mixtures","233806999":"Adaptive Mixture of Local Expert","246563850":"It\u0027s About Time: Using Discrete-Time Survival Analysis to Study Duration and the Timing of Events","225241873":"Kohn R, Smith M, Chan D. Nonparametric regression using linear combinations of basis functions. Stat Comput 11: 313-322"},"citedIn":{},"index":142}