{"abs":"The first part of this article presents the Monte Carlo implementation of the E step of the EM algorithm. Given the current guess to the maximizer of the posterior distribution, latent data patterns are generated from the conditional predictive distribution. The expected value of the augmented log-posterior is then updated as a mixture of augmented log-posteriors, mixed over the generated latent data patterns (multiple imputations). In the M step of the algorithm, this mixture is maximized to obtain the update to the maximizer of the observed posterior. The gradient and Hessian of the observed log posterior are also expressed as mixtures, mixed over the multiple imputations. The relation between the Monte Carlo EM (MCEM) algorithm and the data augmentation algorithm is noted. Two modifications to the MCEM algorithm (the poor man\u0027s data augmentation algorithms), which allow for the calculation of the entire posterior, are then presented. These approximations serve as diagnostics for the validity of the normal approximation to the posterior, as well as starting points for the full data augmentation analysis. The methodology is illustrated with two examples.","title":"A Monte Carlo Implementation of the EM Algorithm and the Poor Man\u0027s Data Augmentation Algorithm","id":238523240,"url":"https://www.researchgate.net/publication/238523240_A_Monte_Carlo_Implementation_of_the_EM_Algorithm_and_the_Poor_Man\u0027s_Data_Augmentation_Algorithm","names":["Greg C. G. Wei","Martin A. Tanner","Journal of the American Statistical Association"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","216300613":"Practical Methods of Optimization","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","264908393":"Imputation Using Markov Chains","261593363":"Stochastic Simulation","34838165":"Posterior computations with applications for censored regression data /","268998240":"On the convergence of the EM Algorithm","236853525":"Louis TA. Finding the observed information matrix when using the EM algorithm. J R Stat Soc B 44: 226-233","242567994":"Maximum Likelihood Estimation from Incomplete Data","246902471":"Rubin DBMultiple Imputation for Nonresponse in Surveys. New York: J Wiley \u0026 Sons","255563819":"A Fast Improvement to the EM Algorithm on Its Own Terms","221995817":"Maximum Likelihood from Incomplete Data Via EM Algorithm","224275693":"On the Convergence of the Em Algorithm","229193594":"Linear Statistical Inference and Its Applications, Second Edition","254332208":"A Note on the Regression Analysis of Censored Data","243774781":"Monte Carlo methods of inference for implicit statistical models","50335996":"Bayesian inference in statistical analysis.","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","38358932":"On the Convergence Properties of the EM Algorithm","245065445":"A Simple Method for Regression Analysis With Censored Data"},"citedIn":{"221361459":"Learning and Detecting Activities from Movement Trajectories Using the Hierarchical Hidden Markov Models.","220055838":"Estimation from aggregate data","243103352":"Linear Unmixing of Multivariate Observations","290735441":"Statistical Analyses of Next Generation Sequencing Data: An Overview","262316971":"Random swap EM algorithm for Gaussian mixture models","8689806":"Maximum Likelihood Methods for Nonignorable Missing Responses and Covariates in Random Effects Models","243050096":"An augmented data scoring algorithm for maximum likelihood","271951907":"Considering En-Route Choices in Utility-Based Route Choice Modelling","260003686":"Empirical Bayes unfolding of elementary particle spectra at the Large Hadron Collider","243042918":"An efficient MCEM algorithm for fitting generalized linear mixed models for correlated binary data","23570812":"On the modelling and estimation of attribute rankings with ties in the Thurstonian framework","220539193":"Continuous Learning of a Multilayered Network Topology in a Video Camera Network.","4136995":"A Self-Consistent Wavelet Method for Denoising Images with Missing Pixels","258882417":"Nonlinear Time Series: Theory, Methods and Applications with R Examples","245377664":"Analysis of Censored Data from Fractionated Experiments: A Bayesian Approach","264548320":"Variable clustering in high dimensional linear regression models","265084907":"Contributions to the Analysis of Multistate and Degradation Data","4771936":"Missing covariates in generalized linear models when the missing data mechanism is non-ignorable","51960624":"A Skew-t-Normal Multi-Level Reduced-Rank Functional PCA Model with\nApplications to Replicated `Omics Time Series Data Sets","29605354":"Classification automatique par champs de Markov cachés pour la cartographie du risque en épidémiologie","238719504":"Maximum Likelihood Estimation of Tobit Factor Analysis for Multivariate t-Distribution","23572812":"A quantitative approach for polymerase chain reactions based on a hidden Markov model","243775157":"Simulating Ratios of Normalizing Constants via a Simple Identity: A Theoretical Exploration","223582564":"Parameter estimation for excursion set texture models","244971168":"A Novel Formulation for Approximate Bayesian Computation Based on Signed Roots of Log-Density Ratios","232998360":"The Monte Carlo Newton Raphson algorithm","24001874":"A Probit Latent Class Model with General Correlation Structures for Evaluating Accuracy of Diagnostic Tests","4742261":"A Monte Carlo Approach to Filtering for a Class of Marked Doubly Stochastic Poisson Processes","221661558":"Lasso-type estimators for Semiparametric Nonlinear Mixed-Effects Models\nEstimation","257338133":"Maximum likelihood estimation of multinomial probit factor analysis models for multivariate t-distribution","2306150":"On the Convergence of Monte Carlo Maximum Likelihood Calculations","282931354":"Bayesian estimation of a mixture model","51357510":"Monitoring epidemiologic surveillance data using hidden Markov models","3320952":"Monte Carlo Methods for Channel, Phase Noise, and Frequency Offset Estimation With Unknown Noise Variances in OFDM Systems","21370125":"Applications of Multiple Imputation to the Analysis of Censored Regression Data","223904019":"Deletion measures for generalized linear mixed effects models","2327660":"Learning Bayesian Networks For Solving Real-World Problems","220465515":"Inferences for Joint Modelling of Repeated Ordinal Scores and Time to Event Data.","254282599":"Cure rate survival models with missing covariates: A simulation study","222689557":"Estimation of unknown parameters in nonlinear and non-Gaussian state-space models","260897758":"Analysis of changepoint models.","220324213":"A Monte Carlo Implementation of the SAGE Algorithm for Joint Soft-Multiuser Decoding, Channel Parameter Estimation, and Code Acquisition","256296723":"A hierarchical Bayesian model for a variability analysis of measurements of occupational n-hexane exposure in Italy","257800968":"A Sequential Monte Carlo Approach for MLE in a Plant Growth Model","259543853":"Recent developments in expectation-maximization methods for analyzing complex data","235730523":"EMLasso: Logistic lasso with missing data","232814010":"Recursively Imputed Survival Trees","267426730":"Modeling glucose-insulin kinetics and development of type 2 diabetes in offspring of diabetic parents","273322025":"A Regularized Particle Filter EM Algorithm Based on Gaussian Randomization with an Application to Plant Growth Modeling","223472951":"Bayesian learning of finite generalized Gaussian mixture models on images","228984269":"Étude Comparative des outils manipulant les réseaux bayésiens","220557641":"Monte Carlo EM algorithm in logistic linear models involving non-ignorable missing data","275718146":"Copula Gaussian graphical models with penalized ascent Monte Carlo EM algorithm","44584646":"Inference from Multiple Imputation for Missing Data Using Mixtures of Normals. Stat Methodol.","51230562":"Accurate estimation of heritability in genome wide studies using random effects models","227575264":"Analysis of a Two-Level Structural Equation Model With Missing Data","239392308":"An automated (Markov Chain) Monte Carlo EM algorithm","233103764":"The Monte Carlo EM method for estimating multivariate tobit latent variable models","24054045":"The Monte Carlo EM method for estimating multinomial probit latent variable models","277708025":"Markov Chain Monte Carlo (MCMC)Based in part on the article “Markov chain Monte Carlo (MCMC)” by Galin L. Jones and James P. Hobert, which appeared in the Encyclopedia of Environmetrics .","229775815":"Statistical software review","284476547":"Fast Parallel SAME Gibbs Sampling on General Discrete Bayesian Networks","29832639":"Some statistical topics on sequential data assimilation","4791345":"Analysis of marginally specified semi-nonparametric models for clustered binary data","246836943":"Missing Data and Small-Area Estimation","2886742":"Automatic Health Monitoring Using Anonymous,","265172917":"An Automated MCEM Algorithm for Hierarchical Models with Multivariate and Multitype Response Variables","265629609":"On perfect simulation and EM estimation","247652028":"Stochastic versions of the EM algorithm: An experimental study in the mixture case. J. Statist. Comput. Simul., 55 (4): 287-314","2565287":"Learning in presence of input noise using the stochastic EM algorithm","235034247":"Individualized Strategies for Breast Cancer Surveillance Based on Aggregated Familial Information","225437158":"A resource selection model for analyzing pseudoreplicated data due to grouping behavior of animals","5370075":"Influence analysis for the factor analysis model with ranking data","227464452":"Parametric fractional imputation for missing data analysis","275588326":"Maximum a Posteriori Estimation by Search in Probabilistic Programs","51895194":"Unsupervised Learning of Categorical Segments in Image Collections","227618048":"Local influence analysis for regression models with scale mixtures of skew-normal distributions","12079146":"Maximum Likelihood Methods for Cure Rate Models with Missing Covariates","283887737":"Regression analysis with nonignorably missing covariates using surrogate data","2616496":"Inferring High-Level Behavior from Low-Level Sensors","2880690":"Linear Gaussian Models for Speech Recognition","51893132":"Approximate inference via variational sampling","247503451":"Discriminant Analysis Using Mixed Continuous, Dichotomous, and Ordered Categorical Variables","241622781":"A probabilistic imputation framework for predictive analysis using variably aggregated, multi-source healthcare data","223389135":"Influence analyses of nonlinear mixed-effects models","222679526":"Quasi-Monte Carlo sampling to improve the efficiency of Monte Carlo EM","254015367":"Bayesian calibration of stochastic computer models","40892106":"Continuous Learning of a Multilayered Network Topology in a Video Camera Network","222794210":"Almost sure convergence of a class of stochastic algorithms","2858125":"The Estimation of Phase-type Related Functionals Using Markov Chain Monte Carlo Methods","223748606":"A Monte Carlo Newton–Raphson procedure for maximizing complex likelihoods on pedigree data","4744417":"Monte Carlo Deconvolution of Digital Signals Guided by the Inverse Filter","51420089":"A comparison of hospital performance with non-ignorable missing covariates: An application to trauma care data","10999819":"Maximum Likelihood Inference for Multivariate Frailty Models Using an Automated Monte Carlo EM Algorithm","285549992":"A Survey on Joint Tracking Using Expectation-Maximization Based Techniques","281947232":"Simulation techniques for parameter estimation via a stochastic ECM algorithm with applications to plant growth modeling","4993250":"Meta-analysis for 2 × 2 tables using an average Markov chain Monte Carlo EM algorithm","11796484":"Maximum Likelihood Estimation of Two-Level Latent Variable Models with Mixed Continuous and Polytomous Data","233076052":"Binary regression with a class of skewed t link models","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","259821518":"Modèles, estimation bayésienne et algorithmes pour la déconvolution d\u0027images satellitaires et aériennes","265089913":"Modeling source-memory overdistribution","51944353":"The Generalization Ability of Online Algorithms for Dependent Data","24103380":"An Extreme Value Approach to Estimating Volatility and Value at Risk","254287766":"A New Skewed Link Model for Dichotomous Quantal Response Data","247503363":"Comparison of Approaches in Estimating Interaction and Quadratic Effects of Latent Variables","229534061":"Rediscovering ACL Discoveries Through the Lens of ACL Anthology Network Citing Sentences","228757862":"Empirical Bayes density regression","266281754":"Gaussian Processes for State Space Models and Change Point Detection","4744334":"Likelihood-Based Methods for Missing Covariates in the Cox Proportional Hazards Model","4729985":"Markov Chain Monte Carlo Simulation Methods in Econometrics","265134854":"Mast species composition alters seed fate in North American rodent–dispersed hardwoods","228477266":"Case-Deletion Diagnostics for Nonlinear Structural Equation Models","277332043":"A Robust MCMC-based Method for Piecemeal Estimation of Distributional Features in Continuous Data","278807635":"A nonlinear mixed effects model to explain inter-individual variability in plant populations","241044112":"Particle Filtering with applications in Finance","220286447":"A computational framework for empirical Bayes inference","282544153":"Robust mixture regression modeling based on scale mixtures of skew-normal distributions","220368368":"The Monte Carlo EM method for the parameter estimation of biological models","221710820":"Parameter Estimation from Censored Samples using the\nExpectation-Maximization Algorithm","2607347":"Assessing the Strength of Carbon Fibres","7681184":"Latent class regression on latent factor","1760460":"Monte Carlo likelihood inference for missing data models","233429311":"Application of Structural Equation Models to Quality of Life","224635316":"A practical algorithm for network topology inference","5857408":"Accounting for roughness of circular processes: Using Gaussian random processes to model the anisotropic spread of airborne plant disease","24063413":"Analysis of structural equation model with ignorable missing continuous and polytomous data","288178678":"Sequential Monte Carlo Methods for System Identification","24063409":"Maximum likelihood estimation of nonlinear structural equation models","243042979":"Laplace Importance Sampling for Generalized Linear Mixed Models","27714882":"Capture-recapture studies with incomplete mixed categorical and continous covariates","46494240":"Joint analysis of mixed Poisson and continuous longitudinal data with nonignorable missing values","260406112":"A Brief Survey of Modern Optimization for Statisticians","237044423":"Quantifying Simulator Discrepancy in Discrete-Time Dynamical Simulator","262039416":"A Stochastic EM Type Algorithm for Parameter Estimation in Models with Continuous Outcomes, under Complex Ascertainment","283286532":"Mixture models for analyzing product reliability data: a case study","3320024":"Automatic Estimation of Multiple Target Positions and Velocities Using Passive TDOA Measurements of Transients","24063365":"Random effects diagonal metric multidimensional scaling models","254287815":"Fitting Full-Information Item Factor Models and an Empirical Investigation of Bridge Sampling","265153340":"Simulation And Likelihood-Based Estimation For Discretely Observed Diffusion Processes Using The Exact Algorithm","220056040":"MCMC-based estimation methods for continuous longitudinal data with non-random (non)-monotone missingness","261265255":"A smart meter based approach to power reliability index for enterprise-level power grid","282055737":"Estimation of the Weight Parameter with SAEM for Marked Point Processes Applied to Object Detection","258104219":"A fast Monte Carlo EM algorithm for estimation in latent class model analysis with an application to assess diagnostic accuracy for cervical neoplasia in women with AGC","228539746":"The EM algorithm","24063377":"Bayesian Estimation of a Multilevel IRT Model Using Gibbs Sampling","229640368":"On spatial skew‐Gaussian processes and applications","11159976":"A Latent Autoregressive Model for Longitudinal Binary Data Subject to Informative Missingness","220056607":"Efficient direct sampling MCEM algorithm for latent variable models with binary responses","224641127":"Estimating Trajectory Hmm Parameters Using Monte Carlo Em With Gibbs Sampler","228743334":"Maximum Likelihood Estimation of Nonlinear Structural Equation Models with Ignorable Missing Data","227369099":"Domain-Level Covariance Analysis for Multilevel Survey Data With Structured Nonresponse","223608914":"Comparison of optimization techniques for sequence pattern discovery by maximum-likelihood","228860077":"The EM algorithm, its stochastic implementation and global optimization: Some challenges and opportunities for OR","233824483":"Estimating the Static Parameters in Linear Gaussian Multiple Target\nTracking Models","4898116":"Maximum likelihood estimation and model comparison of nonlinear structural equation models with continuous and polytomous variables","253207046":"Ergodic Subgradient Descent","269116697":"On analysis of incomplete field failure data","238072612":"Maximum Likelihood Estimation for the Bombing Model","2633022":"Hierarchical Models: A Current Computational Perspective","268010222":"A Marginal Likelihood Approach to Estimation in Frailty Models","6134085":"Model-based estimation of the link between the daily survival probability and a time-varying covariate, application to mosquitofish survival data","227932297":"Fitting Non-Linear Time Series Models, with Applications to Stochastic Variance Models","251390948":"Bayesian analysis of quantile regression for censored dynamic panel data","225270863":"Estimation in nonlinear mixed-effects models using heavy-tailed distributions","226318431":"The Role of Additional Information in Option Pricing: Estimation Issues for the State Space Model","44256128":"What to do When Your Hessian is Not Invertible: Alternatives to Model Respecification in Nonlinear Estimation","5207395":"Joint modelling of accelerated failure time and longitudinal data","290848889":"A Shared Parameter Model for Longitudinal Data with Missing Values","241622870":"A generative framework for predictive modeling using variably aggregated, multi-source healthcare data","51890727":"EM algorithm and variants: an informal tutorial","11159963":"A Frailty Model for Informative Censoring","227842214":"Incomplete data in generalized linear models with continuous covariates","12080525":"Assessing human fertility using several markers of ovulation","47645666":"Likelihood Analysis of Multivariate Probit Models Using a Parameter Expanded MCEM Algorithm","222021645":"Local influence analysis of multivariate probit latent variable models","222262276":"Hierarchical models for repeated binary data using the IBF sampler","24065105":"Some New Formulae for Posterior Expectations and Bartlett Corrections","278619556":"Statistical Inference for Oscillation Processes","228354268":"Continuous Contour Monte Carlo for Marginal Density Estimation With an Application to a Spatial Statistical Model","263166702":"Stochastic EM-based TFBS motif discovery with MITSU","2131300":"Sequential Monte Carlo smoothing with application to parameter estimation in non-linear state space models","10989027":"Use of the mean, hot deck and multiple imputation techniques to predict outcome in intensive care unit patients in Colombia","232278160":"A modified Latent Class Model assessment of human papillomavirus-based screening tests for cervical lesions in women with atypical glandular cells: A Gynecologic Oncology Group study","257392159":"A sequential approach for stochastic computer model calibration and prediction","271626616":"Improved Estimation and Uncertainty Quantification Using Monte Carlo-Based Optimization Algorithms","222424074":"Self-calibration of a vision-based sensor network","286793812":"Analysis of changepoint models","257665558":"Likelihood-based and Bayesian methods for Tweedie compound Poisson linear mixed models. Stat Comput","262370034":"The generalized Dirichlet distribution in enhanced topic detection","10710512":"Stochastic EM for Estimating the Parameters of a Multilevel IRT Model","12018146":"Mixed effects Models with Censored Data with Application to HIV RNA Levels","2660734":"Monte Carlo EM with importance reweighting and its application in random effects models","38437661":"Causal effects in randomized trials in the presence of partial compliance: breastfeeding on infant growth","227715274":"On the Convergence of the Monte Carlo Maximum Likelihood Method for Latent Variable Models","4720913":"Maximum likelihood estimation in nonlinear mixed effects model","265852549":"SAME but Different: Fast and High-Quality Gibbs Parameter Estimation","257665542":"On a convergent stochastic estimation algorithm for frailty models","222446621":"Estimation and Comparison of Multiple Change-Point Models","254287433":"Estimation with Selected Binomial Information or Do You Really Believe That Dave Winfield is Batting .471?","227664115":"The EM Algorithm—An Old Folk Song Sung to a Fast New Tune (with Discussion)","266859136":"Linear and Generalized Linear Mixed Models and Their Applications","282458556":"Approximate Methods for Maximum Likelihood Estimation of Multivariate Nonlinear Mixed-Effects Models","12018140":"Monte Carlo EM for Missing Covariates in Parametric Regression Models","12018119":"Applying the Cox Proportional Hazards Model When the Change Time of a Binary Time‐Varying Covariate Is Interval Censored","220502103":"Discrete Markov image modeling and inference on the quadtree.","2800990":"Listwise Deletion is Evil: What to Do About Missing Data in Political Science","263473859":"Multiple indicators, multiple causes measurement error models","238834501":"Pointwise and functional approximations in Monte Carlo maximum likelihood estimation","33714040":"Entwicklung eines Monte-Carlo-Verfahrens zum selbständigen Lernen von Gauss-Mischverteilungen /","271725903":"Modeling veterans’ health benefit grants using the expectation maximization algorithm","200744585":"Learning model-free robot control by a Monte Carlo EM algorithm","30513234":"Modèles linéaires généralisés à effets aléatoires : contributions au choix de modèle et au modèle de mélange","262386212":"On the Monte-Carlo Expectation Maximization for Finding Motifs in DNA Sequences","264243783":"A Stochastic EM Algorithm for Progressively Censored Data Analysis","4993476":"Analysis of interval-censored data from clustered multistate processes: Application to joint damage in psoriatic arthritis","220066967":"Theory and Use of the EM Algorithm","4772293":"Exact and computationally efficient likelihood-based estimation for discretely observed diffusion processes","26690565":"Spatiotemporal Structure of Host-Pathogen Interactions in a Metapopulation","23632123":"Bayesian estimation of hidden Markov chains","5597633":"Discrete Markov image modeling and inference on the quadtree","258583294":"Training sparse natural image models with a fast Gibbs sampler of an extended state space","270516616":"Generating realistic assemblages with a Joint Species Distribution Model","6579707":"HIV viral dynamic models with dropouts and missing covariates","291011833":"Distinct Cortical Pathways for Music and Speech Revealed by Hypothesis-Free Voxel Decomposition","51892927":"Ergodic Mirror Descent","238865301":"On Recursive Estimation in Incomplete Data Models","45648657":"High-Dimensional Variable Selection in Meta-Analysis for Censored Data","6015473":"A Mixed Mover-Stayer Model for Spatiotemporal Two-State Processes","279507207":"Approximate methods for joint models in longitudinal studies","268380751":"Imperfect variables: The combined problem of missing data and mismeasured variables with application to generalized linear models","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","276126148":"A Markov random field-based approach to characterizing human brain development using spatial–temporal transcriptome data","259536586":"An approximate expectation maximisation algorithm for estimating parameters in nonlinear dynamic models with process disturbances","228611091":"Model-based analysis to improve the performance of iterative simulations","223067391":"Deterministic local alignment methods improved by a simple genetic algorithm","40867802":"Random Effects Modeling of Categorical Response Data","51254969":"Maximum likelihood estimation in generalized linear models with multiple covariates subject to detection limits. Stat Med","3693952":"On-line blind equalization of FIR channels using a Gibbsian technique","4150661":"Topology inference for a vision-based sensor network","24128714":"Worst-case estimation and asymptotic theory for models with unobservables","7626186":"Missing Covariates in Longitudinal Data with Informative Dropouts: Bias Analysis and Inference","257475230":"Time-changed GARCH versus the GARJI model for prediction of extreme news events: An empirical study","263642736":"Metropolis-Hastings Expectation Maximization Algorithm for Incomplete Data","261104215":"An EM and a Stochastic Version of the EM Algorithm for Nonparametric Hidden Semi-Markov Models","232969253":"Analysis of clustered spatially correlated binary data using autologistic model and Bayesian method with an application to dental caries of 3–5-year-old children","233410592":"Employing a Monte Carlo algorithm in expectation maximization restricted maximum likelihood estimation of the linear mixed model","229565541":"Factor analysis for ranked data with application to a job selection attitude survey","2360808":"Simulation-Based Methods for Blind Maximum-Likelihood Filter Identification","4993408":"Non-ignorable missing covariate data in survival analysis: a case-study of an international breast cancer study group trial. J R Stat Soc, Ser C, Appl Stat","266454575":"INFORMATION FUSION AND SPARSITY PROMOTION USING CHOQUET INTEGRALS","223748248":"Choosing starting values for the EM algorithm for getting the highest likelihood in multivariate Gaussian mixture models. Comput Stat Data Anal 41(3-4):561-575","1913298":"Adaptive methods for sequential importance sampling with application to state space models","7266750":"A data-driven clustering method for time course gene expression data. Nucleic Acids Res","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","2738684":"Bayesian Mixture Modeling by Monte Carlo Simulation","23693502":"Partial Likelihood Estimation of a Cox Model with Random Effects: an EM Algorithm based on Penalized Likelihood.","228290627":"Intra-Daily Variations in Volatility and Transaction Costs in the Credit Default Swap Market","284747042":"A VG-NGARCH Model for Impacts of Extreme Events on Stock Returns","27524222":"Analysis of Modeling, Training, and Dimension Reduction Approaches for Target Detection in Hyperspectral Imagery","2296318":"Semiparametric Bayesian Analysis Of Survival Data","227357776":"Alternating imputation posterior estimation of models with crossed random effects","29645851":"SAEM-MCMC: some criteria","4772247":"Ascent-based Monte Carlo expectation- maximization","220226754":"Simulation-based methods for blind maximum-likelihood filter identification","241191810":"A modified Monte Carlo EM algorithm for a three-parameter distribution","224141496":"A multiresolution EM algorithm for unsupervised image classification","257338034":"Constrained EM algorithm with projection method","254297806":"Joint analysis of occurrence and time to stability after entrance into the Italian labour market: an approach based on a Bayesian cure model with structured stochastic search variable selection","266147387":"Identification of jump Markov linear models using particle filters","237175748":"State-space likelihoods for nonlinear fisheries time-series","251566873":"Geostatistical modeling using non-Gaussian Matérn fields","11594073":"A Multiple Imputation Approach to Regression Analysis for Doubly Censored Data with Application to AIDS Studies","30518332":"Inference dans les modeles dynamiques de population: applications au VIH et au VHC","235038701":"Asymptotic Properties of a Stochastic EM Algorithm for Estimating Mixing Proportions","222701744":"Trucking industry adoption of information technology: A multivariate discrete choice model","265993763":"Gentle. Elements of Computational Statistics","5991841":"Exploring Fast Computational Strategies for Probabilistic Phylogenetic Analysis","279864661":"A latent variable model with mixed binary and continuous response variables","238865344":"Three Stochastic Versions of the EM Algorithm for Estimating Longitudinal Rasch Model","44226396":"Multi-tree Monte Carlo methods for fast, scalable machine learning","220286753":"Marginal Maximum A Posteriori Estimation using Markov Chain Monte Carlo","228894628":"Local influence analysis of two-level latent variable models with continuous and polytomous data","265609680":"Empirical Bayes Gaussian likelihood estimation of exposure distributions from pooled samples in human biomonitoring","2287146":"Method of Moments Using Monte Carlo Simulation","45843634":"A Stochastic Algorithm for Probabilistic Independent Component Analysis","4732481":"Assessing local influence for nonlinear structural equation models with ignorable missing data","258824551":"Methods for a longitudinal quantitative outcome with a multivariate Gaussian distribution multi-dimensionally censored by therapeutic intervention","220056337":"Nonstationary covariance modeling for incomplete data: Monte Carlo EM approach","5229151":"The analysis of multivariate recurrent events with partially missing event types. Lifetime Data Anal 15: 41-58","277023378":"Programming with models: writing statistical algorithms for general model structures with NIMBLE","2771513":"On Simulated EM Algorithms","265584064":"Standard Errors of Prediction in Generalized Linear Mixed Models","51185943":"Language Evolution by Iterated Learning With Bayesian Agents","228607876":"Trucking Industry Adoption . . .","250185922":"Maximum Likelihood Analysis of a Two-Level Nonlinear Structural Equation Model With Fixed Covariates","220286730":"A parameter expansion version of the SAEM algorithm","45926545":"Sweave Documentation for \"Implementing Markov chain Monte Carlo: Estimating with confidence\"","232823760":"Estimation of parameters for a Birnbaum–Saunders regression model with censored data","4746879":"Monte Carlo State-Space Likelihoods by Weighted Posterior Kernel Density Estimation","8981169":"Regression Modeling with Recurrent Events and Time-Dependent Interval-Censored Marker Data","38348915":"Convergence of the Monte Carlo expectation maximization for curved exponential families","2423326":"Analyzing Incomplete Political Science Data: An Alternative Algorithm for Multiple Impuation","8373829":"Maximum Likelihood Analysis of a General Latent Variable Model with Hierarchically Mixed Data","24060756":"Generalized linear mixed models with informative dropouts and missing covariates","233298906":"Computationally efficient Monte Carlo EM algorithms for generalized linear mixed models","225136469":"A Statistical Framework for Partial Volume Segmentation","257128812":"On the difficulty to delimit disease risk hot spots","3316338":"Unsupervised deconvolution of sparse spike trains using stochastic approximation","228210650":"Filtered Likelihood for Point Processes","221619063":"Sampling Methods for Unsupervised Learning.","228937697":"Model Selection in Structural Equation Models With Continuous and Polytomous Data","291389204":"Toward integration of genomic selection with crop modelling: the development of an integrated approach to predicting rice heading dates","226559948":"Fast and Efficient Model-Based Clustering with the Ascent-EM Algorithm","21214988":"Application of longitudinal methods to the analysis of menstrual diary data","11473632":"On Estimation and Prediction for Spatial Generalized Linear Mixed Models","6200844":"REML Estimation of Variance Parameters in Nonlinear Mixed Effects Models Using the SAEM Algorithm","241228851":"Tools for Statistical Inference: Observed Data and Data Augmentation Methods, Vol. 67 of Lecture Notes in Statistics","228751350":"Inference with a contrast-based posterior distribution and application in spatial statistics","11473657":"Frailty Models with Missing Covariates","51000669":"Genetic Variance Components Estimation for Binary Traits Using Multiple Related Individuals","221111162":"Efficient Indexing for Large Scale Visual Search","259369250":"Le modèle linéaire mixte","233075635":"Sufficient Conditions for Ergodicity and Convergence of MH, SA, and EM Algorithms","221015920":"Simultaneous Tracking and Activity Recognition (STAR) Using Many Anonymous, Binary Sensors","257486084":"Multivariate geostatistical mapping of radioactive contamination in the Maddalena Archipelago (Sardinia, Italy): Spatial special issue","228408258":"Sensor Network Topology Inference","5266993":"Evaluations of Maximization Procedures for Estimating Linkage Parameters under Heterogeneity","222750498":"A computationally efficient method for nonlinear mixed-effects models with nonignorable missing data in time-varying covariates","259571985":"Particle Gibbs with Ancestor Sampling","233390979":"Random Utility Theory for Social Choice","260168171":"Regression for Skewed Biomarker Outcomes Subject to Pooling","270163568":"A Fast EM Algorithm for Fitting Joint Models of a Binary Response and Multiple Longitudinal Covariates Subject to Detection Limits","246868189":"Monte Carlo EM Estimation for Time Series Models Involving Counts","224587532":"Gamma Markov Random Fields for Audio Source Modeling","283985566":"On quadratic logistic regression models when predictor variables are subject to measurement error","269307512":"SCHEME: Stochastically convergent heuristical Expectation Maximization estimation","281567934":"Variable Clustering in High-Dimensional Linear Regression: The R Package clere","243083275":"Maximization of the Marginal Likelihood of Grouped Survival Data","1921642":"Incorporating a contrast in the Bayesian formula: What consequences for the MAP estimator and the posterior distribution? Applications in spatial statistics","2842194":"Voronoi Tracking: Location Estimation Using Sparse and Noisy Sensor Data","1761888":"A correlated topic model of Science","282800806":"The Generalized Dirichlet Distribution in Enhanced Topic Detection","233922447":"UbiComp 2003: ubiquitous computing: 5th international conference, Seattle, WA, USA, October 12-15, 2003: proceedings","46536888":"High-dimensional Exploratory Item Factor Analysis by A Metropolis–Hastings Robbins–Monro Algorithm","265483600":"Missing Data, Imputation, and the Bootstrap","265432406":"STATISTICAL MODELLING OF FISH STOCKS","4896461":"Unequal sampling for Monte Carlo EM algorithms","269876892":"Asymptotics of Monte Carlo maximum likelihood estimators","275043053":"Tracking Temporal Dynamics of Purchase Decisions via Hierarchical Time-Rescaling Model","51917204":"Sequential Monte Carlo EM for multivariate probit models","264875332":"AN EM ALGORITHM FOR MIXED-TYPE MULTIPLE OUTCOME REGRESSIONS WITH APPLICATIONS TO A PROSTATE CANCER STUDY","236615831":"Convergence of a stochastic approximation version of EM algorithm","5764824":"Gaussian Process Dynamical Models for Human Motion","270286476":"Forecasting in the presence of in and out of sample breaks","5437122":"A two‐level structural equation model approach for analyzing multivariate longitudinal responses","228656945":"“A Spatial Model of Electoral Platforms","220714934":"Parameter Estimation of Kinetic Rates in Stochastic Reaction Networks by the EM Method","3087036":"Network Inference From Co-Occurrences","12826198":"Non-ignorable missing covariates in generalized linear models. Stat Med","224750579":"Rao-Blackwellised Gibbs sampling for switching linear dynamical systems","260740370":"Unsupervised classification and analysis of objects described by nonparametric probability distributions","4772563":"Incomplete covariates in the Cox model with applications to biological marker data","222396384":"EM Procedures Using Mean Field-Like Approximations for Markov Model-Based Image Segmentation","2858634":"First-Order Probabilistic Models for Information Extraction","280773144":"An Empirical Bayesian Analysis of Simultaneous Changepoints in Multiple Data Sequences","260062501":"Skew-Gaussian Random Fields","221345688":"Hierarchical kernel stick-breaking process for multi-task image analysis","33517398":"Locati[o]n-based activity recognition","257075705":"An efficient stochastic approximation EM algorithm using conditional particle filters","4746980":"Exact and Approximate Inferences for Nonlinear Mixed-Effects Models With Missing Covariates","227687200":"Latent variable model with mixed continuous and polytomous data","227276601":"An Introduction to MCMC for Machine Learning","4750074":"Regression models for binary time series with gaps","2762398":"Convergence in Norm for Alternating Expectation-Maximization (EM) Type Algorithms","8534582":"Bayesian analysis of two-level nonlinear structural equation models with continuous and polytomous data","276922932":"Statistical unfolding of elementary particle spectra: Empirical Bayes estimation and bias-corrected uncertainty quantification","4818687":"A semiparametric nonlinear mixed-effects model with non-ignorable missing data and measurement errors for HIV viral data","4849393":"Estimation of the SUR Tobit model via the MCECM algorithm","241677535":"De l\u0027identification de structure de réseaux bayésiens à la reconnaissance de formes à partir d\u0027informations complètes ou incomplètes","2367129":"Simulation-Based Likelihood Inference for Limited Dependent Processes","262052190":"Parameter estimation via stochastic variants of the ECM algorithm with applications to plant growth modeling","236264661":"A Monte Carlo Metropolis-Hastings Algorithm for Sampling from Distributions with Intractable Normalizing Constants","221402102":"A Statistical Framework for Partial Volume Segmentation.","222207991":"A Stochastic EM algorithm for a semiparametric mixture model","270666472":"Inference for a Failure Counting Process Partially Observed","51423707":"A unified framework for group independent component analysis for multi-subject fMRI data","261539165":"Imputation for statistical inference with coarse data","227464000":"Slippage in Conservation Cost Sharing","227596098":"Bayesian Analysis of Multivariate Probit Models with Surrogate Outcome Data","265581825":"Maximum likelihood estimation via the ECM algorithm: Computing the asymptotic variance","222456730":"Calculating Posterior Distributions and Modal Estimates in Markov Mixture Models","236839108":"Factor analysis for paired ranked data with application on parent–child value orientation preference data","220363771":"A Monte Carlo method for filtering a marked doubly stochastic Poisson process","278310479":"Expectation Maximization Algorithm","250185776":"Metropolis-Hastings Robbins-Monro Algorithm for Confirmatory Item Factor Analysis","251661787":"Parametric fractional imputation for nonignorable missing data","266370364":"Inference of Kronecker Structure","271637230":"Finite mixture model applied in the analysis of a turbulent bistable flow on two parallel circular cylinders","254287351":"A Technique for Estimating Marginal Posterior Densities in Hierarchical Models Using Mixtures of Conditional Densities","3194576":"Correction to \"Gaussian Process Dynamical Models for Human Motion\" [Feb 08 283-298]","26706807":"A Monte Carlo EM Algorithm for De Novo Motif Discovery in Biomolecular Sequences","222446496":"Posterior simulation and Bayes factors in panel count data model","257665464":"An improved SAEM algorithm for maximum likelihood estimation in mixtures of non linear mixed effects models","250185738":"An Importance Sampling EM Algorithm for Latent Regression Models","266187060":"A Latent Variable Approach for Statistical Inference in Tweedie Compound Poisson Linear Models","226958188":"Hierarchical Multinomial Processing Tree Models: A Latent-Trait Approach","230520658":"Three Ways of Implementing the EM Algorithm when Parameters are not Identifiable","220396499":"Occam\u0027s Razor Applied to Network Topology Inference.","266885401":"Working Paper Series Monte Carlo likelihood inference for marked doubly stochastic Poisson processes with intensity driven by marked point processes","5767851":"Data Augmentation Algorithms for Detecting Conserved Domains in Protein Sequences: A Comparative Study","269998816":"Joint Modeling and Clustering Paired Generalized Longitudinal Trajectories With Application to Cocaine Abuse Treatment Data","3450573":"Occam\u0027s Razor Applied to Network Topology Inference","257665441":"Latent variable models with ordinal categorical covariates","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","4741811":"Linear Unmixing of Multivariate Observations: A Structural Model","224254886":"Hybrid generative-discriminative classification using posterior divergence","267684107":"Skew-normality for climatic data and dispersal models for plant epidemiology: When application fields drive spatial statistics","241551716":"Monotonicity properties of the Monte Carlo EM algorithm and connections with simulated likelihood","45709752":"Inferences for Joint Modelling of Repeated Ordinal Scores and Time to Event Data","23307873":"Mechanical-Statistical Modeling in Ecology: From Outbreak Detections to Pest Dynamics","228847271":"Genetic association studies with complex ascertainment","4986697":"Missing Data and Small-Area Estimation: Modern Analytical Equipment for the Survey Statistician. Nicholas T. Longford","272754504":"Geostatistical Modelling Using Non-Gaussian Matérn Fields","50996224":"Handbook of Monte Carlo Methods","234029816":"Neuromotor development in children. Part 3: Motor performance in 3- to 5-year-olds","12796879":"Robust QTL effect estimation using the Minimum Distance method","5926743":"A Parametric k-Means Algorithm.","226522768":"A New Concurrent Calibration Method for Nonequivalent Group Design under Nonrandom Assignment","225965669":"Mixture model for inferring susceptibility to mastitis in dairy cattle: a procedure for likelihood-based inference","4729693":"Conditions for convergence of Monte Carlo EM sequences with an application to product diffusion modeling","228345477":"Ascent EM for fast and global model-based clustering: An application to curve-clustering of online auctions","225423989":"Accounting for spot matching uncertainty in the analysis of proteomics data from two-dimensional gel electrophoresis","234494689":"Statistical methods for biodosimetry in the presence of both Berkson and classical measurement error","222183970":"Analysis of longitudinal data with intermittent missing values using the stochastic EM algorithm","243043681":"A Bayesian Approach for Nonlinear Structural Equation Models With Dichotomous Variables Using Logit and Probit Links","41308503":"Apprentissage de modèles de formes parcimonieux basés sur des représentations splines","242396502":"DOCTORAL DISSERTATION REFORMULATING HMM AS A TRAJECTORY MODEL BY IMPOSING EXPLICIT RELATIONSHIPS BETWEEN STATIC AND DYNAMIC FEATURES","221619731":"Distributed Inference for Latent Dirichlet Allocation.","273792889":"Multiple imputation for the analysis of incomplete compound variables","21674595":"Computational aspects of analysing random effects/longitudinal models","3333915":"Bounded support Gaussian mixture modeling of speech spectra","281895905":"A two-state mixed hidden Markov model for risky teenage driving behavior","250077642":"Computing Normalizing Constants for Finite Mixture Models via Incremental Mixture Importance Sampling (IMIS)","251112899":"Useful Tools for Statistics and Machine Learning","220286487":"Multivariate generalized linear mixed models with semi-nonparametric and smooth nonparametric random effects densities","229100176":"Stochastic Variants of EM: Monte Carlo, Quasi-Monte Carlo and More","227693231":"Latent Variable Models for Mixed Discrete and Continuous Outcomes","4986737":"Penalized Clustering of Large-Scale Functional Data With Multiple Covariates","24063569":"High-dimensional maximum likelihood item factor analysis by adaptive quadrature","223677035":"Fisher scoring: An interpolation family and its Monte Carlo implementations","275969842":"Joint Sequential Target State Estimation and Clock Synchronization in Wireless Sensor Networks","224626209":"Learning Sensor Network Topology through Monte Carlo Expectation Maximization","220270180":"Location-based activity recognition","6353705":"SEAM: a Stochastic EM-type Algorithm for Motif-finding in biopolymer sequences.","46538122":"Frailty Correlated Default","254287975":"Missing data: Dial M for","222828039":"Asymptotic properties of a stochastic EM algorithm for mixtures with censored data","224878134":"Accelerated maximum likelihood parameter estimation for stochastic biochemical systems","256410649":"Linear mixed models for longitudinal data with non-random dropouts","277104597":"Global Optimization of Finite Mixture Models","236132672":"A model for analyzing spatially correlated binary data clustered in uncorrelated lattices","228862706":"Implementations of the MCEM algorithm","6668082":"Genetic analysis of growth curves using the SAEM algorithm","253198400":"Change detection for remote sensing images with graph cuts","48209283":"Stochastic Approximation and Newton\u0027s Estimate of a Mixing Distribution","266525886":"ON A NEW STOCHASTIC VERSION OF THE EM ALGORITHM","51614798":"The Construction of Semantic Memory: Grammar-Based Representations Learned from Relational Episodic Information","266211456":"Statistical Methods for Detecting Super-Positional Signals in a Wireless Channel","254296182":"A Simple Method for Computing the Observed Information Matrix When Using the EM Algorithm with Categorical Data","278660094":"Recent Developments in Model-Based Clustering with Applications","13536173":"Estimating Equations with Incomplete Categorical Covariates in the Cox Model","263225555":"Hybrid Bayesian inference on HIV viral dynamic models","2756430":"A Simulated Annealing Version of the EM Algorithm for non-Gaussian deconvolution","46494115":"Maximum likelihood estimation in vector long memory processes via EM algorithm","225754643":"Bayesian and non-bayesian analysis of gamma stochastic frontier models by Markov Chain Monte Carlo methods","229659351":"A Particle Filter Approach to Identification of Nonlinear Processes Under Missing Observations","221677150":"Spatial Interpolation of Extreme Values","12778410":"Applying the Cox proportional hazards model for analysis of latency data with interval censoring","261669108":"Maximum Likelihood Analysis of Nonlinear Structural Equation Models With Dichotomous Variables","233842332":"1105.1508v2","268820340":"Noise Benefits in Expectation-Maximization Algorithms","248413629":"A Weighted Estimating Equation for Missing Covariate Data with Properties Similar to Maximum Likelihood","255970354":"Backward Simulation Methods for Monte Carlo Statistical Inference","281608123":"Inference of the Transition Matrix in Convolved Hidden Markov Models and the Generalized Baum–Welch Algorithm","247837106":"Are Product Returns a Necessary Evil? Antecedents and Consequences","225821197":"Copula analysis of mixture models","220286555":"Application of a predictive distribution formula to Bayesian computation for incomplete data models","6589208":"Modelling effectiveness of internally heterogeneous organizations in the presence of survey non-response: An application to the ULTRA study","233264795":"Approximate marginal densities of independent parameters","24063504":"Local influence analysis of nonlinear structural equation models","222802631":"Maximum Likelihood Estimation of Factor and Ideal Point Models for Paired Comparison Data","222573252":"A Bayesian model selection method with applications","271556526":"Discriminatively Enhanced Topic Models","226643459":"Random effects diagonal metric multidimensional scaling models","259128562":"Handling nonignorable nonresponse with respondent modeling and the SIR algorithm","228433432":"Full Maximum Likelihood Estimation of Polychoric and Polyserial Correlations With Missing Data","258404576":"Credit Portfolios, Credibility Theory, and Dynamic Empirical Bayes","220286632":"Nonparametric empirical Bayes for the Dirichlet process mixture model","224109265":"Beyond Local Optimality: An Improved Approach to Hybrid Model Learning","254296227":"Maximum Likelihood for Generalized Linear Models with Nested Random Effects via High-Order, Multivariate Laplace Approximation","24275710":"Analysis of ordinal categorical data with misclassification","220226220":"Multi-phase image modelling with excursion sets","4156338":"Learning and Detecting Activities From Movement Trajectories Using the Hierarchical Hidden Markov Model","51661978":"An approach for jointly modeling multivariate longitudinal measurements and discrete time-to-event data","254288038":"Comparison of Partially Measured Latent Traits Across Nominal Subgroups","227351042":"Credit Ratings in the Presence of Bailout: The Case of Mexican Subnational Government Debt","280008480":"PMDA-schemed EM Channel Estimator for OFDM Systems","228735537":"A Stochastic EM type algorithm for estimation in data with ascertainment on continuous outcomes","220907199":"The Network Completion Problem: Inferring Missing Nodes and Edges in Networks","8394517":"Modelling the distribution ischaemic stroke-specific survival time using an EM-based mixture approach with random effects adjustment","262491187":"Maximum likelihood estimation of the Markov-switching GARCH model","279164725":"Data-Adaptive Shrinkage via the Hyperpenalized EM Algorithm","227716613":"On Convergence Properties of the Monte Carlo EM Algorithm","221400741":"Monte Carlo Expectation Maximization with Hidden Markov Models to Detect Functional Networks in Resting-State fMRI","4772820":"Modelling longitudinal semicontinuous emesis volume data with serial correlation in an acupuncture clinical trial","4914135":"Maximizing generalized linear mixed models with an automated Monte Carlo EM algorithm","38088154":"Markov and Semi-Markov Switching Linear Mixed Models Used to Identify Forest Tree Growth Components","261636152":"Heritability estimation in high dimensional linear mixed models","229786131":"Editorial: Model selection and efficiency—is ‘Which model …?’ the right question?","229553679":"Adverse Subpopulation Regression for Multivariate Outcomes with High-Dimensional Predictors","3080077":"Simulated annealing for maximum A Posteriori parameter estimation of Hidden Markov models","49517914":"Nonparametric Bayes Models for High-Dimensional and Sparse Data","267987027":"Shared Components Topic Models with Application to Selectional Preference","227870270":"Analysis strategies for serial multivariate ultrasonographic data that are incomplete","6729677":"Generalized linear models with ordinally-observed covariates","30518909":"Études de Modèles Variationnels et Apprentissage de Dictionnaires","243682602":"A gradient algorithm locally equivalent to the EM algo-rithm","267870299":"Estimation of affine term structure models with spanned or unspanned stochastic volatility","224561871":"A Monte-Carlo Implementation of the SAGE Algorithm for Joint Soft Multiuser and Channel Parameter Estimation","5178338":"How Frequently Does the Stock Price Jump? – An Analysis of High-Frequency Data with Microstructure Noises","23691974":"A Monte Carlo EM Algorithm for the Estimation of a Logistic Auto-Logistic Model with Missing Data","46479732":"Simulating copula-based distributions and estimating tail probabilities by means of Adaptive Importance Sampling","2721690":"MCMC Specificities of Latent Variable Models","3297153":"Nested Monte Carlo EM algorithm for switching state-space models","254061713":"Joint Parameter Estimation and Base-Calling for Pyrosequencing Systems","279264029":"A statistical modeling framework for analyzing tree-indexed data","276236239":"Maximum-likelihood estimation and influence analysis in multivariate skew-normal reproductive dispersion mixed models for longitudinal data","228707864":"Improved Estimation of Normalizing Constants From Markov Chain Monte Carlo Output","227417652":"Adaptive Importance Sampling for simulating copula-based distributions","224394980":"Underdetermined Blind Source Separation Based on Subspace Representation","228717082":"Learning Bayesian Networks From Incomplete Data Using EM And Multiple Imputation","254113950":"Covariate Measurement Error Adjustment for Multilevel Models With Application to Educational Data","10796825":"A unifying framework for partial volume segmentation of brain MR images","236081618":"A crossed random effects modeling approach for estimating diagnostic accuracy from ordinal ratings without a gold standard","243044799":"Pragmatic Analysis of Longitudinal Data on Disease Activity in Systemic Lupus Erythematosus","231175681":"The Issue-Adjusted Ideal Point Model","227581527":"Inference on finite population categorical response: Nonparametric regression-based predictive approach","263087207":"Revisiting Random Utility Models","268054576":"MAXIMUM LIKELIHOOD ESTIMATION OF MEASUREMENT ERROR MODELS BASED ON THE MONTE CARLO EM ALGORITHM","228359762":"Likelihood-based inference with nonignorable missing responses and covariates in models for discrete longitudinal data","259570870":"Enhanced QTL linkage analysis with DNA pooling by means of Monte Carlo EM","5262209":"Non-linear structural equation models with correlated continuous and discrete data","262008904":"A sum characterization of hidden regular variation with likelihood inference via expectation-maximization","3303396":"Using the EM Algorithm to Train Neural Networks: Misconceptions and a New Algorithm for Multiclass Classification","273827716":"Measurement and verification of building systems under uncertain data: A Gaussian process modeling approach","6152074":"Simultaneous Inference for Semiparametric Nonlinear Mixed‐Effects Models with Covariate Measurement Errors and Missing Responses","221286120":"EM-based Channel Estimation in OFDM Systems with Phase Noise","4741009":"Ascent EM for fast and global solutions to finite mixtures: An application to curve-clustering of online auctions","5875584":"SEM of another flavour: Two new applications of supplemented EM algorithm","2262008":"The Stochastic EM Algorithm: Estimation and Asymptotic Results","5568393":"A new algorithm for haplotype-based association analysis: The Stochastic-EM algorithm","275047353":"A mixture hierarchical model for response times and response accuracy","225248910":"Maximum Likelihood from Spatial Random Effects Models via the Stochastic Approximation Expectation Maximization Algorithm","227598964":"Missing data methods in longitudinal studies: A review","10567492":"Bayesian Analysis of Structural Equation Models with Dichotomous Variables","221259478":"Discovery of Activity Structures using the Hierarchical Hidden Markov Model.","220286662":"Robust mixture modeling using multivariate skew","233455106":"A Maximum Likelihood Approach for Multisample Nonlinear Structural Equation Models With Missing Continuous and Dichotomous Data","259337373":"Employing a Monte Carlo Algorithm in Newton-Type Methods for Restricted Maximum Likelihood Estimation of Genetic Parameters","24063622":"Bayesian Analysis of Nonlinear Structural Equation Models with Nonignorable Missing Data","2599885":"Marginal Map Estimation Using Markov Chain Monte Carlo","7030656":"An integrated-likelihood method for estimating genetic differentiation between populations","240925111":"MCMC Methods to Estimate Bayesian Parametric Models","8387475":"Tohka J, Zijdenbos A, Evans A. Fast and robust parameter estimation for statistical partial volume models in brain MRI. Neuroimage 23: 84-97","44797254":"Statistical Analyses of Next Generation Sequence Data: A Partial Overview","271548379":"Expectation maximization in random projected spaces to find motifs in genomic sequences","46247223":"Comparison of Fully Bayesian and Empirical Bayes approaches for joint Bayesian model selection and estimation of sinusoids via reversible jump MCMC","225387161":"Inference in mixed proportional hazard models with K random effects","8928127":"Mixture model for inferring susceptibility to mastitis in dairy cattle: A procedure for likelihood-based inference","220286678":"Automatic choice of driving values in Monte Carlo likelihood approximation via posterior simulations","278807399":"Variable Clustering in High Dimensional Probit Regression Models.","226389634":"The EM Algorithm, Its Randomized Implementation and Global Optimization: Some Challenges and Opportunities for Operations Research","290477740":"A new algorithm for estimating the parameters of the spatial generalized linear mixed models"},"index":146}