{"abs":"In this paper, we consider a default strategy for fully Bayesian model determination for GLMMs. We address the two key issues of default prior specification and computation. In particular, we extend a concept of unit information to the priors for the parameters of a GLMM. We rely on a combination of MCMC and Laplace approximations to compute approximations to the posterior model probabilities and then further approximate these posterior model probabilities using bridge sampling. We apply our strategy to two examples.","title":"Default Bayesian model determination methods for generalised linear mixed models","id":220055942,"url":"https://www.researchgate.net/publication/220055942_Default_Bayesian_model_determination_methods_for_generalised_linear_mixed_models","names":["Antony M Overstall","Jonathan J. Forster","Computational Statistics \u0026 Data Analysis"],"references":{"23528551":"Prior Distributions for Variance Parameters in Hierarchical Models","265423254":"Approximate Inference In Generalized Linear Mixed Models","254287149":"Generalized Linear Models With Random Effects; A Gibbs Sampling Approach","45852797":"Bayesian Model Comparison and Model Averaging for Small-Area Estimation","254287396":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","228346000":"Feature-Inclusion Stochastic Search for Gaussian Graphical Models","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","264957253":"Bayes Factors and Choice Criteria for Linear Models","5142874":"R2winbugs: a package for running WinBUGS from R","264960925":"Aspects of Multivariate Statistical Theory","229503540":"Objective priors for hypothesis testing in one‐way random effects models","243764509":"Marginal likelihood from the Gibbs output. J Am Stat Assoc","2492669":"Bayesian measures of model complexity and fit. J R Stat Soc Ser B Stat Methodol","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","247003431":"On Deriving the Inverse of a Sum of Matrices","243685542":"Kendall\u0027\u0027s Advanced Theory of Statistics","2603844":"A Prior for the Variance in Hierarchical Models","227635702":"Conservative prior distributions for variance parameters in hierarchical models","235961592":"Generalised Linear Model","223190053":"R: A Language AND Environment for Statistical Computing, Version 2.15","245507080":"Aspects of multivariate statistical theory","243767404":"The Schwarz Criterion and Related Methods for Normal Linear Models","244958005":"A Likelihood-Based Method for Analysing Longitudinal Binary Responses","13766718":"Multilevel Modelling of Geographically Aggregated Health Data: A Case Study on Malignant Melanoma Mortality and UV Exposure in the European Community: A Multi-level Modelling Approach","228675534":"An Empirical Comparison of Methods for Computing Bayes Factors in Generalized Linear Mixed Models","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","257940719":"Monte Carlo Methods in Bayesian Statistics","224910614":"Adaptive Rejection Metropolis Sampling Within Gibbs Sampling","243775157":"Simulating Ratios of Normalizing Constants via a Simple Identity: A Theoretical Exploration","254212821":"A default conjugate prior for variance components in generalized linear mixed models (Comment on Article by Browne and Draper)","222525109":"Prior elicitation for model selection an estimation in generalized linear mixed models","247373577":"Reference Bayesian Methods for Generalized Linear Mixed Models","6869087":"Bayesian Covariance Selection in Generalized Linear Mixed Models","226367232":"WinBUGS—A Bayesian Modelling Framework: Concepts, Structure, and Extensibility"},"citedIn":{"262932397":"A default Bayesian hypothesis test for mediation","225100712":"Reversible jump methods for generalised linear models and generalised linear mixed models","258057586":"Evaluation of Overall Treatment Effect in MMRM","230732835":"A Stochastic Variational Framework for Fitting and Diagnosing Generalized Linear Mixed Models","271670469":"Objective Bayesian Model Selection in Generalized Additive Models With Penalized Splines","220056549":"Editorial: Special issue on variable selection and robust procedures","267507386":"An Introduction to Bayesian Hypothesis Testing for Management Research","259737063":"Adaptive change-point mixed models applied to data on outpatient tetracycline use in Europe","45933889":"Hyper-g Priors for Generalized Linear Models","224973111":"Variational Inference for Generalized Linear Mixed Models Using Partially Noncentered Parametrizations","259119102":"Prior adjusted default Bayes factors for testing (in)equality constrained hypotheses"},"index":147}