{"abs":"Political science researchers typically conduct an idiosyn- cratic search of possible model configurations and then present a single specification to readers. This approach systematically understates the uncertainty of our results, generates fragile model specifications, and leads to the estimation of bloated models with too many control vari- ables. Bayesian model averaging (BMA) offers a sys- tematic method for analyzing specification uncertainty and checking the robustness of one\u0027s results to alterna- tive model specifications, but it has not come into wide usage within the discipline. In this paper, we introduce important recent developments in BMA and show how they enable a different approach to using the technique in applied social science research. We illustrate the method- ology by reanalyzing data from three recent studies us- ing BMA software we have modified to respect statisti- cal conventions within political science.","title":"Bayesian Model Averaging: Theoretical Developments and Practical Applications","id":252772601,"url":"https://www.researchgate.net/publication/252772601_Bayesian_Model_Averaging_Theoretical_Developments_and_Practical_Applications","names":["Jacob Montgomery","Brendan Nyhan","Political Analysis"],"references":{"228362270":"Understanding interaction models: Improving empirical analyses","228388638":"Let\u0027s Put Garbage-Can Regressions and Garbage-Can Probits Where They Belong","245129753":"A Unified Theory of Voting: Directional and Proximity Spatial Models","254287396":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","228999862":"The Phantom Menace: Omitted Variable Bias in Econometric Research","2326192":"Testing Nonnested Models of International Relations: Reevaluating Realism","250257913":"Did Illegal Overseas Absentee Ballots Decide the 2000 U.S. Presidential Election?","228652982":"Spike and slab prior distributions for simultaneous Bayesian hypothesis testing, model selection, and prediction, of nonlinear outcomes","241218807":"Do Statistical Reporting Standards Affect What Is Published? Publication Bias in Two Leading Political Science Journals","231791432":"Out of Step, Out of Offce: Electoral Accountability and House Members’ Voting","284415721":"BMA: An R package for Bayesian Model Averaging","249693823":"A Critique of the Bayesian Information Criterion for Model Selection","247609564":"Specification Uncertainty and Model Averaging","31237059":"“Matching as Nonparametric Preprocessing to Reduce Model Dependence in Parametric Causal Inference.”","247640674":"State House Democracy: Public Opinion and Public Policy in the American States","5149935":"Ethnic and Cultural Identity by Country","230631070":"Model averaging","231946359":"Filling in the Blanks: A New Method for Estimating Campaign Effects","230631067":"[Bayesian Model Averaging: A Tutorial]: Comment","231781751":"The Politics of Growth in the Industrial Democracies, 1974–1980: Leftist Strength or North Sea Oil","44256138":"The Dangers of Extreme Counterfactuals","31373938":"Calibration and Empirical Bayes Variable Selection","238729994":"FLOATING VOTERS IN U.S. PRESIDENTIAL ELECTIONS, 1948-2000","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","231743841":"The Politics of Growth: Strategic Interaction and Economic Performance in the Advanced Industrial Democracies, 1974–1980","238652808":"Bayesian Model Selection in Social Research","3027229":"A New Look At The Statistical Model Identification","2612499":"Bayesian Model Averaging for Linear Regression Models","2284821":"Avoiding Model Selection in Bayesian Social Research","254331807":"Regression by Leaps and Bounds","2834579":"Ethnicity, Insurgency, And Civil War","239377277":"AIC and BIC: Comparisons of Assumptions and Performance","256476403":"Bayesian Model Selection in Social Research (with Discussion)","2462744":"Too many Variables? A Comment on Bartels\u0027 Model-Averaging Proposal","8018879":"Bayesian Model Averaging: Development of an Improved Multi-Class, Gene Selection and Classification Tool for Microarray Data","229708918":"Model Uncertainty","4733336":"Hypothesis Testing and Muliplicative Interaction Terms","231890434":"Presidential Vote Models: A Recount","279695482":"Specification uncertainty and model averaging","240180738":"Political Leadership and Representation in West European Democracies: A Test of Three Models of Voting","255578592":"The Use of Bayesian Model Averaging to Better Represent Uncertainty in Ecological Models","227715151":"Representation in Congressional Campaigns: Evidence for Discounting/Directional Voting in U.S. Senate Elections","239061088":"A Political-Economic History of Roll-Call Voting","38326824":"Bayesian Model Averaging: A Tutorial","249802375":"The Insignificance of Null Hypothesis Significance Testing","51087342":"Regression Modeling Strategies","238178775":"American Federalism: A View From the States","239029977":"On assessing Prior Distributions and Bayesian Regression Analysis with g-Prior Distributions","222551850":"Measuring the Health Effects of Air Pollution: To What Extent Can We Really Say that People Are Dying from Bad Air?","231862079":"Some Tests of Significance, Treated by the Theory of Probability","2334801":"BayesianModi Averaging: A Tutorial","231829412":"Was the 2000 Presidential Election Predictable?","5139641":"Model Uncertainty in Cross-Country Growth Regressions","246854094":"Modeling Party Strategies and Policy Representation In MultiParty Elections: Why Are Strategies So Extreme?","4742579":"Bayesian Model Averaging With Applications to Benchmark Dose Estimation for Arsenic in Drinking Water","4743606":"Clyde MA„ Berger JO: Mixtures of g priors for Bayesian variable selection","225106197":"Posterior Odds Ratios for Selected Regression Hypotheses"},"citedIn":{"281024321":"The Two-Way Street of Acculturation, Discrimination, and Latino Immigration Restrictionism","281552975":"Comparison of subset selection methods in linear regression in the context of health-related quality of life and substance abuse in Russia","263858930":"The Politics of Capital Flight in the Global Economic Crisis","228237907":"Seven Deadly Sins of Contemporary Quantitative Political Analysis","277253645":"Under-performing, over-performing, or just performing? The limitations of fundamentals-based presidential election forecasting","260031345":"Die Bedeutung der Itemauswahl und der Modellwahl für die längsschnittliche Erfassung von Kompetenzen","271383330":"Lobbying and the collective action problem: Comparative evidence from enterprise surveys","258125869":"One Vote Out of Step? The Effects of Salient Roll Call Votes in the 2010 Election","223993353":"Mechanisms-based classifications of musculoskeletal pain: Part 3 of 3: Symptoms and signs of nociceptive pain in patients with low back (+/- leg) pain","272555310":"Not by the Sword Alone: Soft Power, Mass Media, and the Production of State Sovereignty","223340957":"Laccase production by Pleurotusostreatus 1804: Optimization of submerged culture conditions by Taguchi DOE methodology","271642980":"This Could Be the Start of Something Big: Linking Early Managerial Choices with Subsequent Organizational Performance","51990284":"Combinatorial Modelling and Learning with Prediction Markets","222820433":"Calibration and Uncertainty Analysis of the SWAT Model Using Genetic Algorithms and Bayesian Model Averaging","272244652":"From Cell Phones to Conflict? Reflections on the Emerging ICT-Political Conflict Research Agenda","224846129":"Mechanisms-based classifications of musculoskeletal pain: Part 1 of 3: Symptoms and signs of central sensitisation in patients with low back (+/- leg) pain","237049657":"Ensemble Predictions of the 2012 US Presidential Election","37675556":"Communicative Structure and the Emergence of Armed Conflict","282418895":"The Effect of the Religious Environment on Teenage Birth Rates in the United States","256019038":"Forecasting Onsets of Mass Killing","249612285":"A Consensus Model for Seasonal Hurricane Prediction","282807044":"Increasing the Credibility of Political Science Research: A Proposal for Journal Reforms","228751165":"Improving Predictions Using Ensemble Bayesian Model Averaging","48375618":"The determinants of macroeconomic volatility: A Bayesian model averaging approach","272754080":"Calibrating ensemble forecasting models with sparse data in the social sciences","233421643":"Birds are also sensitive to landscape composition and configuration within the city centre","228448121":"Dissent voting behavior of central bankers: what do we really know?","221965982":"A Multi-objective Exploratory Procedure for Regression Model Selection","283558145":"Trading Hard Hats for Combat Helmets: The Economics of Rebellion in Eastern Ukraine","228768842":"Social Science Methodology: Tasks, Strategies, and Criteria","251543383":"Research \u0026 development and growth: A Bayesian model averaging analysis","260178347":"Immigration Opposition Among U.S. Whites: General Ethnocentrism or Media Priming of Attitudes About Latinos?","246803103":"P.106 The cytokines status of blood and wound of patients with osteoflegmons","261200571":"Neural network ensemble: Evaluation of aggregation algorithms in electricity demand forecasting","276834285":"International Reserves Before and After the Global Crisis: Is There no End to Hoarding?","261603000":"Weighted-Average Least Squares Applied to Spatial Econometric Models: A Monte Carlo Investigation","277650723":"Examining performance of aggregation algorithms for neural network-based electricity demand forecasting","276892146":"Determinants of Appropriation Strategies: A Three Step Guide to Bayesian Model Averaging","236591456":"Application of Model Averaging Techniques to Spatial Hedonic Land Price Models","237198431":"Model Uncertainty and Bayesian Model Averaged Benchmark Dose Estimation for Continuous Data","254440086":"Does Trust Promote Growth?","260283774":"Meta-analysis and aggregation of multiple published prediction models","264563001":"The Application of Bayesian Model Averaging in Compatibility of Stand Basal Area for Even-Aged Plantations in Southern China","270785629":"A Case for Registering Studies of Political Outcomes: An Application in the 2010 House Elections"},"index":149}