{"abs":"Climate change will affect the insurance industry. We develop a Bayesian hierarchical statistical approach to explain and predict insurance losses due to weather events at a local geographic scale. The number of weather-related insurance claims is modelled by combining generalized linear models with spatially smoothed variable selection. Using Gibbs sampling and reversible jump Markov chain Monte Carlo methods, this model is fitted on daily weather and insurance data from each of the 319 municipalities which constitute southern and central Norway for the period 1997-2006. Precise out-of-sample predictions validate the model. Our results show interesting regional patterns in the effect of different weather covariates. In addition to being useful for insurance pricing, our model can be used for short-term predictions based on weather forecasts and for long-term predictions based on downscaled climate models.","title":"A Bayesian Hierarchical Model With Spatial Variable Selection: The Effect of Weather on Insurance Claims","id":235442310,"url":"https://www.researchgate.net/publication/235442310_A_Bayesian_Hierarchical_Model_With_Spatial_Variable_Selection_The_Effect_of_Weather_on_Insurance_Claims","names":["Ida Scheel","Egil Ferkingstad","Arnoldo Frigessi","Ola Haug","Mikkel Hinnerichsen","Elisabeth Meze-Hausken","Applied Statistics"],"references":{"227369101":"Hierarchical Insurance Claims Modeling","228497119":"Climate change and its impact on building water damage","243103227":"Sampling Schemes for Bayesian Variable Selection in Generalized Linear Models","228881891":"Actuarial Applications of a Hierarchical Insurance Claims Model","247518152":"Bayesian Premium Rating with Latent Structure","245309974":"Residential building damage and natural perils: Australian examples and issues","241153174":"Insurance and other financial services","233671585":"Premium Rating by Geographic Area Using Spatial Models","267938868":"The search for trends in a global catalogue of normalised weather-related catastrophe losses","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","229099827":"General Methods for Monitoring Convergence of Iterative Simulations","250133053":"Use of Spline Functions for Premium Rating by Geographic Area","243081761":"A Comment on D. V. Lindley\u0027s Statistical Paradox","239384155":"General Methods for Monitoring Convergence of Iterative Simulations","222617638":"On modeling claim frequency data in general insurance with extra zeros. Insur Math Econ","229707154":"Zero‐Altered and other Regression Models for Count Data with Added Zeros","222859692":"Specification of Some Modified Count Data Models","239029977":"On assessing Prior Distributions and Bayesian Regression Analysis with g-Prior Distributions","254333007":"Zero-Inflated Poisson Regression, With An Application to Defects in Manufacturing","7660508":"Insurance in a Climate of Change","229922013":"Evaluation of a dynamic downscaling of precipitation over the Norwegian mainland","228789130":"Examples of adaptive MCMC","251813928":"Fixed Versus Random Effects in Poisson Regression Models for Claim Counts: Case Study With Motor Insurance","222708653":"Benchmark priors for Bayesian Model Averaging. J Econom 100: 381-427","31373938":"Calibration and Empirical Bayes Variable Selection","245309875":"UK adaptation strategy and technical measures: The impacts of climate change on buildings","4742695":"Spatial Bayesian Variable Selection With Application to Functional Magnetic Resonance Imaging","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","255664655":"Availability and Affordability of Insurance Under Climate Change. A Growing Challenge for the U.S","5432353":"Insurance Against Climate Change and Flooding in the Netherlands: Present, Future, and Comparison with Other Countries","28318916":"A survey on models for panel count data with applications to insurance","224881809":"Approaches for Bayesian Variable Selection","223552363":"Relationship between radar-derived hail kinetic energy and damage to insured buildings for severe hailstorms in Eastern Australia","222306169":"Nonparametric Regression using Bayesian Variable Selection","44064026":"A Moisture index approach to characterizing climates for moisture management of building envelopes","225241873":"Kohn R, Smith M, Chan D. Nonparametric regression using linear combinations of basis functions. Stat Comput 11: 313-322","232881246":"Future building water loss projections posed by climate change"},"citedIn":{"260531541":"Use of a tree-structured hierarchical model for estimation of location and uncertainty in multivariate spatial data","278828985":"Construction of an Index that links Wind Speeds and Strong Claim Rate of Insurers after a Storm in France","277012453":"Index for Predicting Insurance Claims from Wind Storms with an Application in France","287209638":"Recent Research Developments Affecting Nonlife Insurance: The CAS Risk Premium Project 2013 Update","266679341":"Spatial variable selection methods for investigating acute health effects of fine particulate matter components: Spatial Variable Selection for Effects of PM Components","259214090":"Recent Research Developments Affecting Non-Life Insurance—The CAS Risk Premium Project 2012 Update","230794925":"Bayesian variable selection for spatially dependent generalized linear\nmodels","272890655":"Rejoinder to ‘(sfi)2 Statistics for Innovation – The experience of the Oslo centre in industrial statistics’","263534504":"Symbiotic linkage of sustainability, development and differentiation"},"index":150}