{"abs":"The authors consider estimability and interpretation of vaccine efficacy based on time to event data, allowing that some of the population might have a very low probability of acquiring disease, and the rest have partial, possibly continuously distributed, susceptibility. The efficacy parameters of interest in the frailty mixing model include the fraction highly unlikely to acquire the infection or disease due to the vaccine, the degree of partial protection in those still susceptible, and the average protection or summary measure of efficacy under heterogeneity. The efficacy estimates can still be usefully interpreted when the heterogeneity results from heterogeneity in contact patterns, contact rates, or infectiousness of the contacts, as long as these are equal in the vaccinated and unvaccinated groups. A likelihood-based method allows estimation of the efficacy parameters of interest from grouped time to event data. Simulated vaccine studies assuming different levels and distributions of efficacy demonstrate that ignoring heterogeneity in susceptibility or exposure to infection generally results in underestimation of vaccine efficacy as well as incorrect interpretation of the estimates. The approach is also applicable to other covariates affecting susceptibility or exposure to infection in infectious diseases. Exploitation of the dependent happening structure of infectious diseases to obtain a shape for the baseline hazard may help identifiability. The authors recommend fitting several models to time to event data in vaccine studies.","title":"Estimability and Interpretation of Vaccine Efficacy Using Frailty Mixing Models","id":14540063,"url":"https://www.researchgate.net/publication/14540063_Estimability_and_Interpretation_of_Vaccine_Efficacy_Using_Frailty_Mixing_Models","names":["M.E. Halloran","I.M. Longini","Claudio Struchiner","American Journal of Epidemiology"],"references":{"21350087":"Analyzing effects of vaccines","265460881":"Counting Processes \u0026 Survival Analysis","16029872":"The Use of Mixture Models for the Analysis of Survival Data with Long-Term Survivors","13845143":"Frailty Models for Survival Data","21740867":"Interpretion and estimation of vaccine efficacy under heterogeneity","38362949":"Modelling Heterogeneity in Survival Analysis by the Compound Poisson Distribution,” Annals of Applied Probability, 2, 951-972","15412198":"Heterogeneity Models of Disease Susceptibility, with Application to Diabetic Nephropathy","20254522":"Trial of high-dose Edmonston-Zagreb measles vaccine in Guinea-Bissau: protective efficacy.","21091857":"Assessing risk factors for transmission of infection","26358659":"Malaria vaccines: Lessons learnt from field trials","16387752":"The prevention of hepatitis B with vaccine: Report of the Centers of Disease Control multi-center efficacy trial among homosexual men","21255767":"Direct and Indirect Effects in Vaccine Efficacy and Effectiveness","223022040":"Clemens, J.D. et al. Field trial of oral cholera vaccines in Bangladesh: results from three-year follow-up. Lancet 335, 270-273","21090269":"Measures of the Effects of Vaccination in a Randomly Mixing Population","15457590":"Causal Inference in Infectious Diseases","21414171":"Study Designs for Dependent Happenings","14797889":"Estimation of vaccine efficacy from epidemics of acute infectious agents under vaccine-related heterogeneity","21842412":"Modified cases of chickenpox after varicella vaccination: Correlation of protection with antibody response","14854918":"On the distribution of vaccine protection under heterogeneous response","15021248":"Exposure efficacy and change in contact rates in evaluating prophylactic HIV vaccines in the field","225709201":"‘The Impact of Heterogeneity in Individual Frailty on the Dynamics of Mortality’","31354875":"Life Table Methods for Heterogeneous Populations: Distributions Describing the Heterogeneity,” Biometrika, 71, 75-83","227726580":"Mixture Models in the Survival Analysis: Are they Worth the Risk?","16497040":"Assessment of the Protective Efficacy of Vaccines against Common Diseases Using Case-Control and Cohort Studies","19753475":"On Measures and Models for the Effectiveness of Vaccines and Vaccination Programmes","20803603":"The Behaviour of Common Measures of Association Used to Assess a Vaccination Programme under Complex Disease Transmission Patterns—A Computer Simulation Study of Malaria Vaccines","20636309":"Modeling malaria vaccines I: New uses for old ideas","265543328":"A Frailty Mixture Model for Estimating Vaccine Efficacy","15175059":"Theoretical epidemiologic and morbidity effects of routine Varicella immunization of preschool children in the United States","243082441":"A Model for a Binary Variable with Time-Censored Observations","236273376":"A Mixture Model Combining Logistic Regression with Proportional Hazards Regression","15263774":"Randomized Trial of Efficacy of Spf66 Vaccine Against Plasmodium-Falciparum Malaria in Children in Southern Tanzania","47311974":"The Statistics of Anti-typhoid and Anti-cholera Inoculations, and the Interpretation of such Statistics in general","19955335":"Heterogenity in survival analysis","247685566":"Survival Models for Heterogeneous Populations Derived from Stable Distributions,” Biometrika, 73, 387-396"},"citedIn":{"12780994":"Design and Interpretation of Vaccine Field Studies","230233912":"Protective Vaccine Efficacy when Vaccine Response is Random","12780993":"Use of the Case-Control Approach in Vaccine Evaluation: Efficacy and Adverse Effects","6514401":"Randomization and baseline transmission in vaccine field trials","13846235":"Study Designs for Evaluating Different Efficacy and Effectiveness Aspects of Vaccines","38088012":"Pathogen Dose Infectivity Curves as a Method to Analyze the Distribution of Host Susceptibility: A Quantitative Assessment of Maternal Effects after Food Stress and Pathogen Exposure","13449030":"Estimation of individual and population vaccination effectiveness from time-to-event data","5444574":"Estimation of vaccine efficacy in a repeated measures study under heterogeneity of exposure or susceptibility to infection","4745413":"Estimation of Waning Vaccine Efficacy","12159926":"Interpretability and robustness of sieve analysis models for assessing HIV strain variations in vaccine efficacy","43118720":"Simulations to Evaluate HIV Vaccine Trial Designs","12811858":"Simulation studies of phase III clinical trials to test the efficacy of a candidate HIV-1 vaccine","11994658":"Modelling survival data with a cured fraction","264794718":"Unveiling Time in Dose-Response Models to Infer Host Susceptibility to Pathogens","227731850":"Malaria vaccine trial endpoints - Bridging the gaps between trial design, public health and the next generation of vaccines","44617395":"Incorporating frailty in a multi-state model: Application to disease natural history modelling of adenoma-carcinoma in the large bowel","48191040":"Effect of preventive supplementation with zinc and other micronutrients on malaria and diarrhoeal morbidity in African children","246190220":"DISCUSSION: VACCINE EFFECT ON SUSCEPTIBILITY","8892966":"The potential epidemiological impact of a genital herpes vaccine for women","227860663":"Aspects of the Armitage-Doll Gamma frailty model for cancer incidence data","262054838":"Risk-difference curves can be used to communicate time-dependent effects of adjuvant therapies for early stage cancer","260559918":"The theoretical impact and cost-effectiveness of vaccines that protect against sexually transmitted infections and disease","6150135":"Accounting for Variability in Sample Size Estimation with Applications to Nonadherence and Estimation of Variance and Effect Size","13686651":"Estimation of Vaccine Efficacy in the Presence of Waning: Application to Cholera Vaccines","10626830":"Vaccine safety surveillance using large linked databases: Opportunities, hazards and proposed guidelines","228324917":"Estimation of summary protective efficacy using a frailty mixture model for recurrent event time data","260610598":"A Missing Dimension in Measures of Vaccination Impacts","6144104":"Attributable fractions with survival data","12019854":"Efficiency of Estimating Vaccine Efficacy for Susceptibility and Infectiousness: Randomization by Individual Versus Household","250923086":"Design questions for Streptococcus pneumoniae vaccine trials with a colonisation endpoint","13665260":"Optimal vaccine trial design when estimating vaccine efficacy for susceptibility and infectiousness from multiple populations","235727665":"Estimating Vaccine Efficacy Under the Heterogeneity of Vaccine Action in a Nonrandomly Mixing Population","23250464":"What Should Vaccine Developers Ask? Simulation of the Effectiveness of Malaria Vaccines","14276381":"Assessing the effect of HIV vaccination on infectiousness","45538544":"Spectrum Bias and Loss of Statistical Power in Discordant Couple Studies of Sexually Transmitted Infections","275668265":"Influenza vaccine efficacy trials: A simulation approach to understand failures from the past","223960977":"Estimating Individual Exposure to Malaria Using Local Prevalence of Malaria Infection in the Field","233770918":"The Role of Exposure History on HIV Acquisition: Insights from Repeated Low-dose Challenge Studies","255713908":"Synergism from combinations of infection-blocking malaria vaccines","5653658":"Ben-Ami F, Regoes RR, Ebert D. A quantitative test of the relationship between parasite dose and infection probability across different host-parasite combinations. Proc R Soc B Biol Sci 275: 853-859","243043763":"Mixture Multistate Markov Regression Model","283518006":"Vaccination Programs for Endemic Infections: Modelling Real versus Apparent Impacts of Vaccine and Infection Characteristics","5231638":"A new SEIR epidemic model with applications to the theory of eradication and control of diseases, and to the calculation of R0","42440286":"Heterogeneity in malaria exposure and vaccine reponse: implications for the interpretation of vaccine efficacy trials","258636087":"Estimating the Per-Exposure Effect of Infectious Disease Interventions","12616997":"Longini, I. M. et al. Estimation of the efficacy of live, attenuated influenza vaccine from a two-year, multi-center vaccine trial: implications for influenza epidemic control. Vaccine 18, 1902-1909","223804478":"Modelling heterogeneities in individual frailties in epidemic models","257460529":"Analysis of partial and complete protection in malaria cohort studies","13766716":"Advances in HIV/AIDS statistical methodology over the past decade","231791521":"Simulation studies of phase III clinical trials to test the efficacy of a candidate HIV-1 vaccine","6893979":"Overview of Vaccine Field Studies: Types of Effects and Designs","265543328":"A Frailty Mixture Model for Estimating Vaccine Efficacy","13222463":"Some important issues in the planning of phase III HIV vaccine efficacy trials","13859113":"Vaccine design, evaluation, and community-based use for antigenically variable infectious agents","51763055":"Apparent declining efficacy in randomized trials: Examples of the Thai RV144 HIV vaccine and South African CAPRISA 004 microbicide trials","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","13747374":"Augmented HIV vaccine trial design for estimating reduction in infectiousness and protective efficacy"},"index":151}