{"abs":"In this paper we present a novel methodology to perform Bayesian model selection in linear models with heavy-tailed distributions. The new method considers a finite mixture of distributions to model a latent variable where each component of the mixture corresponds to one possible model within the symmetrical class of normal independent distributions. Naturally, the Gaussian model is one of the possibilities. This allows a simultaneous analysis based on the posterior probability of each model. Inference is performed via Markov chain Monte Carlo - a Gibbs sampler with Metropolis-Hastings steps for a class of parameters. Simulated studies highlight the advantages of this approach compared to a segregated analysis based on arbitrary model selection criteria. Examples with real data are presented and an extension to censored linear regression is introduced and discussed.","title":"Robust Bayesian model selection for heavy-tailed linear regression using finite mixtures","id":281487394,"url":"https://www.researchgate.net/publication/281487394_Robust_Bayesian_model_selection_for_heavy-tailed_linear_regression_using_finite_mixtures","names":["Flávio B Gonçalves","Marcos Prates","Victor H. Lachos"],"references":{"260946444":"Penalising model component complexity: A principled, practical approach to constructing priors","2517927":"Efficient Algorithms for Robust Estimation in Linear Mixed-Effects Models Using the Multivariate t-Distribution","264960710":"Scale Mixtures of Normal Distributions","4895557":"The Sensitivity of an Empirical Model of Married Women\u0027s Hours of Work to Economic and Statistical Assumptions","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","257337603":"On estimation of measurement error models with replication under heavy-tailed distributions","268069600":"Objective Bayesian analysis for the Student-t regression model","243739482":"Efficient Metropolis Jumping Rules","257017359":"Simultaneous multifactor DIF analysis and detection in Item Response Theory","229557326":"Scale mixtures distributions in statistical modelling","45911836":"Asymptotic Equivalence of Bayes Cross Validation and Widely Applicable Information Criterion in Singular Learning Theory","4756330":"Multivariate student-T regression models : pitfalls and inference","243766499":"Normal/Independent Distributions and Their Applications in Robust Regression","243770786":"Robust Statistical Modeling Using the t Distribution","243768225":"A Predictive Approach to Model Selection","227413801":"Multivariate mixture modeling using skew-normal independent distributions","2706126":"Bayesian Approach For The Nonlinear Random Effects Models","222839727":"Assessment of local influence in elliptical linear models with longitudinal structure","227292386":"On estimation and local influence analysis for measurement errors models under heavy-tailed distributions","222680884":"The multivariate skew-slash distribution. J Stat Plan Inference","222138569":"Robust mixture modeling based on scale mixtures of skew-normal distributions. Comput Stat Data Anal","265681761":"Likelihood based inference for skew-normal/independent linear mixed model","242475590":"An Introduction to Regression Graphics","2622481":"Accounting for Model Uncertainty in Survival Analysis Improves Predictive Performance","251232450":"Understanding predictive information criteria for Bayesian models","279225882":"Linear censored regression models with scale mixtures of normal distributions"},"citedIn":{},"index":152}