{"abs":"The analysis of infectious disease data is usually complicated by the fact that real life epidemics are only partially observed. In particular, data concerning the process of infection are seldom available. Consequently, standard statistical techniques can become too complicated to implement effectively. In this paper Markov chain Monte Carlo methods are used to make inferences about the missing data as well as the unknown parameters of interest in a Bayesian framework. The methods are applied to real life data from disease outbreaks.","title":"Bayesian inference for partially observed stochastic epidemics","id":4771353,"url":"https://www.researchgate.net/publication/4771353_Bayesian_inference_for_partially_observed_stochastic_epidemics","names":["P. D. O\u0027Neill","G. O. Roberts"],"references":{"14797887":"Parametric inference for epidemic models"},"citedIn":{"11073832":"A tutorial introduction to Bayesian inference for stochastic epidemic models using Markov chain Monte Carlo Methods","222821827":"A novel approach to real-time risk prediction for emerging infectious diseases: A case study in Avian Influenza H5N1","221853501":"Outbreaks of H5N1 in poultry in Thailand: The relative role of poultry production types in sustaining transmission and the impact of active surveillance in control","6849006":"Robust parameter estimation techniques for stochastic within-host macroparasite models","259119094":"Simulation-based Bayesian inference for epidemic models","264247371":"Local and regional spread of chikungunya fever in the Americas","222394575":"Stochastic modelling of ecological processes using hybrid Gibbs samplers","268226546":"Bayesian Non-Parametric Inference for Infectious Disease Data","50851336":"Networks and the Epidemiology of Infectious Disease","229325115":"Model-guided fieldwork: practical guidelines for multidisciplinary research on wildlife ecological and epidemiological dynamics","268422892":"Spatial Spread of Organisms Modeling ecological and epidemiological processes","5799501":"Optimal Observation Times in Experimental Epidemic Processes","225509222":"Accounting for detection probability when estimating force-of-infection from animal encounter data","255951703":"Modelling under-reporting in epidemics","220286523":"A case study in non-centering for data augmentation: Stochastic epidemics","224847740":"Inference for Ecological Dynamical Systems: A Case Study of Two Endemic Diseases","222709467":"Super-spreaders and the rate of transmission of the SARS virus","266746489":"Improved Estimation of the Initial Number of Susceptible Individuals in the General Stochastic Epidemic Model Using Penalized Likelihood","232224584":"Estimation of outbreak severity and transmissibility: Influenza A(H1N1)pdm09 in households","6643834":"Statistical Inference in a Stochastic Epidemic SEIR Model with Control Intervention: Ebola as a Case Study","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","46393180":"Joint estimation of the basic reproduction number and generation time parameters for infectious disease outbreaks","270647102":"Bayesian History Matching of Complex Infectious Disease Models Using Emulation: A Tutorial and a Case Study on HIV in Uganda","277078940":"Using model-based proposals for fast parameter inference on discrete state space, continuous-time Markov processes","228431293":"Bayesian inference for an epidemic model with several kinds of susceptibles","226596257":"Gibson, G. J. \u0026 Renshaw, E. Likelihood estimation for stochastic compartmental models using Markov chain methods. Statistics and Computing 11, 347-358","265687538":"Bayesian inference for Markov jump processes with informative observations","2334468":"Perfect Simulation for Reed-Frost Epidemic Models","51565881":"Inference for discretely observed stochastic kinetic networks with applications to epidemic modeling","261441977":"Estimating the Basic Reproduction Number for Single-Strain Dengue Fever Epidemics.","40760386":"Additive-Multiplicative Regression Models for Spatio-Temporal Epidemics","7917514":"Bayesian model choice and infection route modelling in an outbreak of Norovirus","1762088":"A General Framework for the Parametrization of Hierarchical Models","228611732":"Statistical inference for stochastic epidemic models","51068221":"Modeling the Variations in Pediatric Respiratory Syncytial Virus Seasonal Epidemics","256057972":"On the Epidemic of Financial Crises","227335093":"Efficient likelihood-free Bayesian Computation for household epidemics","8674239":"Predicting meningococcal disease outbreaks in structured populations","50212544":"Epidemiological inference for partially observed epidemics: The example of the 2001 foot and mouth epidemic in Great Britain","272100598":"Rapid Simulation of Spatial Epidemics: A Spectral Method","32146728":"Bayesian inference for an epidemic model with several kinds of susceptibles (Mathematical Decision Making under Uncertainty)","220286563":"Estimating likelihoods for spatio-temporal models using importance sampling","262051037":"For principled model fitting in mathematical biology","23960235":"Estimation of Transmission Parameters of H5N1 Avian Influenza Virus in Chickens","6893985":"Estimating Vaccine Efficacy from Outbreak Size Household Data in the Presence of Heterogeneous Transmission Probabilities","51626970":"Inference for Nonlinear Epidemiological Models Using Genealogies and Time Series","225912637":"Estimating Temporal Transmission Parameters from Infectious Disease Household Data, with Application to Taiwan SARS Data","281686912":"Identifying the Infectious Period Distribution for Stochastic Epidemic Models Using the Posterior Predictive Check","230781581":"Within-farm transmission dynamics of foot and mouth disease as revealed by the 2001 epidemic in Great Britain","259212734":"An SIR Graph Growth Model for the Epidemics of Communicable Diseases","6284306":"Transmission Parameters of the 2001 Foot and Mouth Epidemic in Great Britain","256501255":"Modelling the spread of American foulbrood in honeybees","227689309":"Inference in disease transmission experiments by using stochastic epidemic models","7296544":"Predicting case numbers during infectious disease outbreaks when some cases are undiagnosed","46507927":"A note on maximum likelihood estimation of the initial number of susceptibles in the general stochastic epidemic model","278041536":"Making sense of the shadows: Priorities for creating a learning healthcare system based on routinely collected data","259783208":"Delayed acceptance particle MCMC for exact inference in stochastic kinetic models","261515971":"Bayesian Inference of Infectious Disease Transmission from Whole-Genome Sequence Data","220321143":"Exact Bayesian curve fitting and signal segmentation","6446652":"Bayesian inference for SEIR epidemic models with time-inhomogeneous removal rates","4726824":"A latent variable model for estimating disease transmission rate from data on household outbreaks","222574501":"On costs and decisions in population management","46529190":"Bayesian Melding Estimation of a Stochastic SEIR Model","258350085":"Complexity in Mathematical Models of Public Health Policies: A Guide for Consumers of Models","46556834":"Inference in Epidemic Models without Likelihoods","261881599":"Bayesian Analysis for Inference of an Emerging Epidemic: Citrus Canker in Urban Landscapes","269464809":"Bayesian Inference for Non Linear Stochastic SIR Epidemic Model","49799696":"Role of social networks in shaping disease transmission during a community outbreak of 2009 H1N1 pandemic influenza","46109271":"Introduction and snapshot review: Relating infectious disease transmission models to data","261445244":"Bayesian inference for an emerging arboreal epidemic in the presence of control","51410042":"An Augmented Data Method for the Analysis of Nosocomial Infection Data","227696505":"Bayesian Inference for Stochastic Epidemics in Populations with Random Social Structure","23523978":"Estimating the Basic Reproductive Number in the General Epidemic Model with an Unknown Initial Number of Susceptible Individuals","7667097":"Use of Stochastic Epidemic Modeling to Quantify Transmission Rates of Colonization With Methicillin‐Resistant Staphylococcus aureus in an Intensive Care Unit •","50903782":"Bayesian estimation for percolation models of disease spread in plant populations","228021223":"Multistate capture-recapture analysis under imperfect state observation: An application to disease models","44575321":"Spread of Q fever within dairy cattle herds: Key parameters inferred using a Bayesian approach","6789010":"Linking data to models: Data regression","280997833":"‘Super\u0027 or just ‘above average\u0027? Supershedders and the transmission of Escherichia coli O157:H7 among feedlot cattle","220286424":"Direct simulation for discrete mixture distributions","223988515":"On parameter estimation in population models III: Time-inhomogeneous processes and observation error","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods"},"index":157}