{"abs":"A powerful and flexible method for fitting dynamic models to missing and censored data is to use the Bayesian paradigm via data-augmented Markov chain Monte Carlo (DA-MCMC). This samples from the joint posterior for the parameters and missing data, but requires high memory overheads for large-scale systems. In addition, designing efficient proposal distributions for the missing data is typically challenging. Pseudo-marginal methods instead integrate across the missing data using a Monte Carlo estimate for the likelihood, generated from multiple independent simulations from the model. These techniques can avoid the high memory requirements of DA-MCMC, and under certain conditions produce the exact marginal posterior distribution for parameters. A novel method is presented for implementing importance sampling for dynamic epidemic models, by conditioning the simulations on sets of validity criteria (based on the model structure) as well as the observed data. The flexibility of these techniques is illustrated using both removal time and final size data from an outbreak of smallpox. It is shown that these approaches can circumvent the need for reversible-jump MCMC, and can allow inference in situations where DA-MCMC is impossible due to computationally infeasible likelihoods.","title":"Simulation-based Bayesian inference for epidemic models","id":259119094,"url":"https://www.researchgate.net/publication/259119094_Simulation-based_Bayesian_inference_for_epidemic_models","names":["Trevelyan J. McKinley","Joshua V Ross","Rob Deardon","Alex R. Cook","Computational Statistics \u0026 Data Analysis"],"references":{"227522317":"Particle Markov Chain Monte Carlo . . .","23995500":"Toni T, Welch D, Strelkowa N, Ipsen A, Stumpf MPApproximate Bayesian computation scheme for parameter inference and model selection in dynamical systems. J R Soc Interface 6: 187-202","200622065":"Equation of State Calculations by Fast Computing Machines","260161156":"Asymptotic Properties of Some Estimators for the Infection Rate in the General Stochastic Epidemic Model","6540772":"Sequential Monte Carlo without likelihoods. Proc Natl Acad Sci","231846236":"Microsatellite analysis of genetic diversity in fragmented South African buffalo populations","5452126":"Estimating the impact of school closure on influenza transmission from Sentinel data","10954538":"Approximate Bayesian Computation in Population Genetics","2836794":"Population Monte Carlo","10601012":"Inference for an epidemic when susceptibility varies","222683984":"Iterated importance sampling in missing data problems","257017545":"Modeling respiratory illnesses with change point: A lesson from the SARS epidemic in Hong Kong","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","245680829":"coda: Output Analysis and Diagnostics for MCMC","216635510":"Bayesian Analysis for Emerging Infectious Diseases","226596257":"Gibson, G. J. \u0026 Renshaw, E. Likelihood estimation for stochastic compartmental models using Markov chain methods. Statistics and Computing 11, 347-358","236653886":"Approximate Bayesian Computation (ABC) gives exact results under the assumption of model error","51962045":"Approximate Bayesian Computing for Spatial Extremes","29838062":"Analysis of infectious disease data","228789130":"Examples of adaptive MCMC","216637122":"Inference for individual-level models of infectious diseases in large populations","10670607":"Transmission Potential of Smallpox: Estimates Based on Detailed Data from an Outbreak","7155394":"Using Approximate Bayesian Computation to Estimate Tuberculosis Transmission Parameters From Genotype Data","46511338":"Adaptive approximate Bayesian computation","6676042":"Inference for nonlinear dynamical systems","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","200744518":"Sequential Monte-Carlo Methods in Practice","222412917":"Modeling computer virus prevalence with a susceptible-infected-susceptible model with reintroduction","13087601":"The core content of the undergraduate curriculum in Manchester","227335093":"Efficient likelihood-free Bayesian Computation for household epidemics","4789107":"Bayesian inference for epidemics with two levels of mixing","230143245":"Analysis of data from a single epidemic","243774781":"Monte Carlo methods of inference for implicit statistical models","38322292":"An Adaptive Metropolis Algorithm","50212544":"Epidemiological inference for partially observed epidemics: The example of the 2001 foot and mouth epidemic in Great Britain","23171806":"A Data-Augmentation Method for Infectious Disease Incidence Data from Close Contact Groups","271076887":"Markov Chain Monte Carlo In Practice","11499631":"Likelihood-Based Estimation of the Effective Population Size Using Temporal Changes in Allele Frequencies: A Genealogical Approach","228605538":"Non-Centered Parameterisations for Hierarchical Models and Data Augmentation","200105001":"Equation of State by Fast Computing Machines","44587630":"HIV with contact-tracing: a case study in Approximate Bayesian Computation","23180326":"Modeling Infectious Diseases in Humans and Animals","224043664":"Exact Stochastic Simulation Of Coupled Chemical-Reactions","221669734":"Equations of State Calculations by Fast Computing Machines","4771353":"Bayesian inference for partially observed stochastic epidemics","267837092":"Efficient Bayesian Inference for Partially Observed Stochastic Epidemics and A New Class of Semi−Parametric Time Series Models","45910632":"Constructing Summary Statistics for Approximate Bayesian Computation:\nSemi-automatic ABC","226362923":"Computation of final outcome probabilities for the generalised stochastic epidemic","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","2599409":"Analyses of Infectious Disease Data from Household Outbreaks by Markov Chain Monte Carlo Methods","246868205":"Monte Carlo sampling using Markov chains and their applications","4993303":"Exact filtering for partially observed continuous time models","6446652":"Bayesian inference for SEIR epidemic models with time-inhomogeneous removal rates","223011988":"RLadyBug—An R package for stochastic epidemic models","6199230":"On methods for studying stochastic disease dynamics","46556834":"Inference in Epidemic Models without Likelihoods","4993322":"Bayesian inference for stochastic multitype epidemics in structured populations via random graphs","31313973":"Estimating parameters in stochastic compartmental models using Markov Chain methods","14140218":"Inferring Coalescence Times From DNA Sequence Data","264959527":"A Unified Approach to the Distribution of Total Size and Total Area under the Trajectory of Infectives in Epidemic Models","241736327":"Markov Chain Monte Carlo in Practice","216632222":"The Mathematical Theory of Infectious Disease","5771951":"Estimation of multiple transmission rates for epidemics in heterogeneous populations","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","8970227":"Markov Chain Monte Carlo without likelihoods","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","6809241":"On parameter estimation in population models"},"citedIn":{"274094454":"Stability of Noisy Metropolis-Hastings","289489073":"Parameterizing Spatial Models of Infectious Disease Transmission that Incorporate Infection Time Uncertainty Using Sampling-Based Likelihood Approximations","264624305":"Efficient MCMC for temporal epidemics via parameter reduction","280538160":"Coherent Frameworks for Statistical Inference serving Integrating Decision Support Systems","266679343":"Model choice problems using approximate Bayesian computation with applications to pathogen transmission data sets: ABC Model Choice Problems with Pathogen Transmission Data","282839953":"Lessons from Ebola: Improving infectious disease surveillance to inform outbreak management","264562265":"Forward Simulation Markov Chain Monte Carlo with Applications to Stochastic Epidemic Models: Forward simulation MCMC","270647102":"Bayesian History Matching of Complex Infectious Disease Models Using Emulation: A Tutorial and a Case Study on HIV in Uganda"},"index":159}