{"abs":"The past decades have seen enormous improvements in computational inference based on statistical models, with continual enhancement in a wide range of computational tools, in competition. In Bayesian inference, first and foremost, MCMC techniques continue to evolve, moving from random walk proposals to Langevin drift, to Hamiltonian Monte Carlo, and so on, with both theoretical and algorithmic inputs opening wider access to practitioners. However, this impressive evolution in capacity is confronted by an even steeper increase in the complexity of the models and datasets to be addressed. The difficulties of modelling and then handling ever more complex datasets most likely call for a new type of tool for computational inference that dramatically reduce the dimension and size of the raw data while capturing its essential aspects. Approximate models and algorithms may thus be at the core of the next computational revolution.","title":"Bayesian computation: a perspective on the current state, and sampling backwards and forwards","id":271855369,"url":"https://www.researchgate.net/publication/271855369_Bayesian_computation_a_perspective_on_the_current_state_and_sampling_backwards_and_forwards","names":["Peter J. Green","Krzysztof Latuszynski","Marcelo Pereyra","Christian P. Robert"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","225519985":"Non-linear regression models for Approximate Bayesian Computation. Statistics and Computing, 20: 63-73","26716822":"Guillemaud T, Beaumont MA, Ciosi M, Cornuet JM, Estoup A. Inferring introduction routes of invasive species using Approximate Bayesian Computation on microsatellite data. Heredity 104: 88-99","221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","23995500":"Toni T, Welch D, Strelkowa N, Ipsen A, Stumpf MPApproximate Bayesian computation scheme for parameter inference and model selection in dynamical systems. J R Soc Interface 6: 187-202","224983659":"On the stability of some controlled Markov chains and its applications\nto stochastic approximation with Markovian dynamic","200622065":"Equation of State Calculations by Fast Computing Machines","239524417":"Playing Russian Roulette with Intractable Likelihoods","228095632":"Variational Bayesian Inference with Stochastic Search","38348355":"Antithetic coupling of two Gibbs sampler chains","227704985":"Simulating Events of Unknown Probabilities via Reverse Time Martingales","2675235":"Bayesian Analysis of Mixture Models With an Unknown Number of Components – An Alternative to Reversible Jump Methods","49458431":"A tutorial on adaptive MCMC","228337292":"Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","260716186":"Robust and scalable Bayes via a median of subset posterior measures","263048124":"Convex Analysis and Monotone Operator Theory in Hilbert Space","227197084":"Langevin-Type Models II: Self-Targeting Candidates for MCMC Algorithms*","4772191":"Bayesian Inference for Non-Gaussian Ornstein-Uhlenbeck Stochastic Volatility Processes","276259680":"Cuts in Bayesian graphical models","1737229":"On the Ergodicity of the Adaptive Metropolis Algorithm on Unbounded Domains","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","2743607":"Emprical Likelihood","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","232276216":"Optimal scaling of random walk Metropolis algorithms with discontinuous\ntarget densities","265347313":"Nearest-neighbour Systems and the Auto-Logistic Model for Binary Data","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","241612615":"Brownian dynamics as smart Monte Carlo simulation","236653886":"Approximate Bayesian Computation (ABC) gives exact results under the assumption of model error","259334992":"Parallel MCMC via Weierstrass Sampler","263679121":"Expectation Propagation for Likelihood-Free Inference","243767457":"On inference for non-linear diffusion models using the Hastings-Metropolis algorithms","251572440":"Likelihood-free estimation of model evidence","228789130":"Examples of adaptive MCMC","225291078":"MCMC using Hamiltonian dynamics","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","1762088":"A General Framework for the Parametrization of Hierarchical Models","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","224907102":"Adaptive parallel tempering algorithm","41191247":"Bayesian Inference of the Demographic History of Chimpanzees","38322292":"An Adaptive Metropolis Algorithm","237000221":"Proximal Markov chain Monte Carlo algorithms","47733478":"Efficient Bayesian Inference for Switching State-Space Models using Discrete Particle Markov Chain Monte Carlo Methods","5207408":"Adaptive sampling for Bayesian variable selection","27468515":"An efficient MCMC method for distributions with intractable normalising constants","227375823":"Approximate Bayesian computation using indirect inference","229316328":"Scaling analysis of multiple-try MCMC methods","226760640":"Positive embedded integration in Bayesian analysis","261065671":"Firefly Monte Carlo: Exact MCMC with subsets of data","221618815":"Nested sampling for Potts models","228929518":"A Parallel Inertial Proximal Optimization Method","232697237":"Variance bounding and geometric ergodicity of Markov chain Monte Carlo for approximate Bayesian computation","4914183":"On–line inference for hidden Markov models","38322438":"On adaptive Markov chain Monte Carlo algorithms","234108836":"Expectation Propagation for Approximate Bayesian Inference","45866217":"Optimal scalings for local Metropolis--Hastings chains on nonproduct targets in high dimensions","221664876":"Blum MGB, Nunes MA, Prangle D, Sisson SA.. A comparative review of dimension reduction methods in approximate Bayesian computation. Stat Sci 28: 189-208","228829944":"Rejoinder to Bayesian models for sparse regression analysis of high dimensional data","242402863":"Lectures on Finite Markov chains","24196371":"Ramakrishnan U, Hadly EA.. Using phylochronology to reveal cryptic population histories: review and synthesis of 29 ancient DNA studies. Mol Ecol 18: 1310-1330","225767699":"Primal-Dual Splitting Algorithm for Solving Inclusions with Mixtures of Composite, Lipschitzian, and Parallel-Sum Type Monotone Operators","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","40442624":"Inferring Genealogical Processes from Patterns of Bronze-Age and Modern DNA Variation in Sardinia","1749366":"A Proximal Decomposition Method for Solving Convex Variational Inverse Problems.” Inverse Problems, 24:27","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","265664697":"Time-Reversible Diffusions","245743816":"Computational Methods Using a Bayesian Hierarchical Generalized Linear Model","247152854":"The Containment Condition and AdapFail algorithms","5934894":"Stochastic models for phylogenetic trees on higher-order taxa","41222656":"ABC likelihood-free methods for model choice in Gibbs random fields","226856691":"Bayesian Analysis of Outlier Problems Using the Gibbs Sampler","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","261683938":"Parallel Markov chain Monte Carlo Simulation by Pre-Fetching","246208982":"Fonctions convexes duales et points proximaux dans un espace hilbertien","244464104":"Hierarchical Bayesian Analysis of Change Point Problems","252341360":"Adaptive Markov Chain Monte Carlo: Theory and Methods","23787025":"Bayesian Computation and Model Selection in Population Genetics","49907842":"Lack of confidence in ABC model choice","220416607":"Distributed Optimization and Statistical Learning via the Alternating Direction Method of Multipliers","4993330":"Sequential Monte Carlo Samplers","256504631":"The Numerical Solution of Stochastic Differential Equations","256498632":"Langevin diffusions and the Metropolis-adjusted Langevin algorithm","227369231":"Learn From Thy Neighbor: Parallel-Chain and Regional Adaptive MCMC","268670080":"Markov chains and mixing times. With a chapter on “Coupling from the past” by James G. Propp and David B. Wilson","23306983":"Inferring population history with DIY ABC: a user-friendly approach to Approximate Bayesian","257620188":"Scaling Analysis of Delayed Rejection MCMC Methods","46494018":"Efficient parallelisation of Metropolis-Hastings algorithms using a prefetching approach","51946386":"The Wang-Landau algorithm reaches the Flat Histogram criterion in finitetime","234145912":"Beaumont MA.. Approximate Bayesian computation in evolution and ecology. Annu Rev Ecol Evol Syst 41: 379-405","4772293":"Exact and computationally efficient likelihood-based estimation for discretely observed diffusion processes","47864151":"The Convex Geometry of Linear Inverse Problems","10954538":"Approximate Bayesian Computation in Population Genetics","3322018":"Wakin, M.B.: An introduction to compressive sampling. IEEE Signal Process. Mag. 25(2), 21-30","268490386":"Applications of a Method for the Efficient Computation of Posterior Distributions”, Applied Statistics, 31, 214-225","46579536":"Understanding GPU Programming for Statistical Computation: Studies in Massively Parallel Massive Mixtures","41011943":"In defence of model-based inference in phylogeography","270363787":"Adaptive Direction Sampling","231609430":"Convergence properties of pseudo-marginal Markov chain Monte Carlo\nalgorithms","259742946":"Minimising MCMC Variance via Diffusion Limits, with an Application to Simulated Tempering by","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","268881052":"A general construction for parallelizing Metropolis-Hastings algorithms","12043820":"Efficient, Multiple-Range Random Walk Algorithm to Calculate the Density of States","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","47819641":"Robust adaptive Metropolis algorithm with coerced acceptance rate","227103273":"Effcient generation of random variates via the ratio–of–uniforms method","226046683":"Langevin-Type Models I: Diffusions with Given Stationary Distributions and their Discretizations*","42389540":"Coherent and incoherent inference in phylogeography and human evolution. Proc","236235190":"Austerity in MCMC Land: Cutting the Metropolis-Hastings Budget","243048927":"The Implementation of the Bayesian Paradigm","47373174":"Using Parallel Computation to Improve Independent Metropolis–Hastings Based Estimation","2111878":"General state space Markov chains and MCMC algorithms","221700496":"Convergence of adaptive and interacting Markov chain Monte Carlo\nalgorithms","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","263316507":"Playing with Duality: An Overview of Recent Primal-Dual Approaches for Solving Large-Scale Optimization Problems","24169179":"Approximate Bayesian Computation: A Nonparametric Perspective","23976385":"Statistical hypothesis testing intraspecific phylogeography: Nested clade phylogeography analysis vs. approximate Bayesian computation","228381228":"Markov chain Monte Carlo algorithms for the Bayesian analysis of phylogenetic trees","257665515":"An adaptive approach to Langevin MCMC","240918764":"Hadoop: The Definitive Guide","220851866":"MapReduce: Simplified Data Processing on Large Clusters","269935522":"Individual adaptation: an adaptive MCMC scheme for variable selection problems","226460107":"Langevin Diffusions and Metropolis-Hastings Algorithms","247324938":"R\u0027egularisation d\u0027\u0027in\u0027equations variationnelles par approximations successives","271760261":"Progress with Numerical and Graphical Methods for Practical Bayesian Statistics","24271562":"Inferring the Demographic History of African Farmers and Pygmy Hunter–Gatherers Using a Multilocus Resequencing Data Set","234972863":"Generalized Langevin equation approach for atom/solid–surface scattering: Numerical techniques for Gaussian generalized Langevin dynamics","23988176":"Origins and Genetic Diversity of Pygmy Hunter-Gatherers from Western Central Africa","23439578":"Comparing models on the genealogical relationships among Nanderthal, Cro-Magnoid and modern Europeans by serial coalescent simulations","38363016":"Geometric Bounds for Eigenvalues of Markov Chains","235008709":"Signal recovery from incomplete and inaccurate measurement","243765314":"Estimation of nite mixture distributions by Bayesian sampling","226435002":"An Introduction to Variational Methods for Graphical Models","23977643":"Reversible Jump MCMC Converging to Birth-and-Death MCMC and More General Continuous Time Samplers","228924013":"The Wang-Landau Algorithm for Monte Carlo computation in general state spaces","1771219":"Bédard, M.: Weak convergence of metropolis algorithms for non-i.i.d. target distributions. Ann. Appl. Probab. 17, 1222-1244","222701452":"Adaptive total variation image deblurring: a majorizationminimization approach. Signal Process. 89(9), 1683-1693","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","227661917":"Green, P.J.: On Bayesian analysis of mixtures with an unknown number of components (with discussion). J. Roy. Stat. Soc. B. 59, 731-792","2131950":"On the ergodic properties of some adaptive MCMC algorithms","12696590":"Population growth of human Y chromosomes: A study of Y chromosome microsatellites","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","46537493":"Approximate Bayesian Inference for Latent Gaussian Models by Using Integrated Nested Laplace Approximations","45910632":"Constructing Summary Statistics for Approximate Bayesian Computation:\nSemi-automatic ABC","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","220286454":"Towards optimal scaling of Metropolis-coupled Markov chain Monte Carlo","38359185":"Bayesianly Justifiable and Relevant Frequency Calculations for the Applied Statistician.” Annals of Statistics 12, 1151-1172","24269482":"A vanilla Rao--Blackwellization of Metropolis--Hastings algorithms","228636543":"On the Containment Condition for Adaptive Markov Chain Monte Carlo Algorithms","231878192":"Some Generalized Order-Disorder Transformations","269634033":"Affine Invariant Flows in the Beltrami Framework","200111118":"Markov Chains and Stochastic Stability","260406112":"A Brief Survey of Modern Optimization for Statisticians","261914747":"A Pseudo-Marginal Perspective on the ABC Algorithm","38373539":"Exponential Convergence of Langevin Distributions and Their Discrete Approximations","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","267467548":"The BUGS Book: a Practical Introduction to Bayesian Analysis","14140218":"Inferring Coalescence Times From DNA Sequence Data","274305707":"Accurate Methods for Approximate Bayesian Computation Filtering","255897012":"Computer simulation of charged particles in solution. I. Technique and equilibrium properties","220695762":"InformationTheory, Inference, and Learning Algorithms","243092619":"Monotone Operators and the Proximal Point Algorithm","247651130":"Stochastic Modelling for Systems Biology","230690364":"Efficient MCMC for Climate Model Parameter Estimation: Parallel Adaptive Chains and Early Rejection"},"citedIn":{"275363896":"Langevin and Hamiltonian based Sequential MCMC for Efficient Bayesian Filtering in High-dimensional Spaces","280329849":"Hessian corrections to the Metropolis Adjusted Langevin Algorithm"},"index":164}