{"abs":"This paper is concerned with the development of new methods for Bayesian statistical inference for structured-population stochastic epidemic models, given data in the form of a sample from a population with known structure. Specifically, the data are assumed to consist of final outcome information, so that it is known whether or not each individual in the sample ever became a clinical case during the epidemic outbreak. The objective is to make inference for the infection rate parameters in the underlying model of disease transmission. The principal challenge is that the required likelihood of the data is intractable in all but the simplest cases. Demiris and O\u0027Neill (2005b) used data augmentation methods involving a certain random graph in a Markov chain Monte Carlo setting to address this situation in the special case where the sample is the same as the entire population. Here, we take an approach relying on broadly similar principles, but for which the implementation details are markedly different. Specifically, to cover the general case of sample data, we use an alternative data augmentation scheme and employ noncentering methods. The methods are illustrated using data from an influenza outbreak.","title":"Bayesian inference for stochastic multitype epidemics in structured populations using sample data","id":26710624,"url":"https://www.researchgate.net/publication/26710624_Bayesian_inference_for_stochastic_multitype_epidemics_in_structured_populations_using_sample_data","names":["Philip D O\u0027Neill","Biostatistics"],"references":{"5676116":"Likelihood-based estimation of continuous-time epidemic models from time-series data: Application to measles transmission in London","267467410":"Stochastic Multitype Epidemics in a Community of Households: Estimation of threshold parameter R* and secure vaccination coverage","15404525":"The effect of household distribution on transmission and control of highly infectious diseases. Math Biosci","4993322":"Bayesian inference for stochastic multitype epidemics in structured populations via random graphs","228789130":"Examples of adaptive MCMC","227696504":"Estimation in multitype epidemics","4733218":"Analysis of Between-Household Heterogeneity in Disease Transmission from Data on Outbreak Sizes","16115806":"Household and Community Transmission Parameters from Final Distributions of Infections in Households","224043345":"Stochastic Epidemic Models and Their Statistical Analysis, Volume 151 of Lecture Notes in Statistics","38349829":"Stochastic multi-type SIR epidemics among a population partitioned into households","4993378":"Estimation of the basic reproduction number for infectious diseases from age-stratified serological data","8405583":"The effects of strain heterology on the epidemiology of equine influenza in a vaccinated population","227689309":"Inference in disease transmission experiments by using stochastic epidemic models","241736327":"Markov Chain Monte Carlo in Practice","19148117":"The Tecumseh study of illness XIII. Influenza infection and disease, 1076–1981","12197646":"Likely size of the French BSE epidemic","6162344":"Detecting Emerging Transmissibility of Avian Influenza Virus in Human Households","10601016":"Estimating the immunity coverage required to prevent epidemics in a community of households","21414239":"A Generalized Stochastic Model for the Analysis of Infectious Disease Final Size Data","19797303":"Models for the Statistical Analysis of Infectious Disease Data","220286523":"A case study in non-centering for data augmentation: Stochastic epidemics","4789107":"Bayesian inference for epidemics with two levels of mixing","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","38339926":"Epidemics with two levels of mixing. Ann Appl Probab"},"citedIn":{"45867418":"Statistical inference for stochastic epidemic models with three levels","252325704":"Bayesian model choice for epidemic models with two levels of mixing","229884054":"Inference for Epidemics with Three Levels of Mixing: Methodology and Application to a Measles Outbreak","46109271":"Introduction and snapshot review: Relating infectious disease transmission models to data","45185880":"Transmission of Novel Influenza A(H1N1) in Households with Post-Exposure Antiviral Prophylaxis","236666551":"Estimation of Vaccine Efficacy and Critical Vaccination Coverage in Partially Observed Outbreaks","261143358":"How big is an outbreak likely to be? Methods for epidemic final-size calculation","264624305":"Efficient MCMC for temporal epidemics via parameter reduction","269282616":"Analysis of Household Data on Influenza Epidemic with Bayesian Hierarchical Model.","255951703":"Modelling under-reporting in epidemics","256057972":"On the Epidemic of Financial Crises","227335093":"Efficient likelihood-free Bayesian Computation for household epidemics","263967943":"Computation of epidemic final size distributions"},"index":168}