{"abs":"A stochastic infectious disease model was developed by Ball (1986, Advances in Applied Probability 18, 289-310) in which the distribution of the length of the infectious period is allowed to have any distribution that can be described by its Laplace transform. We extend this model such that the infection can be transmitted within the population or from an unspecified source outside the population. Also, discrete heterogeneity in the population can be modeled to incorporate variable susceptibility, variable infectivity, and/or mixing behaviors. The model is fitted to serologic data from two influenza epidemics in Tecumseh, Michigan, using maximum likelihood estimation procedures. The estimates show a clustering pattern by age groups.","title":"A Generalized Stochastic Model for the Analysis of Infectious Disease Final Size Data","id":21414239,"url":"https://www.researchgate.net/publication/21414239_A_Generalized_Stochastic_Model_for_the_Analysis_of_Infectious_Disease_Final_Size_Data","names":["Cheryl Addy","Ira M. Longini","M. J. Haber","Biometrics"],"references":{"264960392":"Deterministic and Stochastic Epidemics with Several Kinds of Susceptibles","19216327":"Predicting the global spread of new infectious agents. Am","16118256":"Estimating household and community transmission parameters for influenza","16875654":"Statistical Procedures for Estimating the Community Probability of Illness in Family Studies: Rhinovirus and Influenza","22146203":"Estimation for an Epidemic Model","16115806":"Household and Community Transmission Parameters from Final Distributions of Infections in Households","22645618":"The Uses of Epidemic Models","10552013":"Some mathematical developments on the epidemic theory formulated by Reed and Frost","264959527":"A Unified Approach to the Distribution of Total Size and Total Area under the Trajectory of Infectives in Epidemic Models","216636999":"A Mathematical Model for Global Spread of Influenza","10552014":"An examination of the Reed-Frost theory of epidemics","19148117":"The Tecumseh study of illness XIII. Influenza infection and disease, 1076–1981","22338950":"An Influenza Simulation model for immunization studies","19735583":"Statistical inference for infectious diseases: Risk-specific household and community transmission parameters","19797303":"Models for the Statistical Analysis of Infectious Disease Data"},"citedIn":{"41666683":"Stochastic epidemic models for emerging diseases","11073832":"A tutorial introduction to Bayesian inference for stochastic epidemic models using Markov chain Monte Carlo Methods","14743521":"Measuring vaccine efficacy from epidemics of acute infectious agents","11176491":"Community interventions and the epidemic prevention potential","245495971":"A Statistical Approach to Reduce Hospital-Associated Infections","239444551":"Reply to Nishiura","259635839":"Exact Bayesian inference via data augmentation","258097898":"Early Real-Time Estimation of the Basic Reproduction Number of Emerging Infectious Diseases","225858303":"Stochastic Epidemic Modeling","8078065":"Population-wide benefits of routine vaccination of children against influenza","42372747":"Calculation of Disease Dynamics in a Population of Households","11073831":"General model for stochastic SIR epidemics with two levels of mixing","26319902":"School closure is currently the main strategy to mitigate influenza A(H1N1): a modeling study","44645308":"Household Data from the Ugandan Hepatitis E Virus Outbreak Indicate the Dominance of Community Infection","14070095":"Tests to Detect Clustering of Infected Individuals within Families","10601016":"Estimating the immunity coverage required to prevent epidemics in a community of households","233247227":"Limit theorems and tests for within family clustering in epidemic models","15081156":"Analysis of Infectious Disease Data from Partner Studies with Unknown Source of Infection","4771948":"Statistical studies of infectious disease incidence","4920047":"Exact Bayesian Inference and Model Selection for Stochastic Models of Epidemics Among a Community of Households","24358487":"Assessing Infection Control Measures for Pandemic Influenza","230127889":"A Partial Likelihood Estimator of Vaccine Efficacy","2334468":"Perfect Simulation for Reed-Frost Epidemic Models","6197494":"When individual behaviour matters: Homogeneous and network models in epidemiology. J Roy Soc Interface","7282246":"Control of transmission with two types of infection","5789042":"A likelihood-based method for real-time estimation of serial interval and reproductive number of an epidemic","227605819":"Design and evaluation of prophylactic interventions using infectious disease incidence data from close contact groups","6775498":"A Comparative Analysis of Influenza Vaccination Programs","14296052":"A statistical model of transmission of Hib bacteria in a family. Stat Med","5402237":"Preparedness for the Spread of Influenza: Prohibition of Traffic, School Closure, and Vaccination of Children in the Commuter Towns of Tokyo","237482391":"Course Syllabus BIOST/STAT 578 A Statistical Methods in Infectious Diseases Winter 2009","2633624":"The Roads Traveled: Our 50 Year Journey","227677218":"Epidemics in heterogeneous communities: Estimation of R0 and secure vaccination coverage","14113507":"A test of homogeneity versus a specified heterogeneity in an epidemic model","8398132":"Stochastic multitype epidemics in a community of households: Estimation and form of optimal vaccination schemes","237408145":"Design and Analysis of Vaccine Studies","227335093":"Efficient likelihood-free Bayesian Computation for household epidemics","4789107":"Bayesian inference for epidemics with two levels of mixing","277215673":"Early Real-time Estimation of Infectious Disease Reproduction Number","23171806":"A Data-Augmentation Method for Infectious Disease Incidence Data from Close Contact Groups","252325704":"Bayesian model choice for epidemic models with two levels of mixing","21839886":"A Discrete-Time Model for the Statistical Analysis of Infectious Disease Incidence Data","8667202":"Containing Pandemic Influenza with Antiviral Agents","237612270":"Quantitative Comparison of Influenza Vaccination Programs","38058627":"Toni T, Stumpf MPH.. Simulation-based model selection for dynamical systems in systems and population biology. Bioinformatics 26: 104-110","6893985":"Estimating Vaccine Efficacy from Outbreak Size Household Data in the Presence of Heterogeneous Transmission Probabilities","41401534":"FluTE, a Publicly Available Stochastic Influenza Epidemic Simulation Model","15649828":"A random-effects model for analysis of infectious disease final-state data.","9022403":"Estimating Vaccine Effects on Transmission of Infection from Household Outbreak Data","225912637":"Estimating Temporal Transmission Parameters from Infectious Disease Household Data, with Application to Taiwan SARS Data","264956806":"Determinants of Influenza Transmission in South East Asia: Insights from a Household Cohort Study in Vietnam","26312768":"Household Epidemics: Modelling Effects of Early Stage Vaccination","47567367":"Household epidemic models with varying infection response","235249745":"A Review of Simulation Modelling Approaches Used for the Spread of Zoonotic Influenza Viruses in Animal and Human Populations","226362923":"Computation of final outcome probabilities for the generalised stochastic epidemic","2599409":"Analyses of Infectious Disease Data from Household Outbreaks by Markov Chain Monte Carlo Methods","43131844":"Jones, J.H.: Dynamics and control of diseases in networks with community structure. PLoS Comput. Biol. 6(8), e1000736","233928489":"The Role of Network Topology on the Initial Growth Rate of Influenza Epidemic","38350866":"Nonstationarity and randomization in the Reed-Frost epidemic model","229846381":"Vaccine Studies, Statistics in","251506204":"An analytical solution for a linear viscoelastic layer loaded with a cylindrical punch: Evaluation of the rebound indentation test with application for assessing viability of articular cartilage","242997657":"Design issues for studies of infectious diseases","267467410":"Stochastic Multitype Epidemics in a Community of Households: Estimation of threshold parameter R* and secure vaccination coverage","8211096":"A Bayesian MCMC approach to study transmission of Influenza: application to household longitudinal data","231225133":"Estimation of Household Transmission Rates of Pertussis and the Effect of Cocooning Vaccination Strategies on Infant Pertussis","4993322":"Bayesian inference for stochastic multitype epidemics in structured populations via random graphs","45185880":"Transmission of Novel Influenza A(H1N1) in Households with Post-Exposure Antiviral Prophylaxis","228865608":"Epidemics in Heterogeneous Communities: modelling, estimation and control","51486461":"Influenza Transmission in Households During the 1918 Pandemic","254297284":"Vector-borne infectious disease mapping with stochastic difference equations: An analysis of dengue disease in Malaysia","232272822":"Semiparametric Relative-Risk Regression for Infectious Disease Transmission Data","230675792":"Modeling the Spread of Influenza Among Cities","270290291":"Discrete stochastic metapopulation model with arbitrarily distributed infectious period","11403102":"Optimal vaccination policies for stochastic epidemics among a population of households","6162344":"Detecting Emerging Transmissibility of Avian Influenza Virus in Human Households","51699938":"The Effect of Heterogeneity on Invasion in Spatial Epidemics: From Theory to Experimental Evidence in a Model System","26710624":"Bayesian inference for stochastic multitype epidemics in structured populations using sample data","51249273":"The correlation between infectivity and incubation period of measles, estimated from households with two cases","7547914":"Modelling antigenic drift in weekly flu incidence","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","15431958":"The Roads Travelled","261389930":"Dengue disease mapping in Malaysia based on stochastic SIR models in human populations","13747374":"Augmented HIV vaccine trial design for estimating reduction in infectiousness and protective efficacy"},"index":169}