{"abs":"In epidemics of infectious diseases such as influenza, an individual may have one of four possible final states: prior immune, escaped from infection, infected with symptoms, and infected asymptomatically. The exact state is often not observed. In addition, the unobserved transmission times of asymptomatic infections further complicate analysis. Under the assumption of missing at random, data-augmentation techniques can be used to integrate out such uncertainties. We adapt an importance-sampling-based Monte Carlo Expectation-Maximization (MCEM) algorithm to the setting of an infectious disease transmitted in close contact groups. Assuming the independence between close contact groups, we propose a hybrid EM-MCEM algorithm that applies the MCEM or the traditional EM algorithms to each close contact group depending on the dimension of missing data in that group, and discuss the variance estimation for this practice. In addition, we propose a bootstrap approach to assess the total Monte Carlo error and factor that error into the variance estimation. The proposed methods are evaluated using simulation studies. We use the hybrid EM-MCEM algorithm to analyze two influenza epidemics in the late 1970s to assess the effects of age and preseason antibody levels on the transmissibility and pathogenicity of the viruses.","title":"A Hybrid EM and Monte Carlo EM Algorithm and Its Application to Analysis of Transmission of Infectious Diseases","id":224050967,"url":"https://www.researchgate.net/publication/224050967_A_Hybrid_EM_and_Monte_Carlo_EM_Algorithm_and_Its_Application_to_Analysis_of_Transmission_of_Infectious_Diseases","names":["Yang Yang","Ira M Longini Jr","M Elizabeth Halloran","Valerie Obenchain","Biometrics"],"references":{"200033837":"Statistical Analysis With Missing Data","10615331":"Estimating efficacy of trivalent, cold-adapted, influenza virus vaccine (CAIV-T) against influenza A (H1N1) and B Using Surveillance Cultures","16118256":"Estimating household and community transmission parameters for influenza","47755550":"Contact intervals, survival analysis of epidemic data, and estimation of R0","227630679":"Quasi-Newton acceleration of the EM algorithm. J Roy Stat Soc B","2860257":"Parameter expansion to accelerate EM: The PX-EM algorithm","236853525":"Louis TA. Finding the observed information matrix when using the EM algorithm. J R Stat Soc B 44: 226-233","227687007":"Markov Chain Monte Carlo Methods for Fitting Spatiotemporal Stochastic Models in Plant Epidemiology","22338950":"An Influenza Simulation model for immunization studies","16085089":"Influenza virus infection in Seattle families, 1975-1979. I. Study design, methods and the occurrence of infections by time and age","236853451":"Finding the Observed Information Matrix When Using the EM Algorithm","51031324":"Modeling Competing Infectious Pathogens From a Bayesian Perspective: Application to Influenza Studies With Incomplete Laboratory Results","228862706":"Implementations of the MCEM algorithm","16085090":"Influenza virus infections in Seattle families, 1975–1979. II. Pattern of infection in invaded households and relation of age and prior antibody to occurrence of infected and related illness","45890661":"Contact intervals, survival analysis of epidemic data, and estimation of\nR_0","7221940":"On estimation of vaccine efficacy using validation samples with selection bias","258277822":"Implementations of the Monte Carlo EM Algorithm","4914135":"Maximizing generalized linear mixed models with an automated Monte Carlo EM algorithm","254287947":"Transmission of Pneumococcal Carriage in Families: A Latent Markov Process Model for Binary Longitudinal Data","8211096":"A Bayesian MCMC approach to study transmission of Influenza: application to household longitudinal data","268653289":"Conjugate Gradient Acceleration of the EM Algorithm","42589154":"Structural Basis of Preexisting Immunity to the 2009 H1N1 Pandemic Influenza Virus","265543328":"A Frailty Mixture Model for Estimating Vaccine Efficacy","23989593":"A Bayesian model for evaluating influenza antiviral efficacy in household studies with asymptomatic infections","265620140":"Statistical Analysis With Missing Data","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","23171806":"A Data-Augmentation Method for Infectious Disease Incidence Data from Close Contact Groups"},"citedIn":{"268788206":"Household Transmission of Vibrio cholerae in Bangladesh","273321765":"Transmissibility of Tuberculosis among School Contacts: An Outbreak Investigation in a Boarding Middle School, China"},"index":172}