{"abs":"In seasonal influenza epidemics, pathogens such as respiratory syncytial virus (RSV) often co-circulate with influenza and cause influenza-like illness (ILI) in human hosts. However, it is often impractical to test for each potential pathogen or to collect specimens for each observed ILI episode, making inference about influenza transmission difficult. In the setting of infectious diseases, missing outcomes impose a particular challenge because of the dependence among individuals. We propose a Bayesian competing-risk model for multiple co-circulating pathogens for inference on transmissibility and intervention efficacies under the assumption that missingness in the biological confirmation of the pathogen is ignorable. Simulation studies indicate a reasonable performance of the proposed model even if the number of potential pathogens is misspecified. They also show that a moderate amount of missing laboratory test results has only a small impact on inference about key parameters in the setting of close contact groups. Using the proposed model, we found that a non-pharmaceutical intervention is marginally protective against transmission of influenza A in a study conducted in elementary schools.","title":"Modeling Competing Infectious Pathogens From a Bayesian Perspective: Application to Influenza Studies With Incomplete Laboratory Results","id":51031324,"url":"https://www.researchgate.net/publication/51031324_Modeling_Competing_Infectious_Pathogens_From_a_Bayesian_Perspective_Application_to_Influenza_Studies_With_Incomplete_Laboratory_Results","names":["Yang Yang","M Elizabeth Halloran","Michael J Daniels","Ira M Longini","Sam Burke","Derek A T Cummings","Journal of the American Statistical Association"],"references":{"200033837":"Statistical Analysis With Missing Data","10615331":"Estimating efficacy of trivalent, cold-adapted, influenza virus vaccine (CAIV-T) against influenza A (H1N1) and B Using Surveillance Cultures","269005067":"Missing data in longitudinal studies: Strategies for Bayesian modeling and sensitivity analysis. Boca Raton, FL: Chapman \u0026 Hall/CRC","20778551":"Simulation of Mechanisms of Viral Interference in Influenza","227687007":"Markov Chain Monte Carlo Methods for Fitting Spatiotemporal Stochastic Models in Plant Epidemiology","29616844":"Deviance Information Criteria for Missing Data Models","38363224":"Inference From Iterative Simulation Using Multiple Sequences","22338950":"An Influenza Simulation model for immunization studies","10813303":"The evolution of infuenza surveillance in Europe and prospects for the next 10 years","7221940":"On estimation of vaccine efficacy using validation samples with selection bias","2492669":"Bayesian measures of model complexity and fit. J R Stat Soc Ser B Stat Methodol","227369174":"The Multiset Sampler","235709522":"Rubin DB. Inference and missing data","254287947":"Transmission of Pneumococcal Carriage in Families: A Latent Markov Process Model for Binary Longitudinal Data","8211096":"A Bayesian MCMC approach to study transmission of Influenza: application to household longitudinal data","31313973":"Estimating parameters in stochastic compartmental models using Markov Chain methods","26803378":"The Transmissibility and Control of Pandemic Influenza A (H1N1) Virus","227541498":"Methods for Conducting Sensitivity Analysis of Trials with Potentially Nonignorable Competing Causes of Censoring","227605819":"Design and evaluation of prophylactic interventions using infectious disease incidence data from close contact groups","15983516":"Evaluation of influenza A/Hong Kong/123/77 (H1N1) ts-1A2 and cold-adapted recombinant viruses in seronegative adult volunteers. Infect Immun","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","12079113":"Methods for conducting sensitivity analysis of trials with potentially nonignorable competing causes of censoring","23989593":"A Bayesian model for evaluating influenza antiviral efficacy in household studies with asymptomatic infections","51378680":"Efficacy of trivalent, cold-adapted, influenza virus vaccine against influenza A (Fujian), a drift variant, during 2003-2004","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods"},"citedIn":{"278792236":"Modeling two strains of disease via aggregate-level infectivity curves","263685123":"Bayesian modeling of temporal properties of infectious disease in a college student population","261924536":"A Pathway EM-Algorithm for Estimating Vaccine Efficacy with a Non-Monotone Validation Set","235648238":"Bayesian analysis of risk factors for infection with a genotype of porcine reproductive and respiratory syndrome virus in Ontario swine herds using monitoring data","221709759":"Increased Risk of Noninfluenza Respiratory Virus Infections Associated With Receipt of Inactivated Influenza Vaccine","224050967":"A Hybrid EM and Monte Carlo EM Algorithm and Its Application to Analysis of Transmission of Infectious Diseases","233396822":"Sensitivity Analysis of an Individual-Based Model for Simulation of Influenza Epidemics"},"index":175}