{"abs":"We consider the problem of model selection and accounting for model uncertainty in high-dimensional contingency tables, motivated by expert system applications. The approach most used currently is a stepwise strategy guided by tests based on approximate asymptotic P-values leading to the selection of a single model; inference is then conditional on the selected model. The sampling properties of such a strategy are complex, and the failure to take account of model uncertainty leads to underestimation of uncertainty about quantities of interest. In principle, a panacea is provided by the standard Bayesian formalism which averages the posterior distributions of the quantity of interest under each of the models, weighted by their posterior model probabilities. Furthermore, this approach is optimal in the sense of maximising predictive ability. However, this has not been used in practice because computing the posterior model probabilities is hard and the number of models is very large (often greater than 1011). We argue that the standard Bayesian formalism is unsatisfactory and we propose an alternative Bayesian approach that, we contend, takes full account of the true model uncertainty byaveraging overamuch smaller set of models. An efficient search algorithm is developed for nding these models. We consider two classes of graphical models that arise in expert systems: the recursive causal models and the decomposable","title":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","id":254287396,"url":"https://www.researchgate.net/publication/254287396_Model_Selection_and_Accounting_for_Model_Uncertainty_in_Graphics_Models_Using_Occam\u0027s_Window","names":["David Madigan","Adrian E. Raftery","Journal of the American Statistical Association"],"references":{"263613815":"Bayes factors","246199469":"Fitting all possible decomposable and graphical models to multiway contingency tables","227776017":"Sequential Updating of Conditional Probabilities on Directed Graphical Structures","254286762":"The Power Function of Conditional Log-Linear Model Tests","220344038":"A Bayesian Method for the Induction of Probabilistic Networks from Data","265443477":"Testing precise hypotheses. With comments and a rejoinder by the authors","21088454":"The effects of model selection on confidence intervals for the size of a closed population","24056230":"Graphical models in applied multivariate statistics","50336265":"The Analysis Of Frequency Data","38364867":"Simultaneous Test Procedures--Some Theory of Multiple Comparisons","248506052":"Evaluating Logistic Models for Large Contingency Tables","38359812":"Hyper Markov Laws in the Statistical Analysis of Decomposable Graphical Models","245848936":"Decomposition of Maximum Likelihood in Mixed Graphical Interaction Models","254284327":"Guided and Unguided Methods for the Selection of Models for a Set of T Multidimensional Contingency Tables","38363676":"Uncertainty, Policy Analysis and Statistics (c/r: P276–291)","239583953":"Metric Methods for Analysing Partially Ranked Data","243785245":"Implementing Bayesian Methods in Forensic Science","222789082":"A Bayesian approach to regression selection and estimation, with application to a price index for radio services","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","231834574":"Recursive Causal Models","44825225":"Analysis of multidimensional contingency tables by exact conditional tests: Techniques and strategies","2751178":"A Theory Of Inferred Causation","50335335":"Theory of probability.","239655397":"Bayes Factors for Linear and Log-linear Models with Vague Prior Information","238681047":"The Analysis of Multidimensional Contingency Tables: Step-Wise Procedures and Direct Estimation Methods for Building Models for Multiple Classification","220642583":"Techniques for Bayesian analysis in expert systems","257266020":"The information in contingency tables","242502401":"Statistical theory—The prequential approach","261793645":"Selection of Subsets of Regression Variables","232525285":"Choosing Models for Cross-Classifications: Comment on Grusky and Hauser","236586849":"Model Search Among Multiplicative Models","243777276":"Testing a Point Null Hypothesis: The Irreconcilability of P Values and Evidence","233241626":"Some Properties of the Dirichlet-Multinomial Distribution and Its Use in Prior Elicitation","239038211":"A Fast Procedure for Model Search in Multidimensional Contingency Tables","242379279":"Local Computation with Probabilities on Graphical Structures and Their Application to Expert Systems"},"citedIn":{"225614192":"Markov chain Monte Carlo methods for probabilistic network model determination","270678048":"Uncertainty Analysis of Multiple Hydrologic Models Using the Bayesian Model Averaging Method","221864255":"Development of a delirium risk screening tool for long-term care facilities","254287663":"Robust Bayesian Model Selection for Autoregressive Processes With Additive Outliers","2301995":"Relaxing the Local Independence Assumption for Quantitative Learning in Acyclic Directed Graphical Models through Hierarchical Partition Models","6947943":"Computational exploration of the activated pathways associated with DNA damage response in breast cancer","220055821":"A comparison of design and model selection methods for supersaturated experiments","2594870":"Graphical Explanation in Belief Networks","228796853":"Automatic Bayesian model averaging for linear regression and applications in Bayesian curve fitting","267711468":"A Bayesian model averaging approach to the dumping severity data over hierarchical log-linear models","281453786":"2012-05-26 logs to landscapes","26707339":"Causal pattern recovery from neural spike train data using the Snap Shot Score","221747499":"Impact of Statistical Learning Methods on the Predictive Power of Multivariate Normal Tissue Complication Probability Models","24142162":"Determining Growth Determinants: Default Priors and Predictive Performance in Bayesian Model Averaging","242075208":"Accounting for Model Uncertainty via Trans-dimensional Genetic Algorithms","258794309":"Quantifying the Objective Cost of Uncertainty in Complex Dynamical Systems","2708482":"Framework for a Generic Knowledge Discovery Toolkit","229739930":"Automatic detection and identification of shocks in Gaussian state-space models: A Bayesian approach","240967280":"MCMC model determination for discrete graphical models","24312159":"Accounting for uncertainty in health economic decision models using model averaging","226423121":"Bayesian network learning by compiling to weighted MAX-SAT","238727682":"Variable Selection Via Gibbs Sampling","33935932":"Incorporating model selection and decision analysis into population dynamics modeling /","24083797":"Bayesian hierarchical regression models for detecting QTLs in plant experiments","1960998":"Operations for Learning With Graphical Models","234140104":"Being Bayesian about Network Structure","24142156":"In Search of a Sulphur Dioxide Environmental Kuznets Curve: A Bayesian Model Averaging Approach","2462744":"Too many Variables? A Comment on Bartels\u0027 Model-Averaging Proposal","7605321":"Estimation of the false negative fraction of a diagnostic kit through Bayesian regression model averaging","271471635":"A Bayesian averaged response-driven multinomial model for lateralization of temporal lobe epilepsy","45900419":"Bayesian Inference","2498660":"Regression with Multiple Candidate Models: Selecting or","26716629":"The derivation of diagnostic markers of chronic myeloid leukemia progression from microarray data","220642658":"Parameter Learning in Object-Oriented Bayesian Networks","266744737":"Lateralization of temporal lobe epilepsy by multimodal multinomial hippocampal response-driven models","24309048":"Selection of Models of DNA Evolution with jModelTest","230628853":"Symptom Validity Indicators Embedded in the Controlled Oral Word Association Test","277487815":"An application of the Bayesian approach to stock assessment model uncertainty","12218612":"Using Bayesian Network to Analyze Expression Data.","238521976":"Discovery of Pseudo-Independent Models from Data","2327660":"Learning Bayesian Networks For Solving Real-World Problems","24063293":"Bayesian estimation and testing of structural equation model","46434967":"Controlling for Observed and Unobserved Site Characteristics in RUM Models of Recreation Demand","42346197":"Comparing Families of Dynamic Causal Models. PLoS","36421244":"Constraint-Based Structural Learning in Bayesian Networks using Finite Data Sets","234842536":"Generative embedding and variational Bayesian inference for multivariate time series","23742775":"Bayesian Modelling of Catch in a Northwest Atlantic Fishery","279633140":"Bayesian Additive Regression Trees using Bayesian Model Averaging","38326824":"Bayesian Model Averaging: A Tutorial","41453083":"Deviance Information Criterion (DIC) in Bayesian Multiple QTL Mapping","5097513":"Finding Good Predictors for Inflation: A Bayesian Model Averaging Approach","228687303":"Modèles statistiques appliqués à l\u0027épidémiologie neuro-comportementale.","2371651":"Bayesian Spatial Disease Clustering: An Application","4986916":"Regression Modeling and Meta-analysis for Decision Making: A Cost-Benefit Analysis of Incentives in Telephone Surveys.","5001254":"An Exploration of Childhood Antecedents of Female Adult Malaise in Two British Birth Cohorts: Combining Bayesian Model Averaging and Recursive Partitioning","273389601":"Want export diversification? Educate the kids first","4789282":"Properties of Bayes Factors Based on Test Statistics","220124531":"Iterative Bayesian Model Averaging: a method for the application of survival analysis to high-dimensional microarray data","4773926":"A Bayesian Approach to Modelling Graphical Vector Autoregressions","268024726":"Tuned Bayesian Model Averaging","242916874":"Linearly Combining Density Estimators via Stacking","2590804":"Model Selection for Generalized Linear Models via GLIB, with Application to Epidemiology","35660371":"Maschinelles Lernen Bayes\u0027scher Netze für benutzeradaptive Systeme /","220698964":"Efficiently Approximating Markov Tree Bagging for High-Dimensional Density Estimation","232710570":"Conceptual model uncertainty in groundwater modeling: Combining generalized likelihood uncertainty estimation and Bayesian model averaging","259505922":"Selection of polynomial chaos bases via Bayesian model uncertainty methods with applications to sparse approximation of PDEs with stochastic inputs","236157541":"The Intrinsic Bayes Factor for Model Selection and Prediction","4914226":"Local model uncertainty and incomplete-data bias","239938101":"A Bayesian model averaging approach to examining changes in quality of life among returning Iraq and Afghanistan Veterans","229652939":"Prediction and Model Selection","221784388":"Bootstrapping in a language of thought: A formal model of numerical concept learning","2730071":"Markov Chain Monte Carlo Model Determination for Hierarchical and Graphical Log-linear Models","234135926":"\"Banking, debt and currency crisis: early warning indicators for developed countries\"","38326989":"Computational Advances for and from Bayesian Analysis","257410000":"QuickLexSort: An efficient algorithm for lexicographically sorting nested restrictions of a database","33766027":"Statistical analysis of gene expression profile [electronic resource] : transcription network inference and sample classification /","221901237":"Bayesian Nonparametric Shrinkage Applied to Cepheid Star Oscillations","38056650":"Model Averaging Techniques for Quantifying Conceptual Model Uncertainty","235656836":"A Bayesian Approach to Learning Causal Networks","266053449":"Conceptual Model Uncertainty in the Management of the Chi River Basin, Thailand","11329599":"Sillanpää MJ, Corander J. Model choice in gene mapping: what and why. Trends Genet 18: 301-307","284806250":"Test-retest reliability of effective connectivity in the face perception network","2360497":"Being Bayesian About Network Structure: A Bayesian Approach to Structure Discovery in Bayesian Networks","230684968":"Integrating external biological knowledge in the construction of regulatory networks from time-series expression data","220055942":"Default Bayesian model determination methods for generalised linear mixed models","39424709":"Modelos multivariantes para variables ordinales: Aplicaciones en estudios de calidad de servicio","242462444":"Multivariate Applications of Bayesian Model Averaging","6302912":"Speech-associated gestures, Broca’s area, and the human mirror system","2286722":"Posterior Predictive Assessment of Model Fitness Via Realized Discrepancies","2364549":"Detecting and Modeling Spatial Disease Clustering: A Bayesian Approach","2789515":"Refinement of Theories Represented on Bayesian Networks","226991398":"Applying Pedo-transfer Functions to Simulate Spatial Heterogeneity of Cinnamon Soil Water Retention Characteristics in Western Liaoning Province","40118982":"Discussion on the meeting on \u0027Statistical modelling and analysis of genetic data\u0027","5196013":"Growth Economics and Reality","4993256":"Bayes model averaging with selection of regressors. J R Stat Soc B","47385207":"Variable Selection and Updating In Model-Based Discriminant Analysis for High Dimensional Data with Food Authenticity Applications.","4993258":"Broman, K.W. \u0026 Speed, T.P. A model selection approach for the identification of quantitative trait loci in experimental crosses. J. R. Stat. Soc. Ser. B Stat. Methodol. 64, 641-656","258407361":"Wireless Algorithms, Systems, and Applications, 5th International Conference, WASA 2010, Beijing, China, August 15-17, 2010. Proceedings","51910577":"Combining Predictive Distributions","51798972":"Construction of regulatory networks using expression time-series data of a genotyped population","258660289":"Merging Seasonal Rainfall Forecasts from Multiple Statistical Models through Bayesian Model Averaging","223771131":"On properties of predictors derived with a two-step bootstrap model averaging approach—A simulation study in the linear regression model","229979397":"Satellite image texture and a vegetation index predict avian biodiversity in the Chihuahuan Desert of New Mexico","228702485":"Learning distributed bayesian network structure using majority-based method","222564848":"Modeling uncertainty in macroeconomic growth determinants using Gaussian graphical models","281374834":"Bayesian Approaches for Large Biological Networks","283016294":"Prediction in M-open problems","259553216":"Model Averaging in Economics: An Overview","221534600":"Toward an Optimal Ensemble of Kernel-based Approximations with Engineering Applications","224040422":"Mapping epistemic uncertainty and vague concepts in predictions of species distribution","4924663":"Universality of Bayesian Predictions Rejoinder","222422524":"Bayesian graphical model determination using decision theory","221430156":"Learning and the language of thought.","263898885":"Model Averaging, Optimal Inference, and Habit Formation","269578451":"Bayesian Chance-Constrained Hydraulic Barrier Design under Geological Structure Uncertainty","11611253":"Variable selection and Bayesian model averaging in case-control studies","248808978":"Bayesian model averaging for groundwater head prediction and uncertainty analysis using multimodel and multimethod","221707774":"Bayesian Model Averaging Using the k-best Bayesian Network Structures","228021597":"Dealing with overdispersed count data in applied ecology","228898158":"Context Sensitive Regression Models with Binary Predictors","41038527":"The identification of informative genes from multiple datasets with increasing complexity","51042247":"A Bayesian Approach to Analyse Genetic Variation within RNA Viral Populations","222465426":"Probabilistic reasoning and multiple-expert methodology for correlated objective data","223112601":"Priors on network structures. Biasing the search for Bayesian networks","261045081":"Bayesian model mixing for cold rolling mills: Test results","33515816":"Incorporating model selection and decision analysis into population dynamics modeling","2492669":"Bayesian measures of model complexity and fit. J R Stat Soc Ser B Stat Methodol","271590639":"Bridging continual reassessment method for phase I clinical trials in different ethnic populations","264312610":"Banking, Debt, and Currency Crises in Developed Countries: Stylized Facts and Early Warning Indicators","221112776":"MCMC Learning of Bayesian Network Models by Markov Blanket Decomposition","230238559":"Handbook of Statistical Systems Biology","228676937":"Combining methods in supervised classification: A comparative study on discrete and continuous problems","4898976":"Automatic monitoring and intervention in multivariate dynamic linear models","222410157":"The mode oriented stochastic search (MOSS) algorithm for log-linear models with conjugate priors","5470399":"Bayesian disease mapping using product partition models","221797845":"Predicting relapse prior to transplantation in chronic myeloid leukemia by integrating expert knowledge and expression data","267429661":"Bayesian averaging of regressive models","241561224":"Model Selection in Estimation of Fitness Landscapes","228625745":"A Multimodel Ensemble Forecast Framework: Application to Spring Seasonal Flows in the Gunnison River Basin","24240516":"Gestures Orchestrate Brain Networks for Language Understanding","264386359":"An empirical comparison of alternative schemes for combining electricity spot price forecasts","49693185":"A multiorganism based method for Bayesian gene network estimation","288025042":"Bayesian Model Averaging for the Prediction of Water Main Failure for Small to Large Canadian Municipalities","266221350":"Predictive modelling of burn probability and burn severity in a desert spring ecosystem","264791856":"Bayesian feature selection in high-dimensional regression in presence of correlated noise","281135555":"Feature Subset Selection Using Naive Bayes for Text Classification","2592036":"Strategies for Graphical Model Selection","228079771":"IBM SPSS Amos 19 User\u0026apos;s Guide","224881763":"Bayesian Constrained Variable Selection","23635053":"A characterization of consistency of model weights given partial information in normal linear models","46591936":"Modelos bayesianos para la clasificación supervisada. Aplicaciones al análisis de datos de expresión genética","223897680":"Predictive likelihood for Bayesian model selection and averaging","244455326":"Bayesian Methods Applied to the Database Inference Problem","220350509":"Towards efficient variables ordering for Bayesian networks classifier","44709816":"Approche bayésienne variationnelle pour l\u0027agrégation de modèles en classification.","220907570":"Probability Density Estimation by Perturbing and Combining Tree Structured Markov Networks","220254267":"Learning Bayesian networks: Approaches and issues","225161335":"Habitat variables explain Loggerhead Shrike occurrence in the northern Chihuahuan Desert, but are poor correlates of fitness measures","38418263":"Bayesian carrier frequency offset estimation in orthogonal frequency division multiplexing systems","248935371":"Do previous birth interval and mother\u0027s education influence infant survival? A Bayesian model averaging analysis of Chinese data","228597951":"An application of the Bayesian approach to stock assessment model uncertainty","2504967":"Bayesian Variable Selection Using the Gibbs Sampler","228452540":"Log-optimal economic evaluation of probability forecasts","2381062":"Learning Extensible Multi-Entity Directed Graphical Models","290408556":"Additional File 3","2867469":"Bayesian Graphical Models for Discrete Data","257308272":"Learning Chordal Markov Networks by Constraint Satisfaction","220363786":"Bayesian Inference for Categorical Data Analysis","229640344":"Modeling Regional Economic Growth with a Focus on Amenities","250395588":"Bayesian model averaging approach in health effects studies: Sensitivity analyses using PM10 and cardiopulmonary hospital admissions in Allegheny County, Pennsylvania and simulated data","257460849":"Statistical strategies for constructing health risk models with multiple pollutants and their interactions: Possible choices and comparisons","220309515":"Using Bayesian Networks to Analyze Expression Data","4993382":"Bayesian modeling of catch in a northwest Atlantic fishery","44631939":"Quantitative Trait Nucleotide Analysis Using Bayesian Model Selection","267107008":"Birth Defects Registered by Double Sampling: A Bayesian Approach Incorporating Covariates and Model Uncertainty","224839755":"Model Uncertainty, Data Mining and Statistical Inference","2659589":"Integrating Natural Language Subtasks with Bayesian Belief Networks","228227252":"Asset Return Predictability and Bayesian Model Averaging","229660802":"Improvement over Bayes prediction in small samples in the presence of model uncertainty","2612499":"Bayesian Model Averaging for Linear Regression Models","228313260":"Limited Information Bayesian Model Averaging for Dynamic Panels with an Application to a Trade Gravity Model","4725104":"Forecasting Using Bayesian and Information-Theoretic Model Averaging: An Application to U.K. Inflation","26808480":"Effort indicators within the California verbal learning test-II (CVLT-II)","282623460":"Inference after checking multiple Bayesian models for data conflict and applications to mitigating the influence of rejected priors","262335135":"Learning from Data: Possibilistic Graphical Models","220283932":"Collective Mining of Bayesian Networks from Distributed Heterogeneous Data","4851063":"Forecasting using Bayesian and Information Theoretic Averaging: An Application to UK Inflation","225743932":"Tractable Bayesian Learning of Tree Belief Networks","23524398":"Determinantes inmediatos y fundamentales del Crecimiento económico en Colombia bajo el Método Bayesiano de selección de variables","6940962":"Bayesian variable selection for the analysis of microarray data with censored outcome","2421096":"Bayesian Model Averaging And Model Selection For Markov Equivalence Classes Of Acyclic Digraphs","228312277":"Individual Shrinkage-Based Fuzzy Variable Selection","279633381":"Bayesian model averaging in model-based clustering and density estimation","255244900":"Comparison of Two Gas Selection Methodologies: An Application of Bayesian Model Averaging","229765346":"A Decision Theoretic Approach to Model Averaging","44642289":"A Model-Averaging Approach to Replication: The Case of p(rep)","4898064":"Parallel coordinates for exploratory modelling analysis","4906262":"Combining Canadian Interest-Rate Forecasts","258252347":"Bayesian Peak Picking for NMR Spectra","266206911":"Bayesian age-stratified joinpoint regression model: an application to lung and brain cancer mortality","228560123":"Assessing the Risk of Disclosure of Confidential Categorical Data","2784591":"Inference from a Deterministic Population Dynamics Model for Bowhead Whales: Rejoinder","287851598":"Probabilistic versus Regression Modeling for Disinfection Byproducts","1757564":"Learning Probabilistic Models of Word Sense Disambiguation","220451914":"Bayesian Networks for Data Mining","4746529":"Evolutionary Similarity Among Genes","46430120":"Using the Bayesian information criterion to develop two-stage model-robust and model-sensitive designs","4733242":"Regime shifts, environmental signals, uncertainty, and policy choice","263865033":"SOFTWARE SYSTEMS FOR TABULAR DATA RELEASES","49660801":"Model selection in Medical Research: A simulation study comparing Bayesian Model Averaging and Stepwise Regression","3296583":"A Guide to the Literature on Learning Probabilistic Networks from Data","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","264816307":"Predicting the Present with Bayesian Structural Time Series","227369201":"Bayesian Model Averaging Continual Reassessment Method in Phase I Clinical Trials","257800921":"Climate Projections Using Bayesian Model Averaging and Space–Time Dependence","246048559":"Eliciting prior information to enhance the predictive performance of Bayesian graphical models","4813260":"Policy Evaluation and Empirical Growth Research","8182267":"Model Selection and Model Averaging in Phylogenetics: Advantages of Akaike Information Criterion and Bayesian Approaches Over Likelihood Ratio Tests","45897524":"On Bayesian Data Analysis","225779964":"Spatio-temporal dynamics of Quercus faginea forests in the Spanish Central Pre-Pyrenees. Eur J Forest Res","2469295":"Prediction Via Orthogonalized Model Mixing","229706810":"Bayesian data mining, with application to benchmarking and credit scoring","266307153":"A simulation study for some biased estimation methods","24079615":"Forecast Combination and Model Averaging Using Predictive Measures","267740769":"Bayesian Disease Classification Using Copy Number Data","40848376":"Bayesian model averaging for evaluation of candidate gene effects","228592696":"Bayesian Variable Selection and Estimation of Risk Premiums in the APT model","288905376":"Comparison of Three Statistical Downscaling Methods and Ensemble Downscaling Method Based on Bayesian Model Averaging in Upper Hanjiang River Basin, China","257017544":"A Bayesian model averaging approach to analyzing categorical data with nonignorable nonresponse","261755393":"Fast Bayesian inference for gene regulatory networks using ScanBMA","51914371":"Searching for Bayesian Network Structures in the Space of Restricted\nAcyclic Partially Directed Graphs","228379648":"Uncertainty of the Liberal Peace","281399643":"Mapping wood production in European forests","254287497":"The Bayesian Modeling of Covariates for Population Pharmacokinetic Models","227665968":"Multivariate Bayesian variable selection and prediction. J Royal Stat Soc, Series B","266474048":"Bayesian Variable Selection in Schizophrenia Research","2854286":"Software Systems for Tabular Data Releases","223171818":"Bayesian stochastic search for VAR model restrictions","264578658":"Intrinsically Optimal Bayesian Robust Filtering","227635256":"Statistical Inference in Context Specific Interaction Models for Contingency Tables","270906764":"Bayesian Inference of Autoregressive and Functional-Coefficient Moving Average Models","4982246":"Amenities and Rural Appalachia Economic Growth","259674833":"Ecological correlates of local extinction and colonisation in the British ladybird beetles (Coleoptera: Coccinellidae)","221345948":"Exact model averaging with naive Bayesian classifiers","284554565":"Bayesian Model Averaging and Jointness Measures for gretl","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","23259345":"Bayesian Methodology for Model Uncertainty Using Model Performance Data","267738694":"Inferring Gene Network from Candidate SNP Association Studies Using a Bayesian Graphical Model: Application to a Breast Cancer Case-Control Study from Ontario","2771356":"Statistical Ideas for Selecting Network Architectures","266322537":"Variable selection in Bayesian generalized linear-mixed models: An illustration using candidate gene case-control association studies","228204579":"Selection vs. Averaging of Logistic Credit Risk Models","236132268":"Bayesian Model Selection \u0026 Averaging","46497658":"Bayesian and non-Bayesian analysis of the seemingly unrelated regression model with Student- errors, and its application for forecasting","5096844":"Computational Efficiency in Bayesian Model and Variable Selection","12337534":"Bayesian Detection and Modeling of Spatial Disease Clustering","2642415":"Decomposable Graphical Gaussian Model Determination","4993419":"A hierarchical Bayesian model for predicting the functional consequences of amino-acid polymorphisms","229708918":"Model Uncertainty","5562777":"Data splitting as a countermeasure against hypothesis fishing: With a case study of predictors for low back pain","221619450":"Accelerating Bayesian Structural Inference for Non-Decomposable Gaussian Graphical Models.","241724327":"Efficient Bayesian Inference for Multivariate Probit Models With Sparse Inverse Correlation Matrices","220554487":"New perspectives on Causal Networks: the first CaNew workshop","270940659":"Bayesian model selection for nonlinear aeroelastic systems using wind-tunnel data","2641407":"Bayesian Selection of Log-Linear Models","221203704":"Case Based Reasoning with Bayesian Model Averaging: An Improved Method for Survival Analysis on Microarray Data","2296318":"Semiparametric Bayesian Analysis Of Survival Data","2682358":"Likelihood-based Causal Inference","5233041":"Fitting stratified proportional odds models by amalgamating conditional likelihoods","265773622":"Bayesian variable selection in linear regression and a comparison","225133704":"The Posterior Probability of Bayes Nets with Strong Dependences","228553849":"Statistical Methods in Applied Computer Science Lecture Notes","283558145":"Trading Hard Hats for Combat Helmets: The Economics of Rebellion in Eastern Ukraine","4742563":"Recidivism and Social Interactions","227617914":"Extended Bayesian model averaging for heritability in twin studies","223166625":"Bayesian portfolio selection using a multifactor model","239764391":"USING A REGRESSION APPROACH TO ESTIMATE PERSONS PER HOUSEHOLD AND VACANCY RATES IN THE PRODUCTION OF HOUSING UNIT-BASED POPULATION ESTIMATES","35439601":"Uncertainty estimation for target detection system discrimination and confidence performance metrics /","263533146":"A New Algorithm in Bayesian Model Averaging in Regression Models","229441629":"Model selection in canonical correlation analysis (CCA) using Bayesian model averaging","237175763":"Sea lamprey (Petromyzon marinus) size trends in a salmonid stocking context in Lake Superior","225114267":"An Introduction to Bayesian Techniques for Sensor Networks","225599623":"Survival and spatial fidelity of Mouflon: The effect of location, age and sex","46434099":"Predictive gains from forecast combinations using time-varying model weights","262358619":"Independence in Uncertainty Theories and Its Application to Learning Belief Networks","247576379":"What Have We Learned from a Decade of Empirical Research on Growth? Growth Empirics and Reality’","4993462":"Bayesian disclosure risk assessment: Predicting small frequencies in contingency tables","226916477":"A “Microscopic” Study of Minimum Entropy Search in Learning Decomposable Markov Networks","4742579":"Bayesian Model Averaging With Applications to Benchmark Dose Estimation for Arsenic in Drinking Water","5124530":"A Bayesian Approach to Model Uncertainty","256837299":"Characterizing and Visualizing Predictive Uncertainty in Numerical Ensembles Through Bayesian Model Averaging","282608932":"Weighted Score Tests Implementing Model-Averaging Schemes in Detection of Rare Variants in Case-Control Studies","220055776":"Bayesian curve estimation by model averaging","228059027":"Making life better one large system at a time: Challenges for UAI\nresearch","2760236":"Learning Bayesian Networks from Data: An Efficient Approach Based on Information Theory","277298831":"Bayesian Model Averaging","2888229":"Learning Probabilistic Networks","285390603":"Entropy Theory and its Application in Environmental and Water Engineering","269520411":"A split-and-merge Bayesian variable selection approach for ultrahigh dimensional regression","2350651":"Regression Models for Decision Making: A Cost-Benefit Analysis of Incentives in Telephone Surveys","257561920":"Bayesian Model Averaging for multivariate extremes","259567971":"Modelling survival data to account for model uncertainty: A single model or model averaging?","241766514":"Asset Returns Under Model Uncertainty: Evidence from the euro area, the U.K. and the U.S","283668212":"Nonparametric Variable Selection, Clustering and Prediction for Large Biological Datasets","241205375":"Assessment of uncertainty in protein backbone NMR assignments using Bayesian model averaging","46463195":"Evaluating Short-Run Forecasting Properties of the KOF Employment Indicator for Switzerland in Real Time","2814475":"Regression with Multiple Candidate Models: Selecting or Mixing?","8373851":"Bayesian Variable Selection in Multinomial Probit Models to Identify Molecular Signatures of Disease Stage","222485349":"A Method for Simultaneous Variable Selection and Outlier Identification in Linear Regression;","14100222":"Probabilistic Independence Networks for Hidden Markov Probability Models","4872807":"Predicting the Term Structure of Interest Rates: Incorporating Parameter Uncertainty, Model Uncertainty and Macroeconomic Information","280163999":"Multivariate partially linear single-index models: Bayesian analysis","228860810":"Bayesian covariance selection","228402099":"Statistical Methods in Applied Computer Science Lecture Notes Preliminary for course 2D5342, Data Mining, Jan-April 2006.","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","261741995":"Challenges Facing Statistical Genetics","220571421":"Exploiting association and correlation rules parameters for learning Bayesian networks","2349592":"Bayesian Variable Selection in Qualitative Models by Kullback--Leibler projections","227450805":"Variable selection in STAR models with neighbourhood effects using genetic algorithms","220056358":"Hybrid Bayes factors for genome-wide association studies when a robust test is used","4886133":"Why Do Pooled Forecasts Do Better than Individual Forecasts Ex Post?","37434491":"A note on model uncertainty in linear regression","240922654":"Evolution de l\u0027utilisation des statistiques : quelques réflexions sur le rôle des modèles","228937697":"Model Selection in Structural Equation Models With Continuous and Polytomous Data","24171318":"Bayesian model averaging in meta-analysis: Vitamin E supplementation and mortality","45909238":"An empirical Bayes procedure for the selection of Gaussian graphical\nmodels","226920395":"Ensemble of Metamodels with Optimized Weight Factors","44685567":"Extended Bayesian Model Averaging in Generalized Linear Mixed Models Applied to Schizophrenia Family Data","222282600":"BIFROST — Block recursive models induced from relevant knowledge, observations, and statistical techniques","41909286":"Estimating and Projecting Trends in HIV/AIDS Generalized Epidemics Using Incremental Mixture Importance Sampling","226167585":"Effects of abiotic and anthropogenic factors on the spatial distribution of Quercus faginea in the Spanish Central Pyrenees","226884574":"Learning Bayesian Networks: The Combination of Knowledge and Statistical Data","2353784":"Scaling Bayesian network discovery through incremental recovery","267762089":"Weighted-average least squares (WALS): A survey","251735394":"Introduction to Causal Modeling, Bayesian Theory and Major Bayesian Modeling Tools for the Intelligence Analyst","269339241":"Testing hypotheses via a mixture estimation model","266039742":"Multiply Imputed Synthetic Data Files","257490237":"Causal analysis of futures sugar prices in Zhengzhou","235633772":"Bayesian Learning of Loglinear Models for Neural Connectivity","23743232":"Statistical Modeling of Fishing Activities in the North Atlantic","4746789":"Methods and Criteria for Model Selection","4733477":"Policy Analysis in Uncertain Economic Environments","220451667":"Statistical Themes and Lessons for Data Mining","4741693":"Transdimensional Markov Chains: A Decade of Progress and Future Perspectives","279920344":"Predicting water main failures using Bayesian model averaging and survival modelling approach","257028395":"Stratified Graphical Models - Context-Specific Independence in Graphical Models","235049086":"A Computer-Aided Diagnosis System for Breast Cancer Combining Mammography and Proteomics","237198431":"Model Uncertainty and Bayesian Model Averaged Benchmark Dose Estimation for Continuous Data","50394493":"Model Averaging in the Presence of Structural Uncertainty about Treatment Effects: Influence on Treatment Decision and Expected Value of Information","11445968":"The Effects of Nucleotide Substitution Model Assumptions on Estimates of Nonparametric Bootstrap Support","246340817":"Graphical model search via essential graphs","237458599":"BAYESIAN VARIABLE SELECTION IN LINEAR REGRESSION AND A COMPARISON","11077160":"A Unified Approach to Joint Modeling of Multiple Quantitative and Qualitative Traits in Gene Mapping","277289477":"1 Introduction Preliminary Dissertation Proposal","261925151":"Happiness as a Driver of Risk-avoiding Behaviour: Theory and an Empirical Study of Seatbelt Wearing and Automobile Accidents","49739890":"Causal graphical models in systems genetics: A unified framework for joint inference of causal network and genetic architecture for correlated phenotypes","33027954":"Model Selection for Dags via RJMCMC for the Discrete and Mixed Case","51674515":"An evaluation of prior influence on the predictive ability of Bayesian model averaging","228279068":"The Drivers of International Migration to the UK: A Panel‐Based Bayesian Model Averaging Approach","229078816":"On efficient calculations for Bayesian variable selection","222402504":"The size distribution for Markov equivalence classes of acyclic digraph models","269382279":"Air pollution effects on clinic visits in small areas of Taiwan revisited","268226935":"Bayesian Evidence and Model Selection","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","241724645":"Global Optimization Using Mixed Surrogates and Space Elimination in Computationally Intensive Engineering Designs","250077300":"Identifying Ecological Change and Its Causes: A Case Study on Coral Reefs","46447703":"Default Priors and Predictive Performance in Bayesian Model Averaging, with Application to Growth Determinants","51496325":"Effect of systemic antibiotics and topical chlorhexidine on meticillin-resistant Staphylococcus aureus carriage in intensive care unit patients","5233370":"Bayesian Variable and Model Selection Methods for Genetic Association Studies","23977979":"\"Bayesian Variable Selection in Qualitative Models by Kullback-Leibler Projections\"","223861708":"Use of logistic regression for validation of maps of the spatial distribution of vegetation species derived from high spatial resolution hyperspectral remotely sensed data","24052724":"Nonparametric adaptive detection in fading channels based on sequential Monte Carlo and Bayesian model averaging","222623711":"Split models for contingency tables","228751165":"Improving Predictions Using Ensemble Bayesian Model Averaging","228578107":"Bayesian Networks for Genomic Analysis","227646260":"Bayesian inference in ecology. Ecol Lett 7:509-520","4222695":"Using a Bayesian Posterior Density in the Design of Perturbation Experiments for Network Reconstruction","5799664":"BioCAD: An information fusion platform for bio-network inference and analysis","238879895":"Transdimensional Markov Chains","220643212":"Bayesian learning of Bayesian networks with informative priors","229970713":"Assessing environmental stressors via Bayesian Model Averaging in the presence of missing data","34202791":"Constraint-based structural learning in Bayesian networks using finite data sets [Elektronische Ressource] /","221876107":"A Spectral Graphical Model Approach for Learning Brain Connectivity Network of Children\u0027s Narrative Comprehension","238363777":"TUNING MODEL COMPLEXITY USING CROSS-VALIDATION FOR SUPERVISED LEARNING","228565802":"Extended Bayesian scores for reconstructing gene regulatory networks","11452953":"Assessment of Response Bias in Mild Head Injury: Beyond Malingering Tests","250755141":"Bayesian Methods and Simulation-Based Computation for Contingency Tables","283860563":"Combining Forecasts from Linear and Nonlinear Models Using Sophisticated Approaches","24083414":"Risk factors of coronary heart disease: A Bayesian model averaging approach","233259814":"A Criterion for Optimal Predictive Model Selection","5606039":"Gene Network Inference via Structural Equation Modeling in Genomics Experiments","220594150":"Metamodeling development for reliability-based design optimization of automotive body structure","226096061":"An Anthology of Probabilistic Models for Medical Informatics","271917811":"Mixture model averaging for clustering","269468361":"Risk factors of pandemic influenza A/H1N1 in a prospective household cohort in the general population: Results from the CoPanFlu-France cohort","225128354":"Model Selection for Two View Geometry:A Review","251423799":"Sensitivity analysis and assessment of prior model probabilities in MLBMA with application to unsaturated fractured tuff","4746883":"Parameterization and Bayesian Modeling","2896615":"Model uncertainty. Stat Sci","225149862":"A Tutorial on Learning With Bayesian Networks","250076202":"New tools for insight from ecological models and data 1","267852069":"Modelos Grafos para Expressão Gênica","254063088":"Applying Bayesian Model Averaging for Quantile Estimation in Accelerated Life Tests","227507033":"Model Determination for Directed Acyclic Graphs","228058945":"Bayesian structure learning using dynamic programming and MCMC","265273623":"Water Quality Monitoring: Water Quality Monitoring: From River To Reef From River To Reef","220324856":"Locally Adaptive Cooperative Kalman Smoothing and Its Application to Identification of Nonstationary Stochastic Systems","254212603":"Dynamic Staged Trees for Discrete Multivariate Time Series: Forecasting, Model Selection and Causal Analysis","228289402":"Cross-Country Growth Empirics and Model Uncertainty: An Overview","254391755":"Bayesian structural learning and estimation in Gaussian graphical models","8211097":"Comparison of Bayesian model averaging and stepwise methods for model selection in logistic regression. Stats Med","222817186":"Bayesian model determination for multivariate ordinal and binary data","31327028":"Bayesian methods for estimation of the size of a closed population","2713283":"Prediction Using Orthogonalized Model Mixing","222708653":"Benchmark priors for Bayesian Model Averaging. J Econom 100: 381-427","265231652":"Criterion based methods for Bayesian model assessment","27515727":"Using Visualization, Variable Selection and Feature Extraction to Learn from Industrial Data","45098048":"Online Prediction Under Model Uncertainty via Dynamic Model Averaging: Application to a Cold Rolling Mill","228705104":"A hierarchical bayes approach to variable selection for generalized linear models","51218937":"The application of naive Bayes model averaging to predict Alzheimer\u0027s disease from genome-wide data","256044470":"Earnings Surprise Implicit in Stock Prices: Which Earnings Forecasting Models are Investors Using and What Determines Their Choice?","235360496":"Structure and Parameter Learning for Causal Independence and Causal\nInteraction Models","266423574":"An Introduction to Probabilistic Graphical Models","221153237":"Improving the SLA Algorithm Using Association Rules.","257466788":"Generalized Gaussian mixture models as a nonparametric Bayesian approach for clustering using class-specific visual features","220017634":"A Statistical Perspective on Data Mining","228726621":"Density Nowcasts and Model Combination: Nowcasting Euro-Area GDP Growth Over the 2008-09 Recession","4991821":"Returns to Schooling and Bayesian Model Averaging: A Union of Two Literatures","223369809":"Family resources, social capital, and college attendance","228315807":"Bayesian Model Averaging in Multi-Factor Markets","220309030":"Learning Causal Networks from Data: A Survey and a New Algorithm for Recovering Possibilistic Causal Networks.","223885919":"A review and comparison of four commonly used Bayesian and maximum likelihood model selection tools. Ecol Model","227689113":"Generalized additive models for location, scale and shape (GAMLSS). R J Stat Softw","221089313":"Model Selection for Two View Geometry: A Review.","258855011":"Evaluating Predictors of Dispersion: A Comparison of Dominance Analysis and Bayesian Model Averaging","229881507":"Toward better scoring metrics for pseudo‐independent models","47698375":"Time-dependent speciation and extinction from phylogenies: A least squares approach","264828121":"Geotechnical Reliability Analysis with Limited Data: Consideration of Model Selection Uncertainty","225965669":"Mixture model for inferring susceptibility to mastitis in dairy cattle: a procedure for likelihood-based inference","266175694":"CONNECTIONS BETWEEN INDIVIDUAL DISPERSAL BEHAVIOR AND THE MULTI-SCALE DISTRIBUTION OF A SAPROXYLIC BEETLE","250257913":"Did Illegal Overseas Absentee Ballots Decide the 2000 U.S. Presidential Election?","227672710":"Bayesian graphical modelling: A case-study in monitoring health outcomes","250693093":"Probabilistic analysis of a static frame model","254159923":"Improving the K2 Algorithm Using Association Rule Parameters","225950317":"Accounting for Model Uncertainty in the Prediction of University Graduation Rates","243103079":"Model-Robust Process Optimization Using Bayesian Model Averaging","230161065":"How robust are Palearctic migrants to habitat loss and degradation in the Sahel?","256109665":"Software review","222428770":"Forecast combination and the Bank of England\u0027s suite of statistical forecasting models","220056126":"Bayesian variable selection and model averaging in the arbitrage pricing theory model","239591779":"Multimodel Inference for Reserving","228746887":"Bayesian Model Averaging and Bayesian Predictive Information Criterion for Model Selection","6758210":"Bayesian Model Averaging of Naive Bayes for Clustering","215721980":"Dynamic Bayesian Networks: Representation, Inference and Learning. Ph.D. thesis","270913282":"A Bayesian mixed shrinkage prior procedure for spatial–stochastic basis selection and evaluation of gPC expansions: Applications to elliptic SPDEs","221653534":"Applying General Bayesian Techniques to Improve TAN Induction","232279792":"Derivation of an Embedded Rey Auditory Verbal Learning Test Performance Validity Indicator","2820891":"Uncertainty in RODOS","240336225":"Lumley T, Sheppard L. Assessing seasonal confounding and model selection bias in air pollution epidemiology using positive and negative control analyses","263693445":"A Model-Averaging Approach for High-Dimensional Regression","44586395":"Inferring fitness landscapes","284131288":"Learning discrete decomposable graphical models via constraint optimization","24047186":"The Conquest of U.S. Inflation: Learning and Robustness to Model Uncertainty","221461007":"Adjusted Estimation for the Combination of Classifiers","4744053":"Bayesian Wavelet Regression on Curves With Application to a Spectroscopic Calibration Problem","228825757":"Bayesian Models for Variable Selection that Incorporate Biological Information","220441117":"Bayesian Model Learning Based on Predictive Entropy","41669947":"Variance Estimation in a Model with Gaussian Sub-Models.","4741896":"Variance Estimation in a Model With Gaussian Submodels","38012164":"Bayesian model selection using test statistics","11545585":"Genetic Evaluation of Dairy Cattle Using Test-Day Models","220672612":"Data mining and the impact of missing data","227649236":"Bayesian Model Averaging in Proprtional Hazard Models: Assessing the Risk of a Stroke","51890257":"Variational Bayes approach for model aggregation in unsupervised\nclassification with Markovian dependency","265727121":"Bayesian factors","241970475":"Isochronous pion decay channel for enhanced muon capture","4788993":"Labelled Graphical Models","49684926":"Change in Follicle-Stimulating Hormone and Estradiol Across the Menopausal Transition: Effect of Age at the Final Menstrual Period","9022405":"Dose-Finding with Two Agents in Phase I Oncology Trials","51568735":"Dynamic Logistic Regression and Dynamic Model Averaging for Binary Classification","228688622":"Improving Markov Chain Monte Carlo Model Search for Data Mining","221775465":"Hierarchical Bayesian formulations for selecting variables in regression models","239919390":"Model Selection and Model Averaging in Phylogenetics","216771513":"Linking landscape-level change to habitat quality: An evaluation of restoration actions on the freshwater habitat of spring-run Chinook salmon","254610553":"Bayesian inference in modeling recreation demand","2704240":"Learning Belief Networks in Pseudo-independent Domains","2585469":"A Graphical Characterization of Lattice Conditional Independence Models","228769529":"Maximum Likelihood Bayesian averaging of spatial variability models in unsaturated fractured tuff","27296507":"Parameterization and Bayesian modeling. J Am Stat Assoc","244310483":"Acquiring and Assessing Knowledge From Multiple Experts Using Graphical Representations","220371583":"Probabilistic reasoning and multiple-expert methodology for correlated objective data.","5123856":"Is Growth Enough? Macroeconomic Policy and Poverty Reduction","4742935":"How Useful Is Bagging in Forecasting Economic Time Series? A Case Study of U.S. Consumer Price Inflation","258037760":"A scalable, knowledge-based analysis framework for genetic association studies","233991827":"Sequential data assimilation with multiple models","220343872":"Learning decomposable markov networks in pseudo-independent domains with local evaluation","284111756":"Tomogram-based Comparison of Geostatistical Models: Application to the Macrodispersion Experiment (MADE) Site","2301765":"Bayesian Graphical Models, Intention-to-Treat, and the Rubin Causal Model","5004074":"Defining and Characterising Structural Uncertainty in Decision Analytic Models (CHE Research Paper No. 9)","2335556":"Data Splitting Strategies for Reducing the Effect of Model Selection on Inference","248398244":"An Integrative Framework for Bayesian Variable Selection with Informative Priors for Identifying Genes and Pathways","229873345":"Modelling near‐infrared signals for on‐line monitoring in cheese manufacture","23141910":"Multiple Parameterization for Hydraulic Conductivity Identification","26247912":"Do serum biomarkers really measure breast cancer?","30514861":"Sélection de modèle par validation-croisée en estimation de la densité, régression et détection de ruptures","262885590":"Environmental Risk Score as a New Tool to Examine Multi-Pollutants in Epidemiologic Research: An Example from the NHANES Study Using Serum Lipid Levels","227036918":"Global prior distributions for the analysis of discrete graphical models","49762678":"A Bayesian Framework for Inference of the Genotype-Phenotype Map for Segregating Populations","23991020":"Learning Bayesian networks for discrete data","263428150":"Model averaging estimation of generalized linear models with imputed covariates","250826100":"ENHANCING THE PREDICTIVE PERFORMANCE OF BAYESIAN GRAPHICAL l\\IlODELS","228661798":"Policy evaluation and uncertainty about the effects of oil prices on economic activity","34539908":"Stochastic algorithms for learning with incomplete data : an application to Bayesian networks /","265512024":"Context-specific independence in graphical log-linear models","2468777":"Strategies for Model Mixing in Generalized Linear Models","223874772":"Wavelet estimation by Bayesian thresholding and model selection","2121645":"Multiple Testing and Error Control in Gaussian Graphical Model Selection","44581158":"Learning Patient-Specific Predictive Models from Clinical Data","267954282":"Applications of the Mode Oriented Stochastic Search (MOSS) Algorithm for Discrete Multi-way Data to Genomewide Studies","40907235":"Bayesian hypothesis testing for psychologists: A tutorial on the Savage–Dickey method","220320437":"Learning Instance-Specific Predictive Models","7134200":"Low-Order Conditional Independence Graphs for Inferring Genetic Networks","255656104":"What Belongs Where? Variable Selection for Zero-Inflated Count Models with an Application to the Demand for Health Care","227375637":"Model Selection and Model Averaging","267570283":"Dynamic Model Averaging in Large Model Spaces Using Dynamic Occam\u0027s Window","229676586":"Bayesian Methods for Contingency Tables","220129920":"CFO Estimation in OFDM Systems under Timing and Channel Length Uncertainties with Model Averaging","225694418":"New Statistical models for long-range forecasting of southwest monsoon rainfall over India","46559589":"Forecast Accuracy and Economic Gains from Bayesian Model Averaging Using Time Varying Weights","221304469":"Concerning Bayesian Motion Segmentation, Model, Averaging, Matching and the Trifocal Tensor.","242220488":"Comprehensive Summaries of Uppsala Dissertations from the Faculty of Science and Technology 937 Bayesian Phylogenetics and the Evolution of Gall Wasps","228725263":"Accounting for input-model and input-parameter uncertainties in simulation","8070102":"Significance testing, interval estimation or Bayesian inference: Comments to \"Extracting a maximum of useful information from statistical research data\" by S. Sohlberg and G. Andersson","23218895":"Bayesian adaptive model selection for optimizing group sequential clinical trials","265604217":"Management of a periodic-review inventory system using Bayesian model averaging when new marketing efforts are made","257940719":"Monte Carlo Methods in Bayesian Statistics","238652808":"Bayesian Model Selection in Social Research","227784229":"Modelling fish growth: Multi-model inference as a better alternative to a priori using von Bertalanffy equation","7269336":"Comparative Performance of Bayesian and AIC-Based Measures of Phylogenetic Model Uncertainty","225514185":"Detecting pattern in biological stressor response relationships using model based cluster analysis","6631389":"A graphical approach to relatedness inference","232611428":"Accurate Model Selection of Relaxed Molecular Clocks in Bayesian Phylogenetics","281599858":"Urbanization and Agricultural Structural Adjustments: Some Lessons from European Cities","8649528":"Bayesian model averaging in EEG/MEG imaging","46381438":"Continuous Cotemporal Probabilistic Modeling of Systems Biology Networks from Sparse Data","48172385":"Discrimination for Two Way Models with Insurance Application","220838550":"Exploiting Association and Correlation Rules - Parameters for Improving the K2 Algorithm.","263080047":"Model uncertainty and aggregated default probabilities: New evidence from Austria","3933182":"Accounting for input model and parameter uncertainty in simulation","229728883":"Analysis of Regression in Game Theory Approach","2639852":"Bayesian Information Criterion for Censored Survival Models","265853980":"Electricity price forecasting: A review of the state-of-the-art with a look into the future","8018879":"Bayesian Model Averaging: Development of an Improved Multi-Class, Gene Selection and Classification Tool for Microarray Data","23690926":"In search of an environmental Kuznets curve in sulphur dioxide concentrations: A Bayesian model averaging approach","254451949":"Nowcasting Unemployment Rate in Turkey : Let\u0027s Ask Google","220301030":"Parametrizations and reference priors for multinomial decomposable graphical models","239065590":"Input Distribution Selection for Simulation Experiments: Accounting for Input Uncertainty","258450606":"Reply to comment by Ming Ye et al. on “Inverse groundwater modeling for hydraulic conductivity estimation using Bayesian model averaging and variance window”","222303888":"Construction of Bayesian Network Structures From Data: A Brief Survey and an Efficient Algorithm","11423614":"Combined Data, Bayesian Phylogenetics, and the Origin of the New Zealand Cicada Genera","5360515":"Incorporating model uncertainty in cost-effectiveness analysis: A Bayesian model averaging approach","263404641":"A Bayesian Approach for Model Selection in Fractionated Split Plot Experiments With Applications in Robust Parameter Design","228256323":"Assessing Predictive Content of the KOF Barometer in Real Time","263138419":"From logs to landscapes: Determining the scale of ecological processes affecting the incidence of a saproxylic beetle","2566138":"Bayesian Posterior Comprehension via Message from Monte Carlo","262317183":"A framework for uncertainty assessment in simulation models","222394014":"A hybrid methodology for learning belief networks: BENEDICT","254288075":"Some Contributions of Statistics to Environmental Epidemiology","23400065":"Finding factors influencing risk: comparing Bayesian stochastic search and standard variable selection methods applied to logistic regression models of cases and controls. Stat Med","2766796":"Bayes Factors and BIC: Comment on Weakliem","232534586":"Bayesian Inference","2419651":"Voles and Lemmings: Chaos and Uncertainty in Fluctuating Populations","252772601":"Bayesian Model Averaging: Theoretical Developments and Practical Applications","220344014":"Model combination by decomposition and aggregation","23788166":"Model-Averaged Benchmark Concentration Estimates for Continuous Response Data Arising from Epidemiological Studies","239931808":"Learning Bayesian Networks from Data: An Information-Theory BasedApproach","257507511":"Discussion: Time-threshold maps: Using information from wavelet reconstructions with all threshold values simultaneously","23184016":"Developments in statistical analysis in quantitative genetics","283037487":"Model Uncertainty and the Effect of Shall-Issue Right-to-Carry Laws on Crime","220320471":"Model Averaging for Prediction with Discrete Bayesian Networks.","8928127":"Mixture model for inferring susceptibility to mastitis in dairy cattle: A procedure for likelihood-based inference","220504796":"Bayesian Nonlinear Regression for the Air Pollution Effects on Daily Clinic Visits in Small Areas of Taiwan","1741792":"A conjugate prior for discrete hierarchical log-linear models","228763228":"Selecting amongst large classes of models","247651644":"Stochastic Search Model Selection for Restricted VAR Models"},"index":178}