{"abs":"Markov chain Monte Carlo (MCMC) methods are frequently used to approximately simulate high-dimensional, multimodal probability distributions. In adaptive MCMC methods, the transition kernel is changed \"on the fly\" in the hope to speed up convergence. We study interacting tempering, an adaptive MCMC algorithm based on interacting Markov chains, that can be seen as a simplified version of the equi-energy sampler. Using a coupling argument, we show that under easy to verify assumptions on the target distribution (on a finite space), the interacting tempering process rapidly forgets its starting distribution. The result applies, among others, to exponential random graph models, the Ising and Potts models (in mean field or on a bounded degree graph), as well as (Edwards-Anderson) Ising spin glasses. As a cautionary note, we also exhibit an example of a target distribution for which the interacting tempering process rapidly forgets its starting distribution, but takes an exponential number of steps (in the dimension of the state space) to converge to its limiting distribution. As a consequence, we argue that convergence diagnostics that are based on demonstrating that the process has forgotten its starting distribution might be of limited use for adaptive MCMC algorithms like interacting tempering.","title":"Forgetting the starting distribution in finite interacting tempering","id":262841099,"url":"https://www.researchgate.net/publication/262841099_Forgetting_the_starting_distribution_in_finite_interacting_tempering","names":["Winfried Barta"],"references":{"268670080":"Markov chains and mixing times. With a chapter on “Coupling from the past” by James G. Propp and David B. Wilson","38326862":"Honest Exploration of Intractable Probability Distributions Via Markov Chain Monte Carlo","241033178":"Sufficient Conditions for Torpid Mixing of Parallel and Simulated Tempering","49458431":"A tutorial on adaptive MCMC","51691460":"Convergence of the Equi-Energy Sampler and Its Application to the Ising Model.","51912840":"Nonasymptotic bounds on the estimation error of MCMC algorithms","38363224":"Inference From Iterative Simulation Using Multiple Sequences","51916417":"A central limit theorem for adaptive and interacting Markov chains","2249534":"Rates of Convergence for Data Augmentation on Finite Sample Spaces","2950515":"Torpid Mixing of Simulated Tempering on the Potts Model","243773529":"Markov chain Monte Carlo Maximum Likelihood","230569757":"On the Convergence Rates of Some Adaptive Markov Chain Monte Carlo\nAlgorithms","48207611":"Estimating and Understanding Exponential Random Graph Models","243104985":"Coupling and ergodicity of adaptive Markov chain Monte Carlo algorithms. J Appl Probab","268209561":"M Carlo Statistical Methods","221700496":"Convergence of adaptive and interacting Markov chain Monte Carlo\nalgorithms","221677405":"The Computational Hardness of Counting in Two-Spin Models on d-Regular Graphs","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","51916712":"On nonlinear Markov chain Monte Carlo","2855903":"Rates of Convergence for Gibbs Sampling for Variance Component Models","45892741":"A Survey of Statistical Network Models","257069419":"Finite Sample Properties of Adaptive Markov Chains via Curvature","252341360":"Adaptive Markov Chain Monte Carlo: Theory and Methods","2120858":"Equi-energy sampler with applications in statistical inference and statistical mechanics","265373482":"Inference from simulations and monitoring convergence","2113436":"Sufficient burn-in for Gibbs samplers for a hierarchical random effects model.The Annals of Statistics, 32(2):784-817","243657400":"Finite Markov Processes and Their Applications. Wiley, New York"},"citedIn":{},"index":182}