{"abs":"We develop a Bayesian approach for selecting the model which is the most supported by the data within a class of marginal models for categorical variables formulated through equality and/or inequality constraints on generalised logits (local, global, continuation or reverse continuation), generalised log-odds ratios and similar higher-order interactions. For each constrained model, the prior distribution of the model parameters is formulated following the encompassing prior approach. Then, model selection is performed by using Bayes factors which are estimated by an importance sampling method. The approach is illustrated through three applications involving some datasets, which also include explanatory variables. In connection with one of these examples, a sensitivity analysis to the prior specification is also considered.","title":"Bayesian inference through encompassing priors and importance samplingfor a class of marginal models for categorical data","id":221665118,"url":"https://www.researchgate.net/publication/221665118_Bayesian_inference_through_encompassing_priors_and_importance_samplingfor_a_class_of_marginal_models_for_categorical_data","names":["Francesco Bartolucci","Luisa Scaccia","Alessio Farcomeni","Computational Statistics \u0026 Data Analysis"],"references":{"265443411":"Total positivity. Volume I","254287017":"Measures, Models, and Graphical Displays in the Analysis of Cross-Classified Data","228388765":"An extended class of marginal link functions for modelling contingency tables by equality and inequality constraints","236853404":"A Unified Approach to Likelihood Inference on Stochastic Orderings in a Nonparametric Context","17147969":"The rabbit ureter in pregnancy and after norethynodrel-mestranol administration. A radiographic and histologic study.","265443477":"Testing precise hypotheses. With comments and a rejoinder by the authors","48909677":"Marginal Models for Dependent, Clustered, and Longitudinal Categorical Data","38365444":"Some Concepts of Dependence","236853521":"A class of regression models for multivariate categorical response","236853585":"A Class of Bivariate Distributions","222525520":"The Bayes factor for inequality and about equality constrained models","24153445":"Ockham’s Razor and Bayesian Analysis","264933916":"Categorical Data Analysis 2nd Edn","2641407":"Bayesian Selection of Log-Linear Models","38348766":"Maximum likelihood methods for a general class of log-linear models","265681805":"Categorical Data Analysis","243764509":"Marginal likelihood from the Gibbs output. J Am Stat Assoc","46168986":"Bayesian Evaluation of Inequality and Equality Constrained Hypotheses for Contingency Tables","236853445":"Positive Dependence Concepts for Ordinal Contingency Tables","4744020":"Positive Quadrant Dependence and Marginal Modeling in Two-Way Tables With Ordered Margins","2689012":"Bayesian Testing and Estimation of Association in a Two-Way Contingency Table","7378542":"Inequality Constrained Analysis of Variance: A Bayesian Approach.","38348328":"Marginal models for categorical data","265815481":"An Introduction to Rare Event Simulation","288923802":"Some aspects of weighted least squares analysis for longitudinal categorical data","4898850":"Testing for positive association in contingency tables with fixed margins","242609177":"Log-Linear Models and Logistic Regression","215446267":"Monte Carlo Strategies in Scientic Computing","239655397":"Bayes Factors for Linear and Log-linear Models with Vague Prior Information","265461823":"Theory of Probability, 3rd edn","231862079":"Some Tests of Significance, Treated by the Theory of Probability","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","271205402":"Bayes Factor","227053433":"An Introduction to Bayesian Evaluation of Informative Hypotheses","260161520":"Multivariate Logistic Models","222695093":"An encompassing prior generalization of the Savage–Dickey density ratio","264960318":"Marginal regression models for the analysis of positive association","227600165":"Bayesian model selection using encompassing priors","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","38363697":"[Testing Precise Hypotheses]: Rejoinder","263072663":"Generalized Linear Model","254212188":"Posterior predictive arguments in favor of the Bayes-Laplace prior as the consensus prior for binomial and multinomial parameters","243777276":"Testing a Point Null Hypothesis: The Irreconcilability of P Values and Evidence"},"citedIn":{"254440969":"Conjugate and Conditional Conjugate Bayesian Analysis of Discrete Graphical Models of Marginal Independence","276943066":"Bayesian inference about odds ratio structure in ordinal contingency tables","267341011":"A likelihood ratio test of quasi-independence for sparse two-way contingency tables","271663326":"Two Bayesian/frequentist challenges for categorical data analyses"},"index":186}