{"abs":"Many scientific and engineering problems require to perform Bayesian inferences in function spaces, in which the unknowns are of infinite dimension. In such problems, many standard Markov Chain Monte Carlo (MCMC) algorithms become arbitrary slow under the mesh refinement, which is referred to as being dimension dependent. In this work we develop an independence sampler based MCMC method for the infinite dimensional Bayesian inferences. We represent the proposal distribution as a mixture of a finite number of specially parametrized Gaussian measures. We show that under the chosen parametrization, the resulting MCMC algorithm is dimension independent. We also design an efficient adaptive algorithm to adjust the parameter values of the mixtures from the previous samples. Finally we provide numerical examples to demonstrate the efficiency and robustness of the proposed method, even for problems with multimodal posterior distributions.","title":"An adaptive independence sampler MCMC algorithm for infinite-dimensional bayesian inference","id":280946496,"url":"https://www.researchgate.net/publication/280946496_An_adaptive_independence_sampler_MCMC_algorithm_for_infinite-dimensional_bayesian_inference","names":["Zhe Feng","Jinglai li"],"references":{"239546247":"MCMC methods for diffusion bridges","221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","266941480":"An Introduction to Infinite-dimensional Analysis","43481745":"Finite Mixture Model","264623874":"Algorithms for Kullback-Leibler Approximation of Probability Measures in Infinite Dimensions","245481576":"Inverse problems: A Bayesian perspective","2430895":"Metropolized Independent Sampling with Comparisons to Rejection Sampling and Importance Sampling","49458431":"A tutorial on adaptive MCMC","258113906":"Kullback-Leibler Approximation for Probability Measures on Infinite Dimensional Spaces","267473441":"A Stochastic Newton MCMC Method for Large-Scale Statistical Inverse Problems with Application to Seismic Inversion","45866217":"Optimal scalings for local Metropolis--Hastings chains on nonproduct targets in high dimensions","261253638":"A Stable Manifold MCMC Method for High Dimensions","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","24111924":"An Adaptive Version for the Metropolis Adjusted Langevin Algorithm with a Truncated Drift","268997780":"Inverse Heat Conduction, Ill-Posed Problems","242912869":"Determining Surface Temperatures from Interior Observations","267124979":"Proposals which speed up function-space MCMC","38357609":"Markov Chains for Exploring Posterior Distributions","268227549":"Dimension-independent likelihood-informed MCMC","246546576":"MAP Estimators and Their Consistency in Bayesian Nonparametric Inverse Problems","43500657":"Adaptive independence samplers","228789130":"Examples of adaptive MCMC","4788962":"On an adaptive version of the Metropolis-Hastings algorithm with independent proposal distribution","256187243":"A Computational Framework for Infinite-Dimensional Bayesian Inverse Problems, Part II: Stochastic Newton MCMC with Application to Ice Sheet Flow Inverse Problems","257665515":"An adaptive approach to Langevin MCMC","256926306":"Adaptive Construction of Surrogates for the Bayesian Solution of Inverse Problems","260946552":"Likelihood-informed dimension reduction for nonlinear inverse problems","2930010":"Hierarchical Bayesian Models for Inverse Problems in Heat Conduction","251503179":"SPDE Limits of the Random Walk Metropolis Algorithm in High Dimensions","1906602":"Adaptive Independent Metropolis-Hastings by Fast Estimation of Mixtures of Normals","252341360":"Adaptive Markov Chain Monte Carlo: Theory and Methods","38322292":"An Adaptive Metropolis Algorithm","2504666":"Markov Chain Monte Carlo in Practice: A Roundtable Discussion"},"citedIn":{},"index":187}