{"abs":"In this paper, we consider theoretical and computational connections between six popular methods for variable subset selection in generalized linear models (GLM\u0027s). Under the conjugate priors developed by Chen and Ibrahim (2003) for the generalized linear model, we obtain closed form analytic relationships between the Bayes factor (posterior model probability), the Conditional Predictive Ordinate (CPO), the L measure, the Deviance Information Criterion (DIC), the Aikiake Information Criterion (AIC), and the Bayesian Information Criterion (BIC) in the case of the linear model. Moreover, we examine computational relationships in the model space for these Bayesian methods for an arbitrary GLM under conjugate priors as well as examine the performance of the conjugate priors of Chen and Ibrahim (2003) in Bayesian variable selection. Specifically, we show that once Markov chain Monte Carlo (MCMC) samples are obtained from the full model, the four Bayesian criteria can be simultaneously computed for all possible subset models in the model space. We illustrate our new methodology with a simulation study and a real dataset.","title":"Bayesian Variable Selection and Computation for Generalized Linear Models with Conjugate Priors","id":24422165,"url":"https://www.researchgate.net/publication/24422165_Bayesian_Variable_Selection_and_Computation_for_Generalized_Linear_Models_with_Conjugate_Priors","names":["Ming-Hui Chen","Lan Huang","Joseph G Ibrahim","Sungduk Kim","Bayesian Analysis"],"references":{"245583586":"Benchmark Estimation for Markov Chain Monte Carlo Samples","239655370":"Bayesian Model Choice: Asymptotics and Exact Calculations","228597350":"The Practical Implementation of Bayesian Model Selection","2311716":"The Variable Selection Problem","2896615":"Model uncertainty. Stat Sci","228750262":"Conjugate Priors for Generalized Linear Models","38348636":"On Monte Carlo Methods for Estimating Ratios of Normalizing Constants","38358303":"‘Estimating the Dimension of A Model,’","2492669":"Bayesian measures of model complexity and fit. J R Stat Soc Ser B Stat Methodol","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","2450683":"Bayesian CART model search","2509304":"Bayesian Variable Selection for Proportional Hazards Models","227665968":"Multivariate Bayesian variable selection and prediction. J Royal Stat Soc, Series B","4993256":"Bayes model averaging with selection of regressors. J R Stat Soc B","228519733":"Bayesian Variable Selection for Time Series Count Data","4771939":"Prior Elicitation, Variable Selection and Bayesian Computation for Logistic Regression Models","31373938":"Calibration and Empirical Bayes Variable Selection","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","228720464":"Warp Bridge Sampling","5207293":"Bayesian criterion based model assessment for categorical data","243775157":"Simulating Ratios of Normalizing Constants via a Simple Identity: A Theoretical Exploration","2612499":"Bayesian Model Averaging for Linear Regression Models","222525109":"Prior elicitation for model selection an estimation in generalized linear mixed models","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","243768830":"Computing Bayes Factors by Combining Simulation and Asymptotic Approximations","222306169":"Nonparametric Regression using Bayesian Variable Selection"},"citedIn":{"259163219":"Partially linear censored regression models using heavy-tailed distributions: A Bayesian approach","274012529":"Personalized Screening Intervals for Biomarkers using Joint Models for Longitudinal and Survival Data","279515661":"Identifying Operational Design Factors that Influence GAGD Process Performance in a Heterogeneous Oil Sandstone Reservoir Using Bayesian Model Averaging","263428150":"Model averaging estimation of generalized linear models with imputed covariates","23301323":"Bayesian variable selection for the Cox regression model with missing covariates","274094335":"Mixtures of g-priors in Generalized Linear Models","45101018":"Health-Related Quality of Life is Reduced in Pediatric Multiple Sclerosis","248398244":"An Integrative Framework for Bayesian Variable Selection with Informative Priors for Identifying Genes and Pathways","51073248":"Approximate Predictive Densities and Their Applications in Generalized Linear Models","51786843":"The Spatial Pattern of Suicide in the US in Relation to Deprivation, Fragmentation and Rurality","236039004":"A Bayesian Approach to Pathway Analysis by Integrating Gene-Gene Functional Directions and Microarray Data","263679128":"Bayesian Subset Modeling for High-Dimensional Generalized Linear Models","280773293":"Variations of the Power-Conditional-Expected-Posterior Prior for Bayesian Variable Selection in Generalized Linear Models","45933889":"Hyper-g Priors for Generalized Linear Models","224879193":"Use of multiple sources and capture-recapture method to estimate the frequency of hospitalizations related to drug abuse"},"index":189}