{"abs":"The research agendas of psychologists and economists now have several overlaps, with behavioural economics providing theoretical and experimental study of the relationship between behaviour and choice, and hedonic psychology discussing appropriate measures of outcomes of choice in terms of overall utility or life satisfaction. Here we model the relationship between values (understood as principles guiding behaviour), choices and their final outcomes in terms of life satisfaction, and use data from the BHPS to assess whether our ideas on what is important in life (individual values) are broadly connected to what we experience as important in our lives (life satisfaction).","title":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","id":4772531,"url":"https://www.researchgate.net/publication/4772531_Analyses_of_infectious_disease_data_from_household_outbreaks_by_Markov_Chain_Monte_Carlo_methods","names":["Philip D. O\u0027Neill","David J. Balding","Niels G. Becker","Mervi Eerola","Denis Mollison","Applied Statistics"],"references":{"14540063":"Estimability and Interpretation of Vaccine Efficacy Using Frailty Mixing Models","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","229100911":"Markov Chain Monte Carlo in Pratice","31313973":"Estimating parameters in stochastic compartmental models using Markov Chain methods","16115806":"Household and Community Transmission Parameters from Final Distributions of Infections in Households","46947939":"Tools for Statistical Inference: Methods For the Exploration of Posterior Distributions and Likelihood Functions","4771353":"Bayesian inference for partially observed stochastic epidemics","19148117":"The Tecumseh study of illness XIII. Influenza infection and disease, 1076–1981","21414239":"A Generalized Stochastic Model for the Analysis of Infectious Disease Final Size Data","243774781":"Monte Carlo methods of inference for implicit statistical models","238523240":"A Monte Carlo Implementation of the EM Algorithm and the Poor Man\u0027s Data Augmentation Algorithm","270255012":"The Analysis of Infectious Disease Data.","265373678":"Elements of Simulation"},"citedIn":{"11073832":"A tutorial introduction to Bayesian inference for stochastic epidemic models using Markov chain Monte Carlo Methods","6296546":"Confronting models with data","259555963":"Statistical inference and computational efficiency for spatial infectious disease models with plantation data","259635839":"Exact Bayesian inference via data augmentation","259119094":"Simulation-based Bayesian inference for epidemic models","224043345":"Stochastic Epidemic Models and Their Statistical Analysis, Volume 151 of Lecture Notes in Statistics","8941446":"Estimating heterogeneous transmission with multiple infectives using MCMC methods","50851336":"Networks and the Epidemiology of Infectious Disease","51031324":"Modeling Competing Infectious Pathogens From a Bayesian Perspective: Application to Influenza Studies With Incomplete Laboratory Results","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","10601016":"Estimating the immunity coverage required to prevent epidemics in a community of households","4746449":"Estimating Vaccine Efficacy From Secondary Attack Rates","256451925":"Dynamics of Shigellosis Epidemics: Estimating Individual-Level Transmission and Reporting Rates From National Epidemiologic Data Sets","282524235":"A unified framework for multilevel uncertainty quantification in Bayesian inverse problems","229622064":"Communicable Diseases","270647102":"Bayesian History Matching of Complex Infectious Disease Models Using Emulation: A Tutorial and a Case Study on HIV in Uganda","45867418":"Statistical inference for stochastic epidemic models with three levels","276259541":"Bayesian Multilevel Model Calibration for Inverse Problems Under Uncertainty with Perfect Data","4920047":"Exact Bayesian Inference and Model Selection for Stochastic Models of Epidemics Among a Community of Households","229884054":"Inference for Epidemics with Three Levels of Mixing: Methodology and Application to a Measles Outbreak","2334468":"Perfect Simulation for Reed-Frost Epidemic Models","262030260":"Ergodicity of Approximate MCMC Chains with Applications to Large Data Sets","227605819":"Design and evaluation of prophylactic interventions using infectious disease incidence data from close contact groups","261143358":"How big is an outbreak likely to be? Methods for epidemic final-size calculation","7747929":"New approaches to quantifying the spread of infection","288179485":"Pseudo-Marginal MCMC for Parameter Estimation in α-Stable Distributions**The first author acknowledges partial funding from EPSRC-DTG- 2013/EU, while the second and third authors were supported by the EPSRC BTaRoT project EP/K020153/1; the third author was also funded by the Learning of complex dynamical systems project (Contract number: 637-2014-466) from the Swedish Research Council.","261702440":"Modelling reporting delays for outbreak detection in infectious disease data","7917514":"Bayesian model choice and infection route modelling in an outbreak of Norovirus","263685123":"Bayesian modeling of temporal properties of infectious disease in a college student population","269282616":"Analysis of Household Data on Influenza Epidemic with Bayesian Hierarchical Model.","4734205":"Bayesian Inference for a Stochastic Epidemic Model with Uncertain Numbers of Susceptibles of Several Types","51224890":"Statistical inference for stochastic simulation models? Theory and application","227335093":"Efficient likelihood-free Bayesian Computation for household epidemics","4789107":"Bayesian inference for epidemics with two levels of mixing","4993392":"A hierarchical model for space-time surveillance data on meningococcal disease","23171806":"A Data-Augmentation Method for Infectious Disease Incidence Data from Close Contact Groups","38058235":"ABC: A useful Bayesian tool for the analysis of population data","38066182":"Using Dynamic Stochastic Modelling to Estimate Population Risk Factors in Infectious Disease: The Example of FIV in 15 Cat Populations","233889203":"Estimating functions and the generalized method of moments","23180326":"Modeling Infectious Diseases in Humans and Animals","38058627":"Toni T, Stumpf MPH.. Simulation-based model selection for dynamical systems in systems and population biology. Bioinformatics 26: 104-110","6893985":"Estimating Vaccine Efficacy from Outbreak Size Household Data in the Presence of Heterogeneous Transmission Probabilities","9022403":"Estimating Vaccine Effects on Transmission of Infection from Household Outbreak Data","264956806":"Determinants of Influenza Transmission in South East Asia: Insights from a Household Cohort Study in Vietnam","224050967":"A Hybrid EM and Monte Carlo EM Algorithm and Its Application to Analysis of Transmission of Infectious Diseases","7296544":"Predicting case numbers during infectious disease outbreaks when some cases are undiagnosed","228739696":"Bayesian Inference for Irreducible Diffusion Processes Using the Pseudo-Marginal Approach","265076505":"Modern Computational Statistics: Alternatives to MCMC","51606604":"Transmissibility of Seasonal and Pandemic Influenza in a Cohort of Households in Hong Kong in 2009","284360082":"Household Transmission of Influenza Virus","267467410":"Stochastic Multitype Epidemics in a Community of Households: Estimation of threshold parameter R* and secure vaccination coverage","46556834":"Inference in Epidemic Models without Likelihoods","51562103":"Methods to infer transmission risk factors in complex outbreak data","4993322":"Bayesian inference for stochastic multitype epidemics in structured populations via random graphs","49799696":"Role of social networks in shaping disease transmission during a community outbreak of 2009 H1N1 pandemic influenza","223950001":"Estimation of distance related probability of animal movements between holdings and implications for disease spread modeling","46109271":"Introduction and snapshot review: Relating infectious disease transmission models to data","227696505":"Bayesian Inference for Stochastic Epidemics in Populations with Random Social Structure","7667103":"Use of Strain Typing Data to Estimate Bacterial Transmission Rates in Healthcare Settings •","6893979":"Overview of Vaccine Field Studies: Types of Effects and Designs","243103503":"Investigating Heterogeneity in Pneumococcal Transmission","26710624":"Bayesian inference for stochastic multitype epidemics in structured populations using sample data","51249273":"The correlation between infectivity and incubation period of measles, estimated from households with two cases","5136948":"Empirical Modeling of Deprivation Contagion among Social Exclusion Dimensions (Using MCMC Methods)"},"index":19}