{"abs":"We introduce a Bayesian approach to model assessment in the class of graphical vector autoregressive processes. As a result of the very large number of model structures that may be considered, simulation-based inference, such as Markov chain Monte Carlo, is not feasible. Therefore, we derive an approximate joint posterior distribution of the number of lags in the autoregression and the causality structure represented by graphs using a fractional Bayes approach. Some properties of the approximation are derived and our approach is illustrated on a four-dimensional macroeconomic system and five-dimensional air pollution data. Copyright 2005 Blackwell Publishing Ltd.","title":"A Bayesian Approach to Modelling Graphical Vector Autoregressions","id":4773926,"url":"https://www.researchgate.net/publication/4773926_A_Bayesian_Approach_to_Modelling_Graphical_Vector_Autoregressions","names":["Mattias Villani","Jukka Corander","Journal of Time Series Analysis"],"references":{"265399697":"Causality and graphical models in time series analysis","4960201":"Bayesian Prediction with Cointegrated Vector Autoregressions","245622497":"Causality and Graphical Models for time series","4814477":"Macroeconomis and Reality","226015485":"Graphical interaction models for multivariate time series1","222710144":"Granger causality and path diagrams for multivariate time series","2642415":"Decomposable Graphical Gaussian Model Determination","24065320":"Properties of intrinsic and fractional Bayes factors","24056230":"Graphical models in applied multivariate statistics","24063396":"Bayesian inference for graphical factor analysis models","254287396":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","38359812":"Hyper Markov Laws in the Statistical Analysis of Decomposable Graphical Models","229766434":"Fractional Bayesian Lag Length Inference in Multivariate Autoregressive Processes","4791263":"Bayesian assessment of dimensionality in reduced rank regression","38358303":"‘Estimating the Dimension of A Model,’","37404453":"The New Introduction to Multiple Time Series Analysis","243658661":"Testing for Common Trend","4894383":"Granger, C.W.J.: Investigating Causal Relations by Econometric Models and Cross-spectral Methods. Econometrica 37(3), 424-438","227458539":"Monetary Theory and Policy, 2nd Edition","2867469":"Bayesian Graphical Models for Discrete Data","4900525":"Money, Income, Causality","236587389":"Graphical Markov Models","4725410":"Forecasting With Bayesian Vector Autoregressions-Five Years of Experience","247833455":"The Determination of the Order of an Autoregression","240967280":"MCMC model determination for discrete graphical models","4815591":"Large Sample Properties of Posterior Densities, Bayesian Information Criterion and the Likelihood Principle in Nonstationary Time Series Models","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","3318981":"Learning Graphical Models for Stationary Time Series","254283039":"A Bayes Approach for Combining Correlated Estimates","38357438":"Correction: Hyper Markov Laws in the Statistical Analysis of Decomposable Graphical Models","243777276":"Testing a Point Null Hypothesis: The Irreconcilability of P Values and Evidence","222422524":"Bayesian graphical model determination using decision theory","23564570":"Likelihood-based Inference in Cointegrated Vector Autoregressive Models","51999462":"Graphical Models in Applied Multivariate Statistics. John Wiley, Chichester"},"citedIn":{"272479976":"Bayesian Graphical Models for STructural Vector Autoregressive Processes","272480074":"Sparse Graphical Vector Autoregression: A Bayesian Approach","269987999":"Bayesian Selection of Systemic Risk Networks","251344663":"Bayesian Graphical Models for STructural Vector Autoregressive Processes","277327259":"The Econometrics of Networks: A Review","220343532":"Bayesian learning of graphical vector autoregressions with unequal lag-lengths","228017816":"Graphical Modeling of Dynamic Relationships in Multivariate Time Series"},"index":190}