{"abs":"Conditional expectation is a simulation procedure that can be used to estimate the reliability of structures. It involves selecting an important random variable, using Monte Carlo simulation to generate sets of sample outcomes of the remaining “unimportant” random variables, estimating the conditional failure probability for each set of sample outcomes and using the average conditional failure probability as the estimate of the failure probability. This direct conditional expectation approach can be extremely effective, but only if the selected important random variable is much more important than the combined effect of the remaining random variables.","title":"Adaptive hybrid conditional expectation approaches for reliability estimation","id":223891815,"url":"https://www.researchgate.net/publication/223891815_Adaptive_hybrid_conditional_expectation_approaches_for_reliability_estimation","names":["Ashish Karamchandani","C. Allin Cornell","Structural Safety"],"references":{},"citedIn":{"223207565":"Structural reliability methods for seismic safety assessment: A review","223337455":"Corrosion fatigue and multiple site damage reliability analysis","245424642":"Adaptive Monte Carlo Simulation for Time-Variant Reliability Analysis of Brittle Structures","51500595":"Whole-Embryo Modeling of Early Segmentation in Drosophila Identifies Robust and Fragile Expression Domains","223700913":"Ductile structural system reliability analysis using adaptive importance sampling","223059021":"Adaptive simulation for system reliability analysis of large structures","258176778":"Reliability sensitivity based on first-order reliability method","277877115":"Primary and deformation-induced high and low cycle fatigue reliability of infrastructure with updating through non-destructive inspection.","222763114":"Time-dependent system reliability analysis by adaptive importance sampling","222165872":"Reliability analysis—A review and some perspectives","282381850":"Research progress of wind reliability of high-rise buildings","239390836":"Reliability Estimation with Time-Variant Loads and Resistances","268464913":"Probabilistic analysis of creep-fatigue failure","30859175":"Sequential Linear Programming Coordination Strategy for Deterministic and Probabilistic Analytical Target Cascading.","229353336":"A non-intrusive method to add finite element-based random variables to a probabilistic design code","269978852":"A Study of System Reliability Analysis Using Linear Programming","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","241129290":"Application of the Generalized Conditional Expectation Method for Enhancing a Probabilistic Design Fatigue Code","223341977":"Reliability estimation of complex numerical problems using modified conditional expectation method","269207667":"Aircraft structures reliability under corrosion fatigue","221942784":"A fast approximate method for parameter sensitivity estimation in Monte Carlo structural reliability","264177381":"Structural reliability estimation based on quasi ideal importance sampling simulation","222475741":"Structural reliability analysis of elastic-plastic structures using neural networks and Monte Carlo simulation. Computer Methods in Applied Mechanics and Engineering 136: 145-163"},"index":195}