{"abs":"An importance sampling technique is described which is based on theoretical considerations about the structure of multivariate integrands in domains having small probability content. The method is formulated in the original variable space. Sampling densities are derived for a variety of practical conditions: a single point of maximum loglikelihood; several points; points located at the intersect of several failure surfaces; and, bounded variables. Sampling in the safe domain is avoided and extensive use is made of noncartesian as well as surface coordinates. The parameters of the importance sampling densities are taylored in such a way as to yield asymptotic minimum variance unbiased estimators. The quality and the efficiency of the method improves as the failure probability decreases. Parameter sensitivies are easily computed owing to the use of local surface coordinates. Several examples are provided.","title":"Asymptotic importance sampling","id":256421487,"url":"https://www.researchgate.net/publication/256421487_Asymptotic_importance_sampling","names":["Marc A. Maes","Karl Breitung","Debbie J. Dupuis","Structural Safety"],"references":{"222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","222035565":"Method of structural systems reliability","23630449":"Asymptotic approximations for multivariate integrals with an application to multinormal probabilities","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","222945716":"Optimization algorithms for structural reliability"},"citedIn":{"223207565":"Structural reliability methods for seismic safety assessment: A review","257774300":"A new adaptive importance sampling Monte Carlo Method for structural reliability","3593521":"Computational procedures in structural reliability","245077778":"Reliability Based Stability Analysis for Actively Controlled Structures","239399502":"Reliability-based casing design","241416232":"System reliability methods using advanced sampling techniques","279357997":"Probabilistic Structural Mechanics: Advances in Structural Reliability Methods","222165872":"Reliability analysis—A review and some perspectives","222515596":"Reliability analysis of randomly vibrating structures with parameter uncertainties","251151014":"Safety Assessment","226138596":"A study using Monte Carlo Simulation for failure probability calculation in Reliability-Based Optimization","222933783":"Asymptotic sampling for high-dimensional reliability analysis","228887364":"Efficient conditional failure analysis: application to an aircraft engine component","245285374":"Ignorance Factors Using Model Expansion","251083414":"A robust iterative algorithm for structural reliability analysis","222605794":"Importance sampling for first passage problems of nonlinear structures","237107078":"On Efficient and Accurate Computational Methods for Structural Reliability","277877115":"Primary and deformation-induced high and low cycle fatigue reliability of infrastructure with updating through non-destructive inspection.","266493577":"Monte Carlo simulation in reliability-based optimization applied to multidisciplinary system design","221676250":"Meta-models for Structural Reliability and Uncertainty Quantification","271292103":"Non-Gradient–Based Algorithm for Structural Reliability Analysis","223287356":"Filtered importance sampling with support vector margin: A powerful method for structural reliability analysis","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","254221394":"Assessing the safety of existing structures: Reliability based assessment framework, examples and application","236536418":"Reliability-Based Tubing and Casing Design: Principles and Approach","282961889":"The Design Space Root Finding Method for Efficient Risk Optimization by Simulation"},"index":196}