{"abs":"Sharing data might bring the risk of disclosing the sensitive knowledge in it. Usually, the data owner may choose to sanitize data by modifying some items in it to hide sensitive knowledge prior to sharing. This paper focuses on protecting sensitive knowledge in the form of frequent itemsets by data sanitization. The sanitization process may result in side effects, i.e., the data distortion and the damage to the non-sensitive frequent itemsets. How to minimize these side effects is a challenging problem faced by the research community. Actually, there is a trade-off when trying to minimize both side effects simultaneously. In view of this, we propose a data sanitization method based on evolutionary multi-objective optimization (EMO). This method can hide specified sensitive itemsets completely while minimizing the accompanying side effects. Experiments on real datasets show that the proposed approach is very effective in performing the hiding task with fewer damage to the original data and non-sensitive knowledge. Copyright © 2015 The Institute of Electronics, Information and Communication Engineers.","title":"Manage the Tradeoff in Data Sanitization","id":282833842,"url":"https://www.researchgate.net/publication/282833842_Manage_the_Tradeoff_in_Data_Sanitization","names":["Peng Cheng","Chun-Wei Jerry Lin","Jeng-Shyang PAN","Ivan LEE","IEICE Transactions on Information and Systems"],"references":{"220696375":"Association Rule Hiding for Data Mining","220072719":"Association Rule Hiding","239939310":"Using TF-IDF to hide sensitive itemsets","221614982":"An integer programming approach for frequent itemset hiding","220197145":"Amiri, A.: Dare to share: Protecting sensitive knowledge with data sanitization. Decis. Support Syst. 43(1), 181-191","2605569":"PISA --- A Platform and Programming Language Independent Interface for Search Algorithms","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","220079699":"Maximizing Accuracy of Shared Databases when Concealing Sensitive Patterns","3845061":"Disclosure Limitation of Sensitive Rules"},"citedIn":{},"index":199}