{"abs":"A mean extrapolation method is proposed to estimate the high reliability with acceptable computational cost. In this method, the high reliability index is evaluated by extrapolating the obtained low reliability indexes due to the fact that the lower reliability indexes can be estimated with less samples. Eventually the computational cost for calculating the high reliability index is alleviated markedly. Two kinds of extrapolation models are presented on the asymptotic behavior of the failure probability with respect to the standard deviation of the random variables in the independent and identically distributed Gaussian space. The coefficients of all extrapolation models are calculated by the least-square fit method using the obtained lower reliability indexes. Then, the mean of all the extrapolation models is selected to calculate the high reliability index. The computational cost involved in the original extrapolation method is still not afforded due to the fact that several lower reliability indexes are required. In order to overcome this difficulty, a technique reusing the samples is also introduced. Several examples demonstrate the proposed method. The results show that no single extrapolation model is preferable. However, the mean extrapolation model is always stable and is very close to the exact result. Only tens of thousands of samples are required for obtaining a result with reasonable accuracy for high reliability index.","title":"A mean extrapolation technique for high reliability analysis","id":274587069,"url":"https://www.researchgate.net/publication/274587069_A_mean_extrapolation_technique_for_high_reliability_analysis","names":["Zhangchun Tang","Lu Zhenzhou","Pan Wang","Zhang Feng","Applied Mathematics and Computation"],"references":{"245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","228573534":"A univariate approximation at most probable point for higer-order reliability analysis","239373191":"Application of low-discrepancy sampling method in structural reliability analysis","235622467":"Quantitative Risk Management: Concepts, Techniques, Tools","226892810":"Bayesian reliability-based design optimization using eigenvector dimension reduction (EDR) method","222029239":"Multiple tail median approach for high reliability estimation","223592988":"A new look at the response surface approach for reliability analysis","239433685":"A saddlepoint approximation based simulation method for uncertainty analysis","223711623":"Adaptive radial-based importance sampling method for structural reliability","222933783":"Asymptotic sampling for high-dimensional reliability analysis","275188793":"Asymptotic Approximations for Multinormal Integrals","248560911":"Importance sampling in structural system","227093096":"Ensemble of surrogates","225467347":"Eigenvector dimension reduction (EDR) method for sensitivity-free probability analysis","246909972":"Multivariate distribution models with prescribed marginals and covariances","222400805":"Comparison of finite element reliability methods","238184598":"Uncertainty Analysis by Dimension Reduction Integration and Saddlepoint Approximations","241080889":"Applications of asymptotic sampling on high dimensional structural dynamic problems","222837988":"Decomposition methods for structural reliability analysis","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","222553900":"Structural reliability analysis by univariate decomposition and numerical integration","223284991":"Effect of response surface parameter variation on structural reliability estimates","268245196":"An Introduction to Copulas","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","225805894":"Asymptotic approximations for multinormal domain and surface integrals","236660847":"Exact and Invariant Second Moment Code Format","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","226266569":"Reliability-based robust design optimization using the eigenvector dimension reduction (EDR) method","222013260":"An efficient numerical solution to the multinormal integral","256476402":"Model Selection And Multimodel Inference: A Practical Information- Theoretic Approach"},"citedIn":{},"index":203}