{"abs":"Multi-objective optimization has become mainstream for solving several real-world problems which are naturally posed as Multi-objective optimization problems (MOPs) in all fields of engineering and science. Usually, MOPs consist of more than two conflicting objective functions which demand trade-off solutions. Multi-objective evolutionary algorithms (MOEAs) are extremely useful and well-suited for solving MOPs due to their population based nature. MOEAs evolve its population of solutions in a natural way and search for approximate solutions in single simulation run unlike traditional methods. These algorithms make use of various intrinsic search operators in an efficient manner. In this paper, we experimentally study the impact of multiple crossovers in multi-objective evolutionary algorithm based on decomposition (MOEA/D) framework and evaluate its performance over test instances of 2009 IEEE congress on evolutionary computation (CEC’09) developed for MOEAs competition. Based on our experiments, we observe that variation operators are the main source to improve the algorithmic performance of MOEA/D for dealing with CEC’09 complicated test problems.","title":"IMPACT ANALYSIS OF CROSSOVERS IN MULTIOBJECTIVE EVOLUTIONARY ALGORITHM","id":287330461,"url":"https://www.researchgate.net/publication/287330461_IMPACT_ANALYSIS_OF_CROSSOVERS_IN_MULTIOBJECTIVE_EVOLUTIONARY_ALGORITHM","names":["Wali Khan Mashwani","Abdel Salhi","Muhammad Asif Jan","Rasheeda Adeeb Khanum","M. Sulaiman"],"references":{"268613888":"Spanning Trees and Optimization Problems","3949503":"Scalable multi-objective optimization test problems","239023800":"Multi-Objective function optimization using non-dominated sorting genetic algorithms, Evolutionary Computation, 2(3):221-248","3418685":"An empirical study on the synergy of multiple crossover operators","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","3421242":"A Multi-objective Genetic Local Search Algorithm and Its Application to Flowshop Scheduling","2333106":"Simulated Binary Crossover for Continuous Search Space","262167473":"Comprehensive Survey of the Hybrid Evolutionary Algorithms","3418912":"A Multiobjective Optimization-Based Evolutionary Algorithm for Constrained Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","257635963":"A decomposition-based hybrid multiobjective evolutionary algorithm with dynamic resource allocation","220741513":"An adaptive pursuit strategy for allocating operator probabilities","226918823":"The normalized normal constraint method for generating the Pareto frontier","221160971":"A multimethod search approach based on adaptive generations level","2460803":"Normal-Boundary Intersection: A New Method for Generating the Pareto Surface in Nonlinear Multicriteria Optimization Problems","4201447":"A population-based, steady-state procedure for real-parameter optimization","216300483":"Multiobjective Optimization. Principles and Case Studies","260498593":"A Survey on Multiobjective Evolutionary Algorithms for the Solution of the Portfolio Optimization Problem and Other Finance and Economics Applications","263298329":"Enhanced versions of Differential Evolution: State-of-the-art Survey,","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","216457303":"Indicator-Based Selection in Multiobjective Search","2263702":"Adapting Crossover in Evolutionary Algorithms","251403850":"A Real-coded Genetic Algorithm using the Unimodal Normal Distribution Crossover","4307703":"Applications of multi-objective evolutionary algorithms in economics and finance: A survey","224472028":"The performance of a new version of MOEA/D on CEC09 unconstrained MOP test instances","216300453":"Evolutionary Algorithms for Solving Multi-Objective Problems SE – Genetic and Evolutionary Computation","225123240":"Multiobjective optimization for crash safety design of vehicles using stepwise regression model","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","201976655":"Real-Coded Genetic Algorithms and Interval-Schema","220885613":"A Real Coded Genetic Algorithm for Function Optimization Using Unimodal Normal Distributed Crossover.","260622144":"Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","3756011":"A study on the effect of multi-parent recombination in real coded genetic algorithms","243776468":"Multi-parent recombination with simplex crossover in real-coded genetic algorithms","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","11019773":"A Computationally Efficient Evolutionary Algorithm for Real-Parameter Optimization","267252411":"Comparison of computational efficiency of MOEA\\D and NSGA-II for passive vehicle suspension optimization","242823982":"Decomposition-Based Memetic Algorithm for Multi-Objective Capacitated Arc Routing Problem","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","203189444":"Massively multi-topology sizing of analog integrated circuits","220701951":"Multi-parent Recombination in Genetic Algorithms with Search Space Boundary Extension by Mirroring","261977668":"Multi-Objective Optimization Using Evolutionary Algorithms by Kalyanmoy Deb","221032054":"Multi-Objective Genetic Local Search Algorithm.","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","220743499":"Simultaneous Use of Different Scalarizing Functions in MOEA/D","13267246":"Adapting Operator Settings in Genetic Algorithms","220689858":"New Optimization Techniques in Engineering","226084630":"A New PSO Algorithm with Crossover Operator for Global Optimization Problems","285237745":"DE-a simple and efficient heuristic for global optimization over continuous space","267198495":"Simulated Binary Crossover with Lognormal Distribution","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II"},"citedIn":{"288838659":"Enhanced Version of Multi-algorithm Genetically Adaptive for Multiobjective optimization"},"index":208}