{"abs":"The objective of reliability sensitivity analysis is to determine input variables that mostly contribute to the variability of the failure probability. In this paper, we study a recently introduced method for the reliability sensitivity analysis based on a perturbation of the original probability distribution of the input variables. The objective is to determine the most influential input variables and to analyze their impact on the failure probability. We propose a moment independent sensitivity measure that is based on a perturbation of the original probability density independently for each input variable. The variables providing the highest variation of the original failure probability are settled to be more influential. These variables will need a proper characterization in terms of uncertainty. The method is intended to work in applications involving a computationally expensive simulation code for evaluating the failure probability such as the CO2 storage risk analysis. An application of the method to a synthetic CO2 storage case study is provided together with some analytical examples","title":"Reliability sensitivity analysis based on probability distribution perturbation with application to CO2 storage","id":258819013,"url":"https://www.researchgate.net/publication/258819013_Reliability_sensitivity_analysis_based_on_probability_distribution_perturbation_with_application_to_CO2_storage","names":["Ekaterina Sergienko","Paul Lemaître","Aurélie Arnaud","Daniel Busby","Fabrice Gamboa"],"references":{"216301381":"The Design and Analysis Computer Experiments","267440561":"Information and Exponential Families in Statistical Theory","278715449":"Assessing reservoir performance risk in CO2 storage projects","246047425":"Elements of Information Theory Wiley Series in Telecommunication","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","47754260":"Moment Independent Importance Measures: New Results and Analytical Test Cases","229284154":"Estimates and confidence intervals for importance sampling sensitivity analysis","222779702":"Directional simulation in Gaussian processes","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","220674608":"Influence of input PDF parameters of a model on a failure probability estimation","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand","231582448":"Density modification based reliability sensitivity analysis","241788694":"Process for Tracking the Evolving Perception of Risk During CO2 Storage Projects","248560911":"Importance sampling in structural system"},"citedIn":{},"index":209}