{"abs":"We propose a generic Markov Chain Monte Carlo (MCMC) algorithm to speed up computations for datasets with many observations. A key feature of our approach is the use of the highly efficient difference estimator from the survey sampling literature to estimate the log-likelihood accurately using only a small fraction of the data. Our algorithm improves on the $O(n)$ complexity of regular MCMC by operating over local data clusters instead of the full sample when computing the likelihood. The likelihood estimate is used in a Pseudo-marginal framework to sample from a perturbed posterior which is within $O(m^{-1/2})$ of the true posterior, where $m$ is the subsample size. The method is applied to a logistic regression model to predict firm bankruptcy for a large data set. We document a significant speed up in comparison to the standard MCMC on the full dataset.","title":"Scalable MCMC for Large Data Problems using Data Subsampling and the Difference Estimator","id":280033955,"url":"https://www.researchgate.net/publication/280033955_Scalable_MCMC_for_Large_Data_Problems_using_Data_Subsampling_and_the_Difference_Estimator","names":["Matias Quiroz","Mattias Villani","Robert Kohn"],"references":{"239578406":"Algorithms for Computing the Sample Variance: Analysis and Recommendations","263012108":"Accelerating Metropolis-Hastings algorithms: Delayed acceptance with prefetching","236235190":"Austerity in MCMC Land: Cutting the Metropolis-Hastings Budget","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","261700795":"Speeding Up MCMC by Efficient Data Subsampling","38368077":"On the Theory of Sampling from Finite Populations","268524871":"Bayesian Big Data Classification: A Review with Complements","261065671":"Firefly Monte Carlo: Exact MCMC with subsets of data","235961592":"Generalised Linear Model","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","232062873":"Efficient implementation of Markov chain Monte Carlo when using an unbiased likelihood estimator","265907991":"Scalable and Robust Bayesian Inference via the Median Posterior","257146976":"On some properties of Markov chain Monte Carlo simulation methods based on the particle filter","220851866":"MapReduce: Simplified Data Processing on Large Clusters","44816799":"Moel Assisted Survey Sampling","46154966":"CODA: Convergence diagnosis and output analysis for MCMC","258631741":"Asymptotically Exact, Embarrassingly Parallel MCMC","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","260957174":"Importance Sampling Squared for Bayesian Inference in Latent Variable Models"},"citedIn":{},"index":210}