{"abs":"An asymptotic approximation is developed for evaluating the probability integrals which arise in the determination of the reliability and response moments of uncertain dynamic systems subject to stochastic excitation. The method is applicable when the probabilities of failure or response moments conditional on the system parameters are available, and the effect of the uncertainty in the system parameters is to be investigated. In particular, a simple analytical formula for the probability of failure of the system is derived and compared to some existing approximations, including an asymptotic approximation based on SORM methods. Simple analytical formulas are also derived for the sensitivity of the failure probability and response moments to variations in parameters of interest. Conditions for which the proposed asymptotic expansion is expected to be accurate are presented. Since numerical integration is only computationally feasible for investigating the accuracy of the proposed method for a small number of uncertain system parameters, simulation techniques are also used. A simple importance sampling method is shown to converge much more rapidly than straightforward Monte-Carlo simluation. Simple structures subjected to white noise stochastic excitation axe used to illustrate the accuracy of the proposed analytical approximation. Results from the computationally efficient perturbation method are also included for comparison. The results show that the asymptotic method gives acceptable approximations, even for systems with relatively large uncertainty, and in most cases, it outperforms the perturbation method.","title":"Asymptotic Expansions for Reliabilities and Moments of Uncertain Dynamic Systems","id":28784873,"url":"https://www.researchgate.net/publication/28784873_Asymptotic_Expansions_for_Reliabilities_and_Moments_of_Uncertain_Dynamic_Systems","names":["Costas Papadimitriou","James L. Beck","Lambros S. Katafygiotis"],"references":{},"citedIn":{"271882032":"Crack Detection of Thin Plate Structures Utilizing Measured Vibration","251768968":"Bayesian analysis of the Phase II IASC-ASCE Structural Health Monitoring experimetnal benchmark data","250693053":"Reliability Estimation for Dynamical Systems Subject to Stochastic Excitation using Subset Simulation with Splitting","222395601":"Updating robust reliability using structural test data. Probabilist Eng Mech","229913442":"Probabilistic control for the Active Mass Driver benchmark structural model","223106779":"Important sampling in high dimensions","227546376":"Reliability-based control optimization for active isolation systems","30771020":"Real-Time Estimation of Fault Rupture Extent Using Near-Source versus Far-Source Classification","41482722":"Stochastic System Design and Applications to Stochastically Robust Structural Control","230313249":"Application of two‐dimensional spatial wavelet transform in the detection of an obstructed crack on a thin plate","223325330":"Hybrid Subset Simulation Method for Reliability Estimation of Dynamical Systems Subject to Stochastic Excitation","238179410":"Reliability-Based Performance Objectives and Probabilistic Robustness in Structural Control Applications","256800108":"Reliability assessment in structural dynamics","227335524":"Application of saddlepoint approximation in reliability analysis of dynamic systems","263226777":"A probabilistic approach to structural model updating","229401731":"Distinguishing between the interior pressures induced from two independent sources within a room using the probabilistic approach","223937897":"Reliability-based optimal design of linear dynamical systems under stochastic stationary excitation and model uncertainty","229573533":"Effects of structural uncertainties on TMD design: A reliability‐based approach","222675510":"First excursion probability for linear systems by very efficient algorithm","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","222317364":"Robust Reliability-based Design of Liquid Column Mass Dampers under Earthquake Excitation using an Analytical Reliability Approximation","220373527":"A Bayesian Probabilistic Approach for Crack Characterization in Plate Structures","274012578":"Hierarchical sparse Bayesian learning: theory and application for inferring structural damage from incomplete modal data","245185828":"Posteriori estimate of the random response of a dynamic system with autocorrelated additive noises","252834216":"Reconstruction of the interior sound pressure of a room using the probabilistic approach","222780925":"A new adaptive importance sampling scheme","229979402":"Analytical Approximation for Stationary Reliability of Certain and Uncertain Linear Dynamic Systems with Higher Dimensional Output"},"index":213}