{"abs":"ABSTRACT: In this paper the problem of reliability-based optimization is considered. A global optimization method based on Transitional Markov chain Monte Carlo (TMCMC) is used to address the problem, where the optimization problem is converted into the task of generating sample points (designs) according to a probability density function (PDF) suitably constructed on the feasible space of designs satisfying all the constraints. TMCMC is used for generating sample points, in order to get higher convergence rate of the stationary distribution of the Markov chain states to the constructed PDF. The generation of sample points uniformly distributed in the feasible space, which is required at the initial stage of TMCMC, is achieved by using Subset Simulation. To apply Subset Simulation and TMCMC in the concerned reliability-based optimization problem, Importance Sampling is used to examine the reliability constraint, that is, whether the failure probability at a given design exceeds a specified threshold. Based on the statistical properties of the failure probability estimator given by Importance Sampling, a `minimum\u0027 computational effort, in terms of providing a reliable judgment on the reliability constraint, is defined so that a further reduction in the computational cost can be achieved in the proposed reliability-based optimization (RBO) algorithm. An illustrative example shows the application and the advantages of the proposed global RBO algorithm.","title":"Transitional Markov chain Monte Carlo simulation for reliability-based optimization","id":264084695,"url":"https://www.researchgate.net/publication/264084695_Transitional_Markov_chain_Monte_Carlo_simulation_for_reliability-based_optimization","names":["Jia Wang","Lambros S. Katafygiotis","Mohammad Noori"],"references":{"245286591":"Transitional Markov Chain Monte Carlo Method for Bayesian Model Updating, Model Class Selection, and Model Averaging","222675510":"First excursion probability for linear systems by very efficient algorithm","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","30759090":"Domain Decomposition Method for Calculating the Failure Probability of Linear Dynamic Systems Subjected to Gaussian Stochastic Loads","226848876":"Reliability-Based Optimization of Structural Systems","248560911":"Importance sampling in structural system"},"citedIn":{},"index":218}