{"abs":"Models for which the likelihood function can be evaluated only up to a parameter-dependent unknown normalising constant, such as Markov random field models, are used widely in computer science, statistical physics, spatial statistics, and network analysis. However, Bayesian analysis of these models using standard Monte Carlo methods is not possible due to the intractability of their likelihood functions. Several methods that permit exact, or close to exact, simulation from the posterior distribution have recently been developed. However, estimating the evidence and Bayes\u0027 factors (BFs) for these models remains challenging in general. This paper describes new random weight importance sampling and sequential Monte Carlo methods for estimating BFs that use simulation to circumvent the evaluation of the intractable likelihood, and compares them to existing methods. In some cases we observe an advantage in the use of biased weight estimates. An initial investigation into the theoretical and empirical properties of this class of methods is presented. Some support for the use of biased estimates is presented, but we advocate caution in the use of such estimates.","title":"Bayesian model comparison with un-normalised likelihoods","id":291353622,"url":"https://www.researchgate.net/publication/291353622_Bayesian_model_comparison_with_un-normalised_likelihoods","names":["Richard G Everitt","Adam Michael Johansen","Ellen Rowing","Melina Evdemon-Hogan","Statistics and Computing"],"references":{"27468515":"An efficient MCMC method for distributions with intractable normalising constants","258817325":"Towards Automatic Model Comparison: An Adaptive Sequential Monte Carlo Approach","257673689":"ABC methods for model choice in Gibbs random fields","239524417":"Playing Russian Roulette with Intractable Likelihoods","290889759":"Sequential Monte Carlo without likelihoods","2123628":"Estimating Ratios of Normalizing Constants Using Linked Importance Sampling","222419087":"Friel, N.: Bayesian inference for exponential random graph models. Soc. Netw. 33(1), 41-55","51942167":"Stability properties of some particle filters","45630121":"Statistical inference for noisy nonlinear ecological dynamic systems","2453431":"A Sequential Particle Filter Method for Static Models","248115483":"Topics in Sequential Monte Carlo Samplers","266083272":"Local dependence in random graph models: Characterization, properties and statistical inference","231609430":"Convergence properties of pseudo-marginal Markov chain Monte Carlo\nalgorithms","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","227520470":"Random‐weight particle filtering of continuous time processes","259254442":"Semi-automatic selection of summary statistics for ABC model choice","258247743":"Bayesian inference on the Stiefel manifold","261065488":"Noisy Monte Carlo: Convergence of Markov chains with approximate transition kernels","221707689":"Bayesian Parameter Estimation for Latent Markov Random Fields and Social\nNetworks","228364221":"Skilling, J.: Nested sampling for general Bayesian computation. Bayesian Anal. 1(4), 833-860","234114006":"Evidence and Bayes Factor Estimation for Gibbs Random Fields","281058916":"Approximations of Markov Chains and High-Dimensional Bayesian Inference","281486499":"Variance estimation and allocation in the particle filter","265681840":"Sequential Imputations and Bayesian Missing Data Problems","236653886":"Approximate Bayesian Computation (ABC) gives exact results under the assumption of model error","251572440":"Likelihood-free estimation of model evidence","14140218":"Inferring Coalescence Times From DNA Sequence Data","51946922":"Relevant statistics for Bayesian model choice","243775157":"Simulating Ratios of Normalizing Constants via a Simple Identity: A Theoretical Exploration","228092010":"MCMC for doubly-intractable distributions","2306327":"Annealed Importance Sampling","51604070":"Lack of confidence in approximate Bayesian computational (ABC) model choice","48182441":"SMC2: An efficient algorithm for sequential analysis of state space models","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","256548723":"IS^2 for Bayesian inference in latent variable models","8970227":"Markov Chain Monte Carlo without likelihoods","257308715":"Accelerating inference for diffusions observed with measurement error and large sample sizes using Approximate Bayesian Computation: A case study","51962726":"Error Bounds and Normalizing Constants for Sequential Monte Carlo in\nHigh Dimensions","276296264":"Bayesian Indirect Inference Using a Parametric Auxiliary Model"},"citedIn":{},"index":222}