{"abs":"In the past, moment and likelihood methods have been developed to estimate the effective population size (N(e)) on the basis of the observed changes of marker allele frequencies over time, and these have been applied to a large variety of species and populations. Such methods invariably make the critical assumption of a single isolated population receiving no immigrants over the study interval. For most populations in the real world, however, migration is not negligible and can substantially bias estimates of N(e) if it is not accounted for. Here we extend previous moment and maximum-likelihood methods to allow the joint estimation of N(e) and migration rate (m) using genetic samples over space and time. It is shown that, compared to genetic drift acting alone, migration results in changes in allele frequency that are greater in the short term and smaller in the long term, leading to under- and overestimation of N(e), respectively, if it is ignored. Extensive simulations are run to evaluate the newly developed moment and likelihood methods, which yield generally satisfactory estimates of both N(e) and m for populations with widely different effective sizes and migration rates and patterns, given a reasonably large sample size and number of markers.","title":"Wang JL, Whitlock MC. Estimating effective population size and migration rates from genetic samples over space and time. Genetics 163: 429-446","id":10899824,"url":"https://www.researchgate.net/publication/10899824_Wang_JL_Whitlock_MC_Estimating_effective_population_size_and_migration_rates_from_genetic_samples_over_space_and_time_Genetics_163_429-446","names":["Jinliang Wang","Michael C Whitlock","Genetics"],"references":{"11988087":"The annual number of breeding adults and the effective population size of syntopic newts (Triturus cristatus, T. marmoratus). Mol. Ecol., 10, 839-850","6554272":"On the estimation of population size from allele frequency changes","247650692":"Measures of gene flow and migration: FST≠ 1/(4Nm+1)","13964637":"Rannala B, Mountain JL. Detecting immigration by using multilocus genotypes. P Natl Acad Sci USA 94: 9197-9201","6556204":"Genetics of Natural Populations. V. Relations between Mutation Rate and Accumulation of Lethals in Populations of Drosophila Pseudoobscura.","13193472":"Indirect measures of gene flow and migration: F ST ≠ 1/(4Nm + 1). Heredity","23444076":"Effective population size/adult population size ratios in wildlife: A review. Genet. Res., 66, 95-107","6555822":"Wright, S. Evolution in Mendelian populations. Genetics","226262262":"High aquatic niche overlap in the newts Triturus cristatus and T. marmoratus (Amphibia, Urodela)","13240262":"Luikart, G, Cornuet, J-M. Estimating the effective number of breeders from heterozygote excess in progeny. Genetics, 151: 1211-1216","12720591":"Detecting Population Expansion and Decline Using Microsatellites","279870563":"The International Psoriasis Genetics Study: Assessing Linkage to 14 Candidate Susceptibility Loci in a Cohort of 942 Affected Sib Pairs","13240605":"Temporal changes in genetic variation of North European cattle breeds","12172640":"Optimal marker-assisted selection to increase the effective size of small populations","11495861":"Wang JL. A pseudo-likelihood method for estimating effective population size from temporally spaced samples. Genet Res 78: 243-257","6557374":"Pollak E. A new method for estimating the effective population size from allele frequency changes. Genetics 104: 531-548","12226406":"Monte Carlo Evaluation of the Likelihood for Ne From Temporally Spaced Samples","12172644":"Vitalis R, Couvet D. Estimation of effective population size and migration rate from one- and two-locus identity measures. Genetics 157: 911-925","281225053":"Dispersion patterns of young great crested newts (Triturus cristatus)","12045608":"Beerli P, Felsenstein J.. Maximum likelihood estimation of a migration matrix and effective population sizes in subpopulations by using a coalescent approach. Proc Natl Acad Sci USA 98: 4563-4568","247939303":"Effective population size in the captive breeding programme of the Lake Victoria Cichlid Paralabidochromis chilotes","11936084":"Distinguishing Migration From Isolation: A Markov Chain Monte Carlo Approach","227692848":"Effective Population Size and Maintenance of Genetic Diversity in Captive‐Bred Populations of a Lake Victoria Cichlid","11047181":"Effective population size","241791758":"High aquatic niche overlap in the newts Triturus cristatus and","15385472":"Developments in the Prediction of Effective Population Size","14327604":"Pudovkin, AI, Zaykin, DV, Hedgecock, D. On the potential for estimating the effective number of breeders from heterozygote-excess in progeny. Genetics, 144: 383-387","227638816":"Small effective population size in the long-toed salamander. Mol. Ecol., 8, 1633-1640","16490447":"Genetic drift and estimation of effective population size","227763557":"Temporal genetic variation of mtDNA and effective female population size of red drum in the northern Gulf of Mexico","12944828":"Using Maximum Likelihood to Estimate Population Size From Temporal Changes in Allele Frequencies","6554328":"Nei M, Tajima F. Genetic drift and estimation of effective population size. Genetics 98: 625-640","231878126":"Using genetics to estimate the size of wild populations: many methods, much potential, uncertain utility","234027853":"A genetic method of stock identification in mixed populations of Pacific salmon, Oncorhynchus spp. Mar. Fish. Rev. 47, 1-8","225602445":"Temporal changes in allele frequencies in two reciprocally selected maize populations. Theor Appl Genet","231900269":"Estimation of Effective Population Size from Data on Linkage Dis Equilibrium"},"citedIn":{"23997804":"Nielsen R, Beaumont MA. Statistical inferences in phylogeography. Mol Ecol 18: 1034-1047","6302307":"The population genetics of a solitary oligolectic sweat bee, Lasioglossum (Sphecodogastra) oenotherae (Hymenoptera: Halictidae)","228362136":"Molecular approaches to the study of invasive seaweeds","257139031":"Microsatellite Development and First Population Size Estimates for the Groundwater Isopod Proasellus walteri","234132466":"Mature male parr contribution to the effective size of an anadromous Atlantic salmon ( Salmo salar ) population over 30 years","7696498":"Wang JL. Estimation of effective population sizes from data on genetic markers. Philos Trans R Soc Lond B 360: 1395-1409","233866746":"Detecting recent gene flow between populations of a flightless ground beetle","260379535":"Genetic assessment of a summer chum salmon metapopulation in recovery","261769105":"Significant population genetic structure of the Cameroonian fresh water snail, Bulinus globosus, (Gastropoda: Planorbidae) revealed by nuclear microsatellite loci analysis","40483941":"The genetic structure of populations of an invading pest fruit fly, Bactrocera tryoni, at the species climatic range limit","8999045":"Østergaard S, Hansen MM, Loeschcke V, Nielsen EE. Long-term temporal changes of genetic composition in brown trout (Salmo trutta L.) populations inhabiting an unstable environment. Mol Ecol 12: 3123-3135","43159199":"Using isolation by distance and effective density to estimate dispersal scales in Anemone fish","8017015":"Ecological components and evolution of selfing in the freshwater snail Galba truncatula","229741503":"Population genetic structure and effective population size of ayu (Plecoglossus altivelis), an amphidromous fish","257549641":"Genetic diversity and population structure in the endangered giant otter, Pteronura brasiliensis","6994555":"On the expected relationship between inbreeding, fitness, and extinction","228340622":"Broquet T, Petit EJ.. Molecular estimation of dispersal for ecology and population genetics. Annu Rev Ecol Evol Syst 40: 193-216","37244461":"The genetics of a managed Atlantic salmon stock and implications for conservation.","229591478":"ORIGINAL ARTICLE: Survival of mutations arising during invasions","51119888":"Waples RS. Spatial-temporal stratifications in natural populations and how they affect understanding and estimate of population size. Mol Ecol Resour 10: 785-796","24354670":"Wang JL.. A new method for estimating effective population sizes from a single sample of multilocus genotypes. Mol Ecol 18: 2148-2164","225249612":"Small effective population sizes of two remnant ocelot populations (Leopardus pardalis albescens) in the United States","261033389":"Genetic correlations within and between isolated tsetse populations: What can we learn?","227159977":"Temporal changes in genetic diversity of isolated populations of perch and roach","290787187":"Lower selfing rates in metallicolous populations than in non-metallicolous populations of the pseudometallophyte Noccaea caerulescens (Brassicaceae) in Southern France","40268353":"Diversité génétique et taille efficace chez les populations de poissons sauvages : le cas du saumon atlantique un poisson migrateur amphihalin menacé","6584910":"Brown JW, Van Coeverden De Groot PJ, Birt TP, Seutin G, Boag PT, Friesen VL. Appraisal of the consequences of the DDT-induced bottleneck on the level and geographic distribution of neutral genetic variation in Canadian peregrine falcons, Falco peregrinus. Mol Ecol 16: 327-343","277774015":"Genetic Structure, Snp Establishment, and Cloning the 2la-Inversion Distal Breakpoint in the Malaria Vector Anopheles Gambiae","38083191":"Genetic analyses of historic and modern marbled murrelets suggest decoupling of migration and gene flow after habitat fragmentation","222545781":"Measurably evolving populations","233946566":"Barker (2011) Mol Ecol","226020673":"Loss of historical immigration and the unsuccessful rehabilitation of extirpated salmon populations","225159504":"Effects of founder events on the genetic variation of translocated island populations: implications for conservation management of the northern quoll. Conserv Genet","8469693":"Comparative evaluation of a new effective population size estimator based on approximate Bayesian computation. Genetics 167: 977-988","51078966":"Contemporary meta-population effective size: factors influencing its empirical estimation in salmonid fish","45364873":"Sympatric colour polymorphisms associated with nonrandom gene flow in cichlid fish of Lake Victoria","30843369":"Low Genetic Variation in the Heath Hen Prior to Extinction and Implications for the Conservation of Prairie-Chicken Populations","255571204":"Population Structure of Red Snapper in the Northern Gulf of Mexico","225111841":"North American montane red foxes: Expansion, fragmentation, and the origin of the Sacramento Valley red fox","259537206":"Multidisciplinary population monitoring when demographic data are sparse: A case study of remote trout populations","228751858":"Source–Sink dynamics sustain central stonerollers (Campostoma anomalum) in a heavily urbanized catchment","229562879":"Population Size Reductions","226646480":"Boessenkool S, Star B, Seddon PJ, Waters JM.. Temporal genetic samples indicate small effective population size of the endangered yellow-eyed penguin. Conserv Genet 11: 539-546","267429282":"Population characteristics and estimates of effective population size in a house sparrow metapopulation","229952486":"Low genetic variability in a mountain rodent, the Tatra vole","222430487":"Beebee TJC, Griffiths RA. The amphibian decline crisis: a watershed for conservation biology? Biol Conserv 125: 271-285","266914750":"Fisheries-induced neutral and adaptive evolution in exploited fish populations and consequences for their adaptive potential","6055434":"Diversity and divergence patterns in regulatory genes suggest differential gene flow in recent-derived species of the Hawaiian silversword alliance adaptive radiation (Asteraceae)","51660099":"Changes in the Genetic Structure of Aedes aegypti (Diptera: Culicidae) Populations in Queensland, Australia, Across Two Seasons: Implications for Potential Mosquito Releases","266228105":"ESTUDIO DE LAS VARIACIONES ESPACIALES Y TEMPORALES DE LA DIVERSIDAD GENÉTICA DE LA TRUCHA COMÚN, SALMO TRUTTA, EN RÍOS DE LA PENÍNSULA IBÉRICA","224859952":"Barker, J.S.F. (2011). Effective population size of natural populations of Drosophila buzzatii, with a comparative evaluation of nine methods of estimation. Molecular Ecology 20: 4452-4471","259845920":"Temporal genetic structure in a poecilogonous polychaete: the interplay of developmental mode and environmental stochasticity. BMC Evol Biol 14:12","5859846":"Spatially and temporally fluctuating selection at non-MHC immune genes: Evidence from TAP polymorphism in populations of brown trout (Salmo trutta, L.)","227674061":"European green crabs (Carcinus maenas) in the Northeastern Pacific: Genetic evidence for high population connectivity and current-mediated expansion from a single introduced source population","232687550":"Genetic Structuring of Western Corn Rootworm (Coleoptera: Chrysomelidae) Populations in the United States Based on Microsatellite Loci Analysis","227217896":"Eldridge WH, Killebrew K. Genetic diversity over multiple generations of supplementation: an example from Chinook salmon using microsatellite and demographic data. Conserv Genet 9: 13-28","230644699":"The Pitcher Plant Flesh Fly Exhibits a Mixture of Patchy and Metapopulation Attributes","44801230":"Osborne MJ, Davenport SR, Hoagstrom CW, Turner TF. Genetic effective size, Ne, tracks density in a small freshwater cyprinid, Pecos bluntnose shiner (Notropis simus pecosensis). Mol Ecol 19: 2832-2844","235897445":"Effective size and genetic composition of two exploited, migratory whitefish (Coregonus lavaretus lavaretus) populations","47403193":"Cytoplasmic feminizing elements in a two-population model: Infection dynamics, gene flow modification, and the spread of autosomal suppressors","257302842":"Microsatellite Development and First Population Size Estimates for the Groundwater Isopod Proasellus walteri","262610390":"Genetic Similarity of Island Populations of Tent Caterpillars during Successive Outbreaks","272196680":"Contemporary evolution of plant reproductive strategies under global change is revealed by stored seeds","288701252":"Temporal sampling helps unravel the genetic structure of naturally occurring populations of a phytoparasitic nematode. 1. Insights from the estimation of effective population sizes","259480320":"Past and present genetic diversity and structure of the Finnish wolf population","279427294":"Genetic Approaches to Understanding Marine Metapopulation Dynamics","264250297":"Temporal patterns of genetic variation in a salmon population undergoing rapid change in migration timing","227679215":"Spatio‐temporal genetic variability in sea trout (Salmo trutta) populations from north‐western Spain","44628693":"Objectives, criteria and methods for using molecular genetic data in priority setting for conservation of animal genetic resources. Anim Genet","226190842":"Crumbling diversity: Comparison of historical archived and contemporary natural populations indicate reduced genetic diversity and increasing genetic differentiation in the golden-cheeked warbler","261915934":"Effects of population characteristics and structure on estimates of effective population size in a house sparrow metapopulation","256444363":"Population genetics of European butterflies","232696150":"Genetic Aspects of Restoring Olympia Oysters and Other Native Bivalves: Balancing the Need for Action, Good Intentions, and the Risks of Making Things Worse","26865941":"Polymorphisms in the ovine myostatin gene (MSTN) and their association with growth and carcass traits in New Zealand Romney sheep","227497246":"Effects of Habitat Fragmentation on Effective Population Size in the Endangered Rio Grande Silvery Minnow","265645382":"Development of genetic structure in a heterogeneous landscape over a short time frame: the reintroduced Asiatic wild ass","224004046":"A review of the application of molecular genetics for fisheries management and conservation of sharks and rays","279163956":"Estimating effective population size of guanacos in Patagonia: an integrative approach for wildlife conservation","5345992":"Genetic differentiation among European whitefish ecotypes based on microsatellite data","256608210":"Temporal Analysis of Genetic Structure to Assess Population Dynamics of Reintroduced Swift Foxes","234066792":"Application of Molecular Genetics for Conservation of the White Shark, Carcharodon carcharias, L. 1758","261037842":"Applying Weighted K-nearest centroid neighbor as classifier to improve the finger vein recognition performance","267391826":"Spatial associations in a solitary predator: using genetic tools and GPS technology to assess cougar social organization in the Southern Yellowstone Ecosystem","7893210":"Genetic Differentiation and Estimation of Effective Population Size and Migration Rates in Two Sympatric Ecotypes of the Marine Snail Littorina saxatilis","261872446":"Spatio-temporal population genetic structure and mating system of red king crab (Paralithodes camtschaticus) in Alaska","256609260":"Samples from subdivided populations yield biased estimates of effective size that overestimate the rate of loss of genetic variation","7432406":"Genetic structure of Anopheles gambiae populations on islands in northwestern Lake Victoria, Uganda","235781309":"Sampling strategies for estimating brook trout effective population size","232694639":"Genetic monitoring of Scandinavian brown bear effective population size and immigration","274727121":"Temporal Stability of Genetic Variability and Differentiation in the Three-Spined Stickleback (Gasterosteus aculeatus)","226711867":"Estimation of census and effective population sizes: The increasing usefulness of DNA-based approaches","225461192":"Effective size of an Atlantic salmon (Salmo salar L.) metapopulation in Northern Spain","223978979":"Short-Term Genetic Changes: Evaluating Effective Population Size Estimates in a Comprehensively Described Brown Trout (Salmo trutta) Population","44685842":"Temporally stable genetic variability in a fluctuating population of the root vole Microtus oeconomus","46577277":"Seasonal effects and fine-scale population dynamics of Aedes taeniorhynchus, a major disease vector in the Galapagos Islands","49721933":"Are low but statistically significant levels of genetic differentiation in marine fishes ‘biologically meaningful’? A case study of coastal Atlantic cod","253331928":"Contrasting effects of landscape features on genetic structure in different geographic regions in the ornate dragon lizard, Ctenophorus ornatus","46526977":"Application of a Markovian process to the calculation of mean time equilibrium in a genetic drift model","224003989":"Molecular tools and analytical approaches for the characterization of farm animal genetic diversity","259344805":"Genetic Structuring of Western Corn Rootworm (Coleoptera: Chrysomelidae) Populations in the United States Based on Microsatellite Loci Analysis","242471074":"Développement de marqueurs moléculaires chez les Orthoptères : application à l\u0027étude du genre Calliptamus","261142338":"Spatial and temporal genetic structure of a river-resident Atlantic salmon (Salmo salar) after millennia of isolation","252817858":"Seasonal changes of population genetic structure and relatedness in the bank vole Clethrionomys glareolus: An analysis of age cohorts","288919535":"A model-derived short-term estimation method of effective size for small populations with overlapping generations","225999265":"Evaluation of the Linkage Disequilibrium Method for Estimating Effective Population Size","29608218":"Natural recovery of genetic diversity by gene flow in reforested areas of the endemic Canary Island pine, Pinus canariensis","271722731":"Effective Population Size of Korean Populations","261217099":"Living on the edge: Reconstructing the genetic history of the Finnish wolf population","232689924":"Leberg P. Genetic approaches for estimating the effective size of populations. J Wildl Manage 69: 1385-1399","230858014":"Rise and fall of a wolf population: Genetic diversity and structure during recovery, rapid expansion and drastic decline","6253699":"Watts PC, Saccheri IJ, Kemp SJ, Thompson DJ. Effective population sizes and migration rates in fragmented populations of an endangered insect (Coenagrion mercuriale: Odonata). J Anim Ecol 76: 790-800","227292496":"Temporal genetic structure patterns in tropical maize populations under reciprocal recurrent selection","7326385":"Long-term stability and effective population size in North Sea and Baltic Sea cod (Gadus morhua)","47790650":"Strong genetic structure in Cameroonian populations of Bulinus truncatus (Gastropoda: Planorbidae), intermediate host of Schistosoma haematobium","274195634":"Genetic Parentage Analysis Confirms a Polygynandrous Breeding System in the European Grayling (Thymallus thymallus)","236985032":"Allele frequency stability in large, wild exploited populations over multiple generations: insights from Alaska sockeye salmon (Oncorhynchus nerka)","51862014":"Spatial and temporal variation in population genetic structure of wild Nile tilapia (Oreochromis niloticus) across Africa","5549245":"Evolutionary dynamics of molecular markers during local adaptation: a case study in Drosophila subobscura. BMC Evol Biol 9:133-135","235437281":"Allele frequency stability in large, wild exploited populations over multiple generations: insights from Alaska sockeye salmon (Oncorhynchus nerka)","227749759":"Saarinen EV, Austin JD, Daniels JC. Genetic estimates of contemporary effective population size in an endangered butterfly indicate a possible role for genetic compensation. Evol Appl 3: 28-39","227537250":"Laurent V, Planes S. Effective population size estimation on Sardina pilchardus in the Bay of Biscay using a temporal genetic approach. Biol J Linn Soc 90: 591-602","51225083":"Gower CM, Gabrielli AF, Sacko M, Dembele R, Golan R, Emery AM et al.. Population genetics of Schistosoma haematobium: development of novel microsatellite markers and their application to schistosomiasis control in Mali. Parasitology 138: 978-994","51460582":"Reproductive strategies and population structure in Leishmania: Substantial amount of sex in Leishmania Viannia guyanensis","46047305":"Population genetics of ranid frogs : investigating effective population size and gene flow","38042814":"A comparison of single-sample effective size estimators using empirical Toad (Bufo calamita) population data: genetic compensation and population size-genetic diversity correlations","51140083":"Coombs JA, Letcher BH, Nislow KH. CREATE: software to create input files from diploid genotypic data for 52 genetic software programs. Mol Ecol Resour 8: 578-580","255710658":"Thesis","6823273":"Nuclear and mitochondrial markers reveal distinctiveness of a small population of bottlenose whales (Hyperoodon ampullatus) in the western North Atlantic","277881747":"Influences of Dominance and Evolution of Sex in Finite Diploid Populations","26716819":"Temporally stable genetic structure of heavily exploited Atlantic herring (Clupea harengus) in Swedish waters","24204404":"The Population Structure of Glossina palpalis gambiensis from Island and Continental Locations in Coastal Guinea","236083992":"Contemporary effective population and metapopulation size (Ne and meta-Ne): Comparison among three salmonids inhabiting a fragmented system and differing in gene flow and its asymmetries","6119254":"Unbiased Estimator for Genetic Drift and Effective Population Size","233385701":"Palstra FP, Fraser DJ.. Effective/census population size ratio estimation: a compendium and appraisal. Ecol Evol 2: 2357-2365","229684414":"Conservation Genetics","23231596":"Coyer J, Hoarau G, Kjersti S, Olsen J. Being abundant is not enough: a decrease in effective population size over 8 generations in a Norwegian population of the seaweed, Fucus serratus. Biol Lett 4: 755-757","272088888":"Post-fragmentation population structure in a cooperative breeding Afrotropical cloud forest bird: Emergence of a source-sink population network","229404348":"MHC class II DQA gene variation across cohorts of brown hares (Lepus europaeus) from eastern Austria: Testing for different selection hypotheses","262298288":"Population Structure, Genetic Variability, and Gene Flow of the Bean Leaf Beetle, Cerotoma trifurcata, in the Midwestern United States","24441441":"Hansen MM, Fraser DJ, Meier K, Mensberg KLD. Sixty years of anthropogenic pressure: a spatio-temporal genetic analysis of brown trout populations subject to stocking and population declines. Mol Ecol 18: 2549-2562","34678537":"Appraisal of the consequences of the DDT-induced bottleneck on the level and distribution of neutral genetic variation in Canadian peregrine falcons, Falco peregrinus [microform].","6671743":"Effective population size of Anopheles funestus chromosomal forms in Burkina Faso","30072534":"Evolutionary genetics of Atlantic salmon (Salmo salar L.)","226573469":"Reconciling Genetic and Demographic Estimators of Effective Population Size in the Anuran Amphibian Bufo Calamita","45826983":"Franckowiak RP, Sloss BL, Bozek MA, Newman SP.. Temporal effective size estimates of a managed walleye Sander vitreus population and implications for genetic-based management. J Fish Biol 74: 1086-1103","258957939":"A century-long genetic record reveals that protist effective population sizes are comparable to those of macroscopic species","6119232":"Joint Estimation of Migration Rate and Effective Population Size Using the Island Model","226447456":"Reduced Genetic Diversity and Effective Population Size in an Endangered Atlantic Salmon (Salmo Salar) Population from Maine, USA","51666480":"Bottlenecks drive temporal and spatial genetic changes in alpine caddisfly metapopulations","41397586":"An examination of genetic diversity and effective population size in Atlantic salmon","271459595":"Effects of population size and isolation on the genetic structure of the East African mountain white-eye Zosterops poliogaster (Aves)","228549813":"Reproduction in the Wild: The Effect of Individual Life History Strategies on Population Dynamics and Persistence","233637056":"Large effective population size and temporal genetic stability in Atlantic cod (Gadus morhua) in the southern Gulf of St. Lawrence","8061782":"Estimation of effective population size and detection of a recent population decline coinciding with habitat fragmentation in a round beetle","250019784":"Temporal Stability of Genetic Variation within Natural Populations of Summer Steelhead Receiving Mitigation Hatchery Fish","273326437":"Estimating Effective Population Size from Temporally Spaced Samples with a Novel, Efficient Maximum-Likelihood Algorithm","230724341":"Three Decades of Farmed Escapees in the Wild: A Spatio-Temporal Analysis of Atlantic Salmon Population Genetic Structure throughout Norway","7811393":"Vasemagi A, Gross R, Paaver T, Koljonen ML, Nilsson J. Extensive immigration from compensatory hatchery releases into wild Atlantic salmon population in the Baltic Sea: spatio-temporal analysis over 18 years. Heredity 95: 76-83","8978353":"A SOM projection technique with the growing structure for visualizing high-dimensional data","283326938":"Multiple estimates of effective population size for monitoring a long-lived vertebrate: An application to Yellowstone grizzly bears","232065771":"Population genetic structure of Schistosoma mansoni and Schistosoma haematobium from across six sub-Saharan African countries: Implications for epidemiology, evolution and control","225524814":"Jensen LF, Hansen MM, Carlsson J, Loeschcke V, Mensberg K-LD. Spatial and temporal genetic differentiation and effective population size of brown trout (Salmo trutta, L.) in small Danish rivers. Conserv Genet 6: 615-621","221830777":"Testing metapopulation dynamics using genetic, demographic and ecological data","225684535":"Borrell YJ, Bernardo D, Blanco G, Vazquez E, Sanchez JA. Spatial and temporal variation of genetic diversity and estimation of effective population sizes in Atlantic salmon (Salmo salar, L.) populations from Asturias (Northern Spain) using microsatellites. Cons Gen 9: 807-819","226478650":"Consuegra S, Verspoor E, Knox D, Garciá De Leániz C. Asymmetric gene flow and the evolutionary maintenance of genetic diversity in small, peripheral Atlantic salmon populations. Conserv Genet 6: 823-842","8395205":"Johnson JA, Bellinger MR, Toepfer JE, Dunn P.. Temporal changes in allele frequencies and low effective population size in greater prairie-chickens. Mol Ecol 13: 2617-2630","50341445":"Factors influencing within-watershed genetic variation of coastal cutthroat trout in Camp Creek, Oregon","5989149":"Fraser DJ, Hansen MM, Østergaard S, Tessier N, Legault M, Bernatchez L. Comparative estimation of effective population sizes and temporal gene flow in two contrasting population systems. Mol Ecol 16: 3866-3889","224869932":"Understanding local population genetics of tsetse: The case of an isolated population of Glossina palpalis gambiensis in Burkina Faso","23809056":"Palstra FP, Ruzzante DE.. Genetic estimates of contemporary effective population size: what can they tell us about the importance of genetic stochasticity for wild population persistence? Mol Ecol 17: 3428-3447","5392156":"Chevolot M, Ellis JR, Rijnsdorp AD, Stam WT, Olsen JL. Temporal changes in allele frequencies but stable genetic diversity over the past 40 years in the Irish Sea population of thornback ray, Raja clavata. Heredity 101: 120-126","225695293":"Gene flow and natal dispersal in Siberian flying squirrels based on direct and indirect data","227708099":"The spatial genetic differentiation of the legume pod borer, Maruca vitrata F. (Lepidoptera: Crambidae) populations in West Africa","282129284":"Data from: Spatial overlap in a solitary carnivore: support for the land-tenure, kinship, or resource dispersion hypotheses?","51570756":"Estimating Contemporary Effective Population Size on the Basis of Linkage Disequilibrium in the Face of Migration","50374230":"Genetic diversity decreases as population density declines: Implications of temporal variation in mitochondrial haplotype frequencies in a natural population of Tscherskia triton","254383230":"Assessment of the reliability of photo identification using skin patterns for the basking shark, Cetorhinus maximus in the Irish Sea","47447432":"Long-Term Genetic Stability and Population Dynamics of Laboratory Strains of Schistosoma mansoni","6293249":"Panchal M, Beaumont MA. The automation and evaluation of nested clade phylogeographic analysis. Evolution 61: 1466-1480","236691834":"Population genetics of Lymnaea stagnalis experimentally exposed to cocktails of pesticides","273705265":"Interannual variation in connectivity and comparison of effective population size between two splittail (Pogonichthys macrolepidotus) populations in the San Francisco Estuary","284246931":"The impact of selection on population genetic structure in the clam Meretrix petechialis revealed by microsatellite markers","279731144":"Islands within islands: Two montane palaeo-endemic birds impacted by recent anthropogenic fragmentation","265376949":"Population structure and variance effective size of red snapper (Lutjanus campechanus) in the Gulf of Mexico","41420061":"Mito-nuclear discordance in the degree of population differentiation in a marine goby","6274871":"A potential bias in the temporal method for estimating Ne in admixed populations under natural selection","26750705":"Spatial and Temporal Genetic Analyses Show High Gene Flow Among European Corn Borer (Lepidoptera: Crambidae) Populations Across the Central U.S. Corn Belt","8118546":"Hoffman EA, Schueler FW, Blouin MS. Effective population sizes and temporal stability of genetic structure in Rana pipiens, the northern leopard frog. Evolution 58: 2536-2545","232085690":"The population structure of Glossina fuscipes fuscipes in the Lake Victoria basin in Uganda: Implications for vector control","235955040":"Genetic and life-history changes associated with fisheries-induced population collapse","5380896":"Reproductive isolation, evolutionary distinctiveness and setting conservation priorities: The case of European lake whitefish and the endangered North Sea houting (Coregonus spp.)","227758816":"Stability of genetic structure and effective population size inferred from temporal changes of microsatellite DNA polymorphisms in the land snail Helix Aspersa (Gastropoda: Helicidae)","257250337":"Within-Host Selection Is Limited by an Effective Population of Streptococcus pneumoniae during Nasopharyngeal Colonization","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","263742656":"Statistical genetics in traditionally cultivated crops","230812344":"Mitochondrial lineages in Notochthamalus scabrosus as indicators of coastal recruitment and interactions","227240689":"Wang J. Monitoring and managing genetic variation in group breeding populations without individual pedigrees. Conserv Genet 5: 813-825","51970149":"Catastrophic Floods May Pave the Way for Increased Genetic Diversity in Endemic Artesian Spring Snail Populations","229366486":"Spatial and temporal analysis of the Cuban white shrimp Penaeus (Litopenaeus) schmitti","277228024":"Estimating the Effective Population Size of Crassostrea virginica","280835522":"The relationship between abundance and genetic effective population size in elasmobranchs: an example from the globally threatened zebra shark Stegostoma fasciatum within its protected range","237343653":"Deepwater Program: Exploration and Research of Northern Gulf of Mexico Deepwater Natural and Artificial Hard Bottom Habitats with Emphasis on Coral Communities: Reefs, Rigs and Wrecks","51176076":"Cox K, Broeck Vanden, Van Calster H, Mergeay J.. Temperature-related natural selection in a wind-pollinated tree across regional and continental scales. Mol Ecol 20: 2724-2738","260523014":"Fine-scale phylogeographic contact zone in Austrian brown trout Salmo trutta reveals multiple waves of post-glacial colonization and a pre-dominance of natural versus anthropogenic admixture","233672297":"Hansen MM, Nielsen EE, Mensberg KLD. Underwater but not out of sight: genetic monitoring of effective population size in the endangered North Sea houting (Coregonus oxyrhynchus). Can J Fish Aquat Sci 63: 780-787","23166181":"Controlling Population Evolution in the Laboratory to Evaluate Methods of Historical Inference","23180516":"Small effective population sizes in two planktonic freshwater copepod species (Eudiaptomus) with apparently large census sizes","50408071":"Repeated sampling detects gene flow in a flightless ground beetle in a fragmented landscape","227618839":"Toward a mechanistic understanding of larval dispersal: Insights from genomic fingerprinting of the deep-sea hydrothermal vent tubeworm Riftia pachyptila","45828413":"Genetic diversity of the killifish Aphanius fasciatus paralleling the environmental changes of Tarquinia salterns habitat","280317757":"Coulon et al 2015","26791440":"Molecular road ecology: Exploring the potential of genetics for investigating transportation impacts on wildlife","280317756":"A stochastic movement simulator improves estimates of landscape connectivity","229875258":"A review of ecological models for brown trout: Towards a new demogenetic model","221936811":"Jourdan-Pineau H, David P, Crochet P-A.. Phenotypic plasticity allows the Mediterranean parsley frog Pelodytes punctatus to exploit two temporal niches under continuous gene flow. Mol Ecol 21: 876-886","233385592":"Can Genetic Estimators Provide Robust Estimates of the Effective Number of Breeders in Small Populations?","8015848":"Bayesian Estimation of Recent Migration Rates after a Spatial Expansion","282851663":"Using Genealogical Mapping and Genetic Neighborhood Sizes to Quantify Dispersal Distances in the Neotropical Passerine, the Black-Capped Vireo","228623413":"Reply to the comment by Beacham and Withler on‘‘Gene flow increases temporal stability ofChinook salmon (Oncorhynchus tshawytscha)populations in the Upper Fraser River, BritishColumbia, Canada’’","24020728":"Inferring recent migration rates from individual genotypes","280638243":"Fonctionnement des foyers de leishmanioses tel que révélé par analyses génétiques","259986661":"Large fluctuations in the effective population size of the malaria mosquito Anopheles gambiae s.s. during vector control cycle","233875050":"Population genetics of the American eel (Anguilla rostrata): FST \u003d 0 and NAO effects on demographic fluctuations of a panmictic species","289857244":"EFFECTIVE POPULATION SIZES AND TEMPORAL STABILITY OF GENETIC STRUCTURE IN RANA PIPIENS, THE NORTHERN LEOPARD FROG","51158679":"Effect of parasitic sex-ratio distorters on host gene frequencies in a mainland-island context","47932230":"Genetic diversity of Atlantic salmon (Salmo salar) and European whitefish (Coregonus lavaretus) in the Baltic Sea","259631332":"\u0027Historical DNA reveals the demographic history of Atlantic cod (Gadus morhua) in medieval and early modern Iceland\u0027","284812633":"Genetic structure and within-generation genome scan analysis of fisheries-induced evolution in a Lake Whitefish (Coregonus clupeaformis) population","51666613":"Effective population size of natural populations of Drosophila buzzatii, with a comparative evaluation of nine methods of estimation","8566059":"Genetic equilibrium despite habitat fragmentation in an Afrotropical bird. Mol Ecol","6618068":"Ovenden JR, Peel D, Street R, Courtney AJ, Hoyle SD, Peel SL et al.. The genetic effective and adult census size of an Australian population of tiger prawns (Penaeus esculentus). Mol Ecol 16: 127-138","51375803":"Hansen MM, Skaala O, Jensen LF, Bekkevold D, Mensberg KLD. Gene flow, effective population size and selection at major histocompatibility complex genes: brown trout in the Hardanger Fjord, Norway. Mol Ecol 16: 1413-1425","49652032":"The Use of Genetics for the Management of a Recovering Population: Temporal Assessment of Migratory Peregrine Falcons in North America","8393015":"Methodological problems in genetic association studies of longevity—the apolipoprotein E gene as an example. Int J Epidemiol","275587034":"Population structure and effective/census population size ratio in threatened three-spined stickleback populations from an isolated river basin in northwest Spain","49755983":"Population structure, effective population size and adverse effects of stocking in the endangered Australian eastern freshwater cod Maccullochella ikei","275057117":"A genetic demographic analysis of Lake Malawi rock-dwelling cichlids using spatio-temporal sampling","40848854":"Analysis of Schistosoma mansoni Population Structure Using Total Fecal Egg Sampling","259761856":"Genetic differentiation, effective population size and gene flow in marine fishes: implications for stock management","229671950":"Understanding and Estimating Effective Population Size for Practical Application in Marine Species Management","263417457":"Temporally stable genetic structure and low migration in an Atlantic salmon population complex: Implications for conservation and management","6841258":"Population genetics and molecular epidemiology or how to ‘‘d ́ busquer la b ˆ te’’","7895996":"Contemporary gene flow and thespatio-temporal genetic structure of subdivided new populations (Trituruscristatus, T. marmoratus). J. Evol. Biol., 18, 619-628","26293847":"Age Structure, Changing Demography and Effective Population Size in Atlantic Salmon (Salmo salar)","49745712":"Strong gene flow and lack of stable population structure in the face of rapid adaptation to local temperature in a spring-spawning salmonid, the European grayling (Thymallus thymallus). Heredity 106: 460-471","23177896":"Wares JP, Pringle JM. Drift by drift: effective population size is limited by advection. BMC Evol Biol 8: 235","235931101":"Maintenance of genetic variation and panmixia in the commercially exploited western rock lobster (Panulirus cygnus)","7150499":"Aspi J, Roininen E, Ruokonen M, Kojola I, VilÀ C. Genetic diversity, population structure, effective population size and demographic history of the Finnish wolf population. Mol Ecol 15: 1561-1576","8579923":"Sibship Reconstruction From Genetic Data With Typing Errors","23132850":"Landscape genetic analyses reveal cryptic population structure and putative selection gradients in a large-scale estuarine environment","250068287":"Social Subdivision Influences Effective Population Size in the Colonial-Breeding Black-Tailed Prairie Dog","51689164":"Comparative analyses of effective population size within and among species: Ranid frogs as a case study","7745431":"Stocking impact and temporal stability of genetic composition in a brackish northern pike (Esox lucius L.), assessed using microsatellite DNA analysis of historical and contemporary samples","235642346":"Genetic Structure of Creek Chub, a Headwater Minnow, in an Impounded River System","227628659":"Hauser L, Carvalho GR.. Paradigm shifts in marine fisheries genetics: ugly hypotheses slain by beautiful facts. Fish Fisheries 9: 333-362","5663166":"Population Response to Habitat Fragmentation in a Stream-Dwelling Brook Trout Population","46117206":"Effective Population Size and the Viability of the Siberian Jay Population of Suupohja, Finland","259345054":"Genetic structure and gene flow among European corn borer (Lepidoptera: Crambidae) populations from the Great Plains to the Appalachians of North America","228047996":"Handbook of Statistical Genetics, Third Edition","237361097":"Baseline Genetic Survey of the Threatened Pecos Bluntnose Shiner (Notropis simus pecosensis)","256985789":"Gene flow and demographic history of leopards (Panthera pardus) in the central Indian highlands","226986090":"Genetic population structure of central Oregon Coast coho salmon (Oncorhynchus Kisutch)","37985198":"Invasion ecology and genetics of Norway rats on New Zealand islands","231743009":"Birds in space and time: Genetic changes accompanying anthropogenic habitat fragmentation in the endangered black-capped vireo (Vireo atricapilla)","26270306":"Microsatellite markers reveal shallow genetic differentiation between cohorts of the common sea urchin Paracentrotus lividus (Lamarck) in northwest Mediterranean. Mol Ecol","7150489":"Waples RS, Gaggiotti O.. INVITED REVIEW: what is a population? An empirical evaluation of some genetic methods for identifying the number of gene pools and their degree of connectivity. Mol Ecol 15: 1419-1439","257753768":"Characteristics of the variance effective population size over time using an age structured model with variable size","289984189":"Mixture or mosaic? Genetic patterns in UK grey squirrels support a human-mediated ‘long-jump’ invasion mechanism","272751031":"Estimation of the variance effective population size in age structured populations","231743015":"Demographic history of an elusive carnivore: Using museums to inform management","275586965":"Effect of sampling methods, effective population size and migration rate estimation in Glossina palpalis palpalis from Cameroon","222103749":"Antao T, Perez-Figueroa A, Luikart G.. Early detection of population declines: high power of genetic monitoring using effective population size estimators. Evol Appl 4: 144-154","225667720":"Genetic monitoring and effects of stocking practices on small Cyprinus carpio populations","7658376":"Temporal variation of the population structure and genetic diversity of Farfantepenaeus notialis assessed by allozyme loci","51119856":"PEDAGOG: software for simulating eco-evolutionary population dynamics"},"index":227}