{"abs":"To reduce the computational effort of reliability-based design optimization (RBDO), the response surface method (RSM) has been widely used to evaluate reliability constraints. We propose an efficient methodology for solving RBDO problems based on an improved high order response surface method (HORSM) that takes advantage of an efficient sampling method, Hermite polynomials and uncertainty contribution concept to construct a high order response surface function with cross terms for reliability analysis. The sampling method generates supporting points from Gauss-Hermite quadrature points, which can be used to approximate response surface function without cross terms, to identify the highest order of each random variable and to determine the significant variables connected with point estimate method. The cross terms between two significant random variables are added to the response surface function to improve the approximation accuracy. Integrating the nested strategy, the improved HORSM is explored in solving RBDO problems. Additionally, a sampling based reliability sensitivity analysis method is employed to reduce the computational effort further when design variables are distributional parameters of input random variables. The proposed methodology is applied on two test problems to validate its accuracy and efficiency. The proposed methodology is more efficient than first order reliability method based RBDO and Monte Carlo simulation based RBDO, and enables the use of RBDO as a practical design tool.","title":"Reliability-based design optimization via high order response surface method","id":257775364,"url":"https://www.researchgate.net/publication/257775364_Reliability-based_design_optimization_via_high_order_response_surface_method","names":["Hong-Shuang Li","Journal of Mechanical Science and Technology"],"references":{"222305920":"A general procedure for first/second-order reliabilitymethod (FORM/SORM)","269207695":"Safety-factor based approach for probability-based design optimization","222527371":"High-order limit state functions in the response surface method for structural reliability analysis","256379905":"Structural Reliability Under Combined Random Load Sequences","245310870":"Reliability Based Design Optimization for Multidisciplinary Systems Using Response Surfaces","229563172":"Response surface approximations for structural optimization","223592988":"A new look at the response surface approach for reliability analysis","264031208":"A new high-order response surface method for structural reliability analysis","223416196":"“Response surface method using vector projeted sampling points”","263047733":"Structural Reliability Methods","222809246":"A response surface method based on weighted regression for structural reliability analysis","270007886":"New Point Estimates for Probability Moments","229328945":"Cumulative formation of response surface and its use in reliability analysis","228981886":"An Investigation of Nonlinearity of Reliability-Based Design Optimization Approaches","243758427":"An Exact and Invariant First Order Reliability Format","248560911":"Importance sampling in structural system","230282982":"Approximation methods for reliability‐based design optimization problems","4658405":"Computational methods for efficient structural reliability and reliability sensitivity analysis. AIAA J","222400355":"A new response surface methodology for reliability-based design optimization","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","7200266":"Point estimates for probability","225655003":"Support vector machine for structural reliability analysis","267004355":"Numerical methods in engineering with MATLAB. 2nd ed","222287247":"Neural-network-based reliability analysis: A comparative study","226311758":"Comparison of global and local response surface techniques in reliability-based optimization of composite structures","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","222174282":"Variable screening and ranking using sampling-based sensitivity measures","225383577":"A probabilistic design system for reliability-based design optimization","222780925":"A new adaptive importance sampling scheme","279368156":"Reliability-Based Optimum Structural Design","223906278":"Application of Kriging method to structural reliability","226418689":"A survey on approaches for reliability-based optimization. Struct Multidiscip Optim"},"citedIn":{"282553899":"Process optimization of a non-circular drawing sequence based on multi-surrogate assisted meta-heuristic algorithms","282583930":"Probabilistic Analysis Of A Space Truss By Means Of A Multidimensional Variable Description"},"index":228}