{"abs":"Approximate Bayesian Computation (ABC) is a useful class of methods for Bayesian inference when the likelihood function is computationally intractable. In practice, the basic ABC algorithm may be inefficient in the presence of discrepancy between prior and posterior. Therefore, more elaborate methods, such as ABC with the Markov chain Monte Carlo algorithm (ABC-MCMC), should be used. However, the elaboration of a proposal density for MCMC is a sensitive issue and very difficult in the ABC setting, where the likelihood is intractable. We discuss an automatic proposal distribution useful for ABC-MCMC algorithms. This proposal is inspired by the theory of quasi-likelihood (QL) functions and is obtained by modelling the distribution of the summary statistics as a function of the parameters. Essentially, given a real-valued vector of summary statistics, we reparametrize the model by means of a regression function of the statistics on parameters, obtained by sampling from the original model in a pilot-run simulation study. The QL theory is well established for a scalar parameter, and it is shown that when the conditional variance of the summary statistic is assumed constant, the QL has a closed-form normal density. This idea of constructing proposal distributions is extended to non constant variance and to real-valued parameter vectors. The method is illustrated by several examples and by an application to a real problem in population genetics.","title":"Approximate Bayesian Computation by Modelling Summary Statistics in a Quasi-likelihood Framework","id":276296427,"url":"https://www.researchgate.net/publication/276296427_Approximate_Bayesian_Computation_by_Modelling_Summary_Statistics_in_a_Quasi-likelihood_Framework","names":["Stefano Cabras","Maria Eugenia Castellanos","Erlis Ruli"],"references":{"225519985":"Non-linear regression models for Approximate Bayesian Computation. Statistics and Computing, 20: 63-73","224942825":"Robust likelihood functions in Bayesian inference","23995500":"Toni T, Welch D, Strelkowa N, Ipsen A, Stumpf MPApproximate Bayesian computation scheme for parameter inference and model selection in dynamical systems. J R Soc Interface 6: 187-202","23306983":"Inferring population history with DIY ABC: a user-friendly approach to Approximate Bayesian","280685375":"On power transformation to summetry","234119538":"Diagnostic tools of approximate Bayesian computation using the coverage\nproperty","38359887":"Additive Regression and Other Nonparametric Models","6540772":"Sequential Monte Carlo without likelihoods. Proc Natl Acad Sci","5794655":"Using Likelihood-Free Inference to Compare Evolutionary Dynamics of the Protein Networks of H. pylori and P. falciparum","51992084":"Numerical Methods for Unconstrained Optimization and Nonlinear Equations. SIAM, Philadelphia","230837581":"A Novel Approach for Choosing Summary Statistics in Approximate Bayesian Computation","5207263":"Adjusted profile estimating function","45630121":"Statistical inference for noisy nonlinear ecological dynamic systems","8015848":"Bayesian Estimation of Recent Migration Rates after a Spatial Expansion","236864390":"Statistical modelling of summary values leads to accurate Approximate Bayesian Computations","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","235217055":"A new approach to choose acceptance cutoff for approximate Bayesian computation","237131704":"Quasi-Likelihood and Its Application. A General Approach to Optimal Parameter Estimation. Springer Ser. Statist. Springer","4742867":"Inference for Stereological Extremes","250750546":"Quasi Bayesian likelihood","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","24052300":"Quasi profile and directed likelihoods from estimating functions","5207142":"Modified estimating functions","234087001":"Approximate Bayesian computation via empirical likelihood","46511338":"Adaptive approximate Bayesian computation","7155394":"Using Approximate Bayesian Computation to Estimate Tuberculosis Transmission Parameters From Genotype Data","51500478":"A strategy analysis for genetic association studies with known inbreeding","230569226":"New Insights Into Approximate Bayesian Computation","242997324":"Robustness of ranking and selection rules using generalised g-and- k distributions","225552329":"Improving ABC for quantile distributions","5140213":"Indirect Inference","5255057":"Modeling DNA Methylation in a Population of Cancer Cells","44587630":"HIV with contact-tracing: a case study in Approximate Bayesian Computation","257665552":"Considerate approaches to constructing summary statistics for ABC model selection","24052643":"Quasi-Profile Log Likelihoods for Unbiased Estimating Functions","37965453":"Inference Based on Estimating Functions in the Presence of Nuisance Parameters","247428337":"Robust Estimation of Location","224934695":"Bayesian composite marginal likelihoods","224934714":"Default prior distributions from quasi- and quasi-profile likelihoods","45910632":"Constructing Summary Statistics for Approximate Bayesian Computation:\nSemi-automatic ABC","4914194":"Estimating functions in indirect inference","259254442":"Semi-automatic selection of summary statistics for ABC model choice","222343066":"Modified quasi-profile likelihoods from estimating functions","221664876":"Blum MGB, Nunes MA, Prangle D, Sisson SA.. A comparative review of dimension reduction methods in approximate Bayesian computation. Stat Sci 28: 189-208","242997147":"Optimal estimating functions, quasi-likelihood and statistical modelling","4789037":"Parameter Orthogonality and Bias Adjustment for Estimating Functions","243082519":"On Power Transformations to Symmetry","259010205":"Approximate Bayesian Computation with composite score functions","14140218":"Inferring Coalescence Times From DNA Sequence Data","5344809":"An Approximate Bayesian Computation Approach to Overcome Biases That Arise When Using Amplified Fragment Length Polymorphism Markers to Study Population Structure","262730322":"A Quasi likelihood approximation of posterior distributions for likelihood-intractable complex models","8970227":"Markov Chain Monte Carlo without likelihoods","228578659":"On the geometric ergodicity of Metropolis-Hastings algorithms"},"citedIn":{},"index":229}