{"abs":"A new genetic estimator of the effective population size (N(e)) is introduced. This likelihood-based (LB) estimator uses two temporally spaced genetic samples of individuals from a population. We compared its performance to that of the classical F-statistic-based N(e) estimator (N(eFk)) by using data from simulated populations with known N(e) and real populations. The new likelihood-based estimator (N(eLB)) showed narrower credible intervals and greater accuracy than (N(eFk)) when genetic drift was strong, but performed only slightly better when genetic drift was relatively weak. When drift was strong (e.g., N(e) \u003d 20 for five generations), as few as approximately 10 loci (heterozygosity of 0.6; samples of 30 individuals) are sufficient to consistently achieve credible intervals with an upper limit \u003c50 using the LB method. In contrast, approximately 20 loci are required for the same precision when using the classical F-statistic approach. The N(eLB) estimator is much improved over the classical method when there are many rare alleles. It will be especially useful in conservation biology because it less often overestimates N(e) than does N(eLB) and thus is less likely to erroneously suggest that a population is large and has a low extinction risk.","title":"Likelihood-Based Estimation of the Effective Population Size Using Temporal Changes in Allele Frequencies: A Genealogical Approach","id":11499631,"url":"https://www.researchgate.net/publication/11499631_Likelihood-Based_Estimation_of_the_Effective_Population_Size_Using_Temporal_Changes_in_Allele_Frequencies_A_Genealogical_Approach","names":["Pierre Berthier","Mark A Beaumont","Jean-Marie Cornuet","Gordon Luikart","Genetics"],"references":{"14378842":"Coalescents and Genealogical Structure Under Neutrality","227745362":"Temporal Changes in Allele Frequencies and a Population’s History of Severe Bottlenecks","11886642":"Estimation of Admixture Proportions: A Likelihood-Based Approach Using Markov Chain Monte Carlo","23444076":"Effective population size/adult population size ratios in wildlife: A review. Genet. Res., 66, 95-107","227680411":"Consequences of the founder effect in the genetic structure of introduced island coral reef fish populations","13240262":"Luikart, G, Cornuet, J-M. Estimating the effective number of breeders from heterozygote excess in progeny. Genetics, 151: 1211-1216","227901720":"Effective population size and persistence of Anopheles arabiensis during the dry season in West Africa","231846236":"Microsatellite analysis of genetic diversity in fragmented South African buffalo populations","13629312":"Luikart G, Allendorf FW, Cornuet JM, Sherwin WB.. Distortion of allele frequency distributions provides a test for recent population bottlenecks. J Hered 89: 238-247","12720589":"Cornuet JM, Piry S, Luikart G, Estoup A, Solignac M. New methods employing multilocus genotypes to select or exclude populations as origins of individuals. Genetics 153: 1989-2000","16690287":"Tavare, S. Line-of-descent and genealogical processes, and their applications in population genetics models. Theor. Popul. Biol. 26, 119-164","288592608":"Low effective sizes in hatchery populations of the European oyster (Ostrea edulis): Implications for the management of genetic resources","13240605":"Temporal changes in genetic variation of North European cattle breeds","248338900":"Effective population numbers of shellfish broodstocks estimated from temporal variance in allelic frequencies. Aquaculture","4752593":"Inference in Molecular Population Genetics","12485540":"Ancestral Processes in Population Genetics—the Coalescent","6557374":"Pollak E. A new method for estimating the effective population size from allele frequency changes. Genetics 104: 531-548","12226406":"Monte Carlo Evaluation of the Likelihood for Ne From Temporally Spaced Samples","240264590":"Variance effective population size based on multilocus gamete frequencies in coniferous populations: An example of a Scots pine clonal seed orchard","14479226":"Gene genealogies within mutant allelic classes","15385472":"Developments in the Prediction of Effective Population Size","227916351":"Founder events and variation at microsatellite loci in an insular passerine bird, the Laysan Finch (Telespiza cantans)","12275223":"Experimental evaluation of the usefulness of microsatellite DNA for detecting demographic bottlenecks. Mol Ecol 9:1517-1528","20423963":"Waples, R. S. A generalized approach for estimating effective population size from temporal changes in allele frequency. Genetics 121, 379-391","230693356":"Inbreeding and extinction in a butterfly metapopulation. Nature","14398197":"Jorde PE, Ryman N. Demographic genetics of brown trout (Salmo trutta) and estimation of effective population size from temporal change of allele frequencies. Genetics 143: 1369-1381","38348711":"Local Likelihood Density Estimation","13847101":"Miller LM, Kapuscinski AR. Historical analysis of genetic variation reveals low effective populations size in a northern pike (Esox lucius) population. Genetics 147: 1249-1258","241736327":"Markov Chain Monte Carlo in Practice","261541497":"Schwartz MK, Tallmon DA, Luikart G.. Review of DNA-based census and effective population size estimators. Anim Conserv 1: 293-299","227638816":"Small effective population size in the long-toed salamander. Mol. Ecol., 8, 1633-1640","13240248":"Inbreeding of bottlenecked butterfly populations: Estimation using the likelihood of changes in marker allele frequencies","25455152":"Genetic divergence and units for conservation in the Komodo Dragon Varanus komodoensis.","12944828":"Using Maximum Likelihood to Estimate Population Size From Temporal Changes in Allele Frequencies","216300830":"R: A Language for Data Analysis and Graphics","6554328":"Nei M, Tajima F. Genetic drift and estimation of effective population size. Genetics 98: 625-640","258429850":"Effective number of pollen parents in clonal seed orchards","231900269":"Estimation of Effective Population Size from Data on Linkage Dis Equilibrium"},"citedIn":{"228629411":"Spatiotemporal analysis shows stable genetic differentiation and barriers to dispersal in Eurasian perch (Perca fluviatilis L.)","228362136":"Molecular approaches to the study of invasive seaweeds","51417879":"Okello JBA, Wittemyer G, Rasmussen HB, Arctander P, Nyakaana S, Douglas-Hamilton I et al.. Effective population size dynamics reveal impacts of historic climatic events and recent anthropogenic pressure in African elephants. Mol Ecol 17: 3788-3799","7696498":"Wang JL. Estimation of effective population sizes from data on genetic markers. Philos Trans R Soc Lond B 360: 1395-1409","226271611":"Experimental microevolution: Transplantation of pink salmon into the European North","6688367":"Temporal Estimates of Effective Population Size in Species With Overlapping Generations","273317184":"Variability of Biological and Population Genetic Indices in Pink Salmon, Oncorhynchus gorbuscha Transplanted into the White Sea Basin","6119254":"Unbiased Estimator for Genetic Drift and Effective Population Size","8999045":"Østergaard S, Hansen MM, Loeschcke V, Nielsen EE. Long-term temporal changes of genetic composition in brown trout (Salmo trutta L.) populations inhabiting an unstable environment. Mol Ecol 12: 3123-3135","229684414":"Conservation Genetics","229404348":"MHC class II DQA gene variation across cohorts of brown hares (Lepus europaeus) from eastern Austria: Testing for different selection hypotheses","274069313":"Long-term persistence and evolutionary divergence of a marine fish population with a very small effective population size (Kildin cod Gadus morhua kildinensis)","274440014":"Microsatellite Analysis of Genetic Diversity of the Vietnamese Sika Deer (Cervus nippon pseudaxis)","7903330":"An Efficient Monte Carlo Method for Estimating Ne From Temporally Spaced Samples Using a Coalescent-Based Likelihood","234026990":"Temporal Genetic Similarity Among Year-Classes of the Pacific Geoduck Clam (Panopea generosa Gould 1850): A Species Exhibiting Spatial Genetic Patchiness","226573469":"Reconciling Genetic and Demographic Estimators of Effective Population Size in the Anuran Amphibian Bufo Calamita","45826983":"Franckowiak RP, Sloss BL, Bozek MA, Newman SP.. Temporal effective size estimates of a managed walleye Sander vitreus population and implications for genetic-based management. J Fish Biol 74: 1086-1103","24354670":"Wang JL.. A new method for estimating effective population sizes from a single sample of multilocus genotypes. Mol Ecol 18: 2148-2164","277865105":"Applications of microsatellite markers to genetic management of carps in aquaculture","221972260":"Microsatellite genotyping reveals end-Pleistocene decline in mammoth autosomal genetic variation","226447456":"Reduced Genetic Diversity and Effective Population Size in an Endangered Atlantic Salmon (Salmo Salar) Population from Maine, USA","225249612":"Small effective population sizes of two remnant ocelot populations (Leopardus pardalis albescens) in the United States","227180201":"Buzan EV, Krystufek B, Bryja J.. Microsatellite markers confirm extensive population fragmentation of the endangered Balkan palaeoendemic Martino’s vole (Dinaromys bogdanovi). Conserv Gen 11: 1783-1794","41397586":"An examination of genetic diversity and effective population size in Atlantic salmon","271459595":"Effects of population size and isolation on the genetic structure of the East African mountain white-eye Zosterops poliogaster (Aves)","226999969":"Postglacial loss of microsatellite variation in the landlocked Lake Saimaa ringed seal","237979656":"Potential Use of Molecular Markers in the Genetic Improvement of Livestock","40268353":"Diversité génétique et taille efficace chez les populations de poissons sauvages : le cas du saumon atlantique un poisson migrateur amphihalin menacé","8779695":"Lucchini V, Galov A, Randi E.. Evidence of genetic distinction and long-term population decline in wolves (Canis lupus) in the Italian Apennines. Mol Ecol 13: 523-536","228549813":"Reproduction in the Wild: The Effect of Individual Life History Strategies on Population Dynamics and Persistence","7604569":"Genetic Variation and Selection Response in Model Breeding Populations of Brassica rapa Following a Diversity Bottleneck","8061782":"Estimation of effective population size and detection of a recent population decline coinciding with habitat fragmentation in a round beetle","260447403":"Influenza Virus Drug Resistance: A Time-Sampled Population Genetics Perspective","275195976":"Genetic history of the population of Atlantic salmon, Salmo salar L., under restoration in the Connecticut River, USA","229480578":"Large variation in the ratio of effective breeding and census population sizes between two species of pond-breeding anurans","273326437":"Estimating Effective Population Size from Temporally Spaced Samples with a Novel, Efficient Maximum-Likelihood Algorithm","26244770":"A Test and Review of the Role of Effective Population Size on Experimental Sexual Selection Patterns","260114354":"Microsatellites and multiplex PCRs for assessing aquaculture practices of the grooved carpet shell Ruditapes decussatus in Spain","47933423":"Genetic diversity and phylogeography of landlocked seals","222545781":"Measurably evolving populations","222031884":"Reduced effective population size in an overexploited population of Nile crocodile (Crocodylus niloticus)","228762008":"Dispersal in a stream dwelling salmonid: Inferences from tagging and microsatellite studies","220013094":"Evidence for a discrete evolutionary lineage within Equatorial Guinea suggests that tsetse fly Glossina palpalis palpalis exists as a species complex.","8469693":"Comparative evaluation of a new effective population size estimator based on approximate Bayesian computation. Genetics 167: 977-988","258261849":"Preservation of genetic diversity in a wild and captive population of a rapidly declining mammal, the Common hamster of the French Alsace region","222188803":"Genetic diversity and effective population size in mass selection lines of Pacific oyster (Crassostrea gigas)","50986570":"Historical sampling reveals dramatic demographic changes in western gorilla populations","6457889":"Estimating a geographically explicit model of population divergence. Evol Int J Org Evol","225684535":"Borrell YJ, Bernardo D, Blanco G, Vazquez E, Sanchez JA. Spatial and temporal variation of genetic diversity and estimation of effective population sizes in Atlantic salmon (Salmo salar, L.) populations from Asturias (Northern Spain) using microsatellites. Cons Gen 9: 807-819","8395205":"Johnson JA, Bellinger MR, Toepfer JE, Dunn P.. Temporal changes in allele frequencies and low effective population size in greater prairie-chickens. Mol Ecol 13: 2617-2630","5989149":"Fraser DJ, Hansen MM, Østergaard S, Tessier N, Legault M, Bernatchez L. Comparative estimation of effective population sizes and temporal gene flow in two contrasting population systems. Mol Ecol 16: 3866-3889","23809056":"Palstra FP, Ruzzante DE.. Genetic estimates of contemporary effective population size: what can they tell us about the importance of genetic stochasticity for wild population persistence? Mol Ecol 17: 3428-3447","11536125":"DNA reveals high dispersal synchronizing the population dynamics of Canada lynx","7563325":"Wondji C, Simard F, Lehmann T, Fondjo E, Samè-Ekobo A, Fontenille D. Impact of insecticide-treated bed nets implementation on the genetic structure of Anopheles arabiensis in an area of irrigated rice fields in the Sahelian region of Cameroon. Mol Ecol 14: 3683-3693","47932820":"Bayesian analysis of community dynamics","282874515":"Temporal genetic analysis of the endangered tidewater goby: Extinction-colonization dynamics or drift in isolation?","228751858":"Source–Sink dynamics sustain central stonerollers (Campostoma anomalum) in a heavily urbanized catchment","227119323":"Waples RS. A bias correction for estimates of effective population size based on linkage disequilibrium at unlinked gene loci. Cons Gen 7: 167-184","267429282":"Population characteristics and estimates of effective population size in a house sparrow metapopulation","226646480":"Boessenkool S, Star B, Seddon PJ, Waters JM.. Temporal genetic samples indicate small effective population size of the endangered yellow-eyed penguin. Conserv Genet 11: 539-546","230027494":"Measuring Recruitment in an Invasive Species to Determine Eradication Potential","282670222":"Temporal Changes in Atlantic Bluefin Tuna Genetic Variation","41103658":"Temporal Variation in Genetic Structure of the Chinese Rare Minnow (Gobiocypris rarus) in Its Type Locality Revealed by Microsatellite Markers","5972992":"The effects of cyclic dynamics and mating system on the effective size of an island mouflon population","51522638":"Temporal variation in genetic diversity and effective population size of Mediterranean and subalpine Arabidopsis thaliana populations","229660140":"Population structure and its implications for conservation of the great silver beetle Hydrophilus piceus in Britain","265609866":"Population Genetics Inference for Longitudinally-Sampled Mutants Under Strong Selection","279458248":"Evaluating methods for estimating local effective population size with and without migration","225643794":"Estimating effective population size from linkage disequilibrium: Severe bias in small samples","284246931":"The impact of selection on population genetic structure in the clam Meretrix petechialis revealed by microsatellite markers","6274871":"A potential bias in the temporal method for estimating Ne in admixed populations under natural selection","8118546":"Hoffman EA, Schueler FW, Blouin MS. Effective population sizes and temporal stability of genetic structure in Rana pipiens, the northern leopard frog. Evolution 58: 2536-2545","8199953":"Balloux F.. Heterozygote excess in small populations and the heterozygote-excess effective population size. Evolution 58: 1891-1900","232085690":"The population structure of Glossina fuscipes fuscipes in the Lake Victoria basin in Uganda: Implications for vector control","227235044":"Brown Trout (Salmo trutta) invasiveness: plasticity in life-history is more important than genetic variability. Biol Invasions","227758816":"Stability of genetic structure and effective population size inferred from temporal changes of microsatellite DNA polymorphisms in the land snail Helix Aspersa (Gastropoda: Helicidae)","4085837":"A broadband SiGe mixer for 5-GHz WLAN applications with X-band quadrature generation and high image-rejection","5277733":"Estimation of the number of founders of an invasive pest insect population: The fire ant Solenopsis invicta in the USA","6895902":"A note on the accuracy of PAC-likelihood inference with microsatellite data","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","44628693":"Objectives, criteria and methods for using molecular genetic data in priority setting for conservation of animal genetic resources. Anim Genet","227679215":"Spatio‐temporal genetic variability in sea trout (Salmo trutta) populations from north‐western Spain","229366486":"Spatial and temporal analysis of the Cuban white shrimp Penaeus (Litopenaeus) schmitti","260523014":"Fine-scale phylogeographic contact zone in Austrian brown trout Salmo trutta reveals multiple waves of post-glacial colonization and a pre-dominance of natural versus anthropogenic admixture","261915934":"Effects of population characteristics and structure on estimates of effective population size in a house sparrow metapopulation","23180516":"Small effective population sizes in two planktonic freshwater copepod species (Eudiaptomus) with apparently large census sizes","259119094":"Simulation-based Bayesian inference for epidemic models","235737226":"Status and trends in genetic resources of capture fisheries","51638939":"Focal autoimmune cause meningoencephalitis.","258129643":"Ecologia Molecular","229875258":"A review of ecological models for brown trout: Towards a new demogenetic model","222008241":"Microsatellite analysis of the genetic structure of captive forest musk deer populations and its implication for conservation","236031645":"Temporal genetic variation as revealed by a microsatellite analysis of European sardine (Sardina pilchardus) archived samples","26865941":"Polymorphisms in the ovine myostatin gene (MSTN) and their association with growth and carcass traits in New Zealand Romney sheep","233385592":"Can Genetic Estimators Provide Robust Estimates of the Effective Number of Breeders in Small Populations?","8923167":"Effective size of two feral domestic cat populations (Felis catus L.): Effect of the mating system","279163956":"Estimating effective population size of guanacos in Patagonia: an integrative approach for wildlife conservation","289857244":"EFFECTIVE POPULATION SIZES AND TEMPORAL STABILITY OF GENETIC STRUCTURE IN RANA PIPIENS, THE NORTHERN LEOPARD FROG","27313979":"CAMBIAMENTI TEMPORALI NELLA DIVERSITÀ GENETICA DEL\nTONNO ROSSO (Thunnus thynnus) DEL MEDITERRANEO","230586402":"Ancient DNA Reveals Genetic Stability Despite Demographic Decline: 3,000 Years of Population History in the Endemic Hawaiian Petrel","222569946":"Genetic variation losses in Atlantic salmon stocks created for supportive breeding","232740479":"From nature to the laboratory: The impact of founder effects on adaptation","5951225":"Genetic evidence for a recent divergence and subsequent gene flow between Spanish and Eastern imperial eagles","8260061":"On the Distribution of Temporal Variations in Allele Frequency Consequences for the Estimation of Effective Population Size and the Detection of Loci Undergoing Selection","233236546":"Atlantic Salmon at Risk: Apparent Rapid Declines in Effective Population Size in Southern European Populations","30479991":"Population genetics of plaice (pleuronectes platessa L.) in Northern Europe","45827095":"The power of genetic monitoring for studying demography, ecology and genetics of a reintroduced bear population","6505933":"Demographic and Genetic Estimates of Effective Population and Breeding Size in the Amphibian Rana temporaria","229308164":"Identification of differential broodstock contribution affecting genetic variability in hatchery stocks of Atlantic salmon (Salmo salar)","230019077":"Substantial loss of genetic variation in a single generation of Senegalese sole (Solea senegalensis) culture","274727121":"Temporal Stability of Genetic Variability and Differentiation in the Three-Spined Stickleback (Gasterosteus aculeatus)","260107571":"Assessing the Maximum Contribution from Ancient Populations","264636275":"Investigating Population History Using Temporal Genetic Differentiation","8228808":"Estimation of genetically effective breeding numbers using a rejection algorithm approach","49652032":"The Use of Genetics for the Management of a Recovering Population: Temporal Assessment of Migratory Peregrine Falcons in North America","229921026":"Genetic diversity and effective size of the Atlantic salmon Salmo salar L. inhabiting the River Eo (Spain) following a stock collapse","242557122":"Approches multicritères de l\u0027évolution de la variab ilité génétique et de la taille efficace au sein des populations animales soumises à sélecti on Analysis of the within-population genetic diversity and the effective size based on different kinds of information in selected animal populations","8077516":"Excoffier L, Estoup A, Cornuet JM.. Bayesian analysis of an admixture model with mutations and arbitraily linked markers. Genetics 169: 1727-1738","232685161":"DeYoung RW, Honeycutt RS. The molecular toolbox: genetic techniques in wildlife ecology and management. J Wildl Manage 69: 1362-1384","226711867":"Estimation of census and effective population sizes: The increasing usefulness of DNA-based approaches","26682927":"Evidence for a discrete evolutionary lineage within Equatorial Guinea suggests that tsetse fly Glossina palpalis palpalis exists as a species complex.","223978979":"Short-Term Genetic Changes: Evaluating Effective Population Size Estimates in a Comprehensively Described Brown Trout (Salmo trutta) Population","44685842":"Temporally stable genetic variability in a fluctuating population of the root vole Microtus oeconomus","7605704":"Waples RS.. Genetic estimates of contemporary effective population size: to what time periods do the estimates apply? Mol Ecol 14: 3335-3352","225414610":"Rodrigues fruit bats (Pteropus rodricensis, Megachiroptera: Pteropodidae) retain genetic diversity despite population declines and founder events","229671950":"Understanding and Estimating Effective Population Size for Practical Application in Marine Species Management","49835320":"Temporal stability of Glossina fuscipes fuscipes populations in Uganda","258487977":"Phylogeography and conservation genetics of the fruit bat genus Pteropus (Megachiroptera) in the western Indian Ocean (PhD Thesis)","41040310":"Spatio-temporal population structuring and genetic diversity retention in depleted Atlantic Bluefin tuna of the Mediterranean Sea. Proc Natl Acad Sci USA","51474901":"Loss of genetic diversity in Culex quinquefasciatus targeted by a lymphatic filariasis vector control program in Recife, Brazil","5357460":"Estimation of 2Nes From Temporal Allele Frequency Data","7150499":"Aspi J, Roininen E, Ruokonen M, Kojola I, VilÀ C. Genetic diversity, population structure, effective population size and demographic history of the Finnish wolf population. Mol Ecol 15: 1561-1576","27476845":"Levels and patterns of genetic diversity in wild and cultured populations of mulloway (argyrosomus japonicus) using mitochondrial DNA and microsatellites","5890198":"Siol M, Bonnin I, Olivieri I, Properi JM, Ronfort J. Effective population size associated with self-fertilization: lessons from temporal changes in allele frequencies in the selfing annual Medicago truncatula. J Evol Biol 20: 2349-2360","7631269":"Microsatellite analysis of genetic diversity of the Vietnamese sika deer (Cervus nippon pseudaxis).","5774475":"Genetic Impact of a Severe El Niño Event on Galápagos Marine Iguanas (Amblyrhynchus cristatus)","222544534":"Geographic isolation, genetic divergence, and ecological non-exchangeability define ESUs in a threatened sky-island rattlesnake","288919535":"A model-derived short-term estimation method of effective size for small populations with overlapping generations","290112914":"HETEROZYGOTE EXCESS IN SMALL POPULATIONS AND THE HETEROZYGOTE-EXCESS EFFECTIVE POPULATION SIZE","225999265":"Evaluation of the Linkage Disequilibrium Method for Estimating Effective Population Size","232689924":"Leberg P. Genetic approaches for estimating the effective size of populations. J Wildl Manage 69: 1385-1399","226133665":"Effective number of breeding adults in Oregon spotted frogs (Rana pretiosa): Genetic estimates at two life stages","7414954":"Population structure of Anopheles arabiensis on La Réunion Island, Indian Ocean","6253699":"Watts PC, Saccheri IJ, Kemp SJ, Thompson DJ. Effective population sizes and migration rates in fragmented populations of an endangered insect (Coenagrion mercuriale: Odonata). J Anim Ecol 76: 790-800","230858014":"Rise and fall of a wolf population: Genetic diversity and structure during recovery, rapid expansion and drastic decline","7326385":"Long-term stability and effective population size in North Sea and Baltic Sea cod (Gadus morhua)","7745431":"Stocking impact and temporal stability of genetic composition in a brackish northern pike (Esox lucius L.), assessed using microsatellite DNA analysis of historical and contemporary samples","29490208":"Conséquences génétiques de la production intensive de larves d\u0027huîtres en écloserie : étude des processus de dérive et de sélection liés aux pratiques d\u0027élevage.","262421580":"WFABC: A Wright-Fisher ABC-based approach for inferring effective population sizes and selection coefficients from time-sampled data","5549245":"Evolutionary dynamics of molecular markers during local adaptation: a case study in Drosophila subobscura. BMC Evol Biol 9:133-135","10840142":"Miller CR, Waits LP. The history of effective population size and genetic diversity in the Yellowstone grizzly (Ursus arctos): implications for conservation. Proc Natl Acad Sci USA 100: 4334-4339","37985198":"Invasion ecology and genetics of Norway rats on New Zealand islands","11016793":"Hansen MM, Ruzzante DE, Nielsen EE, Bekkevold D, Mensberg KLD. Long-term effective population sizes, temporal stability of genetic composition and potential for local adaptation in anadromous brown trout (Salmo trutta) populations. Mol Ecol 11: 2523-2535","7658374":"Detecting historical bottlenecks using temporal genetic data.","231743015":"Demographic history of an elusive carnivore: Using museums to inform management","222512314":"Computing effective population size from molecular data: The case of three rare Spanish ruminant populations","38042814":"A comparison of single-sample effective size estimators using empirical Toad (Bufo calamita) population data: genetic compensation and population size-genetic diversity correlations","225667720":"Genetic monitoring and effects of stocking practices on small Cyprinus carpio populations","51140083":"Coombs JA, Letcher BH, Nislow KH. CREATE: software to create input files from diploid genotypic data for 52 genetic software programs. Mol Ecol Resour 8: 578-580"},"index":233}