{"abs":"Abstract— In this paper, the problem of joint Bayesian model selection and parameter estimation for sinusoids in white Gaussian noise is addressed. An original Bayesian model is proposed that allows us to define a posterior distribution on the parameter space. All Bayesian inference is then based on this distribution. Unfortunately, a direct evaluation of this distribution and of its features, including posterior model probabilities, requires evaluation of some complicated high-dimensional integrals. We develop an efficient stochastic algorithm based on reversible jump Markov chain Monte Carlo methods to perform the Bayesian computation. A convergence result for this algorithm is established. In simulation, it appears that the performance of detection based on posterior model probabilities outperforms conventional detection schemes. Index Terms— Bayesian methods, MCMC, model selection,","title":"Joint Bayesian detection and estimation of noisy sinusoids via reversible jump MCMC","id":243780135,"url":"https://www.researchgate.net/publication/243780135_Joint_Bayesian_detection_and_estimation_of_noisy_sinusoids_via_reversible_jump_MCMC","names":["C. Andrieu","A. Doucet"],"references":{"243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","200111118":"Markov Chains and Stochastic Stability","243103678":"[Bayesian Computation and Stochastic Systems]: Rejoinder","239029977":"On assessing Prior Distributions and Bayesian Regression Analysis with g-Prior Distributions","3175479":"Maximum likelihood estimation of the parameters of multiple sinusoids from noisy measurements","3316153":"Spectral analysis based on the canonical autoregressive decomposition","243782121":"Multiple Tone Parameter Estimation From Discrete‐Time Observations","243765672":"Strategies for improving MCMC","2348531":"On Bayesian analysis of mixture with unknown number of components","3027229":"A New Look At The Statistical Model Identification","222812561":"Modeling By Shortest Data Description.","230900404":"Bayesian inference and Gibbs sampling in spectral analysis and parameter estimation. I","225304570":"Non-Uniform Random Variate Generation","46951472":"Bayesian Spectrum Analysis and Parameter Estimation"},"citedIn":{"7138095":"Bayesian Analysis of Polyphonic western tonal Music","2579812":"Multidimensional Optimisation of Harmonic Signals","38326989":"Computational Advances for and from Bayesian Analysis","2845155":"Bayesian Harmonic Models for Musical Signal Analysis","228722088":"Bayesian harmonic models for musical pitch estimation and analysis","268274801":"The Estimation Methods for an Integrated INS/GPS UXO Geolocation System","4993344":"Inference and model choice for sequentially ordered hidden Markov models","3321663":"Monte Carlo methods for signal processing: A review in the statistical signal processing context","220226991":"Bayesian method for NLOS mitigation in single moving sensor Geo-location","223103960":"Joint estimation of source number and DOA using simulated annealing algorithm","220227574":"A Bayesian approach to harmonic retrieval with clipped data","34907534":"Sound source separation in monaural music signals /","1825409":"Sequential monte carlo samplers","3317394":"Joint Bayesian detection and estimation of noisy sinusoids via reversible jump MCMC","2474885":"Bayesian Harmonic Models for Musical Signal Analysis","2475009":"Hierarchical Bayesian Classification Of Chirp Signals","3318230":"Classification of Chirp Signals using Hierarchical Bayesian Learning and MCMC Methods","6013559":"Time-domain Bayesian detection and estimation of noisy damped sinusoidal signals applied to NMR spectroscopy","30518271":"Modélisation de signaux fortement non stationnaires à phase et à amplitude locales polynomiales.","3949139":"Bayesian deconvolution in nuclear spectroscopy using RJMCMC","3949070":"Hierarchical Bayesian classification of chirp signals","227276601":"An Introduction to MCMC for Machine Learning","2872671":"On Sinusoidal Parameter Estimation","3864909":"Stochastic algorithms for marginal MAP retrieval of sinusoids in non-Gaussian noise","224641562":"Spectral Analysis of Irregularly Sampled Data Using a Bernoulli-Gaussian Model with Free Frequencies","220852884":"Metropolis Photon Sampling with Optional User Guidance","4993330":"Sequential Monte Carlo Samplers","3830533":"Polyphonic pitch tracking using joint Bayesian estimation of multiple frame parameters"},"index":236}