{"abs":"The heterozygote-excess method is a recently published method for estimating the effective population size (Ne). It is based on the following principle: When the effective number of breeders (Neb) in a population is small, the allele frequencies will (by chance) be different in males and females, which causes an excess of heterozygotes in the progeny with respect to Hardy-Weinberg equilibrium expectations. We evaluate the accuracy and precision of the heterozygote-excess method using empirical and simulated data sets from polygamous, polygynous, and monogamous mating systems and by using realistic sample sizes of individuals (15-120) and loci (5-30) with varying levels of polymorphism. The method gave nearly unbiased estimates of Neb under all three mating systems. However, the confidence intervals on the point estimates of Neb were sufficiently small (and hence the heterozygote-excess method useful) only in polygamous and polygynous populations that were produced by \u003c10 effective breeders, unless samples included \u003e approximately 60 individuals and 20 multiallelic loci.","title":"Luikart, G, Cornuet, J-M. Estimating the effective number of breeders from heterozygote excess in progeny. Genetics, 151: 1211-1216","id":13240262,"url":"https://www.researchgate.net/publication/13240262_Luikart_G_Cornuet_J-M_Estimating_the_effective_number_of_breeders_from_heterozygote_excess_in_progeny_Genetics_151_1211-1216","names":["Gordon Luikart","J M Cornuet","Genetics"],"references":{"13718233":"Estoup, A, Rousset, F, Michalakis, Y, Cornuet, J -M, Adriamanga, M, Guyomard, R. Comparative analysis of microsatellite and allozyme markers: a case study investigating microgeographic differentiation in brown trout (Salmo trutta). Mol Ecol, 7: 339-353","20423963":"Waples, R. S. A generalized approach for estimating effective population size from temporal changes in allele frequency. Genetics 121, 379-391","17732579":"Behavior and Genetic Variation in Natural Populations","14327604":"Pudovkin, AI, Zaykin, DV, Hedgecock, D. On the potential for estimating the effective number of breeders from heterozygote-excess in progeny. Genetics, 144: 383-387","18635522":"Hill, W. G.. Estimation of linkage disequilibrium in random mating populations. Heredity, 33: 229-239","13629312":"Luikart G, Allendorf FW, Cornuet JM, Sherwin WB.. Distortion of allele frequency distributions provides a test for recent population bottlenecks. J Hered 89: 238-247"},"citedIn":{"223496400":"Genetic identification of wild and domesticated strains of chinook salmon (Oncorhynchus tshawytscha) in southern British Columbia, Canada","257075664":"Non-Invasive Sampling of Schistosomes from Humans Requires Correcting for Family Structure","226930944":"Genetic Risks of Marine Hatchery Enhancement: The Good, the Bad, and the Unknown","7696498":"Wang JL. Estimation of effective population sizes from data on genetic markers. Philos Trans R Soc Lond B 360: 1395-1409","225104610":"Past bottlenecks and current population fragmentation of endangered huemul deer (Hippocamelus bisulcus): Implications for preservation of genetic diversity","238750898":"MOLECULAR TOOLS REVEAL HIERARCHICAL STRUCTURE AND PATTERNS OF MIGRATION AND GENE FLOW IN BULL TROUT (SALVELINUS CONFLUENTUS) POPULATIONS OF SOUTH-WESTERN ALBERTA","225125984":"Sampling properties of the heterozygote-excess estimator of the effective number of breeders","235951645":"Effective population size in Drosophila subobscura: Ecological and molecular approaches","257549655":"Inferring the ancestry of African wild dogs that returned to the Serengeti-Mara","229684414":"Conservation Genetics","43002526":"Strategies for the retention of high genetic variability in European flat oyster (Ostrea edulis) restoration programmes","280306849":"Example of the application the microsatellite DNA fragments in the study of farmed European catfish (Silurus glanis, L.) broodstock","6651377":"Spawning, copulation and inbreeding coefficients in marine invertebrates","26742028":"Population genetic structure of wild and farmed rusa deer (Cervus timorensis russa) in New-Caledonia inferred from polymorphic microsatellite loci","41138534":"Estimation of parameters of inbreeding and genetic drift in populations with overlapping generations","8061933":"Withler RE, Supernault KJ, Miller KM. Genetic variation within and among domesticated Atlantic salmon broodstocks in British Columbia, Canada. Anim Genet 36: 43-50","279490097":"On some genetic consequences of social structure, mating systems, dispersal, and sampling","226108896":"Historical and recent genetic bottlenecks in European Graylings, Thymallus thymallus","11495861":"Wang JL. A pseudo-likelihood method for estimating effective population size from temporally spaced samples. Genet Res 78: 243-257","234026990":"Temporal Genetic Similarity Among Year-Classes of the Pacific Geoduck Clam (Panopea generosa Gould 1850): A Species Exhibiting Spatial Genetic Patchiness","24354670":"Wang JL.. A new method for estimating effective population sizes from a single sample of multilocus genotypes. Mol Ecol 18: 2148-2164","221821861":"Selection Maintains MHC Diversity through a Natural Population Bottleneck","277865105":"Applications of microsatellite markers to genetic management of carps in aquaculture","232668481":"Preliminary Insights Into the Level of Genetic Variation Retained in the Endangered Echo Parakeet (Psittacula eques) Towards Assisting Its Conservation Management","51666613":"Effective population size of natural populations of Drosophila buzzatii, with a comparative evaluation of nine methods of estimation","5621744":"Oceanic variability and coastal topography shape genetic structure in a long-dispersing sea urchin. Ecology","233542350":"Sweepstakes Reproductive Success in Highly Fecund Marine Fish and Shellfish: A Review and Commentary","279491213":"PNAS-2015-Parreira-Social Groups w SM","11295498":"Castric V, Bernatchez L, Belkhir K, Bonhomme F.. Heterozygote deficiencies in small lacustrine populations of brook charr Salvelinus Fontinalis Mitchill (Pisces, Salmonidae): a test of alternative hypotheses. Heredity (Edinb) 89: 27-35","236885176":"Microsatellites Reveal Population Substructure of Klickitat River Native Steelhead and Genetic Divergence from an Introduced Stock","5870705":"Hedrick P.. Sex: differences in mutation, recombination, selection, gene flow, and genetic drift. Evolution 61: 2750-2771","272479893":"Neon: An R Package to Estimate Human Effective Population Size and Divergence Time from Patterns of Linkage Disequilibrium between SNPS","40760388":"Interval Estimation of the Effective Population Size from Heterozygote‐Excess in SNP Markers","271836570":"Genetic variation in three paddlefish (Polyodon spathula Walbaum) stocks based on microsatellite DNA analysis","281506797":"An experimental assessment of microsatellite markers for genetic tagging of recovered hatchery-released red drum (Sciaenops ocellatus) used in stock enhancement","8228817":"Major histocompatibility complex and microsatellite variation in two populations of wild gorillas","43289017":"Gene flow among San Joaquin kit fox populations in a severely changed ecosystem","228475315":"Molecular markers and their applications in fisheries and aquaculture","44646918":"Population Genetics as a Tool to Select Tsetse Control Strategies: Suppression or Eradication of Glossina palpalis gambiensis in the Niayes of Senegal","225183452":"Low levels of population genetic structure in the gilthead sea bream, Sparus aurata, along the coast of Italy","7310814":"Population structure of the malaria vector Anopheles funestus (Diptera: Culicidae) in Madagascar and Comoros","47751659":"Génétique des populations subdivisées : théorie et applications","8228808":"Estimation of genetically effective breeding numbers using a rejection algorithm approach","7004255":"Unravelling pedigress in wild endangered salmon populations using molecular genetic markers","273147506":"Genetic analysis of four European huchen (Hucho hucho Linnaeus, 1758) broodstocks from Poland, Germany, Slovakia, and Ukraine: implication for conservation","40851929":"Major histocompatibility complex and microsatellite variation in two populations of wild gorillas","233946566":"Barker (2011) Mol Ecol","24441411":"Population sizes and dispersal pattern of tsetse flies: Rolling on the river?","226711867":"Estimation of census and effective population sizes: The increasing usefulness of DNA-based approaches","7362765":"Genetic structure of fragmented populations of a threatened endemic percid of the Rhône river: Zingel asper","51140019":"COMPUTER PROGRAMS: onesamp: a program to estimate effective population size using approximate Bayesian computation","11499631":"Likelihood-Based Estimation of the Effective Population Size Using Temporal Changes in Allele Frequencies: A Genealogical Approach","23784490":"Oliver MK, Lambin X, Cornulier T, Piertney SB. Spatio-temporal variation in the strength and mode of selection acting on major histocompatibility complex diversity in water vole (Arvicola terrestris) metapopulations. Mol Ecol 18: 80-92","226488250":"Microsatellite variation in China’s Hainan Eld’s deer (Cervus eldi hainanus) and implications for their conservation","260730573":"Heterozygote deficiencies caused by a Wahlund effect: Dispelling unfounded expectations","227679066":"An experimental assessment of genetic tagging and founder representation in hatchery‐reared red drum (Sciaenops ocellatus) used in stock enhancement","7922226":"Prugnolle F, Roze D, Théron A, De Meeus T. F-statistics under alternation of sexual and asexual reproduction: a model and data from schistosomes (platyhelminth parasites). Mol Ecol 14: 1355-1365","266339883":"Population Genetic Study of the Red-Collared Brown Lemur (Eulemur collaris É. Geoffroy) in Southeastern Madagascar","278157279":"Gene flow counteracts the effect of drift in a Swiss population of snow voles fluctuating in size","226335792":"Genetic Variation within and Between Domesticated Chinook Salmon, Oncorhynchus tshawytscha, Strains and their Progenitor Populations","269717696":"Comparison of genetic diversity between wild-caught broodstock and hatchery-produced offspring populations of the vulnerable Korean kelp grouper (Epinephelus bruneus) by microsatellites","231120787":"An assessment of hatchery effects on Florida bass (Micropterus salmoides floridanus) microsatellite genetic diversity and sib-ship reconstruction","10899824":"Wang JL, Whitlock MC. Estimating effective population size and migration rates from genetic samples over space and time. Genetics 163: 429-446","224859952":"Barker, J.S.F. (2011). Effective population size of natural populations of Drosophila buzzatii, with a comparative evaluation of nine methods of estimation. Molecular Ecology 20: 4452-4471","290112914":"HETEROZYGOTE EXCESS IN SMALL POPULATIONS AND THE HETEROZYGOTE-EXCESS EFFECTIVE POPULATION SIZE","260948309":"Molecular techniques reveal cryptic life history and demographic processes of a critically endangered marine turtle","264291481":"Genetic diversity and differentiation of the Korean starry flounder (Platichthys stellatus) between and within cultured stocks and wild populations inferred from microsatellite DNA analysis","278794693":"On some genetic consequences of social structure, mating systems, dispersal, and sampling","229492336":"Estimating population parameters in a threatened arctic fox population using molecular tracking and traditional field methods","12172644":"Vitalis R, Couvet D. Estimation of effective population size and migration rate from one- and two-locus identity measures. Genetics 157: 911-925","227519854":"ESTIM 1.0: A computer program to infer population parameters from one- And two-locus gene identity probabilities","265144876":"LIFE HISTORY AND GENETIC DIVERSITY IN DESERT REPTILES AND AMPHIBIANS","226145307":"Reproductive isolation following reintroduction of Chinook salmon with alternative life histories","235642346":"Genetic Structure of Creek Chub, a Headwater Minnow, in an Impounded River System","226217369":"Implications of social dominance and multiple paternity for the genetic diversity of a captive-bred reptile population (Tuatara)","229730898":"Estimation of effective number of breeders from molecular coancestry of single cohort sample. Evol Appl 1:462-474","41420061":"Mito-nuclear discordance in the degree of population differentiation in a marine goby","8244503":"Genetic variation in gorillas","6312714":"Meyer F, Brunner A. Non-neutral evolution of the major histocompatibility complex class II gene DRB1 in the sac-winged bat Saccopteryx bilineata. Heredity 99: 257-264","12929321":"Statistic analysis of microsatellite DNA data","8199953":"Balloux F.. Heterozygote excess in small populations and the heterozygote-excess effective population size. Evolution 58: 1891-1900","223811876":"Novel microsatellites for multiplex PCRs of the Humpback grouper, Cromileptes altivelis (Valenciennes, 1828), and application for broodstock management","51500517":"Population genetics of Glossina palpalis palpalis from central African sleeping sickness foci","276334733":"Neon: An R Package to Estimate Human Effective Population Size and Divergence Time from Patterns of Linkage Disequilibrium between SNPS","7150491":"Widespread gene flow and high genetic variability in populations of water voles Arvicola terrestris in patchy habitats","8435446":"Autosomal differences between males and females in hybrid zones: A first report from Barbus barbus and Barbus meridionalis (Cyprinidae)","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","26886755":"Genetic architecture of two red ruffed lemur (Varecia rubra) populations of Masoala National Park","38042814":"A comparison of single-sample effective size estimators using empirical Toad (Bufo calamita) population data: genetic compensation and population size-genetic diversity correlations","230831673":"Exploring the role of asexual multiplication in poplar rust epidemics: Impact on diversity and genetic structure","7658377":"Comparative landscape genetics and the adaptive radiation of Darwin’s finches: the role of peripheral isolation. Mol Ecol","23171231":"Nb_HetEx: A Program to Estimate the Effective Number of Breeders","235654389":"Genetic variability and structure of the water vole Arvicola amphibius across four metapopulations in northern Norway","276129163":"Recent fragmentation of the endangered Blakiston’s fish owl (Bubo blakistoni) population on Hokkaido Island, Northern Japan, Revealed by Mitochondrial DNA and Microsatellite Analyses"},"index":241}