{"abs":"We give a cross-disciplinary survey on ``population\u0027\u0027 Monte Carlo algorithms. In these algorithms, a set of ``walkers\u0027\u0027 or ``particles\u0027\u0027 is used as a representation of a high-dimensional vector. The computation is carried out by a random walk and split/deletion of these objects. The algorithms are developed in various fields in physics and statistical sciences and called by lots of different terms -- ``quantum Monte Carlo\u0027\u0027, ``transfer-matrix Monte Carlo\u0027\u0027, ``Monte Carlo filter (particle filter)\u0027\u0027,``sequential Monte Carlo\u0027\u0027 and ``PERM\u0027\u0027 etc. Here we discuss them in a coherent framework. We also touch on related algorithms -- genetic algorithms and annealed importance sampling.","title":"Population Monte Carlo algorithms Trans","id":1821950,"url":"https://www.researchgate.net/publication/1821950_Population_Monte_Carlo_algorithms_Trans","names":["Yukito IBA","Transactions of the Japanese Society for Artificial Intelligence"],"references":{"243780998":"Self-Organizing State Space Model","240124625":"Monte Carlo Calculations of the Ground State of Three- and Four-Body Nuclei","250444780":"ChemInform Abstract: Monte Carlo Techniques for Quantum Fluids, Solids and Droplets","13251977":"Monte Carlo calculation of free energy, critical point, and surface critical behavior of three-dimensional Heisenberg ferromagnets","3361206":"Novel Approach to Nonlinear/Non-Gaussian Bayesian State Estimation","13336333":"Mirror potentials and the fermion problem","13227790":"Optimal Protein Design Procedure","234014394":"The Monte Carlo method","243769869":"Bayesian state estimation for tracking and guidance using the bootstrap filter","15227364":"Sequential imputation for multilocus linkage analysis","236373786":"Projector Monte Carlo method","227280412":"CONDENSATION—conditional density propagation for visual tracking","231023830":"A transfer-matrix Monte Carlo study of random Penrose tilings","234977046":"A random‐walk simulation of the Schrödinger equation: H+3","222347735":"Solution of the quantum liouville equation as a stochastic process","2590205":"Sequential Monte Carlo Methods for Dynamic Systems","2439039":"Convergence of Sequential Monte Carlo Methods","13326352":"Finite population-size effects in projection Monte Carlo methods","251308833":"Quantum lattice problems","1823046":"\"Go with the winners\"-Simulations","235541610":"Pruned-enrich Rosenbluth method: Simulations of θ polymers of chain length up to 1 000 000","226857895":"Monte Carlo studies of nuclear many-particle systems","235544424":"Observations on the statistical iteration of matrices","246868562":"Monte Carlo filter using the genetic algorithm operators","234849499":"New Method for the Statistical Computation of Polymer Dimensions","1950331":"Multi-Self-Overlap Ensemble for Protein Folding: Ground State Search and Thermodynamics","13293164":"Monte Carlo transfer-matrix study of the frustrated XY model","2260298":"Perm: A Monte Carlo Strategy For Simulating Polymers And Other Things","231102767":"Guided replication of random chain: A new Monte Carlo method","241590412":"Calculation of ground states for many-Ferminon systems","246868698":"Rosenbluth, M. N. \u0026 Rosenbluth, A. W. Monte Carlo calculation of the average extension of molecular chains. J. Chem. Phys. 23, 356","13392802":"Stochastic simulation of classical lattice systems","200744518":"Sequential Monte-Carlo Methods in Practice","2306327":"Annealed Importance Sampling","243706047":"Monte Carlo techniques to estimate the conditional expectation in multi-stage non-linear filtering","1871781":"Equilibrium free-energy differences from nonequilibrium measurements: A master-equation approach","1824801":"A \"fast growth\" method of computing free energy differences","243767612":"Blind Deconvolution via Sequential Imputations","2824599":"Testing a New Monte Carlo Algorithm for Protein Folding","13327670":"Model fermion Monte Carlo method with antithetical pairs","1951843":"A Monte-Carlo study of meanders"},"citedIn":{"1759003":"Convergence of adaptive mixtures of importance sampling schemes","282977881":"Multiple Marginalized Population Monte Carlo","257549405":"Using the particle filter for nuclear decision support","38326989":"Computational Advances for and from Bayesian Analysis","220809644":"Using Importance Sampling for Bayesian Feature Space Filtering","242138470":"Population Annealing An approach to finite-temperature calculation","241322602":"Population Annealing and Its Application to a Spin Glass","235555842":"Fractional-filling loophole insulator domains for ultracold bosons in optical superlattices","222704844":"Parallel and interacting Markov chain Monte Carlo algorithm","1834518":"Quantum Monte Carlo methods for the solution of the Schrödinger equation for molecular systems in Handbook for Numerical Analysis","277004303":"An Adaptive Population Importance Sampler: Learning From Uncertainty","264501970":"Bayesian Parameter Inference and Model Selection by Population Annealing in Systems Biology","223539786":"Nonlinear structural dynamical system identification using adaptive particle filters","45899044":"Simplifying Parallelization of Scientific Codes by a Function-Centric Approach in Python","1825409":"Sequential monte carlo samplers","24052723":"Parameter Estimation in General State-Space Models Using Particle Methods","2551739":"Parameter Estimation in General State-Space Models using Particle Methods","50948654":"Nonequilibrium Work on Spin Glasses in Longitudinal and Transverse Fields","228626697":"Sequential Monte Carlo for Bayesian Computation","251667373":"Assimilation of observations of radiation level into an atmospheric transport model: A case study with the particle filter and the ETEX tracer dataset","23977821":"Minimum Variance Importance Sampling via Population Monte Carlo","267247069":"Population Monte Carlo methodology a la Gibbs sampling","220735513":"Marginalized population Monte Carlo","243569205":"Nonequilibrium Relations for Spin Glasses with Gauge Symmetry","51958058":"Dynamical bifurcation as a semiclassical counterpart of a quantum phase\ntransition","224691792":"77 GHz Transceiver Module Using A Low Dielectric Constant Multilayer Structure","267843791":"Estimation of multimodal posterior distributions of chirp parameters with population Monte Carlo sampling","24053974":"Stationarity preserving and efficiency increasing probability mass transfers made possible","266216288":"New probabilistic inference algorithms that harness the strengths of variational and Monte Carlo methods","220507034":"Replica Exchange Light Transport","259962304":"Inferring Leadership from Group Dynamics Using Markov Chain Monte Carlo Methods","291694120":"Sequential Monte Carlo Methods","251544500":"Finite Element Method Based Monte Carlo Filters for Structural System Identification","45922551":"Quantum Annealing: An Introduction and New Developments","261267417":"Bayesian DOA estimation method using Population Monte Carlo","242775349":"Exorcising N 2 Stigmata in Sequential Monte Carlo","45901041":"Bayesian Computational Methods","222666891":"Computing the first eigenelements of some linear operators using a branching Monte Carlo method","46494228":"Estimating Bayes factor via thermodynamic integration and population MCMC","34668102":"Quantification of modelling uncertainties in climate change impact studies on water resources : application to a glacier-fed hydropower production system in the Swiss Alps /","242295337":"Advances in Markov chain Monte Carlo methods","41909286":"Estimating and Projecting Trends in HIV/AIDS Generalized Epidemics Using Incremental Mixture Importance Sampling","2998263":"An Overview of Existing Methods and Recent Advances in Sequential Monte Carlo","228633852":"SEQUENTIAL MONTE CARLO METHODS AND THEIR APPLICATIONS","1823046":"\"Go with the winners\"-Simulations","224131206":"Joint Model Selection and Parameter Estimation by Population Monte Carlo Simulation","45624295":"Minimum variance importance sampling via Population Monte Carlo","222671652":"Nonequilibrium relations in spin glasses","45901023":"On computational tools for Bayesian data analysis","1832447":"Go with the Winners: a General Monte Carlo Strategy","231110702":"Exploration of order in chaos using the replica exchange Monte Carlo method","252465252":"White Matter Fiber Tracking Using Diffusion Tensor MRI","47501502":"Simulation of diffusions by means of importance sampling paradigm","47866032":"Numerical Estimation of the Current Large Deviation Function in the","220286671":"On population-based simulation for static inference","228749010":"Surface Classification via BRDF Parameters, using Population Monte Carlo for MRF Parameter Estimation","261058687":"Estimation of posterior distributions with population Monte Carlo sampling and graphical modeling","257302436":"Bayesian Parameter Inference by Markov Chain Monte Carlo with Hybrid Fitness Measures: Theory and Test in Apoptosis Signal Transduction Network","233606808":"Geometry Optimization of ZnnCdm and (AlTiNi)n Clusters by the Modified Diffusion Monte Carlo Method","47509537":"The effect of Cu2+ or Fe3+ on the noncovalent binding of rutin with bovine serum albumin by spectroscopic anaBLCis","251850234":"Fusion of Unmanned Aerial Vehicle Range and Vision Sensors Using Fuzzy Logic and Particles","45903813":"Quantum signatures of self-trapping transition in attractive lattice bosons","238689222":"Bayesian Filtering: From Kalman Filters to Particle Filters, and Beyond","225958410":"Monte Carlo filters for identification of nonlinear systems","7173523":"Topology of pseudoknotted homopolymers"},"index":243}