{"abs":"This paper explores the applicability of artificial neural networks (ANN) for predicting the spread of structural response under the presence of uncertain parameters described as random fields. The use of ANN is carried out in combination with Monte Carlo simulation (MCS) for calculating response statistics in stochastic analysis of structural systems using finite elements. To this extent, the ANNs are trained with a few samples, following a conventional MCS procedure and used henceforth to predict the stochastic response for the rest of samples. The basic idea is to achieve a dimensionality reduction of the input ANN training space by using as input vector the random phase angles of the spectral representation method instead of the random variables describing the uncertain input parameters. A further improvement of the efficiency of the proposed approach is achieved by exploiting the uniform distribution of the random phase angles, in order to span efficiently the training space using a latin hypercube sampling (LHS) technique. The advantage of this approach over conventional computation of stochastic response via a standard stochastic finite element-based MCS is the fast and reliable prediction of the required response sample space which can be accomplished at a fraction of computing time and is independent of the size of the finite element model. Numerical results are presented, demonstrating the efficiency and the applicability of the proposed methodology as well as its distinct advantages over existing ANN-based stochastic finite element methodologies (SFEM).","title":"Spectral representation-based neural network assisted stochastic structural mechanics","id":269777234,"url":"https://www.researchgate.net/publication/269777234_Spectral_representation-based_neural_network_assisted_stochastic_structural_mechanics","names":["Dimitris Giovanis","Vissarion Papadopoulos","Engineering Structures"],"references":{"228954980":"A comparison of approximate response functions in structural reliability analysis, Probabilistic","227628880":"Convergence study of the truncated Karhunen-oeve expansion for simulation of stochastic processes. Int J Numer Meth Eng","267681136":"Stochastic Finite Element Methods and Reliability A State-of-the-Art Report","222771905":"Robust and efficient methods for stochastic finite element analysis using Monte Carlo simulation","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","250693052":"Flexibility-based upper bounds on the response variability of simple beams","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","222462931":"Advanced Supervised Learning in Multi-layer Perceptrons – From Backpropagation to Adaptive Learning Algorithms","247530133":"Simulation of MultiDimensional Gaussian Stochastic Fields by Spectral Representation","223634689":"Refinement strategies for stratified sampling methods","275188861":"Orthogonal Series Expansions of Random Fields in Reliability Analysis","245285572":"Variability Response Functions of Stochastic Plane Stress/Strain Problems","245582009":"A practical Bayesian framework for backpropagation networks","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","223229456":"Stochastic finite element-based reliability analysis of space frames","248560911":"Importance sampling in structural system","238179666":"Simulation of Stationary Non-Gaussian Translation Processes","245058296":"Structural reliability analysis for implicit performance function using radial basis function network","222023198":"Improving the computational efficiency in finite element analysis of shells with uncertain properties","223269739":"Comparison of response surface and neural network with other methods for structural reliability analysis","250693396":"Analysis of mean and mean square response of general linear stochastic finite element systems","256918009":"Accelerated subset simulation with neural networks for reliability analysis","233893594":"Neural network aided stochastic computations and earthquake engineering","260498156":"Simulation of Stochastic Processes by Spectral Representation","222499945":"Structural optimization using evolution strategies and neural networks","250692058":"Response variability of stochastic frame structures using evolutionary field theory","245305522":"Application of ANN-Based Response Surface Method to Prediction of Ultimate Strength of Stiffened Panels","257391800":"Extension of Latin Hypercube samples with correlated variables","222287247":"Neural-network-based reliability analysis: A comparative study","223351842":"Analysis of one-dimensional stochastic finite elements using neural networks","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","225801665":"Neural Networks in Stochastic Mechanics","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","229318943":"Variability response functions for effective material properties","244443236":"Structural Response Variability","222791536":"The stochastic finite element method: Past, present and future. Comput Methods Appl Mech Eng","223425064":"Innovative seismic design optimization with reliability constraints","30771436":"MacKay, D.J.C.: A Practical Bayesian Framework for Backprop Networks. Neural Computation 4(3), 448-472","238504525":"A simple and efficient methodology to approximate a general non-Gaussian stationary stochastic process by a translation process","245185894":"A hierarchy of upper bounds on the response of stochastic systems with large variation of their properties: Random variable case","229345109":"Reliability analysis of structures using artificial neural network based genetic algorithms"},"citedIn":{"284104383":"Epistemic uncertainty assessment using Incremental Dynamic Analysis and Neural Networks","280498317":"The generalization of Latin hypercube sampling","283121511":"Prediction of the Fundamental Period of Infilled RC Frame Structures Using Artificial Neural Networks"},"index":246}