{"abs":"Standard Gibbs sampling applied to a multivariate normal distribution with a specified precision matrix is equivalent in fundamental ways to the Gauss-Seidel iterative solution of linear equations in the precision matrix. Specifically, the iteration operators, the conditions under which convergence occurs, and geometric convergence factors (and rates) are identical. These results hold for arbitrary matrix splittings from classical iterative methods in numerical linear algebra giving easy access to mature results in that field, including existing convergence results for antithetic-variable Gibbs sampling, REGS sampling, and generalizations. Hence, efficient deterministic stationary relaxation schemes lead to efficient generalizations of Gibbs sampling. The technique of polynomial acceleration that significantly improves the convergence rate of an iterative solver derived from a \\emph{symmetric} matrix splitting may be applied to accelerate the equivalent generalized Gibbs sampler. Identicality of error polynomials guarantees convergence of the inhomogeneous Markov chain, while equality of convergence factors ensures that the optimal solver leads to the optimal sampler. Numerical examples are presented, including a Chebyshev accelerated SSOR Gibbs sampler applied to a stylized demonstration of low-level Bayesian image reconstruction in a large 3-dimensional linear inverse problem.","title":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","id":276296293,"url":"https://www.researchgate.net/publication/276296293_Accelerated_Gibbs_sampling_of_normal_distributions_using_matrix_splittings_and_polynomials","names":["Colin Fox","Albert Parker"],"references":{"4772040":"Fast sampling of Gaussian Markov random fields","2609572":"Monte Carlo Implementation of Gaussian Process Models for Bayesian Regression and Classification","275619177":"An Introduction To Probability Theory And Its Applications","231909716":"Improving Stochastic Relaxation for Gussian Random Fields","228564888":"Fast and Exact Simulation of Large Gaussian Lattice Systems in ℝ2: Exploring the Limits","244465562":"Iterative Solution of Large Linear Systems, Academic Press, New York","13277506":"Multigrid Monte Carlo method. Conceptual foundations","2520884":"Coordinate Selection Rules for Gibbs Sampling","268890132":"Gaussian Markov Random Fields: Theory \u0026 Applications","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","267161721":"Introduction to Bayesian Scientific Computing—Ten Lectures on Subjective Computing","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","271076919":"Bayesian Data Analysis","227375789":"An explicit link between Gaussian fields and Gaussian Markov random fields: The stochastic partial differential equation approach. Journal of the Royal Statistical Society, Series B, 73(4), 423-498","230649887":"Iterative Methods for Sparse Linear Systems","233950933":"On the Statistical-Analysis of Dirty Pictures","265442551":"Iterative Solution Methods","2762752":"Over-relaxation methods and Metropolis-Hastings coupled Markov chains for Monte Carlo simulation","251425239":"Bayesian calibration of a large-scale geothermal reservoir model by a new adaptive delayed acceptance Metropolis Hastings algorithm","267437407":"Convergence in Variance of Chebyshev Accelerated Gibbs Samplers","265181051":"MCMC-Based Image Reconstruction with Uncertainty Quantification","38322292":"An Adaptive Metropolis Algorithm","239582331":"Stochastic Relaxation, Gibbs Distributions and the Bayesian Resoration of Images","270906136":"Efficiency and computability of MCMC with Langevin, Hamiltonian, and other matrix-splitting proposals","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","244446162":"Tutorial in Pattern Theory","51991898":"Iterative solution of linear systems in the 20th century","266496677":"A Primer on Space-time Modeling from a Bayesian Perspective","235539143":"Over-relaxation method for the Monte Carlo evaluation of the partition function for multiquadratic actions","271512800":"Random Iterative Models","243777736":"Introducing Markov Chain Monte Carlo","221995881":"Bayesian Data Analysis, London","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","2606836":"Suppressing Random Walks in Markov Chain Monte Carlo Using Ordered Overrelaxation","242392353":"Iterated Random Functions","226235688":"Rate of Convergence of the Gibbs Sampler in the Gaussian Case","41222435":"Monte Carlo Statistical Method","245810545":"Coupling and Ergodicity of Adaptive MCMC","243776478":"Convergence of Iterations for Linear Equations","51949763":"Think continuous: Markovian Gaussian models in spatial statistics","265623304":"Sampling Gaussian Distributions in Krylov Spaces with Conjugate Gradients","224839687":"Hierarchical Modeling and Analysis of Spatial Data","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","243762788":"Covariance Structure and Convergence Rate of the Gibbs Sampler with Various Scans","213881563":"Iterative Methods for Sparse Linear Systems, Second Edition","268209561":"M Carlo Statistical Methods","239061974":"An Introduction to Probability Theory and Its Applications – Volume I and II","243776875":"Spatial Statistics and Bayesian Computing","23630599":"Comparing sweep strategies for stochastic relaxation","31398319":"On Stationary Processes in the Plane","220695762":"InformationTheory, Inference, and Learning Algorithms","275812998":"Iterative Solution of Large Linear Systems","40806169":"A Multidimensional Multispecies Continuum Model for Heterogeneous Biofilm Development","205716410":"Matrix Iterative Analysis","242640398":"Fundamentals of Matrix Computations","268160642":"Introduction to Markov chain Monte Carlo","251435142":"The Lanczos and conjugate gradient algorithms","237450588":"On the Whittle-Matérn correlation family","243497597":"Chebyshev Polynomial in Numerical Analysis"},"citedIn":{"270906136":"Efficiency and computability of MCMC with Langevin, Hamiltonian, and other matrix-splitting proposals"},"index":251}