{"abs":"a b s t r a c t Moored floating vessels offer an attractive solution to oil and gas recovery in a range of water depths. The design of moorings for these compliant vessels require careful prediction of the lifetime response extremes. Reliability based predictions offer more accuracy than prescriptive schemes but at a higher computational expense: existing tools are in need of some improvement. Here a frequency-domain response model is coupled with a pseudo-asymptotic integration scheme to provide a rapid estimate of lifetime reliability and hence the extreme response at a design target level. The potential lifetime environmental and system parameter variation is consistently included. Reliability bounds and an associated convergence criteria are also defined. This methodology is tested on a representative FPSO in a wave-dominated environment. A comparison with traditional single-storm design methods highlights a significant variation in the 100-year excursion response. The convergence of bounds on the lifetime reliability at target levels consistent with existing design codes is shown. The provision of additional design information as a byproduct of the pseudo-asymptotic analysis is demonstrated.","title":"Lifetime reliability based design of an offshore vessel mooring","id":228519485,"url":"https://www.researchgate.net/publication/228519485_Lifetime_reliability_based_design_of_an_offshore_vessel_mooring","names":["Andrew J. Grime","R.S. Langley","Applied Ocean Research"],"references":{"238950142":"On quasi-stationary approximations to non-stationary random vibration","37425531":"Probability Methods in the Theory of Structures","222714823":"Handbook of Mathematical Function: With Formulas, Graphs, and Mathematical Tables","223122763":"On the time domain simulation of second order wave forces and induced responses","245363223":"The Ergodicity Assumption for Sea States in the Reliability Estimation of Offshore Structures","229361443":"Joint distributions for significant wave height and wave zero-up-crossing period","245285335":"Reliability of Uncertain Nonlinear Trusses Under Random Excitation. II","247258992":"Probabilistic Theory of Structural Dynamics","245216272":"On combination formulae for the extremes of wave-frequency and low-frequency responses","222165872":"Reliability analysis—A review and some perspectives","267648509":"Environmental Contour Lines for Design Purposes: Why and When?","241790905":"Response Based Design Conditions in the North Sea: Application of a New Method","239387028":"Probability Approximations by Log Likelihood Maximization","245286219":"New Approximations for Reliability Integrals","223099995":"Extreme values of first- and second-order wave-induced vessel motions","246797421":"Mechanics of Wave Forces on O shore Structures","239400862":"The Mechanics of Ware Forces on Offshore Structures","245216263":"Technical note: On the long-term statistics of extremes","257940484":"Structural Reliability Analysis, Prediction","265440265":"Structural Reliability Theory and Its Applications","223030935":"Techniques for assessing the lifetime reliability of engineering structures subjected to stochastic loads. Eng Struct 9(2): 95-103","222245089":"On the efficiency of crossing rate prediction methods used to determine extreme motions of moored offshore structures","239632662":"The response of two-dimensional periodic structures to point harmonic forcing","224043320":"Handbook of Matematical Functions","236660920":"Methods of Structural Safety","288431765":"Design practice for Mooring of Floating Production Systems","265794417":"Method of Structural Safety","247656549":"Structral Reliability Theorie and its applications","261992442":"A Handbook of Mathematical Functions","229812122":"Asymptotic Approximations of Integrals","245216054":"Prediction of extremes of combined first-order and slow-drift motions of offshore structures","239401898":"Extreme Response of Floating Structures in Combined Wind and Waves","37404437":"An Introduction to Random Vibrations and Spectral Analysis","245363312":"Statistics of Combined Linear and Quadratic Springing Response of a TLP in Random Waves","222787189":"A statistical analysis of first and second order vessel motions induced by waves and wind gusts","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","245285867":"Asymptotic Expansions for Reliability and Moments of Uncertain Systems","254518110":"Benefits of Applying Response-Based Design Methods to Deepwater FPSOs","231932262":"A formula for ‘wave damping’ in the drift of a floating body","222035533":"Asymptotic Approximations for Probability Integrals","222790897":"On fast integration for time variant structural reliabiity","256397238":"Second order frequency domain analysis of moored vessels","267967111":"SPRINGING AND SLOW-DRIFT RESPONSES: PREDICTED EXTREMES AND FATIGUE VS. SIMULATION"},"citedIn":{"229394286":"Reliability-based design optimization of an FPSO riser support using moving least squares response surface meta-models","260008573":"Efficient parametric uncertainty analysis within the hybrid Finite Element/Statistical Energy Analysis method","267648710":"Evaluating the Long-Term Fatigue Response of Mooring Lines Using an Asymptotic Approximation","5803936":"The \"Close-in\" or Ultra High-Risk Model: A Safe and Effective Strategy for Research and Clinical Intervention in Prepsychotic Mental Disorder","251508885":"Long-term response analysis of FPSO mooring systems","251524374":"Molecular characterization of hereditary hemochromatosis in Matera province","258697542":"Progressive reliability method and its application to offshore mooring systems","245196288":"A practical formulation for estimating the extreme vector excursion of a floating structure","276995436":"On the long-term fatigue assessment of mooring and riser systems","283761095":"Reliability analysis and integrity management of instrumented buoy moorings for monitoring the Indian Seas"},"index":252}