{"abs":"A probability-based structural design method is introduced. The reliability criterion is replaced by a deterministic design equation, in which all random variables are substituted by appropriate design values. A design value depends upon the mean value and standard deviation of the corresponding random variable; the reliability factor that reflects the acquired level of reliability; and the sensitivity factor that measures the effect of the individual random variable upon the total system. Methods of application are considered.","title":"STRUCTURAL DESIGN BASED ON WEIGHTED FRACTILES.","id":281997312,"url":"https://www.researchgate.net/publication/281997312_STRUCTURAL_DESIGN_BASED_ON_WEIGHTED_FRACTILES","names":[],"references":{},"citedIn":{"239421381":"A review of probabilistic fracture mechanics literature","245301372":"Basic Analysis of Structural Safety","266232438":"Linearly unbiased estimation combined with JC method for the carbonation contamination of some concrete bridges in Taipei","37536980":"Model Building and Verification for\nActive Control of Microvibrations\nwith Probabilistic Assessment of the Effects of Uncertainties","272060126":"Service Life Prediction Based on Carbonation Reliability Theory for Reinforced Concrete under Mechanical Load","236006106":"A Branch and Bound Strategy for finding the Reliability Index with Non-convex performance Functions","255622839":"Reliability{based Assessment of Erodible Channel Capacity","256286443":"An integrated approach to the reliability of engineering systems","233645795":"Driven high capacity H-piles in Hong Kong saprolites: A reliability evaluation of two methods","222778728":"Reliability analysis by numerical integration and curve fitting","222035565":"Method of structural systems reliability","222782928":"Sensitivity factors and their application to marine structures","222588317":"New light on first- and second-order reliability methods","226884732":"Monte Carlo techniques in computational stochastic mechanics","291097061":"Methods for Structural Reliability Computations","222055971":"Bibliography of literature on reliability in civil engineering"},"index":260}