{"abs":"This paper introduces a conjugate gradient sampler that is a simple extension of the method of conjugate gradients (CG) for solving linear systems. The CG sampler iteratively generates samples from a Gaussian probability density, using either a symmetric positive definite covariance or precision matrix, whichever is more convenient to model. Similar to how the Lanczos method solves an eigenvalue problem, the CG sampler approximates the covariance or precision matrix in a small dimensional Krylov space. As with any iterative method, the CG sampler is efficient for high dimensional problems where forming the covariance or precision matrix is impractical, but operating by the matrix is feasible. In exact arithmetic, the sampler generates Gaussian samples with a realized covariance that converges to the covariance of interest. In finite precision, the sampler produces a Gaussian sample with a realized covariance that is the best approximation to the desired covariance in the smaller dimensional Krylov space. In this paper, an analysis of the sampler is given, and we give examples showing the usefulness and limitations of the Krylov approximations.","title":"Sampling Gaussian Distributions in Krylov Spaces with Conjugate Gradients","id":265623304,"url":"https://www.researchgate.net/publication/265623304_Sampling_Gaussian_Distributions_in_Krylov_Spaces_with_Conjugate_Gradients","names":["Albert Parker","Colin Fox","SIAM Journal on Scientific Computing"],"references":{"4772040":"Fast sampling of Gaussian Markov random fields","4993358":"Fixed rank Kriging for very large data sets","46619332":"Templates for the Solution of Algebraic Eigenvalue Problem. A Practical Guide","2609572":"Monte Carlo Implementation of Gaussian Process Models for Bayesian Regression and Classification","273665993":"AN ENSEMBLE KALMAN FILTER USING THE CONJUGATE GRADIENT SAMPLER","231909716":"Improving Stochastic Relaxation for Gussian Random Fields","228564888":"Fast and Exact Simulation of Large Gaussian Lattice Systems in ℝ2: Exploring the Limits","13277506":"Multigrid Monte Carlo method. Conceptual foundations","220656683":"A Hybrid Approach Combining Chebyshev Filter and Conjugate Gradient for Solving Linear Systems with Multiple Right-Hand Sides","51992087":"Numerical Linear Algebra","235409944":"Statical Inference","268890132":"Gaussian Markov Random Fields: Theory \u0026 Applications","222391891":"A modified harmonic block Arnoldi algorithm with adaptive shifts for large interior eigenproblems","246910756":"Multivariate Statistical Inference and Applications","2477494":"\"Normalized cuts and image segmentation\", IEEE Trans","46653011":"The Convergence of Krylov Methods and Ritz Values","262244661":"Krylov Subspace Estimation","222545118":"Relatively robust representations of symmetric tridiagonals","266983287":"The Lanczos and Conjugate Gradient Algorithms: From Theory to Finite Precision Computations","265442551":"Iterative Solution Methods","24315487":"Implicit Application of Polynomial Filters in a k -Step Arnoldi Method","223122942":"Computing interior eigenvalues of large matrices","222761969":"Rational Krylov sequence methods for eigenvalue computation","2239387":"A Symmetric Band Lanczos Process Based On Coupled Recurrences And Some Applications","4986742":"Spatiotemporal Hierarchical Bayesian Modeling Tropical Ocean Surface Winds","222471672":"Some large scale computation problems","228912793":"Restarted block-GMRES with deflation of eigenvalues","230873351":"Numerical Methods for Large Eigenvalue Problems","41781559":"Gaussian Process for Machine Learning","239556237":"Solution of Systems of Linear Equations by Minimized Iterations1","235539143":"Over-relaxation method for the Monte Carlo evaluation of the partition function for multiquadratic actions","271512800":"Random Iterative Models","222585361":"Further results on the convergence behavior of conjugate-gradients and Ritz values","229541371":"On the use of conjugate gradient to calculate the eigenvalues and singular values of large, sparse matrices","216301617":"Modern applied statistics with S-PLUS","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","2606787":"On Conditional and Intrinsic Autoregression","213881563":"Iterative Methods for Sparse Linear Systems, Second Edition","232095666":"Algorithms for Large Symmetric Eigenvalue Computations, I Theory","242985372":"Yet another polynomial preconditioner for the conjugate gradient algorithm","224817420":"Modern Applied Statistics With S","242921750":"The Spectral Transformation Lanczos Method for the Numerical Solution of Large Sparse Generalized Symmetric Eigenvalue Problems","265953591":"An Iteration Method for the Solution of the Eigenvalue Problem of Linear Differential and Integral Operators (Research Paper 2133)","23630599":"Comparing sweep strategies for stochastic relaxation","248029351":"The Symmetric Eigenvalue Problem","227738210":"Global Earth structure: Inference and assessment","230873264":"Numerical Optimization Second Edition","230995511":"Data analysis tools for uncertainty quantification of inverse problems","220695762":"InformationTheory, Inference, and Learning Algorithms","257825323":"A Krylov Subspace Method for Covariance Approximation and Simulation of Random Processes and Fields","242640398":"Fundamentals of Matrix Computations","228926940":"Gaussian Processes to Speed up Hybrid Monte Carlo for Expensive Bayesian Integrals","222794684":"Analysis of the symmetric Lanczos algorithm with reorthogonalization methods"},"citedIn":{"289526692":"Gradient Scan Gibbs Sampler: an efficient algorithm for high-dimensional Gaussian distributions","273665993":"AN ENSEMBLE KALMAN FILTER USING THE CONJUGATE GRADIENT SAMPLER","289526601":"gsgs-paper","258720738":"A Gibbs sampler for conductivity imaging and other inverse problems","272183731":"Gradient scan gibbs sampler : an efficient high-dimensional sampler application in inverse problems","257665456":"Iterative Numerical Methods for Sampling from High Dimensional Gaussian Distributions","265295453":"Efficient Gaussian Sampling for Solving Large-Scale Inverse Problems using MCMC","267437407":"Convergence in Variance of Chebyshev Accelerated Gibbs Samplers","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","257347845":"Dynamic simulation of concentrated macromolecular solutions with screened long-range hydrodynamic interactions: Algorithm and limitations","286612513":"On Circulant Embedding for Gaussian Random Fields in R","225090994":"Fast Markov chain Monte Carlo sampling for sparse Bayesian inference in\nhigh-dimensional inverse problems using L1-type priors","265339852":"An h-likelihood method for spatial mixed linear models based on intrinsic auto-regressions","266188576":"Preconditioned Krylov Subspace Methods for Sampling Multivariate Gaussian Distributions"},"index":262}