{"abs":"This report is concerned with the probability of failure of structures designed with materials for which arbitrary frequency distributions of strength may be assumed. Topics include: safety and probability of failure; safety factors; multiple member structures; reliability functions.","title":"The analysis of structural Safety","id":235033470,"url":"https://www.researchgate.net/publication/235033470_The_analysis_of_structural_Safety","names":["A. M. FREUDENTHAL","J. M. Garrelts","M. Shinozuka"],"references":{},"citedIn":{"229885616":"Acceptable risk bases for design of structures","256379980":"Optimum design of structures with random parameters","267841523":"Bending Moment Stochastic Study of Concrete Plates under Uniform Loading","266482922":"Uniform Loaded Concrete Plates Stochastic Twisting Moments Study","229676221":"Probabilistic structural optimization","235213588":"Seismic Design of Building Structures","251161825":"Reliability Design and Assessment for Total Structural Life","245197440":"Cumulative damage of solids for random stress","222055971":"Bibliography of literature on reliability in civil engineering","44050304":"Further steps towards a quantitative approach to durability design","4037393":"Risk assessment of an existing concrete structure: a system reliability-based approach","264173458":"A Geometric Design Method Based on the Running Speed Distribution","245191344":"On the structural reliability of reactor safety containments","265316605":"Uncertainty Modelling in Systems Reliability Analysis","40535876":"Paralleles Simulationskonzept für zeitabhängige Zuverlässigkeitsanalysen bei stochastischen Ermüdungsprozessen","245310641":"PROBABILISTIC DESIGN OF STRUCTURES IN STATE EQUATION FORM","234432193":"Reliability Analysis of Fatigue-Sensitive Aircraft Structures Under Random Loading and Periodic Inspection","245192102":"Impact of probability risk assessment on containment","264735484":"Structural reliability for structural engineers evaluating and strengthening a tall building","251735356":"Methodology for Probabilistic Life Prediction of Multiple-Anomaly Materials","251125960":"Principles Underpinning Reliability based Prediction of Fatigue and Fracture Behaviours","229359851":"The probabilistic approach to substation bus short-circuit design","223691285":"Damage detection and reliability evaluation of existing structures","225583664":"A prospective study of materials based on stochastic methods","256380427":"Computer-automated sensitivity analysis in reliability-based plastic design","245100511":"The effect of uncertainties in wind load estimation on reliability assessments","245078495":"Reliability study of a prestressed concrete beam: A comparison between the methods of third and second level","260082630":"System reliability analysis using dominant failure modes identified by selective searching technique","245191636":"Part III structural reliability assessment under internal and external load conditions","222626568":"LRFD: Implementing structural reliability in professional practice","245389550":"A review of mechanical reliability","250693054":"Realistic and efficient reliability estimation for aerospace structures","233303729":"A framework for integrating quality, reliability, and durability in product design with life-cycle cost considerations","256203282":"Introduction","229884132":"Structural safety: Issues and progress","279343358":"Structural Reliability Theory and Its Applications","277874632":"EFFICIENT METHODS FOR MECHANICAL AND STRUCTURAL RELIABILITY ANALYSIS AND DESIGN (SAFETY-INDEX, FATIGUE, FAILURE).","3151979":"Load-capacity interference and the bathtub curve","290003474":"The Stress-Strength Interference Method Applied to Fatigue Design: The Independence of the Random Variables","227517137":"Ship structural safety and reliability","279360453":"Approaches to Service Life Prediction of Metals in the Nuclear Industry","245058296":"Structural reliability analysis for implicit performance function using radial basis function network","269028970":"Fracture Mechanics 2: Applied Reliability","277856746":"RELIABILITY ANALYSIS OF SERIES STRUCTURAL SYSTEMS (PROBABILITY, DESIGN, FATIGUE).","245219572":"Limiter probabilistic lifetime analysis","279358159":"A Survey of Probabilistic Service Life Prediction Methods for Structures","258176778":"Reliability sensitivity based on first-order reliability method","251676011":"Efficient Integration of Sampling-Based Spatial Conditional Failure Joint Probability Densities","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","267824007":"Bending Moment Stochastic Study of Concrete Plates under Sinusoidal Distributed Loading","222279244":"Probability-based codified design: Past accomplishments and future challenges","245419995":"Minimum weight analysis based on structural reliability","229174996":"A strategy for periodic inspection based on defect growth","228842462":"ANÁLISE DA SEGURANÇA NO PROJETO DE ESTRUTURAS: MÉTODO DOS ESTADOS LIMITES","238180528":"Practical Structural Reliability Techniques","245192216":"Decision methods in risk analysis","232337502":"Some aspects of the reliability-based design of reactor containment structures","227309574":"Stochastic methods for floor slab analysis","264643147":"Structural evaluation and strengthening tall buildings: expected value and coefficient of variation of limit state capacity","281664856":"Probabilistic Seismic Assessment of RC Bridges: Part I — Uncertainty Models","268261999":"Variability of the grain size distribution of a soil related to suffusion","222260649":"Redundancy index of lifelines for mitigation measures against seismic risk","266506618":"Advances of a FEM for the Failure Probability Evaluation of Masonry Vehicular Bridge Support Piers","3529900":"Reliability of structures with active control","250694254":"Application of the spectral method to estimate the structural reliability of a reactor containment","277821486":"RELIABILITY-BASED OPTIMAL STRUCTURAL AND MECHANICAL DESIGN.","245185855":"Bending of stochastic Kirchoff plates on Winkler foundations via the Galerkin method and the Askey-Wiener scheme. Probab Eng Mech","225807568":"A practical randomization approach of deterministic equation to determine probabilistic fatigue and fracture behaviours based on small experimental data sets","250743130":"Brief note: a reliability model for fire safety in structural steel members","245191476":"Safety and reliability of prestressed concrete reactor vessels","250072394":"Statistics for concrete and steel quality in Saudi Arabia","248084070":"Combined models of fracture and their use in predicting service life","290069733":"An Application of Some Curve-Crossing Results for Stationary Stochastic Processes to Stochastic Modelling of Metal Fatigue","222410481":"Probability distribution of energetic-statistical size effect in quasibrittle fracture","35286185":"Probabilistic study of wind pressures on buildings /","280287745":"Reliability evaluation of reinforced concrete pipes in crack opening limit state","278397743":"Reliability Modeling and Assessment of Component with Multiple Weak Sites under Complex Loading","266413145":"Twisting Moments Stochastic Study of Sinusoidal Loaded Concrete Plates","235052730":"Development of Reliability-Based Aircraft Safety Criteria: An Impact Analysis. Volume 1","245192228":"Damage evaluation for structural reliability assessment","222625790":"Efficient computational procedures for reliability estimates of MDOF-systems","228688923":"Redundancy Analysis of Existing Truss Bridges: A System Reliability-Based Approach","271499154":"Reliability determination of a sounding rocket separation system using Monte Carlo simulation","233109593":"Multi-Criteria Probabilistic Structural Design","237899408":"Reliability of Nonlinear Framed Structures","225369263":"Fuzzy vs. probabilistic methods for risk assessment of coastal areas","222600325":"Augmenting approximate solutions for consistent reliability analysis","260592202":"Corrosion initiation time updating by epistemic uncertainty as an alternative to schedule the first inspection time of pre-stressed concrete vehicular bridge beams","267857972":"Sinusoidal Loaded Concrete Plates Stochastic Shearing Forces Study","237950189":"Time-variant structural reliability analysis using bivariate diffusive crack growth models","222365061":"Functional Reliability of Structures","235062468":"Terminal Control Area Design and Air Traffic Loadings","245325657":"Case studies in probabilistic design","266295576":"DOGMA DO FATOR DE SEGURANÇA","266501925":"Stochastic Deflection Study of Concrete Plates under Uniform Loading","260281668":"An alternative procedure for seismic evaluation and strengthening of tall buildings","256353678":"Application of the extracted volume of a deposit as a measure of deformation for seismic hazard evaluation in mines","260591939":"Corrosion initiation time updating by epistemic uncertainty as an alternative to schedule the first inspection time of pre-stressed concrete vehicular bridge beams. Structure and Infrastructure Engineering: Maintenance, Management, Life-Cycle Design and Performance.","237103085":"Fracture mechanics-based probabilistic life prediction of components with large numbers of inherent material anomalies","222758538":"Safety design concepts for seismic structures","215659016":"Probability method of reliability for cooperative neural network","223317659":"Bayesian decision analysis of dam safety","288985583":"Reliability Analysis of Thermally Stressed Viscoelastic Structures by Monte Carlo Simulation","223834764":"Activation Energy Based Extreme Value Statistics and Size Effect in Brittle and Quasibrittle Fracture","265625102":"SENSITIVITY ANALYSIS FOR NONLINEAR STRUCTURES","279357309":"Structural Reliability Theory and Its Applications","257619076":"Reliability assessment of 3D space frame structures applying stochastic finite element analysis. Springer Int J Mech Mater in Des 1-9","226313634":"Evaluation of failure probabilities of mechanical systems under seismic action by the Monte-Carlo simulation method","245301372":"Basic Analysis of Structural Safety","226848876":"Reliability-Based Optimization of Structural Systems","245466955":"A review of mechanical reliability modelling in relation to failure mechanisms","277877115":"Primary and deformation-induced high and low cycle fatigue reliability of infrastructure with updating through non-destructive inspection.","226750574":"Confidence bounds on structural reliability estimations for offshore platforms","225964441":"Reliability analysis of diesel engine crankshaft based on 2D stress strength interference model","245480527":"Stress-strength interference theory for a pin-loaded composite joint","23823006":"Reliability of randomly excited structures","250696972":"Life-cycle reliability-based optimization of civil and aerospace structures. Comput Struct","266458652":"Stochastic Deflection Study of Concrete Plates under Sinusoidal Distributed Loading","223258033":"Mathematical modeling for structural analysis and design"},"index":265}