{"abs":"This paper studies rare events simulation for the heavy-tailed case, where some of the underlying distributions fail to have the exponential moments required for the standard algorithms for the light-tailed case. Several counterexamples are given to indicate that in the heavy-tailed case, there are severe problems with the approach of developing limit results for the conditional distribution given the rare event; this is used as a basis for importance sampling. On the positive side, two algorithms having a relative error which is almost bounded are presented, one based upon order statistics and the other upon a different importance sampling idea.","title":"Rare Events Simulation for Heavy-Tailed Distributions","id":38322352,"url":"https://www.researchgate.net/publication/38322352_Rare_Events_Simulation_for_Heavy-Tailed_Distributions","names":["Søren Asmussen","Klemens Binswanger","Bjarne Højgaard","Bernoulli"],"references":{"222305216":"Long-tail buffer-content distributions in broadband networks","38349449":"Asymptotics of palm-stationary buffer content distributions in fluid flow queues","223027338":"Large deviations results for sub exponential tails, with applications to insurance risk. Stoch. Proc. Appl. 64, 103-125","38339851":"Subexponential asymptotics for stochastic processes: Extremal behavior, stationary distributions and first passage probabilities","2948591":"Characteristics of WWW Client-based Traces","265831260":"Monte Carlo Simulation and Large Deviations Theory for Uniformly Recurrent Markov Chains","228565913":"Subexponential asymptotics of a network multiplexer","238673854":"Simulation of ruin probabilieties for subexponential claims. ASTIN Bull","238836155":"Heavy Tails and Long Range Dependence in On/Off Processes and Associated Fluid Models","2422828":"Self-Similarity Through High-Variability: Statistical Analysis of Ethernet LAN Traffic at the Source Level","38364037":"Extreme values in the GI/G/1 queue","32012839":"Applied Probability and Queues","264995908":"Modeling Extremal Events: For Insurance and Finance","2630265":"Patterns Of Buffer Overflow In A Class Of Queues With Long Memory In The Input Stream","226988245":"How large delays build in GI/G/1 queue","264960799":"Conditioned Limit Theorems Relating a Random Walk to Its Associate, with Applications to Risk Reserve Processes and the GI/G/1 Queue","242637603":"A Theorem on Sums of Independent Positive Random Variables and Its Applications to Branching Random Processes","3334437":"Self-Similarity Through High-Variability: Statistical Analysis of Ethernet LAN Traffic at the Source Level","2433789":"Regular Variation in a Multi-Source Fluid Queue","38349458":"Tail probabilities for non-standard risk and queueing processes with subexponential jumps","265998273":"Ruin probabilities in the presence of heavy-tails and interest rates","3334508":"Self-similarity in World Wide Web: Evidence and possible causes","222033060":"Estimates of the probability of ruin with special emphasis on the possibility of large claims","222505314":"Fluid Queues and Regular Variation","225210701":"Fast simulation of rare events in queueing and reliability models","228057717":"An Introduction to Probability Theory and Its Applications II","3078157":"On the Optimality and Stability of Exponential Twisting in Monte Carlo Estimation","251151260":"Saddlepoint Approximations","246145615":"Finite horizon ruin probabilities for Markov-modulated risk processes with heavy tails","243775521":"An Intermediate Course in Probability","2419779":"Self-Similarity and Heavy Tails: Structural Modeling of Network Traffic","2484685":"Waiting-Time Tail Probabilities In Queues With Long-Tail Service-Time Distributions","220253643":"Fluid Queues and Regular Variation.","243775723":"Distributions That Are Both Subexponential and in the Domain of Attraction of an Extreme-Value Distribution","35165813":"Rare events and insurance /","3718477":"Multiplexing on-off sources with subexponential on periods","237281681":"092027 (M13) Bounds for ruin probabilities in the presence of large claims and their comparison","38358079":"Importance Sampling in the Monte Carlo Study of Sequential Tests","38360753":"Phase-Type Representations in Random Walk and Queueing Problems","247333316":"Rare Events in the Presence of Heavy Tails","265348266":"Applied Probability and Queues","238866119":"Asmussen, S.: Stationary distributions for fluid flow models with or without Brownian noise. Stoch. Models 11(1), 21-49","38339957":"Counterexamples in importance sampling for large deviations probabilities. Ann. Appl. Probab. 7, 731-746","226809912":"Conditioned limit theorems for random walks with negative drift"},"citedIn":{"220084382":"Editorial: Rare-event simulation for queues","221677367":"Percentiles of sums of heavy-tailed random variables: Beyond the\nsingle-loss approximation","265541586":"SOME NON-STANDARD APPROACHES TO THE STUDY OF SUMS OF HEAVY-TAILED DISTRIBUTIONS","226058616":"Rare-Event Simulation","279396134":"Imaging Spectroscopy for Scene Analysis","263237810":"A Fast Simulation Method for the Sum of Subexponential Distributions","250201837":"AGGREGATING RISK ACROSS MATRIX STRUCTURED LOSS DATA: THE CASE OF OPERATIONAL RISK","4213831":"Importance sampling simulation in the presence of heavy tails","228632872":"State-dependent importance sampling for regularly varying random walks","220654383":"Simulating tail probabilities in GI/GI/1 queues and insurance risk processes with subexponential distributions (extended abstract)","24136569":"Importance Sampling for Sums of Lognormal Distributions, with Applications to Operational Risk","228529173":"An affine Invariant Hyperspectral Texture Descriptor Based Upon Heavy-tailed Distributions and Fourier Analysis","50996224":"Handbook of Monte Carlo Methods","2936871":"Simulating Ruin Probabilities In Insurance Risk Processes With Subexponential Claims","2413738":"Ruin Problem, Operational Risk And How Fast Stochastic Processes Mix","2800954":"Simulating Heavy Tailed Processes Using Delayed Hazard Rate Twisting","263171900":"The Transform Likelihood Ratio Method for Rare Event Simulation with Heavy Tails: In Honor of Vladimir Kalashnikov (Guest Editors: Evsey Morozov and Richard Serfozo)","241789565":"Investigation of Effect of Gas Injection Pressure on Oil Recovery Accompanying CO2 Increasing in Injection Gas Composition","228958768":"An approach to actuarial modeling with Quasi-Monte Carlo: simulation of random sums depending on stochastic factors","3885987":"Simulating GI/GI/1 queues and insurance risk processes withsubexponential distributions","228623420":"The Internet as a complex system","251463777":"Chapter 11 Rare-Event Simulation Techniques: An Introduction and Recent Advances","269355310":"Error Rates and Improved Algorithms for Rare Event Simulation with Heavy Weibull Tails","254463752":"On Lyapunov Inequalities and Subsolutions for Efficient Importance Sampling","241678020":"Analytical and Stochastic Modeling Techniques and Applications - 18th International Conference, ASMTA 2011, Venice, Italy, June 20-22, 2011. Proceedings","225628497":"A global-filtering algorithm for linear programming problems with stochastic elements","236135344":"Importance Sampling for Sums of Lognormal Distributions with Applications to Operational Risk","228852864":"The Minimum Cross Entropy Method for the M/G/1 Queue with Heavy-Tailed Distributions","226571556":"Affine Invariant Hyperspectral Image Descriptors Based upon Harmonic Analysis","220085048":"Fluid heuristics, Lyapunov bounds and efficient importance sampling for a heavy-tailed G/G/1 queue","1733565":"On Upper Bounds for the Tail Distribution of Geometric Sums of Subexponential Random Variables","227423273":"Large Deviations and Fast Simulation in the presence of boundaries","267691229":"LDA at Work: Deutsche Bank\u0027s Approach to Quantifying Operational Risk","269329444":"Efficient splitting-based rare event simulation algorithms for heavy-tailed sums","258228168":"The convergence rate and asymptotic distribution of the bootstrap quantile variance estimator for importance sampling","221528327":"New simulation methodology for risk analysis: rare-event, heavy-tailed simulations using hazard function transformations, with applications to value-at-risk.","4111882":"A unified approach for finite-dimensional, rare-event Monte Carlo simulation","222659187":"On the inefficiency of state-independent importance sampling in the presence of heavy tails","43526433":"Rare-event probability estimation with conditional Monte Carlo","45873282":"On Importance Sampling with Mixtures for Random Walks with Heavy Tails","267258963":"Some Non-Standard Sequential Monte Carlo Methods and Their Applications","254050330":"Rare event simulation techniques","51917991":"An Analytical Model for the Intercell Interference Power in the Downlink\nof Wireless Cellular Networks","282233619":"Quantitative risk management: Concepts, techniques and tools: Revised edition","225605168":"On tail probabilities and first passage times for fractional Brownian motion","254050534":"Importance sampling for stochastic recurrence equations with heavy tailed increments","225713713":"Estimating tail probabilities of heavy tailed distributions with asymptotically zero relative error","259128244":"New efficient estimators in rare event simulation with heavy tails","43450704":"Heavy tails, importance sampling and cross-entropy","220084821":"Tail Asymptotics for M/G/1 Type Queueing Processes with Subexponential Increments.","200707517":"Sequential Monte Carlo Samplers for Rare Events","220136403":"Perwez Shahabuddin, 1962 - 2005: A professional appreciation","258228522":"Rare-event simulation of heavy-tailed random walks by sequential importance sampling and resampling","228604015":"Quasi-Monte Carlo Techniques and Rare Event Sampling⋆","234005026":"A Comparison of Cross-Entropy and Variance Minimization Strategies","220654068":"Simulating heavy tailed processes using delayed hazard rate twisting (extended abstract).","259239840":"Rare-event Probability Estimation via Empirical Likelihood Maximization","268317738":"Monte Carlo and Quasi-Monte Carlo Methods 2000","37808661":"Estimating ruin probabilities in the Cramér-Lundberg model with heavy-tailed claims","271431288":"Optimal rare event Monte Carlo for Markov modulated regularly varying random walks","4053867":"Rare-event, heavy-tailed simulations using hazard function transformations, with applications to value-at-risk","228632440":"Rare event simulation techniques: An introduction and recent advances","221528298":"Efficient Simulation for Large Deviation Probabilities of Sums of Heavy-Tailed Increments","237460933":"Sums of dependent lognormal random variables: asymptotics and simulation","277299299":"asymptotics and simulation","228389880":"Importance Sampling for Rare Events","220866126":"Performance Evaluation of a Single Node with General Arrivals and Service","220084603":"Efficient simulation of finite horizon problems in queueing and insurance risk","254211651":"Efficient simulation of tail probabilities of sums of dependent random variables","261118073":"On error rates in rare event simulation with heavy tails","239546669":"Computational Techniques for Solving Stochastic Models","220136436":"Efficient Rare Event Simulation for Heavy-Tailed Compound Sums","2390217":"Portfolio Value-at-Risk with Heavy-Tailed Risk Factors","225146757":"On the efficiency of the Asmussen-Kroese estimator and its applications to stop-loss transforms. Bl DGVFM","4102609":"Integrated 0.9 V charge-control switching converter with self-biased current sensor","227296508":"Performance Analysis with Truncated Heavy-Tailed Distributions","1748970":"Efficient rare-event simulation for the maximum of heavy-tailed random walks. Ann Appl Probab","271197530":"FiniteHorizon","37616846":"Improved Algorithms for Rare Event Simulation With Heavy Tails","250222489":"Ruin Theory Revisited: Stochastic Models for Operational Risk","228697682":"QMC techniques for CAT bond pricing","45923663":"Efficient Simulation and Conditional Functional Limit Theorems for Ruinous Heavy-tailed Random Walks","260946558":"Exponential Family Techniques for the Lognormal Left Tail","265603872":"Reliability of dynamic systems in random environment by extreme value theory","34663142":"Extremes and fluid queues [electronic resource] /","221529794":"Statistical tools for simulation design and analysis: simulating ruin probabilities in insurance risk processes with subexponential claims.","4213815":"Efficient importance sampling heuristics for the simulation of population overflow in Jackson networks","251712760":"State-dependent importance sampling for rare-event simulation: An overview and recent advances","238662592":"On the Eciency Loss of State-independent Importance Sampling in the Presence of Heavy Tails","254008665":"An approximate solution for Ph/Ph/1 and Ph/Ph/1/N queues"},"index":267}