{"abs":"In this paper an original interacting particle system approach is developed for studying Markov chains in rare event regimes. The proposed particle system is theoretically studied through a genealogical tree interpretation of Feynman--Kac path measures. The algorithmic implementation of the particle system is presented. An estimator for the probability of occurrence of a rare event is proposed and its variance is computed, which allows to compare and to optimize different versions of the algorithm. Applications and numerical implementations are discussed. First, we apply the particle system technique to a toy model (a Gaussian random walk), which permits to illustrate the theoretical predictions. Second, we address a physically relevant problem consisting in the estimation of the outage probability due to polarization-mode dispersion in optical fibers.","title":"Genealogical particle analysis of rare events","id":2126101,"url":"https://www.researchgate.net/publication/2126101_Genealogical_particle_analysis_of_rare_events","names":["Pierre Del Moral","Josselin Garnier","The Annals of Applied Probability"],"references":{"263829179":"Limitation of Optical First-Order PMD Compensation","248390410":"Methods of Modem Mathematical Physics, Vol. II: Fourier Analysis, Self-Adjointness","3237812":"Polarization mode dispersion of short and long single-mode fiber","3240955":"Origins and control of polarization effects in single-mode fibers","242386046":"Estimation of Particle Transmission by Random Sampling","3291324":"Correction to Multiple importance sampling for first-and second-order polarization-mode dispersion","43236829":"Statistical analysis of pulse propagation driven by polarization-mode dispersion","3380285":"Experimental observation of soliton robustness to polarisation dispersion pulse broadening","3800488":"Limitation of optical first-order PMD compensation","251183780":"Convergence of Empirical Processes for Interacting Particle Systems with Applications to Nonlinear Filtering","3898663":"Non-Maxwellian DGD distributions of PMD emulators","3291308":"Multiple importance sampling for first- and second-order polarization-mode dispersion","2616327":"The Monte-Carlo method for filtering with discrete-time observations: Central Limit Theorems Pierre Del Moral and Jean Jacod + Summary","265881913":"Stochastic processes in quantum physics","225210701":"Fast simulation of rare events in queueing and reliability models","234000725":"Interacting Particle Filtering With Discrete Observations","3290965":"Importance sampling for polarization-mode dispersion","38339872":"Central limit theorem for nonlinear filtering and interacting particle systems","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","12535828":"PMD fundamentals: Polarization mode dispersion in optical fibers","246868698":"Rosenbluth, M. N. \u0026 Rosenbluth, A. W. Monte Carlo calculation of the average extension of molecular chains. J. Chem. Phys. 23, 356","200744518":"Sequential Monte-Carlo Methods in Practice","3402433":"“Phenomenological Approach to Polarization Mode Dispersion in Long Single-Mode Fibers,”","3239554":"Application of the Manakov-PMD equations to studies of signal propagation in fibers with randomly-varying birefringence","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","3291087":"Analysis of PMD compensators with fixed DGD using importance sampling"},"citedIn":{"251422845":"Grandes deviations et erreurs de transmission par solitons dans les fibres optiques","220402982":"A Method for Determining Most Probable Errors in Nonlinear Lightwave Systems","46510925":"Particle methods for the estimation of credit portfolio loss distributions","222297395":"Splitting for rare event simulation: A large deviation approach to design and analysis","51890330":"Bounding rare event probabilities in computer experiments","228826542":"Importance sampling and interacting particle systems for the estimation of markovian credit portfolios loss distribution","221665595":"A Sequential Monte Carlo approach to computing tail probabilities in stochastic models","272399020":"Affine Point Processes: Approximation and Efficient Simulation","260564246":"A combined importance splitting and sampling algorithm for rare event estimation","232063047":"Large deviations for weighted empirical measures arising in importance\nsampling","50844690":"Quelques Techniques de Couplage entre Méthodes Numériques Déterministes et Méthodes de Monte-Carlo","282983494":"A separated splitting technique for disconnected rare event sets","283454458":"Rare event simulation related to financial risks: efficient estimation and sensitivity analysis","41574234":"Régularité fractionnaire et analyse stochastique de discrétisations ; Algorithme adaptatif de simulation en risque de crédit.","224040063":"Large Deviations for a Mean Field Model of Systemic Risk","263127049":"Min-max representations of viscosity solutions of Hamilton-Jacobi equations and applications in rare-event simulation","234000706":"An introduction to particle methods in finance","265118463":"An Introduction to Particle Methods with Financial Applications","257665517":"Analysis of adaptive directional stratification for the controlled estimation of rare event probabilities","226437062":"Interacting particle systems for the computation of rare credit portfolio losses","253787545":"Estimation of rare events probabilities in computer experiments","257201519":"Particle filters","267258963":"Some Non-Standard Sequential Monte Carlo Methods and Their Applications","288412430":"Interacting Path Systems for Credit Risk","220136480":"A Variant of Importance Splitting for Rare Event Estimation: Fixed Number of Successes","46103168":"Adaptive particle techniques and rare event estimation","233996210":"On the Concentration Properties of Interacting Particle Processes","257665561":"Bayesian Parameter Inference for Partially Observed Stopped Processes","46515713":"SMCTC: Sequential Monte Carlo in C++","267046446":"Convergence properties of weighted particle islands with application to the double bootstrap algorithm","225672374":"Extreme events in optics: challenges of the MANUREVA project","257642130":"Analysis of an interacting particle method for rare event estimation","228665450":"Parameter inference for stopped processes","200707517":"Sequential Monte Carlo Samplers for Rare Events","222666891":"Computing the first eigenelements of some linear operators using a branching Monte Carlo method","258228522":"Rare-event simulation of heavy-tailed random walks by sequential importance sampling and resampling","276496040":"Multi-Name Extension to the Credit Grades and an Efficient Monte Carlo Method","268689616":"Hastings-Metropolis algorithm on Markov chains for small-probability estimation","51915982":"On the Concentration Properties of Interacting Particle Processes","266943935":"A survey of rare event simulation methods for static input-output models","279263090":"Kernel interpolation methods for estimating expensive black box functions","255796968":"Snell Envelope with Small Probability Criteria","2998263":"An Overview of Existing Methods and Recent Advances in Sequential Monte Carlo","220137794":"Exact and Efficient Simulation of Correlated Defaults","222821925":"Simulations of rare events in fiber optics by interacting particle systems","48907661":"Méthodes d\u0027interpolation à noyaux pour l\u0027approximation de fonctions type boîte noire coûteuses","266541321":"Stochastic models and methods. An introduction with applications","228210672":"Sequential Importance Sampling and Resampling for Dynamic Portfolio Credit Risk","47501502":"Simulation of diffusions by means of importance sampling paradigm","228210673":"Importance Sampling for Event Timing Models","243685096":"Sequential Monte Carlo methods for diffusion processes","279458630":"The instanton method and its numerical implementation in fluid mechanics","41308697":"Grandes déviations pour des équations de Schrödinger non linéaires stochastiques et applications","50425584":"Sequential Monte Carlo Samplers: Error Bounds and Insensitivity to Initial Conditions","228610012":"Interacting Particle Systems for the Computation of CDO Tranche Spreads with Rare Defaults","241707670":"Optimisation of interacting particle systems for rare event estimation","256117819":"On Computer-Intensive Simulation and Estimation Methods for Rare Event Analysis in Epidemic Models"},"index":268}