{"abs":"Recently, a lot of effort has been paid to the efficient computation of Kriging predictors when observations are assimilated sequentially. In particular, Kriging update formulae enabling significant computational savings were derived in Barnes and Watson (1992), Gao et al. (1996), and Emery (2009). Taking advantage of the previous Kriging mean and variance calculations helps avoiding a costly $(n+1) \\times (n+1)$ matrix inversion when adding one observation to the $n$ already available ones. In addition to traditional update formulae taking into account a single new observation, Emery (2009) also proposed formulae for the batch-sequential case, i.e. when $r \u003e 1$ new observations are simultaneously assimilated. However, the Kriging variance and covariance formulae given without proof in Emery (2009) for the batch-sequential case are not correct. In this paper we fix this issue and establish corrected expressions for updated Kriging variances and covariances when assimilating several observations in parallel.","title":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","id":221966156,"url":"https://www.researchgate.net/publication/221966156_Corrected_Kriging_Update_Formulae_for_Batch-Sequential_Data_Assimilation","names":["Clément Chevalier","David Ginsbourger"],"references":{"245285450":"Kriging and Conditional Simulation of Gaussian Field","225843631":"The Updated Kriging Variance and Optimal Sample Design","225331924":"The kriging update equations and their application to the selection of neighboring data","226798104":"Simulation of mineral grades with hard and soft conditioning data: Application to a porphyry copper deposit","238354904":"Efficient Updating of Kriging Estimates and Variances","267437693":"Geostatistic: Modeling Spatial Uncertainty"},"citedIn":{"281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","281946744":"Quantifying and reducing uncertainties on excursion sets under a gaussian random field prior","269420296":"Fast Update of Conditional Simulation Ensembles","281671347":"Kriging Metamodels for Bermudan Option Pricing","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","262369166":"KrigInv: An efficient and user-friendly implementation of batch-sequential inversion strategies based on Kriging"},"index":27}