{"abs":"Interacting particle methods are increasingly used to sample from complex high-dimensional distributions. They have found a wide range of applications in applied probability, Bayesian statistics and information engineering. Understanding rigorously these new Monte Carlo simulation tools leads to fascinating mathematics related to Feynman-Kac path integral theory and their interacting particle interpretations. In these lecture notes, we provide a pedagogical introduction to the stochastic modeling and the theoretical analysis of these particle algorithms. We also illustrate these methods through several applications including random walk confinements, particle absorption models, nonlinear filtering, stochastic optimization, combinatorial counting and directed polymer models.","title":"Particle methods: An introduction with applications","id":29601804,"url":"https://www.researchgate.net/publication/29601804_Particle_methods_An_introduction_with_applications","names":["Pierre Del Moral","Arnaud Doucet","ESAIM Proceedings"],"references":{"2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","3361206":"Novel Approach to Nonlinear/Non-Gaussian Bayesian State Estimation","228623464":"A Tutorial on Particle Filtering and Smoothing: Fifteen Years Later","200707517":"Sequential Monte Carlo Samplers for Rare Events","242360316":"Genetic Algorithms in Search","223686107":"On the stability of measure valued processes with applications to filtering","228530062":"Particle Motions in Absorbing Medium with Hard and Soft Obstacles","2453431":"A Sequential Particle Filter Method for Static Models","220286771":"Computational methods for complex stochastic systems: A review of some alternatives to MCMC","45847138":"Particle approximations of Lyapunov exponents connected to Schrödinger operators and Feynman–Kac semigroups","2933237":"Genealogies and Increasing Propagation of Chaos For Feynman-Kac and Genetic Models","2590205":"Sequential Monte Carlo Methods for Dynamic Systems","1825409":"Sequential monte carlo samplers","29607065":"Concentration Inequalities for Mean Field Particle Models","243779034":"Adaptation in Natural and Arti cial Systems","235541610":"Pruned-enrich Rosenbluth method: Simulations of θ polymers of chain length up to 1 000 000","235544424":"Observations on the statistical iteration of matrices","246868500":"Monte Carlo filter and smoother for non-Gaussian state space models","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","38349537":"Asymptotic convergence of genetic algorithms","3593055":"“Go with the winners” algorithms","200104711":"The Monte Carlo method in quantum statistical mechanics","2923975":"An Improved Particle Filter for Non-linear Problems","243665386":"Genetic Algorithms in Searching","215446267":"Monte Carlo Strategies in Scientic Computing","12240074":"Diffusion Monte Carlo with a fixed number of walker","200744518":"Sequential Monte-Carlo Methods in Practice","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","220045412":"Adoption in Natural and Artificial System","2939607":"Annealed Feynman-Kac Models","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"259572152":"Uniform Ergodicity of the Particle Gibbs Sampler","264160764":"Perfect simulation using atomic regeneration with application to Sequential Monte Carlo","286000616":"Predictive modeling in a VoIP system","271218846":"A filter for distinguishable and independent populations","285216964":"Fatigue crack growth simulations of 3-D linear elastic cracks under thermal load by XFEM","224221060":"Application Service Provider (ASP) in China: An Empirical Study of System and Service Satisfaction","276923083":"Sequential Bayesian inference for implicit hidden Markov models and current limitations","286926225":"VoIP Traffic Modelling using Gaussian Mixture Models, Gaussian Processes and Interactive Particle Algorithms","258792151":"Mean-Field PHD Filters Based on Generalized Feynman-Kac Flow","286926103":"Dynamic MixVoIP","271455283":"General multi-object filtering and association measure","224257155":"On the Resilience of [Distributed] EAs against Cheaters in Global Computing Platforms"},"index":274}