{"abs":"ian hierarchical model. We suppose given a prior p(k) over models k in a countable set K, and for each k, a prior distribution p( k jk) and a likelihood p(Y jk; k ) for the data Y . For de niteness and simplicity of exposition, we suppose that p( k jk) is a density with respect to n k -dimensional Lebesgue measure, and that there are no other parameters, so that where there are parameters common to all models these are subsumed into each k 2 R . Additional parameters, perhaps in additional layers of a hierarchy, are easily dealt with. Note that in this chapter, all probability distributions are proper. The joint posterior p(k; k jY ) \u003d p(k)p( k jk)p(Y jk; k ) 2K )p( 0 jk )p(Y jk 0 )d can always be factorised as p(k; k jY ) \u003d p(kjY )p( k jk; Y ); that is as the product of posterior model probabilities and model-speci c parameter posteriors. This identity is very often the basis for reporting the inference, and in some of the methods ment","title":"Trans-Dimensional Markov Chain Monte Carlo","id":2834503,"url":"https://www.researchgate.net/publication/2834503_Trans-Dimensional_Markov_Chain_Monte_Carlo","names":["Peter J. Green"],"references":{"4744329":"Marginal Likelihood From the Metropolis-Hastings Output","4772123":"Efficient construction of reversible MCMC proposal distributions","2369980":"Delayed Rejection in Reversible Jump Metropolis-Hastings","243103300":"Markov Chain Monte Carlo Methods for Computing Bayes Factors","2811376":"Markov Chain Monte Carlo for Statistical Inference","2675235":"Bayesian Analysis of Mixture Models With an Unknown Number of Components – An Alternative to Reversible Jump Methods"},"citedIn":{"45899452":"Constraining the shape of a gravity anomalous body using reversible jump Markov chain Monte Carlo","224858468":"Using mixture of Gamma distributions for Bayesian analysis in an M/G/1 queue with optional second","268925441":"Visuelle probabilistische Mehrobjektverfolgung im Rahmen der Fahrzeugumfeldbeobachtung","236176917":"Trans-dimensional inverse problems, model comparison and the evidence","4742720":"Model Averaging and Dimension Selection for the Singular Value Decomposition","266270423":"On Solving General State-Space Sequential Decision Problems using Inference Algorithms","221304380":"MCMC-Based Multiview Reconstruction of Piecewise Smooth Subdivision Curves with a Variable Number of Control Points","49458431":"A tutorial on adaptive MCMC","220559144":"On solving integral equations using Markov chain Monte Carlo methods","224642157":"Optimal Filtering For Partially Observed Point Processes Using Trans-Dimensional Sequential Monte Carlo","4772679":"Statistical image analysis for a confocal microscopy two-dimensional section of cartilage growth","51601411":"Generalized Mixture Models for Molecular Phylogenetic Estimation","238603306":"Fitting Gaussian Mixtures by Automatic RJMCMC CPSC535c Course Project","258807423":"The shuffling rotation of the Earth\u0027s inner core revealed by earthquake doublets","241060685":"Joint Bayesian Model Selection and Parameter Estimation of the Generalized Extreme Value Model With Covariates Using Birth-Death Markov Chain Monte Carlo","260985239":"On the Nature of the P-Wave Velocity Gradient in the Inner Core beneath Central America","51816975":"Bayesian Multimodel Inference for Geostatistical Regression Models","220286781":"Generic reversible jump MCMC using graphical models. pp. EPH-2005-01","4772437":"Marginal likelihood estimation via power posteriors","281056734":"A Nonstationary Markov Model Detects Directional Evolution in Hymenopteran Morphology","4210015":"A Markov chain Monte Carlo approach to closing the loop in SLAM","5305935":"Segmentation and Tracking of Multiple Humans in Crowded Environments","236348212":"Aerosol model selection and uncertainty modelling by adaptive MCMC technique","240802428":"A Lesson in measure theory and change of variables","240967280":"MCMC model determination for discrete graphical models","48419023":"Sequentially interacting Markov chain Monte Carlo methods","225809752":"A distance-based diagnostic for trans-dimensional Markov chains","45423771":"Approximating Model Probabilities in Bayesian Information Criterion and Decision-Theoretic Approaches to Model Selection in Phylogenetics","261387173":"Bayesian texture model selection by harmonic mean","257308260":"Inverse of magnetic dipole field using a reversible jump Markov chain Monte Carlo","265568748":"Reversible jump MCMC","238548750":"Bayesian Model Selection for Genome-Wide Epistatic QTL Analysis","228617371":"Markov Chain Monte Carlo With Mixtures of Mutually Singular Distributions","47758307":"Block clustering with collapsed latent block models","8373824":"A Bayesian Approach to DNA Sequence Segmentation","5207567":"Population-Based Reversible Jump Markov Chain Monte Carlo","224578085":"A comparison of nonlinear filtering approaches for Radar target-tracking performances","200707517":"Sequential Monte Carlo Samplers for Rare Events","259821104":"Bayesian Structure Learning in Sparse Gaussian Graphical Models","46494856":"Stochastic model specification search for Gaussian and partial non-Gaussian state space models","6855974":"A Bayesian Compound Stochastic Process for Modeling Nonstationary and Nonhomogeneous Sequence Evolution","258816572":"Relabeling and Summarizing Posterior Distributions in Signal Decomposition Problems When the Number of Components is Unknown","4772123":"Efficient construction of reversible MCMC proposal distributions","258377781":"Probabilistic Inverse Theory","235423324":"Bayesian semi-parametric analysis of Poisson change-point regression models: Application to policy-making in Cali, Colombia","224254984":"Sampling bedrooms","225101631":"Exact and efficient Bayesian inference for multiple changepoint","224646454":"Realtime Vision Based Multi-Target-Tracking with Particle Filters in Automotive Applications","220321143":"Exact Bayesian curve fitting and signal segmentation","7385126":"Hastings Ratio of the LOCAL Proposal Used in Bayesian Phylogenetics","237071991":"Transdimensional Sampling Algorithms for Bayesian Variable Selection in Classification Problems With Many More Variables Than Observations","222683677":"Segmentation of color images via reversible jump MCMC sampling","50347864":"Joint Inference of Microsatellite Mutation Models, Population History and Genealogies Using Transdimensional Markov Chain Monte Carlo","227728074":"Bayesian Nonstationary Frequency Analysis of Hydrological Variables1","7829293":"Yi N, Yandell BS, Churchill GA, Allison DB, Eisen EJ, Pomp D. Bayesian model selection for genome-wide QTL analysis. Genetics 170: 1333-1344","4156259":"Using particles to track varying numbers of interacting people","6393662":"Bayesian Shrinkage Analysis of Quantitative Trait Loci for Dynamic Traits","228943098":"A trans-dimensional MCMC algorithm to estimate the order of a Markov chain: an application to ozone peaks in Mexico City","221618260":"Learning models of object structure","267275148":"Linking mainland Australia and Tasmania using ambient seismic noise tomography: Implications for the tectonic evolution of the east Gondwana margin","265675441":"Bayesian Inference of Viral Recombination: Topology distance between DNA segments and its distribution DNA","241221130":"Bayesian Model Discrimination for Glucose-Insulin Homeostasis","26603769":"A Bayesian Algorithm for Functional Mapping of Dynamic Complex Traits","224459789":"Channel Estimation in OFDM Systems With Unknown Power Delay Profile Using Transdimensional MCMC","51035749":"Sequential trans-dimensional Monte Carlo for range-dependent geoacoustic inversion","232638381":"Recognizing linked events: Searching the space of feasible explanations","251458445":"Synthesis of zeolites in anhydrous glycol systems","265243581":"Trans-dimensional finite-fault inversion","223040061":"A Bayesian approach to support vector machines for the binary classification","259118855":"Marginal reversible jump Markov chain Monte Carlo with application to motor unit number estimation","45921476":"A generalized Multiple-try Metropolis version of the Reversible Jump algorithm","268392579":"Probabilistic surface reconstruction of coastal sea-level rise during the twentieth century","4993330":"Sequential Monte Carlo Samplers","23479577":"Inferring genomic flux in bacteria","280893377":"Parametric Stochastic Modeling for Color Image Segmentation and Texture Characterization","227464462":"A novel reversible jump algorithm for generalized linear models","28361010":"Adaptive MCMC Methods With Applications in Environmental and Geophysical Model","201841025":"Bayesian policy learning with trans-dimensional MCMC","261014025":"Upper crustal structure of central Java, Indonesia, from transdimensional seismic ambient noise tomography","5286621":"A Bayesian Perspective on a Non-parsimonious Parsimony Model","232656211":"Motion Compensation Based Detecting and Tracking Targets in Dynamic Scene","223040987":"Theoretical and experimental study of through-wall microwave tomography inverse problems","275365624":"Automated 3D reconstruction of grape cluster architecture from sensor data for efficient phenotyping","275833572":"The BPP program for species tree estimation and species delimitation","222651857":"Bayesian model choice based on Monte Carlo estimates of posterior model probabilities","256694744":"Low temperature thermochronology and strategies for multiple samples 2: Partition Modelling for 2D/3D distributions with discontinuites","1825409":"Sequential monte carlo samplers","251572324":"Bayesian Model Comparison for Compartmental Models with Applications in Positron Emission Tomography","255633319":"Parallel Markov chain Monte Carlo computation for varying-dimension signal analysis","249429314":"A Bayesian partition modelling approach to resolve spatial variability in climate records from borehole temperature inversion","227657486":"Seismic tomography with the reversible jump algorithm","4851690":"A Bayesian analysis of tree structure specification in nested logit models","263813917":"Is there a link between geomagnetic reversal frequency and paleointensity? A Bayesian approach","4260068":"Multiple Target Tracking Using Spatio-Temporal Markov Chain Monte Carlo Data Association","228626697":"Sequential Monte Carlo for Bayesian Computation","259111130":"Incomplete contingency tables with censored cells with application to estimating the number of people who inject drugs in Scotland","227658301":"A unified framework for modelling wildlife population dynamics","225930202":"Bayesian inference for a discretely observed stochastic network","38327033":"Markov Chain Monte Carlo Methods and the Label Switching Problem in Bayesian Mixture Modeling","267121496":"Reversible Jump Markov Chain Monte Carlo Method for Parameter Reduction in Claims Reserving","228950289":"Mixtures of factor models for multivariate disease rates","232086369":"Interpreting genomic data via entropic dissection","227644967":"Inference of past climate from borehole temperature data using Bayesian Reversible Jump Markov chain Monte Carlo","271763338":"Evidence of micro-continent entrainment during crustal accretion","255655296":"Adaptive Monte Carlo for Binary Regression with Many Regressors","48172385":"Discrimination for Two Way Models with Insurance Application","51959512":"Note on the computation of the Metropolis-Hastings ratio for\nBirth-or-Death moves in trans-dimensional MCMC algorithms for signal\ndecomposition problems","48180254":"Bayesian Analysis of Loss Ratios Using the Reversible Jump Algorithm","225100712":"Reversible jump methods for generalised linear models and generalised linear mixed models","267213359":"Interpreting Radial Anisotropy in Global and Regional Tomographic Models","220183003":"Segmentation and Tracking of Multiple Humans in Crowded Environments.","228851557":"Bayesian model assessment in factor analysis","229708918":"Model Uncertainty","262646895":"GGM-paper","233532195":"Computational Aspects of Bayesian Spectral Density Estimation","23787936":"Latimer, A. M., S. Banerjee, H. Sang, E. S. Mosher, and J. A. Silander. Hierarchical models facilitate spatial analysis of large data sets: a case study on invasive plant species in the northeastern United States. Ecology Letters","2896615":"Model uncertainty. Stat Sci","257672336":"Explaining Activities as Consistent Groups of Events","200744507":"Trans-dimensional MCMC for Bayesian Policy Learning","1971664":"Automatic Bayesian inference for LISA data analysis strategies","4816793":"Marginal likelihoods for non-Gaussian models using auxiliary mixture sampling","230596716":"Markov Chain Monte Carlo Methods","8967249":"Bayesian computation: A statistical revolution","262875505":"conting: An R Package for Bayesian Analysis of Complete and Incomplete Contingency Tables","225980836":"Automating and evaluating reversible jump MCMC proposal distributions","248132886":"Towards Automatic Reversible Jump Markov Chain Monte Carlo","252927951":"Joint Modeling of Dynamic and Cross-Sectional Heterogeneity: Introducing Hidden Markov Panel Models","228385856":"Adaptive Monte Carlo for Bayesian Variable Selection in Regression Models","223779720":"Interacting sequential Monte Carlo samplers for trans-dimensional simulation","260658007":"Two-Layer Particle Filter for Multiple Target Detection and Tracking","259672484":"Inversion of receiver functions without deconvolution—Application to the Indian craton","5207440":"Efficient Bayes factor estimates from the reversible jump output","258459832":"Uncertainties in terrestrial carbon budget related to spring phenology","7483794":"MCMC-based particle filtering for tracking a variable number of interacting targets","38015399":"Multiple-Target Tracking by Spatiotemporal Monte Carlo Markov Chain Data Association","6643841":"Motor Unit Number Estimation—A Bayesian Approach","262887244":"Model choice using reversible jump Markov Chain Monte Carlo","251760617":"Model weights for model choice and averaging","236176891":"Probabilistic surface reconstruction from multiple data sets: An example for the Australian Moho","49740570":"Trans-dimensional geoacoustic inversion","236176894":"Transdimensional tomography with unknown data noise","4993442":"Assessing Poisson variation of intestinal tumor multiplicity in mice carrying a Robertsonian translocation","236176893":"Transdimensional inversion of receiver functions and surface wave dispersion with a Hierarchical Bayes Algorithm","4746663":"Frequentist Model Average Estimators","236664308":"Efficient Bayesian multi-source localization using a graphics processing unit","228627280":"Three-dimensional simulation and inversion of borehole temperatures for reconstructing past climate in complex settings","222070734":"Improving the acceptance rate of reversible jump MCMC proposals","229900871":"Discussion on the paper by Brooks, Giudici and Roberts","258646169":"Trans-dimensional inversion of microtremor array dispersion data with hierarchical autoregressive error models","289184207":"Chapter bodin etal 2015","6862493":"Bayesian inference of hospital-acquired infections and control measures given imperfect surveillance data","46247223":"Comparison of Fully Bayesian and Empirical Bayes approaches for joint Bayesian model selection and estimation of sinusoids via reversible jump MCMC","277038965":"Nonparametric Bayesian Models for Unsupervised Learning","220286424":"Direct simulation for discrete mixture distributions","229515856":"Mapping Quantitative Trait Loci in Outbred Pedigrees"},"index":276}