{"abs":"A Gaussian discrete field is considered, whose mean field and covariance matrix are known a priori. When a sample observation set contaminated with noise at some finite points is obtained, the best estimators are evaluated at observation points as well as at interpolation points, based on an unbiased least error covariance procedure. To visualize a sample field, a method to simulate the Gaussian field conditional on observation, is investigated. A special case is considered, in which the observation is free of noises and an effective method of simulation is proposed, which is a step by step expansion procedure to avoid the Cholesky or modal decomposition of the covariance matrix. This method is based on the orthogonality property between the best estimator and the corresponding error. Numerical examples are demonstrated to show the potential usefulness of the simulation method, and to show that the updating procedure by observation is identical to the Kalman filter algorithm when plural sets of observation are processed.","title":"Kriging and Conditional Simulation of Gaussian Field","id":245285450,"url":"https://www.researchgate.net/publication/245285450_Kriging_and_Conditional_Simulation_of_Gaussian_Field","names":["Masaru Hoshiya","Journal of Engineering Mechanics"],"references":{},"citedIn":{"229351851":"The response of a 344 m long bridge to non-uniform earthquake ground motions","200175407":"Mechanics","269420296":"Fast Update of Conditional Simulation Ensembles","225697401":"Developments in stochastic structural mechanics","275259106":"Error Assessment of Multivariate Random Processes Simulated by a Conditional-Simulation Method","222495311":"A conditional simulation of non-normal velocity/pressure fields","245286931":"Stochastic interpolation of spatial random fields by BF/MCF-ISM","245185869":"A State-of-the-Art Report on Computational Stochastic Mechanics","223291294":"Reliability models for existing structures based on dynamic state estimation and data based asymptotic extreme value analysis","229911974":"Physically compliant, conditionally simulated spatially variable seismic ground motions for performance‐based design","263062521":"Conditional simulation of spatially variable seismic ground motions based on evolutionary spectra","270852476":"Equivalence between Kriging and CPDF Methods for Conditional Simulation","273750024":"Support Vector Machines Approach to Conditional Simulation of Non-Gaussian Stochastic Process","241036291":"Reasonable sampling scale of macropore based on geostatistic theory","233777742":"Efficiency and Accuracy in Simulation of Random Fields","229351626":"Conditional random fields containing non-stationary stochastic processes","275188869":"Estimation of Conditional Non-Gaussian Translation Stochastic Fields","222351395":"Uncertainties in Probabilistic Numerical Analysis of Structures and Solids – Stochastic Finite Elements","245285239":"Kriging of Lognormal Stochastic Field","233761216":"Efficient Simulation of Multidimensional Random Fields","258646532":"A method for spatial estimation of peak ground acceleration in dense arrays","266182700":"Buffeting Response of Vincent Thomas Bridge under Conditionally Simulated Wind","272891057":"Quantifying uncertainty on Pareto fronts with Gaussian Process conditional simulations","233747930":"Stochastic Analysis of Seismic Structural Response with Soil-Structure Interaction","221966156":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","273023920":"Conditional Simulation of Nonstationary Fluctuating Wind Speeds for Long-Span Bridges","222433013":"Numerical simulation of wind effects: A probabilistic perspective","271397972":"Conditional simulation of non-Gaussian wind velocity profiles: Application to buffeting response of Vincent Thomas suspension bridge"},"index":279}