{"abs":"A key problem in the application of kriging is the definition of a local neighborhood in which to search for the most relevant data. A usual practice consists in selecting data close to the location targeted for prediction and, at the same time, distributed as uniformly as possible around this location, in order to discard data conveying redundant information. This approach may however not be optimal, insofar as it does not account for the data spatial correlation. To improve the kriging neighborhood definition, we first examine the effect of including one or more data and present equations in order to quickly update the kriging weights and kriging variances. These equations are then applied to design a stepwise selection algorithm that progressively incorporates the most relevant data, i.e., the data that make the kriging variance decrease more. The proposed algorithm is illustrated on a soil contamination dataset.","title":"The kriging update equations and their application to the selection of neighboring data","id":225331924,"url":"https://www.researchgate.net/publication/225331924_The_kriging_update_equations_and_their_application_to_the_selection_of_neighboring_data","names":["Xavier Emery","Computational Geosciences"],"references":{"220330080":"An Algorithm for Finding Nearest Neighbors","224839908":"An Introduction to Applied Geostatics","35703524":"Optimal network designs in spatial statistics [microform].","38348334":"The screening effect in Kriging","226729028":"Two key parameters when choosing the kriging neighborhood","233648357":"Multivariate Geostatistics – An Introduction With Applications","222061078":"Constrained Optimisation of Soil Sampling for Minimisation of the Kriging Variance","291230833":"Quantitative kriging neighbourhood analysis for the mining geologist - A description of the method with worked case examples","240338872":"The Theory of Regionalized Variables and Its Application","228077459":"Geostatistics: Modeling Spatial Uncertainty. Wiley, New York","275741412":"Statistics for Spatial Data","227287681":"Kriging in terms of projections","285042988":"Geostatistical neighborhoods and subset selection","226970613":"Cross validation of Kriging in a unique neighborhood","221932969":"Statistics For Spatial Data","284663202":"Objective analysis of meteorological fields, Gidrometeoizdat, Leningrad. Translated by Israel Program Scientific Translations","222363030":"Optimal selection of statistical units: An approach via simulated annealing","225843631":"The Updated Kriging Variance and Optimal Sample Design","225248534":"On Some Simplifications of Cokriging Neighborhood","8611294":"Geostatistical analysis of soil contamination in the Swiss Jura. Environ Pollut","222746523":"Kriging in Hydrosciences","225780043":"Data Configurations and the Cokriging System: Simplification by Screen Effects","221678216":"An Introduction To Applied Geostatistics"},"citedIn":{"45182131":"Multi-Gaussian kriging and simulation in the presence of an uncertain mean value","269420296":"Fast Update of Conditional Simulation Ensembles","279527342":"Distributed Clustering Algorithm for Spatial Field Reconstruction in Wireless Sensor Networks","51599579":"Molecular biology of androgen insensitivity","258725625":"When does the screening effect hold?","254331259":"Quantile-Based Optimization of Noisy Computer Experiments With Tunable Precision","269329310":"Conditional simulation for efficient global optimization","266460534":"The KrigInv package: An efficient and user-friendly R implementation of Kriging-based inversion algorithms","241174071":"Near-optimal collecting data strategy based on ordinary Kiriging variance","258831733":"Kriginv: An efficient and user-friendly implementation of batch sequential inversion strategies based on kriging","51210646":"VDR activation of intracellular signaling pathways in skeletal muscle. Mol Cell Endocrinol 347(1-2):11-16","260448989":"Field estimation in wireless sensor networks using distributed kriging","260391448":"Automating Emulator Construction for Geophysical Hazard Maps","235765935":"Local Gaussian Process Approximation for Large Computer Experiments","226895717":"Assessing the accuracy of sequential Gaussian simulation and cosimulation","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","262369166":"KrigInv: An efficient and user-friendly implementation of batch-sequential inversion strategies based on Kriging","220163761":"Cokriging random fields with means related by known linear combinations","262236687":"Noisy kriging-based optimization methods: A unified implementation within the DiceOptim package","232675886":"The use of a genetic algorithm-based search strategy in geostatistics: Application to a set of anisotropic piezometric head data","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","256938721":"An enhanced Gibbs sampler algorithm for non-conditional simulation of Gaussian random vectors","221966156":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","254212112":"2010 Rietz lecture: When does the screening effect hold?","272040385":"Construction and Efficient Implementation of Adaptive Objective-Based Designs of Experiments","282625377":"A method for the updating of stochastic kriging metamodels","237151710":"A geostatistical approach to optimize sampling designs for local forest inventories"},"index":282}