{"abs":"This paper describes, in general terms, a Monte Carlo method for estimating statistical parameters of quantum-mechanical systems. In this method, we construct a Markov chain of transitions between finite sequences of indices, and obtain these parameters in terms of parameters of the limit distribution. This is an extension of the method of Metropolis for classical systems, and may have equally wide application.","title":"The Monte Carlo method in quantum statistical mechanics","id":200104711,"url":"https://www.researchgate.net/publication/200104711_The_Monte_Carlo_method_in_quantum_statistical_mechanics","names":["D. C. Handscomb","Mathematical Proceedings of the Cambridge Philosophical Society"],"references":{"1850239":"Monte Carlo Eigenvalue Methods in Quantum Mechanics and Statistical Mechanics","200105001":"Equation of State by Fast Computing Machines","200622065":"Equation of State Calculations by Fast Computing Machines","38367374":"On Stochastic Matrices Associated with Certain Queueing Processes","267471003":"Quantum Monte Carlo methods in physics and chemistry. Proceedings of the NATO ASI, Cornell Univ., Ithaca, NY, USA, July 12–24, 1998","234985551":"Computation of Order Parameters in an Ising Lattice by the Monte Carlo Method"},"citedIn":{"13302985":"Error reduction using covariance in quantum Monte Carlo simulations","13291468":"Quantum Monte Carlo simulation method for spin systems","234231033":"Monte Carlo study of the one-dimensional quantum Heisenberg ferromagnet near T\u003d0","1871118":"Quantum Monte Carlo in the Interaction Representation --- Application to a Spin-Peierls Model","200104958":"Quantum-Statistical Monte Carlo Method for Heisenberg Spins","235568156":"Monte Carlo study of the two-dimensional spin-1/2 quantum Heisenberg model: Spin correlations in La_ {2} CuO_ {4}","34274066":"Thesis /","258961524":"Recent Trends in the Development and Application of the Monte Carlo Method","253048887":"First-order phase transition of the exchange-interaction model studied by the Handscomb quantum Monte Carlo method","249647814":"Manganese clusters derived from 2-pyridylcyanoxime: New topologies and a large spin ground state in pyridyloximate chemistry","243304360":"Monte Carlo calculation of the magnetization of superparamagnetic particles","1871667":"The Loop Algorithm","23960642":"Self-Assembly of High-Nuclearity Copper Cages: Tricorne Cu 21 and Saddlelike Cyclic Cu 16","225740869":"Exact, complete, and universal continuous-time worldline Monte Carlo approach to the statistics of discrete quantum systems, J. Exp. Theor. Phys. 87(2), 310","281607933":"Edge states for the Kalmeyer-Laughlin wave function","231056114":"Quantum Monte Carlo simulation of the one-dimensional spin-S xxz model. II. High precision calculations for S\u003d1/2","235448895":"Reweighting histograms in quantum Monte Carlo studies of the Heisenberg model","243548088":"A New Monte Carlo Approach to Quantum Spin Systems. II Two Dimensional Systems","200104912":"Monte Carlo solution of antiferromagnetic quantum Heisenberg spin systems","200105168":"A generalization of Handscomb\u0027s quantum Monte Carlo scheme-application to the 1D Hubbard model","231019512":"A Monte Carlo study of the critical behaviour of the longitudinal susceptibility for S\u003d1/2 isotropic Heisenberg ferromagnetic films","13230327":"Thermal Evolution of Spin-Polarons","235517750":"Spreading of damage in the quantum S\u003d 1/2 Heisenberg ferromagnet","231337358":"A retrospective and prospective survey of the Monte Carlo method, SIAM Rev., 12, 1-63","48172183":"Ph. Werner, Continuous-time Monte Carlo methods for quantum impurity models. Rev. Mod. Phys. 83, 349","200105120":"Monte Carlo simulation of quantum statistical lattice models","2224496":"Computing quantum phase transitions","227049949":"Dynamic properties of the Monte Carlo method in statistical mechanics","289838353":"Problems in Statistical Mechanics","1872965":"Numerical Calculations of the B1g Raman Spectrum of the Two-Dimensional Heisenberg Model","259421229":"Dynamics of the spin-1/2 Heisenberg chain at intermediate temperatures","243096865":"The Monte Carlo Method in Quantum Statistics","222627610":"Quantum Monte-Carlo study of the Heisenberg chain with long-range ferromagnetic interactions","13340075":"Monte Carlo study of the quantum spin-(1/2 Heisenberg antiferromagnet on the square lattice","8952809":"Stochastic series expansion method for quantum Ising models with arbitrary interactions","231127714":"Monte Carlo computation of the free energy in quantum two-dimensional Heisenberg ferromagnets using the expanded-ensemble method","267811986":"Efficient continuous-time quantum Monte Carlo algorithm for fermionic lattice models","200104584":"Monte Carlo studies of one-dimensional quantum Heisenberg and XY models","7837202":"Generalized Directed Loop Method for Quantum Monte Carlo Simulations","229313753":"Diagrammatic damage spreading in the quantum Heisenberg ferromagnet","1872995":"Role of winding numbers in quantum Monte Carlo simulations","13347145":"Thermofield quantum Monte Carlo method and its applications to quantum spin systems","257152721":"Phase diagram of the 3D quantum anisotropic XY model—A quantum Monte Carlo calculation","13280073":"Quantum Monte Carlo study of spin correlations in the one-dimensional Hubbard model","7567863":"Stochastic series expansion algorithm for the S\u003d1/2 XY model with four-site ring exchange","220035992":"Optimized broad-histogram ensembles for the simulation of quantum systems","23710447":"Directed update for the stochastic Green function algorithm","252433280":"Reweighting histogram technique for the quantum Heisenberg ferromagnet","258753506":"Geometrically Constructed Markov Chain Monte Carlo Study of Quantum Spin-phonon Complex Systems","235587995":"Nonmagnetic impurities in spin-gapped and gapless Heisenberg antiferromagnets","5497285":"Low-dimensional copper(II) complexes triply bridged with azide/carboxylate/DMSO showing very strong ferromagnetic interaction and influence of dipolar fields at low temperatures: A quantum Monte Carlo magnetic study","232718409":"Proposal of a Checking Parameter in the Simulated Annealing Method\nApplied to the Spin Glass Model","1783683":"Sign problem in Monte Carlo simulations of frustrated quantum spin systems","11025970":"Quantum Monte Carlo with directed loops","13295953":"Low-temperature behavior of the correlation length and the susceptibility of a quantum Heisenberg ferromagnet in two dimensions","1866119":"NMR relaxation rates for the spin-1/2 Heisenberg chain","222727898":"Quantum mechanical effects on condensed matter phenomena","225466577":"Ensemble Optimization Techniques for Classical and Quantum Systems","1867192":"Phase separation and the existence of superconductivity in a one-dimensional copper-oxygen model","1948600":"Possible Exotic Phases in the One-Dimensional Extended Hubbard Model","261584689":"Handscomb Monte-Carlo Method for S \u003d 1/2 Transverse Ising Model","231126881":"The Magnetic Properties of Solid 3He in Two Dimensions","13350243":"Thermodynamic properties of the two-dimensional quantum Heisenberg ferromagnet and the effects of bond dilution","1831347":"Numerical Study of the Spin-Flop Transition in Anisotropic Spin-1/2 Antiferromagnets","1800369":"Critical behavior of the S\u003d1/2 Heisenberg ferromagnet: A Handscomb quantum Monte Carlo study","200104540":"Monte Carlo Simulation of Quantum Spin Systems","271532702":"Excited States in Spin Chains from Conformal Blocks","13295998":"Low-temperature behavior of the correlation length and the susceptibility of the ferromagnetic quantum Heisenberg chain","243478837":"The spin- 1/2 Heisenberg antiferromagnet on a square lattice and its application to the cuprous oxides","285407674":"Reviews in Computational Chemistry, Volume 26","225893580":"Quantum statistical monte carlo methods and applications to spin systems","12689791":"Mapping of Statistical Physics to Information Theory with Application to Biological Systems","3077870":"A Theoretical Analysis of Monte Carlo Algorithms for the Simulation of Gibbs Random Field Images","231062541":"Monte Carlo Simulations of the Quantum XXZ Model in Two Dimensions","48196118":"Quantum disordered ground state for hard-core bosons on the frustrated square lattice","29601804":"Particle methods: An introduction with applications","13292315":"Quantum Monte Carlo study of the spin-1/2 Heisenberg model","13284891":"Correlation functions in periodic chains","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","13314590":"Quantum Monte Carlo study of the one-dimensional Hubbard model with random hopping and random potentials","1946824":"Critical Temperature and the Transition from Quantum to Classical Order Parameter Fluctuations in the Three-Dimensional Heisenberg Antiferromagnet","224825535":"Bridging Lattice-Scale Physics and Continuum Field Theory with Quantum Monte Carlo Simulations","235532498":"Spreading of damage and susceptibility in the quantum S\u003d 1/2 Heisenberg ferromagnet","1882311":"Recent Developments of World-Line Monte Carlo Methods","12437859":"Diagrammatic approach to calculation of the fluctuation correlation matrix in a metabolic system","1871555":"Finite-Size Scaling of the Ground State Parameters of the Two-Dimensional Heisenberg Model","1950207":"Stochastic series expansion method with operator-loop update","1950463":"Monte Carlo study of a two-dimensional quantum ferromagnet","200104710":"Monte Carlo Method applied to Heisenberg ferromagnet","244330108":"Monte Carlo Methods Applied to Quantum-Mechanical Order-Disorder Phenomena in Crystals","2896350":"Brownian Motion and the Riemann Zeta-Function","260482676":"Charge Gaps at Fractional Fillings in Boson Hubbard Ladders","51394275":"Short-loop algorithm for quantum Monte Carlo simulations","230957362":"Numerical simulations of quantum two-dimensional Heisenberg ferromagnetics","46586160":"Electronic Structure Calculation by First Principles for Strongly Correlated Electron Systems","238969031":"Effects of intrabilayer coupling on the magnetic properties of YBa2Cu3O6","1947105":"Quantum Monte Carlo Method for Fermions, Free of Discretization Errors","1864930":"Generalization of the Fortuin-Kasteleyn transformation and its application to quantum spin simulations,","13351988":"Numerical evaluation of the partition function for one-dimensional quantum systems","200105234":"Specific heat of quasi-two-dimensional antiferromagnetic Heisenberg models with varying interplanar couplings"},"index":290}