{"abs":"Collusion-secure fingerprinting codes are an important primitive used by many digital watermarking schemes [1, 10, 9]. Boneh and Shaw [3] define a model for these types of codes and present an explicit construction. Their code has length O(c3 log(l/ε)) and attains security against coalitions of size c with ε error. Boneh and Shaw also present a lower bound of Ω (c3log(1/cε)) on the length of any collusion-secure code.We give new lower bounds on the length of collusion-secure codes by analyzing a weighted coinflipping strategy for the coalition. As an illustration of our methods, we give a simple proof that the Boneh-Shaw construction cannot be asymptotically improved. Next, we prove a general lower bound: no secure code can have length O(c21og(1/cε)), which improves the previous known bound by a factor of c. In particular, we show that any secure code will have length Ω(c2 log(1/cε)) as long as log(l/ε) ≥ K k log c, where K is a constant and k is the number of columns in the code (in some sense, a measure of the code\u0027s complexity). Finally, we describe a general paradigm for constructing fingerprinting codes which encompasses the construction of [3], and show that no secure code that follows this paradigm can have length O((c3/log c) log(1/cε)) follows this (again, by showing a lower bound for large values of ln(1/ε)). This suggests that any attempts at improvement should be directed toward techniques that lie outside our paradigm.","title":"Lower Bounds for Collusion-Secure Fingerprinting","id":220779228,"url":"https://www.researchgate.net/publication/220779228_Lower_Bounds_for_Collusion-Secure_Fingerprinting","names":["Chris Peikert","Abhi Shelat","Adam Smith"],"references":{"225156426":"Tracing Traitors","220337248":"Efficient Traitor Tracing Algorithms using List Decoding.","3080073":"Tracing Traitors","237597198":"Ecient Anonymous Fingerprinting with Group Signatures (Extended Abstract)","235696036":"Information Theory","221327002":"Efficient Anonymous Fingerprinting with Group Signatures","245682537":"Coding Theorems for Discrete Memoryless Systems","247401008":"Resistance of digital ngerprints to collusional attacks","2617808":"Asymmetric Fingerprinting for Larger Collusions","3079606":"Collusion-secure fingerprinting for digital data","2623856":"Anonymous Fingerprinting","221355021":"Fingerprinting Long Forgiving Messages","225127798":"Improved Boneh-Shaw Content Fingerprinting","2383546":"Fingerprinting Digital Documents"},"citedIn":{"228573791":"Probabilistic Fingerprinting Codes Used To Detect Traitor Zero-bit Watermark","238346806":"Robust fingerprinting codes: A near optimal construction","228442075":"Fast detection of Tardos Codes with Boneh-Shaw Types","262371684":"Near-Optimal Collusion-Secure Fingerprinting Codes for Efficiently Tracing Illegal Re-distribution","241630817":"Use of turbo codes with low-rate convolutional constituent codes in fingerprinting scenarios","242370170":"Binary Collusion-Secure Codes: Comparison and Improvements","220766881":"Worst-Case Optimal Fingerprinting Codes for Non-threshold Collusion","220484717":"Tardos fingerprinting is better than we thought","220678956":"Tardos Fingerprinting is Better Than We Thought","220479080":"Low Bandwidth Dynamic Traitor Tracing Schemes","220348590":"Gossip Codes for Fingerprinting: Construction, Erasure Analysis and Pirate Tracing.","220639083":"Improved versions of Tardos’ fingerprinting scheme","278637270":"Tracing copies of multimedia documents with Tardos codes","2864441":"Optimal Probabilistic Fingerprint Codes","224174409":"A Family of Asymptotically Good Binary Fingerprinting Codes","34175248":"Cryptographic error correction /","45340970":"Le traçage de traîtres","249773694":"Convolutional Fingerprinting Information Codes for Collusion Security","220587131":"Improved Tracing Algorithm for Random-Error-Resilient Collusion-Secure Fingerprinting Codes","224203580":"Considering Security and Robustness Constraints for Watermark-based Tardos Fingerprinting","220722305":"Combining Tardos Fingerprinting Codes and Fingercasting","220722190":"Optimization and Evaluation of Randomized c-Secure CRT Code Defined on Polynomial Ring","2671874":"Research Interests","221609371":"Collusion secure convolutional fingerprinting information codes","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","251191552":"Collusion Resistance of Digital Fingerprinting Schemes","251849531":"NUROV: The Network-controlled Underwater Remote Observation Vehicle","224218279":"Security and Robustness Constraints for Spread-Spectrum Tardos Fingerprinting","236965920":"Enhanced Blind Decoding of Tardos Codes with New Map-Based Functions","220696408":"Encryption for Digital Content","260299580":"Impacts of Watermarking Security on Tardos-Based Fingerprinting"},"index":292}