{"abs":"In many schemes for digital watermarking, an attacker in possession of a small fixed number of di#erently marked copies of a single document can easily produce an unmarked copy. In contrast, we show in this paper that if the watermarks have a component-wise normal distribution, then # p n/ ln m di#erently marked copies are required to successfully erase any mark with non-negligible probability. Here n is the dimensionality of the watermarks, and m is the number of di#erently marked copies distributed. This result holds in a specific but natural statistical model of watermarking. 1 NEC Research Institute, 4 Independence Way, Princeton, NJ 08540. 2 Dept. of Mathematics, Massachusetts Institute of Technology, Cambridge, MA 02139. 3 STAR Lab, InterTrust Technologies, 460 Oakmead Parkway, Sunnyvale, CA 94026. 4 Department of Computer Science, Princeton University, Princeton, NJ 08544. Research at Princeton University partially supported by the National Science Foundation, Grant...","title":"Resistance of Digital Watermarks to Collusive Attacks","id":2611541,"url":"https://www.researchgate.net/publication/2611541_Resistance_of_Digital_Watermarks_to_Collusive_Attacks","names":["Joe Kilian","F. Thomson Leighton","Lesley R. Matheson","Talal Shamoon","Robert Endre Tarjan","Francis Zane"],"references":{"222714823":"Handbook of Mathematical Function: With Formulas, Graphs, and Mathematical Tables","5567414":"Secure spread spectrum watermarking for multimedia","3080073":"Tracing Traitors","2617808":"Asymmetric Fingerprinting for Larger Collusions","2623856":"Anonymous Fingerprinting","3079606":"Collusion-secure fingerprinting for digital data","221355021":"Fingerprinting Long Forgiving Messages","243782938":"Some results on the information capacity of authentication channels","221348399":"Asymmetric Fingerprinting (Extended Abstract).","2484938":"Public Watermarks and Resistance to Tampering"},"citedIn":{"3862201":"A Relationship between Quantization and Distribution Rates of Digitally Fingerprinted Data","2393383":"Software Engineering for Security: a Roadmap","221260467":"Multi-flow Attacks Against Network Flow Watermarking Schemes","3321526":"Collusion-Resistant Fingerprinting for Multimedia","220722222":"Robust Object Watermarking: Application to Code","221523640":"Regular Simplex Fingerprints and Their Optimality Properties.","224319954":"Expurgated Gaussian Fingerprinting Codes","221927467":"Evaluation of Multimedia Fingerprinting Image","3455270":"Traitor-Within-Traitor Behavior Forensics: Strategy and Risk Minimization","2864441":"Optimal Probabilistic Fingerprint Codes","220722101":"Analysis of COT-based Fingerprinting Schemes: New Approach to Design Practical and Secure Fingerprinting Scheme","242499558":"Information Security and Privacy, 11th Australasian Conference, ACISP 2006, Melbourne, Australia, July 3-5, 2006, Proceedings","3318566":"Anti-Collusion Fingerprinting for Multimedia","2997945":"Data-Hiding Codes","225461223":"A Note on the Limits of Collusion-Resistant","225348345":"Regular Simplex Fingerprints and Their Optimality Properties","4138279":"Short N-secure fingerprinting code for image","4248922":"Performance of Random Fingerprinting Codes Under Arbitrary Nonlinear Attacks","250776553":"A Watermarking Algorithm for Fingerprinting Intelligence Images","220722235":"Error- and Collusion-Secure Fingerprinting for Digital Data","224381250":"A Case Study in Multimedia Fingerprinting: Behavior Modeling and Forensics for Multimedia Social Networks","220307647":"Efficient Implementation of Zero-Knowledge Proofs for Watermark Detection in Multimedia Data.","2569862":"A Comparative Study of Software Protection Tools Suited for E-Commerce with Contributions to Software Watermarking and Smart Cards","3455255":"Behavior Forensics for Scalable Multiuser Collusion: Fairness Versus Effectiveness","2431242":"Robust Object Watermarking: Application to Code","4289393":"Collusion Resilient Fingerprint Design by Alternating Projections","242406722":"Multimedia Fingerprinting Forensics for Traitor Tracing","257626991":"Image betrayal checking based on organization’s watermarking in Internet","51955885":"Fingerprinting with Equiangular Tight Frames","265753069":"False Positive probabilities in q-ary Tardos codes: comparison of attacks","224142054":"Group-Oriented Anti-Collusion Fingerprint Based on BIBD Code","254056858":"Interference Removal Operation for Spread Spectrum Fingerprinting Scheme","239553912":"CollusionResistantMultimediaFingerprinting: AUnifledFramework","248453900":"Winnowing, a Document Fingerprinting Algorithm","220333542":"Accusation probabilities in Tardos codes: the Gaussian approximation is better than we thought.","251827014":"Colluder Detection for Minimum Collusion Attacks","221671538":"Multi-Flow Attacks Against Network Flow Watermarks: Analysis and\nCountermeasures","220722274":"Security of Public Watermarking Schemes for Binary Sequence","221174888":"A Digital Fingerprint Coding Based on Turbo Codes","4074101":"Proxy certificates-based digital fingerprinting scheme for mobile communication","225259169":"The Marriage of Cryptography and Watermarking — Beneficial and Challenging for Secure Watermarking and Detection","220177359":"Impact of Rounding Error on Spread Spectrum Fingerprinting Scheme.","7771303":"Anti-collusion forensics of multimedia fingerprinting using orthogonal modulation","239578774":"Transactions on Data Hiding and Multimedia Security I","26532294":"Group-Oriented Fingerprinting for Multimedia Forensics","277987267":"Secure fingerprinting on sound foundations","228545229":"Digital video steganalysis exploiting collusion sensitivity","257555338":"False Negative probabilities in Tardos codes","7852835":"Forensic analysis of nonlinear collusion attacks for multimedia fingerprinting","226654428":"An Introduction to the Principles and Requirements of Robust Hashing","224493568":"Information-theoretic analysis of spherical fingerprinting","220735306":"Optimal Gaussian fingeprint decoders","221462224":"Traitor Tracing for Stateful Pirate Decoders with Constant Ciphertext Rate","242540816":"Title of Dissertation: Multimedia Fingerprinting for Multiuser Forensics and Security","251951329":"Estimation of multimedia fingerprinting image","3948762":"Collusion-Resistant Fingerprinting for Multimedia","224557957":"Regular Simplex Fingerprints and Their Optimality Properties","221571932":"Optimal collusion attack for digital fingerprinting","254869593":"Accusation probabilities in Tardos codes: Beyond the Gaussian approximation","221609695":"On Crafty Pirates and Foxy Tracers","227016680":"WBE-Based Anti-collusion Fingerprints: Design and Detection","260542312":"Fingerprinting With Equiangular Tight Frames","264535348":"Lime: Data Lineage in the Malicious Environment","262247633":"How to Break COT-Based Fingerprinting Schemes and Design New One","221523781":"Collusion Secure Convolutional Spread Spectrum Fingerprinting","220405719":"Group-oriented and Collusion Secure Fingerprint for Digital Images","4028104":"Anti-collusion of group-oriented fingerprinting","220833744":"An Anonymous Buyer-Seller Watermarking Protocol with Anonymity Control","224743327":"Resistance of orthogonal Gaussian fingerprints to collusion attacks","220798547":"Fingercasting—Joint Fingerprinting and Decryption of Broadcast Messages","224180006":"Impact of Rounding Error on Spread Spectrum Fingerprinting Scheme","272395840":"Data Lineage in Malicious Environments","266364446":"Financial cryptography. 3rd international conference, FC ’99. Anguilla, British West Indies, February 22–25, 1999. Proceedings","221651912":"Does It Need Trusted Third Party? Design of Buyer-Seller Watermarking Protocol without Trusted Third Party","221523658":"An Efficient Buyer-Seller Watermarking Protocol Based on Chameleon Encryption"},"index":295}