{"abs":"Suppose we are given some fixed (but unknown) subset X of a set# , and our object is to learn as much as possible about the elements of X by asking binary questions. Specifically, each question is just a function F:# #{0, 1},andthe answer to F is just the value F (X i )forsome X i # X, (determined, for example, by a potentially malevolent but truthful, adversary). In this paper, we describe various algorithms for solving this problem, and establish upper and lower bounds on the e#ciency of such algorithms. 1","title":"Guessing Secrets.","id":220342472,"url":"https://www.researchgate.net/publication/220342472_Guessing_Secrets","names":["Fan R. K. Chung","Ronald L. Graham","Frank Thomson Leighton"],"references":{"220345698":"Improved bounds and algorithms for hypergraph 2‐coloring","222474720":"A fast randomized parallel algorithm for the maximal independent set problem","256392459":"Quasi-random subsets of Zn","266507943":"On a problem of Erdős and Lovász. II: n(r)\u003dO(r)","31164476":"On Character Sums and Primitive Roots","222603084":"Families of k-independent sets","3077956":"Construction of asymptotically good low-rate error-correcting codes through pseudo-random graphs","3785077":"Improved bounds and algorithms for hypergraph two-coloring","2389609":"Covers in Uniform Intersecting Families and a Counterexample to a Conjecture of Lovász","258225334":"The Art of Computer Programming","255648271":"Quasi-Random Set Systems","2329655":"Small-Bias Probability Spaces: Efficient Constructions and Applications","220076710":"More on maximal intersecting families of finite sets","222293638":"On 3-chromatic hypergraphs","229764906":"Addendum to “simple constructions of almost k‐wise independent random variables”","222466622":"On maximal intersecting families of finite sets","232633216":"Simple construction of almost k-wise independent random variables","2848532":"The Probabilistic Method"},"citedIn":{"2902700":"Guessing More Secrets via List Decoding","223744694":"The Guessing Secrets problem: A probabilistic approach","3085036":"Upper Bounds on Separating Codes","226103577":"Tracing Traitors by Guessing Secrets. The q-Ary Case","2189509":"Quantum Guessing via Deutsch-Jozsa","2865442":"Asymptotic Overview on Separating Codes","221017281":"Protecting Intellectual Property by Guessing Secrets.","226569772":"Separating codes and a new combinatorial search model","220081041":"Threshold Group Testing","228601679":"Using hypergraph homomorphisms to guess three secrets","220390514":"Guessing secrets efficiently via list decoding","222511538":"Wireless sensors in agriculture and food industry-recent development and future perspective. Comp Electron Agric","252048596":"Bounds for threshold and majority group testing","2864441":"Optimal Probabilistic Fingerprint Codes","38339066":"Guessing Secrets with Inner Product Questions","3086075":"Optimal Algorithms for Two Group Testing Problems, and New Bounds on Generalized Superimposed Codes","4068171":"Efficient recovery of secrets","4825137":"A variant of the guessing secrets game","221434794":"Practical Scenarios for the Van Trung-Martirosyan Codes.","254622548":"Probabilistic variants of Ulam\u0027s game and many-valued logic","2861168":"European Tenure Games","222558781":"Two cooperative versions of the Guessing Secrets problem","2844148":"Antirandomizing the Wrong Game"},"index":297}