{"abs":"In order to protect copyrighted material, codes may be embedded in the content or codes may be associated with the keys used to recover the content. Codes can offer protection by providing some form of traceability (TA) for pirated data. Several researchers have studied different notions of TA and related concepts in previous years. “Strong” versions of TA allow at least one member of a coalition that constructs a “pirate decoder” to be traced. Weaker versions of this concept ensure that no coalition can “frame” a disjoint user or group of users. All these concepts can be formulated as codes having certain combinatorial properties. We study the relationships between the various notions, and we discuss equivalent formulations using structures such as perfect hash families. We use methods from combinatorics and coding theory to provide bounds (necessary conditions) and constructions (sufficient conditions) for the objects of interest","title":"Combinatorial properties of frameproof and traceability codes","id":3080362,"url":"https://www.researchgate.net/publication/3080362_Combinatorial_properties_of_frameproof_and_traceability_codes","names":["Jessica Staddon","Douglas R. Stinson","R. Wei","IEEE Transactions on Information Theory"],"references":{"220687910":"Data Structures and Algorithms 1","222669638":"Secure frameproof codes, key distribution patterns, group testing algorithms and related structures","220533734":"Combinatorial Properties and Constructions of Traceability Schemes and Frameproof Codes","220080921":"A Hypergraph Approach to the Identifying Parent Property: The Case of Multiple Parents","221348217":"Optimum Traitor Tracing and Asymmetric Schemes.","221348583":"New Results on Multi-Receiver Authentication Codes.","3821548":"Broadcast anti-jamming systems","221355046":"Efficient Methods for Integrating Traceability and Broadcast Encryption","3079606":"Collusion-secure fingerprinting for digital data","222076897":"On Codes with the Identifiable Parent Property","225124554":"Families of finite sets in which no set is covered by the union ofr others","221354770":"Coding Constructions for Blacklisting Problems without Computational Assumptions.","3080073":"Tracing Traitors","221355098":"Dynamic Traitor Tracing","245985796":"Dynamic Traitor Tracing Advances in Cryptology-CRYPTO\u0027\u002799","221355522":"An Efficient Public Key Traitor Tracing Scheme","262864159":"Fundamental Study - Perfect hashing","222908607":"Optimal Linear Perfect Hash Families","222390008":"Families of finite sets in which no set is covered by the union of two others","224067107":"Inherently large traceability of broadcast encryption scheme","222991408":"Perfect Hash Families: Probabilistic Methods and Explicit Constructions","225387413":"Coding Constructions for Blacklisting Problems without Computational Assumptions","220153379":"Perfect Hashing.","2264031":"Some Recursive Constructions for Perfect Hash Families","2848532":"The Probabilistic Method","220695960":"The Probabilistic Method"},"citedIn":{"221348145":"Traitor Tracing with Constant Transmission Rate","225525109":"On codes with \nw\n-identifiable parent property","261207959":"Frameproof codes and compressive sensing","220080921":"A Hypergraph Approach to the Identifying Parent Property: The Case of Multiple Parents","4023863":"A new self-healing key distribution scheme","220678956":"Tardos Fingerprinting is Better Than We Thought","220963109":"A Trellis-Based Bound on (2, 1)-Separating Codes.","220271918":"Improving the Round Complexity of Traitor Tracing Schemes","256498013":"Deterring Traitor Using Double Encryption Scheme","3338791":"Soft-decision tracing in fingerprinted multimedia content","220614448":"A note about the identifier parent property in Reed-Solomon codes","220240182":"Fingerprinting Codes for Internet-Based Live Pay-TV System Using Balanced Incomplete Block Designs","226888593":"FUNCTION FIELDS OVER FINITE FIELDS AND THEIR APPLICATIONS TO CRYPTOGRAPHY","230648741":"Upper Bounds on the Number of Codewords of Some Separating Codes","221523758":"Fingerprinting Schemes. Identifying the Guilty Sources Using Side Information","222516569":"Bounds for separating hash families","221239603":"New Traceability Codes Against a Generalized Collusion Attack for Digital Fingerprinting.","2552889":"Perfect Hash Families with Few Functions","226741660":"Binary Fingerprinting Codes","4303973":"Improved collusion-secure codes for digital fingerprinting based on finite geometries","224621382":"Attacks and Forensic Analysis for Multimedia Content Protection","228060095":"Improved Constructions of Frameproof Codes","225047361":"Hierarchical Traceability Of Multimedia Documents","221523741":"Interleaving Embedding Scheme for ECC-Based Multimedia Fingerprinting","225725278":"On optimal codes with \nw\n-identifiable parent property","225225536":"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys","220722442":"On the IPP properties of Reed-Solomon codes","224242547":"On Anti-Collusion Codes and Detection Algorithms for Multimedia Fingerprinting","260542376":"On the Rekeying Load in Group Key Distributions Using Cover-Free Families","221273856":"On the systematic generation of Tardos\u0027s fingerprinting codes","259742543":"Deterring Traitor Using Double Encryption Scheme","273392255":"Kernelized Neighborhood Preserving Hashing for Social-Network-Oriented Digital Fingerprints","222561148":"Generalized hashing and parent-identifying codes","257636194":"A collusion attack optimization framework toward spread-spectrum fingerprinting","227627435":"Constructions of 2‐cover‐free families and related separating hash families","220239130":"On Collusion Security of Random Codes.","241630813":"Lower bounds on almost-separating binary codes","262246813":"A collusion attack optimization strategy for digital fingerprinting","221011218":"Group-based joint coding and embedding technique for multimedia fingerprinting","280970369":"A Combinatorial Model of Interference in Frequency Hopping Schemes","3086864":"Some Improved Bounds for Secure Frameproof Codes and Related Separating Hash Families","220942190":"Building efficient and effective multimedia fingerprints via joint coding and embedding","225179426":"A 2-Secure Code with Efficient Tracing Algorithm","220739431":"Identification of Traitors Using a Trellis.","225210147":"Explicit constructions of separating hash families from algebraic curves over finite fields","221540710":"Frameproof and IPP Codes","3080827":"Asymptotic bounds on frameproof codes","262290942":"An asymmetric fingerprinting code for collusion-resistant buyer-seller watermarking","220457342":"Pricing for Utility-Driven Resource Management and Allocation in Clusters","226103577":"Tracing Traitors by Guessing Secrets. The q-Ary Case","220076413":"On generalized separating hash families","279720132":"Practical “Traitor Tracing”","221651806":"Tracing and Revoking Pirate Rebroadcasts","277593848":"Almost separating and almost secure frameproof codes over $$q$$ q -ary alphabets","251973004":"A real-time robust digital fingerprinting algorithm","221056935":"The Key Establishment Problem.","228862260":"Efficient traitor tracing","225128954":"Performance Study on Multimedia Fingerprinting Employing Traceability Codes","3480740":"Tracing illegal redistribution using errors-anderasures and side information decoding algorithms","258374131":"Some New Results on Equivalency of Collusion-Secure Properties for Reed-Solomon Codes","221434794":"Practical Scenarios for the Van Trung-Martirosyan Codes.","220904883":"Fingerprinting Codes for Live Pay-Television Broadcast Via Internet","263230762":"On t‐Covering Arrays: Proceedings of the Third Pythagorean Conference","221420948":"Traitor Tracing Against Powerful Attacks Using Combinatorial Designs","228963587":"An Overview of the Advanced Access Content System (AACS)","220684170":"Separable Codes","221631899":"Renewable Traitor Tracing: A Trace-Revoke-Trace System For Anonymous Attack","221609344":"Collusion Secure q-ary Fingerprinting for Perceptual Content","267660097":"On the relationship between the traceability properties of Reed-Solomon codes","220945808":"New Traceability Codes and Identification Algorithm for Tracing Pirates","289238914":"Analysis of properties of q-ary Reed–Muller error-correcting codes viewed as codes for copyright protection","3085036":"Upper Bounds on Separating Codes","220725743":"Practical Forensic Analysis in Advanced Access Content System","262371684":"Near-Optimal Collusion-Secure Fingerprinting Codes for Efficiently Tracing Illegal Re-distribution","220532718":"On the Maximal Codes of Length 3 with the 2-Identifiable Parent Property","220335603":"Copyrighting Public-key Functions and Applications to Black-box Traitor Tracing.","221174770":"Collision-Resilient Multi-state Query Tree Protocol for Fast RFID Tag Identification.","257555333":"New bounds on 2¯-separable codes of length 2","222076897":"On Codes with the Identifiable Parent Property","224183732":"Comments on \"New Results on Frame-Proof Codes and Traceability Schemes\"","221116381":"Mediated Traceable Anonymous Encryption","291437482":"Good traceability codes do exist","284138010":"Bounds and constructions for $${\\overline{3}}$$ 3 ¯ -separable codes with length 3","221609421":"Traitor Tracing with Constant Size Ciphertext","251956736":"Robust parent-identifying codes","250396651":"Codes for Digital Fingerprinting","2865442":"Asymptotic Overview on Separating Codes","242085223":"Methodologies in Digital Watermarking: Robust and Reversible Watermarking Techniques for Authentication, Security and Privacy Protection","263230651":"Design of Self‐Healing Key Distribution Schemes: Proceedings of the Third Pythagorean Conference","244437919":"PERFORMANCE STUDY OF ECC-BASED COLLUSION-RESISTANT MULTIMEDIA FINGERPRINTING","221927466":"Polynomial-Time Codes Against Averaging Attack for Multimedia Fingerprinting","2864441":"Optimal Probabilistic Fingerprint Codes","224379977":"Fingerprinting With Minimum Distance Decoding","34175248":"Cryptographic error correction /","220357694":"New Bounds on Parent-Identifying Codes: The Case of Multiple Parents","2383620":"Choices in Designing a Fingerprinting System","221347856":"Extracting Group Signatures from Traitor Tracing Schemes","3455248":"Joint Coding and Embedding Techniques for Multimedia Fingerprinting","221609491":"A fully collusion resistant broadcast, trace, and revoke system","220905474":"Traitor Tracing without A Priori Bound on the Coalition Size.","220335627":"Group Testing and Batch Verification","257555063":"A tight bound for frameproof codes viewed in terms of separating hash families","3319041":"Identification of Traitors in Algebraic-Geometric Traceability Codes","220337174":"Traitor tracing scheme with constant ciphertext rate against powerful pirates","264186505":"Traitor Traceability of Colluded Multimedia Fingerprinting code Using Hamming Distance on XOR Collusion Attack","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","280750978":"Watermarking for alternative requirements","220833811":"Binary Codes for Collusion-Secure Fingerprinting","224724575":"Soft-decision decoding of traceability codes","4021511":"A generalization of traceability codes using ideal-based codes","220639261":"New constructions for IPP codes","220639258":"On a Class of Traceability Codes","220334109":"Prolific Codes with the Identifiable Parent Property","220337248":"Efficient Traitor Tracing Algorithms using List Decoding.","220897391":"Generic Construction of Hybrid Public Key Traitor Tracing with Full-Public-Traceability","221208169":"Shared Generation of Pseudo-Random Functions with Cumulative Maps","220725871":"Defending against the Pirate Evolution Attack","41440561":"Encryption mechanisms for digital content distribution","221208160":"Fault Tolerant and DistributedBroadcast Encryption.","221355623":"Pirate Evolution: How to Make the Most of Your Traitor Keys","220333173":"Robust Parent-Identifying Codes and Combinatorial Arrays","221609583":"Traitor Tracing for Shortened and Corrupted Fingerprints","220776050":"Separation and Witnesses","222619673":"A Class of I.p.p. Codes With Efficient Identification","26898116":"Collusion-resistant fingerprinting for multimedia in a broadcast channel environment","222402081":"An Upper Bound on the Size of a Code with the k-Identifiable Parent Property","256498217":"Traitor Tracing Scheme to Counter Piracy Strategies","221000271":"Efficient traitor tracing for clone attack in content protection","242256152":"Fingerprinting Schemes for the Protection of Multimedia Distribution Rights","3976022":"Efficient identification of traitors in fingerprinted multimedia contents","4349228":"Randomized Frameproof Codes: Fingerprinting Plus Validation Minus Tracing","3960142":"Decoding codes with the identifiable parent property","221523522":"Attack Analysis for He \u0026 Wu’s Joint Watermarking/Fingerprinting Scheme","221540940":"Identification Algorithms for Sequential Traitor Tracing.","3080529":"New results on frame-proof codes and traceability schemes","220776022":"On the Effects of Pirate Evolution on the Design of Digital Content Distribution Systems.","3086160":"On Self-Healing Key Distribution Schemes","268167291":"Constructions of Almost Secure Frameproof Codes Based on Small-Bias Probability Spaces","220079263":"Traceability Codes","220235940":"A Digital Fingerprinting Code Based on a Projective Plane and Its Identifiability of All Malicious Users","276211198":"Probabilistic Existence Results for Separable Codes","220766881":"Worst-Case Optimal Fingerprinting Codes for Non-threshold Collusion","3084733":"Sequential traitor tracing","220905144":"Systematic Treatment of Collusion Secure Codes: Security Definitions and Their Relations","220571830":"Defending against the pirate evolution attack","3084727":"Applications of list decoding to tracing traitors","267272310":"New Bounds on Separable Codes for Multimedia Fingerprinting","223221975":"Identity-based broadcast signcryption","251973277":"Robust embedding and detection for multimedia fingerprinting","226762264":"Efficient Traitor Tracing Algorithms Using List Decoding","220962996":"Separating and Intersecting Properties of BCH and Kasami Codes.","263471637":"On tight bounds for binary frameproof codes","2835337":"Fault Tolerant and Distributed Broadcast Encryption","3086217":"Combinatorial Properties for Traceability Codes Using Error Correcting Codes","220948611":"Topology-Transparent Duty Cycling for Wireless Sensor Networks","261038119":"A scheme of betrayal checking and traitor tracing for confidential image in Internet","220638860":"Upper bounds for parent-identifying set systems","46119692":"Anti-Collusion Fingerprinting for Multimedia Content Protection","224213225":"Identifying Traitors Using the Koetter–Vardy Algorithm","220905118":"Attacking Traitor Tracing Schemes Using History Recording and Abrupt Decoders.","3080601":"A class of traceability codes","224238826":"Compressive Sensing Matrices and Hash Families","257428704":"Black-Box Trace\u0026Revoke Codes","45110026":"Sequential and Dynamic Frameproof Codes","224142054":"Group-Oriented Anti-Collusion Fingerprint Based on BIBD Code","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","45110027":"Sliding-window dynamic frameproof codes","229037085":"New bounds for generalized separating hash families","224195303":"A Digital Fingerprint Scheme Based on MPEG-2","45813511":"Efficient Coalition Detection in Traitor Tracing","220437661":"Hierarchical Spread Spectrum Fingerprinting Scheme Based on the CDMA Technique","222828168":"Content adaptive watermarking for multimedia fingerprinting","221160686":"Key Management for Multicast Fingerprinting","232630814":"A Performance Evaluation of Collusion Attacks in Multimedia Fingerprinting","220333286":"Recursive Constructions of Secure Codes and Hash Families Using Difference Function Families.","221135079":"Traitor tracing for prerecorded and recordable media","220335343":"Traitor-Tracing on Binary Strings.","224101515":"A note on the equivalence of the traceability properties of Reed-Solomon codes for certain coalition sizes","1960396":"On the Fingerprinting Capacity Under the Marking Assumption","220242676":"Systematic Generation of Tardos\u0027s Fingerprint Codes","2368508":"Frameproof and IPP Codes","221135094":"Adaptive traitor tracing for large anonymous attack","252048600":"Almost separating and almost secure frameproof codes","48602886":"Frameproof Codes","224621703":"Traitor tracing against powerful attacks","220242628":"Fingerprinting Codes for Multimedia Data against Averaging Attack","291949697":"Asymptotically optimal 2 ¯ $\\overline {2}$ -separable codes with length 4","263533151":"On a Bound of Cover-Free Families","222400685":"A bound on the size of separating hash families","220307663":"Collusion-Resistant Fingerprinting Systems: Review and Recent Results.","220833990":"A Note About the Traceability Properties of Linear Codes","29799472":"Perfect hash families, identifiable parent property codes and covering arrays","251191552":"Collusion Resistance of Digital Fingerprinting Schemes","220680412":"Applications of list decoding to tracing traitors.","288798925":"Cover-Free Codes and Separating System Codes"},"index":300}