{"abs":"The Authors compare, theoretically and by simulations, various algorithms for sampling mixture models. The starting point is the algorithm of Carlin and Chib (1995), which augments the parameter space through the involvement of so-called pseudo priors or linking functions. Carlin and Chib (1995) originally introduced their algorithm (from now on, the CC algorithm) with the purpose of overcoming some limitations implicit in more standard MCMC approaches, for instance in the case of models with parameter space of varying size. In the development of the present paper, the CC algorithm is implemented in the context of mixture models of fixed size, with the aim of improving the mixing of a standard Gibbs sampler, whose performance is negatively affected by the high correlation between mixture weights and components.The first contribution is the generalization of the CC algorithm along two directions: the first one involves the substitution of the Gibbs step by a Metropolis step, in order to ...","title":"Introduction to On the use of Markov chain Monte Carlo methods for the sampling of mixture models by R. Douc, F. Maire, J. Olsson","id":267865371,"url":"https://www.researchgate.net/publication/267865371_Introduction_to_On_the_use_of_Markov_chain_Monte_Carlo_methods_for_the_sampling_of_mixture_models_by_R_Douc_F_Maire_J_Olsson","names":["Stefano Peluso","Statistics and Computing"],"references":{"4744329":"Marginal Likelihood From the Metropolis-Hastings Output","38339757":"Analysis of a nonreversible Markov chain sampler","2287413":"On non-reversible Markov chains","2310052":"Ordering Monte Carlo Markov Chains","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","243764509":"Marginal likelihood from the Gibbs output. J Am Stat Assoc","2675235":"Bayesian Analysis of Mixture Models With an Unknown Number of Components – An Alternative to Reversible Jump Methods","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo"},"citedIn":{},"index":301}