{"abs":"We construct a public key encryption scheme in which there is one public encryption key, but many private decryption keys. If some digital content (e.g., a music clip) is encrypted using the public key and distributed through a broadcast channel, then each legitimate user can decrypt using its own private key. Furthermore, if a coalition of users collude to create a new decryption key then there is an efficient algorithm to trace the new key to i ts creators. Hence, our system provides a simple and efficient solution to the \"traitor tracing problem\". A minor modification to the scheme enables it to resist an adaptive chosen ciphertext attack. Our techniques apply error correcting codes to the discrete log representation problem.","title":"An Efficient Public Key Traitor Tracing Scheme","id":221355522,"url":"https://www.researchgate.net/publication/221355522_An_Efficient_Public_Key_Traitor_Tracing_Scheme","names":["Dan Boneh","Matthew K. Franklin"],"references":{"221274800":"Key Preassigned Traceability Schemes for Broadcast Encryption.","221348401":"A New Public-Key Cryptosystem as Secure as Factoring.","225156426":"Tracing Traitors","220533734":"Combinatorial Properties and Constructions of Traceability Schemes and Frameproof Codes","2611299":"The Decision Diffie-Hellman Problem","221355605":"Incremental Cryptography: The Case of Hashing and Signing.","3080073":"Tracing Traitors","221348217":"Optimum Traitor Tracing and Asymmetric Schemes.","221348062":"Public-Key Cryptosystems Based on Composite Degree Residuosity Classes","221590469":"Faster Solution of the Key Equation for Decoding BCH Error-Correcting Codes.","3785000":"Improved decoding of Reed-Solomon and algebraic-geometric codes","2788347":"Digital Signets: Self-Enforcing Protection of Digital Information","225110270":"A practical public key cryptosystem provably secure against adaptive chosen ciphertext attack","239552883":"Error correction of algebraic block codes","2617808":"Asymmetric Fingerprinting for Larger Collusions","221591757":"Digital Signets: Self-Enforcing Protection of Digital Information (Preliminary Version).","243776030":"Public-Key Cryptosystems Based on Discrete Logarithms Residues","221355466":"Threshold Traitor Tracing.","220722201":"Trials of Traced Traitors.","2814292":"Incremental Cryptography: The Case of Hashing and Signing"},"citedIn":{"221348145":"Traitor Tracing with Constant Transmission Rate","238346806":"Robust fingerprinting codes: A near optimal construction","3338801":"A dual watermark-fingerprint system","249837805":"A Fully Public Key Tracing and Revocation Scheme Provably Secure Against Adaptive Adversary","223415130":"Cryptographic methods for collusion-secure fingerprinting of digital data","221355327":"Broadcast Encryption","242499706":"E-Commerce and Web Technologies, Third International Conference, EC-Web 2002, Aix-en-Provence, France, September 2-6, 2002, Proceedings","220898597":"Fully Collusion Resistant Black-Box Traitor Revocable Broadcast Encryption with Short Private Keys","220271918":"Improving the Round Complexity of Traitor Tracing Schemes","242504293":"Public Key Cryptography, 5th International Workshop on Practice and Theory in Public Key Cryptosystems, PKC 2002, Paris, France, February 12-14, 2002, Proceedings","221571366":"Multimedia content screening using a dual watermarking and fingerprinting system","221609254":"Breaking and Repairing Asymmetric Public-Key Traitor Tracing","3338791":"Soft-decision tracing in fingerprinted multimedia content","2937403":"Scalable Public-Key Tracing and Revoking","226265959":"Trade-Off Traitor Tracing","226932635":"A Code for Sequential Traitor Tracing","4136993":"Linear Combination Collusion Attack and its Application on an Anti-Collusion Fingerprinting","242703465":"Copyright Protection with Traitor Tracing schemes and supplying undeniable proof of the traitor\u0027s treachery by means of Asymmetric Traitor Tracing","221327150":"A Revocation Scheme with Minimal Storage at Receivers","238720025":"Public Key Cryptography, 4th International Workshop on Practice and Theory in Public Key Cryptography, PKC 2001, Cheju Island, Korea, February 13-15, 2001, Proceedings","225225536":"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys","220333324":"Building Efficient Fully Collusion-Resilient Traitor Tracing and Revocation Schemes.","226239827":"Accountable Anonymous Communication","266541520":"Optimal Public Key Traitor Tracing Scheme in Non-Black Box Model","220271893":"A Traitor Tracing Scheme Based on RSA for Fast Decryption","273392255":"Kernelized Neighborhood Preserving Hashing for Social-Network-Oriented Digital Fingerprints","221327110":"A Traceable Block Cipher","250609864":"Watermarking Tamper-Proofing and Obfuscation","249580763":"Two-Factor Authentication","221355376":"Self Protecting Pirates and Black-Box Traitor Tracing","221156714":"Coercion-Resistant Electronic Elections","221651825":"Improved Algebraic Traitor Tracing Scheme.","220292966":"Wireless broadcast encryption based on smart cards","226813900":"An improved traitor tracing scheme based on bilinear map","225179426":"A 2-Secure Code with Efficient Tracing Algorithm","220938598":"Multicrypt: A Provably Secure Encryption Scheme for Multicast Communication","251817805":"A Traitor Tracing Scheme Based on the RSA Scheme","237665913":"Fully Collusion-Resilient Traitor Tracing Scheme","3901551":"Information hiding for EC: public key traitor tracing for digital copyright protection","221348715":"Public Traceability in Traitor Tracing Schemes","4215837":"Efficient Traitor Tracing Scheme Based On NTRU","220688197":"List Decoding of Error-Correcting Codes (Winning Thesis of the 2002 ACM Doctoral Dissertation Competition)","221208394":"How to Construct Multicast Cryptosystems Provably Secure Against Adaptive Chosen Ciphertext Attack","221017418":"An Asymmetric Traceability Scheme for Copyright Protection without Trust Assumptions.","221651806":"Tracing and Revoking Pirate Rebroadcasts","267466138":"Hardness of k-LWE and Applications in Traitor Tracing","255659346":"New Method of Integrating Data Persistence and Full Text Index","282598568":"A note on the security of KHL scheme","221010781":"A Public-Key Traitor Tracing Scheme with Revocation Using Dynamic Shares","226986997":"Dynamic subtree tracing and its application in pay-TV systems","267711367":"Tracing Insider Attacks in the Context of Predicate Encryption Schemes","235923578":"Cryptographic Accumulators: Definitions, Constructions and Applications","221354820":"Long-Lived Broadcast Encryption","221156699":"Regulating access to SMIL formatted pay-per-view movies.","220333402":"On Error Correction in the Exponent","228578788":"Renewable Traitor Tracing: A Broadcast, Tracing and Revoke System for Anonymous Attack","262244829":"Message-Based Traitor Tracing with Optimal Ciphertext Rate","250237591":"Information Flow in the Peer-Reviewing Process (Extended Abstract)","272395841":"Group Key Agreement with Local Connectivity","265571158":"On Continual Leakage of Discrete Log Representations","3080362":"Combinatorial properties of frameproof and traceability codes","225127906":"Public Key Trace and Revoke Scheme Secure against Adaptive Chosen Ciphertext Attack","3948720":"Self-Healing Key Distribution with Revocation","2332844":"Authentic Attributes with Fine-Grained Anonymity Protection","220334512":"Public Key Broadcast Encryption with Low Number of Keys and Constant Decryption Time (Version 2).","226050539":"Using Digital Watermarking for Securing Next Generation Media Broadcasts","221056952":"Cryptographic Algorithms for Multimedia Traffic.","224319940":"Signatures for Content Distribution with Network Coding","45825575":"A Traitor Tracing Scheme Based on the RSA System","221326764":"A Public-Key Black-Box Traitor Tracing Scheme with Sublinear Ciphertext Size Against Self-Defensive Pirates","30513486":"Courbes elliptiques et applications cryptographiques à la diffusion numérique sécurisée","220334982":"A New Joint Fingerprinting and Decryption Scheme based on a Lattice Problem.","4251877":"Information Flow in the Peer-Reviewing Process","221420948":"Traitor Tracing Against Powerful Attacks Using Combinatorial Designs","221631899":"Renewable Traitor Tracing: A Trace-Revoke-Trace System For Anonymous Attack","44795397":"Improving the Boneh-Franklin Traitor Tracing Scheme","221204864":"Secure Authenticated Key Establishment Protocol for Ad Hoc Networks.","225151963":"Efficient Trace and Revoke Schemes","268397389":"Tracing Illegal Redistributors of Streaming Contents using Traffic Patterns","255365514":"A Flexibly Revocable Key-Distribution Scheme for Efficient BlackBox Tracing","220798367":"Linear Code Implies Public-Key Traitor Tracing with Revocation","225113565":"A Public-Key Traitor Tracing Scheme with an Optimal Transmission Rate","224647134":"New Traitor Tracing Scheme against Anonymous Attack","224127899":"Network-Based Traitor-Tracing Technique Using Traffic Pattern","3880186":"On key distribution in secure multicasting","221540853":"Reed Solomon Codes for Digital Fingerprinting.","277296196":"DYNAMIC FRAMEPROOF CODES","220588006":"Attribute-Based Traitor Tracing","221052904":"Identity-Based Authenticated Broadcast Encryption and Distributed Authenticated Encryption","29780736":"Efficiency Enhancement of Secure Multi-Party Protocols for Privacy and Privilege Protection","220334570":"Identity-Based Broadcast Encryption.","221651964":"An Efficient Single-Key Pirates Tracing Scheme Using Cover-Free Families.","241160338":"An Improved Collusion-Resistant Public-Key Traitor Tracing Scheme","220798456":"Privacy against Piracy: Protecting Two-Level Revocable P-K Traitor Tracing","220335603":"Copyrighting Public-key Functions and Applications to Black-box Traitor Tracing.","257727881":"An Improved Traitors Tracing Scheme Based on ELGamal","267400486":"A Novel Encryption Method with Its Application in the Copyright Protection of Digital Data","221018100":"An Intelligent and Efficient Traitor Tracing for Ubiquitous Environments","45816417":"A License Transfer System for Supporting Content Portability in Digital Rights Management","220798451":"Forgery Attack to an Asymptotically Optimal Traitor Tracing Scheme.","254018558":"A Secure Reed–Solomon Code Incentive Scheme for Commercial Ad Dissemination Over VANETs","35632324":"On cryptographic techniques for digital rights management /","220833781":"Efficient Anonymous Fingerprinting of Electronic Information with Improved Automatic Identification of Redistributors.","239545497":"P4P: A Practical Framework for Privacy-Preserving Distributed Computation","221326831":"An Efficient Public Key Trace and Revoke Scheme Secure against Adaptive Chosen Ciphertext Attack","226123161":"Linear Code Implies Public-Key Traitor Tracing","242500242":"Security and Privacy in the Age of Ubiquitous Computing, IFIP TC11 20th International Conference on Information Security (SEC 2005), May 30 - June 1, 2005, Chiba, Japan","228852044":"A fully public-key traitor-tracing scheme.","220725700":"Traitor Tracing against Public Collaboration","258385288":"One-Time Broadcast Encryption Schemes in Distributed Sensor Networks","262356813":"Fully Secure Codes Based Tracing and Revoking Scheme with Constant Ciphertext","220240336":"Traitor Tracing Scheme Secure against Adaptive Key Exposure and its Application to Anywhere TV Service","220798424":"Adaptively Secure Traitor Tracing Against Key Exposure and Its Application to Anywhere TV Service.","220616658":"Sketching in Adversarial Environments","221609421":"Traitor Tracing with Constant Size Ciphertext","226820476":"Public Key Broadcast Encryption with Low Number of Keys and Constant Decryption Time","221106134":"Identity-Based Trace and Revoke Schemes","220798421":"TTS without Revocation Capability Secure Against CCA2","250396651":"Codes for Digital Fingerprinting","267436282":"A Generic View on Trace-and-Revoke Broadcast Encryption Schemes","220336169":"Complete Tree Subset Difference Broadcast Encryption Scheme and its Analysis.","2864441":"Optimal Probabilistic Fingerprint Codes","221199932":"Randomized Traitor Tracing Algorithms for Broadcast Security.","221243452":"A Privacy-Preserving Scheme for Online Social Networks with Efficient Revocation","221291556":"Accountable Privacy","239542610":"Secure Surveillance using SMIL","220798527":"Multi-service Oriented Broadcast Encryption","220615216":"Tracing and revoking scheme for dynamic privileges against pirate rebroadcast","238669088":"Group-Oriented Encryption and Signature","225171057":"A Public-Key Traitor Tracing Scheme with Revocation Using Dynamic Shares","225166453":"An Efficient Single-Key Pirates Tracing Scheme Using Cover-Free Families","220905482":"Traitor Tracing with Optimal Transmission Rate","221347856":"Extracting Group Signatures from Traitor Tracing Schemes","224243833":"Padding for orthogonality: Efficient subspace authentication for network coding","221609491":"A fully collusion resistant broadcast, trace, and revoke system","2873089":"Practical Pay TV Schemes","264192658":"Two-round ID-based Group Key Agreement Fitted for Pay-TV System","255717904":"Sanitizable Signatures with Several Signers and Sanitizers","220109872":"Fully Collusion-Resistant Trace-and-Revoke Scheme in Prime-Order Groups","261850795":"A Flexible-Revocation Scheme for Efficient Public-Key Black-Box Traitor Tracing*A preliminary version of this paper was presented at Fourth International Conference on Information and Communications Security (ICICS 2002) [1].","268885811":"Topics in cryptology – CT-RSA 2004. The cryptographers’ track at the RSA conference 2004, San Francisco, CA, USA, February 23–27, 2004. Proceedings","221540876":"Robust and Secure Broadcasting","220639261":"New constructions for IPP codes","220335641":"Fully Resilient Traitor Tracing Scheme using Key Update.","220639258":"On a Class of Traceability Codes","221348365":"Traitors Collaborating in Public: Pirates 2.0","29865210":"Anforderungen an die gesetzliche Regulierung zum Schutz digitaler Inhalte unter Berücksichtigung der Effektivität technischer Schutzmechanismen","220337248":"Efficient Traitor Tracing Algorithms using List Decoding.","27529959":"Maximum Codes with the Identifiable Parent Property","221521532":"Perturbing and Protecting a Traceable Block Cipher","264017143":"A Efficient Key Generation and Renewal for Broadcast Encryption","267684024":"Attribute-Based Encryption: Using Identity-Based Encryption for Access Control","226564303":"Multi-recipient Public-Key Encryption with Shortened Ciphertext","237664636":"FOR-PROFIT ORGANIZATION SMALL BUSINESS MINORITY BUSINESS WOMAN-OWNED BUSINESS NAME OF PERFORMING ORGANIZATION, IF DIFFERENT FROM ABOVE ADDRESS OF PERFORMING ORGANIZATION, IF DIFFERENT, INCLUDING 9 DIGIT ZIP CODE","221355623":"Pirate Evolution: How to Make the Most of Your Traitor Keys","220990587":"Efficient Traitor Tracing from Collusion Secure Codes","2469245":"On Long-Lived Public-Key Traitor Tracing. First Steps","262248184":"Watermarking, Tamper-Proofing, and Obfuscation - Tools for Software Protection","228963583":"Accountable Anonymous Communication Infrastructure","220776050":"Separation and Witnesses","256498217":"Traitor Tracing Scheme to Counter Piracy Strategies","224306234":"On network coding for security","237325135":"Anforderungen an die gesetzliche Regulierung zum Schutz digitaler Inhalte unter Ber ¨ ucksichtigung der Effektivit ¨ at technischer Schutzmechanismen Eine Studie im Auftrag des Deutschen Multimediaverbandes (dmmv) e.V. und des Verbandes Privater Rundfunk \u0026 Telekommunikation (VPRT) e.V","221208158":"Efficient Asymmetric Public-Key Traitor Tracing Without Trusted Agents","2919768":"Overview of Traitor Tracing Schemes","225180701":"Breaking Two k-Resilient Traitor Tracing Schemes with Sublinear Ciphertext Size","221540940":"Identification Algorithms for Sequential Traitor Tracing.","221010518":"Efficient Asymmetric Self-Enforcement Scheme with Public Traceability","220776022":"On the Effects of Pirate Evolution on the Design of Digital Content Distribution Systems.","221010604":"Identity-Based Traitor Tracing","247015224":"On Perfect Traitor Tracing","260383751":"New secret key traitor tracing scheme with dispute settlement from bilinear maps","220333216":"An Attack on A Traitor Tracing Scheme","226254072":"A Multi-Key Pirate Decoder Against Traitor Tracing Schemes","264069165":"A Public Key Traitor Tracing Scheme with Key-update Method","220205233":"Efficient broadcast key distribution with dynamic revocation","242499558":"Information Security and Privacy, 11th Australasian Conference, ACISP 2006, Melbourne, Australia, July 3-5, 2006, Proceedings","3084727":"Applications of list decoding to tracing traitors","223221975":"Identity-based broadcast signcryption","224719101":"SAMcast - A Scalable, Secure and Authenticated Multicast Protocol for Large Scale P2P Networks","226762264":"Efficient Traitor Tracing Algorithms Using List Decoding","221609642":"Building efficient fully collusion-resilient traitor tracing and revocation schemes","220638336":"Fully collusion-resistant traitor tracing scheme with shorter ciphertexts","3080073":"Tracing Traitors","224723661":"Generalized hashing and applications to digital fingerprinting","267307077":"A Security Analysis of Some Physical Content Distribution Systems","35701140":"Architectural techniques for enabling secure cryptographic processing /","220905118":"Attacking Traitor Tracing Schemes Using History Recording and Abrupt Decoders.","221135000":"On the security of a public-key traitor tracing scheme with sublinear ciphertext size.","263319559":"Concrete Analysis and Trade-Offs for the (Complete Tree) Layered Subset Difference Broadcast Encryption Scheme","257428704":"Black-Box Trace\u0026Revoke Codes","225777868":"A Group Key Distribution Scheme with Decentralised User Join","224141543":"On Counteracting Byzantine Attacks in Network Coded Peer-to-Peer Networks","2388895":"A General Description of Pirate Strategies in a Binary Fingerprinting System","45110027":"Sliding-window dynamic frameproof codes","2945936":"Random Codes for Digital Fingerprinting","45813511":"Efficient Coalition Detection in Traitor Tracing","221208209":"Lecture Notes in Computer Science","261080143":"A collusion-resisted public key traitor tracing scheme","221017327":"Secure Electronic Copyright Distribution with Public Key Based Traitor Tracing.","221239529":"Practical Pay-TV Scheme Using Traitor Tracing Scheme for Multiple Channels","220237031":"A Trade-off Traitor Tracing Scheme","220334315":"Signing a Linear Subspace: Signature Schemes for Network Coding","227067457":"Defending against Key Abuse Attacks in KP-ABE Enabled Broadcast Systems","239147411":"Security or Privacy, Must We Choose?","268235300":"A collusion attack on asymmetric group key exchange","262220411":"A Variant of Non-Adaptive Group Testing and Its Application in Pay-Television via Internet","220335298":"Revocation and Tracing Schemes for Stateless Receivers","220739273":"Hierarchical Key Assignment for Black-Box Tracing with Efficient Ciphertext Size","221135052":"New traitor tracing schemes using bilinear map","221285074":"Traitor Tracing Technology of Streaming Contents Delivery using Traffic Pattern in Wired/Wireless Environments.","224621703":"Traitor tracing against powerful attacks","224621702":"A secure traitor tracing scheme against key exposure","220739265":"A Flexibly Revocable Key-Distribution Scheme for Efficient Black-Box Tracing.","221609695":"On Crafty Pirates and Foxy Tracers","220905183":"Characteristics of Some Binary Codes for Fingerprinting","251852021":"A Scalable Trace and Revoke Scheme with Security Enhancements","225138835":"Pirate decoder for the broadcast encryption schemes from Crypto 2005","220680412":"Applications of list decoding to tracing traitors."},"index":302}