{"abs":"Light and Widely Applicable (LWA-) MCMC is a novel approximation of the Metropolis-Hastings kernel targeting a posterior distribution defined on a large number of observations. Inspired by Approximate Bayesian Computation, we design a Markov chain whose transition makes use of an unknown but fixed, fraction of the available data, where the random choice of sub-sample is guided by the fidelity of this sub-sample to the observed data, as measured by summary (or sufficient) statistics. LWA-MCMC is a generic and flexible approach, as illustrated by the diverse set of examples which we explore. In each case LWA-MCMC yields excellent performance and in some cases a dramatic improvement compared to existing methodology.","title":"Light and Widely Applicable MCMC: Approximate Bayesian Inference for Large Datasets","id":273640222,"url":"https://www.researchgate.net/publication/273640222_Light_and_Widely_Applicable_MCMC_Approximate_Bayesian_Inference_for_Large_Datasets","names":["Florian Maire","Nial Friel","Pierre Alquier"],"references":{"27468515":"An efficient MCMC method for distributions with intractable normalising constants","41706878":"Coupling a stochastic approximation version of EM with a MCMC procedure","227522317":"Particle Markov Chain Monte Carlo . . .","200622065":"Equation of State Calculations by Fast Computing Machines","239524417":"Playing Russian Roulette with Intractable Likelihoods","261065671":"Firefly Monte Carlo: Exact MCMC with subsets of data","10899818":"Corander JC, Waldmann P, Sillanpää MJ. Bayesian anlysis of genetic differentiation between populations. Genetics 163: 367-374","4772293":"Exact and computationally efficient likelihood-based estimation for discretely observed diffusion processes","47297856":"On Optimal Selection of Summary Statistics for Approximate Bayesian Computation","2453431":"A Sequential Particle Filter Method for Static Models","45910632":"Constructing Summary Statistics for Approximate Bayesian Computation:\nSemi-automatic ABC","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","44617137":"Approximate Bayesian Computation (ABC) in practice","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","261065488":"Noisy Monte Carlo: Convergence of Markov chains with approximate transition kernels","236235190":"Austerity in MCMC Land: Cutting the Metropolis-Hastings Budget","8211096":"A Bayesian MCMC approach to study transmission of Influenza: application to household longitudinal data","48178234":"Approximate Bayesian Computational methods","227599998":"Towards a coherent statistical framework for dense deformable template estimation","2544726":"Markov Chain Monte Carlo Estimation of Exponential Random Graph Models","228381228":"Markov chain Monte Carlo algorithms for the Bayesian analysis of phylogenetic trees","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","228092010":"MCMC for doubly-intractable distributions","272027397":"Calibration of conditional composite likelihood for Bayesian inference on Gibbs random fields","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","38322292":"An Adaptive Metropolis Algorithm"},"citedIn":{},"index":303}