{"abs":"Island endemic species are acutely vulnerable to extinction as a result of stochastic and human impacts. Conservation of unique island biodiversity is high priority, and an understanding of the evolutionary history of vulnerable island species is important to inform conservation management. The Seychelles Black Parrot Coracopsis nigra barklyi is an island endemic threatened with extinction. The total population of 520–900 individuals is restricted to the 38-km2 island of Praslin, and is one of the last few remaining endemic island parrots that survive in the Indian Ocean. We combined mitochondrial and microsatellite DNA markers with morphological data to examine the evolutionary distinctiveness of C. n. barklyi within Coracopsis, and to compare levels of genetic diversity between historical and contemporary specimens. Phylogenetic analyses revealed C. n. barklyi as sister to the remaining three C. nigra subspecies, whilst discriminant function analysis suggested the Seychelles Black Parrot is the smallest of the four subspecies. Higher levels of genetic diversity were observed in historical specimens, whilst only one mtDNA haplotype was observed in the contemporary specimens, suggesting that C. n. barklyi has lost genetic diversity as a consequence of substantial recent population decline. This study provides a first insight into the evolutionary, genetic and morphological processes that have shaped C. n. barklyi and provides an important perspective on this parrot\u0027s current genetic status in order to guide its future conservation management. Whilst further ecological studies are essential, we suggest that C. n. barklyi should be managed as an evolutionary significant unit to conserve its unique evolutionary pathway. This article is protected by copyright. All rights reserved.","title":"Evolutionary distinctiveness and historical decline in genetic diversity in the Seychelles Black Parrot Coracopsis nigra barklyi","id":288479627,"url":"https://www.researchgate.net/publication/288479627_Evolutionary_distinctiveness_and_historical_decline_in_genetic_diversity_in_the_Seychelles_Black_Parrot_Coracopsis_nigra_barklyi","names":["Hazel A Jackson","Nancy Bunbury","Natalia Przelomska","Jim J Groombridge","Ibis"],"references":{"229190313":"Persistence of Different-sized Populations: An Empirical Assessment of Rapid Extinctions in Bighorn Sheep","6432610":"Mammals on the EDGE: Conservation Priorities Based on Threat and Phylogeny","234149110":"Crozier RH. Preserving the information content of species: genetic diversity, phylogeny and conservation worth. Annu Rev Ecol Syst 28: 243-268","221818043":"PARTITIONFINDER: combined selection of partitioning schemes and substitution models for phylogenetic analyses","246833205":"Minimum Population Sizes for Species Conservation","23191522":"New multidimensional functional diversity indices for a multifaceted framework in functional ecology. Ecology","227694998":"Morphological and genetic differentiation in populations of the dispersal-limited coco de mer (Lodoicea maldivica): Implications for management and conservation","229851063":"Copulation behaviour in the Vasa Parrots Coracopsis vasa and C. nigra","12796869":"Inbreeding Depression in the Wild","226696587":"Genetic Diversity in Remnant Mainland and “Pristine” Island Populations of Three Endemic Australian Macropodids (Marsupialia): Macropus Eugenii, Lagorchestes Hirsutus and Petrogale Lateralis","236953111":"A reappraisal of the systematic affinities of Socotran, Arabian and East African scops owls (Otus, Strigidae) using a combination of molecular, biometric and acoustic data","10603432":"Inference of Population Structure Using Multilocus Genotype Data: Linked Loci and Correlated Allele Frequencies Genetics","280931764":"Molecular Systematics of the Cape Parrot (Poicephalus robustus): Implications for Taxonomy and Conservation","51735449":"The evolution of the Indian Ocean parrots (Psittaciformes): Extinction, adaptive radiation and eustacy","228410641":"Population trends of Seychelles magpie-robins Copsychus sechellarum following translocation to Cousin Island, Seychelles","264309452":"Translocation of the Seychelles warbler Acrocephalus sechellensis to establish a new population on Denis Island, Seychelles","5999830":"The Future of Biodiversity","249431379":"Loss of Genetic Diversity from Managed Populations: Interacting Effects of Drift, Mutation, Immigration, Selection, and Population Subdivision","19736738":"Genetics and Demography in Biological Conservation","224208207":"Creating the CIPRES Science Gateway for Inference of Large Phylogenetic Trees","248199135":"Status and conservation of the seychelles black parrot","8615958":"A molecular phylogeny of African kestrels with reference to divergence across the Indian Ocean","247935313":"The optimization of biodiversity conservation. Biol Conserv","272358444":"CLUMPAK: a program for identifying clustering modes and packaging population structure inferences across K","12483622":"STRUCTURE, version 2.3.3, inference of population structure using multilocus genotype data","256073307":"Comparison of historical bottleneck effects and genetic consequences of re-introduction in a critically endangered island passerine","12610010":"Biodiversity Hotspots for Conservation Priorities. Nature 403(6772): 853-858","15909992":"Evolutionary Trees from DNA Sequences: A Maximum Likelihood Approach","5330250":"Molecular phylogeny and morphological change in the Psittacula parakeets","7773162":"Evano G, Regnaut S, Goudet J.. Detecting the number of clusters of individuals using the software STRUCTURE: A simulation study. Mol Ecol 14: 2611-2620","283520506":"RAxML-VI-HPC: Maximum Likelihood-based phylogenetic analyses with thousands of taxa and mixed models","259043693":"Contribution of Inbreeding to extinction risk in threatened species","270507522":"Breeding ecology of the Seychelles Black Parrot Coracopsis barklyi","270507393":"Insights into the feeding ecology of the Seychelles Black Parrot Coracopsis barklyi using two monitoring approaches","39010124":"Conserving the World\u0027s Biological Diversity","14427715":"Reliable genotyping of samples with very low DNA quantities using PCR","230265240":"SequenceMatrix: Concatenation software for the fast assembly of multi-gene datasets with character set and codon information","222394469":"Genetics and Extinction. Biol Conserv","14098032":"Frankham, R.. Do island populations have less genetic variation than mainland populations? Heredity, 78: 311-327","226254678":"Islands: Stability, diversity, conservation","227758910":"Analysis of Applications DNA from Old Scale Samples: Technical Aspects, and Perspectives for Conservation","7818585":"Missing data and the design of phylogenetic analyses. J Biomed Inform","6648394":"Chapuis MP, Estoup A.. Microsatellite null alleles and estimation of population differentiation. Mol Bio Evol 24: 621-631","286418237":"Island Biogeography. Ecology, Evolution, and Conservation","272530959":"The Influence of Mating System and Overlapping Generations on Effective Population Size","228467247":"Inbreeding Depression in Conservation Biology","251586378":"Sustainable Harvesting of Coco de Mer, Lodoicea maldivica, in the Vallée de Mai, Seychelles","273946467":"GENEPOP (Version 1.2): Population Genetics Software for Exact Tests and Ecumenicism \u003chttp://genepop.curtin.edu.au","10618138":"MRBAYES 3: Bayesian Phylogenetic inference under mixed models","227767726":"Unusual sex roles in a highly promiscuous parrot: The Greater Vasa Parrot Caracopsis vasa","230209415":"The evolution of cooperative and pair breeding thornbills Acanthiza (Pardalotidae)","230028151":"The endemic birds of Seychelles","256493197":"Status, distribution and recommendations for monitoring of the Seychelles black parrot Coracopsis (nigra) barklyi","51119689":"Characterisation of Mauritius parakeet (Psittacula eques) microsatellite loci and their cross-utility in other parrots (Psittacidae, AVES)","30492566":"Large mainland populations of South Island robins retain greater genetic diversity than offshore island refuges. Conserv Genet 8:705-714","287104091":"STRUCTURE HARVESTER: a website and program for visualizing STRUCTURE output and implementing the Evanno method","231898011":"Conservation and species lists: Taxonomic neglect promotes the extinction of endemic birds, as exemplified by taxa from eastern Atlantic islands","50907073":"Missing Data in Phylogenetic Analysis: Reconciling Results from Simulations and Empirical Data","15502503":"Extinction Rates: Modern extinctions in the kilo-death range","260610373":"POPTREEW: Web version of POPTREE for constructing population trees from allele frequency data and computing some other quantities","15734590":"A Simple Method for Estimating Evolutionary Rate of Base Substitutions Through Comparative Studies of Nucleotide Sequences","227691970":"Inbreeding and Extinction: A Threshold Effect","12627739":"“Ghost” alleles of the Mauritius Kestrel","228443968":"Reappraisal of the parrots (Aves: Psittacidae) from the Mascarene Islands, with comments on their ecology, morphology, and affinities","227621196":"Has the debate over genetics and extinction of island endemics truly been resolved? Anim Conserv","225082764":"Genetic diversity of a clonal angiosperm near its range limit: The case of Cymodocea nodosa at the Canary Islands","225713554":"Where are we in conservation genetics and where do we need to go?","227629046":"Bijlsma R, Bundgaard J, Boerema AC. Does inbreeding affect the extinction risk of small populations? Predictions from Drosophila. J Evol Biol 13: 502-514","229436228":"GenAIEx V5: Genetic Analysis in Excel. Populations Genetic Software for Teaching and Research","253996617":"Missing data and the accuracy of Bayesian phylognetics","281220009":"Systematics and conservation: On predicting the feature diversity of subsets of taxa","51101924":"MEGA5: Molecular Evolutionary Genetics Analysis Using Maximum Likelihood, Evolutionary Distance, And Maximum Parsimony Methods","240370082":"AppUed island biogeography and the conservation of endangered island birds in the Indian Ocean","223524518":"Conserving the Seychelles Warbler Acrocephalus sechellensis by translocation from Cousin Island to the Islands of Aride and Cousine","12791607":"Extremely Low Mitochondrial DNA Control-Region Sequence Variation in the Otter Lutra Lutra Population of Denmark","24257674":"DnaSP v5: A Software for Comprehensive Analysis of DNA Polymorphism Data","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","8070407":"Hoffman JI, Amos W. Micosatellite genotyping errors: detection approaches, common sources and consequences for paternal exclusion. Mol Ecol 14: 599-612","229308887":"Evaluating the demographic history of the Seychelles kestrel (Falco araea): Genetic evidence for recovery from a population bottleneck following minimal conservation management","223826730":"What to protect?—Systematics and the agony of choice. Biol Conser","271412946":"Seychelles Black Parrot Coracopsis (nigra) barklyi Conservation Assessment \u0026 Action Plan. 2009-2013."},"citedIn":{},"index":305}