{"abs":"Monte Carlo simulation is a useful method for reliability analysis. But in Monte Carlo, a large number of simulations are required to assess small failure probabilities. Many methods, such as Importance sampling, have been proposed to reduce the computational time. In this paper, a new importance sampling Monte Carlo method is proposed that reduces the numbers of calculation of the limit state function. On the other hand, the proposed algorithm does not need the knowledge about the position of the design point or the shape of the limit state function. The key-idea of the proposed algorithm is that the mean of sampling density function is changed throughout the simulation. In fact, in random point generating process each point with lower absolute value of limit state function and nearer distance from space center is considered the mean of the sampling density function. Based on this, the centralization of the sampling will be on the important area.","title":"A new adaptive importance sampling Monte Carlo Method for structural reliability","id":257774300,"url":"https://www.researchgate.net/publication/257774300_A_new_adaptive_importance_sampling_Monte_Carlo_Method_for_structural_reliability","names":["Ehsan Jahani","Mohsenali Shayanfar","Mohammad A. Barkhordari","KSCE Journal of Civil Engineering"],"references":{"222305920":"A general procedure for first/second-order reliabilitymethod (FORM/SORM)","264150780":"Low-discrepancy sampling for structural reliability sensitivity analysis","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","222165872":"Reliability analysis—A review and some perspectives","238394232":"Small Sample Sensitivity Analysis Techniques For Computer-Models, With An Application To Risk Assessment","223711623":"Adaptive radial-based importance sampling method for structural reliability","222660503":"Moment methods for structural reliability[J]","263047733":"Structural Reliability Methods","223017171":"Approach to failure mode analysis of large structures","264177381":"Structural reliability estimation based on quasi ideal importance sampling simulation","236437196":"Reliability assessment and probability based design of reinforced concrete containments and shear walls","243758427":"An Exact and Invariant First Order Reliability Format","248560911":"Importance sampling in structural system","223326063":"Structural reliability assessment based on particle swarm optimization","223239917":"An efficient sampling method for probability of failure calculations. Structural Safety 3:109-115","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","236660920":"Methods of Structural Safety","222211162":"Search-based importance sampling","256421487":"Asymptotic importance sampling","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","245282354":"Neural Network Embedded Monte Carlo Approach for Water Quality Modeling Under Input Information Uncertainty","227241958":"A study on safety assessment of cable-stayed bridges based on stochastic finite element analysis and reliability analysis","222548334":"Reliability-based structural optimization using neural networks and Monte Carlo simulation","222293774":"Interactive reliability-based structural optimization","264150916":"Estimation of load and resistance factors based on the fourth moment method"},"citedIn":{"264382962":"Reliability assessment with fuzzy random variables using Interval Monte Carlo Simulation, Computer-Aided Civil and Infrastructure Engineering, 10 JUN 2013, DOI: 10.1111/mice, Vol. 29, issue 3, pp. 208-220. 2014.","259554187":"Reliability Assessment with Fuzzy Random Variables Using Interval Monte Carlo Simulation","283633536":"A local Kriging approximation method using MPP for reliability-based design optimization","273456689":"Structural reliability assessment utilizing four metaheuristic algorithms"},"index":308}