{"abs":"The rapid advance of sequencing technology, coupled with improvements in molecular methods for obtaining genetic data from ancient sources, holds the promise of producing a wealth of genomic data from time-separated individuals. However, the population-genetic properties of time-structured samples have not been extensively explored. Here, we consider the implications of temporal sampling for analyses of genetic differentiation and use a temporal coalescent framework to show that complex historical events such as size reductions, population replacements, and transient genetic barriers between populations leave a footprint of genetic differentiation that can be traced through history using temporal samples. Our results emphasize explicit consideration of the temporal structure when making inferences and indicate that genomic data from ancient individuals will greatly increase our ability to reconstruct population history.","title":"Investigating Population History Using Temporal Genetic Differentiation","id":264636275,"url":"https://www.researchgate.net/publication/264636275_Investigating_Population_History_Using_Temporal_Genetic_Differentiation","names":["Pontus Skoglund","Per Sjödin","Tobias Skoglund","Martin Lascoux","Mattias Jakobsson","Molecular Biology and Evolution"],"references":{"224856039":"Origins and Genetic Legacy of Neolithic Farmers and Hunter-Gatherers in Europe","44578602":"A Draft Sequence of the Neandertal Genome","259386999":"The complete genome sequence of a Neandertal from the Altai Mountains","51119886":"Combining contemporary and ancient DNA in population genetic and phylogeographic studies","230837578":"Ancient Admixture in Human History","51911312":"ABC: an R package for approximate Bayesian computation (ABC)","21391055":"Inbreeding coefficients and coalescent times","233725410":"Inference of Population Splits and Mixtures from Genome-Wide Allele Frequency Data","50376845":"Excoffier L, Foll M.. Fastsimcoal: a continuous-time coalescent simulator of genomic diversity under arbitrarily complex evolutionary scenarios. Bioinformatics 27: 1332-1334","10954538":"Approximate Bayesian Computation in Population Genetics","220261934":"fastsimcoal: a continuous-time coalescent simulator of genomic diversity under arbitrarily complex evolutionary scenarios","19170740":"Paabo, S. Molecular cloning of Ancient Egyptian mummy DNA. Nature 314, 644-645","41422440":"Ancient human genome sequence of an extinct Palaeo-Eskimo","200033020":"Ancient DNA from the First European Farmers in 7500-Year-Old Neolithic Sites","210296863":"Ancient DNA from the First European Farmers in 7500-Year-old Neolithic Sites","11495861":"Wang JL. A pseudo-likelihood method for estimating effective population size from temporally spaced samples. Genet Res 78: 243-257","49703148":"Genetic history of an archaic hominin group from Denisova Cave in Siberia. Nature","24425450":"Using Classical Population Genetics Tools with Heterochroneous Data: Time Matters!","16692449":"DNA Sequences From the Quagga, An Extinct Member of the Horse Family","221972260":"Microsatellite genotyping reveals end-Pleistocene decline in mammoth autosomal genetic variation","221716116":"Statistical Guidelines for Detecting Past Population Shifts Using Ancient DNA","259956701":"Separating endogenous ancient DNA from modern day contamination in a Siberian Neandertal","249137661":"Breeding Structure of Populations in Relation to Speciation","274015857":"Team RDC.R: A Language And Environment For Statistical Computing. R Foundation for Statistical Computing: Vienna, Austria","258822728":"Upper Palaeolithic Siberian genome reveals dual ancestry of Native Americans","7143624":"Chan YL, Anderson CN, Hadly EA.. Bayesian estimation of the timing and severity of a population bottleneck from ancient DNA. PLoS Genet 2: e59","50592293":"Vanishing native American dog lineages","26836400":"Reconstructing Indian Population History","228100022":"Genomic Affinities of Two 7,000-Year-Old Iberian Hunter-Gatherers","235245621":"Genomic Variation in Seven Khoe-San Groups Reveals Adaptation and Complex African History","260107571":"Assessing the Maximum Contribution from Ancient Populations","11514395":"Hudson, R. R. Generating samples under a Wright-Fisher neutral model. Bioinformatics 18, 337-338","8163659":"Serial SIMCOAL: A population genetic modl for data from multiple populations and points in time.","51040061":"Ho SYW, Shapiro B. Skyline-plot methods for estimating demographic history from nucleotide sequences. Mol Ecol Resour 11: 423-434","51489706":"Inference of Human Population History From Whole Genome Sequence of A Single Individual","8030150":"Bayesian Coalescent Inference of Past Population Dynamics from Molecular Sequences","232228585":"Geographic Sampling Scheme as a Determinant of the Major Axis of Genetic Variation in Principal Components Analysis","246868489":"Monte Carlo evaluation of the likelihood for Ne from temporally spaced","11499631":"Likelihood-Based Estimation of the Effective Population Size Using Temporal Changes in Allele Frequencies: A Genealogical Approach","7416755":"Voight, B.F. et al. Interrogating multiple aspects of variation in a full resequencing data set to infer human population size changes. Proc. Natl. Acad. Sci. USA 102, 18508-18513","13526660":"On the Probability of Neanderthal Ancestry","5427865":"Novembre J, Stephens M.. Interpreting principal component analyses of spatial population genetic variation. Nat Genet 40: 646-649","6125073":"Patterns of damage in genomic DNA sequences from a Neandertal","260234191":"The Genetical Structure of Populations","45951987":"The Confounding Effects of Population Structure, Genetic Diversity and the Sampling Scheme on the Detection and Quantification of Population Size Changes","12696590":"Population growth of human Y chromosomes: A study of Y chromosome microsatellites","255721202":"Genetic Data Analysis","42806367":"Temporal genetic change in the last remaining population of woolly mammoth","40759225":"Removal of deaminated cytosines and detection of in vivo methylation in ancient DNA","49701538":"Estimation of Population Divergence Times from Non-Overlapping Genomic Sequences: Examples from Dogs and Wolves","31959218":"Holocene dwarf mammoths from Wrangel Island in the Siberian Arctic","22036357":"Interspecific competition: a new approach to the classical theory","236265283":"Estimating Variable Effective Population Sizes From Multiple Genomes: A Sequentially Markov Conditional Sampling Distribution Approach","242333094":"Recalibrating Equus evolution using the genome sequence of an early Middle Pleistocene horse","7415336":"Clines, Clusters, and the Effect of Study Design on the Inference of Human Population Structure","272560997":"Temporal Variation in Allele Frequencies: Testing the Right Hypothesis","12226406":"Monte Carlo Evaluation of the Likelihood for Ne From Temporally Spaced Samples","18645698":"Nei M. Analysis of gene diversity in subdivided populations. Proc Nat Acad Sci USA 70: 3321-3323","8276510":"Wright S.. The Genetical Structure of Populations. Ann Eugenic 15: 323-354","46404389":"Analysis of Population Structure: A Unifying Framework and Novel Methods Based on Sparse Factor Analysis","11936084":"Distinguishing Migration From Isolation: A Markov Chain Monte Carlo Approach","24196371":"Ramakrishnan U, Hadly EA.. Using phylochronology to reveal cryptic population histories: review and synthesis of 29 ancient DNA studies. Mol Ecol 18: 1310-1330","8316061":"Population structure in evolution","230769319":"A High-Coverage Genome Sequence from an Archaic Denisovan Individual","270051454":"A draft sequence of the Neandertal genome","8369176":"Evidence for Gradients of Human Genetic Diversity Within and Among Continents","259883156":"A Paleogenomic Perspective on Evolution and Gene Function: New Insights from Ancient DNA","49839761":"Testing for Ancient Admixture between Closely Related Populations","221714654":"New insights into the Tyrolean Iceman’s origin and phenotype as inferred by whole-genome sequencing","38351011":"Coalescent theory for seed bank models","259201048":"A Mitochondrial Genome Sequence of a Hominin from Sima de los Huesos","14140218":"Inferring Coalescence Times From DNA Sequence Data","272560974":"The Genetics of Dacus oleae. V. Changes of Esterase Polymorphism in a Natural Population Following Insecticide Control-Selection or Drift?","5850923":"BEAST: Bayesian Evolutionary Analysis by Sampling Trees","7658374":"Detecting historical bottlenecks using temporal genetic data.","38015799":"McVean G. A genealogical interpretation of principal components analysis. PLoS Genet 5: e1000686","223115706":"The Coalescent","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","6606877":"Patterson N, Price AL, Reich D. Population structure and eigenanalysis. PLoS Genet 2: 2074-2093","26819939":"COMPASS: A program for generating serial samples under an infinite sites model","8677503":"No Evidence of Neandertal mtDNA Contribution to Early Modern Humans","40833424":"A complete mtDNA Genome of an Early Modern Human from Kostenki, Russia"},"citedIn":{"284358849":"Isolation-By-Distance-and-Time in a stepping-stone model","268579140":"The future of ancient DNA: Technical advances and conceptual shifts","279967079":"Population structure among octocoral adults and recruits identifies scale dependent patterns of population isolation in The Bahamas","290597882":"A Spatial Framework for Understanding Population Structure and Admixture","277958189":"Reconstructing ancient genomes and epigenomes","289707546":"Forecasting Ecological Genomics: High-Tech Animal Instrumentation Meets High-Throughput Sequencing"},"index":309}