{"abs":"A new method called \"variational sampling\" is proposed to estimate integrals under probability distributions that can be evaluated up to a normalizing constant. The key idea is to fit the target distribution with an exponential family model by minimizing a strongly consistent empirical approximation to the Kullback-Leibler divergence computed using either deterministic or random sampling. It is shown how variational sampling differs conceptually from both quadrature and importance sampling and established that, in the case of random independence sampling, it may have much faster stochastic convergence than importance sampling under mild conditions. The variational sampling implementation presented in this paper requires a rough initial approximation to the target distribution, which may be found, e.g. using the Laplace method, and is shown to then have the potential to substantially improve over several existing approximate inference techniques to estimate moments of order up to two of nearly-Gaussian distributions, which occur frequently in Bayesian analysis. In particular, an application of variational sampling to Bayesian logistic regression in moderate dimension is presented.","title":"Approximate inference via variational sampling","id":51893132,"url":"https://www.researchgate.net/publication/51893132_Approximate_inference_via_variational_sampling","names":["Alexis Roche"],"references":{"243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","272825857":"UCI Machine Learning Repository","44843119":"Gaussian Variational Approximate Inference for Generalized Linear Mixed Models","221618614":"The Tradeoffs of Large Scale Learning.","226435002":"An Introduction to Variational Methods for Graphical Models","2457314":"A View Of The Em Algorithm That Justifies Incremental, Sparse, And Other Variants","226964942":"Bayesian quadrature with non-normal approximating functions","41781559":"Gaussian Process for Machine Learning","2986278":"Unscented Filtering and Nonlinear Estimation. Proc IEEE","49458431":"A tutorial on adaptive MCMC","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","234108836":"Expectation Propagation for Approximate Bayesian Inference","2836794":"Population Monte Carlo","226218344":"A Tutorial on the Cross-Entropy Method","221618918":"A Stochastic approximation method for inference in probabilistic graphical models.","44843128":"Theory of Gaussian Variational Approximation for a Poisson Mixed Model","243781010":"Monte Carlo Approximations in Bayesian Decision Theory","2457917":"Numerical Integration using Sparse Grids","239358301":"A variational approach to Bayesian logistic regression problems and their extensions","222715292":"Numerical Recipes in C","2833584":"A Tutorial on the Cross-Entropy Method","2365311":"A variational approach to Bayesian logistic regression models and their extensions","238523240":"A Monte Carlo Implementation of the EM Algorithm and the Poor Man\u0027s Data Augmentation Algorithm","228364221":"Skilling, J.: Nested sampling for general Bayesian computation. Bayesian Anal. 1(4), 833-860","245962440":"Divergence measures and message passing","2241728":"Safe and Effective Importance Sampling","221995544":"Bishop, C.M.: Pattern Recognition and Machine Learning. Springer","38357614":"Rejoinder: Markov Chains for Exploring Posterior Distributions","265454203":"Bayes-Hermite quadrature","221617820":"Bayesian Monte Carlo","227375782":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods","38326887":"Simulating Normalizing Constants: From Importance Sampling to Bridge Sampling to Path Sampling","267767940":"Non-conjugate Variational Message Passing for Multinomial and Binary Regression","227276601":"An Introduction to MCMC for Machine Learning","6243948":"Exploiting Nonlinear Recurrence and Fractal Scaling Properties for Voice Disorder Detection","2306327":"Annealed Importance Sampling","224881759":"The Variational Bayesian EM Algorithm for Incomplete Data : with Application to Scoring Graphical Model Structures","270663704":"Variational Bayesian Inference Techniques","23252767":"The Variational Gaussian Approximation Revisited","4993330":"Sequential Monte Carlo Samplers","263450188":"Annealed importance sampling. Statist"},"citedIn":{"288004530":"Composite Bayesian inference","274952527":"Variational sampling in a nutshell","289374273":"Variational sampling in a nutshell"},"index":312}