{"abs":"In this thesis we look at the fingerprinting problem. Our belief is that it is very difficult to prevent illegal copying, so our solution is to mark each copy uniquely so that if it is spread illegally, the original owner of that copy can be found. The principle is the same as for a serial number on a product. However a serial number is often easy to find and remove, therefore the serial number, that we call \"fingerprint\", has to be embedded in the information itself without causing any change to the product. We assume that the embedding of the fingerprint can be carried out and concentrate on the fingerprinting code. We have concentrated on four specific problems in this area. First we consider the fingerprinting code in the paper by Boneh and Shaw. This code has very long code words in practice, so we reduce the length for the inner code. The code is still very long. The area of communication has many similarities with the fingerprinting area. A large number of error correcting codes are linear and binary. We show why binary linear codes can not be used as fingerprinting codes. A specific structure on the fingerprinting code is a sorted code. The inner code in the code by Boneh and Shaw has this structure which is easy to analyse when the number of pirates is all but one. The pros and cons of a sorted code are looked into. i Today many of the fingerprinting codes are binary. We compare the binary codes to codes with k variants. ii Acknowledgements I want to thank my supervisor Professor Ingemar Ingemarsson for giving me inspiration and support. For inspire me to work with fingerprinting and giving me many ideas I thank Dr. Niclas Wiberg. I am also thankful to all my colleagues in the Informations Theory and Image Coding Groups. A special thanks to Jacob Lofven...","title":"Fingerprinting Digital Documents","id":2383546,"url":"https://www.researchgate.net/publication/2383546_Fingerprinting_Digital_Documents","names":["Tina Lindkvist"],"references":{"2378701":"On The Limits of Steganography"},"citedIn":{"4068111":"On gossip codes and traceability schemes","2864441":"Optimal Probabilistic Fingerprint Codes","3449334":"Fingerprinting relational databases: Schemes and specialties","242505639":"Information Hiding, 4th International Workshop, IHW 2001, Pittsburgh, PA, USA, April 25-27, 2001, Proceedings","220779228":"Lower Bounds for Collusion-Secure Fingerprinting","3080601":"A class of traceability codes","220722190":"Optimization and Evaluation of Randomized c-Secure CRT Code Defined on Polynomial Ring","41440561":"Encryption mechanisms for digital content distribution","220639258":"On a Class of Traceability Codes","220348590":"Gossip Codes for Fingerprinting: Construction, Erasure Analysis and Pirate Tracing.","220722122":"A Collusion-Secure Fingerprinting Code Reduced by Chinese Remaindering and Its Random-Error Resilience"},"index":313}