{"abs":"Exact approximations of Markov chain Monte Carlo (MCMC) algorithms are a general class of sampling algorithms particularly well suited to Bayesian inference in complex models or computations in statistical physics where some of the quantities involved are intractable. One of the main ideas behind exact approximations consists of replacing intractable quantities required to run standard algorithms, such as the target probability density in a Metropolis-Hastings algorithm, with estimators. In this paper we discover a general framework which allows one to compare, or order, performance measures of two such approximate implementations. We focus in particular on the mean acceptance probability, the first order autocorrelation coefficient, the so-called asymptotic variance and the right spectral gap. The key notion we identify as relevant to our purpose is that of the convex order between random variables, in our case two approximations of the aforementioned quantities required to implement standard algorithms. An important point is that we show that using the variance of such approximations as a means to compare performance is not sufficient whereas the convex order turns out to be natural and powerful. Indeed the literature concerned with the convex order is vast and we detail some examples of applications by identifying extremal distributions within given classes of approximations, showing that averaging replicas improves performance in a monotonic fashion and that stratification may improve performance--it is in fact that case in almost all situations for the standard implementation of the Approximate Bayesian Computation (ABC) MCMC method. We also point to other applications and future developments.","title":"Establishing some order amongst exact approximations of MCMCs","id":261952439,"url":"https://www.researchgate.net/publication/261952439_Establishing_some_order_amongst_exact_approximations_of_MCMCs","names":["Christophe Andrieu","Matti Vihola"],"references":{"263156975":"Annealed Importance Sampling Reversible Jump MCMC Algorithms","227522317":"Particle Markov Chain Monte Carlo . . .","38365762":"The Existence of Probability Measures with Given Marginals","10954538":"Approximate Bayesian Computation in Population Genetics","256419672":"On the use of bounds on stop-loss premium for an inventory management decision problem","225989992":"Nonlocal Monte Carlo algorithm for self-avoiding walks with fixed endpoints","45910632":"Constructing Summary Statistics for Approximate Bayesian Computation:\nSemi-automatic ABC","228359432":"An extension of Peskun and Tierney orderings to continuous time Markov chains","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","225668581":"Stochastic Comparisons of Symmetric Sampling Designs","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","231609430":"Convergence properties of pseudo-marginal Markov chain Monte Carlo\nalgorithms","38347152":"Generalized convex inequalities. Pac J Math","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","2179960":"The Penalty Method for Random Walks with Uncertain Energies","243776925":"Dependency of Risks and Stop-Loss Order","2574717":"Controlled MCMC for optimal sampling","264960784":"Comparison Methods for Stochastic Models and Risks","242983707":"Some inequalities for the square root of a positive definite matrix","267434129":"Extremal moment methods and stochastic orders. Application in actuarial science","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","45920534":"Stochastic comparisons of stratified sampling techniques for some Monte\nCarlo estimators","261369087":"Conditional convex orders and measurable martingale couplings","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","14140218":"Inferring Coalescence Times From DNA Sequence Data","220695944":"Inequalities: Majorization Theory and Its Applications","225081349":"Coupled MCMC with a randomized acceptance probability","38367102":"On the Distribution of the Number of Successes in Independent Trials","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","230690364":"Efficient MCMC for Climate Model Parameter Estimation: Parallel Adaptive Chains and Early Rejection","263018832":"Conditional convex orders and measurable martingale couplings","222289474":"Analytical best upper bounds on stop-loss premiums"},"citedIn":{"261914747":"A Pseudo-Marginal Perspective on the ABC Algorithm","264899565":"Optimal Scaling for the Pseudo-Marginal Random Walk Metropolis: Insensitivity to the Noise Generating Mechanism","276923083":"Sequential Bayesian inference for implicit hidden Markov models and current limitations","261369087":"Conditional convex orders and measurable martingale couplings","263018832":"Conditional convex orders and measurable martingale couplings"},"index":314}