{"abs":"Structural reliability analysis frequently requires the use of sampling-based methods, particularly for the situation where the failure domain in the random variable space is complex. One of the most efficient and widely utilized methods to use in such a situation is importance sampling. Recently, an adaptive importance sampling method was proposed to find a near-optimal importance sampling density by minimizing Kullback–Leibler cross entropy, i.e. a measure of the difference between the absolute best sampling density and the one being used for the importance sampling. In this paper, the adaptive importance sampling approach is further developed by incorporating a nonparametric multimodal probability density function model called the Gaussian mixture as the importance sampling density. This model is used to fit the complex shape of the absolute best sampling density functions including those with multiple important regions. An efficient procedure is developed to update the Gaussian mixture model toward a near-optimal density using a small size of pre-samples. The proposed method needs only a few steps to achieve a near-optimal sampling density, and shows significant improvement in efficiency and accuracy for a variety of component and system reliability problems. The method requires far less samples than both crude Monte Carlo simulation and the cross-entropy-based adaptive importance sampling method employing a unimodal density function; thus achieving relatively small values of the coefficient of variation efficiently. The computational efficiency and accuracy of the proposed method are not hampered by the probability level, dimension of random variable space, and curvatures of limit-state function. Moreover, the distribution model parameters of the Gaussian densities in the obtained near-optimal density help identify important areas in the random variable space and their relative importance.","title":"Cross-entropy-based adaptive importance sampling using Gaussian mixture","id":257007034,"url":"https://www.researchgate.net/publication/257007034_Cross-entropy-based_adaptive_importance_sampling_using_Gaussian_mixture","names":["Nolan Kurtz","Junho Song","Structural Safety"],"references":{"223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","245301372":"Basic Analysis of Structural Safety","221995544":"Bishop, C.M.: Pattern Recognition and Machine Learning. Springer","245211611":"Estimation of failure probabilities for intersections of non-linear limit states","251544505":"An adaptive directional importance sampling method for structural reliability","51888191":"Metamodel-based importance sampling for the simulation of rare events","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","223948726":"Local estimation of failure probability function and its confidence interval with maximum entropy principle","270435244":"Updating first- and second-order reliability estimates by importance sampling.","27348184":"Structural reliability using Finite Element Analysis - An appraisel of DARS: Directional Adaptive Response surface Sampling","257940484":"Structural Reliability Analysis, Prediction","202880300":"Simulation and The Monte Carlo Methods","251350663":"Bounds on System Reliability by Linear Programming","248560911":"Importance sampling in structural system","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{"282279891":"Simulation-Based Modelling of a Stochastic Equilibrium","265911736":"A Multiwavelet Neural Network-Based Response Surface Method for Structural Reliability Analysis","279070817":"MCMC algorithms for Subset Simulation","260914185":"Wavelet density-based adaptive importance sampling method","273481385":"Bayesian Updating with Structural Reliability Methods","286622131":"NEW METHODOLOGIES IN RELIABILITY-BASED DESIGN OPTIMIZATION FOR STRUCTURES","273486692":"Probabilistic spinning reserve adequacy evaluation for generating systems using an Markov chain Monte Carlo-integrated cross-entropy method","291013505":"Cross-entropy-based adaptive importance sampling using von Mises-Fisher mixture for high dimensional reliability analysis"},"index":315}