{"abs":"This paper deals with the problem of estimating the probability of failure of a system, in the challenging case where only an expensive-to-simulate model is available. In this context, the budget for simulations is usually severely limited and therefore classical Monte~Carlo methods ought to be avoided. We present a new strategy to address this problem, in the framework of sequential Bayesian planning. The method uses kriging to compute an approximation of the probability of failure, and selects the next simulation to be conducted so as to reduce the mean square error of estimation. By way of illustration, we estimate the probability of failure of a control strategy in the presence of uncertainty about the parameters of the plant.","title":"A sequential Bayesian algorithm to estimate a probability of failure","id":29609061,"url":"https://www.researchgate.net/publication/29609061_A_sequential_Bayesian_algorithm_to_estimate_a_probability_of_failure","names":["Emmanuel Vazquez","Julien Bect"],"references":{"222289965":"On Computation Methods for Structural Reliability Analysis","285820443":"Global optimization with nonparametric function fitting","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","222400676":"Optimal experimental design and some related control problems","3192490":"An Active Testing Model for Tracking Roads in Satellite Images","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","226435922":"A review of statistical models for global optimization","38363031":"Bayesian Experimental Design: A Review"},"citedIn":{"48907661":"Méthodes d\u0027interpolation à noyaux pour l\u0027approximation de fonctions type boîte noire coûteuses","44709664":"Évaluation d\u0027un risque d\u0027inondation fluviale par planification séquentielle d\u0027expériences","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","51890330":"Bounding rare event probabilities in computer experiments","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","266976696":"Evolving model architecture for custom output range exploration","266943935":"A survey of rare event simulation methods for static input-output models","279263090":"Kernel interpolation methods for estimating expensive black box functions","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","281262360":"An adaptive kriging method for solving nonlinear inverse statistical problems","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation"},"index":32}