{"abs":"We focus on the problem of estimating and quantifying uncertainties on the excursion set of a function under a limited evaluation budget. We adopt a Bayesian approach where the objective function is assumed to be a realization of a random field, typically assumed Gaussian. In this setting, the posterior distribution on the objective function gives rise to a poste-rior distribution of excursion sets. Several approaches exist to summarize the distribution of the excursion sets based on random closed set the-ory. While the recently proposed Vorob\u0027ev approach leads to analytically tractable expectations, further notions of variability require Monte Carlo estimators relying on Gaussian random field conditional simulations. In the present work we propose a method to choose simulation points and obtain realizations of the conditional field at fine designs through affine predictors. The points are chosen optimally in the sense that they mini-mize the expected distance in measure between the posterior excursion set and its reconstruction. The proposed method reduces the computational costs due to simulations and enables the prediction of realizations on fine designs even in large dimensions. We apply this reconstruction approach to obtain realizations of an excursion set on a fine grid which allow us to give a new measure of uncertainty based on the distance transform of the excursion set. Finally we present an application of the method where the distribution of the volume of excursion is estimated in a six-dimensional example.","title":"Quantifying uncertainties on excursion sets under a Gaussian random field prior","id":270905718,"url":"https://www.researchgate.net/publication/270905718_Quantifying_uncertainties_on_excursion_sets_under_a_Gaussian_random_field_prior","names":["Dario Azzimonti","Julien Bect","Clément Chevalier","David Ginsbourger"],"references":{"2933868":"Distance Transforms of Sampled Functions","266703842":"Geostatistical Simulation: Models and Algorithms","267109921":"Theory of Random Sets","38339780":"On excursion sets, tube formulas and maxima of random fields","2837734":"A Limited Memory Algorithm for Bound Constrained Optimization","252582913":"Using Statistical and Computer Models to Quantify Volcanic Hazards","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","221932969":"Statistics For Spatial Data","34019472":"Bayesian uncertainty analysis for complex computer codes.","226166306":"Averaging of Random Sets Based on Their Distance Functions","24163818":"Expectations of Random Sets and Their Boundaries Using Oriented Distance Functions","215992257":"Genetic Optimization Using Derivatives: The rgenoud Package for R","222679450":"Convergence properties of the expected improvement algorithm with fixed mean and covariance functions","270254975":"Statistics for Spatial Data (Revised)","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","51965361":"Set Reconstruction by Voronoi cells","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","38348900":"Sequential methods for design-adaptive estimation of discontinuities in regression curves and surfaces","226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","258229013":"Spatio-temporal exceedance locations and confidence regions","2132882":"Estimation of the volume of an excursion set of a Gaussian process using intrinsic Kriging","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","2463953":"Numerical Computation Of Multivariate Normal Probabilities","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","224840090":"Interpolation of Spatial Data: Some Theory For Kriging"},"citedIn":{},"index":320}