{"abs":"Bias in regression estimates resulting from the omission of a correlated relevant variable is a well known phenomenon. In this study, we apply a genetic algorithm to estimate the missing variable and, using that estimated variable, demonstrate that significant bias in regression estimates can be substantially corrected with relatively high confidence in effective models. Our interest is restricted to the case of a missing binary indicator variable and the analytical properties of bias and MSE dominance of the resulting dependent error generated vector process. These findings are compared to prior results for the independent error proxy process. Simulations are run for medium sample sizes and the method is shown to produce substantial reduction in estimation bias and often renders useful estimates of the missing vector. Limited simulations for the continuous variable case are reported and indicate some potential for the method and future research.","title":"Investigating Omitted Variable Bias In Regression Parameter Estimation: A Genetic Algorithm Approach","id":39728492,"url":"https://www.researchgate.net/publication/39728492_Investigating_Omitted_Variable_Bias_In_Regression_Parameter_Estimation_A_Genetic_Algorithm_Approach","names":["Lonnie Stevans","David N. Sessions","Computational Statistics \u0026 Data Analysis"],"references":{"201976488":"Uniform Crossover in Genetic Algorithms","243769669":"Test For Specification Errors in Classical Linear Least Squares Regression Analysis","261583986":"Regression Diagnostics","223156171":"MSE Dominance of least squares with errors of observation. J. Econom. 2:365-372","4894596":"Relative Asymptotic Bias from Errors of Omission and Measurement","33922250":"‘Tests for Specification Error in Classical Least Squares Regression Analysis’","261651191":"Residuals and Influence Regression","4894597":"A Note on the Use of Proxy Variables","258194162":"Measurment Error Models","51992811":"Econometric Analysis","242356870":"Adaptation In Natural And Artificial Systems","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","220045412":"Adoption in Natural and Artificial System","241722131":"Correcting for Omitted-Variables and Measurement-Error Bias in Regression with an Application to the Effect of Lead on IQ","241735892":"Residuals and Influence in Regression","238314088":"Sensitivity Analysis in Linear Regression","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"277960833":"Reducing errors-in-variables bias in linear regression using compact genetic algorithms","251346728":"Evolving Regression Models","225547492":"Evolutionary Computing in Statistical Data Analysis","258386867":"Solving the Omitted Variables Problem of Regression Analysis Using the Relative Vertical Position of Observations","222701249":"The fuzzy approach to statistical analysis","46527007":"Eliminating the omitted variable bias by a regime-switching approach","263980352":"THE DIMINISHING RETURNS TO ACCUMULATING FOREIGN RESERVES: IMPLICATIONS FOR CHINA, THE USA, AND THE WORLD","267062965":"Evolutionary statistical procedures. An evolutionary computation approach to statistical procedures designs and applications"},"index":324}