{"abs":"In this paper an extension of Weibull theory by the introduction of a statistical length scale is presented. The classical Weibull strength theory is self-similar; a feature that can be illustrated by the fact that the strength dependence on structural size is a power law (a straight line on a double logarithmic graph). Therefore, the theory predicts unlimited strength for extremely small structures. In the paper, it is shown that such a behavior is a direct implication of the assumption that structural elements have independent random strengths. By the introduction of statistical dependence in the form of spatial autocorrelation, the size dependent strength becomes bounded at the small size extreme. The local random strength is phenomenologically modeled as a random field with a certain autocorrelation function. In such a model, the autocorrelation length plays the role of a statistical length scale. The focus is on small failure probabilities and the related probabilistic distributions of the strength of composites. The theoretical part is followed by applications in fiber bundle models, chains of fiber bundle models and the stochastic finite element method in the context of quasibrittle failure.","title":"Incorporation of statistical length scale into Weibull strength theory for composites","id":248205629,"url":"https://www.researchgate.net/publication/248205629_Incorporation_of_statistical_length_scale_into_Weibull_strength_theory_for_composites","names":["Miroslav Vorechovsky","Composite Structures"],"references":{"227030731":"Statistical Length Scale in Weibull Strength Theory and Its Interaction with Other Scaling Lengths in Quasibrittle Failure","239060155":"The Statistical Theory of the Strength of Bundles of Threads. I","263112490":"Simulation of simply cross correlated random fields by series expansion methods","253136466":"Asymptotic Distributions for the Failure of Fibrous Materials Under Series-Parallel Structure and Equal Load-Sharing","266726816":"Limit Theorems and Approximations for the Reliability of Load-Sharing Systems","263112361":"Asymptotic Prediction of Energetic-Statistical Size Effect from Deterministic Finite Element Solutions","244445849":"Theory of Financial Risks: From Statistical Physics to Risk Management","265365913":"Lower Tail Analysis of the Distribution of the Strength of Load-Sharing Systems","38361793":"The Asymptotic Distribution of the Strength of a Series-Parallel System with Equal Load-Sharing","268613640":"The Asymptotic Strength Distribution of a General Fiber Bundle","222412684":"Simulation of simply cross correlated random fields by series expansion methods","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","249783341":"Statistical Theory for the Strength of Twisted Fiber Bundles with Applications to Yarns and Cables","228686510":"Stochastic modeling of multi-filament yarns: II. Random properties over the length and size effect","230663919":"Limiting Forms of the Frequency Distribution of the Largest or Smallest Member of a Sample","246233854":"Fracture and Size Effect in Concrete and Other Quasi-Brittle Materials","271513016":"Extremes and Related Properties of Random Sequences and Processes. Springer-Verlag Inc","37427297":"Fracture Size Effect in Concrete and Other Quasi-brittle Materials","223834764":"Activation Energy Based Extreme Value Statistics and Size Effect in Brittle and Quasibrittle Fracture","257940484":"Structural Reliability Analysis, Prediction","227983625":"Energetic-statistical size effect simulated by SFEM with stratified sampling and crack band mode","226635490":"Main Features of Designing With Brittle Materials","265484082":"Risk Analysis and the Acceptable Probability of Failure","225828439":"Monte Carlo Methods","223024364":"On The Strength of Classical Fibres and Fibre Bundles","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","215446267":"Monte Carlo Strategies in Scientic Computing","249785485":"Effect of Twist, Fineness, Loading Rate and Length on Tensile Behavior of Multifilament Yarns (A Multivariate Study)","200705604":"Mathematical Methods Of Statistics","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","216568156":"Relationship Between Fiber and Yarn Strength","229271836":"Interplay of size effects in concrete specimens under tension studied via computational stochastic fracture mechanics","223016316":"Comparison of the statistics of two fracture modes","264960498":"Sur la Distribution Limite du Terme Maximum d\u0027une Serie Aleatoire","245082337":"A Statistical Theory of the Strength of Materials IVA","265367402":"The Stochastic Finite Element Method: Basic Perturbation Technique and Computer Implementation","24059987":"Extremes and related properties of random sequences and processes"},"citedIn":{"254112423":"Identification of the effective bundle length in a multifilament yarn from the size effect response","230765579":"Influence of experimental setups on the apparent uniaxial tensile load-bearing capacity of Textile Reinforced Concrete specimens","263112533":"Identification of the filament stress transfer length in multifilament yarns using fiber bundle model and chain-of-bundles model","232401761":"Study of strength and its reliability of SiC fiber bundle by experimental and Monte-Carlo simulation approach","257095151":"A statistical failure initiation model for honeycomb materials"},"index":325}