{"abs":"Computer experiments are often performed to allow modeling of a response surface of a physical experi-ment that can be too costly or difficult to run except using a simulator. Running the experiment over a dense grid can be prohibitively expensive, yet running over a sparse design chosen in advance can result in obtaining insufficient information in parts of the space, particularly when the surface is nonstation-ary. We propose an approach which automatically explores the space while simultaneously fitting the response surface, using predictive uncertainty to guide subsequent experimental runs. The newly devel-oped Bayesian treed Gaussian process is used as the surrogate model, and a fully Bayesian approach allows explicit nonstationary measures of uncertainty. Our adaptive sequential design framework has been developed to cope with an asynchronous, random, agent-based supercomputing environment. We take a hybrid approach which melds optimal strategies from the statistics literature with flexible strate-gies from the active learning literature. The merits of this approach are borne out in several examples, including the motivating example of a computational fluid dynamics simulation of rocket booster. Key words: nonstationary spatial model, treed partitioning, sequential design, active learning 1","title":"Adaptive design of supercomputer experiments","id":277293681,"url":"https://www.researchgate.net/publication/277293681_Adaptive_design_of_supercomputer_experiments","names":["Robert B. Gramacy","Herbert K. H. Lee"],"references":{"265427282":"Bayesian design and analysis of computer experiments: Two examples","227925526":"Bayesian estimation of semi-parametric non-stationary spatial covariance structure","2609572":"Monte Carlo Implementation of Gaussian Process Models for Bayesian Regression and Classification","2927976":"Nonstationary Gaussian Processes For Regression And Spatial Modelling","4771982":"Maximum Entropy Sampling and Optimal Bayesian Experimental Design","2852195":"A New Class of Nonstationary Spatial Models","228734954":"Boundary Analysis: Significance and Construction of Curvilinear Boundaries","230872587":"Experimental Design and Observation for Large Systems","234102591":"An Algorithm for the Construction of “D-Optimal” Experimental Designs","4747012":"Optimal Bayesian Design by Inhomogeneous Markov Chain Simulation","246930297":"Neural network exploration using optimal experiment","34954629":"Bayesian Treed Gaussian Process Models","225513703":"Sequential kriging optimization using multiple-fidelity evaluations","241063113":"A Bayesian coregionalization approach to multivariate pollutant data","280757799":"Bayesian CART model search","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","2450683":"Bayesian CART model search","38363031":"Bayesian Experimental Design: A Review","2455557":"Information--Based Objective Functions for Active Data Selection","216301381":"The Design and Analysis Computer Experiments","243637348":"Nonparametric Estimation of Nonstationary Spatial Covariance Structure","2952332":"Parameter space exploration with Gaussian process trees","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","220344008":"Queries and Concept Learning","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","31303344":"Predicting the Output from a Complex Computer Code When Fast Approximations Are Available","216300362":"Statistics For Experimenters","228864523":"Integrated Analysis of Computer and Physical Experiments","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","2817500":"Non-Stationary Spatial Modeling","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","216301661":"Screening, Predicting, and Computer Experiments","243655672":"A Bayesian CART algorithm","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","220907156":"Gaussian Processes for Active Data Mining of Spatial Aggregates.","4772151":"Bayesian inference for non-stationary spatial covariance structure via spatial deformations","246781322":"Matrix Methods for Engineers and Scientists"},"citedIn":{"277293381":"tgp v1.2: an R package for Bayesian nonstationary, semiparametric nonlinear regression and design . . ."},"index":326}