{"abs":"The genetic algorithm (GA), a very powerful tool used in optimization, has been applied in various fields including statistics. However, the general GA is usually com- putationally intensive, often having to perform a large number of evaluations of an objective function. This paper presents four different versions of computationally effi- cient genetic algorithms by incorporating several different local directional searches into the GA process. These local searches are based on using the method of steepest descent (SD), the Newton-Raphson method (NR), a derivative-free directional search method (denoted by \"DFDS\"), and a method that combines SD with DFDS. Some benchmark functions, such as a low-dimensional function versus a high-dimensional function, and a relatively bumpy function versus a very bumpy function, are employed to illustrate the improvement of these proposed methods through a Monte Carlo simulation study using a split-plot design. A real problem related to the multi-response optimization problem is also used to illustrate the improvement of these proposed methods over the traditional GA and over the method implemented in the Design-Expert statistical software package. Our results show that the GA can be improved both in accuracy and in computational efficiency in most cases by incorporating a l ocal directional search into the GA process.","title":"An Improved Genetic Algorithm Using a Directional Search","id":242128307,"url":"https://www.researchgate.net/publication/242128307_An_Improved_Genetic_Algorithm_Using_a_Directional_Search","names":["WEN WAN","Jeffrey Birch"],"references":{"221469793":"An Improved Genetic Algorithm Performance with Benchmark Functions.","247219369":"Practical Genetic Algorithms John Wiley and Sons","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","3418509":"Macready, W.G.: No Free Lunch Theorems for Optimization. IEEE Transactions on Evolutionary Computation 1(1), 67-82","243665386":"Genetic Algorithms in Searching","222331052":"Robust parameter setting of evolutionary algorithms for the optimization of agricultural system models","236538196":"Genetic algorithms for the construction of D-optimal designs"},"citedIn":{"220385470":"A Semiparametric Technique for the Multi-Response Optimization Problem"},"index":331}