{"abs":"Assessing the reliability of complex technological systems such as communication networks, transportation grids, and bridge networks is a dicult task. From a mathematical point of view, the problem of estimating network reliability belongs to the #P complexity class. As a consequence, no analytical solution for solving this problem in a reasonable time is known to exist and one has to rely on dierent approximation techniques. In this paper we focus on a well-known Sequential Monte Carlo algorithm Lomonosov\u0027s turnip method. Despite the fact that this method was shown to be ecient under some mild conditions, it is known to be inadequate for stable estimation of network reliability in a rare-event setting. To overcome this obstacle, we suggest a quite general combination of Sequential Monte Carlo and multi-level splitting. The proposed method is shown to bring a signicant variance reduction as compared to the turnip algorithm, is easy to implement and parallelize, and has a proven performance guarantee for some network ty-pologies. (Radislav Vaisman), kroese@maths.uq.edu.au (Dirk P. Kroese), elyager@bezeqint.net (Ilya B. Gertsbakh) 1","title":"Splitting Sequential Monte Carlo for Ecient Unreliability Estimation of Highly Reliable Networks","id":275535124,"url":"https://www.researchgate.net/publication/275535124_Splitting_Sequential_Monte_Carlo_for_Ecient_Unreliability_Estimation_of_Highly_Reliable_Networks","names":["Radislav Vaisman","Dirk P Kroese","Ilya B. Gertsbakh"],"references":{"245078110":"Safety of maritime transportation","267129765":"Models of Network Reliability: Analysis, Combinatorics and Monte Carlo","50996224":"Handbook of Monte Carlo Methods","269230784":"Modeling and Estimating Small Unreliabilities for Static Networks with Dependent Components","242386046":"Estimation of Particle Transmission by Random Sampling","3151713":"Estimation of network reliability using graph evolution models","269878849":"The Mathematical Theory of Reliability","224583806":"On Closure of the IFR Class Under Formation of Coherent Systems","224231101":"Approximate Zero-Variance Importance Sampling for Static Network Reliability Estimation","228057717":"An Introduction to Probability Theory and Its Applications II","257007029":"Confidence intervals for reliability indices using likelihood ratio statistics","210222819":"Simulation and the Monte Carlo Method","223030637":"Reliability engineering: old problems and new challenges. Reliab Eng Syst Saf","228057585":"A Randomized Fully Polynomial Time Approximation Scheme for the All-Terminal Network Reliability Problem","215446267":"Monte Carlo Strategies in Scientic Computing","41035459":"The splitting method in rare event simulation","228768913":"Static Network Reliability Estimation Via Generalized Splitting","4354999":"Monte-Carlo algorithms for enumeration and reliability problems","3863119":"Splitting for rare event simulation: Analysis of simple cases","222918463":"Simulation-based seismic loss estimation of seaport transportation system","220618207":"Valiant, L.G.: The complexity of enumeration and reliability problems. SIAM J. Comput. 8, 410-421","245079457":"Tracing the unreliability and recognizing the major unreliability contribution of network components","271602574":"A Review of Probabilistic Methods of Assessment of Load Effects in Bridges","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","262265054":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms"},"citedIn":{},"index":333}