{"abs":"The state-of-the-art of reliability computation methods for structural engineering is outlined and evaluated. Emphasis is given to random variable reliability models. Also random process and random field reliability models are considered. Applications of the computational methods within structural systems are discussed, and some research needs are identified.","title":"On Computation Methods for Structural Reliability Analysis","id":222289965,"url":"https://www.researchgate.net/publication/222289965_On_Computation_Methods_for_Structural_Reliability_Analysis","names":["Peter Bjerager","Structural Safety"],"references":{"245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","256421833":"Probability of failure of brittle redundant structural systems in time","245301466":"Fatigue Reliability of Parallel Member Systems","275188769":"Parametric Sensitivity in First Order Reliability Theory","245310297":"Sensitivity and Importance Measures in Structural Reliability","245284436":"Approximate Methods for Nonlinear Time-Variant Reliability Analysis","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","245284816":"Plastic Reliability Analysis By Directional Simulation","245302352":"Measures of Structural Safety Under Imperfect States of Knowledge","284384673":"Efficient methods in time dependent reliability","222035565":"Method of structural systems reliability","245302025":"Sensitivity of Reliability-Based Optimum Design","245283845":"Gaussian Outcrossings from Safe Convex Polyhedrons","238470376":"Plastic systems reliability by LP and FORM","275188793":"Asymptotic Approximations for Multinormal Integrals","284237487":"EFFICIENT AND ACCURATE PROBABILITY OF FAILURE CALCULATION BY USE OF THE IMPORTANCE SAMPLING TECHNIQUE.","226994279":"Three digit accurate multiple normal probabilities","245211326":"Omission Sensitivity Factors","245301372":"Basic Analysis of Structural Safety","273800443":"Second‐Order Reliability Approximations","222310512":"Random fields and stochastic finite elements","222779702":"Directional simulation in Gaussian processes","279700185":"Finite element reliability method with improved efficiency by sensitivity analysis","273800355":"Probability Integration by Directional Simulation","284498439":"Methods to estimate parametric sensitivity in structural reliability analysis","285353462":"Reliability method for marine structures under multiple environmental load processes","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","239373106":"Comments on: Henrik O. Madsen, omission sensitivity factors","222790897":"On fast integration for time variant structural reliabiity","222013260":"An efficient numerical solution to the multinormal integral","245185831":"Asymptotic crossing rate of Gaussian vector processes into intersections of failure domains","222945716":"Optimization algorithms for structural reliability"},"citedIn":{"228814883":"Probabilistic Transformation Method in Reliability Analysis","223724119":"Reliability-based shape optimization of structures undergoing fluid–structure interaction phenomena","245305629":"Probabilistic PushOver Analysis of Structural and Soil-Structure Systems","273079236":"Simple Approaches for Efficiently Reliability-based Design Optimization of Bridges","245041439":"Multicriterion reliability-oriented optimization of structural systems by stochastic programming","268469892":"Statistical trend analysis of River Rhine and Meuse discharges","11462824":"Use of the most likely failure point method for risk estimation and risk uncertainty analysis","222868929":"On Latin Hypercube Sampling for structural reliability analysis","248607832":"A Simplified, Semi-analytical Method to Handle Uncertainty in Long-term Containment in Geologic CO 2 Storage Sites","223772124":"Reliability of long span bridges based on design experience with the Honshu–Shikoku bridges","257431892":"Uncertainty quantification of contaminant transport and risk assessment with conditional stochastic collocation method","227705503":"On the Performance of Computational Methods for the Assessment of Risk from Ground‐Water Contamination","229722684":"Probabilistic high cycle fatigue behaviour of nodular cast iron containing casting defects","229280698":"An engineering predictive design approach of high cycle fatigue reliability of shot peened metallic parts","251600367":"Structure dynamic reliability: A hybrid approach and robust meta-models","265551299":"Line Sampling for Assessing Structural Reliability with Imprecise Failure Probabilities","224073288":"Complement activation and SEM studies of membrane oxygenators","264550994":"Line Sampling for Assessing Structural Reliability with Imprecise Failure Probabilities","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","251203555":"Plastic Buckling of Rectangular Plates with Random Material Properties and Random Loading: A Demonstration of Probabilistic Structural Analysis","222798812":"Linear regression estimators for multinormal distributions in optimization of stochastic programming problems","222776539":"First-order third-moment reliability method","245302657":"Reliability of Wood Structural Systems","225120628":"Rock Wedge Stability Analysis Using System Reliability Methods","239391462":"Modeling Pavement Fragility","235799213":"Computational uncertainties of ship hull girder reliability modelling","220373382":"Reliability-Based Optimization Models for Scheduling Pavement Rehabilitation","223810417":"System reliability approach to rock slope stability","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","264174104":"System Reliability-Based Design Optimization Using Performance Measure Approach","277684138":"Reliability Assessment of High-Strength Concrete Columns","37255057":"The importance of lower-bound capacities in geotechnical reliability assessments","279353868":"Probabilistic Fatigue Analysis","251575124":"Probabilistic safety assessment of components","33994541":"Optimal design of electrostatically actuated microsystems /","266893510":"ZJEDNODUŠENÁ APLIKÁCIA SORM PRI NIEKTORÝCH NELINEÁRNYCH PROBLÉMOCH KOŠTRUKCIÍ","229650048":"First‐Order Reliability Analysis of Public Health Risk Assessment","262003246":"Application of Probabilistic Methods to the Structural Integrity Analysis of RBMK Reactor Circuit Structures","239391351":"Applying Method of Moments to Model Reliability of Pavements Infrastructure","271578010":"Reliability-based analysis and design optimization of electrostatically actuated MEMS","245303592":"Reliability of Transmission Structures Including Nonlinear Effects","283764176":"Strategies for finding the design point under bounded random variables","266405208":"Approximations and Derivatives of Probability Functions","282676576":"Investigation on the stability of a top-tensioned riser in irregular waves","245299618":"Probabilistic Screening Tool for Ground-Water Contamination Assessment","232343833":"Reliability analysis of nondeterministic steel beam-columns","223207565":"Structural reliability methods for seismic safety assessment: A review","258683434":"Robustness of structural reliability analyses to epistemic uncertainties","221909113":"Structural Integrity Analysis of the RBMK Reactor Critical Structures Applying Probabilistic Methods","3058925":"Direct Computation of Statistical Variations in Electromagnetic Problems","233090593":"Probabilities of simple n -dimensional sets for the normal distribution","248808092":"Reliability analysis of contaminant transport in saturated porous media. Water Resour Res","220462441":"Subroutines for Computing Normal Probabilities of Sets - Computer Experiences","238189950":"Reliability Improvement of a Solid Rocket Motor in Early Design Phases","284900779":"An island particle algorithm for rare event analysis","258160818":"Probabilistic assessment of parametric instability of a top tensioned riser in irregular waves","225870501":"Metamodel approach for reliability-based design optimization of a steel catenary riser","223705857":"System reliability of suspension bridges","266943935":"A survey of rare event simulation methods for static input-output models","222607891":"Reliability-based condition assessment and LRFD for existing structures","222062055":"Stochastic modeling and risk analysis of groundwater pollution using FORM coupled with automatic differentiation","2846071":"Uncertainty Propagation in an Integrated Land Use-Transportation Modeling Framework: Output Variation via UrbanSim","223225107":"Survey of reliability and availability evaluation of complex networks using Monte Carlo techniques","251083414":"A robust iterative algorithm for structural reliability analysis","257014197":"A model for reliability and confidence level in fatigue statistical calculation","229649238":"Safety assessment of structures in nuclear facilities: application of probabilistic methods","3152470":"A load-capacity interference model for common-mode failures in 1-out-of-2: G systems","227160035":"Approximation and derivatives of probabilities of survival in Structural design","3868754":"Advanced diagnostics and prognostics for gas turbine engine risk assessment","227793913":"Probabilistic prediction of high cycle fatigue reliability of high strength steel butt‐welded joints","276301714":"FULLY PROBABILISTIC DUNE SAFETY ASSESSMENT USING AN ADVANCED PROBABILISTIC METHOD","250695962":"Probability of failure of structures without a closed-form failure function","277877115":"Primary and deformation-induced high and low cycle fatigue reliability of infrastructure with updating through non-destructive inspection.","50998886":"Protein Shape Change Has a Major Effect on the Gating Energy of a Mechanosensitive Channel","271292103":"Non-Gradient–Based Algorithm for Structural Reliability Analysis","49847573":"Cytological, Immunohistochemical and Mutational Analysis of a Gastric Gastrointestinal Stromal Tumour in a Cat","232951308":"Reliability-based optimisation design of post-tensioned concrete box girder bridges considering pitting corrosion attack","282676663":"Intercepting tail importance sampling method of structural reliability based on cauchy-inequality","264551221":"9780784413609.093 linesamplling","269076474":"Advanced Line Sampling for efficient robust reliability analysis","232823699":"Integrated probabilistic analysis of nuclear power plant building damage due to an aircraft crash","222279244":"Probability-based codified design: Past accomplishments and future challenges","232382506":"Stochastic resistance of square plate under uniaxial compression","232890773":"Effects of overlay designs on reliability of flexible pavements","250696972":"Life-cycle reliability-based optimization of civil and aerospace structures. Comput Struct","222397758":"Reliability-based analysis and design of electrostatically actuated MEMS. Comput Struct","268809978":"Importance sampling for efficient modelling of hydraulic loads in the Rhine–Meuse delta"},"index":342}