{"abs":". SATLIB is an online resource for SAT-related research established in June 1998. Its core components, a benchmark suite of SAT instances and a collection of SAT solvers, aim to facilitate empirical research on SAT by providing a uniform test-bed for SAT solvers along with freely available implementations of high-performing SAT algorithms. In this article, we give an overview of SATLIB; in particular, we describe its current set of benchmark problems. Currently, the main SATLIB web site (http://www.informatik.tu-darmstadt.de/AI/SATLIB) and its North American mirror site (http://www.cs.ubc.ca/hoos/SATLIB) are being accessed frequently by a growing number of researchers, resulting in access rates of about 250 hits per month. To further increase the usefulness of SATLIB as a resource, we encourage all members of the community to utilise it for their SAT-related research and to improve it by submitting new benchmark problems, SAT solvers, and bibliography entries. Keywords: SAT, Benchmark...","title":"SATLIB: An Online Resource for Research on SAT","id":2613528,"url":"https://www.researchgate.net/publication/2613528_SATLIB_An_Online_Resource_for_Research_on_SAT","names":["Holger H Hoos","Thomas Sttzle"],"references":{"226030648":"SATO: An efficient prepositional prover","239059839":"Stochastic Local Search-Methods","238123956":"What is a CAVE TM","2949163":"Morphing: Combining Structure and Randomness","2366370":"Why Adding More Constraints Makes a Problem Easier for Hill-climbing Algorithms: Analyzing Landscapes of CSPs","222351437":"Refining the phase transition in combinatorial search","225126180":"Look-ahead versus look-back for satisfiability problems","2369963":"Stochastic Local Search Methods for Dynamic SAT - an Initial Investigation","2637561":"Noise Strategies for Improving Local Search","3044093":"GRASP: A search algorithm for propositional satisfiability. IEEE Trans. Comput. 48(5), 506-521","2901560":"Boosting Combinatorial Search Through Randomization","2769087":"Hard and Easy Distributions of SAT Problems","243677534":"Critical behavior in the satis ability of random Boolean expressions","213887971":"A Machine Program for Theorem-proving","2416506":"Using CSP look-back techniques to solve real-world SAT instances","2375621":"On the Run-time Behaviour of Stochastic Local Search Algorithms for SAT","216300800":"Needed: An Empirical Science of Algorithms","2778126":"Initial Experiments in Stochastic Satisfiability","225782608":"Testing Heuristics: We Have It All Wrong. Journal of Heuristics 1(1): 33-42","220546636":"Towards a Characterisation of the Behaviour of Stochastic Local Search Algorithms for SAT.","2821447":"Towards an Understanding of Hill-climbing Procedures for SAT","2619914":"Improvements To Propositional Satisfiability Search Algorithms","6059378":"Critical Behavior in the Satisfiability of Random Boolean Expressions","220814617":"A comparison of ATMS and CSP techniques","2471954":"Pushing the Envelope: Planning, Propositional Logic, and Stochastic Search","2922196":"Encoding Plans in Propositional Logic"},"citedIn":{"221547326":"ANDYMARK: An Analytical Method to Establish Dynamically the Length of the Markov Chain in Simulated Annealing for the Satisfiability Problem","257628753":"Dealing with hardware heterogeneity: A new parallel search model","279175086":"An Open Challenge Problem Repository for Systems Supporting Binders","2936124":"An Adaptive Noise Mechanism for WalkSAT","220543286":"How the Landscape of Random Job Shop Scheduling Instances Depends on the Ratio of Jobs to Machines","220543281":"The Language of Search.","221603106":"Using More Reasoning to Improve #SAT Solving.","251410402":"The ALCN description logic concept satisfiability as a SAT problem","4143904":"CNF formula simplification using implication reasoning","224301633":"Optimization problem solving framework employing GAs with linkage identification over a Grid environment","221627157":"Solving the Minimum-Cost Satisfiability Problem Using SAT Based Branch-and-Bound Search","225568083":"An Adaptive Metaheuristic for the Simultaneous Resolution of a Set of Instances","237280519":"Low›latency SAT Solving on Multicore Processors with Priority Scheduling and XOR Partitioning","220642560":"On SAT Instance Classes and a Method for Reliable Performance Experiments with SAT Solvers","226615719":"Analyzing the k Most Probable Solutions in EDAs Based on Bayesian Networks","237410316":"Preprocessing Fitness Functions","220944385":"NiVER: Non-increasing Variable Elimination Resolution for Preprocessing SAT Instances","4090130":"Tournament versus fitness uniform selection","265438718":"The TPTP problem library and associated infrastructure : ttthe FOF and CNF Parts, v3.5.0","228884363":"March cluster: Improving The Performance Of Lookahead Solvers On SAT Problems With A Large Diameter","221604103":"Studies in Solution Sampling","238004249":"Approximate Solution Sampling ( and Counting) on AND/OR search space","220742161":"Solving the MAXSAT problem using a multivariate EDA based on Markov networks","221606415":"Generating \u0027Random\u0027 3-SAT Instances with Specific Solution Space Structure.","237842199":"Parallelizing DPLL in Haskell","24192847":"Reasoning as simulation. Cognit Process","43294420":"Stoch-DisPeL: exploiting randomisation in DisPeL.","222298370":"Integrating a SAT solver with an LCF-style theorem prover. Electr Notes Theor Comput Sci","242573366":"An Online Repository of Mathematical Samples","221633392":"Watched Literals for Constraint Propagation in Minion","35458645":"Augmenting local search for satisfiability [microform].","220812385":"DPLL with a trace: From SAT to knowledge compilation","261439709":"A Denoising Autoencoder that Guides Stochastic Search","250872766":"Preface to the Special Volume on the SAT 2005 Competitions and Evaluations","220944484":"A New Approach to Model Counting","225218366":"The Interaction Between Inference and Branching Heuristics","272483694":"Exotic Semiring Constraints","221432678":"A Local Search Algorithm for a SAT Representation of Scheduling Problems","220944508":"Using DPLL for efficient OBDD construction","224166667":"3-SAT on CUDA: Towards a massively parallel SAT solver","2370936":"SatEx: Towards an Exhaustive and Up-to-Date SAT Experimentation","220805961":"System Description: GrAnDe 1.0.","250788246":"Backdoors in Planning and Scheduling Problems","225860893":"Formal Verification Techniques Based on Boolean Satisfiability Problem","2827352":"Relaxations of the Satisfiability Problem Using Semidefinite Programming","221007967":"Optimization of parallel Genetic Algorithms for nVidia GPUs","49466251":"Hybrid of genetic algorithm and local search to solve MAX-SAT problem using nVidia CUDA framework","236235368":"Local Backbones","221278541":"A Pearl on SAT Solving in Prolog","220176482":"Solving multiple instances at once: The role of search and adaptation","2565030":"Scaling and Probabilistic Smoothing: Efficient Dynamic Local Search for SAT","1958047":"Fitness Uniform Deletion: A Simple Way to Preserve Diversity","220944553":"Branch and Bound for Boolean Optimization and the Generation of Optimality Certificates","220532141":"A Framework for Certified Boolean Branch-and-Bound Optimization","227039492":"Accelerating Branch-and-Bound through a Modeling Language Construct for Relaxation-Specific Constraints","221632952":"Approximate Solution Sampling ( and Counting) on AND/OR spaces","221448614":"PaMira - A parallel SAT solver with knowledge sharing","250802020":"Combining a Unit Propagation with Genetic Algorithms to Solve max-SAT Problems","4301015":"Solving Coarse-grained DisCSPs with Multi-DisPeL and DisBO-wd","228371211":"NSPLib–A nurse scheduling problem library: a tool to evaluate (meta-) heuristic procedures","265521742":"A HyFlex Module for the MAX-SAT Problem","220951944":"A Heterogeneous Lightweight Multithreaded Architecture","1957049":"Tournament versus Fitness Uniform Selection","225781715":"Algorithm Selection as a Bandit Problem with Unbounded Losses","220944515":"Backdoors in the Context of Learning","228797450":"Incorporating nontechnical attributes in multi-attribute analysis for security","2601098":"The Role of a Skeptic Agent in Testing and Benchmarking of SAT Algorithms","262425865":"On the usefulness of linkage processing for solving MAX-SAT","221186177":"Tradeoffs in Backdoors: Inconsistency Detection, Dynamic Simplification, and Preprocessing","221633178":"Computing the Density of States of Boolean Formulas","220706708":"A New Reduction from 3SAT to n-Partite Graphs","221442438":"On the Quality and Quantity of Random Decisions in Stochastic Local Search for SAT","224292840":"Gaussian Versus Cauchy Membership Functions in Fuzzy PSO","30512998":"Analyse statique : de la théorie à la pratique ; analyse statique de code embarqué de grande taille, génération de domaines abstraits","242283720":"The Many Roads Leading to Rome: Solving Zinc Models by Various Solvers ModRef’08","238719619":"Mathematical Knowledge Management, 5th International Conference, MKM 2006, Wokingham, UK, August 11-12, 2006, Proceedings","2536860":"UnitWalk: A New SAT Solver that Uses Local Search Guided by Unit Clause Elimination","2932369":"Complete Local Search for Propositional Satisfiability","4153217":"MUP: A minimal unsatisfiability prover","221006995":"Benchmark multi-objective optimisation test problems with mixed encodings","2930409":"Warped Landscapes and Random Acts of SAT Solving","233680171":"The ILTP Problem Library for Intuitionistic Logic: Release v1.1","221442019":"Finding Small Backdoors in SAT Instances","220944377":"Constraint Metrics for Local Search.","202051295":"Impact of Censored Sampling on the Performance of Restart Strategies","221432038":"A Framework of GRID Problem-Solving Environment Employing Robust Evolutionary Search","225263543":"On Threshold BDDs and the Optimal Variable Ordering Problem","221633512":"Automatic Generation of Implied Clauses for SAT.","221633259":"A New Empirical Study of Weak Backdoors","2390212":"Automatic Generation of Implied Clauses for SAT","4369059":"Asynchronous team algorithms for Boolean Satisfiability","47863864":"BDDs in a Branch and Cut Framework","4089558":"How many solutions does a SAT instance have?","228353141":"A high performance CHR∨ execution engine","43652213":"Rodin: An Open Toolset for Modelling and Reasoning in Event-B","221116893":"Prolog Cafe: A Prolog to Java Translator System","51797222":"Using Previous Models to Bias Structural Learning in the Hierarchical BOA","4114636":"Toward good elimination orders for symbolic SAT solving","220163308":"tts: A SAT-Solver for Small, Difficult Instances.","220532444":"A Parallelization Scheme Based on Work Stealing for a Class of SAT Solvers","4114628":"Guiding real-world SAT solving with dynamic hypergraph separator decomposition","221131474":"Efficient and Experimental Meta-heuristics for MAX-SAT Problems","220286431":"Efficient Monte Carlo simulation via the generalized splitting method"},"index":344}