{"abs":"The lasso (Tibshirani, 1996) is an essential tool in modern high-dimensional regression and variable selection. The Bayesian lasso of Park and Casella (2008) interprets the lasso objective function as a posterior under a Laplace prior and proposes a three-step Gibbs sampler to sample from this posterior. The Bayesian lasso yields a natural approach to quantifying the uncertainty of lasso estimates. Furthermore, the Gibbs sampler for the Bayesian lasso has been shown to be geometrically ergodic (Khare and Hobert, 2013). The geometric rate constant of this Markov chain, however, tends to 1 if the number of regression coefficients grows faster than the sample size (Rajaratnam and Sparks, 2015). Thus, convergence of the Bayesian lasso Gibbs sampler can still be quite slow in modern high-dimensional settings despite the apparent theoretical safeguard of geometric ergodicity. In order to address this challenge, we propose a new method to draw from the same posterior via a tractable two-step blocked Gibbs sampler, which we call the fast Bayesian lasso. We provide a theoretical underpinning to the new method by proving rigorously that the fast Bayesian lasso is geometrically ergodic. We then demonstrate numerically that this blocked sampler exhibits vastly superior convergence behavior in high-dimensional regimes.","title":"Fast Bayesian Lasso for High-Dimensional Regression","id":281808410,"url":"https://www.researchgate.net/publication/281808410_Fast_Bayesian_Lasso_for_High-Dimensional_Regression","names":["Bala Rajaratnam","Doug Sparks"],"references":{"278939552":"Minorization conditions and convergence rate for Markov chain Monte Carlo","228619969":"Penalized Regression, Standard Errors, and Bayesian Lassos","243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","280773373":"MCMC-Based Inference in the Era of Big Data: A Fundamental Analysis of the Convergence Complexity of High-Dimensional Chains","227375784":"Regression shrinkage selection via the LASSO","38326862":"Honest Exploration of Intractable Probability Distributions Via Markov Chain Monte Carlo","258232111":"Geometric ergodicity of the Bayesian lasso"},"citedIn":{},"index":347}