{"abs":"We present an enhanced version of the splitting method, called the smoothed splitting method (SSM), for counting associated with complex sets, such as the set defined by the constraints of an integer program and in particular for counting the number of satisfiability assignments. Like the conventional splitting algorithms, ours uses a sequential sampling plan to decompose a “difficult” problem into a sequence of “easy” ones. The main difference between SSM and splitting is that it works with an auxiliary sequence of continuous sets instead of the original discrete ones. The rationale of doing so is that continuous sets are easier to handle. We show that while the proposed method and its standard splitting counterpart are similar in their CPU time and variability, the former is more robust and more flexible than the latter.","title":"On the Use of Smoothing to Improve the Performance of the Splitting Method","id":233065791,"url":"https://www.researchgate.net/publication/233065791_On_the_Use_of_Smoothing_to_Improve_the_Performance_of_the_Splitting_Method","names":["Frédéric Cérou","Arnaud Guyader","Reuven Rubinstein","Radislav Vaisman","Stochastic Models"],"references":{"200110894":"Probability and Computing : Randomized Algorithms and Probabilistic Analysis","242382129":"Randomized Algorithms A short course on randomized algorithms and the probabilistic method","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","210222819":"Simulation and the Monte Carlo Method","228057840":"Randomized Algorithms","221669789":"Probability and Computing: Randomized Algorithms and Probabilistic Analysis","226031060":"Sequential Monte Carlo for rare event estimation","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","224817353":"Asymptotic Statistics","226592753":"The Gibbs Cloner for Combinatorial Optimization, Counting and Sampling","41035459":"The splitting method in rare event simulation","231959777":"Sequential Monte Carlo","29596955":"Genetic Genealogical Models in Rare Event Analysis","225130001":"Randomized Algorithms with Splitting: Why the Classic Randomized Algorithms Do Not Work and How to Make them Work","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","221525992":"On the Efficiency of the Splitting and Roulette Approach for Sensitivity Analysis.","243104929":"A Two-Step branching splitting model under cost constraint for rare event analysis","220136450":"Rare events, splitting, and quasi-Monte Carlo","220286431":"Efficient Monte Carlo simulation via the generalized splitting method"},"citedIn":{"233996210":"On the Concentration Properties of Interacting Particle Processes","284750937":"Rare event simulation and spliting for discontinuous random variables","51915982":"On the Concentration Properties of Interacting Particle Processes","279808481":"Rare Event Simulation and Splitting for Discontinuous Random Variables"},"index":349}