{"abs":"The estimation of small probabilities of failure from computer simulations is a classical problem in engineering, and the Subset Simulation algorithm proposed by Au \u0026 Beck (Prob. Eng. Mech., 2001) has become one of the most popular method to solve it. Subset simulation has been shown to provide significant savings in the number of simulations to achieve a given accuracy of estimation, with respect to many other Monte Carlo approaches. The number of simulations remains still quite high however, and this method can be impractical for applications where an expensive-to-evaluate computer model is involved. We propose a new algorithm, called Bayesian Subset Simulation, that takes the best from the Subset Simulation algorithm and from sequential Bayesian methods based on kriging (also known as Gaussian process modeling). The performance of this new algorithm is illustrated using a test case from the literature. We are able to report promising results. In addition, we provide a numerical study of the statistical properties of the estimator.","title":"Bayesian Subset Simulation: a kriging-based subset simulation algorithmfor the estimation of small probabilities of failure","id":228445426,"url":"https://www.researchgate.net/publication/228445426_Bayesian_Subset_Simulation_a_kriging-based_subset_simulation_algorithmfor_the_estimation_of_small_probabilities_of_failure","names":["Ling Li","Julien Bect","Emmanuel Vazquez"],"references":{"242922491":"Bayesian Approach to Global Optimization--Theory and Applications","5207179":"Bayesian inference for the uncertainty distribution of computer model outputs. Biometrika","4772685":"Estimating percentiles of uncertain computer code outputs","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","239667584":"A Framework for Validation of Computer Models","4288587":"On Resampling Algorithms for Particle Filters","4181106":"Comparison of resampling schemes for particle filtering","223592988":"A new look at the response surface approach for reliability analysis","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","228721976":"Limit theorems for weighted samples with applications to Sequential Monte Carlo Methods","216301381":"The Design and Analysis Computer Experiments","237548813":"Choosing the Sample Size of a Computer Experiment: A Practical Guide","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","51888191":"Metamodel-based importance sampling for the simulation of rare events","226031060":"Sequential Monte Carlo for rare event estimation","226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","4015429":"New resampling algorithms for particle filters","216301661":"Screening, Predicting, and Computer Experiments","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","4993330":"Sequential Monte Carlo Samplers"},"citedIn":{"262983676":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","281985308":"A Bayesian subset simulation approach to constrained global optimization of expensive-to-evaluate black-box functions","266943935":"A survey of rare event simulation methods for static input-output models","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation","262265054":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","282570552":"A Bayesian approach to constrained single- and multi-objective optimization"},"index":35}