{"abs":"This paper traces the strong relations between experimental design and control, such as the use of optimal inputs to obtain precise parameter estimation in dynamical systems and the introduction of suitably designed perturbations in adaptive control. The mathematical background of optimal experimental design is briefly presented, and the role of experimental design in the asymptotic properties of estimators is emphasized. Although most of the paper concerns parametric models, some results are also presented for statistical learning and prediction with nonparametric models.","title":"Optimal experimental design and some related control problems","id":222400676,"url":"https://www.researchgate.net/publication/222400676_Optimal_experimental_design_and_some_related_control_problems","names":["Luc Pronzato","Automatica"],"references":{"23632746":"A Dirac function method for densities of nonlinear statistics and for marginal densities in nonlinear regression. Statist. Probab. Lett. 26, 159-167","275340906":"Random Forests","3024422":"A note on input-to-state stabilization for nonlinear sampled-data systems","38348382":"Adaptive optimization and $D$-optimum experimental design","220259130":"Nonlinear Adaptive Tracking Using Kernel Estimators: Estimation and Test for Linearity","230873561":"Primal-Dual Interior-Point Methods","4142623":"Mixed H∞ and H2 input design for identification","228873092":"On the Mathematical Foundations of Learning","266700742":"On asymptotically optimal sequential experimental design","230873063":"The equivalence of two extremum problem","4142615":"Cheapest open-loop identification for control","3032582":"Convex Optimization","255595797":"Optimal experiment design in closed loop","15856859":"Optimal sampling times for pharmacokinetic experiments","265365498":"Miscellanea. On sequential designs in nonlinear problems","3023875":"Strong laws of large numbers under weak assumptions with application","238342681":"Principles of geostatistics. Econ Geol (Lancaster)","230872562":"Optimal Design: Experiments for Discriminating Between Several Models","230872560":"Planning experiments for discriminating between models","38367355":"Locally Optimal Designs for Estimating Parameters","230872561":"The Design of Experiments for Discriminating Between Two Rival Models","216301278":"Optimal Design of Experiments","38357623":"Asymptotic Properties of Nonlinear Least Squares Estimates in Stochastic Regression Models","38366731":"Optimum Designs in Regression Problems","223350547":"Optimal Bayesian design applied to logistic regression","243093044":"Further Results on Least Squares Based Adaptive Minimum Variance Control","27344362":"Interior Point Approach to Linear, Quadratic and Convex Programming","240966160":"Minimum Covering Ellipses","225224993":"A Derivative Based Surrogate Model for Approximating and Optimizing the Output of an Expensive Computer Simulation","243083315":"Strong consistency in stochastic regression models via posterior covariance matrices","230872978":"A Review of Experimental Design Procedures for Regression Model Discrimination","2606710":"Adaptive optimisation and D-optimum experimental design","228558284":"Interior-Point Algorithm: Theory and Analysis","38358545":"Optimality of Some Weighing and $2^n$ Fractional Factorial Designs","227544009":"Spatial sampling design under infill asymptotic framework","243041831":"The choice of estimators and experimental designs in a linear regression model according to a joint criterion of optimality","23634231":"Optimal design of experiments subject to correlated errors","247065821":"Optimal Experiment Design for Dynamic System Identification","224746242":"Identification for control: Optimal input design with respect to a worst-case v-gap cost function","226711016":"Renormalised Steepest Descent in Hilbert Space Converges to a Two-Point Attractor","247428293":"Robust experiment desig via maximin optimization","221932989":"Robust Statistics","230725447":"Interior Point Polynomial Algorithms in Convex Programming, SAM","3032231":"Input design via LMIs admitting frequency-Wise model specifications in confidence regions","243082996":"Likelihood Inference for Mixtures: Geometrical and Other Constructions of Monotone StepLength Algorithms","4771522":"The Elements of Statistical Learning","243026167":"Asymptotically efficient adaptive control in stochastic regression models","12157493":"Using densities of estimators to compare pharmacokinetic experiments. Comput. Biol. Med. 31(3), 179-195","222758344":"Optimal Experiment Designs with Respect to the Intended Model Application","228779309":"An algebraic framework for linear identification","226270700":"Bagging Predictors","256660444":"Some results on optimal experiment design","222697942":"Model validation for control and controller validation in a prediction error identification framework - Part I: Theory","222504913":"Neural Network Exploration Using Optimal Experiment Design","238693033":"Stability of Extremum Seeking Feedback for General Dynamic Systems","221932975":"Statistical Methods For Research Workers","220156297":"Closed-Loop Identification Revisited","220159874":"Least costly identification experiment for control","248818761":"The application of Bayesian methods for seeking the extremum","38367465":"Stochastic Estimation of the Maximum of A Regression Function","268761767":"Simultaneous interval estimates of linear functions of parameters","228921602":"Quantification of frequency domain error bounds with guaranteed confidence level in prediction error identification","237132940":"Optimum Experiment De - sign","220259217":"Nonparametric Estimation and Adaptive Control of Functional Autoregressive Models","222668791":"Guaranteed non-asymptotic confidence regions in system identification","267117407":"A Moment Inequality and Monotonicity of an Algorithm","226635575":"Sequential experimental design and response optimisation","246844928":"Model-oreinted design of experiments","236583590":"Bayesian Estimation and Experimental Design in Linear Regression Models","38348940":"Maximum likelihood estimation under a spatial sampling scheme","221933053":"Interpolation of Spatial Data","233373487":"Maximum Entropy Sampling","226681161":"Experimental design for estimating the optimum point in a response surface","234102591":"An Algorithm for the Construction of “D-Optimal” Experimental Designs","3029731":"Optimal experiment design for identification of linear distributed-parameter systems: Frequency domain approach","37965453":"Inference Based on Estimating Functions in the Presence of Nuisance Parameters","216300596":"Theory of Optimal Experiments Designs","2818303":"Determinant maximization with linear matrix inequality constraints. SIAM J Matrix Anal Appl","3027192":"Dual Effects, Certainty Equivalence and Separation in Stochastic Control","221996515":"System Identification: Theory For The User","271430903":"Applications of mixed H2 and H˞ input design in identification","2842359":"Mathematical Results Concerning Kernel","264960790":"Maximum likelihood estimation for spatial models","24052658":"Statistical Asymptotic Theory of Active Learning","243048610":"An algorithm for optimal designs on a design space","222375838":"Comparison of Some Instrumental Variable Methods—Consistency and Accuracy Aspects","3022542":"An actively adaptive control policy for linear models","222135261":"Exploratory Designs for Computational Experiments","223752117":"On Self-Tuning Regulators","4217515":"Identification for Control: From the Early Achievements to the Revival of Experiment Design","223279520":"For model-based control design, closed-loop identification gives better performance","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","5207228":"Measures for designs in experiments with correlated errors","233326878":"Convex design theory 1","238662337":"Optimum Design for Correlated Processes via Eigenfunction Expansions","222247365":"Robust experiment design via stochastic approximation","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","223042487":"Robust optimal experiment design for system identification","243093120":"Asymptotically Efficient Self-Tuning Regulators","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","242997380":"Strong consistency of Bayes estimates in nonlinear stochastic regression models","222552129":"Performance improvement and limitations in extremum seeking control","38357837":"General Equivalence Theory for Optimum Designs","222298180":"On the sequential construction of optimum bounded designs. J. Stat. Plann. Inference 136, 2783-2804","220045336":"Linear Matrix Inequalities in System and Control Theory, SAM","269005056":"An Algorithm for the Construction od D-Optimal Experimental Design","243767694":"Discussion of the paper by S","3026724":"System identification","290828376":"Discussion on a paper by H.P. Wynn","5595969":"The Nature Of Statistical Learning Theory","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","30990543":"Asymptotic Inference from Sequential Design in a Nonlinear Situation","259482208":"Model-Oriented Design of Experiments","227389588":"Topics in Advanced Econometrics","221987360":"System identification with multi-level periodic perturbation signals","3026741":"An actively adaptive control for linear systems with random parameters via the dual control approach","254287371":"Nonlinear Experiments: Optimal Design and Inference Based on Likelihood","247330710":"Multi-Output Support Vector Regression","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","222579306":"From experiment design to closed-loop control","216300500":"Theoretical Statistics","260406452":"Smooth Regression Analysis","221997066":"The Nature of Satistical Learning Theory","257387620":"Discussion on:’Robust Identification and Control Based on Ellipsoidal Parametric Uncertainty Descriptions’ by H.-F. Raynaud, L. Prozato and E. Walter","257387619":"Robust Identification and Control Based on Ellipsoidal Parametric Uncertainty Descriptions","234801352":"Linear Stochastic Systems","45622657":"Statistical Learning Theory","2241307":"Variational Calculus in Space of Measures and Optimal Design","237451037":"Efficient Rounding of Approximate Designs","3020564":"Convergence Of Adaptive Control Schemes Using Least-Squares Parameter Estimates","2438427":"Steepest Descent Algorithms in Space of Measures","216075168":"Collecting Spatial Data: Optimum Design of Experiments for Random Fields","38358799":"Least Squares Estimates in Stochastic Regression Models with Applications to Identification and Control of Dynamic Systems","256123907":"Minimum-volume ellipsoids containing compact sets : Application to parameter bounding","266538667":"Change detection and input design in dynamical systems","230801041":"Dynamic System Identification: Experiment Design and Data Anaysis","228007110":"Maximum Entropy Sampling","265322115":"Asymptotic theory of nonlinear regression with long-range dependence","3537251":"SDO: A statistical method for global optimization","225586213":"Sampled-data control of nonlinear systems: An overview of recent results","247866270":"The elements of statistical learning: data mining, inference, and prediciton","242986786":"Kantorovich-type inequalities for operators via D-optimal design theory. Linear Algebra Appl. 410, 160-169","38359824":"Maximum Likelihood Estimation of Parameters under a Spatial Sampling Scheme","279892981":"Reinforcement Learning: A Survey","38364436":"The Sequential Generation of $D$-Optimum Experimental Designs","265620618":"System Identification","235709806":"Reinforcement Learning: A Survey","223270955":"Sensors and Controllers Location in Distributed Systems—A Survey","3026760":"Wide-sense adaptive dual control for nonlinear systems","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","227673339":"Intrinsic Kriging and prior information: Research Articles","216075148":"Minimax optimal designs for nonparametric regression: A further optimality property of the uniform distribution","2995523":"Dynamic system identification experiment design and data analysis","247065559":"Optimal Design: Some Geometrical Aspects of D-Optimality","38360379":"Optimal Design for Curve Estimation by Local Linear Smoothing","2994521":"Actively Adaptive Control for Nonlinear Stochastic Systems","23635473":"On the irregular behavior of LS estimators for asymptotically singular designs","23632402":"Optimal designs for nonparametric kernel regression","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand","242922491":"Bayesian Approach to Global Optimization--Theory and Applications","256590537":"On adaptive chemical balance weighing designs","235331971":"Optimal design","266511460":"Nonlinear experimental design based on the distribution of estimators","246623546":"Kriging and Splines with Derivative Information. Biometrika, 83, pp207-221","266528875":"Second-order approximation of the entropy in nonlinear least-squares estimation","226356468":"Consistency and Asymptotic Efficiency of Slope Estimates in Stochastic Approximation Schemes","31655534":"Nonlinear Adaptive Control Design","227325442":"Asymptotic behaviour of a family of gradient algorithms in ℝd and Hilbert spaces","220258993":"Identification For Control: Optimal Input Design With Respect To A Worst-Case $\\nu$-gap Cost Function","224817392":"On Estimation of Probability Density Function and Mode","23635711":"Improvements on removing nonoptimal support points in D-optimum design algorithms","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","237131704":"Quasi-Likelihood and Its Application. A General Approach to Optimal Parameter Estimation. Springer Ser. Statist. Springer","3024306":"Extremum seeking control for discrete-time systems","226814489":"Instrumental Variable Methods for System Identification","220694713":"Statistical Learning Theory","250956629":"An Accelerated Sequential Algorithm for Producing $D$Optimal Designs","257388278":"Dual Control of Linearly Parameterised Models via Prediction of Posterior Densities *","261436468":"Optimum Experimental Design","216301381":"The Design and Analysis Computer Experiments","222490346":"Minimax and Maximin Distance Designs","242595292":"Springer Series in Statistics","229058060":"Least Square Support Vector Machine","44550923":"System identification : theory for the user / Lennart Ljung","7186397":"Strong consistency of least squares estimates in multiple regression. Proc. Nat. Acad. Sci. USA 75(7), 3034-3036","230872689":"Discrimination Among Mechanistic Models","266438741":"Nonlinear Statistical Models","232709225":"Optimum choice of moving sensor trajectories for distributed parameter system identification. — Int. J. Control, v. 43, No. 5, pp. 1441-1451","230802040":"Identification Of Parametric Models From Experimental Data","23631058":"Strong Consistency of Bayes Estimates in Stochastic Regression Models","228529701":"Recursively re-weighted least-squares estimation in regression models with parameterized variance","216301407":"Global versus local search in constrained optimization of computer models","23631573":"Strong consistency of least squares estimates in multiple regression II. J. Multivariate Anal. 9, 343-361","266529372":"Optimal Measurement Methods for Distributed Parameter System Identification","3027950":"On Consistency for the Method of Least Squares Using Martingale Theory","225075372":"Linear Matrix Inequality in Systems and Control Theory","226168508":"D\u0027Argenio D. Optimal sampling times for pharmacokinetic experiments","30998548":"Likelihood inference for mixtures: Geometrical and other constructions of monotone step-length algorithms","267642942":"On Self-Tuning Regulators","222493334":"Estimation of model quality","265422342":"“Asymptotic Properties of Non-Linear Least-Square Estimates”","265368068":"Bias in Nonlinear Estimation","38363039":"[Inference Based on Estimating Functions in the Presence of Nuisance Parameters]: Comment","38363031":"Bayesian Experimental Design: A Review","220157632":"Model Validation for Control and Controller Validation in a Prediction Error Identication Framework-part I: Theory","250045189":"Simultaneous Choice of Design and Estimator in Nonlinear Regression with Parameterized Variance","225734295":"The Elements of Statistical Learning, Second Edition: Data Mining, Inference, and Prediction","243099545":"On Estimating Regression","233221635":"On the concept of excitation in least squares identification and adaptive control †","25471074":"Statistical Methods For Research Workers","2422221":"The Interior-Point Revolution in Constrained Optimization","256156329":"Adaptive Control","36877276":"Foundations of Optimum Experimental Design","221995733":"Active Learning with Statistical Models","229058134":"Convex Optimization","240158626":"Optimal measurement methods for distributed parameter system identification","268658673":"Adaptive control for sequential design","230801973":"Theory of Point Estimation","229698630":"A Stochastic Embedding Approach for Quantifying Uncertainty in Estimation of Restricted Complexity Models","243763580":"The Nature Of Statistical Learning Theory","228599900":"Interior point methods for nonlinear optimization. SIAM Rev"},"citedIn":{"266873704":"Design of an optimal actuation signal for identification of a torsional spring system","254054309":"On optimal input signal design for identification of output error models","38010561":"Developing optimal input design strategies in cancer systems biology with applications to microfluidic device engineering","261170453":"Determine measurement set for parameter estimation in biological systems modelling","271563050":"Local model network identification for online engine modelling","271425444":"A novel two stage algorithm for construction of RBF neural models based on A-optimality criterion","266545001":"An inverse method for bounded error parameter identification","254054191":"Chance constrained input design","288179875":"On joint optimal experiment design for identifying partition and local model parameters of Takagi-Sugeno models","224174675":"A combined closed loop optimal design of experiments and online identification control approach","221042595":"On useful redundancy in experiment design for nonlinear system identification","267159267":"Influence of partially known parameter on flaw characterization in Eddy Current Testing by using a random walk MCMC method based on metamodeling","263282337":"Use Hausdorff metric to analyze convergence of parameter estimation in system identification","224175565":"Factorial Design for Efficient Experimentation","220159758":"An adaptive method for consistent estimation of real-valued non-minimum phase zeros in stable LTI systems","220159501":"Redundancy vs multiple starting points in nonlinear related inverse problems","261112835":"Control recognition bounds for visual learning and exploration","254042160":"Online measuring method using an evolving model based test design for optimal process stimulation and modelling","259541102":"Model Identification for Flow Simulations in Geothermal Reservoirs: Towards Optimally Drilling Boreholes","221431844":"Extension of Static Non-linear DoE Identification Algorithms to Dynamic Systems","288873504":"Model-based optimal design of experiments - semidefinite and nonlinear programming formulations","221941037":"Fisher Information for Inverse Problems and Trace Class Operators","288021053":"Hodgkin–Huxley revisited: reparametrization and identifiability analysis of the classic action potential model with approximate Bayesian methods","257392718":"Optimal experiment design based on local model networks and multilayer perceptron networks","260302362":"Dynamic Pricing with Multiple Products and Partially Specified Demand Distribution","262411192":"Experimental Design for Biological Systems","259482347":"Optimal Design for Nonlinear Response Models","260004067":"Trend and fluctuations: Analysis and design of population dynamics measurements in replicate ecosystems","224174146":"A Geometric Approach to Variance Analysis in System Identification","269292563":"Near-optimal selection of parallel inputs in Bayesian experimental design for systems biology","267467246":"State and Parameter Estimation of Partially Observed Linear Ordinary Differential Equations with Deterministic Optimal Control","228341379":"System Identification of Complex and Structured Systems","257005812":"A statistical perspective on oxygen diffusion and surface exchange experiments: Sensitivity analysis, parameter estimation and robust optimal experimental design","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","45198359":"Experiment design through dynamical characterisation of non-linear systems biology models utilising sparse grids","40855240":"Une méthode locale de classification optimale des paramètres identifiables d\u0027un modèle physique. Application à la thérapie photodynamique","257225203":"State of charge estimation for Lithium Ion cells: Design of experiments, nonlinear identification and fuzzy observer design","262388495":"Local model network based dynamic battery cell model identification","224824904":"Evaluation of Design Strategies for Time Course Experiments in Genetic Networks: Case Study of the XlnR Regulon in Aspergillus niger","221042076":"Finite sample properties of system identification with quantized output data","222406256":"Modeling of distributed parameter systems for applications—A synthesized review from time–space separation","224253801":"Optimal Excitation Force Design in Indentation-Based Rapid Broadband Nanomechanical Spectroscopy: Poly(dimethylsiloxane) Example","279384082":"Nonlocal Optimum Design","241355476":"Bayesian inference in physics","288059037":"Peculiarities of the experiment design problem for Gaussian linear systems","220158120":"The cost of complexity in system identification: The Output Error case","23801948":"Optimal experimental design with the sigma point method","256938091":"Necessary condition for applying experimental design criteria to global sensitivity analysis results","258818134":"Application Set Approximation in Optimal Input Design for Model Predictive Control","267870284":"On the optimal worst-case experiment design for constrained linear systems","262807146":"Design of experiment for hysteresis loops measurement","221902840":"Set membership experimental design for biological systems","273770000":"Reducing the Error of Estimated Parameters from Hydriding/Dehydriding Kinetics Measurements: An Optimal Experimental Design Procedure","269212361":"Experiment design for parameter estimation in nonlinear systems based on multilevel excitation","257811998":"Adaptive experiment design for LTI systems","241067037":"Deposition of air pollutants to forest ecosystems along pollution and climatic gradients in Poland","280538108":"Estimator Selection: End-Performance Metric Aspects","242526385":"Parameter Identication and the Design of Experiments for Continuous Non-Linear Dynamical Systems","269295944":"Asymptotical behavior of parameter estimation in prediction error framework","23149223":"Two-stage design for dose-finding that accounts for both efficacy and safety","215671314":"Sequential optimal experiment design for neural networks using multiple linearization","224709550":"Spacetime Metrology with LISA Pathfinder","234070713":"Model-based design of experiments for cellular processes","51930068":"A nonlinear preconditioner for experimental design problems","266857128":"Finding Bayesian Optimal Designs for Nonlinear Models: A Semidefinite Programming-Based Approach","265877128":"Best Intention Designs in Dose–finding Studies","51773511":"Sparse-Grid-Based Adaptive Model Predictive Control of HL60 Cellular Differentiation","266976696":"Evolving model architecture for custom output range exploration","224754743":"ONR supported research efforts at Drexel\u0027s Center for Electric Power Engineering","226645846":"Relations Between Designs for Prediction and Estimation in Random Fields: An Illustrative Case","30516231":"Modélisation Expérimentale des Systèmes Dynamiques - Applications en Biologie Systémique","271401204":"Incremental optimal process excitation for online system identification based on evolving local model networks","251455014":"N 2O emissions from combustion processes","261459791":"A Chernoff relaxation on the problem of application-oriented finite sample experiment design","284887200":"The Role of Computational Intelligence in Experimental Design: A Literature Review","251958744":"Statistical identification of sensors location using inverse differential equations","265913017":"A novel methodology for non-linear system identification of battery cells used in non-road hybrid electric vehicles","215644606":"Influence of non-linearity to the Optimal Experimental Design demonstrated by a biological system","224148024":"Algebraic Derivation of Elfving Theorem on Optimal Experiment Design and Some Connections With Sparse Estimation","269726071":"Application-Oriented Estimator Selection","44271051":"Identification optimale en boucle fermée pour les systèmes non linéaires","216075144":"Beyond space-filling: An illustrative case","271388356":"Multi-objective parameter identification of Euler–Bernoulli beams under axial load","278816372":"Approches d\u0027automatique pour le design de plan d\u0027expériences couplé à l\u0027identification : état de l\u0027art","216075147":"Fisher information in the design of computer simulation experiments","231049390":"Kriging-based generation of databases as forward and inverse surrogatemodels","51709182":"A Global Parallel Model Based Design of Experiments Method to Minimize Model Output Uncertainty","216075149":"Design of computer experiments: Space filling and beyond","233107336":"Modified Wynn\u0027s Sequential Algorithm for Constructing D-Optimal Designs: Adding Two Points at a Time","260721125":"Identification for Systems With Binary Subsystems","224256810":"Combustion engine modelling using an evolving local model network","289083459":"A Tutorial on Applications-Oriented Optimal Experiment Design","221042901":"On Optimal Input Design in System Identification for Control","224182182":"New Method of Sparse Parameter Estimation in Separable Models and Its Use for Spectral Analysis of Irregularly Sampled Data"},"index":350}