{"abs":"Analyses of multivariate ordinal probit models typically use data augmentation to link the observed (discrete) data to latent (continuous) data via a censoring mechanism defined by a collection of “cutpoints.” Most standard models, for which effective Markov chain Monte Carlo (MCMC) sampling algorithms have been developed, use a separate (and independent) set of cutpoints for each element of the multivariate response. Motivated by the analysis of ratings data, we describe a particular class of multivariate ordinal probit models where it is desirable to use a common set of cutpoints. While this approach is attractive from a data-analytic perspective, we show that the existing efficient MCMC algorithms can no longer be accurately applied. Moreover, we show that attempts to implement these algorithms by numerically approximating required multivariate normal integrals over high-dimensional rectangular regions can result in severely degraded estimates of the posterior distribution. We propose a new data augmentation that is based on a covariance decomposition and that admits a simple and accurate MCMC algorithm. Our data augmentation requires only that univariate normal integrals be evaluated, which can be done quickly and with high accuracy. We provide theoretical results that suggest optimal decompositions within this class of data augmentations, and, based on the theory, recommend default decompositions that we demonstrate work well in practice.","title":"Covariance Decompositions for Accurate Computation in Bayesian Scale-Usage Models","id":254296113,"url":"https://www.researchgate.net/publication/254296113_Covariance_Decompositions_for_Accurate_Computation_in_Bayesian_Scale-Usage_Models","names":["Chris Hans","Greg Allenby","Peter F. Craigmile","Juhee Lee","Steven Maceachern","Xinyi Xu","Journal of Computational and Graphical Statistics"],"references":{"243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","4895950":"A Method for Smoothing Simulated Moments of Discrete Probabilities in Multinomial Probit Models","268312950":"Bayesian analysis for correlated ordinal data models","228806505":"Nonparametric Bayesian Modeling for Multivariate Ordinal Data","242530111":"Bayesian Analysis of Binary and Polychotomous Response Data","228623852":"Nonparametric Bayesian modeling for multivariate ordinal data","243779339":"Analysis of Multivariate Probit Models","227442305":"Bayesian Statistics and Marketing","254296231":"The Factor Analytic Approach to Simultaneous Inference in the General Linear Model","2335219":"Efficient Simulation from the Multivariate Normal and Student-t Distributions Subject to Linear Constraints and the Evaluation of Constraint Probabilities","222652438":"A Bayesian Analysis of the Multinomial Probit Model with Fully Identified Parameters","222484308":"An Exact Likelihood Analysis of the Multinomial Probit Model","4986708":"Inference in Semiparametric Dynamic Models for Binary Longitudinal Data","228990076":"Fitting and comparison of models for multivariate ordinal outcomes","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","4743147":"Partially Collapsed Gibbs Samplers: Theory and Methods","226713254":"Accelerating Monte Carlo Markov Chain Convergence for Cumulative-Link Generalized Linear Models","222817186":"Bayesian model determination for multivariate ordinal and binary data","238879771":"Sampling Truncated Normal, Beta, and Gamma Densities","261751740":"An \"Unfolding\" Latent Variable Model for Likert Attitude Data: Drawing Inferences Adjusted for Response Style","247779875":"The Art of Data Augmentation","230663767":"Simulation-Based Estimation","4815394":"A Computationally Practical Simulation Estimator for Panel Data","279779074":"A Hierarchical Latent Variable Model for Ordinal Data from a Customer Satisfaction Survey with \"No Answer\" Responses","254288028":"A Hierarchical Latent Variable Model for Ordinal Data from a Customer Satisfaction Survey with “No Answer” Responses","243103367":"Multivariate Normal Slice Sampling","247389188":"Reparameterizing the generalized linear model to accelerate Gibbs sampler convergence","23741974":"Simulation of Multivariate Normal Rectangle Probabilities and Their Derivatives: Theoretical and Computational Results"},"citedIn":{"257017373":"A Bayesian multivariate probit for ordinal data with semiparametric random-effects","256498804":"Metropolis-Hastings Within Partially Collapsed Gibbs Samplers"},"index":351}