{"abs":"We provide a method that enables the simple calculation of the maximal correlation coefficient of a bivariate distribution, under suitable conditions. In particular, the method readily applies to known results on order statistics and records. As an application we provide a new characterization of the exponential distribution: Under a splitting model on independent identically distributed observations, it is the (unique, up to a location-scale transformation) parent distribution that maximizes the correlation coefficient between the records among two different branches of the splitting sequence.","title":"A Simple Method for Obtaining the Maximal Correlation Coefficient and Related Characterizations","id":222942221,"url":"https://www.researchgate.net/publication/222942221_A_Simple_Method_for_Obtaining_the_Maximal_Correlation_Coefficient_and_Related_Characterizations","names":["Nickos Papadatos","Tatiana Xifara","Journal of Multivariate Analysis"],"references":{"243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","23636393":"On the maximal correlation coefficient","38140967":"Upper and lower bounds for the correlation ratio of order statistics from a sample without replacement","222558247":"Bounds on expectation of order statistics from a finite population","23632941":"An extremal property of rectangular distributions","265590833":"Continuous Bivariate Distributions","266349959":"A characterization of exponential distributions by correlations between records","284689055":"Probabilités de Lancaster","265333528":"The Chi-Square Distribution","229641244":"Das statistische Problem der Korrelation als Variations-and Eigenwertproblem and sein Zusammenhang mit der Ausgleichungsrechnung. Z. Angew. Math. Mech. 21, 364-379. Zbl. 026.33402","45930480":"An extended Stein-type covariance identity for the Pearson family withapplications to lower variance bounds","245278223":"The Chi-squared Distribution","236063520":"Maximal correlation between order statistics","225352282":"Lancaster bivariate probability distributions with Poisson, negative binomial and gamma margins","38361663":"A Characterization of Rectangular Distributions","243081610":"Some Properties of the Bivariate Normal Distribution Considered in the Form of a Contingency Table","38322290":"Remarks on the Maximum Correlation Coefficient","2834000":"On the Maximum Correlation Coefficient","288471341":"A bivariate correlated gamma-type distribution function","242389644":"Estimating Optimal Transformations for Multiple Regression and Correlation: Rejoinder"},"citedIn":{"225069672":"Some Counterexamples Concerning Maximal Correlation and Linear\nRegression","270763540":"Equitability of Dependence Measure","257409917":"Dependence Measure for non-additive model","283037349":"Correlation structure of the Marshall–Olkin bivariate exponential distribution","265016421":"Maximal correlation in a non-diagonal case"},"index":354}