{"abs":"We present an estimation and forecasting method, based on a differential evolution MCMC method, for inference in GARCH models subjected to an unknown number of structural breaks at unknown dates. We treat break dates as parameters and determine the number of breaks by computing the marginal likelihoods of competing models. We allow for both recurrent and non-recurrent (change-point) regime specifications. We illustrate the estimation method through simulations and apply it to seven financial time series of daily returns. We find structural breaks in the volatility dynamics of all series and recurrent regimes in nearly all series. Finally, we carry out a forecasting exercise to evaluate the usefulness of structural break models.","title":"A Bayesian Method of Change-point Estimation with Recurrent Regimes: Application to GARCH Models","id":263736976,"url":"https://www.researchgate.net/publication/263736976_A_Bayesian_Method_of_Change-point_Estimation_with_Recurrent_Regimes_Application_to_GARCH_Models","names":["Luc Bauwens","Bruno De Backer","Arnaud Dufays","Journal of Empirical Finance"],"references":{"236901854":"Understanding the Metropolis-Hastings Algorithm","243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","243765444":"Bayesian Retrospective Multiple Change-Point Identification","228273951":"The Contribution of Structural Break Models to Forecasting Macroeconomic Series","46494851":"Tailored randomized block MCMC methods with application to DSGE models","4986955":"Persistence in Variance, Structural Change, and the GARCH Model","4783680":"Forecasting Time Series Subject to Structural Breaks","5004676":"Detecting Mutiple Breaks in Financial Market Volatility Dynamics","243786188":"Computation and Analysis of Multiple Structural-Change","228241809":"Time Varying Structural Vector Autoregressions and Monetary Policy: A Corrigendum","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","5139679":"Detecting multiple breaks in financial market volatility dynamics","38363224":"Inference From Iterative Simulation Using Multiple Sequences","4854553":"Neglecting parameter changes in GARCH models","4815069":"‘A New Approach To the Analysis of Time Series and the Business Cycle’","262491187":"Maximum likelihood estimation of the Markov-switching GARCH model","222456730":"Calculating Posterior Distributions and Modal Estimates in Markov Mixture Models","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","243764509":"Marginal likelihood from the Gibbs output. J Am Stat Assoc","41035177":"Accelerating Markov Chain Monte Carlo Simulation by Differential Evolution with Self-Adaptive Randomized Subspce Sampling","222303837":"Modelling the Conditional Distribution of Interest Rates As A Regime-Switching Process","4995665":"Estimation and Forecasting in Models with Multiple Breaks","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","222446621":"Estimation and Comparison of Multiple Change-Point Models","247716257":"Testing for and estimation of multiple structural changes","30996602":"On Gibbs Sampling for State Space Models","46494054":"Real time detection of structural breaks in GARCH models","243615712":"Partial Non-Gaussian State Space","227944755":"A Markov Chain Monte Carlo version of the genetic algorithm Differential Evolution: Easy Bayesian computing for real parameter spaces","280887064":"“Time Varying Structural Vector Autoregressions and Monetary Policy.”","5139689":"Multiple Structural Change Models: A Simulation Analysis","227733112":"Theory and inference for a Markov switching GARCH model","4815589":"Estimating and Testing Linear Models With Multiple Structural Changes’","5005856":"The Spline GARCH Model for Unconditional Volatility and its Global Macroeconomic Causes","31056247":"A new approach to Markov-switching GARCH models","5217184":"The Spline-GARCH Model for Low-Frequency Volatility and Its Global Macroeconomic Causes","4725113":"Efficient Bayesian Inference for Multiple Change-Point and Mixture Innovation Models","243775157":"Simulating Ratios of Normalizing Constants via a Simple Identity: A Theoretical Exploration","227944803":"DREAM(D): an adaptive Markov chain Monte Carlo simulation algorithm to solve discrete, noncontinuous, and combinatorial posterior parameter estimation problems. Hydrol Earth Syst Sci","24079705":"Modeling The persistence Of Conditional Variances: A Comment","244464104":"Hierarchical Bayesian Analysis of Change Point Problems","4902448":"Estimating Marginal Likelihoods for Mixture and Markov Switching Models Using Bridge Sampling Techniques","228318816":"Marginal Likelihood for Markov-Switching and Change-Point GARCH Models","253989149":"Bayesian Inference of Structural Breaks in Time-Varying Volatility Models","228313380":"AdMit: Adaptive Mixtures of Student-t Distributions"},"citedIn":{"273885921":"The Frequency of Regime Switching in Financial Market Volatility"},"index":357}