{"abs":"Cette thèse se place dans le cadre des expériences simulées auxquelles on a recours lorsque des expériences physiques ne sont pas réalisables. Une expérience simulée consiste à évaluer une fonction déterministe type boîte-noire coûteuse qui décrit un modèle physique. Les entrées de ce modèle, entachées d\u0027incertitude, forment un vecteur aléatoire. Cela implique que les sorties que nous souhaitons étudier sont aléatoires. Une technique standard pour rendre possibles de nombreux traitements statistiques, est de remplacer la fonction type boîte-noire par un métamodèle d\u0027évaluation quasi-instantanée l\u0027approchant. Nous nous concentrons plus particulièrement sur les métamodèles d\u0027interpolateurs à noyaux dont nous étudions la construction et l\u0027utilisation. Dans ce cadre, une première contribution est la proposition d\u0027une définition plus générale de noyau conditionnellement positif qui permet une vraie généralisation du concept de noyau défini positif et des théorèmes associés. Nous donnons ensuite, dans une deuxième contribution, un algorithme de construction de plans d\u0027expérience dans des domaines éventuellement non hypercubiques suivant un critère maximin pertinent pour ces métamodèles. Dans une troisième contribution, nous traitons un problème statistique inverse en utilisant un métamodèle d\u0027interpolateurs à noyaux dans un algorithme stochastique EM puisque le modèle liant les entrées aux sorties est de type boîte-noire coûteux. Enfin, nous proposons aussi, dans la dernière contribution, l\u0027utilisation d\u0027un tel métamodèle pour développer deux stratégies d\u0027estimation et de majoration de probabilités d\u0027événements rares dépen\\-dant d\u0027une fonction type boîte-noire coûteuse.","title":"Méthodes d\u0027interpolation à noyaux pour l\u0027approximation de fonctions type boîte noire coûteuses","id":48907661,"url":"https://www.researchgate.net/publication/48907661_Methodes_d\u0027interpolation_a_noyaux_pour_l\u0027approximation_de_fonctions_type_boite_noire_couteuses","names":["Pierre Barbillon"],"references":{"41706878":"Coupling a stochastic approximation version of EM with a MCMC procedure","247487939":"Sensitivity analysis for non linear mathematical model","4772685":"Estimating percentiles of uncertain computer code outputs","268901135":"The Design Experiments","265424218":"Some results on Tchebychean spline functions","4784065":"The Correct Kriging Variance Estimated by Bootstrapping","222727631":"Bounds on multivariate polynomials and exponential error estimates for multiquadric interpolation","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","245893283":"Designs for Computer Experiments","2301352":"Error Estimates and Condition Numbers for Radial Basis Function Interpolation","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","224840043":"Recovery of Inter-Block Information When Block Sizes are Unequal","236615831":"Convergence of a stochastic approximation version of EM algorithm","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","269502081":"Linear Statistical Inference and Its Applications","216300917":"Statistical Tools for Simulation Practitioner","38293466":"Generalized Latin Hypercube Design for Computer Experiments","1911433":"Controlled stratification for quantile estimation","248728006":"Spline Models for Observational Data","243102952":"Latin Hyperrectangle Sampling for Computer Experiments","216756606":"Orthogonal Array-Based Latin Hypercubes","265366983":"The Estimation of Mean Squared Error of Small Area Estimators","216756605":"Orthogonal Arrays for Computer Experiments, Integration and Visualization","216756595":"Uniform Design: Theory and Application","228816059":"Determination of the uncertainties of the constitutive relationships of the CATHARE 2 code","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","221677997":"Functions of Positive and Negative Type, And Their Connection with the Theory of Integral Equations","265820229":"Polynomial splines and their tensor products in extended linear modeling. Annals of Statistics, 25, 1371-1470","216756596":"An efficient algorithm for constructing optimal design of computer experiments","216301381":"The Design and Analysis Computer Experiments","245314877":"Identifying intrinsic variability in multivariate systems through linearized inverse methods","242530007":"Number-Theoretic Methods in Statistics","254287372":"Kriging and Splines: An Empirical Comparison of Their Predictive Performance in Some Applications","245079102":"A response-modeling alternative to surrogate models for support in computational analyses","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","222490346":"Minimax and Maximin Distance Designs","31140209":"The ECME algorithm: a simple extension of EM and ECM with faster convergence","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","222523244":"Comparisons of Designs for Computer Experiments","232041696":"Scattered Data Approximation","2126101":"Genealogical particle analysis of rare events","220391060":"Stability of kernel-based interpolation","3619855":"Rare event simulation in stochastic models","228348453":"Analysis of Computer Experiments Using Penalized Likelihood in Gaussian Kriging Models","222427005":"Calculations of Sobol indices for the Gaussian process metamodel","225516876":"Metamodels for Computer-based Engineering Design: Survey and recommendations","221996166":"“Ridge Regression: Biased Estimation for Non-Orthogonal Problems.”","2777365":"Flexible Smoothing with B-Splines and Penalties","46103168":"Adaptive particle techniques and rare event estimation","236901854":"Understanding the Metropolis-Hastings Algorithm","227424334":"Existence of smoothed stationary processes on an interval","230837892":"The Intrinsic Random Functions and Their Applications","229100768":"The SEM Algorithm: A Probabilistic Teacher Algorithm Derived from the EM Algorithm for the Mixture Problem","246983537":"Random Number Generation and Quasi-Monte Carlo Methods","279933413":"The stochastic EM algorithm: estimation and asymptotic results","242358078":"The Elements Of Statistical Learning","4761880":"Maximin Latin Hypercube Designs in Two Dimensions","222363158":"Halton and Hammersley sequences in multivariate nonparametric regression","2262008":"The Stochastic EM Algorithm: Estimation and Asymptotic Results","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","222135261":"Exploratory Designs for Computational Experiments","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","2732495":"Comparison of Radial Basis Function Interpolants","38348334":"The screening effect in Kriging","232405682":"Adaptive directional stratification for controlled estimation of the probability of a rare event","31641483":"Statistics for Spatial Data / N. Cressie.","220320715":"Characterizing the Function Space for Bayesian Kernel Models.","31303344":"Predicting the Output from a Complex Computer Code When Fast Approximations Are Available","216756612":"Orthogonal-Maximin Latin Hypercube Designs","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","38359483":"Multivariate Adaptive Regression Spline","246784707":"Maximum Likelihood from Incomplete Data via the EM Algorithm","38359473":"Multi-Variate Adaptive Regression Splines (with Discussion)","203918300":"Smola, A.: Learning with Kernels - Support Vector Machines, Regularization, Optimization and Beyond. MIT Press, Cambridge, MA","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","243102851":"Constrained Maximin Designs for Computer Experiments"},"citedIn":{"281419061":"Inversion probabiliste en analyse d\u0027incertitude."},"index":360}