{"abs":"We present new MCMC algorithms for computing the posterior distributions and expectations of the unknown variables in undirected graphical models with regular structure. For demonstration purposes, we focus on Markov Random Fields (MRFs). By partitioning the MRFs into non-overlapping trees, it is possible to compute the posterior distribution of a particular tree exactly by conditioning on the remaining tree. These exact solutions allow us to construct efficient blocked and Rao-Blackwellised MCMC algorithms. We show empirically that tree sampling is considerably more efficient than other partitioned sampling schemes and the naive Gibbs sampler, even in cases where loopy belief propagation fails to converge. We prove that tree sampling exhibits lower variance than the naive Gibbs sampler and other naive partitioning schemes using the theoretical measure of maximal correlation. We also construct new information theory tools for comparing different MCMC schemes and show that, under these, tree sampling is more efficient.","title":"From Fields to Trees","id":229157614,"url":"https://www.researchgate.net/publication/229157614_From_Fields_to_Trees","names":["Firas Hamze","Nando de Freitas"],"references":{"38357609":"Markov Chains for Exploring Posterior Distributions","243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","30996602":"On Gibbs Sampling for State Space Models","233950933":"On the Statistical-Analysis of Dirty Pictures","2869101":"Discriminative Fields for Modeling Spatial Dependencies in Natural Images","224839692":"Spatial Interaction and the Statistical Analysis of Lattice Systems","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","215446267":"Monte Carlo Strategies in Scientic Computing","234140100":"Sequential Monte Carlo Methods in Practice","233871585":"An Empirical Study of w-Cutset Sampling for Bayesian Networks","2537463":"Generalized Belief Propagation","2548471":"Tree-reweighted belief propagation algorithms and approximate ML estimation by pseudo-moment matching","221620359":"Sample Propagation.","2834456":"Outperforming the Gibbs sampler empirical estimator for nearest neighbor random fields","2242295":"Conditional simulation from highly structured Gaussian systems, with application to blocking-MCMC for the Bayesian analysis of very large linear models","45622656":"Monte Carlo Statistical Methods","229100766":"Rao-Blackwellisation of Sampling Schemes","242706958":"Spatial interaction and statistical analysis of lattice systems","239582331":"Stochastic Relaxation, Gibbs Distributions and the Bayesian Resoration of Images","228746270":"Dynamic conditional random fields for jointly labeling multiple sequences","222443550":"Evidential reasoning using stochastic simulation","235890130":"Markov Random Field Modeling in Image Analysis","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741"},"citedIn":{"225716342":"A Comparative Study of Energy Minimization Methods for Markov Random Fields","281145093":"Benchmarking a quantum annealing processor with the time-to-target metric","273394159":"Sampling From Gaussian Markov Random Fields Using Stationary and Non-Stationary Subgraph Perturbations","220659393":"Learning to Recognize Objects with Little Supervision","261148727":"Sampling from Gaussian graphical models using subgraph perturbations","260022360":"Sequential Monte Carlo for Graphical Models","228333621":"Learning about individuals from group statistics","221363672":"Region Classification with Markov Field Aspect Models","263663228":"Projecting Ising Model Parameters for Fast Mixing","3993905":"An 80ns 1Mb ROM","51958902":"Self-Avoiding Random Dynamics on Integer Complex Systems","224157554":"Estimating the Information Rate of Noisy Two-Dimensional Constrained Channels","220875358":"A Semi-supervised Learning Approach to Object Recognition with Spatial Integration of Local Features and Segmentation Cues","224358985":"On the role of structure in part-based object detection","224089132":"Estimating the partition function of 2-D fields and the capacity of constrained noiseless 2-D channels using tree-based Gibbs sampling","51893647":"Monte Carlo Algorithms for the Partition Function and Information Rates\nof Two-Dimensional Channels","262030214":"Capacity estimation of two-dimensional channels using Sequential Monte Carlo","257069355":"Dynamic Blocking and Collapsing for Gibbs Sampling","227859918":"Extending Monte Carlo Methods to Factor Graphs with Negative and Complex\nFactors","255585670":"From the Jungle to the Garden: Growing Trees for Markov Chain Monte Carlo Inference in Undirected Graphical Models","221344942":"Conditional random fields for multi-agent reinforcement learning"},"index":361}