{"abs":"This work is in the field of computer experiment which is the natural context when physical experiments are impracticable. A computer experiment consists of an evaluation of an expensive black-box function which describes a physical model. The input variables are treated as a random vector since they suffer from uncertainties. This implies that the outputs of the model which are focused on, are random. In order to make statistical analyses tractable, the black-box function can be replaced with a metamodel which approximates it and is fast to compute. We especially focus on metamodeling with kernel interpolation and the use of these metamodels. In this context, the first contribution consists of proposing a more general definition of a conditionally positive definite kernel which allows a full generalization of the concept of positive definite kernel and its associated theorems. We provide, in a second contribution, an algorithm to obtain numerical designs of experiments according to a maximin criterion which is sensible for these metamodels. In a third contribution, an inverse statistical problem is treated by using a kernel interpolation metamodel into a stochastic EM algorithm since the outputs depend on the inputs through an expensive black-box model. In the last contribution, we propose two strategies relying also on such a metamodel to estimate and to upper bound the probability of rare events based on the outputs of an expensive black-box function.","title":"Kernel interpolation methods for estimating expensive black box functions","id":279263090,"url":"https://www.researchgate.net/publication/279263090_Kernel_interpolation_methods_for_estimating_expensive_black_box_functions","names":["Pierre Barbillon"],"references":{"41706878":"Coupling a stochastic approximation version of EM with a MCMC procedure","4772685":"Estimating percentiles of uncertain computer code outputs","268901135":"The Design Experiments","265424218":"Some results on Tchebychean spline functions","233648357":"Multivariate Geostatistics – An Introduction With Applications","4784065":"The Correct Kriging Variance Estimated by Bootstrapping","222727631":"Bounds on multivariate polynomials and exponential error estimates for multiquadric interpolation","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","245893283":"Designs for Computer Experiments","2301352":"Error Estimates and Condition Numbers for Radial Basis Function Interpolation","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","236615831":"Convergence of a stochastic approximation version of EM algorithm","216300917":"Statistical Tools for Simulation Practitioner","269502081":"Linear Statistical Inference and Its Applications","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","38293466":"Generalized Latin Hypercube Design for Computer Experiments","1911433":"Controlled stratification for quantile estimation","216756606":"Orthogonal Array-Based Latin Hypercubes","243102952":"Latin Hyperrectangle Sampling for Computer Experiments","216756605":"Orthogonal Arrays for Computer Experiments, Integration and Visualization","265366983":"The Estimation of Mean Squared Error of Small Area Estimators","216756595":"Uniform Design: Theory and Application","228816059":"Determination of the uncertainties of the constitutive relationships of the CATHARE 2 code","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","221677997":"Functions of Positive and Negative Type, And Their Connection with the Theory of Integral Equations","265820229":"Polynomial splines and their tensor products in extended linear modeling. Annals of Statistics, 25, 1371-1470","216756596":"An efficient algorithm for constructing optimal design of computer experiments","216301381":"The Design and Analysis Computer Experiments","245314877":"Identifying intrinsic variability in multivariate systems through linearized inverse methods","242530007":"Number-Theoretic Methods in Statistics","221995160":"Theory of reproducing kernels. Trans Am Math Soc","254287372":"Kriging and Splines: An Empirical Comparison of Their Predictive Performance in Some Applications","245079102":"A response-modeling alternative to surrogate models for support in computational analyses","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","222490346":"Minimax and Maximin Distance Designs","31140209":"The ECME algorithm: a simple extension of EM and ECM with faster convergence","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","222523244":"Comparisons of Designs for Computer Experiments","232041696":"Scattered Data Approximation","2126101":"Genealogical particle analysis of rare events","220391060":"Stability of kernel-based interpolation","3619855":"Rare event simulation in stochastic models","228348453":"Analysis of Computer Experiments Using Penalized Likelihood in Gaussian Kriging Models","222427005":"Calculations of Sobol indices for the Gaussian process metamodel","221996166":"“Ridge Regression: Biased Estimation for Non-Orthogonal Problems.”","225516876":"Metamodels for Computer-based Engineering Design: Survey and recommendations","46103168":"Adaptive particle techniques and rare event estimation","227424334":"Existence of smoothed stationary processes on an interval","236901854":"Understanding the Metropolis-Hastings Algorithm","230837892":"The Intrinsic Random Functions and Their Applications","229100768":"The SEM Algorithm: A Probabilistic Teacher Algorithm Derived from the EM Algorithm for the Mixture Problem","246983537":"Random Number Generation and Quasi-Monte Carlo Methods","279933413":"The stochastic EM algorithm: estimation and asymptotic results","242358078":"The Elements Of Statistical Learning","236736850":"Spline Models of Observational Data","4761880":"Maximin Latin Hypercube Designs in Two Dimensions","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","222135261":"Exploratory Designs for Computational Experiments","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","2732495":"Comparison of Radial Basis Function Interpolants","38348334":"The screening effect in Kriging","232405682":"Adaptive directional stratification for controlled estimation of the probability of a rare event","31641483":"Statistics for Spatial Data / N. Cressie.","220320715":"Characterizing the Function Space for Bayesian Kernel Models.","31303344":"Predicting the Output from a Complex Computer Code When Fast Approximations Are Available","2292303":"Native Hilbert Spaces for Radial Basis Functions I","216756612":"Orthogonal-Maximin Latin Hypercube Designs","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","38359483":"Multivariate Adaptive Regression Spline","246784707":"Maximum Likelihood from Incomplete Data via the EM Algorithm","203918300":"Smola, A.: Learning with Kernels - Support Vector Machines, Regularization, Optimization and Beyond. MIT Press, Cambridge, MA","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand","243102851":"Constrained Maximin Designs for Computer Experiments","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","248301107":"Variable Selection for Gaussian Process Models in Computer Experiments"},"citedIn":{},"index":363}