{"abs":"We study asymptotic behavior of Monte Carlo method. Local consistency is one of an ideal property of Monte Carlo method. However, it may fail to hold local consistency for several reason. In fact, in practice, it is more important to study such a non-ideal behavior. We call local degeneracy for one of a non-ideal behavior of Monte Carlo methods. We show some equivalent conditions for local degeneracy. As an application we study a Gibbs sampler (data augmentation) for cumulative logit model with or without marginal augmentation. It is well known that natural Gibbs sampler does not work well for this model. In a sense of local consistency and degeneracy, marginal augmentation is shown to improve the asymptotic property. However, when the number of categories is large, both methods are not locally consistent.","title":"The Order of Degeneracy of Markov Chain Monte Carlo Method","id":51930629,"url":"https://www.researchgate.net/publication/51930629_The_Order_of_Degeneracy_of_Markov_Chain_Monte_Carlo_Method","names":["Kengo Kamatani","ESAIM Probability and Statistics"],"references":{"46952828":"Asymptotics in Statistics : Some Basic Concepts","243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","1917916":"A theoretical comparison of the data augmentation, marginal augmentation and PX-DA algorithms","38357611":"Discussion: Markov Chains for Exploring Posterior Distributions","200111118":"Markov Chains and Stochastic Stability","226713254":"Accelerating Monte Carlo Markov Chain Convergence for Cumulative-Link Generalized Linear Models","216545997":"Testing Statistics Hypotheses","2111878":"General state space Markov chains and MCMC algorithms","260161208":"Hierarchical Generalized Linear Models","47865158":"Local Consistency of Markov Chain Monte Carlo Methods","247470302":"Seeking Efficient Data Augmentation Schemes via Conditional and Marginal Augmentation","50869911":"Weak consistency of Markov chain Monte Carlo methods"},"citedIn":{"273914068":"Asymptotic Properties of Monte Carlo Strategies for a Cumulative Link Model"},"index":364}