{"abs":"Considering the issue of estimating small probabilities p, ie. measuring a rare domain F \u003d {x | g(x) \u003e q} with respect to the distribution of a random vector X, Multilevel Splitting strategies (also called Subset Simulation) aim at writing F as an intersection of less rare events (nested subsets) such that their measures are conditionally easily computable. However the definition of an appropriate sequence of nested subsets remains an open issue. We introduce here a new approach to Multilevel Splitting methods in terms of a move of particles in the input space. This allows us to derive two main results: (1) the number of samples required to get a realisation of X in F is drastically reduced, following a Poisson law with parameter log 1/p (to be compared with 1/p for naive Monte-Carlo); and (2) we get a parallel optimal Multilevel Splitting algorithm where there is indeed no subset to define any more. We also apply result (1) in quantile estimation producing a new parallel algorithm and derive a new strategy for the construction of first Design Of Experiments in meta-model based algorithms.","title":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","id":262983676,"url":"https://www.researchgate.net/publication/262983676_Moving_Particles_a_parallel_optimal_Multilevel_Splitting_method_with_application_in_quantiles_estimation_and_meta-model_based_algorithms","names":["Clément Walter","Structural Safety"],"references":{"245284126":"Dynamic Characterization of Two-Degree-of-Freedom Equipment-Structure Systems","245284895":"Efficient Algorithm for Second-Order Reliability Analysis","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","242386046":"Estimation of Particle Transmission by Random Sampling","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","222165872":"Reliability analysis—A review and some perspectives","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","3086649":"Optimal Watermark Embedding and Detection Strategies Under Limited Detection Resources","29596955":"Genetic Genealogical Models in Rare Event Analysis","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","223307920":"Multiple design points in first and second-order reliability","216301381":"The Design and Analysis Computer Experiments","222814884":"Application of line sampling simulation method to reliability benchmark problems","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","210222819":"Simulation and the Monte Carlo Method","51888191":"Metamodel-based importance sampling for the simulation of rare events","248667834":"Marked Point Processes on the Real Line: The Dynamic Approach","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","226031060":"Sequential Monte Carlo for rare event estimation","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","285364218":"Biometrika","27348184":"Structural reliability using Finite Element Analysis - An appraisel of DARS: Directional Adaptive Response surface Sampling","222780925":"A new adaptive importance sampling scheme","222672830":"Benchmark study on reliability estimation in higher dimensions of structural systems – An overview","4993330":"Sequential Monte Carlo Samplers"},"citedIn":{"272793915":"Large deviations principle for the Adaptive Multilevel Splitting Algorithm in an idealized setting","269876959":"Point Process-based Monte Carlo Estimation","279808481":"Rare Event Simulation and Splitting for Discontinuous Random Variables"},"index":366}