{"abs":"An earthquake model is derived by considering the effective stress available to accelerate the sides of the fault. The model describes near- and far-field displacement-time functions and spectra and includes the effect of fractional stress drop. It successfully explains the near- and far-field spectra observed for earthquakes and indicates that effective stresses are of the order of 100 bars. For this stress, the estimated upper limit of near-fault particle velocity is 100 cm/sec, and the estimated upper limit for accelerations is approximately 2g at 10 Hz and proportionally lower for lower frequencies. The near field displacement u is approximately given by u(t) \u003d (sigma/mu) beta r (1 - exp(-t/r)) where sigma is the effective stress, mu is the rigidity, beta is the shear wave velocity, and tau is of the order of the dimension of the fault divided by the shear-wave velocity. The corresponding spectrum is Omega(omega) \u003d (sigma beta)/mu 1/(omega(omega^2 + tau^-2)^(1/2)). The rms average far-field spectru","title":"Tectonic stress and spectra of shear waves from earthquakes. J Geophys Res","id":215754733,"url":"https://www.researchgate.net/publication/215754733_Tectonic_stress_and_spectra_of_shear_waves_from_earthquakes_J_Geophys_Res","names":["James N. Brune","Journal of Geophysical Research Atmospheres"],"references":{"229750160":"On the Cause of Oscillatory Movement in Seismograms","247004297":"On estimation of displacement in an earthquake source and of source dimension","239037691":"The Numerical Solution of Certain Integral Equations with Nonintegrable Kernels Arising in the Theory of Crack Propagation and Elastic Wave Diffraction, Phil. Trans. R. Soc. A265, 363-381","50301946":"Magnitude and Energy of Earthquakes","229717607":"Damping in Bodily Seismic Waves","228077295":"Scaling Law of Seismic Spectrum","240484044":"Seismic Displacements near a Fault","234194092":"An Introduction the Theory of Seismology","240232410":"Seismic Moment, Stress, and Source Dimensions for Earthquakes in the California-Nevada Region","247655529":"Stress Estimates for South American Shallow and Deep Earthquakes","252467299":"Heat Flow, Stress, and Rate of Slip along the San Andreas Fault, California"},"citedIn":{},"index":369}