{"abs":"a b s t r a c t Very efficient sampling algorithms have been proposed to estimate rare event probabilities, such as Impor-tance Sampling or Importance Splitting. Even if the number of samples required to apply these techniques is relatively low compared to Monte-Carlo simulations of same efficiency, it is often difficult to implement them on time-consuming simulation codes. A joint use of sampling techniques and surrogate models may thus be of use. In this article, we develop a Kriging-based adaptive Importance Sampling approach for rare event probability estimation. The novelty resides in the use of adaptive Importance Sampling and conse-quently the ability to estimate very rare event probabilities (lower than 10 −3) that have not been considered in previous work on similar subjects. The statistical properties of Kriging also make it possible to compute a confidence measure for the resulting estimation. Results on both analytical and engineering test cases show the efficiency of the approach in terms of accuracy and low number of samples.","title":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation","id":241707735,"url":"https://www.researchgate.net/publication/241707735_Kriging-based_adaptive_Importance_Sampling_algorithms_for_rare_event_estimation","names":["Mathieu Balesdent","Jérôme Morio","Julien Marzat","Structural Safety"],"references":{"228438173":"Simultaneous kriging-based estimation and optimization of mean response","3422256":"The importance of importance sampling","268310392":"Parametric estimates by the Monte Carlo method","226250740":"Mean-squared error of kernel estimators for finite values of the sample size","29609803":"Estimation of extreme values, with application to uncertain systems","246868154":"Monte Carlo and Quasi-Monte Carlo Methods 2004","2837434":"An Application of Extreme Value Theory for Measuring Risk","231080149":"Importance sampling: An illustrative introduction","258187760":"Generalized Cross-entropy Methods with Applications to Rare-event Simulation and Optimization","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","222662110":"Kriging metamodeling in simulation: a review. Eur J Oper Res","2833584":"A Tutorial on the Cross-Entropy Method","222727526":"Limit state function identification using Support Vector Machines for discontinuous responses and disjoint failure domains","245865479":"Density Estimation for Statistics and Data Analysis, Chapman and Hall, New York","261625017":"Density Estimation for Statistics and Data Analysis","216301381":"The Design and Analysis Computer Experiments","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","223532023":"Benefit of splines and neural networks in simulation based structural reliability analysis","223269739":"Comparison of response surface and neural network with other methods for structural reliability analysis","224061436":"Splitting for Rare-Event Simulation","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","51888191":"Metamodel-based importance sampling for the simulation of rare events","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","226031060":"Sequential Monte Carlo for rare event estimation","238342681":"Principles of geostatistics. Econ Geol (Lancaster)","216301386":"Flexibility and Efficiency Enhancements For Constrainted Global Design Optimization with Kriging Approximations","2800794":"The Peaks over Thresholds Method for Estimating High Quantiles of Loss Distributions","230911856":"Introduction to importance sampling in rare-event simulations","265366628":"A primer for the Monte Carlo method. Transl. from the Russian","260161079":"Models for exceedances over high thresholds. J R Stat Soc Ser B","46103168":"Adaptive particle techniques and rare event estimation","222461568":"Optimization of computer simulation models with rare events. Eur J Oper Res","230663933":"An Introduction to Statistical Modeling of Extreme Values. Springer Series in Statistics XIV","257334800":"LOcal Uncertainty Processing (LOUP) method for multidisciplinary robust design optimization","222834177":"Application of Subset Simulation Methods to Reliability Benchmark Problems","29601545":"Rare event simulation for a static distribution","231079689":"An overview of importance splitting for rare event simulation","38357892":"Statistical Inference Using Extreme Order Statistics","223592988":"A new look at the response surface approach for reliability analysis","243085743":"Introduction to Rare Event Simulation","41222435":"Monte Carlo Statistical Method","243414233":"LETTERS AND COMMENTS: Importance sampling: how to approach the optimal density?","5144622":"An Application of Extreme Value Theory for Measuring Financial Risk","265815481":"An Introduction to Rare Event Simulation","222380456":"Evaluation of Failure Probability via Surrogate Models","245079154":"Non-parametric adaptive importance sampling for the probability estimation of a launcher impact position","220669261":"A Study on the Cross-Entropy Method for Rare-Event Probability Estimation","221676250":"Meta-models for Structural Reliability and Uncertainty Quantification","254287814":"Nonparametric Importance Sampling","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","256080947":"Extreme quantile estimation with nonparametric adaptive importance sampling","268441586":"IMPROVING ACCURACY AND COMPENSATING FOR UNCERTAINTY IN SURROGATE MODELING","3863119":"Splitting for rare event simulation: Analysis of simple cases","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","2501713":"DACE - A MATLAB Kriging Toolbox","227605097":"Sequential, Bayesian Geostatistics: A Principled Method for Large Data Sets","243775609":"Monte Carlo and Quasi-Monte Carlo Methods 1998"},"citedIn":{"281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","260914185":"Wavelet density-based adaptive importance sampling method","266943935":"A survey of rare event simulation methods for static input-output models","290480822":"Assessing small failure probabilities by AK–SS: An active learning method combining Kriging and Subset Simulation","273833882":"Hybrid reliability analysis with both random and probability-box variables","279211885":"An active learning Kriging model for hybrid reliability analysis with both random and interval variables","261873479":"Rare event probability estimation in the presence of epistemic uncertainty on input probability distribution parameters","281312187":"A surrogate accelerated multicanonical Monte Carlo method for uncertainty quantification"},"index":371}