{"abs":"An asymptotic approximation is developed for evaluating the probability integrals that arise in the determination of the reliability and response moments of uncertain dynamic systems subject to stochastic excitation. The method is applicable when the probabilities of failure or response moments conditional on the system parameters are available, and the effect of the uncertainty in the system parameters is to be investigated. In particular, a simple analytical formula for the probability of failure of the system is derived and compared to some existing approximations, including an asymptotic approximation based on second-order reliability methods. Simple analytical formulas are also derived for the sensitivity of the failure probability and response moments to variations in parameters of interest. Conditions for which the proposed asymptotic expansion is expected to be accurate are presented. Since numerical integration is only computationally feasible for investigating the accuracy of the proposed method for a small number of uncertain system parameters, simulation techniques are also used. A simple importance sampling method is shown to converge much more rapidly than straightforward Monte Carlo simulation. Simple structures subjected to white noise stochastic excitation are used to illustrate the accuracy of the proposed analytical approximation. Results from the computationally efficient perturbation method are also included for comparison. The results show that the asymptotic method gives acceptable approximations, even for systems with relatively large uncertainty, and in most cases, it outperforms the perturbation method.","title":"Asymptotic Expansions for Reliability and Moments of Uncertain Systems","id":245285867,"url":"https://www.researchgate.net/publication/245285867_Asymptotic_Expansions_for_Reliability_and_Moments_of_Uncertain_Systems","names":["C. Papadimitriou","J. L. Beck","L. S. Katafygiotis","Journal of Engineering Mechanics"],"references":{"291326749":"SEISMIC RESPONSE OF STRUCTURES WITH RANDOM PARAMETERS.","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","229352008":"A Very Efficient Moment Calculation Method for Uncertain Linear Dynamic Systems","245284534":"Reliability of Uncertain Linear and Nonlinear Systems","245285335":"Reliability of Uncertain Nonlinear Trusses Under Random Excitation. II","273800443":"Second‐Order Reliability Approximations","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","225900475":"Generalized Trajectory Methods for Finding Multiple Extrema and Roots of Functions","245285171":"Response of Systems with Uncertain Parameters to Stochastic Excitation","239387028":"Probability Approximations by Log Likelihood Maximization","256522361":"Approximate Analysis of Response Variability of Uncertain Linear Systems","222876860":"Stochastic response sensitivity of secondary systems to primary structural uncertainties","245284267":"Response of Uncertain Systems to Stochastic Excitation","222790897":"On fast integration for time variant structural reliabiity","222035533":"Asymptotic Approximations for Probability Integrals"},"citedIn":{"260008573":"Efficient parametric uncertainty analysis within the hybrid Finite Element/Statistical Energy Analysis method","271882032":"Crack Detection of Thin Plate Structures Utilizing Measured Vibration","220373547":"Structural Health Monitoring via Measured Ritz Vectors Utilizing Artificial Neural Networks","256800581":"On prediction error correlation in Bayesian model updating","51670553":"Separating the Role of Protein Restraints and Local Metal-Site Interaction Chemistry in the Thermodynamics of a Zinc Finger Protein","237229106":"Bayesian Methodology for Structural Damage Identification and Reliability Assessment","251716883":"Probabilistic Damage Characterisation in Beams using Guided Waves","225482599":"Joint statistics of natural frequencies of stochastic dynamic systems","282845644":"Structural dynamic reliability updating method based on Bayesian theorem","245425337":"Design Strategy with a Class of Structural Reliability Models of High Dimension","253815609":"Bayesian Methods for Updating Dynamic Models","270293255":"Π4U: A high performance computing framework for Bayesian uncertainty quantification of complex models","4111138":"Seismic source parameters from InSAR data trough neural networks","256968783":"Fatigue reliability analysis of a steel catenary riser at the touchdown point incorporating soil model uncertainties","281444582":"Bayesian probabilistic approach for model updating and damage detection for a large truss bridge","227878324":"Structural damage detection and assessment by adaptive Markov chain Monte Carlo simulation","256800108":"Reliability assessment in structural dynamics","256846957":"Uncertainty Quantification in the Assessment of Progressive Damage in a 7-Story Full-Scale Building Slice","274541432":"Bayesian model updating approach for experimental identification of damage in beams using guided waves","245078962":"Uncertainty analyses in fault trees and Bayesian networks using FORM/SORM methods","263226777":"A probabilistic approach to structural model updating","242354014":"(QWURS\\%DVHG 2SWLPDO 6HQVRU /RFDWLRQ IRU 6WUXFWXUDO 0RGHO 8SGDWLQJ","243366062":"Strategy for finding a near-optimal measurement set for parameter estimation from modal response","223264382":"Structural optimization of linear dynamical systems under stochastic excitation: A moving reliability database approach","223937897":"Reliability-based optimal design of linear dynamical systems under stochastic stationary excitation and model uncertainty","256919136":"Assessment of structural simulation models by estimating uncertainties due to model selection and model simplification","245294764":"Bayesian Probabilistic Approach for the Correlations of Compression Index for Marine Clays","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","288684288":"A hierarchical Bayesian framework for force field selection in molecular dynamics simulations","220373527":"A Bayesian Probabilistic Approach for Crack Characterization in Plate Structures","254304031":"Unconditional Reliability-Based Design of Tuned Liquid Column Dampers Under Stochastic Earthquake Load Considering System Parameters Uncertainties","276211777":"Kriging metamodeling in seismic risk assessment based on stochastic ground motion models: Seismic Risk Assessment Through Kriging Metamodeling","228846049":"Model Selection Using Response Measurements: Bayesian Probabilistic Approach","227679696":"Random Eigenvalue Problems in Structural Dynamics","227528395":"Reliability‐based robust control for uncertain dynamical systems using feedback of incomplete noisy response measurements","250693053":"Reliability Estimation for Dynamical Systems Subject to Stochastic Excitation using Subset Simulation with Splitting","223862041":"The selection of pattern features for structural damage detection using an extended Bayesian ANN algorithm. J Eng Struct","264547733":"Bayesian Model Updating of Stochastic Dynamic Soil-Structure Interaction Systems with Multiple Resolutions","242529062":"Damage Detection of Structural Systems with Noisy Incomplete Input and Response Measurements","245373172":"Optimal Sensor Placement Methodology for Identification with Unmeasured Excitation","222553108":"Reliability analysis of a satellite structure with a parametric and a non-parametric probabilistic model","223058704":"Guided wave damage characterisation in beams utilising probabilistic optimisation","223898118":"Experimental characterization of multiple cracks in a cantilever beam utilizing transient vibration data following a probabilistic approach","238179410":"Reliability-Based Performance Objectives and Probabilistic Robustness in Structural Control Applications","245424578":"Optimal Design of Uncertain Systems Under Stochastic Excitation","229559244":"Efficient Model Updating and Health Monitoring Methodology Using Incomplete Modal Data without Mode Matching","263865560":"Data fusion-based structural damage detection under varying temperature conditions","262817737":"Predicting Fatigue Damage in Composites: A Bayesian Framework","228585210":"Multi-Criteria Optimal Structural Design Under Uncertainty","282598590":"Bayesian uncertainty quantification of turbulence models based on high-order adjoint","251716967":"Iterative Probabilistic Approach for Selection of Time-Varying Model Classes","30759090":"Domain Decomposition Method for Calculating the Failure Probability of Linear Dynamic Systems Subjected to Gaussian Stochastic Loads","270006896":"Dealing with uncertainty in model updating for damage assessment: A review","245424074":"Optimum Sensitivity-Based Statistical Parameters Estimation from Modal Response","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","264436922":"Spherical subset simulation (S³) for solving non-linear dynamical reliability problems","30011721":"A univariate decomposition method for higher-order reliability analysis and design optimization","237290661":"Random Matrix Eigenvalue Problems in Probabilistic Structural Mechanics","279234593":"Fundamental two-stage formulation for Bayesian system identification, Part I: General theory","43507999":"Multicrack Detection on Semirigidly Connected Beams Utilizing Dynamic Data","264863041":"Hierarchical Sparse Bayesian Learning for Structural Health Monitoring with Incomplete Modal Data","251768968":"Bayesian analysis of the Phase II IASC-ASCE Structural Health Monitoring experimetnal benchmark data","225678845":"Structural Protection using MR Dampers with Clipped Robust Reliability-based Control","222395601":"Updating robust reliability using structural test data. Probabilist Eng Mech","273896647":"Polynomial Chaos Expansion and Steady-State Response of a Class of Random Dynamical Systems","245286410":"Reliability of Uncertain Inelastic Structures under Earthquake Excitation","223432900":"System identification of an enclosure with leakages using a probabilistic approach","223589317":"Structural identification based on optimally weighted modal residuals","273432026":"Robust Design of Tuned Mass Damper Systems for Seismic Protection of Multistory Buildings","245425207":"Reliability-Based Optimization of Uncertain Systems in Structural Dynamics","227546376":"Reliability-based control optimization for active isolation systems","223269332":"Computational methods for accounting of structural uncertainties, applications to dynamic behavior prediction of piping systems","225786862":"Bridge health monitoring system based on vibration measurements","230313249":"Application of two‐dimensional spatial wavelet transform in the detection of an obstructed crack on a thin plate","226306784":"Uncertainty analysis of strain modal parameters by Bayesian method using frequency response function","273316308":"METODOLOGIAS EFICIENTES PARA ANÁLISE DE FADIGA PROBABILÍSTICA DE ESTRUTURAS MARÍTIMAS","245186050":"A probabilistic method for the detection of obstructed cracks of beam-type structures using spatial wavelet transform","282132593":"A Review of Model Updating Methods for Civil Infrastructure Systems","223558898":"Statistical detection of multiple cracks on thin plates utilizing dynamic response","228519485":"Lifetime reliability based design of an offshore vessel mooring","284078155":"Application of the transitional Markov chain Monte Carlo algorithm to probabilistic site characterization","259543252":"Value of information: Impact of monitoring on decision-making","264172044":"Wireless sensor networks for permanent health monitoring of historic buildings","271137169":"Engineering Optimization Robust design of tuned mass dampers installed on multi-degree-of-freedom structures subjected to seismic action","252834216":"Reconstruction of the interior sound pressure of a room using the probabilistic approach","222780925":"A new adaptive importance sampling scheme","245286437":"Two-Stage Structural Health Monitoring Approach for Phase I Benchmark Studies","250696781":"Design and Sensitivity Analysis of Dynamical Systems subjected to Stochastic Loading","225695694":"Modeling of environmental influence in structural health assessment for reinforced concrete buildings","229979402":"Analytical Approximation for Stationary Reliability of Certain and Uncertain Linear Dynamic Systems with Higher Dimensional Output","226116794":"On the structural synthesis of uncertain systems subjected to environmental loads","282514455":"A new Gibbs sampling based Bayesian model updating approach using modal data from multiple setups","281898501":"Bayesian model updating of a coupled-slab system using field test data utilizing an enhanced Markov chain Monte Carlo simulation algorithm","260995398":"On the selection of advanced signal processing techniques for guided wave damage identification using a statistical approach","266857262":"Efficient Bayesian sensor placement algorithm for structural identification: A general approach for multi-type sensory systems","242432191":"BAYESIAN RELIABILITY UPDATING USING SYSTEM IDENTIFICATION BASED ON SELECTIVE SENSITIVITY","222515596":"Reliability analysis of randomly vibrating structures with parameter uncertainties","225662652":"Fuzzy-entropy based robust optimization criteria for tuned mass dampers","273344158":"Efficient Methods for Probabilistic Fatigue Analysis Of Marine Structures","229913442":"Probabilistic control for the Active Mass Driver benchmark structural model","239920282":"Joint Distribution of Eigenvalues of Linear Stochastic Systems","28785007":"Model Selection Identification and Robust Control for Dynamical Systems","28784750":"A Bayesian probabilistic approach to structural health monitoring","223747724":"Optimum design of tuned liquid column dampers under stochastic earthquake load considering uncertain bounded system parameters","222310302":"Perturbation methods for the estimation of parameter variability in stochastic model updating","279197050":"Real-Time System Identification: An Algorithm for Simultaneous Model Class Selection and Parametric Identification","282010414":"A Review of Model Updating Methods for Civil Infrastructure Systems","227335524":"Application of saddlepoint approximation in reliability analysis of dynamic systems","253706742":"A Dempster-Shafer evidence theory-based, approach for on-line structural health monitoring - art. no. 69351T","222980001":"On the complexity of artificial neural networks for smart structures monitoring","245078901":"Computing failure probabilities. Applications to reliability analysis","276995436":"On the long-term fatigue assessment of mooring and riser systems","245185906":"Wedge simulation method for calculating the reliability of linear dynamical systems","223402913":"Reliability analysis of linear dynamical systems using approximate representations of performance functions","238024923":"Statistical Methodology for Optimal Sensor Locations for Damage Detection in Structures","262963286":"Managing the Historical Heritage Using Distributed Technologies","223787948":"Robust optimum design of tuned mass dampers devices in random vibrations mitigation. J Sound Vib","283028005":"Erratum to: Impact of prior perception on bridge health diagnosis","278671456":"Bayesian Probabilistic Approach for model updating and damage detection"},"index":372}