{"abs":"Complex computer models are widely used to describe and predict environmental phenomena. Although such models are generally deterministic, there is a flourishing area of research that treats their outputs as random quantities, in order to provide powerful solutions to some important problems facing the users of such models. Such problems include interpolation/emulation of the computer code itself, sensitivity and uncertainty analysis, and calibration. This article reviews this field, with particular reference to a Bayesian methodology that offers a unified framework for addressing all such problems. A substantial practical example is then presented, involving calibration of a model to describe the radioactive deposition following the Windscale nuclear accident in the UK in 1957. The example illustrates some important features of the approach when the computer model is unable to represent the real phenomenon accurately, so that the Bayesian method then seeks to correct the computer model.","title":"Bayesian Analysis of Computer Code Outputs","id":2365648,"url":"https://www.researchgate.net/publication/2365648_Bayesian_Analysis_of_Computer_Code_Outputs","names":["Marc Kennedy","Anthony O’Hagan","Neil Higgins"],"references":{"223092253":"An analysis of the 1957 windscale accident using the WEERIE code","40936001":"Windscale 1957 : anatomy of a nuclear accident","235324242":"Sensitivity Analysis","4772045":"Bayesian Calibration of Computer Models","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","230872587":"Experimental Design and Observation for Large Systems","2738802":"Uncertainty Analysis and other Inference Tools for Complex Computer Codes","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","245581885":"Bayes linear strategies for matching hydrocarbon reservoir history","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","2335212":"Bayesian Inference for the Uncertainty Distribution"},"citedIn":{"222581573":"Bayesian emulation of complex multi-output and dynamic computer models","257017520":"Calibration of computer models with multivariate output","259820249":"Error and Uncertainty Analysis of Inexact and Imprecise Computer Models","281178279":"SAVE: An R Package for the Statistical Analysis of Computer Models","29654658":"Statistical Assessment of Numerical Models","245582244":"Bayesian Validation of a Computer Model for Vehicle Crashworthiness","239667584":"A Framework for Validation of Computer Models","228780489":"Predicting Vehicle Crashworthiness: Validation of Computer Models for Functional and Hierarchical Data","226706159":"Geological Modelling and Reservoir Simulation","1899891":"Computer model validation with functional output","228353677":"Natural norm” a posteriori error estimators for reduced basis approximations","228725430":"A Dynamic Modelling Strategy for Bayesian Computer Model Emulation","268508057":"Fast Construction of Surrogates for UQ Central to DDDAS – Application to Volcanic Ash Transport","258724624":"Review of surrogate modeling in water resources Water Resources Research 48:n/a-n/a","222548735":"Bayesian analysis of computer code outputs: A tutorial"},"index":373}