{"abs":"The range of possibilities for future climate evolution needs to be taken into account when planning climate change mitigation and adaptation strategies. This requires ensembles of multi-decadal simulations to assess both chaotic climate variability and model response uncertainty. Statistical estimates of model response uncertainty, based on observations of recent climate change, admit climate sensitivities--defined as the equilibrium response of global mean temperature to doubling levels of atmospheric carbon dioxide--substantially greater than 5 K. But such strong responses are not used in ranges for future climate change because they have not been seen in general circulation models. Here we present results from the \u0027climateprediction.net\u0027 experiment, the first multi-thousand-member grand ensemble of simulations using a general circulation model and thereby explicitly resolving regional details. We find model versions as realistic as other state-of-the-art climate models but with climate sensitivities ranging from less than 2 K to more than 11 K. Models with such extreme sensitivities are critical for the study of the full range of possible responses of the climate system to rising greenhouse gas levels, and for assessing the risks associated with specific targets for stabilizing these levels.","title":"Uncertainty in Predictions of the Climate Response to Rising Levels of Greenhouse Gases. Nature 433: 403-406","id":8058187,"url":"https://www.researchgate.net/publication/8058187_Uncertainty_in_Predictions_of_the_Climate_Response_to_Rising_Levels_of_Greenhouse_Gases_Nature_433_403-406","names":["David Alan Stainforth","T Aina","Carl Christensen","M. Collins","N Faull","David J Frame","Nature"],"references":{"222215359":"What is a dangerous climate change?","12002421":"What is ‘Dangerous’ climate change?","4772045":"Bayesian Calibration of Computer Models","11487849":"What might we learn from climate forecasts? Proc Natl Acad Sci U S A","11162403":"Constraints on Future Changes in Climate and the Hydrologic Cycle","11536123":"Quantifying the Risk of Extreme Seasonal Precipitation Events in a Changing Climate","225386019":"The impact of new physical parametrizations in the Hadley Centre Climate Model—HADAM3","11162404":"Towards objective probabilistic climate forecasting","235703747":"Transient Climate Change in the Hadley Centre Models: The Role of Physical Processes","11580065":"Quantifying uncertainties in climate system properties with the use of recent climate observations. Science","234005920":"Uncertainties in the Prediction of Regional Climate Change","12290601":"Quantifying the uncertainty in forecasts of anthropogenic climate change. Nature 407(6804): 617-620","3422508":"Distributed computing for public interest modelling research","234407009":"The worlds of Galileo: the inside story of NASA\u0027s mission to Jupiter","11405236":"Knutti, R., Stocker, T. F., Joos, F. \u0026 Plattner, G. K. Constraints on radiative forcing and future climate change from observations and climate model ensembles. Nature 416, 719−723","11405237":"Origins and estimates of uncertainty in predictions of twenty first century temperature rise. Nature","260333208":"Objective estimation of the probability density function for climate sensitivity. J Geophys Res-Atmos Res","231014552":"Predicting uncertainty in forecasts of weather and climate","241133887":"Assessing the Relative Roles of Initial and Boundary Conditions in Interannual to Decadal Climate Predictability","242880671":"Do-it-yourself climate prediction. Nature 401(6754): 642","248813618":"Evaluating Uncertainties in the Prediction of Regional Climate Change","237900290":"An Observationally Based Estimate of the Climate Sensitivity","2444232":"Bayesian Calibration of Complex Computer Models","11878146":"Interpretation of High Projections for Global-Mean Warming","8404087":"Murphy, J. M. et al. Quantification of modelling uncertainties in a large ensemble of climate change simulations. Nature 430, 768−772","223762924":"An overview of results from the Coupled Model Intercomparison Project (CMIP). Glob Planet Change","245777437":"Constraints on future changes in climate and the hydrological cycle","225271510":"Subjective Judgments by Climate Experts","2358302":"Disentangling Uncertainty and Error: On the Predictability of Nonlinear Systems"},"citedIn":{"253551390":"What caused Earth\u0027s temperature variations during the last 800,000 years? Data-based evidence on radiative forcing and constraints on climate sensitivity","257142614":"Reliability and importance of structural diversity of climate model ensembles","262545326":"Crecimiento urbano y balance de CO2 en la cuenca del río Elqui (Chile)","263332792":"Downscaled climate change projections over Spain: Application to water resources","227624320":"Rising environmental temperatures and biogeography: Poleward range contraction of the blue mussel, Mytilus edulis L., in the western Atlantic","278691982":"Climate Change Modeling Methodology","233809404":"Environmental and resource constraints on Asian urban travel","242123386":"Discussion of reified Bayesian modeling and inference for physical systems by Michael Goldstein and Jonathan Rougier","27648433":"Hall, I. R. et al. Accelerated drawdown of meridional overturning in the late-glacial Atlantic triggered by transient pre-H event freshwater perturbation. Geophys. Res. Lett. 33, L16616","257548111":"Disconcerting learning on climate sensitivity and the uncertain future of uncertainty","237389374":"Scientific Project","49643245":"Water Availability in +2 °C and +4 °C Worlds","242294376":"Global Warming in the Southwest Projections, Observations and Impacts","242578028":"Options for Improving Climate Modeling to Assist Water Utility Planning for Climate Change","248526539":"The development of general circulation models of climate","225112439":"Quantifying uncertainties in projections of extremes—A perturbed land surface parameter experiment","230743521":"Conversion of CO 2 into biomass by microalgae: How realistic a contribution may it be to significant CO 2 removal?","224992588":"Transport impacts on atmosphere and climate: Metrics","272791653":"Inter-Relationships between Adaptation and Mitigation","49594067":"Uncertainties in climate change projections, from the global to the regional scale","43155130":"Observational Constraints on Past Attributable Warming and Predictions of Future Global Warming","51994417":"Parallel computing engines for subsurface imaging technologies","238580243":"On two kinds of public-resource distributed computing","7461978":"Photosynthesis: a blueprint for solar energy capture and biohydrogen production technologies, Photochem Photobiol Sci 4:957-969","248961789":"Franklin, Holmes, and the Epistemology of Computer Simulation","220782853":"Grid resource management---Designing a runtime system for volunteer computing","3936275":"Design and performance of a normal-incidence optical critical dimension metrology system","228344236":"Limited sensitivity analysis of regional climate change probabilities for the 21st century","5915758":"Morphological and ecological determinants of body temperature of Geukensia demissa, the Atlantic ribbed mussel, and their effects on mussel mortality.","253505320":"A Multimodel Study of Parametric Uncertainty in Predictions of Climate Response to Rising Greenhouse Gas Concentrations","235191857":"Quantifying Uncertainties in Ocean Predictions","223463783":"Assessing the Robustness of Adaptations to Decisions to Climate Change Uncertainties: A Case Study on Water Resource Management in the East of England","257548143":"Future projections and uncertainty assessment of extreme rainfall intensity in the United States from an ensemble of climate models","221392139":"Scalable Desktop Grid System","265339883":"Weather@home: Development and validation of a very large ensemble modeling system for probabilistic event attribution","226804159":"Applying probabilistic projections of climate change with impact models: A case study for sub-arctic palsa mires in Fennoscandia","49284812":"Living on the Edge of Two Changing Worlds: Forecasting the Responses of Rocky Intertidal Ecosystems to Climate Change","250375888":"Surface Pollen Data Addition for the Warm-temperate Zone of Japan: An Improved Paleotemperature Reconstruction for Late Quaternary Interglacials","234005964":"A Unified Modeling Approach to Climate System Prediction","274777122":"Projected Climate Change in the Hindu Kush–Himalayan Region By Using the High-resolution Regional Climate Model PRECIS","249603749":"How Well Do Regional Climate Models Reproduce Radiation and Clouds in the Arctic? An Evaluation of ARCMIP Simulations","51174217":"Does information about risks and benefits improve the decision-making process in cancer screening – Randomized study","227979729":"Physics‐Aware Optimization Method","275413026":"General diagnostic equations and regime analyzis for the height of the planetary boundary layer: General equations for the height of the Planetary Boundary Layer","226788813":"Forecast of biosphere dynamics using small-scale models","263538684":"Frequency of Strong Year-Classes: Implications on Fishery Dynamics for Three Life History Strategies of Fishes","225577278":"Frequency distributions of transient regional climate change from perturbed physics ensembles of general circulation model simulations. Clim Dyn","232689042":"Southward Expansion in Beetle and Butterfly Ranges in South Africa","229072362":"Model independence in multi-model ensemble prediction","242307647":"Probabilistic Inference for Future Climate Using an Ensemble of Simulator Evaluations","227988952":"Variable Partition Inertia: Graph Repartitioning and Load Balancing for Adaptive Meshes","255620974":"Desmatamento na Amazônia: dinâmica, impactos e controle","29630871":"Information on the early Holocene climate constrains the summer sea ice projections for the 21st century","225520933":"Comparative Planetary Climatology","227605957":"Environmental change during the Allerød and Younger Dryas reconstructed from Swiss tree‐ring data","227501525":"Partitioning and mapping uncertainties in ensembles of forecasts of species turnover under climate change","252171099":"The Four-Dimensional Requirements for Computing Infrastructure in Climate Prediction","220041539":"Policy responses to rapid climate change: An epistemological critique of dominant approaches","227615219":"Statistical screening of system dynamics models","265412531":"Short ensembles: An efficient method for discerning climate-relevant sensitivities in atmospheric general circulation models","4232227":"The NERC Datagrid: enabling interoperable climate data resources","7226379":"Tropical Forests and the Changing Earth System","235945592":"Potential and Constraints of Geospatial Data for Precise Assessment of the Impacts of Climate Change at Landscape Level","228622795":"Propagating uncertainty through prognostic carbon cycle data assimilation system simulations","226237712":"Human-environment interactions: Towards synthesis and simulation","225469726":"Pitman, A. J., G. T. Narisma, and J. McAneney. The impact of climate change on the risk of forest and grassland fires in Australia. Climatic Change","225358080":"Future changes in tropical cyclone genesis in fully dynamic ocean- and mixed layer ocean-coupled climate models: A low-resolution model study","268749931":"The integrated effects of climate and hydrologic uncertainty on future flood risk assessments","23558420":"Multistability, phase diagrams, and intransitivity in the Lorenz-84 low-order atmospheric circulation model","255723339":"Hydrology and Earth System Sciences Using the UKCP09 probabilistic scenarios to model the amplified impact of climate change on drainage basin sediment yield","257249056":"Water security, global change and land-atmosphere feedbacks","225506567":"Climate feedbacks determined from radiative kernels in a multi-thousand member ensemble of AOGCMs","258772756":"Representation of model error in a convective-scale ensemble","253382499":"What Every European Should Know About Global Warming","248815277":"Investigating ENSO sensitivity to mean climate in an intermediate model using a novel statistical technique","242716173":"BEFORE THE SECRETARY OF INTERIOR PETITION TO LIST THE AMERICAN PIKA (OCHOTONA PRINCEPS) AS THREATENED OR ENDANGERED UNDER THE UNITED STATES ENDANGERED SPECIES ACT","242765315":"GLOBAL CLIMATE CHANGE In Support of the 2005 Integrated Energy Policy Report","257411884":"Basis of a formal language for facilitating communication among climate modelers","228853208":"Probabilistic regional and seasonal predictions of twenty-first century temperature and precipitation","222919988":"An extreme value analysis of UK drought and projections of change in the future","4883508":"Uncertainty and Climate Change Policy","49830534":"Peach fruit ripening: A proteomic comparative analysis of the mesocarp of two cultivars with different flesh firmness at two ripening stages","238399156":"Climate Change and Coastal Management Decisions: Insights from Christchurch Bay, UK","226893061":"A comparison of perturbed physics and multi-model ensembles: model errors, feedbacks and forcings. Clim Dyn","251432575":"Long-term probabilistic forecast of climate impact on air quality: Model development and t* distribution","252372877":"How to Avoid dAngerous ClimAte CHAnge","233728361":"Qualitative Modelling Techniques to Assess Patterns of Global Change","267567992":"How Well Do We Understand and Evaluate Climate Change Feedback Processes?","229899576":"Probabilistic forecasts of near-term climate change based on a resampling ensemble technique. Tellus 58A:461-472","252236676":"Assessment of representations of model uncertainty in monthly and seasonal forecast ensembles","38412997":"Controls on the Activation and Strength of a High-Latitude Convective Cloud Feedback","249611887":"Equilibrium Response of an Atmosphere Mixed Layer Ocean Model to Different Radiative Forcing Agents: Global and Zonal Mean Response","259494883":"Estimating Model Parameters with Ensemble-Based Data Assimilation: A Review","242292455":"Wallace, A. R. 1903. Man\u0027s Place in the Universe: A Study of the Results of Scientific Research in Relation to the Unity or Plurality of Worlds. George Bell \u0026 Sons. London","228390154":"Urban planning for climate change","250758757":"A Training Grid Environment in VOCE","227688714":"Quantifying variance components in ecological models based on expert opinion","248516169":"What does it mean when climate models agree? A case for assessing independence among general circulation models","237793973":"Impacto do Desmatamento Amazônico sobre o Ambiente Urbano em Manaus","255650725":"Probability Distributions of CO2-induced Global Warming as Inferred Directly from Multimodel Ensemble Simulations","260211481":"A high-performance workflow system for subsurface simulation","230924637":"A note on the effect of GCM tuning on climate sensitivity","264488803":"How reliable are climate models? Review article","229138703":"The effect of proactive adaptation on green investment","226155987":"Imprecise probabilities of climate change: Aggregation of fuzzy scenarios and model uncertainties","233037135":"Diagnosing the causes of bias in climate models – why is it so hard?","227175719":"Climate Change to the End of the Millennium","239573736":"Achieving Satellite Instrument Calibration for Climate Change (ASIC 3 )","252935075":"Axford, Y., Briner, J. P., Miller, G. H. \u0026 Francis, D. R. Paleoecological evidence for abrupt cold reversals during peak Holocene warmth on Baffin Island, Arctic Canada. Quat. Res. 71, 142-149","224812502":"Using the past to constrain the future: How the palaeorecord can improve estimates of global warming","258438103":"Generating probabilistic estimates of hydrological response for Irish catchments using a weather generator and probabilistic climate change scenarios","271204507":"qj2319","259841997":"Mapping Climate Vulnerability and Poverty in Africa: Report to the Department for International Development","238752396":"An ensemble simulation approach based on glacial climate","227988782":"The Seine Data Coupling Framework for Parallel Scientific Applications","224017895":"Error Reduction and Convergence in Climate Prediction","242997957":"Reified Bayesian modelling: Issues and opportunities (response to the discussion)","238503561":"Photo-induced formation of size-selective Ag nanoparticles and their interactions with Escherichia coli","258685909":"Quantifying future climate change","250140247":"Efficiently Constraining Climate Sensitivity with Ensembles of Paleoclimate Simulations","258660267":"Exploring Perturbed Physics Ensembles in a Regional Climate Model","259084208":"Inaugural Article by a Recently Elected Academy Member:","270278879":"Increasing temperature forcing reduces the Greenland Ice Sheet\u0027s response time scale","222672256":"Grid security: Next steps","265420567":"Carbon Dioxide Bio-fixation and Wastewater Treatment via Algae Photochemical Synthesis for Biofuels Production","264492808":"Characterizing uncertainty in expert assessments: Ozone depletion and the West Antarctic ice sheet","242469566":"Global Change Management: ein neuer internationaler Master Studiengang (M.Sc.)","253720528":"Model Uncertainty in a Mesoscale Ensemble Prediction System: Stochastic versus Multiphysics Representations","271204603":"qj2319","236338887":"Climate Considerations in Long-Term Safety Assessments for Nuclear Waste Repositories","216812605":"Tropical forests and the changing earth system","51216351":"Discriminating between climate observations in terms of their ability to improve an ensemble of climate predictions","257548170":"Impacts of climate change on crop evapotranspiration with ensemble GCM projections in the North China Plain","45793902":"Constraining uncertainty in regional hydrologic impacts of climate change: Nonstationarity in downscaling","235961029":"Inter-relationships between adaptation and mitigation","237843188":"Nonglobal Parameter Estimation Using Local Ensemble Kalman Filtering","257548164":"On the estimation of systematic error in regression-based predictions of climate sensitivity","23536057":"A new global deal on climate change","277908597":"FAT-TAILED UNCERTAINTY, LEARNING, AND CLIMATE POLICY","222528943":"Temperature response of C4 species big bluestem (Andropogon gerardii) is modified by growing carbon dioxide concentration","228409712":"Use of models in detection and attribution of climate change","45695574":"Impact of Climate Change on Ambient Ozone Level and Mortality in Southeastern United States","228799825":"Representing model uncertainty in weather and climate prediction. Annu. Rev. Earth Planet. Sci. 33: 163-193","228791633":"Growth scenarios for EU \u0026 UK aviation: contradictions with climate policy","41570952":"Global Climate Projections","253727723":"Evaluating climate model performance with various parameter sets using observations over the recent past","273836196":"An appraisal of downscaling methods used in climate change research: An appraisal of downscaling methods","236886758":"Impact of Global Warming on the Health, Welfare and Productivity of Intensively Housed Livestock","253644774":"Communicating probabilistic information from climate model ensembles—lessons from numerical weather prediction","230738234":"Precipitation-driven carbon balance controls survivorship of desert biocrust mosses. Ecology","228353376":"Assessing Reservoir Operations Risk Under Climate Change","222567867":"The effect of climate change on crop wild relatives. Agric Ecosyst Environ","49759223":"Constraints and Barriers to Public Health Adaptation to Climate Change A Review of the Literature","227990677":"HRMS: Hybrid Runtime Management Strategies for Large‐Scale Parallel Adaptive Applications","41940855":"The Effects of Temperature Stress on the Quality and Yield of Soya Bean [(Glycine max L.) Merrill.]","259543666":"A Semiparametric Multivariate, Multisite Weather Generator with Low-Frequency Variability for Use in Climate Risk Assessments","232650966":"An Inframarginal Analysis Based Resource Allocation Method in Volunteer Computing","227633309":"Addressing model uncertainty in seasonal and annual dynamical ensemble forecasts","260740743":"Bayesian estimation of climate sensitivity based on a simple climate model fitted to observations of hemispheric temperature and global ocean heat content","237442858":"Peng, Y., S. C. Thomas, and D. Tian. Forest management and soil respiration: implications for carbon sequestration. Environmental Reviews","227988635":"The SCIJump Framework for Parallel and Distributed Scientific Computing","236307226":"Changing the Climate Sensitivity of an Atmospheric General Circulation Model through Cloud Radiative Adjustment","257411651":"Origins of differences in climate sensitivity, forcing and feedback in climate models. Clim Dyn","287107080":"Climate Change and Food Security in Kano Nigeria: A Model for Sustainable Food Production","259512931":"Fishes and fisheries in tropical estuaries: The last 10 years","228668598":"Discriminating robust and non-robust atmospheric circulation responses to global warming. J Geophys Res 112, D20121","23668862":"The climateprediction.net BBC climate change experiment: Design of the coupled model ensemble","225812578":"Weighting of model results for improving best estimates of climate change","220389434":"Using machine learning to predict catastrophes in dynamical systems","252266001":"Paola, C. et al. Toward a unified science of the Earth\u0027s surface: Opportunities for synthesis among hydrology, geomorphology, geochemistry, and ecology. Wat. Resour. Res. 42, doi:doi:10.1029/2005WR004336","260742802":"Improving the Contribution of Climate Model Information to Decision Making: The Value and Demands of Robust Decision Framework","230981854":"Global Warming","46534621":"Climate change and poverty in Africa: mapping hotspots of vulnerability. Afr J Agric Res 2:24-44","50828827":"Emulating coupled atmosphere-ocean and carbon cycle models with a simpler model, MAGICC6 - Part 1: Model description and calibration. Atmos Chem Phys","258499189":"Multi-parameter multi-physics ensemble (MPMPE): A new approach exploring the uncertainties of climate sensitivity","282898881":"Recent Progress in Constraining Climate Sensitivity With Model Ensembles","265247465":"Agricultural Management Effects on Soil Microbial Dynamic Under Peanut Cropping Systems in Semi-Arid Soil","6489418":"Influence of temperature and humidity on rumen bacterial diversity in Holstein heifers","234531025":"Aerosol indirect effects on clouds and global climate","222115856":"Future desertification and climate change: The need for land-surface system evaluation improvement","229206148":"Quantifying Uncertainty in Model Predictions for the Pliocene (Plio-QUMP): Initial results","225631325":"Response to the eruption of Mount Pinatubo in relation to climate sensitivity in the CMIP3 models","235640612":"How Well Do Coupled Models Simulate Today\u0027s Climate?","277655999":"Addressing Interdependency in a Multimodel Ensemble by Interpolation of Model Properties","270477610":"Pollen-Based Screening of Soybean Genotypes for High Temperatures","7270747":"Eliciting Information from Experts on the Likelihood of Rapid Climate Change","229691527":"Understanding the local and global impacts of model physics changes: An aerosol example","43508653":"Escaping the heat: Range shifts of reef coral taxa in coastal Western Australia","278636965":"Configuration and assessment of the GISS ModelE2 contributions to the CMIP5 archive. J Adv Model Earth Syst (submitted)","228624609":"Precipitation downscaling under climate change: Recent developments to bridge the gap between dynamical models and the end user. Rev Geophys 48(3):RG3003","229122281":"Assessing model-based and conflict-based uncertainty. Global Environ Change","270339416":"Parameter Estimation Using Ensemble Based Data Assimilation in the Presence of Model Error","235917126":"Linking Climate Change Modeling to Impacts Studies: Recent Advances in Downscaling Techniques for Hydrological Modeling","237222762":"Climate Change, Kosovo Energy Scenarios and CO2 Reduction toward Sustainable Development","279555552":"Deforestation in Amazonia: Dynamics, impacts and control [Desmatamento na Amazônia: Dinâmica, impactos e controle]","233574567":"Long-term goals and post-2012 commitments: Where do we go from here with climate policy?","228892904":"Regional probabilistic climate forecasts from a multithousand, multimodel ensemble of simulations","259762741":"Tall tales and fat tails: the science and economics of extreme warming","240968460":"Global warming: Take action or wait?","258278965":"Nonlinear Parameter Estimation: Comparison of an Ensemble Kalman Smoother with a Markov Chain Monte Carlo Algorithm","224986168":"A review on reflective remote sensing and data assimilation techniques for enhanced agroecosystem modeling","250765217":"SZTAKI Desktop Grid - a Hierarchical Desktop Grid System","225775649":"Risk-Based Reanalysis of the Effects of Climate Change on U.S. Cold-Water Habitat","23281719":"Facing future climate change: Is the past relevant?","257524237":"Assessing climate model projections: State of the art and philosophical reflections","258662975":"Objective calibration of regional climate models","225369147":"Fingerprinting Global Climate Change and Forest Management Within Rhizosphere Carbon and Nutrient Cycling Processes","226876626":"The contribution of timescales to the temperature response of climate models","51116636":"Spectral estimation of global levels of atmospheric pollutants","249612217":"Structural Similarities and Differences in Climate Responses to CO2 Increase between Two Perturbed Physics Ensembles","228508864":"The Freshening of Surface Waters in High Latitudes: Effects on the Thermohaline and Wind-Driven Circulations","252876364":"Modeling Northern Hemisphere Summer Heat Extreme Changes and Their Uncertainties Using a Physics Ensemble of Climate Sensitivity Experiments","228813052":"The myth of dangerous human-caused climate change","228655297":"Performance metrics for climate models. J Geophys Res-Atmos 113:D06104","262687434":"A lower and more constrained estimate of climate sensitivity using updated observations and detailed radiative forcing time series","51829374":"Response to Comment on \"Climate Sensitivity Estimated from Temperature Reconstructions of the Last Glacial Maximum\"","249616265":"Methods and Resources for Climate Impacts Research","256095786":"How robust are global conservation priorities to climate change?","253502070":"Relearning Humility in a Time of Climate Change","225315844":"Climate Response Uncertainty and the Benefits of Greenhouse Gas Emissions Reductions","237710144":"Everybody wins: challenges and promises of knowledge discovery through volunteer computing","265260706":"Equipped to deal with uncertainty in climate and impacts predictions: lessons from internal peer review","222513198":"Towards Prediction of Decadal Climate Variability and Change","240049952":"Innovations for Grid Security from Trusted Computing | Protocol Solutions to Sharing of Security Res","8150290":"“Beyond the Ivory Tower: The Scientific Consensus on Climate Change","223544381":"Climate: past ranges and future changes. Quat Sci Rev","6197552":"Association of parameter, software, and hardware variation with large-scale behavior across 57,,000 climate models","257411640":"Decadal prediction skill in a multi-model ensemble","225725444":"Probability distributions for carbon emissions and atmospheric response","255573578":"Probabilistic prediction of climate using multi-modelensembles:frombasicst oapplications","226634993":"Detecting change in UK extreme precipitation using results from the climateprediction.net BBC Climate Change Experiment","248814499":"Uncertainty in continental-scale temperature predictions","222691390":"An atmosphere–ocean time series model of global climate change","43155434":"The role of sea-level rise and the Greenland ice sheet in dangerous climate change: Implications for the stabilisation of climate","259708419":"Whose Probabilities? Predicting Climate Change with Ensembles of Models","238533450":"Global impacts of abrupt climate change: an initial assessment","272296260":"Assessing climate change impacts on the rape stem weevil, Ceutorhynchus napi Gyll., based on bias- and non-bias-corrected regional climate change projections","236444520":"America\u0027s Climate Choices: Adapting to the Impacts of Climate Change","227657745":"Linear and non-linear response to parameter variations in a mesoscale model. Tellus A","225956087":"The sensitivity of the meridional overturning circulation to modelling uncertainty in a perturbed physics ensemble without flux adjustment","230258745":"Modelling Climate Change Impacts for Adaptation Assessments","237669291":"Robust Bayesian Uncertainty Analysis of Climate System Properties Using Markov Chain Monte Carlo Methods","234081394":"From Climate Model Ensembles to Climate Change Impacts and Adaptation: A Case Study of Water Resource Management in the Southwest of England","259084019":"Comments on ``New Approach to Calculation of Atmospheric Model Physics: Accurate and Fast Neural Network Emulation of Longwave Radiation in a Climate Model\u0027\u0027","41571320":"Quantifying the effects of perturbing the physics of an interactive sulfur scheme using an ensemble of GCMs on the climateprediction.net platform","46497607":"System economics: Overcoming the pitfalls of forecasting models via a multidisciplinary approach","228647972":"Making and Marketing Carbon Dumps: Commodification, Calculation and Counterfactuals in Climate Change Mitigation","226231544":"Climate Protection vs. Economic Growth as a False Trade Off Restructuring Global Warming Mitigation","222151865":"Principle of the worst scenario in the modelling past and future of biosphere dynamics","227584021":"The benefits of quantifying climate model uncertainty in climate change impacts assessment: an example with heat-related mortality change estimates. Clim Change","234148977":"Feedbacks, Timescales, and Seeing Red","44016406":"Using tracer observations to reduce uncertainty of ocean diapycnal mixing and climate-carbon cycle projections","224949473":"Perspectives of plant-associated microbes in heavy metal phytoremediation. Biotechnol Adv","235370380":"Climate change driven plant-metal-microbe interactions","282538329":"Uncertain eigenvalue analysis by the sparse grid stochastic collocation method","253859502":"ROBUSTNESS AND UNCERTAINTIES OF CLIMATE CHANGE PREDICTIONS","266564204":"Stochastic Climate Theory and Modeling","240641988":"Networking the Infrastructure of Coastal Laboratories","237635518":"affect our perceptions and behaviour?","271523259":"Regional Climate Change in Central Brazil","240729039":"Future options in landscape ecology: Development and research","263074361":"Larger variability, better predictability?","255622820":"Floresta Amazônica e Clima","250139507":"Climate Scenarios and Decision Making under Uncertainty","258646769":"Quantifying uncertainty in future Southern Hemisphere circulation trends","226800664":"Albedo Enhancement by Stratospheric Sulfur Injections: A Contribution to Resolve a Policy Dilemma?","29626457":"Towards Integrated Environmental Models of Everywhere: Uncertainty, Data and Modeling as a Learning Process","260572693":"Can Top-of-Atmosphere Radiation Measurements Constrain Climate Predictions? Part II: Climate Sensitivity","23180543":"Why Is the Choice of Future Climate Scenarios for Species Distribution Modelling Important?","235235236":"Erosion of Lizard Diversity by Climate Change and Altered Thermal Niches","241331139":"Future changes in European winter storm losses and extreme wind speeds inferred from GCM and RCM multi-model simulations. Nat Hazard Earth Syst Sci","259507926":"Values and Uncertainties in Climate Prediction, Revisited","225859795":"“The Potential to Narrow Uncertainty in Projections of Regional Precipitation Change","260503075":"An analysis of multi-model ensembles for seasonal climate predictions","45461267":"Global hydrology modelling and uncertainty: Running multiple ensembles with a campus grid","222579938":"The economics of climate change and the change of climate in economics","252053166":"Falsification Of The Atmospheric CO2 Greenhouse Effects Within The Frame Of Physics","6211063":"Climate change - A changing climate for prediction","222896354":"Multispectral imaging contributions to global land ice measurements from space","257850098":"The biosphere trigger mechanism in the minimal model for the global carbon cycle of the Earth","42799904":"A probabilistic calibration of climate sensitivity and terrestrial carbon change in GENIE-1","7610842":"Probabilistic assessment \"dangerous\" climate change and emissions pathways","6710728":"Feasibility of cooling the Earth with a cloud of small spacecraft near the inner Lagrange point (L1). Proc Natl Acad Sci USA","30465120":"Development.","240809963":"Use of multi-model ensembles from global climate models for assessment of climate change impacts. Clim Res","272826865":"Projected increases in near-surface air temperature over Ontario, Canada: A regional climate modeling approach","240579557":"Quantifying uncertainty, interpreting ensembles and combining models with process understanding","241600469":"A new method for probabilistic assessment of regional climate impacts in dependence of cumulative GHG emission budgets","227618853":"Aerosol‐cloud‐climate interactions in the climate model CAM‐Oslo","265821804":"ASSESSMENT OF MODELLING UNCERTAINTIES IN LONG-TERM CLIMATE AND SEA LEVEL CHANGE PROJECTIONS « ASTER »","240687086":"Analyzing the Climate Sensitivity of the HadSM3 Climate Model Using Ensembles from Different but Related Experiments","238735245":"The Reliability of Future Climate Change Projection by High-Resolution Climate Models","40795097":"Parameter sensitivity of climate models and climate driven ecological systems","227700773":"The US Air Force Weather Agency\u0027s mesoscale ensemble: Scientific description and performance results","233811029":"A surface mass balance model for the Greenland Ice Sheet","44227353":"Changes in the Global Sulfate Burden due to Perturbations in Global CO 2 Concentrations","233570384":"Impacts of environmental change and direct and indirect harvesting effects on the dynamics of a marine fish community","288160915":"PALEOCLIMATE RELEVANCE TO GLOBAL WARMING","255723263":"Using the UKCP09 probabilistic scenarios to model the amplified impact of climate change on river basin sediment yield","223834257":"Climate dynamics and fluid mechanics: Natural variability and related uncertainties","259709628":"When Climate Models Agree: The Significance of Robust Model Predictions","24053927":"Adaptive management of energy transitions in long-term climate change","227991646":"Managing Complexity in Massively Parallel, Adaptive, Multiphysics Finite Element Applications","258738852":"Cloud-Aerosol-Radiation (CAR) ensemble modeling system","5147008":"Certainty and Uncertainty in Climate Change Predictions: What Use are Climate Models?","5142913":"Introducing BACCO, an R Bundle for Bayesian Analysis of Computer Code Output","253280971":"Constraints on Climate Sensitivity from Radiation Patterns in Climate Models","224330892":"Using Neural Network Emulations of Model Physics in Numerical Model Ensembles","228647027":"The social cost of carbon: Valuation estimates and their use in UK policy.","277655903":"A Representative Democracy to Reduce Interdependency in a Multimodel Ensemble","222703762":"Climate change and the new world economy: Implications for the nature and timing of policy responses","288586983":"How Climate Change Impacts the Role of the CFO","273036691":"Economic analysis of adaptive strategies for flood risk management under climate change","257547905":"Climate sensitivity: Should the climate tail wag the policy dog?","249612089":"Relations between Northward Ocean and Atmosphere Energy Transports in a Coupled Climate Model","215899399":"Optimal tuning of a GCM using modern and glacial constraints","227311696":"Challenges posed by and approaches to the study of seasonal-to-decadal climate variability. Clim Change","230688797":"Tuning the climate of a global model","225394866":"Underdetermination, Model-ensembles and Surprises: On the Epistemology of Scenario-analysis in Climatology","249611070":"The Effect of Ocean Dynamics and Orography on Atmospheric Storm Tracks","237843443":"Migratory connectivity magnifies the consequences of habitat loss from sea-level rise for shorebird populations","283035905":"Insights into low-latitude cloud feedbacks from high-resolution models","257407670":"Evaluation of grid-point atmospheric model of IAP LASG version 2 (GAMIL2)","221999320":"Impacts of climatic change upon geographical distributions of birds","230821926":"Fire risk in Amazonia due to climate change in the HadCM3 climate model","230889515":"Temperature–Moisture Dependence of the Deep Convective Transition as a Constraint on Entrainment in Climate Models","23283850":"ChemInform Abstract: In-silico Investigations in Heterogeneous Catalysis—Combustion and Synthesis of Small Alkanes","252133098":"Ten Reasons Why Climate Change May be More Severe than Projected1","237604807":"Centre for Philosophy of Natural and Social Science Contingency and Dissent in Science","276242823":"Variations of Macro-compounds in Cyanobacterium, Thermosynchococcus elongatus CL-1 Under Various Nutrients","278042978":"Interactions of HIV-1 proteins as targets for developing anti-HIV-1 peptides","227369087":"Spatial Analysis to Quantify Numerical Model Bias and Dependence: How Many Climate Models Are There?","238451650":"Non-linear regional relationships between climate extremes and annual mean temperatures in model projections for 19612099 over Europe","234101761":"Assessment of future Nile flow through an ensemble of RCM simulations","48911133":"High impact, low probability? An empirical analysis of risk in the economics of climate change. Clim Chang","226457736":"Toward Constraining Climate Sensitivity by Linear Analysis of Feedback Patterns in Thousands of Perturbed-Physics GCM Simulations","231181375":"Guidelines for Constructing Climate Scenarios","252975855":"Estimates of Uncertainty in Predictions of Global Mean Surface Temperature","237231071":"Evaluating Global Warming Potentials as Historical Temperature Proxies: an","225518733":"Coping Strategies in Livestock-Dependent Households in East and Southern Africa: A Synthesis of Four Case Studies","260673140":"Sensitivity of the regional climate model RegCM4.2 to planetary boundary layer parameterisation","251763454":"A cardiac output estimation model with a neural network-toward total artificial heart control","248056009":"The Cost of Using Global Warming Potentials: Analysing the Trade off Between CO 2 , CH 4 and N 2 O","282566358":"Methods and Future Directions for Paleoclimatology in the Maya Lowlands","236616728":"State-based predictions with self-correction on Enterprise Desktop Grid environments","228482973":"Climate change uncertainty for daily minimum and maximum temperatures: A model inter-comparison","263114155":"The end of model democracy?: An editorial comment","273390158":"Parametric sensitivity analysis of precipitation at global and local scales in the Community Atmosphere Model CAM5","232858598":"Skill Assessment of Seasonal Hindcasts from the Canadian Historical Forecast Project","259708285":"Adaptation to Global Warming: Do Climate Models Tell Us What We Need to Know?","282388179":"Evaluation of a Regional Climate Modeling Effort for the Western United States Using a Superensemble from Weather@home","238622769":"SPECIAL PROJECT INTERIM REPORT SPNOGEPS","273328706":"A Practical Philosophy of Complex Climate Modelling","237804581":"FINAL REPORT PHASE I","262538667":"Comparing climate change impacts on cereals based on CMIP3 and EU-ENSEMBLES climate scenarios. Agric For Meteorol 195-196:12-23","236340248":"An Integrated Assessment Framework for Uncertainty Studies in Global and Regional Climate Change: The IGSM-CAM","45658295":"Stratospheric water vapour and high climate sensitivity in a version of HadSM3 climate model. Atmos Chem Phys Discuss","227675037":"Use of models in detection and attribution of climate change. WIREs Clim Chang 2:570-591","45161635":"Associations between elevated atmospheric temperature and human mortality: A critical review of the literature","258796921":"Obtaining diverse behaviors in a climate model without the use of flux adjustments","245449911":"Multiparameter uncertainty analysis of a bifurcation point","38004820":"Constraining Climate Model Parameters from Observed 20th Century Changes","251771165":"Constraints on Model Response to Greenhouse Gas Forcing and the Role of Subgrid-Scale Processes","258660726":"Selecting Ensemble Members to Provide Regional Climate Change Information","242599016":"Global Warming FAQ: What Every Citizen Needs to Know About Global Warming","230676386":"SETI@home, BOINC, and volunteer distributed computing","240689273":"The Ocean–Land–Atmosphere Model: Optimization and Evaluation of Simulated Radiative Fluxes and Precipitation","269232685":"Climate change - It\u0027s all about probability","23781199":"Components of uncertainty in species distribution analysis: a case study of the Great Grey Shrike Lanius excubitor L","226763682":"Probabilistic Inference for Future Climate Using an Ensemble of Climate Model Evaluations","242579538":"Data access and analysis with distributed federated data servers in Climateprediction.net","227604408":"Using numerical weather prediction to assess climate models. Q J R Meteorol Soc","241129590":"Photovoltaic Reliability in Telecommunications","226930607":"Climate Models and Their Projections of Future Changes","2245128":"MIT Joint Program on the Science and Policy of Global Change","227634109":"A Review of Climate Risk Information for Adaptation and Development Planning","225704797":"Bayesian multi-model projection of climate: bias assumptions and interannual variability. Clim Dyn","251674929":"PW1-4 Diversity in gamma and beta rhythm-generating local circuits in neocortex","226967477":"A scenario of European climate change for the late 21st century: seasonal means and interannual variability. Clim Dyn","243493041":"Resource Letter GW2: Global Warming","234058688":"On Constraining Estimates of Climate Sensitivity with Present-Day Observations through Model Weighting","225626951":"North Atlantic Oscillation response to transient greenhouse gas forcing and the impact on European winter climate: a CMIP2 multi-model assessment. Clim Dyn","260947384":"The climatic effects of modifying cirrus clouds in a climate engineering framework","236007462":"Developing regional climate change scenarios for use in assessment of effects on human health and disease. Clim Res","245118123":"Numerical simulation to UV coherent harmonic radiation on Hefei storage-ring FEL1","237776916":"There are 9 oral and 6 poster presentations which addressed such topics as decadal prediction, uncertainty, regional downscaling and impact assessment relevant to climate projections in the near-term future. Here we summarize points of the session mainly based on oral presentations and associated discussions","232793048":"A sensitive subject","262493597":"Trend analysis and uncertainties of mean surface air temperature, precipitation and extreme indices in CMIP3 GCMs in Distrito Federal, Brazil","233727959":"Advanced Methods for Decision Making and Risk Management in Sustainability Science","263299467":"Towards the probabilistic Earth-system simulator: A vision for the future of climate and weather prediction","274655844":"Uncertainties in Global Warming Projection","237828119":"Losing Ground: Western National Parks Endangered by Climate Disruption","251111607":"Future Climate Predictions for Lochnagar","46538887":"A smoothing algorithm for estimating stochastic, continuous time model parameters and its application to a simple climate model","263017964":"Toward enhanced understanding and projections of climate extremes using physics-guided data mining techniques","239351808":"Water and Soil Resources Response to Rising Levels of Atmospheric CO2 Concentration and to Changes in Precipitation and Air Temperature","228727782":"Climate change and the global knowledge economy: an immediate challenge","24192820":"Temperature-dependent sex determination and global change: are some species at greater risk?","260356545":"Estimation of optimal gravity wave parameters for climate models using data assimilation","6410790":"Identification and Characteristics of a Cyanobacterium Isolated from a Hot Spring with Dissolved Inorganic Carbon","7340602":"Multi-agent modelling of climate outlooks and food security on a community garden scheme in Limpopo, South Africa. Philosophical Transactions of The Royal Society of London Series B-Biological Sciences","23283497":"Should we believe model predictions of future climate change? Philos T R Soc A","251231411":"Identifying uncertainties in Arctic climate change projections","51630431":"Developing higher resolution climate change scenarios for agricultural risk assessment: Progress, challenges and prospects","251067579":"Adaptation of agricultural crop production to climate change: A policy framework for Sri Lanka","231064459":"Use of Bayesian inference and data to improve simulations of multi-physics climate phenomena","248552607":"Conceptual framework for assessment and management of ecosystem impacts of climate change","4211216":"The challenge of volunteer computing with lengthy climate model simulations","226558928":"Descriptive or Conceptual Models? Contributions of Economics to the Climate Policy Debate","227635143":"The evolution of crypsis in replicating populations of web‐based prey","228363204":"Climate change on the millennial timescale","225119027":"Innovations for Grid Security from Trusted Computing","258625842":"A robust framework for probabilistic precipitations downscaling from an ensemble of climate predictions applied to Switzerland","27704319":"Climate Change and the Precautionary Principle","7340587":"Probabilistic Prediction of Climate Using Multi-Model Ensembles: From Basics to Applications","225813294":"Multivariate Probabilistic Projections Using Imperfect Climate Models. Part II: Robustness of Methodological Choices and Consequences for Climate Sensitivity","7340588":"Aspects of climate change prediction relevant to crop productivity","46538904":"Statistical calibration of climate system properties","250306741":"Uncertainty quantification and parameter tuning in the CAM5 Zhang-McFarlane convection scheme and impact of improved convection on the global circulation and climate","254451061":"A method for incorporating climate variability in climate change impact assessments: Sensitivity of river flows in the Eden catchment to precipitation scenarios","233454478":"Sensitivity of Recreational Access to Reservoir Water Level Variation: An Approach to Identify Future Access Needs in Reservoirs","226247449":"Sources of uncertainty in global modelling of future soil organic carbon storage","26639344":"Emulating IPCC AR4 atmosphere-ocean and carbon cycle models for projecting global-mean, hemispheric and land/ocean temperatures: MAGICC 6.0","288920415":"Estimation of convective entrainment properties from a cloud-resolving model simulation during TWP-ICE","227593208":"Deep Geological CO 2 Storage: Principles Reviewed, and Prospecting for Bio-energy Disposal Sites","225146625":"Downscaling of South America present climate driven by 4-member HadCM3 runs","226856937":"On Selected Issues and Challenges in Dendroclimatology","227585023":"Data‐Directed Importance Sampling for Climate Model Parameter Uncertainty Estimation","227725282":"Climate-carbon cycle feedbacks under stabilization: Uncertainty and observational constraints","227412988":"Foxes, hedgehogs, and greenhouse governance: Knowledge, uncertainty, and international policy-making in a warming World","236184678":"Stochastic parametrizations and model uncertainty in the Lorenz \u002796 system","242209817":"Climate sensitivity of a general circulation model with different cloud modelling assumptions","24113943":"Global Warming: Forecasts by Scientists Versus Scientific Forecasts","225331990":"Towards Quantifying Uncertainty in Transient Climate Change","227988459":"Plane Wave Seismic Data: Parallel and Adaptive Strategies for Velocity Analysis and Imaging","240687141":"Challenges in Combining Projections from Multiple Climate Models","272826940":"High-Resolution Probabilistic Projections of Temperature Changes over Ontario, Canada","263127504":"The impact of astronomical forcing on the Late Devonian greenhouse climate","230734656":"Recent Fire Regime in Peninsular Spain in Relation to Forest Potential Productivity and Population Density","241972462":"Some Issues in Uncertainty Quantification and Parameter Tuning: A Case Study of Convective Parameterization Scheme in the WRF Regional Climate Model","242730228":"C\u0027est la Nature, Et non l\u0027Activité Humaine Qui détermine le Climat","259542524":"Impact of analyses on the dynamical balance of global and limited-area atmospheric models","216301153":"Evolutionary Agent-Based Policy Analysis in Dynamic Environments","258786793":"An efficient method to generate a perturbed parameter ensemble of a fully coupled AOGCM without flux-adjustment","41571580":"The Potential to Narrow Uncertainty in Regional Climate Predictions","258495983":"The Influence of the Cloud Shell on Tracer Budget Measurements of LES Cloud Entrainment","230307634":"Global Warming","258786789":"Failure analysis of parameter-induced simulation crashes in climate models","256401859":"Uncertainty in seasonal climate projection over Tamil Nadu for 21st century","278710807":"Markov Chain Monte Carlo Methods: Theory and Applications","225362914":"On several issues regarding efforts toward a sustainable society","23271406":"Web-based applications for building, managing and analysing kinetic models of biological systems","29596494":"Why climate sensitivity may not be so unpredictable. Geophys Res Lett 36, L16707","235431045":"Insufficient forcing uncertainty underestimates the risk of high climate sensitivity","23423988":"Phytolacca americana from Contaminated and Noncontaminated Soils of South Korea: Effects of Elevated Temperature, CO2 and Simulated Acid Rain on Plant Growth Response","284826216":"Role of integrated assessment and scenario development issues beyond SRES","228654898":"Comparative Impact of Climatic and Nonclimatic Factors on Global Terrestrial Carbon and Water Cycles","228425486":"The value of protected areas in avoiding climate change in Amazonia","225567719":"Carbon cycle–climate feedback sensitivity to parameter changes of a zero-dimensional terrestrial carbon cycle scheme in a climate model of intermediate complexity","223847360":"The Late Cretaceous continental interior of Siberia: A challenge for climate models","233607028":"Testing the use of adjoints for parameter estimation in a simple GCM on climate time-scales","239923412":"Time Variation of Effective Climate Sensitivity in GCMs","23725046":"The Economics of Climate Change","26804996":"Indicators on Economic Risk from Global Climate Change","252019109":"G LOBAL C LIMATE C HANGE AND THE C HURCH IN THE M ODERN W ORLD : A S IGN OF THE T IMES","225778645":"A summary of the PRUDENCE model projections of changes in European climate by the end of this century. Clim Chang","241478853":"Constraining Climate Sensitivity from the Seasonal Cycle in Surface Temperature","227780402":"Emissions targets for CO2 stabilization as modified by carbon cycle feedbacks","237843599":"Probabilistic accounting of uncertainty in forecasts of species distributions under climate change","277294627":"STAFF FINAL PAPER DISCLAIMER","229062403":"Seasonal and Decadal Prediction","254249346":"Effect of inoculation with a thermotolerant plant growth promoting Pseudomonas putida strain AKMP7 on growth of wheat (Triticum spp.) under heat stress","236623036":"ENSEMBLES-based assessment of regional climate effects in Luxembourg and their impact on vegetation","262950154":"Climate projections of future extreme events accounting for modelling uncertainties and historical simulation biases","235431072":"Evaluating Global Warming Potentials with historical temperature","260333870":"Attribution of observed historical near‒surface temperature variations to anthropogenic and natural causes using CMIP5 simulations","226610995":"Uncertainty, rationality and cooperation in the context of climate change","30504803":"The Perception and Valuation of the Risks of Climate Change: A Rational and Behavioral Blend","272403086":"Nonlinear Ensemble Parameter Perturbation for Climate Models","229077779":"An assessment of model parametric uncertainties in projections of Greenland Ice Sheet behavior","237478034":"Discussion of reified Bayesian modelling and inference for physical systems","262053160":"Plant functional types in Earth System Models: past experiences and future directions for application of dynamic vegetation models in high-latitude ecosystems","227662633":"Assessment of Cold and Heat Tolerance of Winter‐grown Canola (Brassica napus L.) Cultivars by Pollen‐based Parameters","252962218":"Climate prediction: a limit to adaptation?","225630152":"Climate sensitivity estimated from ensemble simulations of glacial climate. Clim. Dyn. 27: 149-163","233985865":"A Simple Spatial Model Exploring Positive Feedbacks at Tropical Alpine Treelines","215877221":"Atmospheric Predictability","235615408":"Higher trends but larger uncertainty and geographic variability in 21st century temperature and heat waves","49611848":"A comparative analysis of projected impacts of climate change on river runoff from global and catchment-scale hydrological model","226945851":"Photosynthesis and fluorescence responses of C4 plant Andropogon gerardii acclimated to temperature and carbon dioxide","263127314":"Dealing with uncertainty in ecosystem model scenarios: Application of the single-model ensemble approach","242461874":"Education for Sustainable Development and the Question of Balance: Lessons from the Pacific","5507733":"Amazon Forest maintenance as a source of environmental services","258564520":"Projections of mid-century summer air-quality for North America: Effects of changes in climate and precursor emissions","228767584":"Industrial Engineering Needs a Sustainable Orientation","281205249":"Environmental Modelling \u0026 Software","226151358":"Katsman, C. A., Hazeleger, W., Drijfhout, S. S., van Oldenborgh, G. J. \u0026 Burgers, G. Climate scenarios of sea level rise for the northeast Atlantic Ocean: a study including the effects of ocean dynamics and gravity changes induced by ice melt. Climatic Change 91, 351-374","7263914":"Changes in Surface Water Supply Across Africa With Predicted Climate Change","226458554":"The impact of perturbations to ocean-model parameters on climate and climate change in a coupled model","256665995":"The Early Eocene equable climate problem: can perturbations of climate model parameters identify possible solutions?","222574477":"Screening Capsicum Species of different origins for high temperature tolerance by in vitro pollen germinatioin and pollen tube length","229717880":"Hotter or not? Should we believe model predictions of future climate change?","222709645":"Ensemble Forecasting","43155526":"Constraining climate forecasts: the role of prior assumptions. Geophys Res Lett 32:L09702","200471846":"REVIEW ARTICLE How Well Do We Understand and Evaluate Climate Change Feedback Processes?","49643552":"Considerations for parameter optimization and sensitivity in climate models","252501466":"Comment on ``Heat capacity, time constant, and sensitivity of Earth\u0027s climate system\u0027\u0027 by S. E. Schwartz","226965329":"Uncertainty and risk in climate projections for the 21st century: Comparing mitigation to non-intervention scenarios","226184099":"Global Warming: How Much of a Threat to Tropical Forests?","6319800":"Andreae, M. O. Atmospheric aerosols versus greenhouse gases in the twenty-first century. Phil. Trans. R. Soc. A 365, 1915-1923","229926760":"Choice of predictor variables as a source of uncertainty in continental‐scale species distribution modelling under climate change","264118624":"Forest soil decomposition and its contribution to heterotrophic respiration: A case study based on Canada","227980150":"Quantum Chromodynamics on the BlueGene/L Supercomputer","6328961":"Irreducible imprecision in atmospheric and oceanic simulations. Proc Natl Acad Sci U S A","251425816":"Yokohata, T. et al. Climate response to volcanic forcing: Validation of climate sensitivity of a coupled atmosphere-ocean general circulation model. Geophys. Res. Lett. 32, L21710","6924941":"A batch study on the bio-fixation of carbon dioxide in the absorbed solution from a chemical wet scrubber by hot spring and marine algae","228723527":"Reliability of multi-model and structurally different single-model ensembles","5882547":"Why Is Climate Sensitivity So Unpredictable?","264456488":"Probabilistic Climate Scenarios May Misrepresent Uncertainty and Lead to Bad Adaptation Decisions","230834985":"The effects of climate change on tropical birds. Biol Conserv","261630323":"Ostrich recruitment dynamics in relation to rainfall in the Mara–Serengeti ecosystem","233389829":"Using stochastic simulation to evaluate competing risks of wildfires and fuels management on an isolated forest carnivore","230624081":"The Runaway Greenhouse: implications for future climate change, geoengineering and planetary atmospheres","241396882":"Climate Change in California: Scenarios for Adaptation","26451808":"Linking glacial and future climates through an ensemble of GCM simulations","265252155":"Stochastic Climate Theory and Modelling","289100749":"Climate Change","258564510":"Projections of mid-century summer air-quality for North America: effects of changes in climate and precursor emissions","228624216":"Alternative to stabilization scenarios","222343098":"Impact of nonlinearities and model error on pseudo-inverse calculations","251426817":"Climate model genealogy","258612628":"Perturbed physics ensemble using the MIROC5 coupled atmosphere-ocean GCM without flux corrections: experimental design and results","1902364":"A Differential Delay Model of ENSO Variability: Parametric Instability and the Distribution of Extremes, Nonlin Processes Geophys","227788437":"Where will species go? Incorporating new advances in climate modeling into projections of species distributions. Glob Chang Biol 13:1368-1385","248815068":"Tropical vertical temperature trends: A real discrepancy?","27709101":"Uncertainty and Climate Change Adaptation—a Scoping Study","230265525":"The tropical frontier in avian climate impact research","253913134":"Sensitivity of Twentieth-Century Sahel Rainfall to Sulfate Aerosol and CO2Forcing","257549396":"Managing uncertainty in integrated environmental modelling: The UncertWeb framework","7552893":"Oxygen-induced reperfusion-injury is caused by ROS: Amelioration is possible by recombinant-DNA antioxidant enzymes and mimics in selected tissues","200471805":"Freshwater resources and their management","257408071":"Examination of climate risk using a modified uncertainty matrix framework—Applications in the water sector","252934145":"Community Memories for Sustainable Societies","233594623":"The social cost of carbon: what does it actually depend on? Climate Policy","251441647":"Assessing the Uncertainty in Tropical Cyclone Simulations in NCAR\u0027s Community Atmosphere Model","228848309":"Probabilistic climate change projections for CO2 stabilization profiles","257408065":"Climate Change Prediction: Erring on the Side of Least Drama?","237536561":"The potential of currents for environmental management of the Baltic Sea maritime industry","242550122":"Predicting future climate change: lessons from palaeoclimatology","271924010":"Simulating weather regimes: impact of stochastic and perturbed parameter schemes in a simple atmospheric model","261675192":"Linking climate projections to performance: A yield-based decision scaling assessment of a large urban water resources system","259539033":"Efficient screening of climate model sensitivity to a large number of perturbed input parameters","241412417":"Compensation between Model Feedbacks and Curtailment of Climate Sensitivity","225405517":"Importance of colonization and competition in forest landscape response to global climatic change. Climatic Change, 110, 53-83","222685793":"Policy Instruments for Evolution of Bounded Rationality: Application to Climate-Energy Problems","253937671":"Effectiveness of stratospheric solar-radiation management as a function of climate sensitivity","226246228":"Comparison of Uncertainty Sources for Climate Change Impacts: Flood Frequency in England","241031540":"Climate change impact and runoff harvesting in arid regions","227417764":"Validation and forecasting accuracy in models of climate change. Int J Forecast","45146522":"The role of atmosphere and ocean physical processes in ENSO in a perturbed physics coupled climate model","279843717":"Implementation of a Cloud Radiative Adjustment Method to Change the Climate Sensitivity of CAM3","227417765":"Validation and forecasting accuracy in models of climate change: Comments","259517532":"Projected changes in mean and extreme precipitation indices over India using PRECIS","236130621":"Uncertainty of paddy irrigation requirement estimated from climate change projections in the Geumho river basin, Korea","273477474":"Towards a typology for constrained climate model forecasts","6940486":"Extreme events due to human-induced climate change","240626040":"Vad varje europé bör veta om global uppvärmning","266972378":"A climate change range-based method for estimating robustness for water resources supply","254809091":"Discounting and climate change: a non-marginal policy choice","242349378":"Chapter 2 A review of the current science of climate change","258795610":"Predictor Screening, Calibration, and Observational Constraints in Climate Model Ensembles: An Illustration Using Climate Sensitivity","249611736":"The Sensitivity of the Rate of Transient Climate Change to Ocean Physics Perturbations","257412201":"Decadal predictability and forecast skill","229130903":"Eventual saturation of the climate–carbon cycle feedback studied with a conceptual model","262679787":"Can we trust climate models?","249611684":"Summer temperature variations in the European Alps, AD 755-2004. J Clim","265017484":"Towards Prospective Life Cycle Assessment: How to Identify Key Parameters Inducing Most Uncertainties in the Future? Application to Photovoltaic Systems Installed in Spain","226709195":"Systematic optimisation and climate simulation of FAMOUS, a fast version of HadCM3","245309911":"Impact of climate warming on assive night cooling potential in Europe","225161767":"Development of regional future climate change scenarios in South America using the Eta CPTEC/HadCM3 climate change projections: climatology and regional analyses for the Amazon, São Francisco and the Parana River Basins","45137404":"Taking the lead: post-2012 climate targets for the North: towards adequate and equitable future climate commitments for industrialised countries","7754554":"Strong present-day aerosol cooling implies a hot future","271076197":"Is there room for geoengineering in the optimal climate policy mix?","228593391":"Trust and Security in Virtual Communities","237522296":"Biodiversität und Klima - Vernetzung der Akteure in Deutschand III","237506937":"Risks Associated with Stabilisation Scenarios and Uncertainty in Regional and Global Climate Change Impacts","258615352":"Analysis of the Model Climate Sensitivity Spread Forced by Mean Sea Surface Temperature Biases","258686009":"Forecast improvement in Lorenz 96 system","252501083":"Analysis of spatial and temporal variations of carbon dioxide over China using SCIAMACHY satellite observations during 2003-2005","259754017":"Climate projection: Refining global warming projections","241465663":"Taking the Lead: Post2012 Climate Targets for the North","237948272":"Atmospheric CO 2 enrichment affects potatoes: 1. Aboveground biomass production and tuber yield","242281746":"As Mudanças Climáticas Globais e a","264216796":"Ensemble Modeling, Uncertainty and Robust Predictions","262245570":"Analysing uncertainties in climate change impact assessment across sectors and scenarios","229150412":"Energy policies avoiding a tipping point in the climate system","24130068":"Evaluating Global Warming Potentials as Historical Temperature Proxies: an application of ACC2 Inverse Calculation","251166108":"Projections of Future Anthropogenic Climate Change","6671116":"Impact of climate change on health: what is required of climate modellers?","263056580":"On the generation of climate model ensembles","264769697":"Key factors governing uncertainty in the response to sunshade geoengineering from a comparison of the GeoMIP ensemble and a perturbed parameter ensemble","276487955":"A decision analysis approach to climate adaptation: a structured method to consider multiple options","248146337":"Quantifying uncertainty in changes in extreme event frequency in response to doubled CO 2 using a large ensemble of GCM simulations","44158412":"Strong present-day aerosol cooling implies a hot future","257412152":"Probabilistic projections of transient climate change","40900864":"Tomato pollen respiration in relation to in vitro germination and pollen tube growth under favourable and stress-inducing temperatures","51760225":"Uncertainty in weather and climate prediction. Philos Trans R Soc A","254946372":"A Common Framework for Qualitative and Quantitative Modelling","232410796":"Predicting weather and climate: Uncertainty, ensembles and probability","275507997":"Uncertainty Quantification in Multiscale Simulation of Materials: A Prospective","30846625":"On the contribution of local feedback mechanisms to the range of climate sensitivity in two GCM ensembles. Clim Dyn","220016234":"Precaution and Proportionality in the Management of Global Environmental Change","225648139":"The coupling of optimal economic growth and climate dynamics","220016230":"Communicating Trade-offs Amid Controversial Science: Decision Support For Climate Policy","225379860":"Future Climate in the Pacific Northwest","259087373":"Coping with uncertainty in climate policy making: (Mis)understanding scenario studies","233998991":"Model-based analysis of the environmental impacts of grazing management on Eastern Mediterranean ecosystems in Jordan","6266847":"A Methodology for Probabilistic Predictions of Regional Climate Change From Perturbed Physics Ensembles","6266845":"Ensemble decadal prediction from analysed intial conditions","225437421":"Impacts of Thermohaline Circulation Shutdown in the Twenty-First Century","6266844":"Challenges in using probabilistic climate change information for impact assessments: an example from the water sector. Phil Trans R Soc A","5410769":"Explaining the eventual transient saturation of climate-carbon cycle feedback","227993109":"Flexible Distributed Mesh Data Structure for Parallel Adaptive Analysis","248808784":"A Frame Work for Assessing Uncertainties in Climate Change Impacts: Low Flow Scenarios for the River Thames, UK","6266842":"Inference in ensemble experiments. Phil Trans R Soc Lond","27654691":"Empirical Downscaling of Wind Speed Probability Distributions","6266841":"Probabilistic climate change predictions applying Bayesian model averaging","6266840":"Efficient estimation and ensemble generation in climate modelling","260558863":"Offline parameter estimation using EnKF and maximum likelihood error covariance estimates: Application to a subgrid‐scale orography parametrization","225470202":"Geo-Engineering to Confine Climate Change: Is it at all Feasible?","228612652":"Sea level rise projections for current generation CGCMs based on the semi-empirical method. Geophys Res Lett 35(L02715):5","287906471":"Screening ornamental pepper cultivars for temperature tolerance using pollen and physiological parameters","277704477":"The Potential of Renewables as a Feedstock for Chemistry and Energy","225659623":"Effect of parameter change upon the extra-tropical atmospheric variability","228354568":"Constraints on climate change from a multi-thousand member ensemble of simulations. Geophys Res Lett 32(23):L23825","227093020":"Causes and uncertainty of future summer drying over Europe. Clim Dynam","242316778":"Review of the Methodological Approaches Available for Setting UK Carbon Budgets. RMP/4850","222553823":"The Use of Historical Range and Variability (HRV) in Landscape Management","7155661":"Climate sensitivity constrained by temperature reconstructions over the past seven centuries. Nature","233921107":"A simple relationship between volcanic sulfate aerosol optical depth and surface temperature change simulated in an atmosphere-ocean general circulation model","248018284":"Skill and uncertainty in climate models","231337580":"Using a Multiphysics Ensemble for Exploring Diversity in Cloud-Shortwave Feedback in GCMs","244059433":"Toward a statistical framework to quantify the uncertainties of hydrologic response under climate change","277677864":"Predictions of Climate Several Years Ahead Using an Improved Decadal Prediction System","249416059":"Modeling Path Dependence in Agricultural Adaptation to Climate Variability and Change","40112579":"Positive feedback between global warming and atmospheric CO2 concentration inferred from past climate change","228382260":"Emulating the sensitivity of the HadSM3 climate model using ensembles from different but related experiments","226183888":"Assessing Uncertainties in Climate Change Impact Analyses on the River Flow Regimes in the UK. Part 2: Future Climate","238037405":"Regional drought over the UK and changes in the future","228672021":"Space-based geoengineering: Challenges and requirements","262771743":"Projected changes in climate over the Indus river basin using a high resolution regional climate model (PRECIS)","259812549":"Greenhouse zero-dimensional model with CO2 reduction in emission due to renewable energy use and new technologies","263882755":"FALSIFICATION OF THE ATMOSPHERIC CO2 GREENHOUSE EFFECTS WITHIN THE FRAME OF PHYSICS","231337587":"Emission Scenario Dependency of Precipitation on Global Warming in the MIROC3.2 Model","6266851":"Issues in the Interpretation of Climate Model Ensembles to Inform Decisions","258396378":"Regional Climate Effects of Conversion from Grassland to Forestland in Southeastern China","38013433":"The importance of multimodel projections to assess uncertainty in projections from simulation models","6266850":"Confidence, Uncertainty and Decision Support Relevance in Climate Predictions","266335329":"Will Climate Change Mathematics (?)","6266849":"Ensemble climate predictions using climate models and observational constraints","6266848":"The Use of the Multi-Model Ensemble in Probabilistic Climate Change Projections","239348219":"A Statistical Approach to System Inference Using Models","239667584":"A Framework for Validation of Computer Models","225355426":"Probabilities in climate policy advice: a critical comment. Clim Chang","7961524":"More power needed to probe cloud systems","235761088":"The Einstein@Home search for radio pulsars and PSR J2007+2722 discovery","6257553":"‘Probabilistic Climate Forecasts and Inductive Problems.’","232797742":"Knutti, R. \u0026 Hegerl, G. C. The equilibrium sensitivity of the Earth\u0027s temperature to radiation changes. Nature Geosci. 1, 735-743","24203966":"Crops and climate change: Progress, trends, and challenges in simulating impacts and informing adaptation","227992135":"GrACE: Grid Adaptive Computational Engine for Parallel Structured AMR Applications","261350464":"Designing a Runtime System for Volunteer Computing","252889287":"Qualitative Modeling Techniques to Assess Patterns of Global Change","286069464":"Maize (Zea mays L.) yield and aflatoxin accumulation responses to exogenous glycinebetaine application","264477716":"African Climate Change Uncertainty in Perturbed Physics Ensembles: Implications of Global Warming to 4°C and Beyond","6173574":"The Met Office Hadley Centre climate modelling capability: The competing requirements for improved resolution, complexity and dealing with uncertainty","247623960":"Regional climate change in the Northern Adriatic","6173572":"Introduction. Climate change and urban areas: Research dialogue in a policy framework","258660534":"Systematic Model Error: The Impact of Increased Horizontal Resolution versus Improved Stochastic and Deterministic Parameterizations","6783929":"Araújo MB, New M.. Ensemble forecasting of species distributions. Trends Ecol Evol 22: 42-47","228017737":"Global Warming","225333901":"Stability of algorithms for a two domain natural convection problem and observed model uncertainty","228688453":"Post-Kyoto climate targets: Costs and competitiveness implications","249007410":"Urban organic archaeology: An irreplaceable palaeoecological archive at risk","40768907":"The effect of substrate, ADP and uncoupler on the respiration of tomato pollen during incubation in vitro at moderately high temperature","265391156":"Physiology-based prognostic modeling of the influence of changes in precipitation on a keystone dryland plant species","229072449":"What are the limits to statistical error correction in land surface schemes when projecting the future?","239531425":"Climate, Environment and Society in the Pacific During the Last Millennium","221601500":"Programmable GPUs: New General Computing Resources Available for Desktop Grids","252777720":"Carbon-cycle feedbacks increase the likelihood of a warmer future","237504967":"The Scientific Consensus on Climate Change: How Do We Know We\u0027re Not Wrong?","273323941":"Identifying traits for genotypic adaptation using crop models","225359519":"Multivariate Probabilistic Projections Using Imperfect Climate Models. Part I: Outline of Methodology","43656552":"Evaluating climate model performance with various parameter sets using observations over the last centuries","222994105":"Future climate change and the British Quaternary research community","222672561":"Discounting and the social cost of carbon: A closer look at uncertainty","287964884":"Assessing uncertainty and complexity in regional-scale crop model simulations"},"index":376}