{"abs":"A key question in evaluation of computer models is Does the computer model adequately represent reality? A six-step process for computer model validation is set out in Bayarri et al. [Technometrics 49 (2007) 138--154] (and briefly summarized below), based on comparison of computer model runs with field data of the process being modeled. The methodology is particularly suited to treating the major issues associated with the validation process: quantifying multiple sources of error and uncertainty in computer models; combining multiple sources of information; and being able to adapt to different, but related scenarios. Two complications that frequently arise in practice are the need to deal with highly irregular functional data and the need to acknowledge and incorporate uncertainty in the inputs. We develop methodology to deal with both complications. A key part of the approach utilizes a wavelet representation of the functional data, applies a hierarchical version of the scalar validation methodology to the wavelet coefficients, and transforms back, to ultimately compare computer model output with field output. The generality of the methodology is only limited by the capability of a combination of computational tools and the appropriateness of decompositions of the sort (wavelets) employed here. The methods and analyses we present are illustrated with a test bed dynamic stress analysis for a particular engineering system. Comment: Published in at http://dx.doi.org/10.1214/009053607000000163 the Annals of Statistics (http://www.imstat.org/aos/) by the Institute of Mathematical Statistics (http://www.imstat.org)","title":"Computer model validation with functional output","id":1899891,"url":"https://www.researchgate.net/publication/1899891_Computer_model_validation_with_functional_output","names":["M. J. Bayarri","J. O. Berger","John Cafeo","G. Garcia-Donato","F. Liu","Jesus Palomo","The Annals of Statistics"],"references":{"242187692":"Measuring the Predictive Capability of Computational Methods: Principles and Methods, Issues and Illustrations","4772045":"Bayesian Calibration of Computer Models","29654658":"Statistical Assessment of Numerical Models","245582244":"Bayesian Validation of a Computer Model for Vehicle Crashworthiness","227637401":"Circuit optimization via sequential computer experiments: design of an output buffer, Applied Statistics 47: 31-48","239667584":"A Framework for Validation of Computer Models","238879665":"Bayesian Inference in Wavelet-Based Models:Bayesian Inference in Wavelet-Based Models","2861095":"Calibrated Bayesian Forecasting Using Large","4744220":"Bayesian Forecasting for Complex Systems Using Computer Simulators","242504608":"Statistical Modeling by Wavelets. Wiley, N.Y., 381pp","220411382":"Probabilistic Formulations for Transferring Inferences from Mathematical Models to Physical Systems","31717046":"Statistical Modeling by Wavelets / B. Vidakovic.","38363487":"The Design and Analysis of Computer Experiments","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","51992321":"Verification and Validation in Computational Sciencend Engineering","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","4746515":"Wavelet-Based Nonparametric Modeling of Hierarchical Functions in Colon Carcinogenesis","236359816":"General Concepts for Experimental Validation of ASCI Code Applications","243769240":"Validation Methodology in Computational Fluid Dynamics","216301381":"The Design and Analysis Computer Experiments","248316974":"Veri炉cation and Validation in Computational Science and Engineering","241509888":"Screening the Input Variables to a Computer Model Via Analysis of Variance and Visualization","4742946":"Computer Model Calibration Using High-Dimensional Output","244956149":"A Framework For Veri炉cation And Validation Of Computer Models and Simulations","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","255266950":"Guidelines for Sandia ASCI Verification and Validation Plans - Content and Format: Version 1.0","2365648":"Bayesian Analysis of Computer Code Outputs","266427861":"Bayesian inference in wavelet-based models","216301661":"Screening, Predicting, and Computer Experiments","2358365":"Pressure Matching for Hydrocarbon Reservoirs: A Case Study in the Use of Bayes Linear Strategies for Large Computer Experiments","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments"},"citedIn":{"222581573":"Bayesian emulation of complex multi-output and dynamic computer models","41032052":"NPUA: A new approach for the analysis of computer experiments","245582244":"Bayesian Validation of a Computer Model for Vehicle Crashworthiness","282692563":"Improving Ice Sheet Model Calibration Using Paleoclimate and Modern Data","239348043":"A Bayesian approach for quantification of model uncetainty","282400455":"Posterior Belief Assessment: Extracting Meaningful Subjective Judgements from Bayesian Analyses with Complex Statistical Models","280538283":"Efficient Calibration for Imperfect Computer Models","276092263":"Agent-Based Models in Empirical Social Research","228660404":"Bayesian Hierarchical Modeling for Integrating Low-Accuracy and High-Accuracy Experiments","228370315":"A review of statistical modelling and inference for electrical capacitance tomography","45882790":"Global sensitivity analysis for models with spatially dependent outputs","257431875":"Quantifying uncertainty in remotely sensed land cover maps","237548813":"Choosing the Sample Size of a Computer Experiment: A Practical Guide","257392240":"Analysis of computationally demanding models with continuous and categorical inputs","220341007":"Efficient meta-modelling of complex process simulations with time–space-dependent outputs","222517874":"Implementation and evaluation of nonparametric regression procedures for sensitivity analysis of computationally demanding models","228974227":"A Statistical Equivalent Model for Random Waypoint Mobility: A Case Study","289585269":"Fast mechanism-based emulator of a slow urban hydrodynamic drainage simulator","239808119":"Introducing multivator: A Multivariate Emulator","271656975":"Reallocation of testing resources in validating optimal designs using local domains","47862939":"Residual Minimizing Model Interpolation for Parameterized Nonlinear Dynamical Systems","228780015":"Efficient Emulators for Multivariate Deterministic Functions","228522188":"Fast Statistical Surrogates for Dynamical 3D Computer Models of Brain Tumors","228926710":"Applied Statistics and the Indianness of Indian Data","225726497":"Computer-simulation data inclusive regression modelling in measurement","261933770":"Functional ANOVA in Computer Models With Time Series Output","254331262":"Multivariate Gaussian Process Emulators With Nonseparable Covariance Structures","266396599":"Computer experiments with functional inputs and scalar outputs by a norm-based approach","269998671":"Bayesian Emulation and Calibration of a Dynamic Epidemic Model for A/H1N1 Influenza","253953912":"A composite likelihood approach to computer model calibration with high-dimensional spatial data","50981205":"Adaptive Error Modelling in MCMC Sampling for Large Scale Inverse Problems","266412928":"Continuous-Time Emulation of Large Distributed Parameter Dispersion Models","47386033":"Screening and metamodeling of computer experiments with functional outputs. Application to thermal-hydraulic computations","258819339":"Shape invariant model approach for functional data analysis in uncertainty and sensitivity studies","228780489":"Predicting Vehicle Crashworthiness: Validation of Computer Models for Functional and Hierarchical Data","4772387":"Parameter Estimation for Differential Equations: A Generalized Smoothing Approach","254354242":"Design for Variation","228020731":"Modelling with Deterministic Computer Models","46511274":"Nested Latin hypercube designs","238505799":"A physics informed emulator for laser-driven radiating shock simulations","24410887":"Bayesian methods in cost-effectiveness studies: Objectivity, computation and other relevant aspects","259133198":"Construction of sliced (nearly) orthogonal Latin hypercube designs","226128134":"A Kriging Approach to the Analysis of Climate Model Experiments","254212187":"Liu, F., M. J. Bayarri, and J. O. Berger. Modularization in Bayesian analysis, with emphasis on analysis of computer models. Bayesian Analysis","257800925":"Assessing First-Order Emulator Inference for Physical Parameters in Nonlinear Mechanistic Models","220165020":"Statistical Equivalent Models for Computer Simulators with an Application to the Random Waypoint Mobility Model","51949467":"Emulating a gravity model to infer the spatiotemporal dynamics of an\ninfectious disease","225904882":"Computer experiments: A review","281808457":"Stochastic simulators based optimization by Gaussian process metamodels - Application to maintenance investments planning issues","257334748":"A variable-size local domain approach for increased design confidence in simulation-based optimization","227413790":"Mechanism-based emulation of dynamic simulation models: Concept and application in hydrology","265471299":"Bayesian inference of a lake water quality model by emulating its posterior density","263366694":"Improving Identifiability in Model Calibration Using Multiple Responses","237753533":"Inferring likelihoods and climate system characteristics from climate models and multiple tracers","266917234":"Fast dimension-reduced climate model calibration and the effect of data aggregation","280772897":"Non-isometric Curve to Surface Matching with Incomplete Data for Functional Calibration","38018276":"Parameter estimation and sensitivity analysis in an agent-based model of Leishmania major infection","276175316":"Probabilistic quantification of hazards: A methodology using small ensembles of physics-based simulations and statistical surrogates","257550842":"Reduced order models for many-query subsurface flow applications","269998516":"Discussion of “Computer Experiments with Qualitative and Quantitative Variables: A Review and Reexamination”","233169217":"Bayesian Validation of Computer Models","257549821":"Emulation techniques for the reduction and sensitivity analysis of complex environmental models. Environ Model Softw","260170788":"Forecasting the Major Influences of Predation and Environment on Cod Recovery in the Northern Gulf of St. Lawrence","259742932":"Determining Fundamental Properties of Matter Created in Ultrarelativistic Heavy-Ion Collisions","235144629":"Towards a Comprehensive Framework for Simulation-based Vehicle Systems Design Validation (PREPRINT)","270594194":"Calibrating an ice sheet model using high-dimensional non-Gaussian spatial data","268208459":"Response surface methods based on analysis of variance expansion for sensitivity analysis","257800938":"Uncertainty Analysis for Computationally Expensive Models with Multiple Outputs","44649746":"Simultaneous Determination of Tuning and Calibration Parameters for Computer Experiments","242997957":"Reified Bayesian modelling: Issues and opportunities (response to the discussion)","241557157":"SAMSI 2006-07 Program on Development, Assessment and Utilization of Complex Computer Models Final Report","51967192":"A Mechanistic Dynamic Emulator","226724932":"Modelling of a thermomechanically coupled forming process based on functional outputs from a finite element analysis and from experimental measurements","239667584":"A Framework for Validation of Computer Models","236078808":"Development of Antipsychotic Medications with Novel Mechanisms of Action Based on Computational Modeling of Hippocampal Neuropathology","251621940":"A general statistical model for computer experiments with time series output","224040074":"Computer Model Calibration Using the Ensemble Kalman Filter","265987339":"Development and Implementation of Bayesian Computer Model Emulators","225747621":"A unified approach to environmental systems modeling","254329843":"Gaussian Surrogates for Computer Models With Time-Varying Inputs and Outputs","262526073":"Calibration of Computational Models With Categorical Parameters and Correlated Outputs via Bayesian Smoothing Spline ANOVA","275845292":"Human Strategy Modeling via Critical Coupling of Multiple Characteristic Patterns","232959548":"Analysis of Computer Experiments With Functional Response","263679081":"Spline-Based Emulators for Radiative Shock Experiments With Measurement Error","254282952":"Fast regression surrogates for computer models with time-dependent outputs","263194960":"Fast linked analyses for scenario‐based hierarchies","257017520":"Calibration of computer models with multivariate output","276715677":"Mathematical and computational approaches to epidemic modeling: a comprehensive review","47387952":"Global Sensitivity Analysis of Stochastic Computer Models with joint metamodels","226988642":"How you can tell if the simulations in computational criminology are any good","23935882":"Parameter estimation for computationally intensive nonlinear regression with an application to climate modeling","291954575":"Dynamic simulation metamodeling using MARS: A case of radar simulation","274142394":"Exploratory ensemble designs for environmental models using k-extended Latin Hypercubes","262981980":"Statistical Emulation of Climate Model Projections Based on Precomputed GCM Runs*","228051047":"Simulation in Industrial Statistics","257585324":"A new approach for the determination of the drag coefficient from the upper ocean response to a tropical cyclone: A feasibility study","268817657":"Development of a surrogate model and sensitivity analysis for spatio-temporal numerical simulators","261572969":"Functional ANOVA in Computer Models With Time Series Output"},"index":379}