{"abs":"Several Markov chain-based methods are available for sampling from a posterior distribution. Two important examples are the Gibbs sampler and the Metropolis algorithm. In addition, several strategies are available for constructing hybrid algorithms. This paper outlines some of the strategies that are available, and discusses some theoretical and practical issues in the use of these strategies. In addition, some preliminary efforts to use Markov chains to control dynamic graphics for exploring higher-dimensional posterior distributions are outlined.","title":"Exploring Posterior Distributions Using Markov Chains","id":235014147,"url":"https://www.researchgate.net/publication/235014147_Exploring_Posterior_Distributions_Using_Markov_Chains","names":["Luke Tierney"],"references":{"254287149":"Generalized Linear Models With Random Effects; A Gibbs Sampling Approach","246868205":"Monte Carlo sampling using Markov chains and their applications","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","242501738":"An Analytical Evaluation of Alternative Strategies in Steady-State Simulation"},"citedIn":{"246566064":"Iterative and Non-iterative Simulation Algorithms","239037117":"Computing Bayes Factors Using a Generalization of the Savage-Dickey Density Ratio","247317686":"Chapter 15 Monte carlo simulation and numerical integration","247743176":"Parameter Estimation With Small Sample Size A Higher-Order IRT Model Approach","5151683":"The Cost Efficiency of Real Estate Investment Trusts: An Analysis with a Bayesian Stochastic Frontier Model","222503635":"Bayesian Reduced Rank Regression in Econometrics","245609392":"Capture-Recapture Estimation Via Gibbs Sampling","4747739":"Bayesian Efficiency Analysis with a Flexible Form: The AIM Cost Function","239755230":"On the performance of the gibbs sampler for the multivariate normal distribution","270363787":"Adaptive Direction Sampling","267067251":"Understanding Computational Bayesian Statistics","251563106":"Does Theory Matter: Assessing the Impact of Monotonicity and Concavity Constraints on Forecasting Accuracy","38357609":"Markov Chains for Exploring Posterior Distributions","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","2750856":"Covariate Selection in Hierarchical Models of Hospital Admission Counts: A Bayes Factor Approach","15226443":"Analysis of longitudinal data: Random coefficient regression modelling","221497232":"Randomized Approximate Aggregating Strategies and Their Applications to Prediction and Discrimination.","2598914":"The Number of Iterations, Convergence Diagnostics and Generic Metropolis Algorithms","4986720":"Combining Information From Two Surveys to Estimate County-Level Prevalence Rates of Cancer Risk Factors and Screening","225513280":"Pharmacodynamic Analysis of Hematologic Profiles","2750746":"Regeneration in Markov Chain Samplers","243103689":"Correction: Sampling from Log-Concave Distributions","47162487":"Marginal Inferences about variance components in a mixed linear model using Gibbs sampling","255583235":"Estimation of Prevalence of Overweight in Small Areas -A Robust Extension of Fay-Herriot Model","275103966":"A fast universal self-tuned sampler within Gibbs sampling","266575199":"Goodness-of-fit Inferences through Posterior Distribution Explorations","23523673":"Residential Real Estate Brokerage Efficiency and the Implications of Franchising: A Bayesian Approach","221497331":"A Randomized Approximation of the MDL for Stochastic Models with Hidden Variables.","6777895":"Estimation of the proportion of overweight individuals in small areas - A robust extension of the Fay-Herriot model","266474279":"Flexible Bent-Cable Models for Mixture Longitudinal Data","242773694":"3G Bayesian Analysis for the Social Sciences","2554222":"On the Geometric Convergence of the Gibbs Sampler","2336234":"Incorporating Monotonicity and Concavity Restrictions into Stochastic Cost Frontiers","242997554":"Contagion distributions for defining disease clustering in time","5144452":"Bayesian Analysis of the Stochastic Switching Regression Model Using Markov Chain Monte Carlo Methods","266428717":"A Survey of Sampling Methods for Inference on Directed Graphs","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","2741222":"Bayesian Density Estimation and Inference Using Mixtures","222454294":"Nonlinear Interest Rate Dynamics and Implications for the Term Structure","220385524":"A Bayesian optimal design for accelerated degradation tests","223158426":"A Markov chain Monte Carlo method for estimation and assimilation into models. Ecol Model","228094913":"Social moderation of the relation between community violence exposure and depressive symptoms in an urban adolescent sample.","222743324":"Bayesian Efficiency Analysis through Individual Effects: Hospital Cost Frontier’","243781849":"Bayesian Inference for Stable Distributions","233015041":"Bayesian nonparametric confidence bounds for a distribution function","23546883":"Detecting log-periodicity in a regime-switching model of stock returns","2469070":"Posterior Integration in Dynamic Models","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","243776875":"Spatial Statistics and Bayesian Computing","24082432":"Posterior Analysis of Environmental Damage Evaluation in Europe","3192512":"A unified approach for modeling longitudinal and failure time data, with application in medical monitoring","258150163":"A Straightforward Approach to Markov Chain Monte Carlo Methods for Item Response Models","224910614":"Adaptive Rejection Metropolis Sampling Within Gibbs Sampling","33027971":"Bayesian Analysis of Sample Selection and Endogenous Switching Regression Models with Random Coefficients Via MCMC Methods","33400327":"Bayesian efficiency analysis with a flexible cost function","274999838":"Bayesian Analytical Methods: A Methodological Prescription for Public Administration"},"index":380}