{"abs":"Stochastic substitution, the Gibbs sampler, and the sampling-importance-resampling algorithm can be viewed as three alternative sampling- (or Monte Carlo-) based approaches to the calculation of numerical estimates of marginal probability distributions. The three approaches will be reviewed, compared, and contrasted in relation to various joint probability structures frequently encountered in applications. In particular, the relevance of the approaches to calculating Bayesian posterior densities for a variety of structured models will be discussed and illustrated.","title":"Sampling-Based Approaches to Calculate Marginal Densities","id":224910629,"url":"https://www.researchgate.net/publication/224910629_Sampling-Based_Approaches_to_Calculate_Marginal_Densities","names":["Alan E. Gelfand","Adrian F. M. Smith","Journal of the American Statistical Association"],"references":{"243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","261593363":"Stochastic Simulation","246782707":"Maximum Likelihood from Incomplete Data","245773359":"Consistency conditions for probability estimators and integrals of density estimators","270534505":"The Calculation of Posterior Distributions by Data Augmentation: Comment","38358978":"Natural Exponential Families with Quadratic Variance Functions: Statistical Theory","242567994":"Maximum Likelihood Estimation from Incomplete Data","268490386":"Applications of a Method for the Efficient Computation of Posterior Distributions”, Applied Statistics, 31, 214-225","221995817":"Maximum Likelihood from Incomplete Data Via EM Algorithm","222291755":"Antithetic Acceleration of Monte Carlo Integration in Bayesian Inference","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","225304570":"Non-Uniform Random Variate Generation","224817276":"Nonparametric Density Estimation: The L1 View","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","243048927":"The Implementation of the Bayesian Paradigm","243553632":"Using the SIR algorithm to simulate posterior distributions","224839692":"Spatial Interaction and the Statistical Analysis of Lattice Systems","265429604":"Stochastic Simulation","271760261":"Progress with Numerical and Graphical Methods for Practical Bayesian Statistics","243766399":"Parametric Empirical Bayes Inference: Theory and Applications","242706958":"Spatial interaction and statistical analysis of lattice systems","50335996":"Bayesian inference in statistical analysis.","38360310":"A Quasirandom Approach to Integration in Bayesian Statistics","235115964":"Non-Parametric Density Estimation"},"citedIn":{},"index":385}