{"abs":"This short overview is an addendum to a recent literature survey by Bianchi et al. on metaheuristics for stochastic combinatorial optimization (SCO). It outlines some new developments that occurred in this field during the last few years. Special attention is given to multi-objective SCO as well as to combinations of metaheuristics with mathematical programming.","title":"Recent trends in metaheuristics for stochastic combinatorial optimization","id":220142055,"url":"https://www.researchgate.net/publication/220142055_Recent_trends_in_metaheuristics_for_stochastic_combinatorial_optimization","names":["Walter J. Gutjahr","Central European Journal of Computer Science"],"references":{"220901544":"S-ACO: An Ant-Based Approach to Combinatorial Optimization Under Uncertainty","226637062":"A Branch and Bound Method for Stochastic Global Optimization","236235921":"Particle swarm optimization. ISTE","225501690":"One-stage R\u0026D portfolio optimization with an application to solid oxide fuel cells","224112855":"Evolutionary Policy Iteration Under a Sampling Regime for Stochastic Combinatorial Optimization","220403630":"Evolutionary multiobjective optimization in noisy problem environments","4213839":"Multiobjective simulation optimization using an enhanced genetic algorithm","220668852":"Estimation-Based Local Search for Stochastic Combinatorial Optimization Using Delta Evaluations: A Case Study on the Probabilistic Traveling Salesman Problem","27531827":"Adaptive Random Search Methods for Simulation Optimization","221228598":"Evolutionary Multi-objective Ranking with Uncertainty and Noise","4213851":"Two simulated annealing algorithms for noisy objective functions","257722304":"Particle swarm optimization. An Overview","4871787":"Stochastic approach versus multiobjective approach for obtaining efficient solutions in stochastic multiobjective programming problems","225722195":"A multiobjective metaheuristic for a mean-risk multistage capacity investment problem","235439136":"Handbook of Metaheuristics","23738438":"On Optimal Allocation of Indivisibles Under Uncertainty.","220403475":"A provably convergent heuristic for stochastic bicriteria integer programming","29621627":"ParadisEO-MOEO: A Framework for Evolutionary Multi-objective Optimization","38092671":"Hybrid Evolutionary Optimization of Two-Stage Stochastic Integer Programming Problems: An Empirical Investigation","223375211":"A hybrid evolutionary algorithm for solving two-stage stochastic integer programs in chemical batch scheduling","225438292":"Variable neighborhood search: methods and applications. 4OR","265303019":"Handbook of Metaheuristics","29621628":"Combinatorial Optimization of Stochastic Multi-objective Problems: An Application to the Flow-Shop Scheduling Problem","220058914":"Estimation-based ant colony optimization and local search for the probabilistic traveling salesman problem","227077960":"Meta-heuristic Approaches for Multi-objective Simulation-based Optimization in Supply Chain Inventory Management","236094931":"Metaheuristics for the dynamic stochastic dial-a-ride problem with expected return transports","223451792":"Marinakis, M.: A Hybrid Multi-Swarm Particle Swarm Optimization Algorithm for the Probabilistic Traveling Salesman Problem. Computers \u0026 Operations Research 37, 432-442","220472934":"Estimation-based metaheuristics for the probabilistic traveling salesman problem","200035365":"On Optimal Allocation of Indivisibles Under Uncertainty","227205572":"Stochastic Search in Metaheuristics","37851536":"On Convergence of Evolutionary Computation for Stochastic Combinatorial Optimization","220287856":"Adaptive sample size and importance sampling in estimation-based local search for the probabilistic traveling salesman problem","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","220867710":"Comparison of Metaheuristic Approaches for Multi-objective Simulation-Based Optimization in Supply Chain Inventory Management","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","50926800":"A simulation-based multi-objective genetic algorithm approach for networked enterprises optimization","224333955":"Transmission network expansion planning considering uncertainty in generation and demand","24053902":"Combined Discrete-event Simulation and Ant Colony Optimisation Approach for Selecting Optimal Screening Policies for Diabetic Retinopathy","220403650":"Simulated annealing in the presence of noise","228912070":"Handling Uncertainty in Indicator-Based Multiobjective Optimization","245586369":"Combinatorial Optimization of Stochastic Multi-objectiveProblems: an Application to the Flow-shop Scheduling Problem","220209731":"Progressive Hedging-Based Metaheuristics for Stochastic Network Design","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","46888616":"ParadisEO-MOEO: A Software Framework for Evolutionary Multi-Objective Optimization","232877061":"Bi-objective project portfolio selection and staff assignment under uncertainty","220403525":"Using scenario trees and progressive hedging for stochastic inventory problems","224300468":"Tutorial: Advances and challenges in healthcare simulation modeling","220413385":"A Hybrid Monte Carlo Local Branching Algorithm for the Single Vehicle Routing Problem with Stochastic Demands","221318875":"Two Metaheuristics for Multiobjective Stochastic Combinatorial Optimization","221318877":"A VNS Algorithm for Noisy Problems and Its Application to Project Portfolio Analysis","221228511":"Pareto-Front Exploration with Uncertain Objectives","225135001":"Local branching","2723166":"On Optimal Allocation of Indivisibles under Uncertainty","226270987":"The ACO/F-Race Algorithm for Combinatorial Optimization Under Uncertainty","225663369":"A multiobjective metaheuristic for a mean-risk static stochastic knapsack problem","225265937":"Ant Colony Optimization: Overview and Recent Advances","220132963":"A survey on metaheuristics for stochastic combinatorial optimization","224123813":"Buffer capacity allocation using ant colony optimisation algorith"},"citedIn":{"23723390":"Does devaluation hurt private investment? The Indonesian case","266855501":"APLICACIÓN DEL MÉTODO DE SELECCIÓN DEL MEJOR SUBCONJUNTO EN PROBLEMAS DE OPTIMIZACIÓN MEDIANTE SIMULACIÓN","257516631":"Stochastic multi-objective optimization: A survey on non-scalarizing methods"},"index":387}