{"abs":"Currently, stochastic optimization on the one hand and multi-objective optimization on the other hand are rich and well-established special fields of Operations Research. Much less developed, however, is their intersection: the analysis of decision problems involving multiple objectives and stochastically represented uncertainty simultaneously. This is amazing, since in economic and managerial applications, the features of multiple decision criteria and uncertainty are very frequently co-occurring. Part of the existing quantitative approaches to deal with problems of this class apply scalarization techniques in order to reduce a given stochastic multi-objective problem to a stochastic single-objective one. The present article gives an overview over a second strand of the recent literature, namely methods that preserve the multi-objective nature of the problem during the computational analysis. We survey publications assuming a risk-neutral decision maker, but also articles addressing the situation where the decision maker is risk-averse. In the second case, modern risk measures play a prominent role, and generalizations of stochastic orders from the univariate to the multivariate case have recently turned out as a promising methodological tool. Modeling questions as well as issues of computational solution are discussed.","title":"Stochastic multi-objective optimization: A survey on non-scalarizing methods","id":257516631,"url":"https://www.researchgate.net/publication/257516631_Stochastic_multi-objective_optimization_A_survey_on_non-scalarizing_methods","names":["Walter J. Gutjahr","Alois Pichler","Annals of Operations Research"],"references":{"230873408":"Lectures on stochastic programming: Modeling and theory. Philadelphia, SIAM","265042383":"Aspects of increasing concave stochastic order constrained optimization","220136343":"Variable-Sample Methods for Stochastic Optimization","220403630":"Evolutionary multiobjective optimization in noisy problem environments","267478399":"Stochastic Orders","228479504":"Models and Formulations for Multivariate Dominance Constrained Stochastic Programs","4213839":"Multiobjective simulation optimization using an enhanced genetic algorithm","226211700":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","220590902":"Asymptotic distribution of law-invariant risk functionals","245386681":"Solving a multi-objective multi-depot stochastic location-routing problem by a hybrid simulated annealing algorithm","221228598":"Evolutionary Multi-objective Ranking with Uncertainty and Noise","287189511":"A note on the utility-theoretic justification of the pareto approach in stochastic multi-objective combinatorial optimization","4871787":"Stochastic approach versus multiobjective approach for obtaining efficient solutions in stochastic multiobjective programming problems","265681782":"Stability of Multistage Stochastic Programs","3933080":"Multi-objective simulation optimization for a cancer treatment center","233322573":"Risk-adjusted budget allocation models with application in homeland security","227614132":"Coherent Measures of Risk","226569511":"Linear Programming Under Uncertainty","4939236":"Multi-objective stochastic programming for portfolio selection","220403475":"A provably convergent heuristic for stochastic bicriteria integer programming","260178355":"Optimization with Multivariate Conditional Value-at-Risk Constraints","225661253":"Scenario tree generation for multiperiod financial optimization by optimal discretization","225554118":"Optimization with Multivariate Stochastic Dominance Constraints","29621627":"ParadisEO-MOEO: A Framework for Evolutionary Multi-objective Optimization","36719496":"Processing Second-Order Stochastic Dominance models using cutting-plane representations","29621628":"Combinatorial Optimization of Stochastic Multi-objective Problems: An Application to the Flow-Shop Scheduling Problem","222491906":"From Stochastic Dominance to Mean-Risk Models: Semideviations as Risk Measures","233060645":"Stochastic Multi-Objective Generation Dispatch","222831625":"An efficient, adaptive parameter variation scheme for metaheuristics based on the Epsilon-constraint method","225572147":"A stochastic bi-objective location model for strategic reverse logistics","216300582":"Multicriteria Optimization","222707586":"Uniform laws of large numbers for set-valued mappings and subdifferentials of random functions","226324921":"Risk Aversion in Two-Stage Stochastic Integer Programming","220290150":"Two-stage stochastic optimization problems with stochastic ordering constraints on the recourse","200035365":"On Optimal Allocation of Indivisibles Under Uncertainty","285334472":"An Analysis of Production as an Efficient Combination of Activities-Activity Analysis, Production and Allocation, Cowles Commission for Research in Economics","245222609":"A bi-objective supply chain design problem with uncertainty. Transp Res Part C","46491786":"Supply chain design under uncertainty using sample average approximation and dual decomposition","251463725":"Stochastic Optimization and Statistical Inference","220867710":"Comparison of Metaheuristic Approaches for Multi-objective Simulation-Based Optimization in Supply Chain Inventory Management","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","50926800":"A simulation-based multi-objective genetic algorithm approach for networked enterprises optimization","225385012":"Sample average approximation of stochastic dominance constrained programs","4776724":"Optimization with Stochastic Dominance Constraints","235885522":"The bi-objective stochastic covering tour problem","228912070":"Handling Uncertainty in Indicator-Based Multiobjective Optimization","220133501":"A Cutting-Surface Method for Uncertain Linear Programs with Polyhedral Stochastic Dominance Constraints","222133086":"Multi-objective optimization for inventory control in two-level assembly systems under uncertainty of lead times","232877061":"Bi-objective project portfolio selection and staff assignment under uncertainty","262255045":"Dual Stochastic Dominance and Related Mean-Risk Models","278325363":"A Three-Objective Optimization Approach to Cost Effectiveness Analysis Under Uncertainty","223844400":"Cutting plane method for multiple objective stochastic integer linear programming","221318875":"Two Metaheuristics for Multiobjective Stochastic Combinatorial Optimization","220290250":"Ben: F. Solution approaches for the multiobjective stochastic programming. Eur. J. Oper. Res","51724409":"Runtime Analysis of an Evolutionary Algorithm for Stochastic Multi-Objective Combinatorial Optimization","225575964":"On consistency of stochastic dominance and mean–semivariance models","221228511":"Pareto-Front Exploration with Uncertain Objectives","220462034":"Pardalos, P.M.: A survey of recent developments in multiobjective optimization. Ann. Oper. Res. 154, 29-50","259792398":"Parametric Objective Function (Part 1)","220133736":"A Distance For Multistage Stochastic Optimization Models","262728414":"An Introduction in Discrete Time","220142055":"Recent trends in metaheuristics for stochastic combinatorial optimization","275409680":"Modeling, Measuring and Managing Risk","24086165":"Mean-risk models using two risk measures: A multi-objective approach"},"citedIn":{"274731811":"Bi-objective stochastic programming models for determining depot locations in disaster relief operations","276058983":"Multi-objective optimization perspectives on reinforcement learning algorithms using reward vectors","276453886":"Bi-Objective Multi-Mode Project Scheduling Under Risk Aversion","281116679":"Wireless Sensor Network Optimization: Multi-Objective Paradigm","236631136":"Anticipatory Stochastic Multi-Objective Optimization for Uncertainty Handling in Portfolio Selection","274383377":"Learning to Anticipate Flexible Choices in Multiple Criteria Decision-Making Under Uncertainty","264232948":"Anticipation in Multiple Criteria Decision-Making Under Uncertainty","261038307":"Anticipatory Stochastic Multi-Objective Optimization for uncertainty handling in portfolio selection","281344458":"Mean-value at risk portfolio efficiency: approaches based on data envelopment analysis models with negative data and their empirical behaviour","282397979":"A remark on multiobjective stochastic optimization via strongly convex functions","267507390":"Schemata Bandits for Binary Encoded Combinatorial Optimisation Problems"},"index":388}