{"abs":"Many engineering applications are characterized by implicit response functions that are expensive to evaluate and sometimes nonlinear in their behavior, making reliability analysis difficult. This paper develops an efficient reliability analysis method that accurately characterizes the limit state throughout the random variable space. The method begins with a Gaussian process model built from a very small number of samples, and then adaptively chooses where to generate subsequent samples to ensure that the model is accurate in the vicinity of the limit state. The resulting Gaussian process model is then sampled using multimodal adaptive importance sampling to calculate the probability of exceeding (or failing to exceed) the response level of interest. By locating multiple points on or near the limit state, more complex and nonlinear limit states can be modeled, leading to more accurate probability integration. By concentrating the samples in the area where accuracy is important (i.e., in the vicinity of the limit state), only a small number of true function evaluations are required to build a quality surrogate model. The resulting method is both accurate for any arbitrarily shaped limit state and computationally efficient even for expensive response functions. This new method is applied to a collection of example problems including one that analyzes the reliability of a microelectromechanical system device that current available methods have difficulty solving either accurately or efficiently. Copyright © 2008 by the American Institute of Aeronautics and Astronautics, Inc. All rights reserved.","title":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","id":253769405,"url":"https://www.researchgate.net/publication/253769405_Efficient_Global_Reliability_Analysis_for_Nonlinear_Implicit_Performance_Functions","names":["B. J. Bichon","Michael Scott Eldred","L. P. Swiler","S. Mahadevan","J. M. McFarland","AIAA Journal"],"references":{"245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","228936357":"Investigation of reliability method formulations in DAKOTA/UQ","245285279":"Multiple Linearization Method for Nonlinear Reliability Analysis","256379905":"Structural Reliability Under Combined Random Load Sequences","2368749":"Uncertainty Quantification In Large Computational Engineering Models","245893283":"Designs for Computer Experiments","223270145":"Reliability analysis of automotive body-door subsystem","238764714":"ERRORS AND UNCERTAINTIES IN PROBABILISTIC ENGINEERING ANALYSIS","200806059":"An Analysis of Transformation","221932969":"Statistics For Spatial Data","267486189":"Gaussian Process Meta-Models for Efficient Probabilistic Design in Complex Engineering Design Spaces","245284675":"Distribution of Quadratic Forms in Normal Space—Application to Structural Reliability","263530325":"The promise and peril of uncertainty quantification using response surface approximations","239413477":"Effective Two-Point Function Approximation for Design Optimization","38367467":"Remarks on a multivariate transformation. Ann Math Stat","223239917":"An efficient sampling method for probability of failure calculations. Structural Safety 3:109-115","223700913":"Ductile structural system reliability analysis using adaptive importance sampling","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","267484763":"Using Compliant Mechanisms to Improve Manufacturability in MEMS","277291690":"A Multilevel Parallel Object-Oriented Framework for Design Optimization","238833171":"Global Optimization of Stochastic BlackBox Systems via Sequential Kriging Meta-Models","238689109":"Solution-verified reliability analysis and design of bistable MEMS using error estimation and adaptivity","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","222628087":"Fast Probability Integration by Three-Parameter Normal Tail Approximation","245366995":"An Indicator Response Surface Method for Simulation-Based Reliability Analysis","225805894":"Asymptotic approximations for multinormal domain and surface integrals","3329670":"A Curved-Beam Bistable Mechanism","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","250783749":"Reliability-Based Design Optimization for Shape Design of Compliant Micro-Electro-Mechanical Systems","271366423":"Second-Order Reliability Formulations in DAKOTA/UQ","269891688":"Simple Approximations for Improving Second-Order Reliability Estimates","245284449":"New Algorithm for Structural Reliability"},"citedIn":{"242330481":"An Adaptive Hybrid Surrogate Model","283056222":"A study on a stopping criterion for active refinement algorithms in Kriging surrogate models","262357415":"A local adaptive sampling method for reliability-based design optimization using Kriging model","251621497":"Mixed aleatory-epistemic uncertainty quantification with stochastic expansions and optimization-based interval estimation","260544128":"Calibration and Uncertainty Analysis for Computer Simulations with Multivariate Output","283056214":"Assessment of the efficiency of Kriging models for reliability analysis of complex structures","245366953":"A Modified Efficient Global Optimization Algorithm for Maximal Reliability in a Probabilistic Constrained Space","260145162":"Metamodel-based importance sampling for reliability sensitivity analysis","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","290480477":"Integrated multiobjective framework for reliability-based design optimization with discrete design variables","267760507":"Significance, interpretation, and quantification of uncertainty in prognostics and remaining useful life prediction","250587772":"Zur Zuordnung des1H- und des13C-NMR-Spektrums des N-Methylchinolinium-ions","251621483":"Likelihood-based representation of epistemic uncertainty due to sparse point data and/or interval data","266460534":"The KrigInv package: An efficient and user-friendly R implementation of Kriging-based inversion algorithms","258831733":"Kriginv: An efficient and user-friendly implementation of batch sequential inversion strategies based on kriging","250593783":"Energetic Criteria for Oxychlorination Catalysts","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","262576190":"Sequential optimization with particle splitting-based reliability assessment for engineering design under uncertainties","271668393":"Multi-point objective-oriented sequential sampling strategy for constrained robust design","263534764":"A generalized “max-min” sample for surrogate update","266972915":"An efficient reliability method combining Adaptive Importance Sampling and Kriging metamodel","260558619":"Regional sensitivity analysis of aleatory and epistemic uncertainties on failure probability","283056064":"Adaptive surrogate model with active refinement combining Kriging and a trust region method","256970958":"Surrogate modeling of 3D crack growth","255994333":"Adaptive Virtual Support Vector Machine for the Reliability Analysis of High-Dimensional Problems","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","257550842":"Reduced order models for many-query subsurface flow applications","290480885":"Active learning surrogate models for the conception of systems with multiple failure modes","274630648":"A Sequential Sampling Strategy to Improve Reliability-Based Design Optimization With Implicit Constraint Functions","51888191":"Metamodel-based importance sampling for the simulation of rare events","281976935":"A hybrid algorithm for reliability analysis combining Kriging and subset simulation importance sampling","271773593":"Integration of Model Verification, Validation, and Calibration for Uncertainty Quantification in Engineering Systems","262369166":"KrigInv: An efficient and user-friendly implementation of batch-sequential inversion strategies based on Kriging","268477615":"Uncertainty Quantification in Hierarchical Development of Computational Models","282269308":"Structural topology design of container ship based on knowledge-based engineering and level set method","280105735":"A Sampling-based RBDO Algorithm with Local Refinement and Efficient Gradient Estimation","282745068":"Online Adaptive Model Reduction for Nonlinear Systems via Low-Rank Updates","260560317":"Reduced order modeling in iTOUGH2","274196844":"Probabilistic Life Assessment on Fatigue Crack Growth in Mixed-mode by Coupling of Kriging Model and Finite Element Analysis","276091188":"An efficient Kriging method for global sensitivity of structural reliability analysis with non-probabilistic convex model","238080113":"Efficient algorithms for mixed aleatory-epistemic uncertainty quantification with application to radiation-hardened electronics. Part I, algorithms and benchmark results","257101719":"A new adaptive response surface method for reliability analysis","272039922":"Containership structural design and optimization based on knowledge-based engineering and Gaussian process","277351500":"An important boundary sampling method for reliability-based design optimization using kriging model","273833882":"Hybrid reliability analysis with both random and probability-box variables","287759983":"Universal Prediction Distribution for Surrogate Models","283308843":"Global sensitivity analysis-enhanced surrogate (GSAS) modeling for reliability analysis","279211885":"An active learning Kriging model for hybrid reliability analysis with both random and interval variables","258738982":"Test Resource Allocation in Hierarchical Systems Using Bayesian Networks","259097531":"A reliability analysis method for fatigue design","272359280":"Polynomial-Chaos-based Kriging","262909408":"Model parameter estimation with imprecise and unpaired data","282381087":"Locally-optimized covariance kriging for engineering design exploration","282563227":"A new learning function for Kriging and its applications to solve reliability problems in engineering","267671589":"Bias minimization in Gaussian process surrogate modeling for uncertainty quantification","251620910":"Efficient surrogate models for reliability analysis of systems with multiple failure modes","51888194":"Reliability-based design optimization of an imperfect submarine pressure\nhull","235179345":"Probabilistic-Based Modeling and Simulation Assessment","270987507":"Efficient structural reliability analysis method based on advanced Kriging model","261291205":"Assessment of the Efficiency of Kriging Surrogate Models for Structural Reliability Analysis","51890126":"Metamodel-based importance sampling for structural reliability analysis","291013505":"Cross-entropy-based adaptive importance sampling using von Mises-Fisher mixture for high dimensional reliability analysis","242415022":"Reliability-based design optimization using efficient global reliability analysis","273093147":"Mixed Efficient Global Optimization for Time-Dependent Reliability Analysis","283684020":"Numerical Investigations into the Value of Information in Lifecycle Analysis of Structural Systems","291690431":"Aleatory and epistemic uncertainties analysis based on non-probabilistic reliability and its kriging solution","277930062":"Parametric Sensitivity Analysis for Importance Measure on Failure Probability and Its Efficient Kriging Solution","260145246":"Meta-model-based importance sampling for reliability sensitivity analysis","271732561":"Probability and convex set hybrid reliability analysis based on active learning Kriging model","257686079":"Contribution to sample failure probability plot and its solution by Kriging method","290480822":"Assessing small failure probabilities by AK–SS: An active learning method combining Kriging and Subset Simulation","283633536":"A local Kriging approximation method using MPP for reliability-based design optimization","256699307":"Two-stage planar approximation of non-planar crack growth","268038033":"Improved metamodel-based importance sampling for the performance assessment of radioactive waste repositories","281993766":"Uncertainty in prognostics and systems health management","263930576":"Analytical uncertainty quantification for modal frequencies with structural parameter uncertainty using a Gaussian process metamodel","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","221676250":"Meta-models for Structural Reliability and Uncertainty Quantification","259518746":"AK-SYS: An adaptation of the AK-MCS method for system reliability","282247356":"Adaptive Kriging reliability-based design optimization of an automotive body structure under crashworthiness constraints","256972863":"Probabilistic assessment of the structural failure of single-lap bonded joints","263666649":"An improved adaptive kriging-based importance technique for sampling multiple failure regions of low probability","226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","281704632":"Recent Results on Nonparametric Quantile Estimation in a Simulation Model","232405678":"Model validation under epistemic uncertainty","251875959":"Sequential sampling for contour estimation with concurrent function evaluations","258581405":"Multi-Point Sequential Sampling Method for Complex Engineering Optimization Problems","252030066":"Geostatistical sampling optimization of contaminated premises","272386246":"A fuzzy reliability approach for structures based on the probability perspective","283055905":"Assessment of the efficiency of Kriging models for reliability analysis of complex structures","226418689":"A survey on approaches for reliability-based optimization. Struct Multidiscip Optim"},"index":39}