{"abs":"We make an analogy between images and statistical mechanics systems. Pixel gray levels and the presence and orientation of edges are viewed as states of atoms or molecules in a lattice-like physical system. The assignment of an energy function in the physical system determines its Gibbs distribution. Because of the Gibbs distribution, Markov random field (MRF) equivalence, this assignment also determines an MRF image model. The energy function is a more convenient and natural mechanism for embodying picture attributes than are the local characteristics of the MRF. For a range of degradation mechanisms, including blurring, nonlinear deformations, and multiplicative or additive noise, the posterior distribution is an MRF with a structure akin to the image model. By the analogy, the posterior distribution defines another (imaginary) physical system. Gradual temperature reduction in the physical system isolates low energy states (``annealing\u0027\u0027), or what is the same thing, the most probable states under the Gibbs distribution. The analogous operation under the posterior distribution yields the maximum a posteriori (MAP) estimate of the image given the degraded observations. The result is a highly parallel ``relaxation\u0027\u0027 algorithm for MAP estimation. We establish convergence properties of the algorithm and we experiment with some simple pictures, for which good restorations are obtained at low signal-to-noise ratios.","title":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","id":220182914,"url":"https://www.researchgate.net/publication/220182914_Geman_D_Stochastic_relaxation_Gibbs_distribution_and_the_Bayesian_restoration_of_images_IEEE_Trans_Pattern_Anal_Mach_Intell_PAMI-66_721-741","names":["Stuart Geman","Donald Geman","IEEE Transactions on Pattern Analysis and Machine Intelligence"],"references":{"243673478":"Lectures in Pattern Theory I","2993133":"Two-Dimensional Bayesian Estimate of Images","267434162":"Introduction to Random Fields","200622065":"Equation of State Calculations by Fast Computing Machines","238680380":"Segmentation of natural scenes\" in computer vision systems (a","243777740":"An Introduction to Spatial Point Processes and Markov Random Fields","3046245":"Image Restoration, Modelling, and Reduction of Dimensionality","268553359":"Markov Random Fields and Gibbs Ensembles","221669734":"Equations of State Calculations by Fast Computing Machines","242587173":"The Use of Markov Random Fields as Models of Texture","260869405":"Optimal perceptual inference","235890203":"Bayesian-Based Iterative Method of Image Restoration","254204915":"A Special Problem of Brownian Motion, and a General Theory of Gaussian Random Functions","3115960":"Scene Labeling by Relaxation Operation","221669665":"Digital Picture Processing","224377735":"Multiple-Window Parallel Adaptive Boundary Finding in Computer Vision","4000420":"Image segmentation using simple Markov field models","222066725":"Cooperating processes for low-level vision: A survey","224377733":"On the Foundations of Relaxation Labeling Processes","224739015":"Application of the Gibbs distribution to image segmentation","225828439":"Monte Carlo Methods","3081994":"Two Dimensional Discrete Markovian Fields","3081033":"Classification of Binary Random Patterns","224731651":"Two-Dimensional Markov Representations of Sampled Images","224877198":"A New Algorithm for Monte Carlo Simulation of King Spin Systems","3046789":"Bayesian Methods in Nonlinear Digital Image Restoration","266846027":"The description of a random field by means of conditional probabilities and conditions of its regularity","236623799":"The Description of a Random Field by Means of Conditional Probabilities and Conditions of Its Regularity","3177117":"Digital image restoration using spatial interaction models","18148410":"Restoring with Maximum Likelihood and Maximum Entropy","224739018":"Bayes smoothing algorithms for segmentation of images modeled by Markov random fields","3176448":"Digital Image Restoration","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","3479364":"Prior Probabilities","224377707":"Markov Random Field Texture Models","226813042":"Monte Carlo calculation of phase separation in a two-dimensional Ising system","3083797":"Correction to \u0027Estimation and choice of Neighbors in Spatial-Interaction Models of Images\u0027","2996113":"Advances in mathematical models for image processing","236157550":"Markov Random Fields and Their Applications","3176718":"The relationship between image restoration by the MAP method and a ME method"},"citedIn":{},"index":390}