{"abs":"This study offers a multi-response simulation–optimization approach to optimize an Alarm Monitoring Center’s performance. In this paper, the multi-response simulation–optimization application is firstly addressed in the Alarm Monitoring Center. Five performance criteria affect the performance of Alarm Monitoring Center and five factors, each of which has three control levels, are identified. The data belonging to the performance criteria, which are determined, are obtained with the help of the running scenarios combining with the factor levels using Taguchi design. Then, signals to the noise (S/N) ratios are calculated for these which are obtained from the performance data. A decision matrix is generated with S/N ratios; the TOPSIS method is used to transfer the multi-response problems into the single-response problems. The system improvement rate is also determined by finding the levels of factors to optimize the system using Taguchi’s single response optimization methodology.","title":"Multi-response simulation optimization approach for the performance optimization of an Alarm Monitoring Center","id":260521317,"url":"https://www.researchgate.net/publication/260521317_Multi-response_simulation_optimization_approach_for_the_performance_optimization_of_an_Alarm_Monitoring_Center","names":["Barış Şimşek","Yusuf Tansel Ic","Safety Science"],"references":{"257356374":"Call centers with hyperexponential patience modeling","225715317":"Simulation-based metamodels for the analysis of scheduling decisions in a flexible manufacturing system operating in a tool-sharing environment","30844885":"Call Center Staffing with Simulation and Cutting Plane Methods","222377286":"Computer simulation of a PCB production line: Metamodeling approach","222014512":"Supplier selection model using Taguchi loss function, analytical hierarchy process and multi-choice goal programming","222561359":"Designing a model of fuzzy TOPSIS in multiple criteria decision making","227681049":"Response Surface Methodology","46487113":"Queueing models for full-flexible multi-class call centers with real-time anticipated delays","216813155":"Discrete-Event Modeling and Simulation: A Practitioner\u0027s Approach (Computational Analysis, Synthesis, and Design of Dynamic Systems)","229373627":"The simulation design and analysis of a Flexible Manufacturing System with Automated Guided Vehicle System","226774295":"A New Simulation Optimisation System for the Parameters of a Machine Cell Simulation Model","245310859":"The use of a grey-based Taguchi method for optimizing multi-response simulation problems","220674751":"Discrete dynamic simulation models and technique for complex control systems","251880089":"Multiple Criteria Decision Making, Kyoto 1975","222806236":"Multi-response simulation optimization using genetic algorithm within desirability function framework","226340710":"A new algorithm and multi-response Taguchi method to solve line balancing problem in an automotive industry","227307159":"Application of correlation test to criteria selection for multi criteria decision making (MCDM) models","223490638":"A Data Envelopment Analysis Method for Optimizing Multi-Response Problem with Censored Data in the Taguchi Method","222196131":"Combining simulation and goal programming for health care planning in a medical assessment unit. Eur J Oper Res","222419551":"A stochastic programming model for scheduling call centers with global Service Level Agreements","228695433":"FMS design model with multiple objectives using compromise programming","223240034":"Optimization of discrete variable stochastic systems by computer simulation","238003331":"A fuzzy multi-attribute approach to select the welding process at high pressure vessel manufacturing","220594312":"Data driven production modeling and simulation of complex automobile general assembly plant","254331911":"Response Surface Techniques for Dual Response Systems","284802134":"An illustrative study aimed to measure and rank performance of Turkish automotive companies using TOPSIS","245130412":"A fuzzy multi-attribute model for risk evaluation in workplaces","245331116":"Development of a performance measurement model for manufacturing companies using the AHP and TOPSIS approaches","201382078":"Introduction to simulation using SIMAN","220199903":"Simulation optimization using particle swarm optimization algorithm with application to assembly line design","267231149":"Design and Development of a House-Mobile Security System","257356820":"Supporting systems of systems hazard analysis using multi-agent simulation","220674924":"Performance assessment in an interactive call center workforce simulation","224124048":"Redesign of PCB production line with simulation and Taguchi design","223582979":"Solving a multi response simulation optimization problem with discrete variables using a multi attribute decision making method","238761193":"MultAiple Attribute Decision-Making: Methods and Applications. A State-of-the-Art Survey","226752596":"A unique fuzzy multi-criteria decision making: Computer simulation approach for productive operators\u0027 assignment in cellular manufacturing systems with uncertainty and vagueness","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","223575695":"A simulation optimization method that considers uncertainty and multiple performance measures","220534265":"Staffing Multiskill Call Centers via Linear Programming and Simulation","257035404":"A TOPSIS-based Taguchi optimization to determine optimal mixture proportions of the high strength self-compacting concrete","251624093":"Application of a weighted Grey-Taguchi method for optimizing recycled aggregate concrete mixtures","233620110":"Caluclation of an Optimal Region of Operation for Dual Response Systems Fitted from Experimental Data","256294693":"On rank reversal and TOPSIS method","223549375":"The use of the Taguchi method with grey relational analysis to optimize the thin-film sputtering process with multiple quality characteristic in color filter manufacturing","238683220":"Regression Metamodels for Generalizing Simulation Results","233616540":"Solving a multi-objective simulation model using a hybrid response surface method and lexicographical goal programming approach - A case study on integrated circuit ink-marking machines","241038381":"A feasibility study using simulation-based optimization and Taguchi experimental design method for material handling—transfer system in the automobile industry","220636374":"Response surface methodology with stochastic constraints for expensive simulation","222689332":"A Methodology for Fitting and Validating Metamodels in Simulation","225176216":"Applications of the MOORA method for decision making in manufacturing environment. Int J Adv Manuf Technol","236577889":"Job performance prediction in a call center using a naive Bayes classifier","220471900":"Applications of maximum queue lengths to call center management","222013893":"An extension of TOPSIS for group decision making"},"citedIn":{"282376924":"Optimization of Vehicle Ride Comfort and Handling Stability Based on TOPSIS Method"},"index":392}