{"abs":"Gaussian process surrogates of computationally expensive computer codes provide fast statistical approximations to model physical processes. The training of these surrogates depends on the set of design points chosen to run the expensive simulator. However, such training set is bound to be limited and quantifying the resulting uncertainty in the hyper-parameters of the emulator by uni-modal distributions is likely to induce bias. This paper proposes a computationally efficient sampler based on an extension of the Asymptotically Independent Markov Sampling, a recently developed algorithm for Bayesian inference and extended to optimisation problems. Structural uncertainty of the emulator is obtained as a by-product of the Bayesian treatment of the hyper-parameters. Model uncertainty is also acknowledged through numerical stabilisation measures by including a nugget term in the formulation of the probability model. The efficiency of the proposed sampler is illustrated in examples where multi-modal distributions are encountered. For the purpose of reproducibility, further development, and use in other application, we made the code used to generate the examples in this paper freely available for download at https://github.com/agarbuno/paims_codes.","title":"Gaussian process hyper-parameter estimation using parallel asymptotically independent Markov sampling","id":279309842,"url":"https://www.researchgate.net/publication/279309842_Gaussian_process_hyper-parameter_estimation_using_parallel_asymptotically_independent_Markov_sampling","names":["Alfredo Garbuno Iñigo","F. A. DiazDelaO","K. M. Zuev"],"references":{"50402307":"Gaussian Processes for Machine Learning (GPML) toolbox","227522317":"Particle Markov Chain Monte Carlo . . .","45904702":"A Computationally Stable Approach to Gaussian Process Interpolation of\nDeterministic Computer Simulation Data","2609572":"Monte Carlo Implementation of Gaussian Process Models for Bayesian Regression and Classification","223595542":"Stochastic Subset Optimization for optimal reliability problems","4772045":"Bayesian Calibration of Computer Models","2503712":"On Metropolis-Hastings algorithms with delayed rejection","259584383":"Accelerating ABC methods using Gaussian processes","262352043":"Introduction to Monte Carlo Methods","2357871":"Supplementary details on Bayesian Calibration of Computer Models","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","5142913":"Introducing BACCO, an R Bundle for Bayesian Analysis of Computer Code Output","222542935":"An efficient framework for optimal robust stochastic system design using stochastic simulation","257016708":"The effect of the nugget on Gaussian process emulators of computer models","41222435":"Monte Carlo Statistical Method","34019472":"Bayesian uncertainty analysis for complex computer codes.","2320571":"Gaussian Processes for Regression","222783454":"A reflectance model for homogeneous plant canopy and its inversion. Remote Sens. Environ","226755550":"Optimization by Simulated Annealing: Quantitative Studies","239666344":"Regression and Classification Using Gaussian Process Priors","245286591":"Transitional Markov Chain Monte Carlo Method for Bayesian Model Updating, Model Class Selection, and Model Averaging","51013870":"Galaxy Formation: a Bayesian Uncertainty Analysis","45916313":"An Adaptive Sequential Monte Carlo Sampler","271512969":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","2120071":"Default priors for Gaussian processes. Ann Stat","227693306":"Eliciting Gaussian process priors for complex computer codes","225291078":"MCMC using Hamiltonian dynamics","51153575":"A Simple Approach to Ranking Differentially Expressed Gene Expression Time Courses through Gaussian Process Regression","215446267":"Monte Carlo Strategies in Scientic Computing","51943849":"Asymptotically Independent Markov Sampling: a new MCMC scheme for\nBayesian Inference","230873264":"Numerical Optimization Second Edition","262170963":"Global optimization using the asymptotically independent Markov sampling method","2306327":"Annealed Importance Sampling","229881286":"Objective Bayesian analysis of spatial data with measurement error","2469200":"Integrated Likelihood Methods for Eliminating Nuisance Parameters","265409508":"Parameter estimation for Gaussian process emulators","221668291":"On adaptive resampling strategies for sequential Monte Carlo methods","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","24168392":"The formal definition of reference priors","220692253":"Engineering Design via Surrogate Modelling: A Practical Guide","228974174":"Modified Metropolis-Hastings algorithm with delayed rejection","38322292":"An Adaptive Metropolis Algorithm","2777175":"Sampling from Multimodal Distributions Using Tempered Transitions","4993330":"Sequential Monte Carlo Samplers","243774072":"On the development of reference priors","228339939":"Diagnostics for Gaussian Process Emulators"},"citedIn":{},"index":400}