{"abs":"This work introduces the use of the treed Gaussian process (TGP) as a surrogate model within the mesh adaptive direct search (MADS) framework for constrained blackbox optimization. It extends the surrogate management framework (SMF) to nonsmooth optimization under general constraints. MADS uses TGP in two ways: one, as a surrogate for blackbox evaluations, and two, to evaluate statistical criteria such as the expected improvement and the expected reduction in variance. The efficiency of the method is tested on two problems: a synthetic one with many local optima, and one real application from a chemical engineering simulator for styrene production. In both cases we show that the TGP surrogate is preferable to a quadratic model and to MADS without any surrogate at all. Keywords: Blackbox optimization, treed Gaussian processes (TGP), mesh adaptive direct search (MADS), surrogate management framework (SMF).","title":"The mesh adaptive direct search algorithm with treed Gaussian process surrogates","id":260317958,"url":"https://www.researchgate.net/publication/260317958_The_mesh_adaptive_direct_search_algorithm_with_treed_Gaussian_process_surrogates","names":["Robert B Gramacy","Sébastien Le Digabel","Pacific Journal of Optimization"],"references":{"5142988":"tgp: An R Package for Bayesian Nonstationary, Semiparametric Nonlinear Regression and Design by Treed Gaussian Process Models","45904702":"A Computationally Stable Approach to Gaussian Process Interpolation of\nDeterministic Computer Simulation Data","234037242":"Templating and Automatic Code Generation for Performance with Python","2749603":"On the Convergence of Pattern Search Algorithms. SIAM J on Optimization 7: 1-25","220249390":"Nonsmooth optimization through Mesh Adaptive Direct Search and Variable Neighborhood Search","226066664":"A particle swarm pattern search method for bound constrained global optimization","222543697":"Finding local optima of high-dimensional functions using direct search methods","48190924":"Convergence rates of efficient global optimization algorithms","245310602":"Decomposition of Multidisciplinary Optimization Problem: Formulations and Application to a Simplified Wing Design","231966020":"Trailing-edge noise reduction using derivative-free optimization and large-eddy simulation","234109038":"Composite Gaussian process models for emulating expensive functions","216301381":"The Design and Analysis Computer Experiments","277522350":"Algorithm 856","220133177":"Using Sampling and Simplex Derivatives in Pattern Search Methods","220492812":"Algorithm 856: APPSPACK 4.0: asynchronous parallel pattern search for derivative-free optimization.","257196540":"Error estimation properties of Gaussian process models in stochastic simulations","45888917":"Dynamic Trees for Learning and Design","222403818":"Tabu Search directed by direct search methods for nonlinear global optimization","223549948":"Constrained optimization involving expensive function evaluations: A sequential approach","220493202":"NOMAD: Nonlinear optimization with the MADS algorithm","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","222524916":"A computational framework for derivative-free optimization of cardiovascular geometries","258435933":"USING SIMPLEX GRADIENTS OF NONSMOOTH FUNCTIONS IN DIRECT SEARCH METHODS","45931398":"Cases for the Nugget in modelling computer experiments","267145425":"Optimization Subject to Hidden Constraints via Statistical Emulation","220343522":"Bayesian Treed Models","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","226162108":"Test Examples for Nonlinear Programming Codes","225402024":"Incorporating minimum Frobenius norm models in direct search","257196060":"Stochastic Nelder–Mead simplex method – A new globally convergent direct search method for simulation optimization","220163671":"Application of MATLAB and Python optimizers to two case studies involving groundwater flow and contaminant transport modeling","241216681":"Bayesian Guided Pattern Search for Robust Local Optimization","41781559":"Gaussian Process for Machine Learning","220133585":"Mesh Adaptive Direct Search Algorithms for Constrained Optimization","225982893":"Globalization strategies for Mesh Adaptive Direct Search","222297190":"Parallel radial basis function methods for the global optimization of expensive functions","2582140":"Nonlinear programming without a penalty function. Math. Program. Ser. A 91, 239-269","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","2450683":"Bayesian CART model search","220133500":"OrthoMADS: a deterministic MADS instance with orthogonal directions","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","242502547":"A Progressive Barrier for Derivative-Free Nonlinear Programming","220133492":"Parallel Space Decomposition of the Mesh Adaptive Direct Search Algorithm","46491561":"A mesh adaptive direct search algorithm for multiobjective optimization","233033743":"Use of quadratic models with mesh-adaptive direct search for constrained black box optimization","277393380":"Algorithm 909","220133107":"Benchmarking Derivative-Free Optimization Algorithms","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","46515760":"Categorical Inputs, Sensitivity Analysis, Optimization and Importance Tempering with tgp Version 2, an R Package for Treed Gaussian Process Models","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","45913547":"Optimization Under Unknown Constraints","272059214":"Derivative-Free Hybrid Optimization Method for Top Design of Satellite System","220133093":"Erratum: Mesh Adaptive Direct Search Algorithms for Constrained Optimization.","234802435":"Introduction to derivative-free optimization, MPS-SIAM series on Optimization","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand"},"citedIn":{"291350761":"Tree-Based Response Surface Analysis","263454963":"Comment: On Advances in Expected Improvement","271741717":"A variance-based method to rank input variables of the Mesh Adaptive Direct Search algorithm","268009969":"Optimization of Algorithms with OPAL","279474705":"OPTIMIZATION OF ALGORITHMS WITH THE OPAL FRAMEWORK","265047334":"Metamaterial Design by Mesh Adaptive Direct Search","288581688":"Algorithmic Parameter Optimization of the DFO Method with the OPAL Framework","275890684":"Statistical Surrogate Formulations for Simulation-Based Design Optimization","262938961":"Bayesian treed response surface models"},"index":408}