{"abs":"This paper presents a new efficient multi-objective evolutionary algorithm for solving computationally-intensive optimization problems. To support a high degree of parallelism, the algorithm is based on a steady-state design. For improved efficiency the algorithm utilizes a surrogate to identify promising candidate solutions and filter out poor ones. To handle the uncertainties associated with the approximative surrogate evaluations, a new method for multi-objective optimization is described which is generally applicable to all surrogate techniques. In this method, basically, surrogate objective values assigned to offspring are adjusted to consider the error of the surrogate. The algorithm is evaluated on the ZDT benchmark functions and on a real-world problem of manufacturing optimization. In assessing the performance of the algorithm, a new performance metric is suggested that combines convergence and diversity into one single measure. Results from both the benchmark experiments and the real-world test case indicate the potential of the proposed algorithm.","title":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","id":224330154,"url":"https://www.researchgate.net/publication/224330154_A_Parallel_Surrogate-Assisted_Multi-Objective_Evolutionary_Algorithm_for_Computationally_Expensive_Optimization_Problems","names":["Anna Syberfeldt","Henrik Grimm","Amos H.C. Ng","Robert John"],"references":{"2508196":"A Fully Sequential Procedure for Indifference-Zone Selection in Simulation","220741295":"Fitness inheritance for noisy evolutionary multi-objective optimization","216300590":"Metamodel—Assisted Evolution Strategies","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","3810347":"Optimal sampling strategies for learning a fitness model","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","12809680":"Deb, K.: Multi-Objective Genetic Algorithms: Problem Difficulties and Construction of Test Problems. Evolutionary Computation 7, 205-230","258950396":"Simulation Modeling and Analysis","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","235710041":"Multiobjective Optimization Using Surrogates","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","254379016":"METAMODEL-ASSISTED MULTI-OBJECTIVE EVOLUTIONARY OPTIMIZATION","2889038":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","222919851":"Empirical comparison of search algorithms for discrete event simulation","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","3301905":"Approximation Capability in by Multilayer Feedforward Networks and Related Problems","3933083":"Future of simulation optimization","4170900":"Fitness inheritance in multi-objective particle swarm optimization","228615884":"A multi-objective optimization procedure with successive approximate models","2532946":"Fitness Inheritance in Multi-Objective Optimization","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","2922005":"Evolution Strategies assisted by Gaussian Processes with Improved Pre-Selection Criterion","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","238319435":"Simulation-Based Optimization: Parametric Optimization Techniques and Reinforcement Learning"},"citedIn":{"258188145":"Simulation-based optimization for design parameter exploration in hybrid system: A defense system example","235720063":"An application of a GA with Markov network surrogate to feature selection","256756873":"Development of a multi-objective optimization algorithm using surrogate models for coastal aquifer management","283804158":"Parallel Multiobjective Evolutionary Algorithms","287992462":"Multi-Objective Adaptive Surrogate Modeling-Based Optimization for Parameter Estimation of Large, Complex Geophysical Models","46491920":"Evolutionary optimisation of noisy multi-objective problems using confidence-based dynamic resampling","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","235720068":"The Markov Network Fitness Model","275722055":"Constrained, mixed-integer and multi-objective optimisation of building designs by NSGA-II with fitness approximation","261430380":"Similarity-based evolution control for fitness estimation in particle swarm optimization","262372392":"Approximation Assisted Optimization with Combined Global and Local Metamodeling","261045347":"Fitness Modeling With Markov Networks"},"index":41}