{"abs":"Gaussian process (GP) models are widely used to emulate propagation un-certainty in computer experiments. GP emulation sits comfortably within an analytically tractable Bayesian framework. Apart from propagating uncertainty of the input variables, a GP emulator trained on finitely many runs of the experiment also offers error bars for response surface estimates at unseen input values. This helps select future input values where the experiment should be run to minimise the uncertainty in the response surface estimation. However, traditional GP emulators use stationary covariance functions, which perform poorly and lead to sub-optimal selection of future input points when the response surface has sharp local features, such as a jump discontinuity or an isolated tall peak. We propose an easily implemented non-stationary GP emulator, based on two stationary GPs, one nested into the other, and demonstrate its superior ability in handling local features and selecting future input points from the boundaries of such features.","title":"Computer emulation with non-stationary Gaussian processes","id":271511799,"url":"https://www.researchgate.net/publication/271511799_Computer_emulation_with_non-stationary_Gaussian_processes","names":["Silvia Montagna","Surya Tokdar"],"references":{"2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","4772045":"Bayesian Calibration of Computer Models","2538401":"Infinite Mixtures of Gaussian Process Experts","239667584":"A Framework for Validation of Computer Models","223189508":"Hierarchical adaptive experimental design for Gaussian process emulators","256197775":"Numerical Simulations and Observations of Surface Wave Fields under an Extreme Tropical Cyclone","2869031":"Nonstationary Covariance Functions for Gaussian Process Regression","45893043":"Elliptical Slice Sampling.","222504913":"Neural Network Exploration Using Optimal Experiment Design","257016708":"The effect of the nugget on Gaussian process emulators of computer models","2393075":"The Ocean\u0027s Effect on the Intensity of Tropical Cyclones: Results from a Simple Coupled Atmosphere-Ocean Model","45868908":"Adaptive Bayesian estimation using a Gaussian random field with inverse Gamma bandwidth. The Annals of Statistics 37","234109038":"Composite Gaussian process models for emulating expensive functions","2455557":"Information--Based Objective Functions for Active Data Selection","243637348":"Nonparametric Estimation of Nonstationary Spatial Covariance Structure","216301381":"The Design and Analysis Computer Experiments","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","228986305":"Expert Knowledge and Multivariate Emulation: The Thermosphere–Ionosphere Electrodynamics General Circulation Model (TIE-GCM)","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","4741989":"Analyzing Nonstationary Spatial Data Using Piecewise Gaussian Processes","228868425":"Particle learning for sequential Bayesian computation","4772026":"Following a moving target-Monte Carlo inference for dynamic Bayesian models","249908049":"Nonstationary Gaussian Process Regression using a Latent Extension of the Input Space","26856431":"A Sequential Monte Carlo Method for Bayesian Analysis of Massive Datasets","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","228339939":"Diagnostics for Gaussian Process Emulators","4772151":"Bayesian inference for non-stationary spatial covariance structure via spatial deformations","27771992":"Numerical simulation of explosive volcanic eruptions from the conduit flow to global atmospheric scales"},"citedIn":{},"index":411}