{"abs":"Conventional sampling-based uncertainty quantification (UQ) methods involve generating large numbers of random samples on input variables and calculating output statistics by evaluating the computational model for each set of samples. For real world applications, this method can be computationally prohibitive due to the cost of the model and the time required for each simulation run. Using response surface approximations may allow for the output statistics to be estimated more accurately when only a limited number of simulation runs are available. This paper describes an initial investigation into response surface based UQ using both kriging and multivariate adaptive regression spline surface approximation methods. In addition, the impact of two different data sampling methods, Latin hypercube sampling and orthogonal array sampling, is also examined. The data obtained from this study indicate that caution should be exercised when implementing response surface based methods for UQ using very low sample sizes. However, this study also shows that there are clear cases where response surface based UQ provides a gain in accuracy versus conventional sampling-based UQ methods.","title":"The promise and peril of uncertainty quantification using response surface approximations","id":263530325,"url":"https://www.researchgate.net/publication/263530325_The_promise_and_peril_of_uncertainty_quantification_using_response_surface_approximations","names":["A. A. Giunta","J. M. McFarland","L. P. Swiler","Michael Scott Eldred","Structure and Infrastructure Engineering"],"references":{"250754768":"9 Computer experiments","223269739":"Comparison of response surface and neural network with other methods for structural reliability analysis","38359473":"Multi-Variate Adaptive Regression Splines (with Discussion)","222390634":"Construction of response surfaces based on progressive-lattice-sampling experimental design with application to uncertainty propagation","223906278":"Application of Kriging method to structural reliability"},"citedIn":{"268478403":"Effective Tests for Discovering Unexpected Structural Failure Modes","277919892":"Kriging response surface reliability analysis of a ship-stiffened plate with initial imperfections","254042402":"Improved reliability approximate method combining Kriging and importance sampling","265013708":"Development and validation of a dynamic metamodel based on stochastic radial basis functions and uncertainty quantification","260544128":"Calibration and Uncertainty Analysis for Computer Simulations with Multivariate Output","262921699":"A framework for efficient simulation-based multidisciplinary robust design optimization with application to a keel fin of a racing sailboat","52003280":"Foundations of Computational Intelligence Volume 1: Learning and Approximation","241077911":"A Complete Framework for Verification, Validation, and Uncertainty Quantification in Scientific Computing (Invited)","277458181":"Aircraft Conceptual Design Optimization Considering Fidelity Uncertainties","272591218":"Accurate predictions from noisy data: replication versus exploration with applications to structural failure","255594476":"Epistemic Uncertainty in the Calculation of Margins","273597022":"A New Hybrid Intelligent Algorithm for Fuzzy Multiobjective Programming Problem Based on Credibility Theory","251620910":"Efficient surrogate models for reliability analysis of systems with multiple failure modes","266829244":"Chinese translation of [Design and Analysis of Simulation Experiments]","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","228631491":"Comparison of Uncertainty Propagation / Response Surface Techniques for Two Aeroelastic Systems","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","268475239":"Constructing Response Surfaces Using Imperfect Function Evaluations","236124661":"Erratum: Active Subspace Methods in Theory and Practice: Applications to Kriging Surfaces","228943945":"Epistemic uncertainty quantification tutorial","276152283":"Uncertainty quantification analysis of the dynamics of an electrostatically actuated microelectromechanical switch model","225401439":"Automatic Approximation of Expensive Functions with Active Learning","223063416":"Error and variability characterization in structural dynamics modeling","277733243":"CSRI Summer Proceedings 2010","253397473":"Risk analysis: Frequentist and Bayesians unite!","254215385":"Maintenance, management, life-cycle design and performance of structures and infrastructures: a brief review"},"index":415}