{"abs":"In this paper we propose a new class of samplers for full Bayesian inference in general state-space models, called marginalized sequential monte carlo samplers. Here the dynamic states are approximately marginalized out using particle filters. Then, to sample from the fixed parameters, we set up a density-tempered bridge between the prior and the posterior and operate a sequential monte carlo sampler over this sequence. The approach delivers exact draws from the joint posterior of the fixed parameters and the hidden states for any given number of state particles and is easily parallelized. Given that it incorporates the sample information in a smooth fashion, it shows good performance in the presence of outliers. Further we also show how to use density tempering to automatically adjust the number of state particles. We illustrate the use of the method on a linear gaussian state space model, on a GARCH-type model of stock prices with microstructure noise and on a structural credit risk model with stochastic asset volatility.","title":"Density-Tempered Marginalized Sequential Monte Carlo Samplers","id":228261326,"url":"https://www.researchgate.net/publication/228261326_Density-Tempered_Marginalized_Sequential_Monte_Carlo_Samplers","names":["Andras Fulop","Jin-Chuan Duan","Journal of Business and Economic Statistics"],"references":{"227522317":"Particle Markov Chain Monte Carlo . . .","227811414":"The weighted likelihood, Canad","228168222":"Sequential Learning, Predictability, and Optimal Portfolio Returns","255857098":"Sequential Monte Carlo Sampling for DSGE Models","49458431":"A tutorial on adaptive MCMC","2453431":"A Sequential Particle Filter Method for Static Models","23566004":"Bayesian inference based only on simulated likelihood: Particle filter analysis of dynamic economic models","4895838":"Conditional Heteroskedasticity in Asset Returns: A New Approach","228338569":"An Adaptive Sequential Monte Carlo Method for Approximate Bayesian Computation","1825409":"Sequential monte carlo samplers","223094826":"GARCH (p, q) process and its diffusion limit","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","228626697":"Sequential Monte Carlo for Bayesian Computation","227513442":"Inference for Lévy Driven Stochastic Volatility Models Via Adaptive Sequential Monte Carlo","45922769":"Auxiliary Particle filtering within adaptive Metropolis-Hastings Sampling","200744518":"Sequential Monte-Carlo Methods in Practice","50425584":"Sequential Monte Carlo Samplers: Error Bounds and Insensitivity to Initial Conditions","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","257146976":"On some properties of Markov chain Monte Carlo simulation methods based on the particle filter","47663330":"Particle Learning and Smoothing","48182441":"SMC2: An efficient algorithm for sequential analysis of state space models","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","284675338":"Particle Markov chain Monte Carlo methods (with discussion)","4993330":"Sequential Monte Carlo Samplers","4843383":"Estimating Macroeconomic Models: A Likelihood Approach","228204581":"Efficient Learning via Simulation: A Marginalized Resample-Move Approach"},"citedIn":{"48182441":"SMC2: An efficient algorithm for sequential analysis of state space models"},"index":422}