{"abs":"We present here new results in Wavelet Multi-Resolution Analysis (W-MRA) applied to shape recognition in automatic vehicle driving applications. Different types of shapes have to be recognized in this framework. They pertain to most of the objects entering the sensors field of a car. These objects can be road signs, lane separation lines, moving or static obstacles, other automotive vehicles, or visual beacons. The recognition process must be invariant to global, affine or not, transformations which are : rotation, translation and scaling. It also has to be invariant to more local, elastic, deformations like the perspective (in particular with wide angle camera lenses), and also like deformations due to environmental conditions (weather : rain, mist, light reverberation) or optical and electrical signal noises. To demonstrate our method, an initial shape, with a known contour, is compared to the same contour altered by rotation, translation, scaling and perspective. The curvature computed for each contour point is used as a main criterion in the shape matching process. The original part of this work is to use wavelet descriptors, generated with a fast orthonormal W-MRA, rather than Fourier descriptors, in order to provide a multi-resolution description of the contour to be analyzed. In such way, the intrinsic spatial localization property of wavelet descriptors can be used and the recognition process can be speeded up. The most important part of this work is to demonstrate the potential performance of Wavelet-MRA in this application of shape recognition.","title":"Automated, Transformation Invariant, Shape Recognition Through Wavelet Multiresolution","id":235672371,"url":"https://www.researchgate.net/publication/235672371_Automated_Transformation_Invariant_Shape_Recognition_Through_Wavelet_Multiresolution","names":["Brault Mounier"],"references":{"3192720":"Multiresolution analysis in extraction of reference lines from documents with gray level background","3192721":"Recognition of 2D object contours using the wavelet transform zero-crossing representation","2766955":"Multiresolution Sequential Edge Linking","225092552":"A Wavelet Tour of Signal Processing","3560497":"Subpixel contour matching using continuous dynamic programming","2322123":"Content-based Object Retrieval Using Maximum Curvature Points In Contour Images","3077959":"Shiftable Multiscale Transforms.","3671538":"Multiscale shape analysis using the continuous wavelet transform","3192381":"Dynamic programming for detecting, tracking, and matching deformable contours","3193501":"Representation and self-similarity of shapes","3532536":"Multiresolution representations using the auto-correlation functions of compactly supported wavelets","220183185":"Feature Extraction From Wavelet Coefficients for Pattern Recognition Tasks.","3191935":"The Design and Use of Steerable Filters","3192737":"Wavelet-based affine invariant representation: a tool for recognizing planar objects in 3d space. IEEE Trans PAMI","222467761":"Determining the similarity of deformable shapes. Vision Research, Vol. 38","3192036":"Characterization of Signals From Multiscale Edges","2674588":"Invariant Fourier-Wavelet Descriptor For Pattern Recognition","248617893":"The desgin and use of steerable lter","235684152":"Wavelet Multi-Resolution Transform Applied to Shape Recognition Based on a Curvature Criterion","3192521":"Object matching using deformable templates","253755547":"Multiresolution moment-Fourier-wavelet descriptor for 2D pattern recognition","3314604":"Discrete Wavelet Transform: Wedding the A Trous and Mallat Algorithms"},"citedIn":{"228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","259308339":"Scalable Region-matching Motion Estimation Based on an Unsupervised Spatial Segmentation","42797780":"A wavelet-coefficient score for comparison of two-dimensional climatic-data fields","2905091":"Motion Estimation and Video Compression with Spatio-Temporal Motion-Tuned Wavelets"},"index":423}