{"abs":"Undirected graphical models are widely used in statistics, physics and machine vision. However Bayesian parameter estimation for undirected models is extremely challenging, since evaluation of the posterior typically involves the calculation of an intractable normalising constant. This problem has received much attention, but very little of this has focussed on the important practical case where the data consists of noisy or incomplete observations of the underlying hidden structure. This paper specifically addresses this problem, comparing two alternative methodologies. In the first of these approaches particle Markov chain Monte Carlo (Andrieu et al., 2010) is used to efficiently explore the parameter space, combined with the exchange algorithm (Murray et al., 2006) for avoiding the calculation of the intractable normalising constant (a proof showing that this combination targets the correct distribution in found in a supplementary appendix online). This approach is compared with approximate Bayesian computation (Pritchard et al., 1999). Applications to estimating the parameters of Ising models and exponential random graphs from noisy data are presented. Each algorithm used in the paper targets an approximation to the true posterior due to the use of MCMC to simulate from the latent graphical model, in lieu of being able to do this exactly in general. The supplementary appendix also describes the nature of the resulting approximation.","title":"Bayesian Parameter Estimation for Latent Markov Random Fields and SocialNetworks","id":221707689,"url":"https://www.researchgate.net/publication/221707689_Bayesian_Parameter_Estimation_for_Latent_Markov_Random_Fields_and_SocialNetworks","names":["Richard G Everitt","Journal of Computational and Graphical Statistics"],"references":{"27468515":"An efficient MCMC method for distributions with intractable normalising constants","227522317":"Particle Markov Chain Monte Carlo . . .","253447513":"Adaptivity for ABC algorithms: the ABC-PMC scheme","257673689":"ABC methods for model choice in Gibbs random fields","6540772":"Sequential Monte Carlo without likelihoods. Proc Natl Acad Sci","41518324":"Bayesian computation for statistical models with intractable normalizing constants","225149862":"A Tutorial on Learning With Bayesian Networks","222419087":"Friel, N.: Bayesian inference for exponential random graph models. Soc. Netw. 33(1), 41-55","228828589":"The linked importance sampler auxiliary variable metropolis hastings algorithm for distributions with intractable normalising constants","12696590":"Population growth of human Y chromosomes: A study of Y chromosome microsatellites","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","228338569":"An Adaptive Sequential Monte Carlo Method for Approximate Bayesian Computation","216632880":"Markov Graphs","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","1825409":"Sequential monte carlo samplers","238879840":"Bayesian Inference in Hidden Markov Random Fields for Binary Data Defined on Large Lattices","30996602":"On Gibbs Sampling for State Space Models","233950933":"On the Statistical-Analysis of Dirty Pictures","48178234":"Approximate Bayesian Computational methods","229157569":"Bayesian Learning in Undirected Graphical Models: Approximate MCMC\nalgorithms","267069383":"Importance sampling, simulated tempering, and umbrella sampling","222560436":"“Analysing Exponential Random Graph (P*) Models with Missing Data Using Bayesian Data Augmentation","2544726":"Markov Chain Monte Carlo Estimation of Exponential Random Graph Models","228092010":"MCMC for doubly-intractable distributions","243769716":"“The Statistical Analysis of Non-Lattice Data.”","2306327":"Annealed Importance Sampling","250268380":"Hot Coupling: A Particle Approach to Inference and Normalization on Pairwise Undirected Graphs of Arbitrary Topology","2469075":"Auxiliary Variable Methods for Markov Chain Monte Carlo with Applications","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","242706958":"Spatial interaction and statistical analysis of lattice systems","8970227":"Markov Chain Monte Carlo without likelihoods","4744627":"Hidden Markov Models and Disease Mapping","216636373":"Constrained Monte Carlo Maximum LIkelihood for Dependent Data","24063314":"“Logit Models and Logistic Regressions for Social Networks: III. Valued Relations.”","220345500":"Exact sampling with couple Markov chains and applications to statistical mechanics"},"citedIn":{"257028465":"On non-negative unbiased estimators","277967859":"On particle Gibbs sampling","234114006":"Evidence and Bayes Factor Estimation for Gibbs Random Fields","258247200":"Second-order Particle MCMC for Bayesian Parameter Inference","260022360":"Sequential Monte Carlo for Graphical Models","261836370":"On Feynman-Kac and particle Markov chain Monte Carlo models","257199454":"Calibrated path sampling and stepwise bridge sampling","291353622":"Bayesian model comparison with un-normalised likelihoods","264936676":"Exploiting Multi-Core Architectures for Reduced-Variance Estimation with Intractable Likelihoods","235895904":"Estimating the Granularity Coefficient of a Potts-Markov Random Field Within a Markov Chain Monte Carlo Algorithm","237012751":"Populations in Statistical Genetic Modelling and Inference","236124482":"On the particle Gibbs sampler","259695434":"Exact Bayesian Inference for the Bingham Distribution","281831740":"Estimating uncertainty and reliability of social network data using Bayesian inference","269326334":"Propagation of facial identities in a social network","282639340":"Bayesian inference for misspecified exponential random graph models","227173309":"Computing the Cramer-Rao Bound of Markov Random Field Parameters: Application to the Ising and the Potts Models","276259852":"Efficient computational strategies for Bayesian social networks","272376704":"An Adaptive Exchange Algorithm for Sampling from Distributions with Intractable Normalizing Constants","290263376":"A novel approach for Markov Random Field with intractable normalising constant on large lattices","260089278":"Geometric summary statistics for ABC model choice between hidden Gibbs random fields","260910643":"Pre-processing for approximate Bayesian computation in image analysis","271140726":"Fully Bayesian Binary Markov Random Field Models: Prior Specification and Posterior Simulation"},"index":427}