{"abs":"In many areas of science and technology, mathematical models are built to simulate complex real world phenomena. Such models are typically implemented in large computer programs and are also very complex, such that the way that the model responds to changes in its inputs is not transparent. Sensitivity analysis is concerned with understanding how changes in the model inputs influence the outputs. This may be motivated simply by a wish to understand the implications of a complex model but often arises because there is uncertainty about the true values of the inputs that should be used for a particular application. A broad range of measures have been advocated in the literature to quantify and describe the sensitivity of a model\u0027s output to variation in its inputs. In practice the most commonly used measures are those that are based on formulating uncertainty in the model inputs by a joint probability distribution and then analysing the induced uncertainty in outputs, an approach which is known as probabilistic sensitivity analysis. We present a Bayesian framework which unifies the various tools of prob- abilistic sensitivity analysis. The Bayesian approach is computationally highly efficient. It allows effective sensitivity analysis to be achieved by using far smaller numbers of model runs than standard Monte Carlo methods. Furthermore, all measures of interest may be computed from a single set of runs.","title":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","id":227615641,"url":"https://www.researchgate.net/publication/227615641_Probabilistic_sensitivity_analysis_of_complex_models_A_Bayesian_approach","names":["Jeremy E. Oakley","Anthony Hagan","Anthony O\u0027Hagan","Journal Of The Royal Statistical Society"],"references":{"247487939":"Sensitivity analysis for non linear mathematical model","5207179":"Bayesian inference for the uncertainty distribution of computer model outputs. Biometrika","4772045":"Bayesian Calibration of Computer Models","239667584":"A Framework for Validation of Computer Models","38326849":"Sensitivity Anaysis as an Ingredient of Modeling","257392281":"Statistical Analyses of Scatterplots to Identify Important Factors in Large-Scale Simulations, 1: Review and Comparison of Techniques","243042867":"Sensitivity Analysis and Related Analyses: A Review of Some Statistical Techniques","4744220":"Bayesian Forecasting for Complex Systems Using Computer Simulators","235324242":"Sensitivity Analysis","243103400":"On the Relative Importance of Input Factors in Mathematical Models","245078917":"Importance Measures in Global Sensitivity Analysis of Nonlinear Models","243685542":"Kendall\u0027\u0027s Advanced Theory of Statistics","239666344":"Regression and Classification Using Gaussian Process Priors","224583616":"An Analytic Method for Uncertainty Analysis of Nonlinear Output Functions, With Applications to Fault-Tree Analysis","4745834":"On the Relative Importance of Input Factors in Mathematical Models: Safety Assessment for Nuclear Waste Disposal","11031179":"Sensitivity analysis for healthcare models fitted to data by statistical methods","227693306":"Eliciting Gaussian process priors for complex computer codes","265454203":"Bayes-Hermite quadrature","265632761":"Uncertainty analysis and other inference tools for complex computer codes. (With discussion)","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","263061534":"About the use of rank transformation in sensitivity analysis of model output. Reliab Eng Syst Saf 50: 225-239","243587760":"A Quantitative Model-Independent Method for Global Sensitivity Analysis of Model Output","234882741":"Study of the Sensitivity of Coupled Reaction Systems to Uncertainties in Rate Coefficients. I. Theory","245306470":"Sensitivity analysis of computer models: World Bank HDM-III model","216301661":"Screening, Predicting, and Computer Experiments","24065430":"Modelling, making inferences and making decisions: The roles of sensitivity analysis","228703708":"Value of Information for Complex Cost-Effectiveness Models","2358365":"Pressure Matching for Hydrocarbon Reservoirs: A Case Study in the Use of Bayes Linear Strategies for Large Computer Experiments"},"citedIn":{"222581573":"Bayesian emulation of complex multi-output and dynamic computer models","259398519":"Sensitivity Analysis of the SimSphere SVAT Model in the Context of EO-based Operational Products Development","42606210":"Decision-Theoretic Sensitivity Analysis for Complex Computer Models","220136214":"Automatically finding the control variables for complex system behavior","46511310":"Gaussian process emulation of dynamic computer codes","259176825":"Multiresponse Metamodeling in Simulation-Based Design Applications","257018718":"BREAM: A probabilistic Bystander and Resident Exposure Assessment Model of spray drift from an agricultural boom sprayer","262297010":"The spatial framework for weight sensitivity analysis in AHP-based multi-criteria decision making","3885609":"Block volume rendering using accelerator board in medical images","267210745":"Fast Parameter Sensitivity Analysis of PDE-Based Image Processing Methods","220257077":"From screening to quantitative sensitivity analysis. A unified approach","239890009":"Sensitivity in risk analyses with uncertain numbers","223599947":"Assessment of the sensitivity and prediction uncertainty of evaporation models applied to Nasser Lake, Egypt","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","235997709":"Bayesian Uncertainty Analysis of the Global Dynamics of Persistent Organic Pollutants: Towards Quantifying the Planetary Boundaries for Chemical Pollution","282622148":"Sensitivity analysis: A review of recent advances","256115545":"An Efficient Integrated Approach for Global Sensitivity Analysis of Hydrologic Model Parameters","220385596":"Discussion (3): Jones-Johnson Paper","259151213":"A Random Field Model and its Application in Industrial Production","223742838":"A global Bayesian sensitivity analysis of the 1d SimSphere soil–vegetation–atmospheric transfer (SVAT) model using Gaussian model emulation","257162096":"Moving least squares based sensitivity analysis for models with dependent variables","3205654":"Improving River Flood Extent Delineation From Synthetic Aperture Radar Using Airborne Laser Altimetry","280726675":"Computationally inexpensive identification of non-informative model parameters by sequential screening","224073074":"Time-frequency distribution mappings of somatosensory evoked potentials","276912814":"Quickly Assessing Contributions to Input Uncertainty","272381971":"Hybrid Bayesian Solution to NASA Langley Research Center Multidisciplinary Uncertainty Quantification Challenge","227778978":"Gaussian Process Metamodeling in Bayesian Value of Information Analysis: A Case of the Complex Health Economic Model for Breast Cancer Screening","224767828":"Update 1 of: Sensitivity Analysis for Chemical Models","222407538":"Sensitivity analysis based on regional splits (SARS—RT)","266098159":"Uncertainty And Sensitivity Analysis For Long-Running Computer Codes: A Critical Review","6627414":"Monte Carlo Probabilistic Sensitivity Analysis for Patient Level Simulation Models","268640823":"Uncertainty quantification in scientific computing. 10th IFIP WG 2.5 working conference, WoCoUQ 2011, Boulder, CO, USA, August 1–4, 2011. Revised selected papers","265409508":"Parameter estimation for Gaussian process emulators","276500557":"Global sensitivity analysis of a CNC machine tool: application of MDRM","259171147":"A quantification of robustness","222427005":"Calculations of Sobol indices for the Gaussian process metamodel","44652693":"Bayesian local influence for survival models","236343848":"Smoothing spline analysis of variance approach for global sensitivity analysis of computer codes","233218471":"Discussion of “Opportunities and Issues in Multiple Data Type Meta-Analyses”","4742154":"Bayes Linear Calibrated Prediction for Complex Systems","264921993":"Estimating sensitivity indices based on Gaussian process metamodels with compactly supported correlation functions","221112169":"Bayesian Active Learning for Sensitivity Analysis","234012090":"The Role of Value-of-Information Analysis in a Health Care Research Priority Setting: A Theoretical Case Study","263942129":"Transport, Zwitterions, and the Role of Water for CO2 Adsorption in Mesoporous Silica-Supported Amine Sorbents","267178407":"Gaussian process modeling with inequality constraints","234012089":"An Efficient Method for Computing Single-Parameter Partial Expected Value of Perfect Information","222520591":"Probability is perfect, but we can\u0027t elicit it perfectly","275620385":"Invariant Probabilistic Sensitivity Analysis","236159069":"Sensitivity analysis of computer models","5344798":"A Fast and Reliable Computational Method for Estimating Population Genetic Parameters","238384762":"Joint metamodeling for sensitivity analysis of continuous and stochastic inputs of a computer code","261698506":"Compartmental modelling of social dynamics with generalised peer incidence","261512645":"A Review on Global Sensitivity Analysis Methods","261444544":"An operational epidemiological model for calibrating agent-based simulations of pandemic influenza outbreaks","254331262":"Multivariate Gaussian Process Emulators With Nonseparable Covariance Structures","263026677":"Global sensitivity analysis of Indian Monsoon during the Pleistocene","269998671":"Bayesian Emulation and Calibration of a Dynamic Epidemic Model for A/H1N1 Influenza","51971907":"Bringing diverse sources together – A meta-model for supporting integrated catchment management","286439752":"Global sensitivity analysis of key parameters in a process-based sugarcane growth model: a Bayesian approach","266829244":"Chinese translation of [Design and Analysis of Simulation Experiments]","49733805":"Uncertainty analysis is inherently Bayesian","223292691":"GUI–HDMR – A software tool for global sensitivity analysis of complex models","26755524":"Probabilistic Sensitivity Analysis: Be a Bayesian","278851265":"An Application of Bayesian Posterior Analysis for Disc Drive Annual Failure Rate (AFR) Estimate","274514494":"Quantifying uncertainty for temperature maps derived from computer models","242094091":"Designing and analyzing a circuit device experiment using treed Gaussian processes","220348228":"Derivative based global sensitivity measures and their link with global sensitivity indices","228986305":"Expert Knowledge and Multivariate Emulation: The Thermosphere–Ionosphere Electrodynamics General Circulation Model (TIE-GCM)","263847390":"Global sensitivity analysis and meta-modeling of an ethanol production process","49830544":"Relative and accurate measurement of protein abundance using 15N stable isotope labeling in Arabidopsis (SILIA)","256197932":"Wave Modeling: Missing the Peaks","45910231":"The Parameter Space of Galaxy Formation","254354242":"Design for Variation","251669868":"Probabilistic uncertainty specification: Overview, elaboration techniques and their application to a mechanistic model of carbon flux","222576436":"Reified Bayesian modeling and inference for physical systems","251669873":"Model emulation and moment-independent sensitivity analysis: An application to environment modeling","260674559":"Improved Similarity Measure in Case Based Reasoning with Global Sensitivity Analysis: An Example of Construction Quantity Estimating","274013740":"Practical Use of Computationally Frugal Model Analysis Methods: M.C. Hill et al. Ground Water xx, no. x: xx-xx","229174738":"Sensitivity analysis didn’t help. A practitioner’s critique of the Stern review","235765879":"Robust Sensitivity Analysis for Stochastic Systems","8613624":"Expected Value of Sample Information Calculations in Medical Decision Modeling","51441517":"Case studies in Bayesian microbial risk assessments","222568251":"The effects of parametric uncertainties in simulations of a reactive plume using a Lagrangian stochastic model","228499231":"Spline modelling of cumulative and non-linear effects of time-varying risk factors on the hazard","251621501":"The dangers of sparse sampling for the quantification of margin and uncertainty","220165020":"Statistical Equivalent Models for Computer Simulators with an Application to the Random Waypoint Mobility Model","220136347":"Sample-based estimation of correlation ratio with polynomial approximation","261177621":"A review of sensitivity analysis methods in building energy analysis","236851352":"Uncertainty Analysis in Population-Based Disease Microsimulation Models","257094612":"A computational multi-scale approach for the stochastic mechanical response of foam-filled honeycomb cores","273185487":"A randomized Orthogonal Array-based procedure for the estimation of first- and second-order Sobol\u0027 indices","263684415":"Global Sensitivity Analysis for Mixture Experiments","259345404":"Distributed Evaluation of Local Sensitivity Analysis (DELSA), with application to hydrologic models","281132109":"A context-aware approach in realization of socially intelligent industrial robots","239427784":"Modeling Data from Computer Experiments: An Empirical Comparison of Kriging with MARS and Projection Pursuit Regression","257199577":"Estimation of the Sobol indices in a linear functional multidimensional model","45341244":"Revue sur l\u0027analyse de sensibilité globale de modèles numériques","222418897":"Multiple predictor smoothing methods for sensitivity analysis: Example results","251621486":"Global sensitivity analysis by polynomial dimensional decomposition","262568759":"Computing derivative-based global sensitivity measures using polynomial chaos expansions","264982362":"Selection of model discrepancy priors in Bayesian calibration","271753889":"The Impact of Inaccurate “Informative” Priors for Growth Parameters in Bayesian Growth Mixture Modeling","263891759":"A Bayesian Approach for Parameter Estimation and Prediction using a Computationally Intensive Model","227464472":"Bayesian influence analysis: A geometric approach","259122663":"Investigation on the extensibility of the wood cell-wall composite by an approach based on homogenisation and uncertainty analysis","279244338":"Variable importance analysis: A comprehensive review","257449423":"Modelling the response of wheat grain yield to climate change: A sensitivity analysis","256917959":"A Bayesian calibration approach to the thermal problem","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","223472072":"Efficient computation of global sensitivity indices using sparse polynomial chaos expansions. Reliab Eng Syst Saf","243965457":"Modelling the transmission of healthcare associated infections: A systematic review","259575268":"Robustness of maintenance decisions: Uncertainty modelling and value of information","224870394":"Expected Net Present Value of Sample Information: From Burden to Investment","233783664":"Emulation of a complex global aerosol model to quantify sensitivity to uncertain parameters","273127142":"Application of Bayesian nonparametric models to the uncertainty and sensitivity analysis of source term in a BWR severe accident","45877790":"Node harvest","257549821":"Emulation techniques for the reduction and sensitivity analysis of complex environmental models. Environ Model Softw","270568584":"Optimizing human activity patterns using global sensitivity analysis","288021377":"A single-ossicle ear: Acoustic response and mechanical properties measured in duck","227633981":"Assessment of uncertainty in computer experiments from Universal to Bayesian Kriging","245366799":"Interval Uncertainty Reduction and Single-Disciplinary Sensitivity Analysis With Multi-Objective Optimization","267928919":"Sensitivity Analysis of Reliability of Systems with Complex Interconnections","242625735":"Probabilistic uncertainty speci…cation: expert judgement of input uncertainties in a mechanistic model of carbon ‡ux","228524334":"Case studies in Gaussian process modelling of computer codes","256688637":"Metamodelling with independent and dependent inputs","222526449":"Global sensitivity analysis using polynomial chaos expansion","270967954":"Evaluating uncertainty in convective cloud microphysics using statistical emulation","257646062":"Uncertainty in Climate Change Modeling: Can Global Sensitivity Analysis Be of Help?","220257174":"Variance based sensitivity analysis of model output. Design and estimator for the total sensitivity index. Comput Phys Commun","257157093":"Calibration and uncertainty analysis for computer models – A meta-model based approach for integrated building energy simulation","241700049":"Structural dynamic analysis using Gaussian process emulators","51040694":"Bayesian sensitivity analysis of a model of the aortic valve","263404815":"Minimax Designs for Finite Design Regions","271332076":"Economic Evaluations with Agent-Based Modelling: An Introduction","275580076":"Extending the Global Sensitivity Analysis of the SimSphere model in the Context of its Future Exploitation by the Scientific Community","7733941":"Sensitivity Analysis for Chemical Models","266459429":"Variance-based sensitivity analysis in the presence of correlated input variables","5144713":"Analysing DSGE Models with Global Sensitivity Analysis","241216681":"Bayesian Guided Pattern Search for Robust Local Optimization","233576224":"A comparison of robust metamodels for the uncertainty quantification (UQ) of New York Harbor oceanographic data","47754260":"Moment Independent Importance Measures: New Results and Analytical Test Cases","271623421":"Engineering-Driven Statistical Adjustment and Calibration","224352142":"A Statistical Framework for the Sensitivity Analysis of Radiative Transfer Models","29616402":"Efficient Estimation of Nonlinear Conditional Functionals of a Density","271573245":"A Methodology for Sensitivity Analysis Based on Regression: Applications to Handle Uncertainty in Natural Resources Characterization","228518733":"An adaptive correlation ratio method using the cumulative sum of the reordered output","251600427":"Natural computing for mechanical systems research: A tutorial overview","257016708":"The effect of the nugget on Gaussian process emulators of computer models","228835701":"An efficient method for computing partial expected value of perfect information for correlated inputs","280952935":"Non-parametric methods for global sensitivity analysis of model output with dependent inputs","275180221":"An effective approximation for variance-based global sensitivity analysis","263394152":"Estimation of parameter uncertainty for an activated sludge model using Bayesian inference: A comparison with the frequentist method","284359727":"A global sensitivity analysis of cultivar trait parameters in a sugarcane growth model for contrasting production environments in Queensland, Australia","255244264":"Sensitivity analysis techniques applied to a system of hyperbolic conservation laws. Part I","1807045":"Cosmic Calibration: Constraints from the Matter Power Spectrum and the Cosmic Microwave Background","229363572":"Non-parametric estimation of conditional moments for sensitivity analysis","24249773":"Hip resurfacing increases bone strains associated with short-term femoral neck fracture","51505651":"A Workflow for Global Sensitivity Analysis of PBPK Models","225803670":"Data-driven Kriging models based on FANOVA-decomposition","270793925":"Determining the Impact of Modeling Additional Sources of Uncertainty in Value-of-Information Analysis","251620889":"Quantification of Margins and Uncertainties","255598043":"Improved and accelerated sensitivity analysis using State Dependent Parameter models","260247915":"Application of a combined sensitivity analysis approach on a pesticide environmental risk indicator","3568348":"A novel primary-side controller and an error signal isolator in low cost five-pin packages","51751934":"Tuner: Principled Parameter Finding for Image Segmentation Algorithms Using Visual Response Surface Exploration","29626665":"Uncertainty, Sensitivity Analysis and the Role of Data Based Mechanistic Modeling in Hydrology","282320956":"Robust aeroelastic design of composite plate wings","229361498":"Predictive modeling of a radiative shock system","243102863":"Using Orthogonal Arrays in the Sensitivity Analysis of Computer Models","46515760":"Categorical Inputs, Sensitivity Analysis, Optimization and Importance Tempering with tgp Version 2, an R Package for Treed Gaussian Process Models","241018024":"Uncertainty Quantification in Fluid Flow","280329794":"Emulation of Higher-Order Tensors in Manifold Monte Carlo Methods for Bayesian Inverse Problems","266222375":"IMPLEMENTATION PLAN FOR LIBRARY OF TOOLS FOR UNCERTAINTY EVALUATION","253397473":"Risk analysis: Frequentist and Bayesians unite!","257391020":"Methodology for global sensitivity analysis of consequence models","264086336":"Application of the control variate technique to estimation of total sensitivity indices","261572969":"Functional ANOVA in Computer Models With Time Series Output","248301107":"Variable Selection for Gaussian Process Models in Computer Experiments","29626683":"Comparing sensitivity analysis methods to advance lumped watershed model identification and evaluation. Hydrol Earth Syst Sci Discuss 3:3333-3395","256688563":"A comparison of two sampling methods for global sensitivity analysis","272173368":"Emulation and interpretation of high-dimensional climate model outputs","263885496":"Sensitivity analysis of nonlinear models to parameter perturbations for small size ensembles of model outputs","278036881":"System Identification of an MDOF Experimental Structure with a View Towards Validation and Verification","254644776":"Bayesian Approaches in Microbial Risk Assessment","41032052":"NPUA: A new approach for the analysis of computer experiments","3284276":"Model-Based Design Analysis and Yield Optimization","251638265":"What is the Role of the FDA in Post-Approval Device Activities?","239939909":"Evaluation of capacitive surface stress biosensors","229913278":"Moment independent and variance‐based sensitivity analysis with correlations: An application to the stability of a chemical reactor","50591753":"Sensitivity Analysis and Estimation of Extreme Tail Behavior in Two-Dimensional Monte Carlo Simulation","257549396":"Managing uncertainty in integrated environmental modelling: The UncertWeb framework","229057192":"The Impact of Satellite-Derived Land Cover Uncertainty on Carbon Cycle Calculations","233537764":"Accelerated evaluation of the robustness of treatment plans against geometric uncertainties by Gaussian processes","253972017":"Projecting uncertainty through black boxes","257749070":"ANOVA decomposition of conditional Gaussian processes for sensitivity analysis with dependent inputs","256919109":"Stochastic structural dynamic analysis using Bayesian emulators","257271872":"Bayesian sensitivity analysis of bifurcating nonlinear models","231611095":"Multi-criteria analyses of wastewater treatment bio-processes under an uncertainty and a multiplicity of steady states","223926849":"Polynomial chaos expansion for sensitivity analysis","45882790":"Global sensitivity analysis for models with spatially dependent outputs","222797916":"How to avoid a perfunctory sensitivity analysis","3568427":"Thermal considerations for distributed power converter systems","229112506":"Variance-based sensitivity analysis of model outputs using surrogate models","259555942":"Transformation and invariance in the sensitivity analysis of computer experiment","266328768":"CONCEPTUAL DESIGN OF A HARD LANDING INDICATION SYSTEM USING A FLIGHT PARAMETER SENSOR SIMULATION MODEL","270647102":"Bayesian History Matching of Complex Infectious Disease Models Using Emulation: A Tutorial and a Case Study on HIV in Uganda","270704957":"Probabilistic analysis of phytoplankton biomass at the Frisian Inlet (NL)","258683469":"Bayesian sensitivity analysis of a nonlinear finite element model","257392240":"Analysis of computationally demanding models with continuous and categorical inputs","228634760":"Modelling uncertainty and variability in environmental systems","226923694":"Survey of modeling and optimization strategies to solve high-dimensional design problems with computationally-expensive black-box functions","272788330":"Combining screening and metamodel-based methods: An efficient sequential approach for the sensitivity analysis of model outputs","223072357":"Sampling plans based on balanced incomplete block designs for evaluating the importance of computer model inputs","260016720":"Comparing two sensitivity analysis approaches for two scenarios with a spatially explicit rural agent-based model","259508295":"A hybrid spectral and metamodeling approach for the stochastic finite element analysis of structural dynamic systems","222517874":"Implementation and evaluation of nonparametric regression procedures for sensitivity analysis of computationally demanding models","257392229":"Probabilistic sensitivity analysis of system availability using Gaussian processes","281358839":"Bayesian Sensitivity Analysis of a Cardiac Cell Model Using a Gaussian Process Emulator","277105591":"Emulation of Poincaré return maps with Gaussian Kriging models","256919140":"Bayesian assimilation of multi-fidelity finite element models","228974227":"A Statistical Equivalent Model for Random Waypoint Mobility: A Case Study","249823698":"Prospects for the open treatment of uncertainty in environmental research","258724445":"Calibration of a physically-based, fully distributed hydrological model in a glacierized basin: On the use of knowledge from glacio-meteorological processes to constrain model parameters","228460201":"Managing structural uncertainty in health economic decision models: A discrepancy approach","257642594":"The inverse operationalisation of concepts for the secondary analysis of quantitative data: An example from the study of parental collaboration","3885824":"Morphological operations for ultrasound images by locally variable structuring elements and their analysis of effective parameters","257412204":"Uncertainty in modeled upper ocean heat content change","264082051":"Global sensitivity analysis: on estimating total sensitivity indices","251621822":"Variance-based Sensitivity Indices for Models with Dependent Inputs","251621821":"A variance-based sensitivity index function for factor prioritization","263665908":"Space-partition method for the variance-based sensitivity analysis: Optimal partition scheme and comparative study","257334800":"LOcal Uncertainty Processing (LOUP) method for multidisciplinary robust design optimization","11034607":"Deconvolution of detector size effect for output factor measurement for narrow Gamma Knife radiosurgery beams","222227065":"A new uncertainty importance measure","272350067":"Polynomial-Chaos-Based Kriging","223189508":"Hierarchical adaptive experimental design for Gaussian process emulators","272359280":"Polynomial-Chaos-based Kriging","248607645":"A comparison of three metamodel-based methods for global sensitivity analysis: GP modelling, HDMR and LAR-gPC","254256234":"Global Sensitivity Measures from Given Data","229093623":"Hydrocarbon exploration risk evaluation through uncertainty and sensitivity analyses techniques","257110531":"Traditional and novel approaches to palaeoclimate modelling","257549832":"A general framework for Dynamic Emulation Modelling in environmental problems","276882899":"Radionuclide migration through fractured rock for arbitrary-length decay chain: Analytical solution and global sensitivity analysis","46149013":"Estimating causal effects using prior information on nontrial treatments","220411509":"Hierarchical Nonlinear Approximation for Experimental Design and Statistical Data Fitting","276890071":"Projected Effect of Increased Active Travel in German Urban Regions on the Risk of Type 2 Diabetes","225867297":"Uncertainty Evaluation in Reservoir Forecasting by Bayes Linear Methodology","242404136":"Bayesian nonparametric estimation of the radiocarbon calibration curve","229000444":"Sensitivity Analysis for Hydraulic Models","226193946":"Broadhurst, D.I. \u0026 Kell, D.B. Statistical strategies for avoiding false discoveries in metabolomics and related experiments. Metabolomics 2, 171-196","251486623":"Improved best estimate plus uncertainty methodology, including advanced validation concepts, to license evolving nuclear reactors","257271857":"On the identification of hysteretic systems. Part II: Bayesian sensitivity analysis and parameter confidence","258237965":"Approche bayésienne pour l’estimation d’indices de Sobol","4742946":"Computer Model Calibration Using High-Dimensional Output","237445452":"Bayesian calibration of hydrocarbon reservoir models using an approximate reservoir simulator in the prior specication","258727424":"The role of artisanal fishery in Mediterranean coastal zone management: Casework on the Sicilian coast","263992023":"A Comparative Study on the Performance of Bayesian Partially Linear Models","267264130":"An Analysis of the Uncertainties in Radiative Transfer Models Used in Remote Sensed Data Product Generation","51654776":"Probabilistic sensitivity analysis in health economics","265853620":"Sample-based evaluation of global probabilistic sensitivity measures","226727150":"Bayesian stochastic modelling for avalanche predetermination: From a general system framework to return period computations","51914869":"Efficient emulators of computer experiments using compactly supported correlation functions, with application to cosmology","275104008":"An introduction to sensitivity assessment of simulation models","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","281209773":"Application of a statistical emulator to fire emission modeling","260211446":"Novel Computational Methods for High-Dimensional Stochastic Sensitivity Analysis","44592093":"A comparison of approximation techniques for variance-based sensitivity analysis of biochemical reaction systems","239441203":"Aspects of Uncertainty Analysis for Large Nonlinear Computational Models","259138052":"Design of inferential sensors in the process industry: A review of Bayesian methods","239348028":"An adaptive design and interpolation technique for extracting highly nonlinear response surfaces from deterministic models","26835685":"Cost Effectiveness of Enoxaparin in Acute ST-Segment Elevation Myocardial Infarction. The ExTRACT-TIMI 25 (Enoxaparin and Thrombolysis Reperfusion for Acute Myocardial Infarction Treatment-Thrombolysis In Myocardial Infarction 25) Study","233243802":"Discussion of “Opportunities and Issues in Multiple Data Type Meta-Analyses”","264129728":"Global sensitivity analysis of the climate-vegetation system to astronomical forcing: An emulator-based approach","7079699":"The cost of cardiovascular disease: Rising, declining or staying still?","228339939":"Diagnostics for Gaussian Process Emulators","49708407":"Liquorice and glycyrrhetinic acid increase DHEA and deoxycorticosterone levels by inhibiting adrenal SULT2A1 activity","270223258":"A multi-criteria trajectory-based parameter sampling strategy for the screening method of elementary effects","229356585":"Calculating first-order sensitivity measures: A benchmark of some recent methodologies","242208237":"Web Working Papers","269337487":"Hybridization of spectral function approach with Bayesian emulators for stochastic structural dynamics","44630826":"Uncertainty and sensitivity analysis for anisotropic inhomogeneous head tissue conductivity in human head modelling","257550047":"A long-term sensitivity analysis of the denitrification and decomposition model","242115559":"Running Title: Mathematical Modeling for Influenza A Virus Infection 1 2 Title: Simulation and Prediction of the Adaptive Immune Response to Influenza A Virus 3 Infection 4","222148278":"State Dependent Parameter metamodelling and sensitivity analysis","237454762":"Improving Remote Sensed Data Products Using Bayesian Methodology for the Analysis of Computer Model Output Grant Number NNG06GI77G { Final Report","24424697":"Simulation and Prediction of the Adaptive Immune Response to Influenza A Virus Infection","6740457":"Measuring Uncertainty Importance: Investigation and Comparison of Alternative Approaches","267108987":"Using Emulators to Estimate Uncertainty in Complex Models","216756603":"A comparison of Latin hypercube and grid ensemble designs for the multivariate emulation of an Earth system model","257550025":"Efficient hydrological model parameter optimization with Sequential Monte Carlo sampling","272569261":"Using a Gaussian Process as a Nonparametric Regression Model","282428230":"Simple approach to emulating complex computer models for global sensitivity analysis","216300914":"Design and Analysis of Simulation Experiments","257550031":"A Bayesian sensitivity analysis applied to an Agent-based model of bird population response to landscape change","260043497":"Mathematical modelling of the stochastic mechanical properties of wood and its extensibility at small scales","260081176":"Application of Global Sensitivity Analysis of Model Output to Building Thermal Simulations","232396354":"Gaussian process emulation for second-order Monte Carlo simulations","257673411":"Reactive Transport Parameter Estimation and Global Sensitivity Analysis Using Sparse Polynomial Chaos Expansion","272816602":"Assessing marine species vulnerability to projected warming on the Scotian Shelf, Canada","271751081":"A Partially Linear Model Using a Gaussian Process Prior","251798684":"Parameter Sensitivity Analysis and Optimization of an Agent Based Psychological Model","268188253":"Hybrid Decompositional Verification for Discovering Failures in Adaptive Flight Control Systems","237740937":"Improving the performance of fast flood inundation models by incorporating results from very high resolution sim ulations","269998516":"Discussion of “Computer Experiments with Qualitative and Quantitative Variables: A Review and Reexamination”","223721726":"Convergence and uncertainty analyses in Monte-Carlo based sensitivity analysis. Environ Model Softw","245550351":"Sensitivity Analysis, a Powerful System Validation Technique","275468740":"Variance-Based Sensitivity Analysis: Preliminary Results in COAMPS","221679750":"Efficient Estimation of Sensitivity Indices","253320360":"Probability of rapid climate change","228920852":"Lightweight emulators for multivariate deterministic functions","227762721":"Constraining the Sheffield dynamic global vegetation model using stream‐flow measurements in the United Kingdom","277821245":"Accuracy and Best Practices for Small-Scale Rocket Engine Testing","263284227":"Implementing precision irrigation in a humid climate – Recent experiences and on-going challenges","233811035":"Exploration of Parametric Uncertainty in a Surface Mass Balance Model applied to the Greenland Ice Sheet","251401035":"General formulation of HDMR component functions with independent and correlated variables","247152899":"A Bayesian Approach for Global Sensitivity Analysis of (Multifidelity) Computer Codes","222548735":"Bayesian analysis of computer code outputs: A tutorial","227255370":"On the Identification of Hysteretic Systems, Part II: Bayesian Sensitivity Analysis","265503762":"Uncertainty Quantification in MD Simulations. Part II: Bayesian Inference of Force-Field Parameters","237619690":"Running Title: Computational Method for Population Genetic Parameters","270344665":"Addressing the ability of a land biosphere model to predict key biophysical vegetation characterisation parameters with Global Sensitivity Analysis","264352263":"Bayesian Uncertainty Quantification for Subsurface Inversion Using a Multiscale Hierarchical Model","261711455":"Calibration of dimensional change in finite element models using AGR moderator brick measurements","254212833":"Combining Experimental Data and Computer Simulations, With an Application to Flyer Plate Experiments","43344722":"Global Sensitivity Analysis for Systems with Independent and/or Correlated Inputs","239667584":"A Framework for Validation of Computer Models","258374316":"Global Sensitivity Analysis with Dependence Measures","224816299":"Stochastic sensitivity analysis using preconditioning approach","263114336":"Uncertainty Analysis of a Dynamic Model of a Novel Remotely Piloted Airship","225747621":"A unified approach to environmental systems modeling","50290990":"Practical limits for reverse engineering of dynamical systems: A statistical analysis of sensitivity and parameter inferability in systems biology models","262412405":"Model guided adaptive design and Analysis in computer experiment","231007766":"Fast inference for statistical inverse problems","259335335":"Sensitivity Analysis for Bayesian Hierarchical Models","230606954":"Interpretation of non-linear empirical data-based process models using global sensitivity analysis","259398307":"SimSphere Model Sensitivity Analysis Towards Establishing its Use for Deriving Key Parameters Characterising Land Surface Interactions","4227479":"Velocity sensitivity mapping in tissue Doppler images","223711373":"Sensitivity analysis of the two dimensional application of the Generic Ecological Model (GEM) to algal bloom prediction in the North Sea","262961780":"Experimental design for the validation of kriging metamodels in computer experiments","284898595":"Uncertainty and variability in models of the cardiac action potential: Can we build trustworthy models?","223831182":"Sensitivity analysis practices: Strategies for model-based inference. Reliability Eng. Syst. Safety","50830044":"Reducing experimental variability in variance-based sensitivity analysis of biochemical reaction systems","239580059":"BAYESIAN FUNCTIONAL DATA ANALYSIS FOR COMPUTER MODEL VALIDATION","262526073":"Calibration of Computational Models With Categorical Parameters and Correlated Outputs via Bayesian Smoothing Spline ANOVA","271855080":"Using sparse polynomial chaos expansions for the global sensitivity analysis of groundwater lifetime expectancy in a multi-layered hydrogeological model","258818700":"Gaussian process models for periodicity detection","226988642":"How you can tell if the simulations in computational criminology are any good","1916411":"Local Polynomial Estimation for Sensitivity Analysis on Models With Correlated Inputs","3568094":"Discrete formulation of Pel-recursive motion compensation with recursive least squares updates","285235433":"A Statistical Approach for Computing Reachability of Non-linear and Stochastic Dynamical Systems","274402226":"Towards causally cohesive genotype-phenotype modelling for characterization of the soft-tissue mechanics of the heart in normal and pathological geometries","3568092":"Optimal brightness patterns for 2-D optical flow","275949465":"Sensitivity Analysis in a Complex Marine Ecological Model","253328104":"Global Sensitivity Analysis. The Primer","248607522":"Computation of Sensitivity Indices with different routines for Latin Hypercube Designs","4914109":"Quantifying uncertainty in the biospheric carbon flux for England and Wales","257159844":"Calibration of tuning parameters in the FRAPCON model","220164327":"Global sensitivity analysis of large-scale numerical landslide models based on Gaussian-Process meta-modeling","234018825":"Modelling inhibitory effects of long chain fatty acids in the anaerobic digestion process","5231026":"Modelling approaches: The case of schizophrenia","221793477":"Computational model of an infant brain subjected to periodic motion simplified modelling and Bayesian sensitivity analysis.","276386695":"Verification of temperature, precipitation, and streamflow forecasts from the NOAA/NWS Hydrologic Ensemble Forecast Service (HEFS): 2. Streamflow verification"},"index":432}