{"abs":"While statisticians are well-accustomed to performing exploratory analysis in the modeling stage of an analysis, the notion of conducting preliminary general-purpose exploratory analysis in the Monte Carlo stage (or more generally, the model-fitting stage) of an analysis is an area which we feel deserves much further attention. Towards this aim, this paper proposes a general-purpose algorithm for automatic density exploration. The proposed exploration algorithm combines and expands upon components from various adaptive Markov chain Monte Carlo methods, with the Wang-Landau algorithm at its heart. Additionally, the algorithm is run on interacting parallel chains -- a feature which both decreases computational cost as well as stabilizes the algorithm, improving its ability to explore the density. Performance is studied in several applications. Through a Bayesian variable selection example, the authors demonstrate the convergence gains obtained with interacting chains. The ability of the algorithm\u0027s adaptive proposal to induce mode-jumping is illustrated through a trimodal density and a Bayesian mixture modeling application. Lastly, through a 2D Ising model, the authors demonstrate the ability of the algorithm to overcome the high correlations encountered in spatial models.","title":"An Adaptive Interacting Wang-Landau Algorithm for Automatic Density Exploration","id":51938199,"url":"https://www.researchgate.net/publication/51938199_An_Adaptive_Interacting_Wang-Landau_Algorithm_for_Automatic_Density_Exploration","names":["Luke Bornn","Pierre E Jacob","Pierre Del Moral","Arnaud Doucet","Journal of Computational and Graphical Statistics"],"references":{"227369231":"Learn From Thy Neighbor: Parallel-Chain and Regional Adaptive MCMC","2136228":"Small-world MCMC and convergence to multi-modal distributions: From slow mixing to fast mixing","265369049":"Slice sampling. (With discussions and rejoinder)","13255490":"Replica Monte Carlo Simulation of Spin-Glasses","49458431":"A tutorial on adaptive MCMC","48195025":"Parallel Tempering with Equi-Energy Moves","267670113":"Stochastic Approximation in Monte Carlo Computation","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","1825409":"Sequential monte carlo samplers","12043820":"Efficient, Multiple-Range Random Walk Algorithm to Calculate the Density of States","24280558":"Many-Core Algorithms for Statistical Phylogenetics","239665512":"Ice Floe Identification in Satellite Images Using Mathematical Morphology and Clustering About Principal Curves","1990329":"Simulated Tempering: A New Monte Carlo Scheme","238677918":"Random Number Generation and Quasi-Monte Carlo Methods. SIAM, Philadelphia","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","1828275":"Determining the density of states for classical statistical models: A random walk algorithm to produce a flat histogram","13330658":"Generalization of the Fortuin-Kasteleyn-Swendsen-Wang representation and Monte Carlo algorithm. Phys. Rev. D 38: 2009-2012","228789130":"Examples of adaptive MCMC","246480923":"Instabilities of Regression Estimates Relating Air Pollution to Mortality","45923857":"Free Energy Sequential Monte Carlo, Application to Mixture Modelling","48419023":"Sequentially interacting Markov chain Monte Carlo methods","243763126":"Estimation of Finite Mixture Distributions Through Bayesian Sampling","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","227450938":"ggplot2: Elegant Graphics for Data Analysis","2306327":"Annealed Importance Sampling","45622656":"Monte Carlo Statistical Methods","2120858":"Equi-energy sampler with applications in statistical inference and statistical mechanics","38322292":"An Adaptive Metropolis Algorithm","220258662":"Stability of Stochastic Approximation under Verifiable Conditions","2321640":"Dealing With Label-Switching in Mixture Models","227661917":"Green, P.J.: On Bayesian analysis of mixtures with an unknown number of components (with discussion). J. Roy. Stat. Soc. B. 59, 731-792","2131950":"On the ergodic properties of some adaptive MCMC algorithms","278972910":"Ice floe identification in satellite images using mathematical morphology and clustering about principal curves. J. Amer. Statist. Assoc. 87 7-16","45868905":"Improving SAMC using smoothing methods: theory and applications to Bayesian model selection problems. The Annals of Statistics","228910961":"The Wang-Landau algorithm in general state spaces: applications and convergence analysis","4742803":"Stochastic Approximation in Monte Carlo Computation","243773529":"Markov chain Monte Carlo Maximum Likelihood","248564622":"MCMCMethods andthe Label Switching Problem in Bayesian Mixture Modeling","4741805":"A Generalized WangLandau Algorithm for Monte Carlo Computation","239029977":"On assessing Prior Distributions and Bayesian Regression Analysis with g-Prior Distributions","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","243776875":"Spatial Statistics and Bayesian Computing","258187278":"Development Dynamics of Remittances in Bangladesh","220286671":"On population-based simulation for static inference","238738635":"Note on a Method for Calculating Corrected Sums of Squares and Products","2469075":"Auxiliary Variable Methods for Markov Chain Monte Carlo with Applications","2917083":"Towards Efficient Sampling: Exploiting Random Walk Strategies","252341360":"Adaptive Markov Chain Monte Carlo: Theory and Methods","261683938":"Parallel Markov chain Monte Carlo Simulation by Pre-Fetching","45903815":"Free Energy Methods for Bayesian Inference: Efficient Exploration of\nUnivariate Gaussian Mixture Posteriors","47663402":"Interacting Multiple Try Algorithms with Different Proposal\nDistributions","4993330":"Sequential Monte Carlo Samplers"},"citedIn":{"267120362":"Multicanonical MCMC for sampling rare events: An illustrative review","265644454":"Vertical-likelihood Monte Carlo","269935522":"Individual adaptation: an adaptive MCMC scheme for variable selection problems","270585972":"Individual adaptation: an adaptive MCMC scheme for variable selection problems","236878872":"PAWL-forced simulated tempering","256745034":"The Contribution of Young Researchers to Bayesian Statistics - Proceedings of BAYSM 2013","224907102":"Adaptive parallel tempering algorithm","258083672":"Efficiency of the Wang-Landau Algorithm: A Simple Test Case","230569924":"Convergence of the Wang-Landau algorithm"},"index":435}