{"abs":"This paper attempts to develop an elegant biogeography based optimization algorithm for obtaining the best compromise solution of EED problem. The basic philosophy orients to create a modified objective function that provides equal significance to both fuel cost and emission cost components. Besides it requires only three solution runs unlike other strategies involving more solution runs. The performance is evaluated through three test systems and the simulation results are presented to demonstrate the validity and effectiveness of the scheme for practical applications.","title":"Biogeography based optimization technique for best compromise solution of economic emission dispatch","id":271618145,"url":"https://www.researchgate.net/publication/271618145_Biogeography_based_optimization_technique_for_best_compromise_solution_of_economic_emission_dispatch","names":["S. Rajasomashekar","P. Aravindhababu","Swarm and Evolutionary Computation"],"references":{"220514412":"Biogeography based optimization for optimal meter placement for security constrained state estimation","243684621":"Power Operation, Generation and Control","224309395":"Biogeography-Based Optimization","224377232":"Emission constrained economic dispatch with valve-point effect using particle swarm optimization","255639916":"An Integrated Approach to Biogeography Based Optimization with case based reasoning for retrieving Groundwater Possibility","235834014":"An improved biogeography based optimization approach for segmentation of human head CT-scan images employing fuzzy entropy","3264997":"Emission dispatch models and algorithms for the 1990s","284270309":"Economic thermal power dispatch with emission constraint","223775628":"A multi-objective chaotic particle swarm optimization for environmental/economic dispatch","222927123":"Economic emission load dispatch through fuzzy based bacterial foraging algorithm. Electrical Power and Energy Systems, 32, 794-803","251590116":"Environmental/economic dispatch using multi-objective harmony search algorithm","222646618":"A niched Pareto genetic algorithm for multiobjective environmental/economic dispatch","3263889":"A review of recent advances in economic dispatch","220381186":"Multiobjective evolutionary algorithms for electric power dispatch problem.","220508292":"A Linear State-Space Analysis of the Migration Model in an Island Biogeography System","3265040":"Economic Load Dispatch Multiobjective Optimization Procedures using Linear Programming Techniques","223189934":"An efficient cultural self-organizing migrating strategy for economic dispatch optimization with valve-point effect","3266837":"Comparison and Application of Evolutionary Programming Techniques to Combined Economic Emission Dispatch with Line Flow Constraints","245155766":"Differential evolution algorithm for emission constrained economic power dispatch problem","222254932":"A direct Newton–Raphson economic emission dispatch","222574063":"Abido, M.A.: A Novel Multiobjective Evolutionary Algorithm for Environmental / Economic Power Dispatch. Electric Power Systems Research 65(1), 71-81","40714201":"Biogeography based Satellite Image Classification","220217109":"An effective hybrid biogeography-based optimization algorithm for parameter estimation of chaotic systems","233224157":"Biogeography-based Optimization for Economic Load Dispatch Problems","224086436":"Biogeography-Based Optimization and the Solution of the Power Flow Problem"},"citedIn":{"271924629":"A comparative study of multi-objective optimal power flow based on particle swarm, evolutionary programming, and genetic algorithm","279519849":"Backtracking search optimization based economic environmental power dispatch problems","289672676":"Optimum structural design of spatial steel frames via biogeography-based optimization","282495603":"Solution of non-convex economic load dispatch problem using Grey Wolf Optimizer","291390744":"Solution of non-convex economic load dispatch problem for small-scale power systems using ant lion optimizer","286231880":"A biogeography-based optimization for optimum discrete design of skeletal structures","270985711":"A modified harmony search method for environmental/economic load dispatch of real-world power systems","266316757":"Rapid synthesis of nanopowders in high energy ball milling; Optimization of milling parameters","275523936":"A comparative study of multi-objective optimal power flow based on particle swarm, evolutionary programming, and genetic algorithm","280055551":"Opposition Based Differential Evolution Algorithm for Dynamic Economic Emission Load Dispatch (EELD) with Emission Constraints and Valve Point Effects","282238242":"Opposition Based Differential Evolution Algorithm for Dynamic Economic Emission Load Dispatch (EELD) with Emission Constraints and Valve Point Effects","260913375":"Solution of Economic Emission Load Dispatch problems of power systems by Real Coded Chemical Reaction algorithm","277657241":"A biogeography-based optimization algorithm with mutation strategies for model parameter estimation of solar and fuel cells","264597072":"Glowworm swarm optimization algorithm with topsis for solving multiple objective environmental economic dispatch problem","271880716":"Economic analysis and power management of a stand-alone wind/ photovoltaic hybrid energy system using biogeography based optimization algorithm. Swarm Evol Comput 8:33-43","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm","262640985":"Adaptive biogeography based predator–prey optimization technique for optimal power flow","263894052":"Multi-objective economic emission dispatch considering wind power using evolutionary algorithm based on decomposition","277414454":"An efficient biogeography based optimization algorithm for solving reliability optimization problems"},"index":438}