{"abs":"Biogeography deals with the study of the distribution of biodiversity over space and time and has been well studied by naturists and biologists for over the last five decades. Recently, the theory of biogeography has been applied to solve difficult engineering optimization problems in the form of a nature-inspired metaheuristic, known as biogeography-based optimization (BBO) algorithm. In this correspondence paper, we present an in-depth analysis of the linear time-invariant (LTI) system model of immigration and emigration of organisms in an island biogeography system that forms the basis of BBO. We find the bound of the eigenvalues of the general LTI system matrix using the Perron-Frobenius theorem from linear algebra. Based on the bounds of the eigenvalues, we further investigate four important properties of the LTI biogeography system, including the system reasonability with probability distribution vectors, stability, convergence, and nature of the equilibrium state. Our analysis gives a better insight into the dynamics of migration in actual biogeography systems and also helps in the understanding of the search mechanism of BBO on multimodal fitness landscapes.","title":"A Linear State-Space Analysis of the Migration Model in an Island Biogeography System","id":220508292,"url":"https://www.researchgate.net/publication/220508292_A_Linear_State-Space_Analysis_of_the_Migration_Model_in_an_Island_Biogeography_System","names":["Abhishek Sinha","Swagatam Das","Bijaya Ketan Panigrahi","IEEE Transactions on Systems Man and Cybernetics - Part A Systems and Humans"],"references":{"200541462":"Introduction to Linear Algebra","247890949":"Geographical Distribution of Animals","210908982":"Computational Intelligence: An Introduction, Second Edition","224574373":"System and Actor Perspectives on Sociotechnical Systems","236424155":"Modern Control Theory","270370769":"Biogeography: An Ecological and Evolutionary Approach","224309395":"Biogeography-Based Optimization","270363629":"Non-Negative Matrices and Applicable Topics in Linear Algebra.","44331189":"Nonnegative matrices and applicable topics in linear algebra / Alexander Graham","224560403":"Perceptual Stability Analysis of a Graph Model System","2529269":"Computational Intelligence","201999167":"The Theory of Island Bio-Geography","226004514":"A system dynamics model of island biogeography","37875482":"Biogeography: An Ecological and Evolutionary Approach","225940363":"Zur Theorie der Matrices","224381347":"On Stability of the Chemotactic Dynamics in Bacterial-Foraging Optimization Algorithm","250055993":"Evolutionary Biogeography: An Integrative Approach with Case Studies","264235520":"Liapunov Functions and Stability in Control Theory"},"citedIn":{"273341434":"A cooperative coevolutionary biogeography-based optimizer","271618145":"Biogeography based optimization technique for best compromise solution of economic emission dispatch","236954733":"Neighborhood Search Driven Accelerated Biogeography-Based Optimization for Optimal Load Dispatch","271817857":"Localized biogeography-based optimization","257636351":"Accelerated biogeography-based optimization with neighborhood search for optimization","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm"},"index":439}