{"abs":"Similar to Genetic Algorithms, Evolution Strategies (ESs) are algorithms which imitate the principles of natural evolution as a method to solve parameter optimization problems. The development of Evolution Strategies from the first mutation--selection scheme to the refined (,)--ES including the general concept of self--adaptation of the strategy parameters for the mutation variances as well as their covariances are described. 1 Introduction The idea to use principles of organic evolution processes as rules for optimum seeking procedures emerged independently on both sides of the Atlantic ocean more than two decades ago. Both approaches rely upon imitating the collective learning paradigm of natural populations, based upon Darwin\u0027s observations and the modern synthetic theory of evolution. In the USA Holland introduced Genetic Algorithms in the 60ies, embedded into the general framework of adaptation [Hol75]. He also mentioned the applicability to parameter optimization whic...","title":"A Survey of Evolution Strategies","id":2611416,"url":"https://www.researchgate.net/publication/2611416_A_Survey_of_Evolution_Strategies","names":["Thomas Bäck","Frank Hoffmeister","Hans-Paul Schwefel"],"references":{"201975931":"Simulated Annealing and Boltzmann Machines: A Stochastic Approach to Combinatorial Optimization and Neural Computing","242356870":"Adaptation In Natural And Artificial Systems","216301411":"Collective phenomena in evolutionary systems","2782915":"A Variant of Evolution Strategies for Vector Optimization","216301422":"Evolutionsstrategie und numerische Optimierung","2596285":"Global Optimization by means of Distributed Evolution Strategies","239059477":"Kybernetische Evolution als Strategie der exper-imentellen Forschung in der Str¨omungstechnik","216301417":"Numerical Optimization of Computer Models"},"citedIn":{"2309153":"Genetic Programming and Data Structures","225899893":"Automatic Index Selection in RDBMS by Exploring Query Execution Plan Space","234804730":"Transmission function models of infinite population genetic algorithms","268198905":"An Evolutionary Non-Linear Great Deluge Approach for Solving Course Timetabling Problems","225577332":"An intensive search evolutionary algorithm for single-machine total-weighted-tardiness scheduling problems","2291749":"Adaptive Global Optimization with Local Search","2263086":"Evolution Strategies and Composed Test Functions","227657119":"Evolutionary Computation Techniques for Nonlinear Programming Problems","11409597":"Efficient Evolutionary Algorithm for the Thin-Film Synthesis of Inhomogeneous Optical Coatings","266653687":"Two-stage non-dominated sorting and directed mating for solving problems with multi-objectives and constraints","3810348":"A parabolic operator for parameter optimization problems","3299365":"Generative representations for the automated design of modular physical robots","257200972":"Towards the use of metaheuristics for optimizing the combination of classifier and cluster ensembles","221563183":"Digital Circuit Design using Intrinsic Evolvable Hardware.","256970570":"Extension of the constrained particle swarm optimization algorithm to optimal operation of multi-reservoirs system","261513098":"Applying an Evolutionary Strategy for Multiobjective Optimization of Capacitor Banks Allocation in Distribution Feeders","239542873":"Evolutionary Design by Computers Chapter on Optimized Mechanical Design","223298896":"Genetic algorithms and Tabu Search: hybrids for optimization. Computers é4 Operations Research, 22: 111-134","220739849":"Alternative voting systems in stock car racing","2668555":"Evolutionary Algorithms for the Optimization of Simulation Models Using PVM","224396613":"A Decade of Kasabov\u0027s Evolving Connectionist Systems: A Review","2417679":"A Survey of Constraint Handling Techniques in Evolutionary Computation Methods","242731612":"Chose the Right Mutation Rate for Better Evolve Combinational Logic Circuits","221786388":"Theory and Applications of Simulated Annealing for Nonlinear Constrained Optimization","220866820":"A Comparison of Adaptive Operator Scheduling Methods on the Traveling Salesman Problem.","3302429":"Comments on Theoretical analysis of evolutionary algorithms with an infinite population size in continuous space. I. Basic properties of selection and mutation [with reply]","46514933":"An evaluation of UK risky money: An artificial intelligence approach","2581526":"A Model Of Landscapes","222857595":"Coello, A.C.: Theoretical and Numerical Constraint-Handling Techniques Used with Evolutionary Algorithms: A Survey of the State of the Art. Comput. Methods Appl. Mech. Engrg. 191(11-12), 1245-1287","2273302":"A Stochastic Search Approach to Grammar Induction","2533395":"Optimal Anytime Search For Constrained Nonlinear Programming","226298187":"Genetic Algorithms and Scatter Search: Unsuspected Potentials","280721549":"447 - Tabu Search in Analytics and Computational Science","2578463":"Using Fitness Distributions to Design More Efficient Evolutionary Computations","4263035":"Advances in Optimizing Screw-lype Machines","228967838":"Generational PipeLined Genetic Algorithm (PLGA) using Stochastic Selection","256276346":"An overview of population-based algorithms for multi-objective optimisation","242285132":"Development of Heterogeneous Parallel Genetic Simulated Annealing Using Multi-Niche Crowding","2615321":"The Reproductive Plan Language RPL2: Motivation, Architecture and Applications","224663845":"Evolving fuzzy clusters","220947817":"Specifying Agent\u0027s Goals in 3D Scenarios Using Process Algebras.","225679670":"Intrinsic Evolvable Hardware in Digital Filter Design","235336266":"Local Search and Restart Strategies for Satisfiability Solving in Fuzzy Logics","2228334":"Optimization of Supply Diversity for the Self-Assembly of Simple Objects in Two and Three Dimensions","2661477":"Lecture Notes in Computer Science","2528375":"Simulated Annealing with Asymptotic Convergence for Nonlinear Constrained Global Optimization","240643589":"Optimization of felf-organized flocking of a robot swarm via evolutionary strategies","242319909":"Hierarchical Learning Systems Robotic Control Using Hierarchical Genetic Programming","242404901":"AConvergenceAnalysisofUnconstrainedand BoundConstrainedEvolutionaryPatternSearch","222094692":"Multiobjective optimization using evolutionary algorithms","3864675":"Towards the automatic design of more efficient digital circuits","242433576":"L\u0027Intelligence","227603916":"Genetic algorithms and applications to finance","220743029":"Evolving agent behavior in multiobjective domains using fitness-based shaping","260650964":"Improved gravitational search algorithm based on free search differential evolution","241131069":"Properties of an Evolutionary Algorithm with Mutation Step-Size Based on the Population Variance","3810392":"Theoretical comparisons of evolutionary computation and other optimization approaches","222423335":"Global-best harmony search","200734623":"A decade of Kasabov\u0027s Evolving Connectionist Systems: A Review","261483516":"Constructing signaling pathways from RNAI data using genetic algorithms","220739910":"Constructing numerically stable real number codes using evolutionary computation","226025736":"Reductions in the search space for deriving a fractal set of an arbitrary shape","224241967":"A multiobjective evolutionary algorithm for distribution system reconfiguration","221228378":"Optimizing the DFCN Broadcast Protocol with a Parallel Cooperative Strategy of Multi-Objective Evolutionary Algorithms","268685429":"Bir Uçak Kanadınun Çok Amaçlı Genetik Algoritmalar ile Yapısal Optimizasyonu (Structural Optimization of an Aircraft Wing with Multi-Objective Genetic Algorithms)","266043299":"Forecasting the Thailand stock market using evolution strategies","220176743":"An application of genetic and evolutive algorithms to unit commitment problem","3479629":"Non-smooth/non-convex economic dispatch by a novel hybrid differential evolution algorithm","4201529":"Evolutionary optimization of autonomous vehicle tracks","261195752":"A Chaos Quantum Immune Algorithm for power system economic dispatch computation","2939054":"Evolutionary Algorithms","2461857":"Scalability Problems of Digital Circuit Evolution - Evolvability and Efficient Designs","228954400":"Massively parallel genetic algorithms","226439671":"A Memetic Algorithm for Solving the Generalized Minimum Spanning Tree Problem","34505346":"Development of an embedded evolutionary controller to enable collision-free navigation of a population of autonomous mobile robots.","237436587":"MAPPING TEXTURES ON 3D TERRAINS","220061075":"Breeding Terrains with Genetic Terrain Programming: The Evolution of Terrain Generators","224111054":"Evolutionary Game Design","221104570":"A Novel Frequency Offset Estimation Method for Distributed MIMO Systems with Large Estimation Range","232251712":"Clever Algorithms","225508841":"An Adaptive Algorithm for Constrained Optimization Problems","221160887":"Dual Attractive Centers Optimization: A Simple and Efficient Approach for Real Function.","226941212":"Integrating Text Mining and Genetic Algorithm for Subject Selection","10809407":"The evolution of evolvability in genetic linkage patterns","2414776":"Formal Algorithms + Formal Representations \u003d Search Strategies","2425017":"A Genetic Algorithm Tutorial","222469597":"Applying evolutionary programming to selected control problems","259687386":"GramGen: A Genetic Programming System Based on Context Free Grammar","261463861":"Time domain fault location on transmission lines using genetic algorithm","220887439":"An Optimization Algorithm Based on Active and Instance-Based Learning.","1960120":"Fitness Uniform Optimization","2918532":"Investigation of an Adaptive Cribbage Player","264151826":"Adaptive Learning Control of Electro-Hydraulic Servo System Using Real-Time Evolving Neural Network Algorithm","220740997":"Rapid prediction of optimum population size in genetic programming using a novel genotype -","237125261":"RUPRECHT-KARLS-UNIVERSITÄT HEIDELBERG","234005853":"Swarm directions embedded differential evolution for faster convergence of global optimization problems","245527063":"CODEQ: an effective metaheuristic for continuous global optimisation","251403850":"A Real-coded Genetic Algorithm using the Unimodal Normal Distribution Crossover","226755891":"An Adaptive Penalty Function for Handling Constraint in Multi-objective Evolutionary Optimization","233183582":"A self-adaptive boundary search genetic algorithm and its application to water distribution systems","221228438":"Dynamic Archive Evolution Strategy for Multiobjective Optimization.","268435267":"Uma Abordagem Evolutiva Multi-Objectivo para o Problema de Compensação de Energia Reactiva em Redes de Distribuição de Energia Eléctrica","29649156":"Non linear programming for stochastic dynamic programming","2862314":"Digital Filter Design at Gate-level using Evolutionary Algorithms","242351795":"Two Problems in Stochastic Service Systems","224384413":"An Adaptive Penalty Formulation for Constrained Evolutionary Optimization","2578657":"Formal Memetic Algorithms","221933043":"Distributed Learning in Wireless Sensor Networks","261239640":"Joint Channel Parameter Estimation Using Evolutionary Algorithm","220702187":"Strategy Adaption by Competing Subpopulations.","283532331":"Designing Complex Interplanetary Trajectories for the Global Trajectory Optimization Competitions","221006306":"Incorporation of adaptive mutation based on subjective evaluation in an interactive evolution strategy.","2692345":"A Bionomic Approach to the Capacitated p-Median Problem","2647289":"An Investigation of Supervised Learning in Genetic Programming","222410133":"Evolution strategies based image registration via feature matching","225705383":"Self-Adaptation in Evolutionary Algorithms","221008377":"Self-adaptive barebones differential evolution","2332917":"The Evolution of Evolvability in Genetic Programming","3265768":"Irving, M.R.: A genetic algorithm modelling framework and solution technique for short term optimal hydrothermal scheduling. IEEE Transactions on Power Systems 13, 501-518","242416301":"Multi-board Run-time Reconfigurable Implementation of Intrinsic Evolvable Hardware","2662601":"Genetic Programming - Computers using \"Natural Selection\" to generate programs","226478494":"Principles in the Evolutionary Design of Digital Circuits—Part II","226094491":"Self-Adaptation in Evolutionary Algorithms for Combinatorial Optimisation","220741067":"An evolutionary lagrangian method for the 0/1 multiple knapsack problem","255968165":"Distributed Control for Collective Behaviour in Micro-unmanned Aerial Vehicles","243693152":"Asymptotic convergence properties of genetic algorithms and evolutionary programming: Analysis and experiments","226912623":"Unit tests construction based on business rules","268241680":"Darwin or Lamarck? Future Challenges in Evolutionary Algorithms for Knowledge Discoveryand Data Mining","2258124":"Genetic Programming and Emergent Intelligence","267224834":"Introducción a la Computación Evolutiva (Notas de Curso)","242371202":"COMPUTATIONAL INTELLIGENCE BASED CLASSIFIER FUSION MODELS FOR BIOMEDICAL CLASSIFICATION APPLICATIONS by","220702167":"Refueling of a Nuclear Power Plant: Comparison of a Naive and a Specialized Mutation Operator.","266545937":"Evolutionary Computation and Heuristics","220696018":"Towards Hybrid and Adaptive Computing - A Perspective","221228500":"Global Multiobjective Optimization with Evolutionary Algorithms: Selection Mechanisms and Mutation Control","2533595":"Time Continuation in Genetic Algorithms","257435557":"Antiviral therapy using a fuzzy controller optimized by modified evolutionary algorithms: A comparative study","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm","224122277":"Simplex GA and hybrid methods","33696508":"Adaptive splines and genetic algorithms for optimal statistical modeling.","225304684":"An evolutionary algorithm for multi-objective optimization of combustion processes","4148538":"A new fvolutionary computational based real-time controller","277289345":"Measuring GA-hardness","220375077":"A Hierarchy of Evolution Programs: An Experimental Study","2568494":"Evolving From Genetic Algorithms to Flexible Evolution Agents","269327620":"NeuroEAs-based algorithm portfolios for classification problems","228781224":"Preprint: Multi-objective Evolutionary Algorithm for the Optimization of Noisy Combustion Processes","228556948":"Operations Research/Computer Science Interfaces Series","224668789":"Evolution strategies applied to perturbed objective functions","4079919":"Evolving digital circuits using multi expression programming","233883874":"A Novel Approach to Improve the Performance of Evolutionary\nMethods for Nonlinear Constrained Optimization","222652502":"Evolving L-systems to generate virtual creatures","256536153":"Genetic programming: On the programming of computers by means of natural selection,: John R. Koza, A Bradford Book, MIT Press, Cambridge MA, 1992, ISBN 0-262-11170-5, xiv + 819pp., US$55.00","225378425":"A Flexible Evolutionary Agent: cooperation and competition among real-coded evolutionary operators","226549911":"Scatter Search and Star-Paths: Beyond the Genetic Metaphor,” OR Spektrum, 17: 125-137","29649114":"DCMA, yet another derandomization in Covariance-Matrix-Adaptation","3720473":"Toward the Optimization of a Class of Black Box Optimization Algorithms.","220199997":"Finding pre-images via evolution strategies","221174795":"A Centralized Network Design Problem with Genetic Algorithm Approach","220450821":"Coarse coding: Applications to the visual system of salamanders","237531919":"Feature Selection and Classifier Ensembles: A Study on Hyperspectral Remote Sensing Data Kenmerk Selectie en Classificatie Ensembles: Een Studie op Hyperspectrale Afstandswaarnemingsdata","220701710":"A Preliminary Investigation into Directed Mutations in Evolutionary Algorithms.","3421470":"Multiobjective evolutionary algorithm for the optimization of noisy combustion processes","242177858":"A Comparison of \u0027Evolutionary Algorithm with Guided Mutation\u0027 With \u0027Population Based Incremental Learning\u0027 And \u0027Compact Genetic Algorithm","225342559":"New topics in Genetic Algorithm research","220110888":"Evolutionary game algorithm for continuous parameter optimization","3901699":"New approach to real-time adaptive learning control of neuralnetworks based on an evolutionary algorithm (II)","247517178":"A genetic algorithm approach to the balanced allocation of customers to multiple warehouses with varying capacities","39656289":"Recálculo de estructuras lineales por medio de la transformación de Shanks","2529563":"Improving Constrained Nonlinear Search Algorithms Through Constraint Relaxation","220045347":"Probabilistic and Randomized Methods for Design under Uncertainty","242919226":"Genetic Algorithms as Global Random Search Methods: An Alternative Perspective","49754039":"A Genetic Optimization Approach for Isolating Translational Efficiency Bias","242376499":"Test Data in the Presence of State Behaviour","24127539":"Evolutionary Strategies vs. Neural Networks; New Evidence from Taiwan on the Divisia Index Debate","220375137":"Predictive Models for the Breeder Genetic Algorithm I. Continuous Parameter Optimization","232066198":"Early gene regulation of osteogenesis in embryonic stem cells","239593217":"A Multiresolution Approach for Noised Texture Classification based on the Co-occurrence Matrix and First Order Statistics","3663216":"Hybrid evolutionary programming with fast convergence for constrained optimization problems","255639157":"Amélioration de l\u0027Apprentissage des Réseaux Neuronaux par les Algorithmes Evolutionnaires : application à la classification phonétique","270894440":"A self-adaptive boundary search genetic algorithm and its application to water distribution systems","266656425":"Controlling selection areas of useful infeasible solutions for directed mating in evolutionary constrained multi-objective optimization","220801126":"Applying Family Competition to Evolution Strategies for Constrained Optimization.","220514421":"Constraint-handling in nature-inspired numerical optimization: past, present and future. Swarm Evol Comput","220375156":"Schoenauer, M.: Evolutionary Algorithms for Constrained Parameter Optimization Problems. Evolutionary Computation 4(1), 1-32","261527232":"Applying an evolutionary strategy for multiobjective optimization of capacitor banks allocation in distribution feeders","227944654":"Improving convergence of CMA-ES through structure-driven discrete recombination","227944655":"Solving Satisfiability in Fuzzy Logics with Evolution Strategies","220696702":"First Results on Formal Comparison of Several Stochastic Optimization Algorithms.","220739697":"Distributed Probabilistic Model-Building Genetic Algorithm","225692714":"Neuroevolutionary Inventory Control in Multi-Echelon Systems","220290112":"Empirical analysis of self-adaptive differential evolution","2889038":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","3903832":"Learning fuzzy cognitive maps using evolution strategies: A novel schema for modeling and simulating high-level behavior","229091524":"Soaring behaviors in UAVs: \u0027animat\u0027 design methodology and current results","220801101":"A Note on Usefulness of Geometrical Crossover for Numerical Optimization Problems.","228896963":"Economic Power Dispatch using the combination of Two Genetic Algorithms","225517596":"Multi-objective optimization of high-speed milling with parallel genetic simulated annealing","3972428":"GA-based control of binary-continuous joints of a multi-link micromanipulator using SMA actuators","3450182":"Autonomous evolution of dynamic gaits with two quadruped robots","225864708":"Heuristic Procedures for Solving the Discrete Ordered Median Problem","245574609":"Comparison of discrete and continuous bio-inspired metaheuristics for HMM likelihood maximization","243608560":"Evolutionary Search for Test Data in the Presence of State Behaviour","220472402":"Two-stage update biogeography-based optimization using differential evolution algorithm (DBBO). Comput Oper Res","257635876":"On the application of efficient hybrid heuristic algorithms – An insurance industry example","220273825":"A biologically inspired approach to feasible gait learning for a hexapod robot","2482597":"The Need for Improving the Exploration Operators for Constrained Optimization","251454334":"RANDOM SEARCH IN AUTOMATIC FONT GENERATION","2513316":"A Prescriptive Formalism for Constructing Domain-specific Evolutionary Algorithms","2493858":"Optimization Approach using Case Based Reasoning and Evolution Strategy","4074937":"An evolutionary algorithm for magic squares","220275881":"Nonlinear optimization and parallel computing","272241077":"Mathematical modelling of a robust inspection process plan: Taguchi and Monte Carlo methods","248265565":"Using Evolution Strategies for Minimization","2333106":"Simulated Binary Crossover for Continuous Search Space","33981330":"Fluid power system design a simulation approach /","3966376":"Automating performance optimization for script word recognition systems","4049322":"A New EC-Based Controller","228980792":"Stock Exchange of Thailand Index Prediction Using Back Propagation Neural Networks","221450414":"A System for the Acquisition, Interactive Exploration and Annotation of Stereoscopic Images.","220867765":"Hand Posture Recognition Using Real-Time Artificial Evolution.","267796053":"An Indexed Bibliography of Evolution Strategies compiled by","240234485":"Sensor Evolution In A Homeokinetic System","50284377":"Novel Orthogonal Momentum-Type Particle Swarm Optimization Applied to Solve Large Parameter Optimization Problems","2266501":"Evolutionary Module Acquisition","220801153":"An Evolutionary Algorithm for Designing Feedforward Neural Networks.","2453901":"Netcrawling - Optimal Evolutionary Search with Neutral Networks","3301787":"Genetic Evolution of the Topology and Weight Distribution of Neural Networks","27685900":"Genetic algorithms for map labeling","255642257":"Optimal experimental design in stochastic structural dynamics","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","3333506":"Training Partially Recurrent Neural Networks Using Evolutionary Strategies","8186316":"Optimization of photonic crystal structures","220831899":"An Evolutionary Agent Model of Case-Based Classification.","3193218":"Genetic algorithm wavelet design for signal classification","251212618":"XMAS: Validation tool based on meta-programming","224690387":"Fitness Function Evaluation for Image Reconstruction using Binary Genetic Algorithm for Parallel Ray Transmission Tomography","227337268":"Investigating a Parallel Breeder Genetic Algorithm on the inverse Aerodynamic design","2918805":"Feature Selection and Classifier Ensembles: A Study on Hyperspectral Remote Sensing Data","237148059":"Constrained Optimization Via Artificial Immune System","234817605":"SVC location for TTC enhancement using differential evolution: making the algorithm faster","2443673":"A Brief Comparison Of Some Evolutionary Optimization Methods","3575179":"Hybridizing Genetic Algorithms with Hill-Climbing Methods for Global Optimization: Two Possible Ways","2341278":"Learning Representations for Evolutionary Computation","2861461":"Evolutionary Artificial Neural Networks","2592152":"On Correlated Mutations in Evolution Strategies","222789765":"Evolution and Development of Control Architectures in Animats","2423271":"Predictive Models for the Breeder Genetic Algorithm","4205956":"Prediction of the Stock Exchange of Thailand using adaptive evolution strategies","3418608":"Test-case generator for nonlinear continuous parameter optimization techniques","2525666":"Test Driving Three 1995 Genetic Algorithms: New Test Functions and Geometric Matching","2327012":"An Individually Variable Mutation-Rate Strategy for Genetic Algorithms","221157606":"A scalable neural network architecture for board games","228339797":"Penalty function methods for constraint optimization with genetic algorithms","252662469":"Pattern Search Algorithms for Mixed Variable General Constrained Optimization Problems","221007073":"Using evolution strategies for the real-time learning of controllers for autonomous agents in Xpilot-AI.","221112547":"An Overview of Evolutionary Computation","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","224663733":"Genetic algorithms and simulated annealing: a marriage proposal","221197565":"A Multi-Objective Genetic Algorithm that Employs a Hybrid Approach for Isolating Codon Usage Bias Indicative of Translational Efficiency","2825727":"A Review of Evolutionary Neural Networks","220689651":"Multiobjective Genetic Algorithms for Clustering - Applications in Data Mining and Bioinformatics.","221497573":"Online Learning via Congregational Gradient Descent.","236093380":"The utility of artificially evolved sequences in protein threading and fold recognition","220701951":"Multi-parent Recombination in Genetic Algorithms with Search Space Boundary Extension by Mirroring","272237024":"Applying an evolutionary strategy for multiobjective optimization of capacitor banks allocation in distribution feeders","3903968":"Dynamic optimisation of evolving connectionist system training parameters by pseudo-evolution strategy","237510644":"Genetic Algorithms, Evolutionary Algorithms and Scatter Search: Changing Tides and Untapped Potentials","3415530":"A family competition evolutionary algorithm for automated docking of flexible ligands to proteins","13267246":"Adapting Operator Settings in Genetic Algorithms","2297285":"Population Flow on Fitness Landscapes","226663524":"Principles in the Evolutionary Design of Digital Circuits—Part I","225122445":"Co-evolution of operator settings in genetic algorithms","242256792":"A Comparison of Traditional and Simple Evolutionary Hill-Climbing Methods for Solving Static and Recurrent Dynamic Constraint Satisfaction Problems","261460606":"A new real-coded genetic algorithm for implicit constrained black-box function optimization","2409930":"Non-Linear Genetic Representations","242138014":"Using Evolutionary Algorithms to Search for Control Parameters in a Nonlinear Partial Differential Equation Submitted to the Institute for Mathematics and Its Applications volume on Evolutionary Algorithms and High Performance Computing","3575239":"Multi-population evolution strategies for structural image analysis","268269071":"General-Purpose Optimization Through Information Maximization","3828168":"Evolutionary potential timetables optimization by means of geneticand greedy algorithms","224663703":"Using evolutionary programing to create neural networks that are capable of playing tic-tac-toe","224217257":"Overcoming Alpha-Beta Limitations Using Evolved Artificial Neural Networks","226043023":"Parent-centric differential evolution algorithm for global optimization problems","265999911":"Finding Optimally Conditioned Matrices using Evolutionary Computation","23750805":"Analyzing the agent-based model and its implications","242405488":"An Introduction to Genetic Algorithms and Evolution Strategies","3623477":"Evolutionary approach for frequency assignment in cellular radio networks","267442680":"Informatics in control, automation and robotics. Selected papers from the international conference on informatics in control, automation and robotics (INCINO 2007), Angers, France, May 9–12, 2007","222484296":"ALGODESK: an experimental comparison of eight evolutionary heuristics applied to the QAP problem","220550955":"A multi-objective memetic and hybrid methodology for optimizing the parameters and performance of artificial neural networks","220981051":"Evolving Neural Networks for Word Sense Disambiguation.","222211885":"A novel evolution strategy for multiobjective optimization problem","233137148":"Fogel, D.: Applying evolutionary programming to selected traveling salesman problems. Cybernetics and Systems: An International Journal 24, 27-36","2473534":"Genetic Algorithms, Numerical Optimization, and Constraints","3454504":"Distributing Charges on a Sphere by means of Evolutionary Strategies","226969496":"Simulander: A neural network model for the orientation movement of salamanders","221943589":"Multi-Criteria Assessment of Ecological Process Models","267238849":"University of Tuning \u0026 Simplifying Heuristical Optimization","224184176":"An efficient genetic algorithm for solving the generalized traveling salesman problem","3418649":"Planning multiple paths with evolutionary speciation","3693077":"Finding a perceptual uniform color space with evolution strategies","4375151":"Differential Evolution with Parent Centric Crossover","24128350":"Co-evolution vs. Neural Networks; An Evaluation of UK Risky Money","3418651":"Evolutionary pattern search algorithms for unconstrained and linearly constrained optimization","221019930":"Extracting Stellar Population Parameters of Galaxies from Photometric Data Using Evolution Strategies and Locally Weighted Linear Regression.","234062789":"Bi-objective partial flexible job shop scheduling\nproblem: NSGA-II, NRGA, MOGA and PAES approaches","239552637":"Alternative Techniques to Handle Constraints in Evolutionary Optimization","35001388":"Compositional evolution : interdisciplinary investigations in evolvability, modularity, and symbiosis /","2518556":"Co-Evolutionary Learning by Automatic Modularisation with Speciation","227116980":"Heuristic Methods for Evolutionary Computation Techniques","233291687":"Suitability of genetic based exploration in the creative design process","245310684":"Evolutionary computation of unconstrained and constrained problems using a novel momentum-type particle swarm optimization","261087692":"Guided mutation operation based on search degree and fitness estimation","228893666":"Non-exhaustive search methods and their use in the minimization of Reed-Muller canonical expansions","222669571":"Parameter identification of induction motors using stochastic optimization algorithms","224301849":"A primal-dual multiobjective evolutionary algorithm for approximating the efficient set","286788432":"Why are genetic algorithms MCMC? (Markov chain Monte Carlo)","2254442":"Selection Schemes, Elitist Recombination, and Selection Intensity","225443623":"Integration of large-deviation kernels and applications to large deviations for evolutionary games","221017952":"Two-Dimensional Fitting of Brightness Profiles in Galaxy Images with a Hybrid Algorithm.","221411170":"+CARPS: Configuration of Metaheuristics based on JADE Agents.","10584818":"Tools for intelligent control: Fuzzy controllers, neural networks and genetic algorithms","3240548":"An evolutionary algorithm for the synthesis of multilayer coatingsat oblique light incidence","4245013":"Generalized Disjunction Decomposition for the Evolution of Programmable Logic Array Structures","267058620":"Micro-macro-interactions in structured media and particle systems","3642976":"Breeder genetic algorithms for airfoil design optimisation","245331142":"A local genetic approach to multi-objective, facility layout problems with fixed aisles","221411179":"A New Approach for Solving the Generalized Traveling Salesman Problem","268572255":"Inclusion of Preferences in the Design of Evolutionary Optimization Algorithms: An Empirical Study","226717661":"Robust Optimizers for Nonlinear Programming in Approximate Dynamic Programming","2419323":"Hybridize, Hybridize And Hybridize Again","237785164":"A mixed evolutionary/Heuristic approach to shape optimization","251753824":"Optimization by Stochastic Methods","2618948":"RPL2: A Language and Parallel Framework for Evolutionary Computing","3623508":"GENOCOP III: A co-evolutionary algorithm for numerical optimization problems with nonlinear constraints","220953423":"A Novel Multiobjective Evolution Strategy: Design for Adaptive Balance Between Proximity and Diversity.","3599955":"Testing parallel evolution strategies on the quadratic assignment problem","2348612":"Development of problem-specific Evolutionary Algorithms","221451079":"The Positioning of Base Station in Wireless Communication with Genetic Approach","236952683":"Minimum Population Search – Lessons from building a heuristic technique with two population members","249736343":"XMAS: SUPPORTING THE TEDIOUS WORK OF VALIDATION IN AGENT-BASED SIMULATION","267836800":"INTELLIGENCE BY EVOLUTION","232644522":"A Modified Differential Evolution Algorithm and Its Application to Engineering Problems","249008288":"A multiset genetic algorithm for the optimization of deceptive problems","240359466":"Transforming an analytically defined color space to match psychophysically gained color distances","228967391":"An empirical study about the usefulness of evolution strategies to solve constrained optimization problems. Int J Gen Syst","220204891":"Time series prediction evolving Voronoi regions","256721203":"A survey on optimization metaheuristics","238595259":"A neuroevolutionary approach to stochastic inventory control in multi-echelon systems","229723959":"Determination of optimal number of projections and parametric sensitivity analysis of operators for parallel‐ray transmission tomography using hybrid continuous genetic algorithm","3865277":"The need for improving the exploration operators for constrained optimization problems","225794034":"Global Optimization Methods for Chemical Process Design: Deterministic and Stochastic Approaches","220795809":"Software testing using imprecise OCL constraints as oracles.","224292823":"Including Phenotype Information in Mutation to Evolve Artificial Neural Networks","259994102":"A survey on nature inspired metaheuristic algorithms for partitional clustering","5091015":"Two Notes on Replication in Evolutionary Modelling","5091009":"A Model of Boundedly Rational Consumer Choice - An Agent Based Appraoch","221645755":"Nonlinear programming in approximate dynamic programming - bang-bang solutions, stock-management and unsmooth penalties.","33400691":"Metaheuristic approaches for optimal broadcasting design in metropolitan MANETs","257635797":"Automated synthesis of multiple analog circuits using evolutionary computation for redundancy-based fault-tolerance","242555130":"Lecture notes in AI for Manufacturing and Automation","220371890":"Design explorations of performance driven geometry in architectural design using parametric modeling and genetic algorithms","3865259":"Robust evolutionary algorithm for optical thin-film designs","251644014":"G1.15: Computer Science Application: Evolving Cellular Automata to Perform Computations","250987622":"Algoritmos genéticos e variantes na solução de problemas de configuração de redes de distribuição","226002923":"Partially and Fully Constrained Ant Algorithms for the Optimal Solution of Large Scale Reservoir Operation Problems","252038550":"Application of Fuzzy Adaptive Genetic Algorithm in Reactive Power Compensation Optimization of Power Station","262206771":"The Modified Differential Evolution Algorithm (MDEA)","34813063":"Adaptive global optimization with local search /","2357942":"Evolution of Generative Design Systems for Modular Physical Robots","220516273":"Search-based software test data generation: a survey. Softw Test Verif Rel (STVR)","221462438":"Combining SVM Classifiers Using Genetic Fuzzy Systems Based on AUC for Gene Expression Data Analysis","260172052":"A Novel Objective Function and Algorithm for Optimal PSS Parameter Design in a Multi-Machine Power System","220061578":"A Novel Genetic Algorithm and its Application in Fuzzy Variable Structure Control of Fuel Cell","267010418":"On the Foundations and the Applications of Evolutionary Computing","2261691":"Scalar Optimization with Linear and Nonlinear Constraints Using Evolution Strategies","250077308":"Evolving Neural Network Architecture and Weights Using An Evolutionary Algorithm","3865255":"Resolution of quadratic assignment problems using an evolutionary algorithm","265852280":"Data Wrangling: A Decisive Step for Compact Regression Trees","291283966":"Numerical Techniques for Efficient Sonar Bearing and Range Searching in the Near Field Using Genetic Algorithms","201976495":"Adapting Operator Probabilities in Genetic Algorithm","224647109":"Adaptive Clonal Selection with Elitism-Guided Crossover for Function Optimization","222329831":"Genetic algorithms for modelling and optimisation","23824323":"Generative Representations for the Automated Design of Modular Physical Robots","3623580":"Towards self-adapting evolution strategies","267640156":"Decomposition-based evolutionary algorithm for large scale constrained problems","268414286":"Interferogram Analysis using Active Instance-Based Learning","233790300":"Crossover or mutation?","2263702":"Adapting Crossover in Evolutionary Algorithms","271400600":"Handling constraints with an evolutionary tool for scheduling oil wells maintenance visits","2535070":"Global Optimization For Constrained Nonlinear Programming","26623790":"Similarity-based Heterogeneous Neural Networks","26901283":"Mapping textures on 3d terrains: a hybrid cellular automata approach","238699654":"A tutorial presented at IROS 2004","2650774":"Artificial Neural Networks Optimization by means of Evolutionary Algorithms","220375009":"Optical Coating Designs Using the Family Competition Evolutionary Algorithm","49776692":"Hybrid Diversification Operator-Based Evolutionary Approach Towards Tomographic Image Reconstruction","237118695":"RUPRECHT-KARLS-UNIVERSITÄT HEIDELBERG","229736308":"Improving Structural Design by Genetic Search","228714345":"Multiobjective Simulated Annealing: A Comparative Study to Evolutionary Algorithms","223304582":"Capacitor placement in large-scale distribution systems using variable scaling hybrid differential evolution","266883364":"Úvod do teórie neurónových sietí","2802407":"Genetic Algorithms and Artificial Life. Artif Life","225134502":"A GA-Based Algorithm with a Very Fast Rate of Convergence","228356946":"An IDEA for Design","224646060":"A Novel Evolutionary Algorithm for Efficient Minimization of Expensive Black-box Functions with Assisted-Modelling","221006844":"Constraint handling in multi-objective evolutionary optimization","252809670":"Using Evolutionary Algorithms to Search for Control Parameters in a Nonlinear Partial Differential Equation","257436038":"Modification of codebook search in adaptive multi-rate wideband speech codecs using intelligent optimization algorithms","227036008":"Random Search Under Additive Noise","239858857":"EvoTest: Test Case Generation using Genetic Programming and Software Analysis","2249408":"Evolutionary Exploration of Search Spaces","261080429":"NSC-GA: Search for optimal shrinkage thresholds for nearest shrunken centroid","2616014":"Multicriteria Optimization with Export Rules for Mechanical Design","229690206":"Outline of a New Evolutionary Algorithm for Fuzzy Systems Learning","261197183":"An evolution-inspired algorithm for efficient dynamic spectrum selection","256210359":"Introduction","239599803":"Adaptive Operator Scheduling in Evolutionary Algorithms","3865289":"Experimental validations of the learnable evolution model","3418818":"Automatic Mesh Generation for Mobile Network Dimensioning Using Evolutionary Approach","228804436":"Condensing uncertainty via incremental treatment learning","221431749":"Metaheuristic Approaches for Optimal Broadcasting Design in Metropolitan MANETs.","4265656":"A Mutation-Classified, Parameter-Dynamic Immunological Algorithm for Global Optimization","264122690":"Comparing two evolutionary algorithm based methods for layout generation: Dense packing versus subdivision","221024211":"Self-organization and Evolution Combined to Address the Vehicle Routing Problem","234013426":"+CARPS: Configuration of Metaheuristics Based on Cooperative Agents","220740139":"Originality and diversity in the artificial evolution of melodies.","3812156":"On the filtering properties of evolved gate arrays","2429730":"Evolutionary Pattern Search Algorithms","3572541":"Synthesis of fuzzy controllers from linguistic specifications using an evolution strategy","280385466":"Evolutionary Optimization","271479585":"Test-Based Induction of Finite-State Machines with Continuous Output Actions","234014434":"Metaheuristics: A Bibliography","2341680":"A Survey of Genetic Algorithms","272160558":"An efficient simulated annealing algorithm for a No-Wait Two Stage Flexible Flow Shop Scheduling Problem","228678329":"Adaptive surface inspection via interactive evolution","222580319":"An Overview of Evolutionary Algorithms: Practical Issues and Common Pitfalls. Information and Software Technology","221017655":"Mutation Rate for Evolvable Hardware.","225385075":"Evolutionary Algorithms to Analyse and Design a Controller for a Flapping Wings Aircraft","251299301":"Evolutionary Analog IC Design Optimization","249734594":"Efficiently Modeling and Controlling Complex Dynamic Systems using Evolutionary Fuzzy Cognitive Maps (Invited Paper)","263057551":"Decision trees and data preprocessing to help clustering interpretation","2274048":"A Survey of Constraint Handling Techniques used with Evolutionary Algorithms","258407492":"Evolvable Systems: From Biology to Hardware","220702212":"LS-CMA-ES: A second-order algorithm for covariance matrix adaptation","251319769":"Evolutionary Strategies","224311929":"Effective Evolutionary Algorithms for Many-Specifications Attainment: Application to Air Traffic Control Tracking Filters","220702220":"Convergence Models of Genetic Algorithm Selection Schemes.","224645704":"A Novel Genetic Algorithm for Evolvable Hardware","2902784":"Genetic Programming: A Current Snapshot","228430515":"Adaptation and learning in animated creatures","242393436":"8 REFERENCES","227315389":"Rapid Modeling and Discovery of Priority Dispatching Rules: An Autonomous Learning Approach","228775568":"An Alternative Search-Based Approach for Isolating Translational Efficiency Bias","43550126":"Análisis y diseño de algoritmos genéticos paralelos distribuidos","2648863":"An Evolutionary Programming Approach to Self-Adaptation on Finite State Machines","3267337":"Variable Scaling Hybrid Differential Evolution for Solving Network Reconfiguration of Distribution Systems","2693906":"Minimal Simulations For Evolutionary Robotics","261354670":"Structure diversity design of analog circuits by evolutionary computation for fault-tolerance","234810046":"Generating flying creatures using body-brain co-evolution","200026282":"Swarm Intelligence","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","4304650":"A multi-focus image fusion algorithm with DT-CWT","228358865":"Evolving communication in embodied agents: Theory, Methods, and Evaluation","3815284":"An evolvable hardware approach to digital filter design","2750329":"Experiences of using Evolutionary Techniques in Logic Minimisation","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","224570931":"Closed-loop evolutionary multiobjective optimization","27224780":"Model Landscapes","220741233":"Evaluation of Alternative Penalty Function Implementations in a Watershed Management Design Problem.","30870158":"Evolving Representations Of Design Cases And Their Use In Creative Design","227271378":"The Randomized Ellipsoid Algorithm for Constrained Robust Least Squares Problems","259118123":"The estimation of failure probabilities as a false optimization problem","2252671":"Pareto Optimality, GA-easiness and Deception","224161281":"Solving optimal power flow problems using bacterial swarm optimization algorithm","6758200":"Generalized disjunction decomposition for evolvable hardware. IEEE Trans Syst Man Cybern Part B","260211943":"Design strategy for improving the energy efficiency in series hydraulic/electric synergy system","12044240":"A Convergence Analysis of Unconstrained and Bound Constrained Evolutionary Pattern Search","51474553":"Himmelstein DS, Greene CS, Moore JH.. Evolving hard problems: generating human genetics datasets with a complex etiology. Bio Data Mining 4: 21","2317128":"An Evolutionary Approach for Frequency Assignment in Cellular Radio Networks","4304682":"A New Tree Encoding for the Degree-Constrained Spanning Tree Problem","46122448":"Multi-Objective Node Placement Methodology for Wireless Sensor Network","221032028":"Evolutionary Algorithms Support Refueling of Pressurized Water Reactors","12314568":"Selection and determination of beam weights based on genetic algorithms for conformal radiotherapy treatment planning","2602835":"Artificial Intelligence Technologies in Complex Engineering Design","242405643":"Feasibility of the Evolutionary Algorithm using Different Behaviours of the Mutation Rate to Design Simple Digital Logic Circuits","224603678":"Evolving multi-modal behavior in NPCs","221018705":"Using Evolution Strategies to Find a Dynamical Model of the M81 Triplet","2475867":"On the Usefulness of the Evolution Strategies\u0027 Self-Adaptation Mechanism to Handle Constraints in Global Optimization","220403362":"Global Multiobjective Optimization Using Evolutionary Algorithms","23740136":"When Will a Genetic Algorithm Outperform Hill-Climbing?","2511780":"Testcase Generator for Nonlinear Continuous Parameter Optimization Techniques","277850893":"Integration of Optimization Algorithms With Sensitivity Analysis, With Application to Volcanic Regions","221431472":"Introducing Flexibility in Digital Circuit Evolution: Exploiting Undefined Values in Binary Truth Tables.","226077434":"Artificial Immune Systems for Optimization","222237371":"Evaluating customer aid functions of online stores with agent-based models of customer behavior and evolution strategy","220881580":"Comparison and Application of Self-tuning DE/HDE based Algorithms to solve Optimal Reactive Power Dispatch Problems with Multiple Objectives.","224107228":"Factors analysis on Stock Exchange of Thailand (SET) index movement","239545804":"Het meten van GA-hardheid — Measuring GA-hardness","220867233":"ARPIA: A high-level evolutionary test signal generator","224301772":"A study on the design issues of Memetic Algorithm","222300882":"Analog circuits optimization based on evolutionary computation techniques","2647989":"On The State of Evolutionary Computation","203863993":"An adaptation of evolutionary strategies for forecasting the exchange rate","247981400":"The robustness requirement in stochastic dynamic programing - preliminary draft of a draft","3861403":"System parameter estimation by evolutionary strategy","228627977":"An Introduction to Evolutionary Computing for Musicians","224516808":"A Probabilistic Memetic Framework","263147525":"Evolutionary Tuning of Building Models to Monthly Electrical Consumption","224185078":"Determining the Time Period and Amount of Training Data for Stock Exchange of Thailand Index Prediction","220692119":"Location Theory: A Unified Approach","3411845":"Multi-Objective Optimization and Multiple Constraint Handling with Evolutionary Algorithms – Part II: A Unified Formulation","268685233":"Multi-objective and gradient based structural design optimization of an aircraft wing","222568190":"Structural optimization using evolutionary algorithms","2621339":"Evolving Cellular Automata with Genetic Algorithms: A Review of Recent Work","220885655":"Genetic AlgorithmsNumerical Optimizationand Constraints.","224385761":"A variable scaling hybrid differential evolution for solving large-scale power dispatch problem","220360349":"Ga-Based Alternative Approaches for the Degree-Constrained Spanning Tree Problem.","228895335":"Monkey algorithm for global numerical optimization","28349046":"New Schemes of MUD for Synchronous DS-CDMA and its Overloaded Systems","225781427":"Synthesis of Spatio-temporal Models by the Evolution of Non-uniform Cellular Automata","222595722":"Variable scaling hybrid differential evolution for large-scale economic dispatch problems","203864052":"Curve Fitting Using Adaptive Evolution Strategies for Forecasting the Exchange Rate","3756011":"A study on the effect of multi-parent recombination in real coded genetic algorithms","3621860":"Unsupervised learning of neural networks for separation of unknown data","225179326":"A parameter-free self-adapting boundary genetic search for pipe network optimization","3336167":"Evolutionary Fuzzy Modeling","226041516":"Sampled Convex Programs and Probabilistically Robust Design","3756015":"The effectiveness of co-mutation in evolutionary algorithms: the \u0026Mscr;ijn operator","281972502":"A Minimum Population Search Hybrid for Large Scale Global Optimization","226445989":"Tackling Real-Coded Genetic Algorithms: Operators and Tools for Behavioural Analysis","45538666":"A Model Free Method to Generate Human Genetics Datasets with Complex Gene-Disease Relationships","225504942":"Large Scale Structural Optimization: Computational Methods and Optimization Algorithms","224645821":"Evolutionary Modeling of Larval Dispersal in Blowflies Using Non-Uniform Cellular Automata","250195255":"Cyberspace geography visualizati n","2930675":"Creating Complex Building Blocks through Generative Representations","280681317":"AN OPTIMIZATION-BASED FRAMEWORK FOR INSPECTION PLANNING","226751072":"Non-standard methods in evolutionary computation","223297193":"Evolutionary design and behavior analysis of neuromodulatory neural networks for mobile robots control","3411932":"Minimal representation multisensor fusion using differential evolution","2540494":"Evolutionary Strategies; A New Macroeconomic Policy Tool?","221462232":"Analysis of Selection, Mutation and Recombination in Genetic Algorithms.","275670912":"A critical analysis of the harmony search algorithm—How not to solve sudoku","3949516":"Fitness uniform selection to preserve genetic diversity","2356178":"Fitness Uniform Selection to Preserve Genetic Diversity","228346477":"Tabu Search","222505648":"Evaluating evolutionary algorithms. Artif Intell J","3610564":"From fuzzy linguistic specifications to fuzzy controllers using evolution strategies","49215771":"Predicción local mediante algoritmos evolutivos","222870196":"A multiobjective evolutionary algorithm for approximating the efficient set","226621052":"Simulated annealing with asymptotic convergence for nonlinear constrained optimization","2774997":"Adaptive Strategy Selection for Concept Learning","2531289":"The Theory And Applications Of Discrete Constrained Optimization Using Lagrange Multipliers"},"index":449}