{"abs":"Proposes a multicriteria decision making (MCDM) method by using a genetic algorithm (GA). The system consists of three phases. In the first phase, a rough set of Pareto optimal solutions is obtained using Kohonen\u0027s self organizing map (SOM). In the second phase, the decision maker (DM) selects his preferred solutions among the obtained set, where the mechanism of GA is used with the DM\u0027s preference assisted by radial basis function network (RBFN). In the third phase, the DM can explore the solution space further for the final decision","title":"GA-based decision support system for multicriteria optimization","id":3662955,"url":"https://www.researchgate.net/publication/3662955_GA-based_decision_support_system_for_multicriteria_optimization","names":["Masahiro Tanaka","Hikaru Watanabe","Yasuyuki Furukawa","Tetsuzo Tanino"],"references":{"216722120":"Self-Organizing and Associative Memory","2627581":"Evolution Strategies for Vector Optimization","248806481":"Multiobjectives in Water Resource Systems Analysis: The Surrogate Worth Trade Off Method","30873058":"Genetic + Data Structures \u003d Evolution Programs","247482326":"Self-Organizing Maps 3rd edition","246447751":"Self-Organising Maps","243690687":"Springer Lecture Notes in Economics and Mathematical Systems","285916832":"Theory of Multiobjective Optimization","220045504":"Multiple Criteria Optimization: Theory, Computation and Application. N.Y., Wiley","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization"},"citedIn":{"258219872":"A New Scalarization and Numerical Method for Constructing Weak Pareto Front of Multi-objective Optimization Problems","247303348":"A Feeling of Deja Vu: Controversies in Accounting and Auditing Regulation in Australia","229550759":"A non‐dominance‐based online stopping criterion for multi‐objective evolutionary algorithms","224333141":"A Jumping Genes Paradigm: Theory, Verification and Applications","284833264":"A new algorithm using front prediction and NSGA-II for solving two and three-objective optimization problems","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","4140591":"Content-based retrieval using a multi-objective genetic algorithm","40497531":"Multi objective particle swarm optimization using enhanced dominance and guide selection","51949067":"User preference extraction using dynamic query sliders in conjunction\nwith UPS-EMO algorithm","226813591":"A Population and Interval Constraint Propagation Algorithm","225174648":"Multiobjective Optimization by a Modified Artificial Immune System Algorithm","266653687":"Two-stage non-dominated sorting and directed mating for solving problems with multi-objectives and constraints","257605955":"A New Scalarization Technique to Approximate Pareto Fronts of Problems with Disconnected Feasible Sets","281081054":"A multi-objective optimization method based on simplex search method","257605701":"Numerical Procedures in Multiobjective Optimization with Variable Ordering Structures","224301948":"MSOPS-II: A general-purpose Many-Objective optimiser","3412759":"Interactive Particle Swarm: A Pareto-Adaptive Metaheuristic to Multiobjective Optimization","257432435":"Self-adaptive differential evolution algorithm with α-constrained-domination principle for constrained multi-objective optimization","251860271":"A Tunable Constrained Test Problems Generator for Multi-objective Optimization","272408331":"Generic Constraints Handling Techniques in Constrained Multi-criteria Optimization and its Application","263246216":"Improving a multi-objective differential evolution optimizer using fuzzy adaptation and [TEX equation: K] -medoids clustering","257334893":"Selection of initial designs for multi-objective optimization using classification and regression tree","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","261238446":"An evolutionary algorithm using two-stage non-dominated sorting and directed mating for constrained multi-objective optimization","229369750":"Multiobjective genetic algorithm strategies for electricity production from generation IV nuclear technology","221230959":"An Evolution-Based Dynamic Scheduling Algorithm in Grid Computing Environment.","260523722":"Active Learning of Pareto Fronts","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","245326285":"A multi-objective design optimization strategy as applied to pre-mixed pre-vaporized injection systems for low emission combustors","242382369":"STATE-OF-THE-ART MULTIOBJECTIVE EVOLUTIONARY ALGORITHMS—PARETO PANKING, DENSITY ESTIMATION AND DYNAMIC POPULATION","259522336":"Multi-objective module partitioning design for dynamic and partial reconfigurable system-on-chip using genetic algorithm","4140647":"Elitist Non-Dominated Sorting GA-II (NSGA-II) as a parameter-less multi-objective genetic algorithm","220291960":"JMetal: A Java framework for multi-objective optimization","261042134":"Differential evolution with the Adaptive Penalty Method for constrained multiobjective optimization","224078599":"Implementation of an Intelligent Reconfiguration Algorithm for an Electric Ship Power System","265844100":"A new multi-objective mixed-discrete particle swarm optimization algorithm","224075526":"Multiobjective optimization design via genetic algorithm","221228401":"Constrained Test Problems for Multi-objective Evolutionary Optimization","222302494":"DEMORS: a hybrid multi-objective optimization algorithm using differential evolution and rough sets for constrained problems. Comput Oper Res","221026163":"Interactive Multiobjective Evolutionary Algorithms","257640511":"GPU implementation of a multiobjective search algorithm","236176763":"Evolutionary-Based Hybrid Optimizer Applicable to Large-Scale Design Problems","222181714":"An evolutionary approach for multi-objective dynamic optimization applied to middle vessel batch distillation","220063602":"Mocell: a cellular genetic algorithm for multiobjective optimization. Int J Intell Syst","268813173":"A novel multi criteria decision making model for optimizing time–cost–quality trade-off problems in construction projects","220702035":"On the Use of Projected Gradients for Constrained Multiobjective Optimization Problems","220754269":"Evolutionary multi-objective optimization using expected improvement and generalized DEA","259147525":"Accelerated Industrial Blade Design Based on Multi-Objective Optimization Using Surrogate Model Methodology","224217130":"Hybrid Non-dominated Sorting Differential Evolutionary Algorithm with Nelder-Mead","271275100":"Novel frameworks for creating robust multi-objective benchmark problems","236327278":"D(2)MOPSO: MOPSO based on Decomposition and Dominance with Archiving using Crowding Distance in Objective and Solution Spaces.","242383882":"TCHEBYCHEFF METHOD-BASED EVOLUTIONARY ALGORITHM FOR MULTIOBJECTIVE OPTIMIZATION","3865154":"Distributed reinforcement learning for multiple objective optimization problems","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","228780505":"NO adsorption on Rh (100). I. Structural characterization of the adlayers","221175632":"A Novel Multi-Objective Evolutionary Algorithm Based on External Dominated Clustering","225617398":"Multiobjective Search Algorithm with Subdivision Technique","4201415":"Evolutionary many-objective optimisation: Many once or one many?","3419059":"AbYSS: Adapting Scatter Search to Multiobjective Optimization","259162619":"A modified objective function method with feasible-guiding strategy to solve constrained multi-objective optimization problems","220380846":"Neighborhood Knowledge-Based Evolutionary Algorithm for Multiobjective Optimization Problems","223074500":"Orthogonal simulated annealing for multiobjective optimization","257153732":"BSTBGA: a hybrid genetic algorithm for constrained multi-objective optimization problems. Comput Oper Res","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","271951531":"A direction based classical method to obtain complete Pareto set of multi-criteria optimization problems","224439233":"Real-Time Implementation of an Intelligent Algorithm for Electric Ship Power System Reconfiguration","227584570":"Generating equidistant representations in biobjective programming","223818727":"A tool for multiobjective evolutionary algorithms","3418757":"Rank-density-based multiobjective genetic algorithm and benchmark test function study","262228243":"ASMiGA: An archive-based steady-state micro genetic algorithm","221228444":"New Ideas in Applying Scatter Search to Multiobjective Optimization","245310505":"VIS: An artificial immune network for multi-objective optimization","262170390":"An Enhanced Domination Based Evolutionary Algorithm for Multi-objective Problems","226755891":"An Adaptive Penalty Function for Handling Constraint in Multi-objective Evolutionary Optimization","26544174":"Optimización multiobjetivo usando un algoritmo genético y un operador elitista basado en un ordenamiento no-dominado (NSGA-II)","228565796":"Utyuzhnikov, S.V.: Directed search domain: a new method for even generation of the Pareto frontier in multiobjective optimization. Eng. Optim. 43(5), 467-484","257619174":"An efficient multi-objective optimization approach based on the micro genetic algorithm and its application","3419017":"A Jumping Gene Paradigm for Evolutionary Multiobjective Optimization","233179993":"Constrained multi-objective optimization algorithm with an ensemble of constraint handling methods. Eng Optim","275103909":"A New Scalarization Method for Finding the Efficient Frontier in Non-convex Multi-objective Problems","225970356":"Fitness Assignment Methods for Many-Objective Problems","261267294":"Pure and Hybrid Optimizers Applicable to Large-Scale Design Problem","258219958":"A New Scalarization and Numerical Method for Constructing Weak Pareto Front of Multi-objective Optimization Problems","220265458":"Metamodels for Fast Multi-objective Optimization: Trading Off Global Exploration and Local Exploitation","262323829":"A hybrid algorithm based on particle swarm and chemical reaction optimization","252060894":"A fast and elitist multiobjective genetic algorithm: NSGA-II, IEEE Trans. on Evol","2239994":"Distributed Reinforcement Learning for Multiple Objective Optimization Problems","221174006":"A New Genetic Algorithm with Elliptical Crossover for Constrained Multi-objective Optimization Problems","222679964":"An expert system using rough sets theory and self-organizing maps to design space exploration of complex products","49282102":"Multi-level Ranking for Constrained Multi-objective Evolutionary Optimisation","259524769":"Improving the non-dominated sorting genetic algorithm using a gene-therapy method for multi-objective optimization","260360285":"A survey on multi-objective evolutionary algorithms for many-objective problems","226674526":"Approximating the \nε\n-Efficient Set of an MOP with Stochastic Search Algorithms","221008328":"Constrained multi-objective optimization algorithm with diversity enhanced differential evolution.","282878772":"A Multi-objective Mixed-discrete Particle Swarm Optimization Algorithm with Multi-domain Diversity Preservation","261493626":"Performance comparison of evolutionary algorithms applied to hybrid rocket problem","269777401":"Water cycle algorithm for solving constrained multi-objective optimization problems","233687833":"Improved rank-niche evolution strategy algorithm for constrained multiobjective optimization","276129160":"On the effects of combining objectives in multi-objective optimization","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm"},"index":450}