{"abs":"We present procedures for selecting the best or near-best of a finite number of simulated systems when best is defined by maximum or minimum expected performance. The procedures are appropriate when it is possible to repeatedly obtain small, incremental samples from each simulated system. The goal of such a sequential procedure is to eliminate, at an early stage of experimentation, those simulated systems that are clearly inferior, and thereby reduce the overall computational effort required to find the best. The procedures we present accommodate unequal variances across systems and the use of common random numbers. However, they are based on the assumption of normally distributed data, so we analyze the impact of batching (to achieve approximate normality or independence) on the performance of the procedures. Comparisons with existing procedures are also provided. Key Words: Output Analysis; Multiple Comparisons; Ranking and Selection; Variance Reduction 1 Introduction In a series of...","title":"A Fully Sequential Procedure for Indifference-Zone Selection in Simulation","id":2508196,"url":"https://www.researchgate.net/publication/2508196_A_Fully_Sequential_Procedure_for_Indifference-Zone_Selection_in_Simulation","names":["Seong-hee Kim","Barry L. Nelson","ACM Transactions on Modeling and Computer Simulation"],"references":{"221529143":"Getting More from the Data in a Multinomial Selection Problem.","228039569":"Comparing Systems via Simulation","233018724":"On two-stage selection procedures and related probability-inequalities","38357761":"Note on Anderson\u0027s Sequential Procedures with Triangular Boundary","264649866":"Efficient multinomial selection in simulation","2510889":"Simple Procedures for Selecting the Best Simulated System when the Number of Alternatives Is Large","216300212":"A comparison of the performances of procedures for selecting the normal population having the largest mean when populations have a common unknown variance","221525356":"Evaluating the probability of a good selection","229530869":"Multiple Comparison Procedures","227447442":"New Procedures to Select the Best Simulated System Using Common Random Numbers","3786469":"Statistical screening, selection, and multiple comparisonprocedures in computer simulation","2243967":"Two-Stage Multiple-Comparison Procedures for Steady-State Simulations","34550951":"Efficient multinomial selection in simulation /","3022598":"A lower bound for the correct subset selection probability and its application in discrete event simulations","239578606":"Design and analysis of experiments for statistical selection","232835019":"An improvement on paulson s sequential ranking procedure","225182786":"Selecting a good system: Procedures and inference","239064206":"Asymptotically optimal procedures for sequential adaptive selection of the best of several normal means","235709950":"A Sequential Procedure for Selecting the Population with the Largest Mean from $k$ Normal Populations","38364413":"Statistical Methods Related to the Law of the Iterated Logarithm","232970327":"Multiple comparisons in Model I one-way ANOVA with unequal variances","261589357":"Multiple Comparisons: Theory and Methods","238672386":"New Two-Stage and Sequential Procedures for Selecting the Best Simulated System","2449438":"Comparisons with a Standard in Simulation Experiments","216300761":"An improvement on Paulsson\u0027s procedure for selecting the population with the largest mean from $k$ normal populations with a common unknown variance"},"citedIn":{"4053821":"Comparison with a standard via fully sequential procedure","3933240":"Statistical selection of the best system","221525822":"Ranking and selection for steady-state simulation.","221596472":"Optimizing system configurations quickly by guessing at the performance","250254823":"Ch. 3. The planning and analysis of industrial selection and screening experiments","4053810":"Inferences from indifference-zone selection procedures","2510889":"Simple Procedures for Selecting the Best Simulated System when the Number of Alternatives Is Large","220340274":"Topics in real-time fleet management","228637617":"Selecting the best system when systems are revealed sequentially. IIE Transactions, 39, 723-734","3933230":"Output data analysis for simulations","4213843":"Review of advanced methods for simulation output analysis","222523479":"Sequential selection procedures: Using sample means to improve efficiency","280104102":"Ordinal optimization - empirical large deviations rate estimators, and stochastic multi-armed bandits","220136456":"Finding feasible systems in the presence of constraints on multiple performance measures","4213848":"Analysis methodology: are we done? [discrete-event simulation]","221528621":"Selecting The Best System: Theory And Methods","4899414":"A Bayesian approach to paired comparison rankings based on a graphical model","254050617":"Best-subset selection procedure","242713705":"Knowledge-Gradient Methods for Statistical Learning","221525547":"The \"BEST\" algorithm for solving stochastic mixed integer programs.","291574910":"Statistical Ranking and Selection","220669447":"Ranking and selection for steady-state simulation: Procedures and perspectives. INFORMS Journal on Computing, 14, 2-19","216301254":"Comparing systems via stochastic simulation: Selection-of-the-best procedures for optimization via simulation","220136504":"Simulation optimization with countably infinite feasible regions: Efficiency and convergence. ACM Transactions on Modeling and Computer Simulation, 16, 357-374","222577768":"Simulation optimization for an emergency department healthcare unit in Kuwait. Eur J Oper Res","279353737":"Simulation Input","221529860":"Statistical selection of the best system","279391893":"Examples","27522192":"Adaptive Control of Large-Scale Simulations","6532176":"Bioelectromagnetism - relative merits of electric and magnetic measurements in cardiac studies.","3933190":"Selection-of-the-best procedures for optimization via simulation","263403919":"On Multiple Comparison of Geometric Means of Exponential Parameters via Graphical Model","282926748":"Discrete optimization via simulation using Gaussian Markov random fields","232900259":"Finding the non-dominated Pareto set for multi-objective simulation models","220652133":"Comparison with a Standard via All-Pairwise Comparisons","235056708":"Integrated Risk-Sensitive, Simulation-Based and Graphical Methodologies for Estimation and Control","220701807":"Sequential Sampling in Noisy Environments","271468134":"Optimal learning with non-Gaussian rewards","257196319":"Stochastic dominance based comparison for system selection","257555730":"Some insights of using common random numbers in selection procedures","46267534":"Advances in ranking and selection: variance estimation and constraints","257739788":"Smit, S.K.: Parameter tuning for configuring and analyzing evolutionary algorithms. Swarm Evol. Comput. 1(1), 19-31","254005617":"Variability-Aware, Discrete Optimization for Analog Circuits","220136266":"Discrete-Event Simulation Optimization Using Ranking, Selection, and Multiple Comparison Procedures: A Survey","220668798":"The Knowledge-Gradient Policy for Correlated Normal Beliefs","257605635":"On the Probability of Correct Selection in Ordinal Comparison over Dynamic Networks","221528942":"Recent advances in ranking and selection","257196296":"Efficient comparison of constrained systems using dormancy","235010141":"On the Use of Surrogate Functions for Mixed Variable Optimization of Simulated Systems","222182240":"Selecting the best stochastic system for large scale problems in DEDS","265645195":"A simulation-based decision support system for a multi-echelon inventory problem with service level constraints","276415257":"Using multiattribute utility theory to avoid bad outcomes by focusing on the best systems in ranking and selection","261163251":"Efficient discrete optimization via simulation using stochastic kriging","221527127":"Statistical analysis of simulation output: output data analysis for simulations.","227217390":"Evolutionary Design of Emergent Behavior","281231526":"Sequential Selection with Unknown Correlation Structures","276114707":"Chance Constrained Selection of the Best","24110600":"Yard Crane Management by Simulation and Optimisation","279367361":"Simulation Programming: Quick Start","223626556":"Anticipatory algorithms for same-day courier dispatching","291018801":"A Sequential Budget Allocation Framework for Simulation Optimization","279384268":"Simulation Programming with VBASim","228368113":"Chapter 17 Selecting the Best System","228346610":"The Knowledge-Gradient Algorithm for Sequencing Experiments in Drug Discovery","235709565":"An Adaptive Approach to Controlling Parameters of Evolutionary Algorithms","261471463":"The \"Best\" Algorithm for solving Stochastic Mixed Integer Programs","242429184":"boot strapping with mirroring (BWM). This new bootstrap is an","235199863":"Optimization of a Multi-Echelon Repair System Via Generalized Pattern Search With Ranking and Selection: A Computational Study","228440808":"A Sequential Sampling Procedure for Stochastic Programming","46491826":"A quantile-based approach to system selection","262278106":"Rapid Screening Procedures for Zero-One Optimization via Simulation","228954844":"PERFORMANCE OF VARIANCE UPDATING PROCEDURES ON VARIOUS DATA","228954846":"Fully sequential indifference‐zone selection procedures with variance‐dependent sampling","4213819":"Finding the best in the presence of a stochastic constraint","220136546":"Finding Probably Best Systems Quickly via Simulations","27524317":"Ranking and Selection Procedures for Bernoulli and Multinomial Data","272427586":"Selecting the Best Simulated Design With the Expected Opportunity Cost Bound","4213823":"Performance of variance updating ranking and selection procedures","266656101":"A bilevel optimization approach to automated parameter tuning","228649249":"The tradeoff between sampling and switching: New sequential procedures for indifference-zone selection","221526197":"An indifference-zone selection procedure with minimum switching and sequential sampling","279350567":"International Series in Operations Research \u0026 Management Science","37255100":"Monte Carlo sampling-based methods in stochastic programming","241635555":"Large-scale ranking and selection using cloud computing","223932381":"A general framework on the simulation-based optimization under fixed computing budget","241635554":"Selecting the best by comparing simulated systems in a group of three","216300130":"Experimental Research in Evolutionary Computation---The New Experimentalism","220243879":"On the Asymptotic Validity of Fully Sequential Selection Procedures for Steady-State Simulation","23395822":"On Identification of the Number of Best Treatments Using the Newman-Keuls Test","245315349":"Simulation optimization: a comprehensive review on theory and applications. IIE Trans","3997875":"Output data analysis for simulations","232986732":"Fully sequential selection procedures with parabolic boundary","229023286":"Ranking And Selection For Steady-State Simulation","221526951":"Simulation selection problems: overview of an economic analysis.","227936002":"Fully Sequential Procedures for Comparing Constrained Systems via Simulation","4746206":"Distribution of Rankings for Groups Exhibiting Heteroscedasticity and Correlation","224123853":"A brief introduction to optimization via simulation","27531827":"Adaptive Random Search Methods for Simulation Optimization","270697909":"Selection Procedures for Simulations with Multiple Constraints under Independent and Correlated Sampling","221529260":"Restricted subset selection","257196492":"A simulation optimization approach for a two-echelon inventory system with service level constraints","220504766":"Multinomial selection problem: A study of BEM and AVC algorithms","273176788":"Optimal Budget Allocation Rule for Simulation Optimization Using Quadratic Regression in Partitioned Domains","4111779":"An odds-ratio indifference-zone selection procedure for Bernoulli populations","264489820":"Screening and selection procedures with control variates and correlation induction techniques","220258688":"A Knowledge-Gradient Policy for Sequential Information Collection","258329796":"Organic Computing","255721631":"A selection approach for solving the buffer allocation problem","4111772":"Combined pattern search and ranking and selection for simulation optimization","251463775":"Chapter 9 Subjective Probability and Bayesian Methodology","279384069":"Simulation Output","4306146":"Indifference-zone subset selection procedures: Using sample means to improve efficiency","224061438":"Ranking and Selection with Multiple Targets","242469846":"Selection Sequentielle en Environnement Aleatoire Appliquee a l\u0027Apprentissage Supervise","221528466":"Analysis methodology: Are we done?","221526937":"Applying Statistical Control Techniques to Air Traffic Simulations.","260516394":"Reducing the Conservativeness of Fully Sequential Indifference-Zone Procedures","220504726":"Selecting a Good Stochastic System for the Large Number of Alternatives","275720669":"Simulation Optimization: A Review and Exploration in the New Era of Cloud Computing and Big Data","224123880":"Do mean-based ranking and selection procedures consider systems\u0027 risk?","264817789":"Some efficient simulation budget allocation rules for simulation optimisation problems","275622872":"A Fully Sequential Elimination Procedure for Indifference-Zone Ranking and Selection with Tight Bounds on Probability of Correct Selection","4306166":"Sequential sampling for solving stochastic programs","278743850":"Efficient subset selection for the expected opportunity cost","234809412":"Statistical analysis of simulation output data","273923305":"Selecting Stopping Rules for Confidence Interval Procedures","24053972":"A computational method for ranking L products of parameters","242566837":"Decision-theoretic foundations of simulation optimization","224124059":"Selection of the best with stochastic constraints","281255686":"A review of optimal computing budget allocation algorithms for simulation optimization problem","224124060":"Optimal Computing Budget Allocation for constrained optimization","221527805":"Ranking and selection procedures for simulation.","267771705":"Simulation ranking and selection procedures and applications in network reliability design","34954948":"Variance estimation in steady-state simulation, selecting the best system, and determining a set of feasible systems via simulation [electronic resource] /","285596884":"Offline-Online Approximate Dynamic Programming for Dynamic Vehicle Routing with Stochastic Requests","222554257":"A sequential procedure for neighborhood selection-of-the-best in optimization via simulation","221527270":"A Framework for Simulating Human Cognitive Behavior and Movement When Predicting Impacts of Catastrophic Events.","221527264":"A minimal switching procedure for constrained ranking and selection","279367539":"Two Views of Simulation","261310276":"Ranking and selection meets robust optimization","221596142":"Finding probably better system configurations quickly","269329363":"Minimizing opportunity cost in selecting the best feasible design","257196427":"Controlled multistage selection procedures for comparison with a standard","261161329":"Selecting the best by comparing simulated systems in a group of three when variances are known and unequal","215642424":"Optimisation Methods in Supply Chain Applications: A Review","261471351":"Simulation Selection Problems: Overview of an Economic Analysis","269330671":"Ranking and selection in a high performance computing environment","279353669":"International Series in Operations Research \u0026 Management Science","220668867":"Simulation Allocation for Determining the Best Design in the Presence of Correlated Sampling","221527506":"Better Selection of the Best.","279367488":"Experiment Design and Analysis","261471346":"Ranking and Selection Procedures for Simulation","222287061":"A multi-objective selection procedure of determining a Pareto set","242391192":"A Complete Bibliography of ACM Transactions on Modeling and Computer Simulation","227733113":"Fully sequential indifference‐zone selection procedures with variance‐dependent sampling","261262201":"Comparison of Limit Standards using a Sequential Probability Ratio Test","221529050":"Comparison of limit standards using a sequential ratio test","221526747":"Efficient simulation procedures: comparison with a standard via fully sequential procedures.","215642410":"Simulation Optimisation Methods in Supply Chain Applications: A Review","242427779":"A FRAMEWORK FOR SIMULATING HUMAN COGNITIVE BEHAVIOR AND MOVEMENT WHEN PREDICTING IMPACTS OF CATASTROPHIC EVENTS Mary Court Jennifer Pittman School of Industrial Engineering University of Oklahoma Norman, OK 73019, U.S.A. Christos Alexopoulos David Goldsman Seong-Hee Kim Margaret Loper Amy Pritchett School of ISyE Georgia Institute of Technology Atlanta, GA 30332, U.S.A","236144611":"Parameter Tuning and Scientific Testing in Evolutionary Algorithms","233186068":"Fully sequential selection procedures with control variates","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","221528771":"New developments in ranking and selection: An empirical comparison of the three main approaches","224242853":"Stochastic Algorithms for Discrete Parameter Simulation Optimization","268070403":"Foundations and methods of stochastic simulation. A first course","283200283":"Fully Sequential Procedures for Large-Scale Ranking-and-Selection Problems in Parallel Computing Environments","276836219":"A Minimal Switching Procedure for Constrained Ranking and Selection under Independent or Common Random Numbers","227447666":"Economic Analysis of Simulation Selection Problems","277284729":"SIMULATION-BASED OPTIMIZATION","224156579":"Multi-walled carbon nanotube impedance"},"index":452}