{"abs":"Over the last decade, Evolutionary Algorithms (EAs) have emerged as a powerful paradigm for global optimization of multimodal functions. More recently, there has been significant interest in applying EAs to engineering design problems. However, in many complex engineering design problems where high-fidelity analysis models are used, each function evaluation may require a Computational Structural Mechanics (CSM), Computational Fluid Dynamics (CFD) or Computational Electro-Magnetics (CEM) simulation costing minutes to hours of supercomputer time. Since EAs typically require thousands of function evaluations to locate a near optimal solution, the use of EAs often becomes computationally prohibitive for this class of problems. In this paper, we present frameworks that employ surrogate models for solving computationally expensive optimization problems on a limited computational budget. In particular, the key factors responsible for the success of these frameworks are discussed. Experimental results obtained on benchmark test functions and real-world complex design problems are presented.","title":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","id":2889038,"url":"https://www.researchgate.net/publication/2889038_Surrogate-Assisted_Evolutionary_Optimization_Frameworks_for_High-Fidelity_Engineering_Design_Problems","names":["Yew Soon Ong","P.B. Nair","Andy J. Keane","Kok Wai Wong"],"references":{"235169540":"Hajela, P.: Parallel Genetic Algorithm Implementation in Multidisciplinary Rotor Blade Design. Journal of Aircraft 33(5), 962-969","225963254":"Multiparameter Structural Optimization Using FEM and multipoint Explicit Approximations","221602100":"\"Gridifying\" Aerodynamic Design Problem Using GridRPC.","224049497":"Evolutionary Optimization of Computationally Expensive Problems via Surrogate Modeling","2644397":"Airfoil And Wing Design Through Hybrid Optimization Strategies","267644405":"Response Surface Methods and Pareto Optimization in Crashworthiness Design","2782754":"Combining Approximation Concepts With Genetic Algorithm-Based Structural Optimization Procedures","220688174":"Global Optimization","2385583":"A Rigorous Framework for Optimization of Expensive Functions by Surrogates","220118677":"Optimization by Simulated Annealing","2792613":"Nonlinear Equality Constraints in Feasible Sequential Quadratic Programming","229925028":"Multipoint approximation development: Thermal structural optimization case study","257334727":"Approximation methods in multidisciplinary analysis and optimization: A panel discussion","2335408":"Utilizing Lamarckian Evolution and the Baldwin Effect in Hybrid Genetic Algorithms","220101386":"The GRID: Blueprint for a New Computing Infrastructure","227085212":"Approximation Concepts for Optimum Structural Design -A Review","3418786":"Meta-Lamarckian learning in memetic algorithms. IEEE Trans Evol Comput","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","2320571":"Gaussian Processes for Regression","269224213":"“Aircraft wing design using GA-Based multi-level strategies”","12473895":"Multiobjective Satisfaction within an Interactive Evolutionary Design Environment","227319575":"Comparative Studies of Metamodeling Techniques Under Multiple Modeling Criteria","220694713":"Statistical Learning Theory","4014626":"Surrogate-assisted coevolutionary search","4075030":"Global convergence of unconstrained and bound constrained surrogate-assisted evolutionary search in aerodynamic shape design","240021606":"Global Convergence of a a of Trust-Region Methods for Nonconvex Minimization in Hilbert Space","200033861":"Neural Networks for Pattern Recognition","38363491":"[Design and Analysis of Computer Experiments]: Comment","2323976":"Trust-Region Proper Orthogonal Decomposition for Flow Control","2464392":"Transductive Inference for Estimating Values of Functions","247074186":"Optimisation of a Stator Blade Used in a Transonic Compressor Cascade with Evolution Strategies","235167285":"On the Global Convergence of Trust Region Algorithms Using Inexact Gradient Information","268464435":"Combining approximation concepts with genetic algorithm-based structural optimization procedures","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","220690578":"Evolution and Optimum Seeking","2412049":"Design Of An Aircraft Brake Component Using An Interactive Multidisciplinary Design Optimization Framework","30873058":"Genetic + Data Structures \u003d Evolution Programs","45622657":"Statistical Learning Theory","30869230":"Handbook Of Genetic Algorithms","2354457":"On Evolution, Search, Optimization, Genetic Algorithms and Martial Arts - Towards Memetic Algorithms","227266999":"A Trust Region Framework for managing the use of approximation models in optimization","226662846":"Multipoint Cubic Surrogate Functions for Sequential Approximate Optimization","239744777":"A Case for Multilevel Optimization in Aeronautical Design","246309479":"Genetic Programs + Data Structures \u003d Evolution Programs","246809340":"Meta-lamarckian in memetic algorithm","2710759":"Lecture Notes in Computer Science","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","2799076":"Convergence of trust region augmented Lagrangian methods using variable fidelity approximation data","35896049":"Shape optimization of turbine blade firtrees.","226281257":"Convergence of trust region augmented Lagrangian methods using variable fidelity approximation data","222499995":"Improved genetic algorithm for the design of stiffened composite panels","2317176":"Comparative Studies Of Metamodeling Techniques Under Multiple Modeling Criteria","269078354":"Genetic algorithms in multidisciplinary rotor blade design","2425210":"The Approximation Power Of Moving Least-Squares","2675063":"A Comparison Of Approximation Modeling Techniques: Polynomial Versus Interpolating Models","245437888":"Combining genetic and deterministic algorithms for locating actuators on space structures","2627148":"Evolutionary Search of Approximated N-Dimensional Landscapes","246432859":"Improved genetic algorithms for the design of sti ened composite panels","2412105":"A Framework for Managing Models in Nonlinear Optimization of Computationally Expensive Functions","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","2449994":"Design and Analysis of a Computational Model of Cooperative Coevolution","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","2788312":"Evolving Neural Networks With Collaborative Species","221669701":"A Survey of evolution strategies","2365020":"Passive Vibration Suppression of Flexible Space Structures Via Optimal Geometric Redesign","38359473":"Multi-Variate Adaptive Regression Splines (with Discussion)","216301597":"Global Optimization","220306907":"Kriging as a surrogate fitness landscape in evolutionary optimization","242545161":"The Grid: Blueprint for New Computing Infrastructure","2611416":"A Survey of Evolution Strategies"},"citedIn":{"28358320":"Controlled Model Assisted Evolution Strategy with Adaptive Preselection","235308036":"Surrogate assisted local search in PMSM drive design","4251716":"Playing in the Objective Space: Coupled Approximators for Multi-Objective Optimization","44262438":"Genetic Algorithms for the Optimization of Catalysts in Chemical Engineering","224180058":"A serious game for understanding artificial intelligence in production optimization","221228457":"Noisy Multiobjective Optimization on a Budget of 250 Evaluations","226202364":"Distributed multilevel optimization for complex structures","224260949":"A Multi-Facet Survey on Memetic Computation","41116025":"Algorithme intelligent d\u0027optimisation d\u0027un design structurel de grande envergure","220381096":"Max-Min Surrogate-Assisted Evolutionary Algorithm for Robust Design","224683247":"Automatic Design and Optimization of Wind Turbine Blades","235720066":"DEUM - Distribution Estimation Using Markov Networks","227047303":"An Evolutionary Environment for Wind Turbine Blade Design","234091361":"Evolutionary Design of Wind Turbine Blades","220702133":"Ordinal Regression in Evolutionary Computation","224301772":"A study on the design issues of Memetic Algorithm","221432993":"Comparison of Global Optimization Methods for Drag Reduction in the Automotive Industry","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","239798227":"A hybrid model-classifier framework for managing prediction uncertainty in expensive optimisation problems","252041372":"Data fusion of multi-fidelity model and its application in low speed reflexed airfoil shape optimization","265470411":"A new self-adaptation scheme for differential evolution","220939824":"Parameter adaptation for differential evolution with design of experiments.","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","32173687":"Automotive Engine Calibration with Experiment-Based Evolutionary Multi-objective Optimization","220176770":"Memetic algorithm using multi-surrogates for computationally expensive optimization problems. Soft Comput","251299301":"Evolutionary Analog IC Design Optimization","225867988":"Evolutionary Optimization of Catalysts Assisted by Neural-Network Learning","225648080":"A Model-Assisted Memetic Algorithm for Expensive Optimization Problems","261109812":"On the use of a BSP Tree to create local surrogate models","43294524":"Multivariate Markov networks for fitness modelling in an estimation of distribution algorithm.","228940044":"Design optimization applied in structural dynamics","227022372":"A Review of Techniques for Handling Expensive Functions in Evolutionary Multi-Objective Optimization","248808953":"Efficient Prediction Uncertainty Approximation in the Calibration of Environmental Simulation Models","220741511":"A Pareto Following Variation Operator for Fast-Converging Multiobjective Evolutionary Algorithms","225401439":"Automatic Approximation of Expensive Functions with Active Learning","226249293":"Neural Networks as Surrogate Models for Measurements in Optimization Algorithms","47805548":"Multilevel Modeling","3418893":"Max-min surrogate-assisted evolutionary algorithm for robust design","221276938":"An Efficient Differential Evolution Algorithm with Approximate Fitness Functions Using Neural Networks","228648733":"A CASE STUDY OF USING SIMULATION AND SOFT COMPUTING TECHNIQUES FOR OPTIMISATION OF MANUFACTURING SYSTEMS","225410770":"Evolutionary Shape Optimization Using Gaussian Processes","220741610":"A study on metamodeling techniques, ensembles, and multi-surrogates in evolutionary computation","225451826":"Surrogate Model for Continuous and Discrete Genetic Optimization Based on RBF Networks","266656422":"Surrogate-Assisted Optimisation of Composite Applications in Mobile Ad hoc Networks","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","262914287":"An Effective Ensemble-Based Method for Creating On-the-Fly Surrogate Fitness Functions for Multi-Objective Evolutionary Algorithms","271880689":"Memetic algorithms and memetic computing optimization: A literature review","224343577":"Blind deconvolution technique for de-noising of Non-stationary seismic signals using DWT","268073651":"Markov networks in evolutionary computation","52003280":"Foundations of Computational Intelligence Volume 1: Learning and Approximation","226233783":"DEUM – A Fully Multivariate EDA Based on Markov Networks","258397098":"Surrogate-Assisted Multiobjective Evolutionary Algorithms for Structural Shape and Sizing Optimisation","282739466":"Bridging the gap between deterministic and probabilistic uncertainty quantification using advanced proxy based methods","221008760":"Using a Markov network as a surrogate fitness function in a genetic algorithm.","46491920":"Evolutionary optimisation of noisy multi-objective problems using confidence-based dynamic resampling","257635852":"Parameter control system of evolutionary algorithm that is aided by the entire search history","226058401":"A Metamodel-Assisted Steady-State Evolution Strategy for Simulation-Based Optimization","2876151":"Hierarchical Surrogate-Assisted Evolutionary Optimization Framework","223460495":"Evolutionary Computation System for Problem-Tailored Genetic Optimization of Catalytic Materials","265614475":"ADAPTIVE SURROGATE-ASSISTED EVOLUTION","261239666":"Automatic Aerodynamic Design of a Wind Turbine through Evolutionary Techniques","220741321":"ASAGA: An adaptive surrogate-assisted genetic algorithm","238433879":"Metamodel-Assisted Simulation-Based Optimisation of Manufacturing Systems","241515526":"A Study on Metamodeling Techniques, Ensembles, and Multi-Surrogates in Surrogate-Assisted Memetic Algorithms","274677820":"Multi-objective parameter optimization of common land model using adaptive surrogate modeling","280035156":"Multi-objective parameter optimization of common land model using adaptive surrogate modeling","224646025":"Curse and Blessing of Uncertainty in Evolutionary Algorithm Using Approximation","261045347":"Fitness Modeling With Markov Networks","233529605":"Increasing the Density of Available Pareto Optimal Solutions","237150284":"Sampling strategies in ordinal regression for surrogate assisted evolutionary optimization","228707279":"Metamodel-Assisted Simulation-Based Optimization of a Real-World Manufacturing Problem","224246963":"A Memetic Genetic Programming with decision tree-based local search for classification problems","272891058":"Multiobjective optimization: When objectives exhibit non-uniform latencies","261369702":"Pareto Front Estimation for Decision Making","235720063":"An application of a GA with Markov network surrogate to feature selection","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","221006937":"Clustered Multiple Generalized Expected Improvement: A Novel Infill Sampling Criterion for Surrogate Models","267488516":"Variable Fidelity Modeling as Applied to Trajectory Optimization for a Hydraulic Backhoe","225379736":"Hybrid evolutionary algorithm with hermite radial basis function interpolants for computationally expensive adjoint solvers. Comput Optim Appl","271738053":"A two-layer surrogate-assisted particle swarm optimization algorithm","245426264":"Preference-Based Surrogate Modeling in Engineering Design","225583755":"Individual-based Management of Meta-models for Evolutionary Optimization with Application to Three-Dimensional Blade Optimization","220866128":"Neural Networks as Surrogate Models for Measurements in Optimization Algorithms.","224916508":"Evolution by Adapting Surrogates","263507657":"Using self-adaptive optimisation methods to perform sequential optimisation for low-energy building design","238767173":"Artificial Intelligence and Computational Intelligence - International Conference, AICI 2010, Sanya, China, October 23-24, 2010, Proceedings, Part II","224177826":"A surrogate-assisted evolutionary algorithm for minimax optimization","258233371":"Comparative Performance of Surrogate-Assisted MOEAs for Geometrical Design of Pin-Fin Heat Sinks"},"index":453}