{"abs":"In power engineering, minimizing the power loss in the transmission lines and/or minimizing the voltage deviation at the load buses by controlling the reactive power is referred to as optimal reactive power dispatch (ORPD). Recently, the use of evolutionary algorithms (EAs) such as differential evolution (DE), particle swarm optimization (PSO), evolutionary programming (EP), and evolution strategies (ES) to solve ORPD is gaining more importance due to their effectiveness in handling the inequality constraints and discrete values compared to that of conventional gradient-based methods. EAs generally perform unconstrained searches, and they require some additional mechanism to handle constraints. In the literature, various constraint handling techniques have been proposed. However, to solve ORPD the penalty function approach has been commonly used, while the other constraint handling methods remain untested. In this paper, we evaluate the performance of different constraint handling methods such as superiority of feasible solutions (SF), self-adaptive penalty (SP), -constraint (EC), stochastic ranking (SR), and the ensemble of constraint handling techniques (ECHT) on ORPD. The proposed methods have been tested on IEEE 30-bus, 57-bus, and 118-bus systems. Simulation results clearly demonstrate the importance of employing an efficient constraint handling method to solve the ORPD problem effectively.","title":"Efficient constraint handling for optimal reactive power dispatch problems","id":271617952,"url":"https://www.researchgate.net/publication/271617952_Efficient_constraint_handling_for_optimal_reactive_power_dispatch_problems","names":["Rammohan Mallipeddi","S. Jeyadevi","Ponnuthurai N. Suganthan","Baskar Subramanian","Swarm and Evolutionary Computation"],"references":{"232973282":"Volt-Var Optimization Using Differential Evolution","3459445":"Optimal Power Flow Solutions","281266055":"No Free Lunch Theorems for Optimization","220380837":"Differential Evolution Algorithm With Strategy Adaptation for Global Numerical Optimization.","3267702":"A Comparative Study on Particle Swarm Optimization for Optimal Steady-State Performance of Power Systems","3263867":"Application of Newton\u0027s optimal power flow in voltage/reactive power control","3213370":"Optimal Power Flow by Enhanced Genetic Algorithm","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","3267583":"A Hybrid Genetic Algorithm–Interior Point Method for Optimal Reactive Power Flow","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","223864473":"A Cauchy-based evolution strategy for solving the reactive power dispatch problem","3479717":"Solving multi-objective optimal power flow using differential evolution","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","220514421":"Constraint-handling in nature-inspired numerical optimization: past, present and future. Swarm Evol Comput","3267300":"A Multiagent-Based Particle Swarm Optimization Approach for Optimal Reactive Power Dispatch","222759698":"Optimal reactive power dispatch using self-adaptive real coded genetic algorithm","220375156":"Schoenauer, M.: Evolutionary Algorithms for Constrained Parameter Optimization Problems. Evolutionary Computation 4(1), 1-32","280901096":"Evolutionary algorithms for constrained parameter optimization problems","3264742":"A direct nonlinear predictor corrector primal-dual interior point algorithm for optimal power flows. IEEE Trans Power Syst 9:876-883","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","222071019":"Differential evolutionary algorithm for optimal reactive power dispatch","224645691":"Constrained Optimization by the ε Constrained Differential Evolution with Gradient-Based Mutation and Feasible Elites","3263784":"“Further Developments in LP-Based Optimal Power Flow,”","3418601":"Yao, X.: Stochastic ranking for constrained evolutionary optimization. IEEE Trans. Evol. Comput. 4, 284-294","3355244":"Comparison and improvement of evolutionary programming techniques for power system optimal reactive power flow","3894619":"A Particle swarm optimization for reactive power and voltage control considering voltage security assessment","3265683":"Yang, F.F.: Optimal reactive power planning using evolutionary programming: a comparative study for evolutionary programming, evolutionary strategy, genetic algorithm and linear programming. IEEE Trans. Power Syst. 13(1), 101-108","3479574":"Study of differential evolution for optimal reactive power flow","220200054":"Differential evolution approach for optimal reactive power dispatch. Appl Soft Comput 8:1549-1561","3264669":"Optimal Reactive Dispatch through Interior Point Methods","13098216":"Michalewicz, Z.: Evolutionary Algorithms, Homomorphous Mappings, and Constrained Parameter Optimization. Evolutionary Computation 7(1), 19-44","224645717":"A Self Adaptive Penalty Function Based Algorithm for Constrained Optimization","224330344":"Differential Evolution Algorithm With Strategy Adaptation for Global Numerical Optimization","222573244":"Optimal power flow using particle swarm optimization","220381210":"Ensemble of Constraint Handling Techniques","3211721":"Reactive-Power Dispatch by Successive Quadratic Programming","3418509":"Macready, W.G.: No Free Lunch Theorems for Optimization. IEEE Transactions on Evolutionary Computation 1(1), 67-82","3354383":"Reactive power/voltage control in a distribution substation using dynamic programming","3418762":"Self-Adaptive Fitness Formulation for Constrained Optimization","239362234":"A New hybrid evolutionary strategy for reactive power dispatch","233179993":"Constrained multi-objective optimization algorithm with an ensemble of constraint handling methods. Eng Optim"},"citedIn":{"282398356":"Obstacles and difficulties for robust benchmark problems: A novel penalty-based robust optimisation method","264624550":"Chaotic artificial bee colony algorithm based solution of security and transient stability constrained optimal power flow","267921436":"An improved teaching–learning-based optimization algorithm using Lévy mutation strategy for non-smooth optimal power flow","279827595":"Voltage Stability Constrained Multi-Objective Optimal Reactive Power Dispatch under Load and Wind Power Uncertainties: A Stochastic Approach","277950871":"Metaheuristic optimization methods for a comprehensive operating schedule of battery, thermal energy storage, and heat source in a building energy system","265906768":"Load uncertainty (LU) analysis on Multi objective reactive power dispatch (MORD) Using Monte Carlo Simulation (MCS)","287842916":"Optimal DG placement and sizing in radial distribution systems using NSGA-II for power loss minimization and voltage stability enhancement","281149836":"A Two-point Estimate Method for Uncertainty Modeling in Multi-Objective Optimal Reactive Power Dispatch Problem","259170621":"Modeling and seeker optimization based simulation for intelligent reactive power control of an isolated hybrid power system","262770086":"A new hybrid algorithm for optimal reactive power dispatch problem with discrete and continuous control variables","271604576":"Hybrid improved binary particle swarm optimization approach for generation maintenance scheduling problem","282282819":"Hybrid PSO-tabu search for the optimal reactive power dispatch problem","281678872":"A Variable Reduction Strategy for Evolutionary Algorithms Handling Equality Constraints","274075361":"Research Article Differential Evolution with Population and Strategy Parameter Adaptation","278323022":"Optimal VAR control for real power loss minimization using differential evolution algorithm","286331656":"Improved Adaptive Differential Evolution Algorithm with External Archive","271538965":"Optimal reactive power dispatch by particle swarm optimization with an aging leader and challengers","274386017":"Probabilistic Multi Objective Optimal Reactive Power Dispatch Considering Load Uncertainties Using Monte Carlo Simulations","274509408":"Accelerate Population-Based Stochastic Search Algorithms With Memory for Optima Tracking on Dynamic Power Systems","269308433":"Optimal reactive power dispatch based on particle swarm optimization approach applied to the Algerian electric power system","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm","291128357":"A Soft-Computing Based Approach to Economic and Environmental Analysis of an Autonomous Power Delivery System Utilizing Hybrid Solar – Diesel – Electrochemical Generation","284112560":"Optimal Operation of Energy Systems Including Energy Storage Equipment under Different Connections and Electricity Prices"},"index":454}