{"abs":"Many practiced and proposed methods for the generation of pseudo-random numbers for use in Monte Carlo calculation can be expressed in the following way: One chooses an integer P, the base; an integer λ, the multiplier, prime to P; and an integer μ, the increment, less than P (μ is frequently, but not always, zero). One then defines recursively a sequence x0, x1, x2, … (1) of integers by x0 \u003d a, (2) xn+1 ≡ λxn + μ (mod P), (3) 0 \u0026lE; xn P. (4) It is clear that such a sequence is periodic with period P or less. Much work has been done on the determination of the period for various choices of P, λ and μ [1-7]. From this work one concludes that it is relatively easy to assure an adequately long period and that other considerations should determine the choice of these parameters.As for P, machine convenience dictates the choices P \u003d 2q or P \u003d 10q for a q-place binary or decimal machine, respectively. No other choice of P appears to have any practical advantage whatever. As for λ and μ it is the thesis of this note that they should be chosen to reduce serial correlation in the sequence (1), and we proceed to show how this may be done. We assume that λ and μ are such that the sequence (1) has an adequately long period. Then, clearly, one may assume, with error of order 1/P or less, that the sequence (1) is continuously and uniformly distributed on the interval (0, P). Then, if (\u0026lpargt;Z\u0026rpargt;) denotes the mean value of Z, \u0026lpargt;xn\u0026rpargt; \u003d 1/P ∫P0 x dx \u003d P/2 (5) \u0026lpargt;xn2\u0026rpargt; \u003d 1/P ∫P0 x2 dx \u003d P2/3 (6) and Var (xn) \u003d P2/3 - P2/4 \u003d P2/12. (7) Further, one may write xn+1 \u003d P{(λxn + μ)P-1}; (8) where {···} denotes “fractional part of.” (9) Also \u0026lpargt;xnxn+1\u0026rpargt; \u003d 1/P ∫P0 xP {(λx + μ)P-1} dx. (10) An elementary but tedious integration yields (see Appendix) \u0026lpargt;xnxn+1\u0026rpargt; \u003d P2/4 + P2 - 6μ(P - μ)/12λ. (10′) Hence cov (xn, xn+1) \u003d P2 - 6μ(P - μ)/12λ, (11) and, if \u0026rgr; (x, y) \u003d the correlation coefficient of x and y, (12) then \u0026rgr; (xn, xn+1) \u003d 1 - 6 μ/P (1 - μ/P)/λ. (13)One must be cautious of the conclusions one draws from (13) because of the approximate nature of its derivation. But one can say that a method which uses very small values of λ and μ is faulty. Unfortunately, such methods have been repeatedly suggested, and in one case within the author\u0027s knowledge serious difficulties were encountered in a Monte Carlo calculation because of the use of one such method. One should not lose sight of the fact that the correlation between a random number and its immediate successor is by no means the only one of importance. It is very difficult to give a precise rule, but it seems plausible that the correlation between the current random number and, at least, its next 10 or 20 successors should be controlled. Fortunately, for any such method one may write xn+p ≡ λpxn + μp (mod P), (14) with λp ≡ λp (mod P) (15) and μp ≡ λp - 1/λ - 1 μ (mod P), (16) and again one may estimate the correlation with the use of equation (13).","title":"Serial Correlation in the Generation of Pseudo-Random Numbers","id":220430805,"url":"https://www.researchgate.net/publication/220430805_Serial_Correlation_in_the_Generation_of_Pseudo-Random_Numbers","names":["R. R. Coveyou","Journal of the ACM"],"references":{"220432387":"On a Periodic Property of Pseudo-Random Sequences","220431650":"On Sequences of Pseudo-Random Numbers of Maximal Length","36180283":"Generation and testing of pseudo-random numbers.","236515277":"RANDOM NUMBER GENERATION ON THE BRL HIGH-SPEED COMPUTING MACHINES","242476998":"Generating and Testing Pseudo Random Numbers on the IBM Type 701","220432090":"The Generation of Pseudo-Random Numbers on a Decimal Calculator","242326157":"Mathematical Methods in Large-Scale Computing Units"},"citedIn":{"242637558":"Pseudorandom numbers and optimal coefficients","242430834":"Modified Noise f or Ev aluation on Graphics Hard war e","234783231":"Algorithm 266: Pseudo-random numbers [G5]","251273598":"DEDS Stochastic Behaviour and Data Modelling","220425509":"Algorithm 265: Find precedence functions [L2]","266168667":"Modelling and simulation. Exploring dynamic system behaviour. With CD-ROM","250673401":"Allgemeiner Bericht über Monte-Carlo-Methoden","260406287":"Linear Regression with Non-Constant, Unknown Error Variances: Sampling Experiments with Least Squares, Weighted Least Squares and Maximum Likelihood Estimators","238875568":"Monte Carlo estimation of powers of the distribution-free two-sample tests of Wilcoxon, Van der Waerden and Terry and the comparison of these powers","239394122":"A bibliography on the properties, generation and control system applications of shift-register sequences","228982314":"A Brief OpenGL Shading Tutorial","221248928":"Modified noise for evaluation on graphics hardware","227022488":"Parallelization of random number generators and long-range correlations","265501249":"A 48-bit pseudo-random number generator","23830137":"A comparative analysis of two concepts in the generation of uniform pseudo-random numbers.","239127137":"Eine neue Schnellmethode zur Bestimmung des Wismuts","225828439":"Monte Carlo Methods","220426247":"Testing a random number generator","221527953":"Testing Random Number Generators","286879932":"Simulation of asian options delta using a quadratic congruential pseudo-random numbers generator","227155490":"Sequential monte carlo techniques for the solution of linear systems","251371598":"Variable Length Number Chains Generation without Repetitions","239552241":"An A Priori Determination of Serial Correlation in Computer Generated Random Numbers","229337619":"Synthesis of probability transformers","251858619":"AntiCollision Algorithm of Splitting Tags in RFID Systems","202880300":"Simulation and The Monte Carlo Methods","286902309":"The investigation into three-dimensional mesoscale modelling of fully-graded concrete","220566426":"Quasi-Random Number Sequences from a Long-Period TLP Generator with Remarks on Application to Cryptography","233223334":"Impact of random number generators in time series monte carlo simulation","225196456":"Autocorrelations between pseudo-random numbers","228499803":"Essential Mathematics for Political and Social Research","231337358":"A retrospective and prospective survey of the Monte Carlo method, SIAM Rev., 12, 1-63","265894801":"Random Number Generators","234781367":"Some New Results in Pseudo-Random Number Generation","221395966":"Cryptography using modular software elements","275730466":"Die Erzeugung von Pseudozufallsprozessen zur Simulation von Nachrichtensignalen","224582322":"Random-number generation on digital computers","220426101":"Algorithm 264: Interpolation in a table [E1]","220430580":"Fourier Analysis of Uniform Random Number Generators","226322341":"An exact determination of serial correlations of pseudo-random numbers","220431737":"Notes on a New Pseudo-Random Number Generator","220432377":"Mixed Congruential Random Number Generators for Decimal Machines","3046643":"The Autocorrelation Structure of Tausworthe Pseudorandom, Number Generators","226763994":"On a new class of multiplicative pseudo-random number generators","282673671":"Anti-collision algorithm for RFID systems based on tag information grouping","220432322":"On a Weight Distribution Problem, with Application to the Design of Stochastic Generators","243119647":"Deterministic simulation of random processes","220430795":"Mixed Congruential Random Number Generators for Binary Machines","262784837":"Monte Carlo simulation of nuclear logging detection systems","250029335":"Monte Carlo Methods","220423889":"Algorithm 267. Random normal deviate","242104221":"A New PseudoRandom Number Generator","220420816":"Algorithm 263 Gomory 1 [H]","3046621":"Autocorrelation Peaks in Congruential Pseudorandom Number Generators","234794504":"Parallelism in computer organization random number generation in the fixed-plus-variable computer system","220425940":"Method in randomness","220419668":"Generating pseudorandom numbers on a two\u0027s complement machine such as the IBM 360","38358449":"On Combining Pseudorandom Number Generators","242924930":"The binary derivative test: noise filter, crypto aid, and random-number seed selector","245088610":"A Study of Methods for Comparing Several Variances","238678083":"Quasi-Monte Carlo Methods and Pseudo-Random Numbers"},"index":456}