{"abs":"User-written programs on the Dartmouth Time-Sharing System can communicate with many remote terminals simultaneously and can control the interactions between these terminals. Such programs can be written using standard input and output instructions in ...","title":"Bivariate normal distributions","id":262326803,"url":"https://www.researchgate.net/publication/262326803_Bivariate_normal_distributions","names":["Thomas G. Donnelly","Communications of the ACM"],"references":{"226500448":"Solution of Real and Complex Systems of Linear Equations","220422688":"Algorithm 304: Normal curve integral","38367071":"Tables for Computing Bivariate Normal Probabilities"},"citedIn":{"23634664":"A finite mixture model for the clustering of mixed-mode data","228262683":"The Valuation of Credit Guarantees by Compound Options","243044924":"On the Ratio of Two Folded Normal Distributions","268170490":"A novel series expansion for the multivariate normal probability integrals based on Fourier series","225314922":"Infill-sampling design and the Cost of classification errors","16371708":"Dietary variability and its pact on nutritional epidemiology","266393253":"Tail approximation of the skew-normal by the skew-normal-Laplace:application to Owen’s T function and the bivariate normal distribution","222827343":"Stochastic social optimum traffic assignment","226648971":"Range of Correlation Matrices for Dependent Random Variables with Given Marginal Distributions","267482491":"Ranked Set Sampling with Non-Random Selection of Sets and Errors in Ranking","233442592":"A comparison of bivariate normal algorithms","220658605":"Information Theory Cohen-Merhav bounds on the symbol error rate of uncoded signalling in AWGN interference.","220679979":"Tight error bounds for nonuniform signaling over AWGN channels.","2744932":"Incremental Refinement Structures for Approximate Signal Processing","240208286":"A set-theoretic random utility model of choice behavior","238864883":"On the Computation of the Bivariate Normal Integral","24073023":"“The Econometrics of Markest with Quantity Controls.”","232981495":"Using the bivariate normal distribution to construct probability models in the health sciences","256590559":"A two-stage procedure for selecting the largest normal mean whose first stage selects a bounded random number of populations","250663781":"Evaluation of the normal distribution function","226230569":"Characteristic behavior and order relations for indicator variograms","4194838":"A Simple form for the two-dimensional Q-function suitable for performance evaluation of communication systems","239019557":"Approximations to Multivariate Normal Rectangle Probabilities Based on Conditional Expectations","238674402":"A Transformed, Thresholded Gaussian Model for Precipitation Extremes or What I Have Been Thinking About While Constantly Flying Between North Carolina and Colorado","245454522":"Die Bewertung von Kreditgarantien mittels Hyperoptionen","243042721":"Comparison of algorithms for bivariate normal probability over a rectangle based on self-validated results from interval analysis","2737719":"Probabilistic Complexity Analysis for a Class of Approximate DFT Algorithms","3080241":"Tight error bounds for nonuniform signaling over AWGN channels","237655371":"Probit Model Estimation Revisited: Trinomial Models of Household Car Ownership","243044189":"A class of weighted normal distributions and its variants useful for inequality constrained analysis","227829175":"A decision‐theoretic evaluation of early stopping rules","220668996":"Efficient Correlation Matching for Fitting Discrete Multivariate Distributions with Arbitrary Marginals and Normal-Copula Dependence","245068351":"A Simple Technique for the Valuation and Hedging of American Option","258569421":"Accounting for Proof Test Data in a Reliability-Based Design Optimization Framework","23645123":"A class of weighted multivariate normal distributions and its properties","241225421":"Efficient Correlation Matching for Normal-Copula Dependence when Univariate Marginals Are Discrete","247740522":"Beyond the Gold and Pray equation: Introducing interrelationships in industry-level unit demand equations for business games","261417786":"A new lower bound on error probability for nonuniform signals over AWGN channels","20230811":"A computer program for summarizing scatter plots with robust ellipses","10803412":"Design of Phase II cancer trials evaluating survival probabilities","254332312":"An Error-Bounded Algorithm for Normal Probabilities of Rectangular Regions","230446604":"The size distribution of potato tubers and its application to grading schemes. Ann. Appl. Biol. 113, 579-87","2463953":"Numerical Computation Of Multivariate Normal Probabilities","19975049":"A FORTRAN function for the bivariate normal integral","267660878":"Nonparametric Prediction Intervals for a Future Sample Median","257449378":"Rainfall-derived growing season characteristics for agricultural impact assessments in South Africa","243048256":"An error-bounded polynomial approximation for bivariate normal probabilities"},"index":462}