{"abs":"A simple approximation for the bivariate normal distribution function is described, together with a second-order refinement. For the absolute value of the correlation coefficient less than or equal to 0·9, the worst error is about 10% arising when both arguments of the distribution function are equal, but over most of the range the agreement is much closer. An extension to trivariate normal integrals has similar good properties.","title":"A Simple Approximation for Bivariate and Trivariate Normal Integrals","id":236586737,"url":"https://www.researchgate.net/publication/236586737_A_Simple_Approximation_for_Bivariate_and_Trivariate_Normal_Integrals","names":["D.R. Cox","Nanny Wermuth","International Statistical Review"],"references":{"243082509":"Testing Multivariate Normality"},"citedIn":{"287382112":"The Capture/Emission Time Map Approach to the Bias Temperature Instability","233306339":"An approximation to bivariate and trivariate normal integrals","243050360":"Some Relationships Between Skew-Normal Distributions and Order Statistics from Exchangeable Normal Random Vectors","220286439":"Numerical Computation of Rectangular Bivariate and Trivariate Normal of t Probabilities","24065256":"Modeling maxima of longitudinal contralateral observations","24060391":"Setting test limits under prescribed consumer loss","21697154":"Prediction of selection response for threshold dichotomous traits","265037191":"Association Structures with Few Variables: Characteristics and Examples","226962505":"Springer Texts in Statistics","236656269":"Response Models for Mixed Binary and Quantitative Variable","245433787":"Terminal-Area Aircraft Tracking Using Hybrid Estimation","282524749":"A Simple Conditional Approach for Generating Spatial Correlated Binary Data","229019768":"Spatial multimodal mean background model for real-time MTI","45890147":"The Bivariate Normal Copula","258569421":"Accounting for Proof Test Data in a Reliability-Based Design Optimization Framework","224312441":"The probability of near midair collisions using level-crossings","247740522":"Beyond the Gold and Pray equation: Introducing interrelationships in industry-level unit demand equations for business games","2463953":"Numerical Computation Of Multivariate Normal Probabilities","224396820":"State Estimation for Stochastic Linear Hybrid Systems with Continuous-State-Dependent Transitions: An IMM Approach","46462973":"A Simple Approximation for Bivariate Normal Integral Based on Error Function and its Application on Probit Model with Binary Endogenous Regressor","281617968":"Generating Spatial Correlated Binary Data Through a Copulas Method","23630870":"A Simple Approximation to the Bivariate Normal Distribution with Large Correlation Coefficient","220990098":"The Packet Delay in a MPLS Network Using \"1+1 Protection\"","12936314":"Planning and analysis of repeated measures at key time-points in clinical trials sponsored by pharmaceutical companies","224381344":"Stochastic Linear Hybrid Systems: Modeling, Estimation, and Application in Air Traffic Control"},"index":464}