{"abs":"In real-world multi-objective problems, the evaluation of objective functions usually requires a large amount of computation time. Moreover, due to the curse of dimensionality, solving multiobjective problems often requires much longer computation time than solving single-objective problems. Therefore, it is essential to develop efficiency enhancement techniques for solving multi-objective problems. This paper investigates fitness inheritance as a way to speed up multiobjective genetic and evolutionary algorithms. Convergence and population-sizing models are derived and compared with experimental results in two cases: fitness inheritance without fitness sharing and fitness inheritance with fitness sharing. Results show that the number of function evaluations can be reduced with the use of fitness inheritance.","title":"Fitness Inheritance in Multi-Objective Optimization","id":2532946,"url":"https://www.researchgate.net/publication/2532946_Fitness_Inheritance_in_Multi-Objective_Optimization","names":["Shinn-Ying Ho","Jian-Hung Chen","David E. Goldberg","Kumara Sastry"],"references":{"220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","3693081":"Design of vector quantization codebooks using a genetic algorithm","220998589":"Fitness inheritance in genetic algorithms","220375137":"Predictive Models for the Breeder Genetic Algorithm I. Continuous Parameter Optimization"},"citedIn":{"2873775":"Efficiency Enhancement of Genetic Algorithms via Building-Block-Wise Fitness Estimation","221228457":"Noisy Multiobjective Optimization on a Budget of 250 Evaluations","267489015":"An Improved Kriging Assisted Multi-Objective Genetic Algorithm","220741295":"Fitness inheritance for noisy evolutionary multi-objective optimization","235720068":"The Markov Network Fitness Model","224330197":"Auto-Tuning Fuzzy Granulation for Evolutionary Optimization","226394469":"Speeding-Up Expensive Evaluations in High-Level Synthesis Using Solution Modeling and Fitness Inheritance","220742580":"Multi-objective memetic approach for flexible process sequencing problems","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","262162877":"Fitness inheritance-based evolutionary algorithm and its application in hybrid electric vehicle design","224301889":"Fitness inheritance in evolutionary and multi-objective high-level synthesis","239732074":"Scaling-Translation Parameter Estimation using Genetic Hough Transform for Background Compensation","280622619":"A Surrogate-Assisted Evolutionary Algorithm Based on the Genetic Diversity Objective","224092670":"A Novel Modified Particle Swarm Optimization for Forecasting Financial Time Series","222526437":"Adaptive Fuzzy Fitness Granulation for Evolutionary Optimization","4170900":"Fitness inheritance in multi-objective particle swarm optimization","227022372":"A Review of Techniques for Handling Expensive Functions in Evolutionary Multi-Objective Optimization","1957170":"Efficiency Enhancement of Probabilistic Model Building Genetic Algorithms","262841221":"An Adaptive Approach for Single Objective Optimization","232362088":"Successive approximate model based multi-objective optimization for an industrial straight grate iron ore induration process using evolutionary algorithm","220200364":"Evolutionary hidden information detection by granulation-based fitness approximation.","282698478":"Metaheuristic Design Pattern: Surrogate Fitness Functions","221019670":"Discovering Process Models with Genetic Algorithms Using Sampling","265813868":"Registrar: A complete-memory operator to enhance performance of genetic algorithms","26768806":"Localization for Solving Noisy Multi-Objective Optimization Problems","235770575":"Algorithm for Increasing the Speed of Evolutionary Optimization and its Accuracy in Multi-objective Problems","228744929":"Genetic algorithms and genetic programming for multiscale modeling: Applications in materials science and chemistry and advances in scalability","223835155":"Evolutionary hidden information detection by granulation-based fitness approximation","261308117":"A study on fitness inheritance for enhanced efficiency in real-coded genetic algorithms","228858082":"A Kriging Metamodel Assisted Multi-Objective Genetic Algorithm for Design Optimization","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","264702089":"Adaptive-Surrogate based on a Neuro-Fuzzy Network and Granular Computing","251845971":"Direct measurement of loading and loss rates in a magneto-optical trap with atom-number feedback","226186666":"Detecting Hidden Information from Watermarked Signal Using Granulation Based Fitness Approximation","221008760":"Using a Markov network as a surrogate fitness function in a genetic algorithm.","224197258":"Multiobjective cellular genetic algorithm with adaptive fuzzy fitness granulation","262361979":"Lecture Notes in Computer Science","221228406":"Multiobjective Optimization on a Budget of 250 Evaluations","235903469":"Evolutionary Approaches to Expensive Optimisation","262841416":"Comparative analysis of Direct Adaptive-NSGA-II \u0026 NSGA-II Optimization Algorithms","224309437":"Coevolution of Fitness Predictors","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","266339209":"A Fitness Inheritance Evolutionary Algorithm for Solving Bi-criteria Flexible Process Sequencing Problems","261045347":"Fitness Modeling With Markov Networks","4283439":"Adaptive Fuzzy Fitness Granulation in Structural Optimization Problems","263202399":"Toward improved calibration of watershed models: Multisite multiobjective measures of information","222683956":"Improving evolutionary exploration to area-time optimization of FPGA designs","4307891":"A novel general framework for evolutionary optimization: Adaptive fuzzy fitness granulation","220199533":"Fitness inheritance in multiple objective evolutionary algorithms: a test bench and real-world evaluation. Appl Soft Comput","235720063":"An application of a GA with Markov network surrogate to feature selection","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","221228371":"Is Fitness Inheritance Useful for Real-World Applications?","227210998":"On Similarity-Based Surrogate Models for Expensive Single- and Multi-objective Evolutionary Optimization"},"index":466}