{"abs":"Evolutionary algorithms often have to solve optimization problems in the presence of a wide range of uncertainties. Generally, uncertainties in evolutionary computation can be divided into the following four categories. First, the fitness function is noisy. Second, the design variables and/or the environmental parameters may change after optimization, and the quality of the obtained optimal solution should be robust against environmental changes or deviations from the optimal point. Third, the fitness function is approximated, which means that the fitness function suffers from approximation errors. Fourth, the optimum of the problem to be solved changes over time and, thus, the optimizer should be able to track the optimum continuously. In all these cases, additional measures must be taken so that evolutionary algorithms are still able to work satisfactorily. This paper attempts to provide a comprehensive overview of the related work within a unified framework, which has been scattered in a variety of research areas. Existing approaches to addressing different uncertainties are presented and discussed, and the relationship between the different categories of uncertainties are investigated. Finally, topics for future research are suggested.","title":"Evolutionary Optimization in Uncertain Environments—A Survey","id":3418839,"url":"https://www.researchgate.net/publication/3418839_Evolutionary_Optimization_in_Uncertain_Environments-A_Survey","names":["Yaochu Jin","Juergen Branke","IEEE Transactions on Evolutionary Computation"],"references":{"200035308":"Simulated Annealing for noisy cost functions","3418678":"Local Performance of the (1 + 1)-ES in a Noisy Environment","224049497":"Evolutionary Optimization of Computationally Expensive Problems via Surrogate Modeling","2774573":"“Nonstationary Function Optimization Using the Structured Genetic Algorithm.”","2782754":"Combining Approximation Concepts With Genetic Algorithm-Based Structural Optimization Procedures","3810355":"On evolution strategy optimization in dynamic environments","220701483":"“Adaptation to a Changing Environment by Means of the Feedback Thermodynamical Genetic Algorithm.”","216300264":"Thresholding---A selection operator for noisy ES","3810347":"Optimal sampling strategies for learning a fitness model","3810351":"A test problem generator for non-stationary environments","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","221009210":"Decreasing the Number of Evaluations in Evolutionary Algorithms by Using a Meta-model of the Fitness Function","220867389":"A Hierarchical Particle Swarm Optimizer for Dynamic Optimization Problems","272161313":"Evolving artificial neural networks. Proc IEEE","2379326":"Evolutionary Optimization for Computationally expensive problems using Gaussian Processes","4075044":"Comparing particle swarms for tracking extrema in dynamic environments","4014626":"Surrogate-assisted coevolutionary search","13098215":"Production Scheduling and Rescheduling With Genetic Algorithms","3693081":"Design of vector quantization codebooks using a genetic algorithm","3904026":"An efficient genetic algorithm with less fitness evaluation by clustering","226106204":"On Model-Based Evolutionary Computation","2498560":"Case-Based Initialization of Genetic Algorithms","285840167":"Chance-constrained genetic algorithms","3949587":"Analysis of the (1+1) EA for a dynamically changing ONEMAX-variant","4075022":"DAFHEA: a dynamic approximate fitness-based hybrid EA for optimisation problems","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","4075023":"A framework for optimization using approximate functions","220701973":"Creating Robust Solutions by Means of Evolutionary Algorithms.","3810313":"(1+1) genetic algorithm fitness dynamics in a changing environment","235080757":"Response Surface Methodology","3810317":"Memory Enhanced Evolutionary Algorithms for Changing Optimization Problems","235710004":"Averaging efficiently in the presence of noise","2922005":"Evolution Strategies assisted by Gaussian Processes with Improved Pre-Selection Criterion","220176678":"Structure optimization of neural networks for evolutionary design optimization","3949575":"Constrained robust optimal design using a multiobjectiveevolutionary algorithm","220701979":"Anticipation in Dynamic Optimization: The Scheduling Case","228782051":"Low-cost stochastic optimization for engineering applications","220702062":"Evolution Strategies on Noisy Functions: How to Improve Convergence Properties.","201976389":"Nonstationary Function Optimization Using Genetic Algorithms with Dominance and Diploidy","26502617":"Codebook Design for Vector Quantization Using Genetic Algorithm","2380905":"Optimization For Multilevel Problems: A Comparison Of Various Algorithms","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","2985597":"Yao, X. Evolving artificial neural networks. Proc. IEEE 87, 1423-1447","220619127":"Interactive Evolutionary Computation.","2427505":"Genetic Algorithms, Selection Schemes, and the Varying Effects of Noise","245281993":"Common Misconceptions about Neural Networks as Approximators","4089961":"A decision making framework for game playing using evolutionary optimization and learning","2764400":"Genetic Algorithms","10624249":"Stochastic Annealing","49654446":"Robust optical coating design with evolutionary strategies","245435132":"Response Surface and Neural Network Techniques for Rocket Engine Injector Optimization","200621973":"Artificial Intelligence through Simulated Evolution, Wiley, New York","2239554":"Evolutionary Search for Minimal Elements in Partially Ordered Finite Sets","251303067":"Efficiency and Mutation Strength Adaptation of the ( μ/μ I , λ )ES in a Noisy Environment","2523719":"Searching in the Presence of Noise","3623507":"Evolutionary algorithms with a coarse-to-fine function smoothing","2627148":"Evolutionary Search of Approximated N-Dimensional Landscapes","2355270":"Evolution of Corridor Following Behavior in a Noisy World","2266181":"Molecular Modeling Of Proteins And Mathematical Prediction Of Protein Structure","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","2752581":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","4089932":"A particle swarm model for tracking multiple peaks in a dynamic environment using speciation","2532946":"Fitness Inheritance in Multi-Objective Optimization","220740446":"Theoretical Analysis of Simple Evolution Strategies in Quickly Changing Environments","3810368":"Combining landscape approximation and local search in global optimization","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","222071105":"An intelligent approach for optimal control of fruit-storage process using neural networks and genetic algorithms","225793008":"On evolving robust strategies for iterated prisoner\u0027s dilemma","3418802":"Dynamic Multiobjective Optimization Problems: Test Cases, Approximations, and Applications","5595869":"Liu, Y.: A New Evolutionary System for Evolving Artificial Neural Networks. IEEE Transactions on Neural Networks 8, 694-713","221497785":"On Genetic Algorithms.","220403631":"Tabu Search When Noise is Present: An Illustration in the Context of Cause and Effect Analysis","238681257":"An Investigation into the Use of Hypermutation as an Adaptive Operator in Genetic Algorithms Having Continuous, Time-Dependent Nonstationary Environments","220998589":"Fitness inheritance in genetic algorithms","220743097":"Enhancing the GA\u0027s Ability to Cope with Dynamic Environments.","220381108":"Local Function Approximation in Evolutionary Algorithms for the Optimization of Costly Functions","4090025":"Constructing dynamic test environments for genetic algorithms based on problem difficulty","4090022":"Applying evolutionary algorithms to problems with noisy, time-consuming fitness functions","227319575":"Comparative Studies of Metamodeling Techniques Under Multiple Modeling Criteria","2460857":"Evolutionary Algorithms with a Coarse-to-Fine Function Smoothing","245315073":"Robustness Measures and Robust Scheduling for Job Shops","3418795":"Learning to Play Games Using a PSO-Based Competitive Learning Approach","2342018":"GenJam: A Genetic Algorithm for Generating Jazz Solos","3978399":"Tracking changing extrema with adaptive particle swarm optimizer","247661673":"Structure optimization of neural networks for aero-dynamic optimization","3418783":"The Fully Imformed Particle Swarm: Simpler, Mabe Better","2799236":"Efficient Implementation of Gaussian Processes","5587707":"Genetic Evolution of Radial Basis Function Coverage Using Orthogonal Niches","220702109":"A Hierarchical Genetic Algorithm Using Multiple Models for Optimization","257129875":"Model Selection and Multimodel Inference: A Practical Information—Theoretic Approach, Second Edition, Kenneth P. Brunham, David R. Anderson, Springer-Verlag, Heidelberg, 2002, 490 pages, hardbound, 31 illustrations","2368740":"Dynamic Pareto Optimum GA against the changing environments","201976520":"A Critical Review of Classifier Systems","216300069":"Evolution Strategies in Noisy Environments — A Survey of Existing Work","216301600":"Multinational GAs: Multimodal optimization techniques in dynamic environments","4090102":"Evolution strategies with controlled model assistance","220701677":"Accelerating the Convergence of Evolutionary Algorithms by Fitness Landscape Approximation.","216300590":"Metamodel—Assisted Evolution Strategies","220740579":"Dynamic Search With Charged Swarms.","2710759":"Lecture Notes in Computer Science","220743160":"Model-Assisted Steady-State Evolution Strategies","246900838":"Mutiobjective Optimization Using Approximation Model-Based Genetic Algorithms","220885500":"Adaptive Combustion Balancing in Multiple Burner Boiler Using a Genetic Algorithm with Variable Range of Local Search.","240342705":"The use of a co-operative multi-level CHC GA for structural shape optimization","246309442":"Genetic search with approximate fitness evalua-tions","221228511":"Pareto-Front Exploration with Uncertain Objectives","2491095":"Efficient Discretization Scheduling in Multiple Dimensions","239400118":"Turbomachinery Blade Design Using a Navier–Stokes Solver and Artificial Neural Network","220702173":"Optimization of Noisy Fitness Functions by Means of Genetic Algorithms Using History of Search","3865286":"Dynamic rotation and partial visibility","220743124":"Evolving En-Route Caching Strategies for the Internet","2564314":"Accelerating Evolutionary Algorithms Using Fitness Function Models","2817237":"Strength or Accuracy? - A comparison of two approaches to fitness calculation in learning classifier systems.","235169540":"Hajela, P.: Parallel Genetic Algorithm Implementation in Multidisciplinary Rotor Blade Design. Journal of Aircraft 33(5), 962-969","226129532":"Actuator placement based on reachable set optimization for expected disturbance","220741167":"Actuator Noise in Recombinant Evolution Strategies on General Quadratic Fitness Models","245984672":"Dynamic sequencing of a multi-processor system: a genetic algorithm approach","4074804":"Comparing neural networks and Kriging for fitness approximation in evolutionary optimization","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","220740645":"Fitness Approximation In Evolutionary Computation - a Survey.","221024291":"Application of Evolutionary Algorithms to Protein Folding Prediction.","2748217":"Managing Approximation Models in Optimization","224668789":"Evolution strategies applied to perturbed objective functions","235900190":"Replacement strategies in steady state genetic algorithms: dynamic environments","38363487":"The Design and Analysis of Computer Experiments","28352167":"On the Effects of Outliers on Evolutionary Optimization","4074790":"Reducing execution time on genetic algorithm in real-world applications using fitness prediction: Parameter optimization of SRM control","221228598":"Evolutionary Multi-objective Ranking with Uncertainty and Noise","2986295":"Emotional Image and Musical Information Retrieval With Interactive Genetic Algorithm","28352173":"Analysis of the (1+1) EA for a Dynamically Bitwise Changing OneMax","3928856":"Online optimization of an engine controller by means of a genetic algorithm using history of search","220740621":"On Evolutionary Optimization with Approximate Fitness Functions.","220867074":"On Evolving Robust Strategies for Iterated Prisoner\u0027s Dilemma.","221228549":"Trade-Off between Performance and Robustness: An Evolutionary Multiobjective Approach","222499945":"Structural optimization using evolution strategies and neural networks","3421470":"Multiobjective evolutionary algorithm for the optimization of noisy combustion processes","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","28352157":"Noisy Optimization with Evolution Strategies","233893599":"Optimization of Large-Scale 3-D Trusses Using Evolution Strategies and Neural Network","220885509":"Adaptation to Changing Environments by Means of the Memory Based Thermodynamical Genetic Algorithm","220742169":"Selection in the Presence of Noise","268464435":"Combining approximation concepts with genetic algorithm-based structural optimization procedures","2371345":"Co-Evolutionary Learning on Noisy Tasks","2547475":"Threshold Selection, Hypothesis Tests, and DOE Methods","220343829":"Genetic Algorithms in Noisy Environments","45622657":"Statistical Learning Theory","2489625":"Don\u0027t Evaluate, Inherit","225124437":"Supporting polyploidy in genetic algorithms using dominance vectors. In et al. [48], 223-234","220702311":"A Robust Solution Searching Scheme in Genetic Search.","220741224":"Comparison Of Methods For Using Reduced Models To Speed Up Design Optimization.","200026282":"Swarm Intelligence","220701807":"Sequential Sampling in Noisy Environments","2671456":"Evolution Strategies on Noisy Functions How to Improve Convergence Properties","220867683":"Constructing Dynamic Optimization Test Problems Using the Multi-objective Optimization Concept","3903856":"Managing approximate models in evolutionary aerodynamic design optimization","235917123":"Swarm Intelligence","220375150":"Toward a Theory of Evolution Strategies: Some Asymptotical Results from the (1, + λ)-Theory","226580172":"Natural Computing Series","228591342":"A neural network based generalized response surface multiobjective evolutionary algorithm","3810165":"Genetic crossover strategy using an approximation concept","2807160":"GP-Music: An Interactive Genetic Programming System for Music Generation with Automated Fitness Raters","222933523":"A fast evaluation strategy for evolutionary algorithms","2317176":"Comparative Studies Of Metamodeling Techniques Under Multiple Modeling Criteria","234797221":"Radial Basis Functions for Multivariable Interpolation","220741237":"Adaptive Sampling for Noisy Problems","220740214":"An Immune System Approach to Scheduling in Changing Environments.","2675063":"A Comparison Of Approximation Modeling Techniques: Polynomial Versus Interpolating Models","6687491":"Introducing Robustness in Multi-Objective Optimization","30833331":"The job shop tardiness problem: a decomposition approach. Eur J Oper Res","226006558":"Dynamic Multiobjective Optimization Problems: Test Cases, Approximation, and Applications","2593601":"Scheduling Of Genetic Algorithms In A Noisy Environment","220743247":"Multi-objective Optimisation Of Rolling Rod Product Design Using Meta-modelling Approach.","3903836":"A Partial Order Approach to Noisy Fitness Functions","221271130":"Noisy Fitness Evaluation in Genetic Algorithms and the Dynamics of Learning.","3949392":"Adaptive Particle Swarm Optimization: Detection And Response to Dynamic Systems","220801114":"A Comparison of Self-Adaptation Methods for Finite State Machines in Dynamic Environments.","2931039":"An Ant Colony Optimization Approach to Dynamic TSP","240129829":"Multinational ga optimization techniques in dynamic environments","220885672":"A Genetic Algorithm Approach to Dynamic Job Shop Scheduling Problem.","31733862":"Advanced Fuzzy Systems Design and Applications / Y. Jin.","220867759":"Particle Swarm Optimization in Dynamic Environments","228453399":"Evaluation of Injection Island GA Performance on Flywheel Design Optimisation","13267265":"Forming Neural Networks Through Efficient and Adaptive Coevolution","227166727":"Application of evolutionary algorithms to protein folding prediction","240821719":"Quality Measures for Approximate Models in Evolutionary Computation","229052982":"A Multi-population Approach to Dynamic Optimization Problems","228767803":"A minimal cost hybrid strategy for pareto optimal front approximation","3421614":"Multiobjective GA Optimization Using Reduced Models","3418543":"Robust design of multilayer optical coatings by means of evolutionary algorithms","2416569":"Noise, Sampling, and Efficient Genetic Algorithms","220694713":"Statistical Learning Theory","3341202":"Process Optimization Using a Fuzzy Logic Response Surface Method","2250624":"Genetic Algorithms for Changing Environments","221492374":"Applying Population Based ACO to Dynamic Optimization Problems","2440579":"A Partial Order Approach to Noisy Fitness Functions","221431450":"On the Automatic Design of Robust Electronics Through Artificial Evolution.","221049476":"Techniques to Aid Global Search in Engineering Design.","3418520":"Genetic algorithms with a robust solution searching scheme","216300371":"Efficient Fitness Estimation in Noisy Environments","2559903":"Applying Population Based ACO to Dynamic Optimization Problems","2613660":"Dynamic Control of Genetic Algorithms in a Noisy Environment","2454937":"Comparison Of Design Methodologies In The Preliminary Design Of A Passenger Aircraft","13982993":"Adaptive Walks with Noisy Fitness Measurements","220701935":"Performance Measures for Dynamic Environments","216301358":"Evolutionary Search for Minimal Elements in Partially Ordered Finite Sets","3810295":"Co-evolutionary learning on noisy tasks","4074990":"Non-stationary problem optimization using the primal-dual genetic algorithm","2534900":"Genetic Algorithms, Efficiency Enhancement, and Deciding Well with Differing Fitness Bias Values","3693034":"On the use of niching for dynamic landscapes","34512856":"Morrison, R.: Designing evolutionary algorithms for dynamic environments. Springer","226846290":"Optimal sizing, geometrical and topological design using a genetic algorithm","220535036":"An Interactive Evolutionary Metaheuristic for Multiobjective Combinatorial Optimization","225208503":"Averaging efficiently in the presence of noise","221318890":"A Converging ACO Algorithm for Stochastic Combinatorial Optimization","236822466":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","264923669":"Genetic Algorithms, Noise, and the Sizing of Populations","233556491":"Acceleration of the convergence speed of evolutionary algorithms using multi-layer neural networks","253982412":"Adaption to a Changing Environment by Means of the Thermodynamical Genetic Algorithm","2320341":"Robustness Optimization for Constrained, Nonlinear Programming Problems","220176614":"Faster convergence by means of fitness estimation","222670527":"Evolutionary algorithms in noisy environments: theoretical issues and guidelines for practice","2529243":"Efficient Discretization Scheduling in Multiple Dimensions"},"citedIn":{"220106012":"Efficient multi-swarm PSO algorithms for dynamic environments","224330075":"Acceleration of Parametric Multi-objective Optimization by an Initialization Technique for Multi-objective Evolutionary Algorithms","260304775":"Global optimization","220558624":"An evolutionary algorithm for dynamic multi-objective optimization","281605326":"Biogeography-based optimization of a variable camshaft timing system","256720704":"A memetic particle swarm optimization algorithm for multimodal optimization problems","225645923":"The Rationale Behind Seeking Inspiration from Nature","226676112":"On Some Properties of the B-Cell Algorithm in Non-Stationary Environments","220578097":"Evolutionary Fuzzy ARTMAP Neural Networks and their Applications to Fault Detection and Diagnosis","251823895":"Robust Optimal Design Under Standard Crowding Differential Evolution Framework","220105992":"Neri, F.: A memetic Differential Evolution approach in noisy optimization. Memetic Computing 2, 111-135","262495155":"Evolutionary Dynamic Optimization: A Survey of the State of the art","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","257518414":"Performance evaluation of evolutionary heuristics in dynamic environments. Appl Intell","221008182":"An adaptive approach for solving dynamic scheduling with time-varying number of tasks - Part I.","261860225":"A Non-parametric Statistical Dominance Operator for Noisy Multiobjective Optimization","224094528":"A Confidence-Based Dominance Operator in Evolutionary Algorithms for Noisy Multiobjective Optimization Problems","224330050":"An Anytime Algorithm based on Modified GA for Dynamic Weapon-Target Allocation Problem","280534182":"Evolutionary Computation for Dynamic Optimization Problems","227319187":"ESCA: A New Evolutionary-Swarm Cooperative Algorithm","261743545":"A Multi-Population Electromagnetic Algorithm for Dynamic Optimisation Problems","220741897":"Improving prediction in evolutionary algorithms for dynamic environments","232406520":"Comparison of evolutionary computation techniques for noise injected neural network training to estimate longitudinal dispersion coefficients in rivers","220866830":"Robustness Analysis in Evolutionary Multi-Objective Optimization Applied to VAR Planning in Electrical Distribution Networks","226736550":"Convergence Analysis of Metaheuristics","281225450":"Hindrances for robust multi-objective test problems","224326005":"Multi-Agent based Evolutionary Algorithm for Dynamic Knapsack Problem","254320387":"Cultural-based particle swarm for dynamic optimisation problems","224472397":"Performance of infeasibility driven evolutionary algorithm (IDEA) on constrained dynamic single objective optimization problems","224472396":"Pareto-dominance in noisy environments","234805715":"MEBRA: Multiobjective Evolutionary-Based Risk Assessment","261854132":"A Hybrid Harmony Search Algorithm for Solving Dynamic Optimisation Problems","224816470":"Online learning in estimation of distribution algorithms for dynamic environments","6532179":"Diffusion tensor imaging: techniques and clinical applications.","6532182":"Functional brain imaging with BOSS FMRI","251945778":"Multi-Objective Robust Optimization Based on NSGA-II and Degree of Robustness","224049507":"Robust design using Bayesian Monte Carlo","250005215":"Thinning-out: A Method to Reduce Trials in Skill Discovery of a Robot","259158856":"Drinking water distribution systems contamination management to reduce public health impacts and system service interruptions","6532185":"Efficiency of transfection and localization of superparamagnetic iron oxide particles in neural progenitor cells using two methods.","29625848":"On Multiplicative Noise Models for Stochastic Search","232979934":"Differential evolution and differential ant-stigmergy on dynamic optimisation problems","256276346":"An overview of population-based algorithms for multi-objective optimisation","26768806":"Localization for Solving Noisy Multi-Objective Optimization Problems","271471632":"Multi-population methods in unconstrained continuous dynamic environments: The challenges","225726773":"Adaptive Business Intelligence: Three Case Studies","285404480":"Robust Multiobjective Identification of Nonlinear Objects Based on Evolving Radial Basis Networks","228751841":"Robustness and Uncertainty in Multiobjective Search","220866921":"The Dynamic Knapsack Problem Revisited: A New Benchmark Problem for Dynamic Combinatorial Optimisation","276099121":"Confidence measure: A novel metric for robust meta-heuristic optimisation algorithms","232636827":"An Agent-based Evolutionary Search for Dynamic Travelling Salesman Problem","220314985":"Immune-based algorithms for dynamic optimization","242406968":"ANT COLONY OPTIMIZATION AND LOCAL SEARCH FOR THE PROBABILISTIC TRAVELING SALESMAN PROBLEM: A CASE STUDY IN STOCHASTIC COMBINATORIAL OPTIMIZATION","286111046":"Dynamic Fitness Landscape Analysis","259884849":"GABF: Genetic algorithm with base fitness for obtaining generality from partial results: Study in autonomous intersection by fuzzy logic","227205572":"Stochastic Search in Metaheuristics","267304894":"Routage Épidémique Évolutionnaire","258341685":"Embedded Systems Synthesis Using Simulated Evolution (SimE) with ECU-Specific Optimization","221007230":"Generalized immigration schemes for dynamic evolutionary multiobjective optimization","238982760":"Nature-Inspired Techniques in the Context of Fraud Detection","280221924":"A novel optimization hardness indicator based on the relationship between optimization hardness and frequency features of real-parameter problems","221161844":"New method for solving a class of dynamic nonlinear constrained optimization problems","220743028":"Noise pressure: Systematic overestimation of population fitness in genetic algorithms with noisy fitness functions","279057607":"Meta-Heuristic Algorithms in Car Engine Design: A Literature Survey","216457344":"Using the uncertainty handling CMA-ES for finding robust optima","221912412":"Evaluating the \\alpha-Dominance Operator in Multiobjective Optimization for the Probabilistic Traveling Salesman Problem with Profits","249991808":"A Survey of Diversity-Oriented Optimization","41804308":"Reliability-Based Optimization Using Evolutionary Algorithms","224168247":"Non-dominated sorting genetic algorithm-II for robust multi-objective optimal reactive power dispatch","224105783":"Change detection in dynamic fitness landscapes: An immunological approach","260799463":"Cluster-based differential evolution with Crowding Archive for niching in dynamic environments","227701247":"Robust design using Bayesian Monte Carlo. Int J Numer Meth Eng","277818592":"Update-based evolution control: A new fitness approximation method for evolutionary algorithms","224472336":"Transition and Convergence Properties of Genetic Algorithms Applied to Fitness Functions Perturbed Concurrently by Additive and Multiplicative Noise","220072301":"On the Optimal Robot Routing Problem in Wireless Sensor Networks","225352984":"An Evolutionary Approach For Robust Layout Synthesis of MEMS","259104518":"Advances in Computation and Intelligence","271275100":"Novel frameworks for creating robust multi-objective benchmark problems","228921821":"Addressing Change within a Generation","260684785":"Dynamic Multiobjective Optimization Algorithm Based on Average Distance Linear Prediction Model","260484092":"A Hyper-Heuristic Based Framework for Dynamic Optimization Problems","224472346":"Avoidance of constraint violation for experiment-based evolutionary multi-objective optimization","222411068":"Li, B.: Multi-strategy ensemble particle swarm optimization for dynamic optimization. Information Sciences 178, 3096-3109","46888629":"Metaheuristics for multiobjective optimisation: Cooperative approaches, uncertainty handling and application in logistics","210341896":"On Selecting the Best Individual in Noisy Environments","226477565":"Robust Salting Route Optimization Using Evolutionary Algorithms","276943875":"Utilizing time-linkage property in DOPs: An information sharing based Artificial Bee Colony algorithm for tracking multiple optima in uncertain environments","4201667":"Multiobjective optimization for dynamic environments","220658085":"Heuristic particle filter: applying abstraction techniques to the design of visual tracking algorithms. Exp Syst","266142553":"Online and interactive self-adaptive learning of user profile using incremental evolutionary algorithms","269295752":"Improved Particle Swarm Optimization algorithm in dynamic environment","224642533":"Guest Editorial Special Issue on Evolutionary Computation in the Presence of Uncertainty","220289447":"Using Competitive Population Evaluation in a differential evolution algorithm for dynamic environments","261306139":"Optimal formation of robots by convex hull and particle swarm optimization","225501690":"One-stage R\u0026D portfolio optimization with an application to solid oxide fuel cells","262691620":"mNAFSA: A novel approach for optimization in dynamic Environments with global Changes","226078196":"Hierarchical Evolutionary Algorithms and Noise Compensation via Adaptation","261303070":"A robust-oriented Particle Swarm Optimization algorithm for inverse problems","271746239":"Distributed Particle Swarm Optimization for limited-time adaptation with real robots","227110168":"Bayesian Optimization Algorithms for Dynamic Problems","261447431":"Self-adaptive competitive differential evolution for dynamic environments","224129486":"Particle Swarm Optimization With Composite Particles in Dynamic Environments","241770239":"A Variability-Aware Robust Design Space Exploration Methodology for On-Chip Multiprocessors Subject to Application-Specific Constraints","224089539":"Interaction of Culture-Based Learning and Cooperative Co-Evolution and its Application to Automatic Behavior-Based System Design","276431074":"Global memory schemes for dynamic optimization","220072327":"The Impact of Diversity on Online Ensemble Learning in the Presence of Concept Drift","225141238":"Local models—an approach to distributed multi-objective optimization","221339055":"Robust design of embedded systems","262323970":"ACO beats EA on a dynamic pseudo-boolean function","4358368":"Efficient MOEAs with an Adaptive Sampling Technique in Searching Robust Optimal Solutions","281927780":"Uncertainty Management Using Sequential Parameter Optimization","257778678":"Genetic algorithms based optimization of artificial neural network architecture for buildings’ indoor discomfort and energy consumption prediction","220743045":"Maximizing population diversity in single-objective optimization","254039947":"Fast scenario-based design space exploration using feature selection","267377503":"Adapting Evolutionary Approaches for Optimization in Dynamic Environments","220132782":"A Particle Swarm Optimization Based Memetic Algorithm for Dynamic Optimization Problems","271926405":"A new joint spectral radius analysis of random PSO algorithm","220362131":"Immigrant schemes for evolutionary algorithms in dynamic environments: Adapting the replacement rate","257636329":"A novel multi-swarm algorithm for optimization in dynamic environments based on particle swarm optimization","221006239":"A robust optimization approach using Kriging metamodels for robustness approximation in the CMA-ES","260622139":"A General Framework of Multipopulation Methods With Clustering in Undetectable Dynamic Environments","49589824":"Regime identification of slurry transport in pipelines - a novel modeling approach using ANN and differential evolution","262215445":"Evolutionary membrane algorithms in dynamic environments","259279810":"A hybrid multi-population framework for dynamic environments combining online and offline learning","262280989":"Evolutionary computation for dynamic optimization problems","29621628":"Combinatorial Optimization of Stochastic Multi-objective Problems: An Application to the Flow-Shop Scheduling Problem","29637893":"Evaluation and Optimization of the Robustness of DAG Schedules in Heterogeneous Environments","220743146":"Experimental analysis of binary differential evolution in dynamic environments","232629529":"Multi-objective Immune Optimization in Dynamic Environments and Its Application to Signal Simulation","220462567":"A unified framework for population-based metaheuristics","261460817":"Resampling in Particle Swarm Optimization","261337941":"A memetic algorithm with one-step local search to guide diversity increase in Dynamic Multiobjective problems","220223975":"Log-Linear Convergence and Divergence of the Scale-Invariant (1+1)-ES in Noisy Environments","252033986":"On the effect of environment-triggered population diversity compensation methods for memory enhanced UMDA","276165820":"A Partheno-Genetic Algorithm for Dynamic 0-1 Multidimensional Knapsack Problem","232633623":"Learning in Abstract Memory Schemes for Dynamic Optimization","220176852":"A memetic ant colony optimization algorithm for the dynamic travelling salesman problem","253359061":"Shift-Based Density Estimation for Pareto-Based Algorithms in Many-Objective Optimization","261238623":"Leveraging multiple simulators for crossing the reality gap","275068072":"Markov Chain Analysis of Agent-based Evolutionary Computing in Dynamic Optimization","221008383":"An adaptive, prudent-daring evolutionary algorithm for noise handling in on-line PMSM drive design","265552647":"Software Refactoring Under Uncertainty: A Robust Multi-Objective Approach","221228539":"Prediction-Based Population Re-initialization for Evolutionary Dynamic Multi-objective Optimization.","233143601":"A memetic particle swarm optimisation algorithm for dynamic multi-modal optimisation problems","220867071":"Tracking Multiple Targets with Adaptive Swarm Optimization","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","262361979":"Lecture Notes in Computer Science","274982075":"Biogeography-based optimization in noisy environments","230825241":"A chemical evolutionary mechanism for instantiating service-based applications","223178129":"Particle swarm optimization for function optimization in noisy environment","216300600":"An evaporation mechanism for dynamic and noisy multimodal optimization","251931608":"RETRACTED ARTICLE: Searching for robust optimal solutions by an evolutionary algorithm","261311311":"Ant colony optimization with memory-based immigrants for the dynamic vehicle routing problem","220743157":"A new collaborative evolutionary-swarm optimization technique","235696849":"On the performance of a hybrid genetic algorithm in dynamic environments","259804065":"An Adaptive Multi-Swarm Optimizer for Dynamic Optimization Problems","220176833":"Environment identification-based memory scheme for estimation of distribution algorithms in dynamic environments","224658820":"Analysis of rotationally symmetric broad-band monopoles over\ncircular ground plane","261192560":"Hyper rectangle search based particle swarm algorithm for dynamic constrained multi-objective optimization problems","220867017":"Integrating Techniques from Statistical Ranking into Evolutionary Algorithms","220307906":"A Dynamic Multi-Objective Optimization Framework for Selecting Distributed Deployments in a Heterogeneous Environment","220497345":"Surrogate-assisted clonal selection algorithms for expensive optimization problems","261131128":"Ensemble Differential Evolution with dynamic subpopulations and adaptive clearing for solving dynamic optimization problems","271469766":"Multi-Colony Ant Algorithms for the Dynamic Travelling Salesman Problem","220742081":"Why noise may be good: Additive noise on the sharp ridge","278302847":"Identifying the Robust Number of Intelligent Autonomous Vehicles in Container Terminals","224374196":"An adaptive grid method and its application to CFD learning and prediction","220867009":"Adaptive Land-Use Management in Dynamic Ecological System","224579977":"Approximating the Set of Pareto-Optimal Solutions in Both the Decision and Objective Spaces by an Estimation of Distribution Algorithm","262318921":"An Immigrants Scheme Based on Environmental Information for Ant Colony Optimization for the Dynamic Travelling Salesman Problem","257779632":"A framework for finding robust optimal solutions over time","260501364":"Fitness Prediction Techniques for Scenario-Based Design Space Exploration","261369702":"Pareto Front Estimation for Decision Making","220512727":"Global Optimization for Possibly Time-Dependent Cost Functions by a Population Set-Based Algorithm with Births Control","261054332":"Genetic algorithms with adaptive immigrants for dynamic environments","224330155":"Hyper-Selection in Dynamic Environments","238681804":"CS321 HS 2007 Autonomic Computer Systems Self-Optimizing Systems I","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","225910145":"Single/Multi-objective Inverse Robust Evolutionary Design Methodology in the Presence of Uncertainty","220217814":"An improved species based genetic algorithm and its application in multiple template matching for embroidered pattern inspection","258108308":"Comparison of Frameworks for Parallel Multiobjective Evolutionary Optimization in Dynamic Problems","221007323":"Noise-induced features in robust multi-objective optimization problems","223493541":"A survey of evolutionary and embryogenic approaches to autonomic networking","220142055":"Recent trends in metaheuristics for stochastic combinatorial optimization","251945981":"Dynamic Floating Function: A Novel Test Problem Generator for Non-Stationary Environments","225663369":"A multiobjective metaheuristic for a mean-risk static stochastic knapsack problem","221006294":"Hyper-Learning for Population-Based Incremental Learning in Dynamic Environments","268470525":"Comparison of Robust Optimization Methods Applied to Hypersonic Vehicle Design","220867028":"Prudent-Daring vs Tolerant Survivor Selection Schemes in Control Design of Electric Drives","3113168":"An Efficient Tabu Search Algorithm for Robust Solutions of Electromagnetic Design Problems","224198749":"Scenario-Based Design Space Exploration of MPSoCs","270960934":"A Multiobjective Evolutionary Algorithm Using Gaussian Process-Based Inverse Modeling","220265507":"Attributes of Dynamic Combinatorial Optimisation","220805164":"Handling Uncertainties in Evolutionary Multi-Objective Optimization","228541594":"Adaptation in Dynamic Environments: A Case Study in Mission Planning","269724950":"Novel performance metrics for robust multi-objective optimization algorithms","261297818":"Evolutionary algorithms and reinforcement learning in experiments with slot cars","221007909":"Evolutionary Programming with Ensemble of Explicit Memories for Dynamic Optimization","224392277":"Dynamic Evolutionary Algorithm With Variable Relocation","288024609":"Choosing diverse sets of plausible scenarios in multidimensional exploratory futures techniques","4310352":"On the control of axonal outgrowing for the development of new sieve interfaces","224899190":"Selectionist and Evolutionary Approaches to Brain Function: A Critical Appraisal","261054103":"Cutting evaluation costs: An investigation into early termination in genetic programming","220286008":"Self-adaptation of evolution strategies under noisy fitness evaluations. Genet Programming Evolvable Mach","4279642":"A Novel Opposition-Based Particle Swarm Optimization for Noisy Problems","224345155":"Improved Differential Evolution Based on Stochastic Ranking for Robust Layout Synthesis of MEMS Components","220867637":"Lecture Notes in Computer Science","220739594":"A greedy hyper-heuristic in dynamic environments","228945030":"Continuous Dynamic Constrained Optimisation-The Challenges","251978273":"Improving Particle Swarm Optimization Algorithm with Mutation Strategy","220740608":"Adaptive evolutionary algorithm based on population dynamics for dynamic environments","257635954":"A dynamic model selection strategy for support vector machine classifiers","257161849":"Multiple parents crossover operators: A new approach removes the overlapping solutions for sequencing problems","220867590":"Noise Analysis Compact Genetic Algorithm","255652369":"Using genetic algorithms to find a globally optimal solution in uncertain environments with multiple sources of additive and multiplicative noise","259106398":"Design and Analysis of an Estimation of Distribution Approximation Algorithm for Single Machine Scheduling in Uncertain Environments","221494300":"Novel Associative Memory Retrieving Strategies for Evolutionary Algorithms in Dynamic Environments","261295804":"Bee colonies as model for multimodal continuous optimization: The OptBees algorithm","223648868":"An investigation on noise-induced features in robust evolutionary multi-objective optimization","220739601":"Heuristics for Sampling Repetitions in Noisy Landscapes with Fitness Caching ABSTRACT","261095092":"Dynamic Differential Evolution with Difference Mean Based Perturbation","257687066":"Holographic memory-based Bayesian optimization algorithm (HM-BOA) in dynamic environments","220618855":"Evolutionary Synthesis of Stochastic Gene Network Models Using Feature-based Search Spaces","260524741":"A comparative study: The effect of the perturbation vector type in the differential evolution algorithm on the accuracy of robot pose and heading estimation","262253284":"A Genetic Algorithm Assisted by a Locally Weighted Regression Surrogate Model","261308117":"A study on fitness inheritance for enhanced efficiency in real-coded genetic algorithms","220444772":"Properties of Quantum Particles in Multi-Swarms for Dynamic Optimization.","30498968":"Acoustic Sound Source Localisation and Tracking - in Indoor Environments","220514420":"Real-parameter evolutionary multimodal optimization: a survey of the state-of-the-art. Swarm Evol Comput 1:71-88","221582436":"The Parallel Single Front Genetic Algorithm (PSFGA) in Dynamic Multi-objective Optimization","241189682":"Spectral radius of the canonical particle swarm optimization","225107001":"Parameter Control in Practice","281857432":"A dynamic multi-objective evolutionary algorithm using a change severity-based adaptive population management strategy","221151355":"Improving Reinforcement Learning Agents Using Genetic Algorithms","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","221163637":"Dynamic TSP Optimization Base on Elastic Adjustment.","273495312":"Dynamic Multiobjective Evolutionary Algorithm With Two Stages Evolution Operation","4249887":"Computer Strategies for Solitaire Yahtzee","238051183":"A Simulation-based Decision Support System to Improve Healthcare Facilities Performance – Elaborated on an Irish Emergency Department","220286019":"The Evolution of Higher-level Biochemical Reaction Models","281897385":"A directed search strategy for evolutionary dynamic multiobjective optimization","226796771":"Evolutionary-based Meta-modelling: The Relevance of Using Approximate Models in Hydroinformatics","266475141":"An Improved Memetic Algorithm to Enhance the Sustainability and Reliability of Transport in Container Terminals","262356682":"Optimal Computing Budget Allocation in particle swarm optimization","267490970":"Effects of Uncertain Land Availability, Wind Shear, and Cost on Wind Farm Layout","262493896":"Dynamic Optimization Using Analytic and Evolutionary Approaches: A Comparative Review","221025346":"Real-World Applications of Multiobjective Optimization","224472078":"Investigation of Memory-based Multi-objective Optimization Evolutionary Algorithm in Dynamic Environment","260671225":"Postoptimality Pareto-Robustness Analysis of an Earth-Observation Satellite Mission","221006942":"Trainer selection strategies for coevolving rank predictors","284810635":"Biasing the transition of Bayesian optimization algorithm between Markov chain states in dynamic environments","225322010":"An Investigation of Selection Hyper-heuristics in Dynamic Environments","251815543":"Self-control nano second pulse generation for Yb fiber laser","260062967":"Artificial Evolution by Viability Rather Than Competition","224407576":"Adaptive Primal–Dual Genetic Algorithms in Dynamic Environments","261160681":"Characterizing environmental changes in Robust Optimization Over Time","221501512":"Differential Evolution for High Scale Dynamic Optimization","273329457":"Interval-based ranking in noisy evolutionary multi-objective optimization","259290634":"Selection Hyper-heuristics in Dynamic Environments","258387481":"A Hybrid Multiobjective Genetic Algorithm for Robust Resource-Constrained Project Scheduling with Stochastic Durations","282564008":"Optimal design of an electro-hydraulic valve for heavy-duty vehicle clutch actuator with certain constraints","284676471":"Convergence Analysis on Immune Optimization Solving CCP Problems","5465553":"Tracking Moving Optima Using Kalman-Based Predictions","225793267":"Acceleration of Experiment-Based Evolutionary Multi-objective Optimization Using Fitness Estimation","224246999":"An adaptive approach for solving dynamic scheduling with time-varying number of tasks — Part II","239387592":"Saltwater Intrusion Management of Coastal Aquifers. I: Linked Simulation-Optimization","226259177":"Genetic Algorithms with Self-Organizing Behaviour in Dynamic Environments","239798226":"Noise analysis compact differential evolution","280225064":"Swarm Intelligence in Big Data Analytics","29637720":"Métaheuristiques pour le flow-shop de permutation bi-objectif stochastique","257479364":"A genetic algorithm with neural network fitness function evaluation for IMRT beam angle optimization","239798229":"Centroid-based memetic algorithm – adaptive Lamarckian and Baldwinian learning","266325631":"Evolutionary Multi-objective Image Feature Extraction in the Presence of Noise","264522341":"Diversifying risk in portfolios using a variable-size genetic relation algorithm","261053998":"A novel particle swarm optimization algorithm with local search for dynamic constrained multi-objective optimization problems","280559899":"SOCO","241732554":"A data mining approach to evolutionary optimisation of noisy multi-objective problems","221006985":"Introducing user preference using Desirability Functions in Multi-Objective Evolutionary Optimisation of noisy processes","221494421":"Multi-swarm Particle Swarm Optimizer with Cauchy Mutation for Dynamic Optimization Problems","224247035":"On dynamic multi-objective optimization, classification and performance measures","267101763":"Active Robust Optimization: Enhancing Robustness to Uncertain Environments","286564540":"A Statistical Approach to Dealing with Noisy Fitness in Evolutionary Algorithms","4047249":"Calculation of structure of electric field and trajectory analysis of electron beam in the axial-symmetric electron-optical system","220386446":"EP-based robustness analysis of optimal load allocation for boiler systems","262572555":"CDEPSO: A bi-population hybrid approach for dynamic optimization problems","220061875":"An Improved Univariate Marginal Distribution Algorithm for Dynamic Optimization Problem","224329968":"An Immigrants Scheme Based on Environmental Information for Genetic Algorithms in Changing Environments","245309229":"Preference-based Pareto Optimization in Certain and Noisy Environments","221008030":"Investigating Collaboration Methods of Random Immigrant Scheme in Cooperative Coevolution","275720669":"Simulation Optimization: A Review and Exploration in the New Era of Cloud Computing and Big Data","282712426":"Memetic Framework Application—Analysis of Corporate Customer Attitude in Telecom Sector","221007002":"An Anytime Algorithm Applied to Dynamic Weapon-Target Allocation problem with Decreasing Weapons and Targets","258476766":"Noisy Immune Optimization for Chance-Constrained Programming Problems","221580430":"An Improved Quantum Genetic Algorithm","220867732":"Memory-Based Immigrants for Ant Colony Optimization in Changing Environments","216306980":"Particle Swarm Optimization and Sequential Sampling in Noisy Environments","221161710":"A Review on Cutting-Edge Techniques in Evolutionary Algorithms.","220116190":"A differential evolution for optimisation in noisy environment","262281826":"A Culture-Based Particle Swarm Optimization Framework for Dynamic, Constrained Multi-Objective Optimization","4375939":"A New Methodology for Searching Robust Pareto Optimal Solutions with MOEAs","261382741":"Center-point-based Simulated Annealing","263764601":"Global Robot Localization Under Noise Stress Utilizing EA Methods and Semisemantic Classification of a Known Environment","220866798":"An Adaptive Global-Local Memetic Algorithm to Discover Resources in P2P Networks.","271880689":"Memetic algorithms and memetic computing optimization: A literature review","4375940":"Hybrid differential evolution for noisy optimization","221524211":"Learning Belief Connections in a Model for Situation Awareness.","221719792":"Automation of Mobile Pick and Place Robotic System for Small Food\nIndustry","233210926":"An adaptive multi-modal optimization algorithm for simulation-based design of power-electronic circuits","285332682":"Decision Engineering","261854807":"Analysis of diversity mechanisms for optimisation in dynamic environments with low frequencies of change","272195063":"The Benefit of Sex in Noisy Evolutionary Search","234016828":"Parameters control in GAs for dynamic optimization","220740839":"Evolving viral marketing strategies","3455456":"Robust route optimisation for gritting/salting trucks: A CERCIA experience","288124152":"Theoretical Advances in Evolutionary Dynamic Optimization","225201338":"Evolutionary Optimization and Dynamic Fitness Landscapes","257382017":"Water quality trading with asymmetric information, uncertainty and transaction costs: A stochastic agent-based simulation","260621918":"A Memetic Algorithm for Matching Spatial Configurations With the Histograms of Forces","259515054":"Topology optimization of two-dimensional asymmetrical phononic crystals","223470731":"Preferences in multi-objective evolutionary optimisation of electric motor speed control with hardware in the loop","272636321":"Gain and Order Scheduling of Optimal Fractional Order PID Controllers for Random Delay and Packet Dropout in Networked Control Systems","224472195":"Uncertainty of Constraint Function in Evolutionary Multi-objective Optimization","234556441":"Gradient-Based Algorithms for the Automatic Construction of Fuzzy Cognitive Maps","224309437":"Coevolution of Fitness Predictors","220740811":"Theoretical analysis of genetic algorithms in noisy environments based on a Markov Model","220701892":"Evolutionary Algorithms for Dynamic Environments: Prediction Using Linear Regression and Markov Chains","224472194":"Detecting change in dynamic fitness landscapes","224177343":"A novel updating strategy for associative memory scheme in cyclic dynamic environments","224472197":"Interval Robust Multi-Objective Evolutionary Algorithm","220866767":"The Role of Representations in Dynamic Knapsack Problems","221506774":"A Faster Clonal Selection Algorithm for Expensive Optimization Problems","273186222":"An Estimation of Distribution Algorithm with Cheap and Expensive Local Search","221007045":"On the Behaviour of Evolutionary Strategies for Problems with Varying Noise Strength","220701902":"Ant Colony Optimization with Immigrants Schemes in Dynamic Environments","261991025":"Ant colony optimization with immigrants schemes for the dynamic travelling salesman problem with traffic factors","4252076":"A hybrid approach for the control of axonal outgrowth","258389643":"LGMS-FOA: An Improved Fruit Fly Optimization Algorithm for Solving Optimization Problems","236144611":"Parameter Tuning and Scientific Testing in Evolutionary Algorithms","224246956":"Evolution of stochastic bio-networks using summed rank strategies","220105964":"Multi-strategy ensemble evolutionary algorithm for dynamic multi-objective optimization","224190638":"On Optimizing a Demand Responsive Transport with an Evolutionary Multi-Objective Approach","226319502":"Tackling Dynamic Problems with Multiobjective Evolutionary Algorithms","224190639":"An Evolutionary Multi-objective Approach for Speed Tuning Optimization with Energy Saving in Railway Management","273960359":"A Comparative Study: L1-Norm Vs. L2-Norm; Point-to-Point Vs. Point-to-Line Metric; Evolutionary Computation Vs. Gradient Search","224246951":"Dynamic optimization using cultural based PSO","272118210":"Genetic Algorithms with Immigrants Scheme for Dynamic Optimization Problems","220901590":"A Dynamic Swarm for Visual Location Tracking","221787333":"Adapting Genetic Algorithms for Combinatorial Optimization Problems in Dynamic Environments","220105955":"Empirical analysis of evolutionary algorithms with immigrants schemes for dynamic optimization. Memetic Comput","227317875":"Deterministic Robust Optimal Design Based on Standard Crowding Genetic Algorithm","266656283":"Robustness of Populations in Stochastic Environments","237337637":"Research Topics on Evolution and Learning at Honda Research Institute Europe","260531591":"Rule pool updating through Sarsa-learning to improve adaptability in changing environments","288889656":"Entropy-based bare bones particle swarm for dynamic constrained optimization","282377943":"The empirical analysis of exploration-exploitation tradeoff for uncertain environment","257732952":"An immune system based differential evolution algorithm using near-neighbor effect in dynamic environments","224260949":"A Multi-Facet Survey on Memetic Computation","279348911":"Ant Colony Based Algorithms for Dynamic Optimization Problems","241164372":"Approaching the fuzzy road transport Traveling Salesman Problem by eugenic bacterial memetic algorithm","275552866":"A Software Tool for Assisting Experimentation in Dynamic Environments","4279886":"New Dynamic Multi-Objective Constrained Optimization Evolutionary Algorithm","216300276":"Sequential parameter optimisation of evolutionary algorithms for airfoil design","2546231":"Expected Sample Moments of Concomitants of Selected Order Statistics","278185606":"Response Surfaces with Discounted Information for Global Optima Tracking in Dynamic Environments","229964706":"Investigation of a changing range genetic algorithm in noisy environments","242396261":"Herausgeber","228707254":"Interval Robust Multi-objective Algorithm","251997465":"Real time implementation of a genetic algorithm based optimal PID controller to handle unreliable network conditions in NCS applications","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","224646013":"Handling Time-Varying TSP Instances","276414041":"Supporting multi-level and robust production planning and execution","224180095":"Automatic Adaptation to Generated Content Via Car Setup Optimization in TORCS","251317470":"Application of Evolutionary Algorithms for Solving Multi-Objective Simulation Optimization Problems","225722195":"A multiobjective metaheuristic for a mean-risk multistage capacity investment problem","224239477":"Adaptive CAC using NeuroEvolution to maximize throughput in mobile networks","221157127":"Optimal Design Centring Through a Hybrid Approach Based on Evolutionary Algorithms and Monte Carlo Simulation","220176182":"Integration of supervised ART-based neural networks with a hybrid genetic algorithm","259273053":"Differential evolution for discrete-time large dynamic games","226705320":"Immune response-based algorithm for optimization of dynamic environments","267238849":"University of Tuning \u0026 Simplifying Heuristical Optimization","220136242":"Industrial strength COMPASS: A comprehensive algorithm and software for optimization via simulation.","260583847":"Evolutionary Complex Engineering Optimization: Opportunities and Challenges [Guest Editorial]","220403475":"A provably convergent heuristic for stochastic bicriteria integer programming","262318480":"Effects of Speciation on Evolution of Neural Networks in Highly Dynamic Environments","4207219":"Decelerating systems based on resonance magnetic metamaterials","261991849":"Ant Colony Optimization with Immigrants Schemes for the Dynamic Vehicle Routing Problem","274263660":"Probabilistic Dominance in Multiobjective Reliability-Based Optimization: Theory and Implementation","259170631":"Population-based metaheuristics for continuous boundary-constrained dynamic multi-objective optimisation problems","261452192":"Evaluation scheduling in noisy environments","237007894":"Integrating Particle Swarm Optimization with Reinforcement Learning in Noisy Problems","220867357":"A Memory Enhanced Evolutionary Algorithm for Dynamic Scheduling Problems","220743443":"Two adaptive mutation operators for optima tracking in dynamic optimization problems with evolution strategies","220743444":"Handling uncertainty with a real-coded EA","3455604":"Machine intelligence, adaptive business intelligence, and natural intelligence [Research Frontier]","282398356":"Obstacles and difficulties for robust benchmark problems: A novel penalty-based robust optimisation method","221007726":"Fighting noise with noise: DE with individuals shaking to tackle noisy problems.","27245532":"A hybrid immigrants scheme for genetic algorithms in dynamic environments","254462313":"Hybrid Metaheuristic Particle Filters for Stochastic Volatility Estimation","27245527":"A self-organizing random immigrants genetic algorithm for dynamic optimization problems","270722666":"Comparing Solutions under Uncertainty in Multiobjective Optimization","220740451":"Particle swarm with speciation and adaptation in a dynamic environment","220381033":"Robustness Against the Decision-Maker\u0027s Attitude to Risk in Problems With Conflicting Objectives","45860086":"Strategic Positioning in Tactical Scenario Planning","259170620":"How can surrogates influence the convergence of evolutionary algorithms?","257588491":"Differential evolution for dynamic environments with unknown numbers of optima","228431823":"A Robust-Solution Based Methodology to MO Problems","232639370":"Use of Evolutionary Robots as an Auxiliary Tool for Developing Behavioral Models of Rats in an Elevated Plus-Maze","228518857":"Real-Time Planetary Landing Site Selection – A Non-Exhaustive Approach","262326776":"Influence of the migration period in parallel distributed GAs for dynamic optimization","261382607":"Particle Swarm Optimization Applied to the Dynamic Allocation Problem","257635584":"Adaptive swarm optimization for locating and tracking multiple targets","3455592":"Immune Algorithm with Adaptive Sampling in Noisy Environments and Its Application to Stochastic Optimization Problems","44261631":"Fuzzy Rule-based Boundary Extraction of Plaque in Intravascular Ultrasound Image","51485004":"Detection of Cancerous Masses in Mammograms by Template Matching: Optimization of Template Brightness Distribution by Means of Evolutionary Algorithm","226717661":"Robust Optimizers for Nonlinear Programming in Approximate Dynamic Programming","225552174":"A Hybrid Approach Based on Evolutionary Strategies and Interval Arithmetic to Perform Robust Designs","262253054":"An Empirical Comparison of CMA-ES in Dynamic Environments","272833052":"An Adaptive Local Search Algorithm for Real-Valued Dynamic Optimization","228912070":"Handling Uncertainty in Indicator-Based Multiobjective Optimization","262425024":"Challenges and opportunities in dynamic optimisation","227217390":"Evolutionary Design of Emergent Behavior","260621806":"Parallel Distributed Hybrid Fuzzy GBML Models With Rule Set Migration and Training Data Rotation","220701504":"Exploiting Overlap When Searching for Robust Optima","225236747":"Modeling of loss aversion in solving fuzzy road transport traveling salesman problem using eugenic bacterial memetic algorithm","254462285":"How Long Should We Run in Dynamic Optimization?","220867395":"Differential Evolution with Noise Analyzer","233645959":"Finite-Difference Time-Domain Modeling of Decay Rates in the Near Field of Metal Nanostructures","241006647":"M\u0027etaheuristiques pour le flow-shop de permutation bi-objectif stochastique","220626764":"Connectivity management in mobile ad hoc networks using particle swarm optimization","237150284":"Sampling strategies in ordinal regression for surrogate assisted evolutionary optimization","225885977":"Approaching Dynamic Multi-Objective Optimization Problems by Using Parallel Evolutionary Algorithms","49798279":"Multi-Objective Reliability-Based Optimization with Stochastic Metamodels","224645906":"Opposition-Based Differential Evolution for Optimization of Noisy Problems","261038589":"Multi-Uncertainty Problems (MUP) with applications to managing risk in resource-constrained project scheduling","263620034":"A Dynamic Simulation-Optimization Model for Adaptive Management of Urban Water Distribution System Contamination Threats","224645909":"Robustness Analysis in Multi-Objective Optimization Using a Degree of Robustness Concept","216300179":"Model Optimization with Evolutionary Algorithms","262319573":"Tracking property of UMDA in dynamic environment by landscape framework","268694132":"Density-based evolutionary framework for crowd model calibration","216300188":"Challenges for Contemporary Evolutionary Algorithms","260651504":"Multi-population and diffusion UMDA for dynamic multimodal problems","216300189":"Challenges for Contemparary Evolutionary Algorithms","3455560":"A PSO-based mobile robot for odor source localization in dynamic advection-diffusion with obstacles environment: Theory, simulation and measurement","221633353":"Evolving Parameterised Policies for Stochastic Constraint Programming","271659596":"Adaptive particle allocation in iterated sequential Monte Carlo via approximating meta-models","257313064":"On Optimizing a Bi-objective Flowshop Scheduling Problem in Uncertain Environment","225170411":"Robust Optimization by Means of Vegetative Reproduction","238595259":"A neuroevolutionary approach to stochastic inventory control in multi-echelon systems","216300130":"Experimental Research in Evolutionary Computation---The New Experimentalism","233731944":"An Efficient Evolutionary Approach to Parameter Identification in a Building Thermal Model","261991701":"A Benchmark Generator for Dynamic Permutation-Encoded Problems","261991700":"Dynamic Vehicle Routing: A Memetic Ant Colony Optimization Approach","220381096":"Max-Min Surrogate-Assisted Evolutionary Algorithm for Robust Design","221006759":"Flock-based Evolutionary Multi-Agent System in Solving Noisy Multi-Objective Optimization Problems","220176275":"Dynamic combinatorial optimisation problems: an analysis of the subset sum problem. Soft Comput","221645755":"Nonlinear programming in approximate dynamic programming - bang-bang solutions, stock-management and unsmooth penalties.","220403630":"Evolutionary multiobjective optimization in noisy problem environments","224094166":"Performance Analysis of MADO Dynamic Optimization Algorithm","266383730":"Cooperative Selection: Improving Tournament Selection via Altruism","224169929":"A Clustering Particle Swarm Optimizer for Locating and Tracking Multiple Optima in Dynamic Environments","228954931":"Robustness Analysis: An Information-Based Perspective","224472054":"Dynamic Optimization using Self-Adaptive Differential Evolution","238950567":"Fractional Order Fuzzy Control of Nuclear Reactor Power with Thermal-Hydraulic Effects in the Presence of Random Network Induced Delay and Sensor Noise having Long Range Dependence","242388201":"Combinatorial Fusion Analysis: Methods and Practices of Combining Multiple Scoring Systems","272169635":"Deception, blindness and disorientation in particle swarm optimization applied to noisy problems","220740535":"Investigating restricted tournament replacement in ECGA for non-stationary environments.","262396220":"Robust Neuroevolutionary Identification of Nonlinear Nonstationary Objects","220381056":"Locating and tracking multiple dynamic optima by a particle swarm model using speciation.","220742538":"Predicting solution rank to improve performance","262223109":"Stochastic Diffusion Search Review","263058692":"A new real-valued diploid genetic algorithm for optimization in dynamic environments","269362852":"Dynamic optimization facilitated by the memory tree","220701580":"Evolutionary Optimization in Spatio–temporal Fitness Landscapes","263436574":"Interactive ant colony optimization (iACO) for early lifecycle software design","275116744":"Consensus analysis for a class of stochastic PSO algorithm","222152590":"Resource assignment and scheduling based on a two-phase metaheuristic for cropping system","220742559":"Dynamic multi-objective optimization with evolutionary algorithms","262251798":"Runtime Infrastructure Optimisation in Cloud IaaS Structures","45869058":"Uncovering delayed patterns in noisy and irregularly sampled time series: An astronomy application","220176289":"A permutation-based dual genetic algorithm for dynamic optimization problems","256936430":"A new PSO algorithm with random C/D switchings","224178074":"Using multiobjective metaheuristics to solve VRP with uncertain demands","224319385":"A Competitive-Cooperative Coevolutionary Paradigm for Dynamic Multiobjective Optimization","222410633":"Coupled map lattices as spatio-temporal fitness functions: Landscape measures and evolutionary optimization","273512068":"Climbing combinatorial fitness landscapes","239598732":"Estimation-based Metaheuristics for Stochastic Combinatorial Optimization","221494264":"Perspectives in Dynamic Optimization Evolutionary Algorithm","266297617":"Un algoritmo paralelo de frente único para optimización multiobjetivo dinámica","220234736":"An Immunity-Based RBF Network and Its Application in Equalization of Nonlinear Time-Varying Channels","268802769":"Detecting Change and Dealing with Uncertainty in Imperfect Evolutionary Environments","237903096":"Improving the responsiveness of NSGA-II using an adaptive mutation operator: A case study","261122374":"Real-world simulation-based manufacturing optimization using Cuckoo Search","267272462":"A Knowledge-Based Evolutionary Multiobjective Approach for Stochastic Extended Resource Investment Project Scheduling Problems","262333760":"Evolutionary Algorithms for the Multiple Unmanned Aerial Combat Vehicles Anti-ground Attack Problem in Dynamic Environments","285622245":"Multipopulation-Based Differential Evolution with Speciation-Based Response to Dynamic Environments","261842296":"Evolutionary Algorithms","230667096":"Simulation-based Optimization of StarCraft Tactical AI through Evolutionary Computation","278655612":"Fractional Order Controller Tuning Using Swarm and Evolutionary Algorithms","220739521":"Opt4J-A modular framework for meta-heuristic optimization","220285899":"Inverse multi-objective robust evolutionary design","220867521":"An Immune System Based Genetic Algorithm Using Permutation-Based Dualism for Dynamic Traveling Salesman Problems","221006786":"Heuristics to avoid redundant solutions on population-based multimodal continuous optimization","262781275":"Multiobjective Resource-Constrained Project Scheduling with a Time-Varying Number of Tasks","274233003":"Randomly distributed unit sources to enhance optimization in tsunami waveform inversion","257356195":"Robust scheduling for multi-objective flexible job-shop problems with random machine breakdowns","238184644":"Robust Design of Compressor Fan Blades Against Erosion","224646047":"Robust Solution of Salting Route Optimisation Using Evolutionary Algorithms","271914696":"Immune optimization approach solving multi-objective chance-constrained programming","221157328":"CellularDE: A Cellular Based Differential Evolution for Dynamic Optimization Problems","284014098":"A knowledge-based evolutionary proactive scheduling approach in the presence of machine breakdown and deterioration effect","261991581":"Ant Colony Optimization Algorithms with Immigrants Schemes for the Dynamic Travelling Salesman Problem","224177757":"Robust optimization over time — A new perspective on dynamic optimization problems","232649433":"Localized Outlying and Boundary Data Detection in Sensor Networks","220199450":"Genotype representations in grammatical evolution","260529281":"Reconstructing biological gene regulatory networks: Where optimization meets big data","51173387":"Handling packet dropouts and random delays for unstable delayed processes in NCS by optimal tuning of (PID mu)-D-lambda controllers with evolutionary algorithms","220741152":"Fitness function for finding out robust solutions on time-varying functions","257432656":"Self-adaptive, multipopulation differential evolution in dynamic environments","228578964":"An investigation of the mutation operator using different representations in grammatical evolution","222552655":"A Novel hybrid genetic algorithm for kernel function and parameter optimization in support vector regression","271302436":"Controller Design for Non-Isothermal Reactor Based on Imperialist Competitive Algorithm","236858638":"Evolutionary optimization of an experimental apparatus","220741178":"How hard should we run?","262333616":"Analyzing Evolutionary Algorithms for Dynamic Optimization Problems Based on the Dynamical Systems Approach","222085679":"Zhang, Z.: Multiobjective optimization immune algorithm in dynamic environments and its application to greenhouse control. Appl. Soft Comput. 8(2), 959-971","221163066":"Gradient-based immune algorithm for optimization of dynamic environments","220702256":"Uncertainty Handling in Model Selection for Support Vector Machines","3412771":"Semantics of Schedules for the Fuzzy Job-Shop Problem","221228600":"Robust Design of Noise Attenuation Barriers with Evolutionary Multiobjective Algorithms and the Boundary Element Method","256332894":"An Adaptive Differential Evolution Algorithm for Global Optimization in Dynamic Environments","228957886":"Reproduction Strategy Based on Self-Organizing Map for Real-coded Genetic Algorithms","45860262":"Adaptation and Self-Organization in Evolutionary Algorithms","224058949":"Robust Solutions by using Evolutionary Computations on Dynamic Max-Sat Problems","215892929":"Exploiting Fruitful Regions in Dynamic Routing Using Evolutionary Computation","224148092":"An Evolutionary Computing Approach to Robust Design in the Presence of Uncertainties","260806827":"Population Statistics for Particle Swarm Optimization: Hybrid Methods in Noisy Optimization Problems","256756844":"A comparison of methods to avoid overfitting in neural networks training in the case of catchment runoff modeling","273507180":"Integrated rescheduling and preventive maintenance for arrival of new jobs through evolutionary multi-objective optimization","3418902":"Efficient search for robust solutions by means of evolutionary algorithms and fitness approximation","221174284":"The Application of Dominant-Recessive Diploid Codes in MOGA.","47435259":"Dynamic Problems and Nature Inspired Meta-Heuristics","257432689":"Immune clonal coevolutionary algorithm for dynamic multiobjective optimization","220132916":"Evolutionary swarm cooperative optimization in dynamic environments","263012509":"Analysis of fitness landscape modifications in evolutionary dynamic optimization","3418887":"Functions with noise-induced multimodality: A test for evolutionary robust optimization - Properties and performance analysis","226398797":"Immune algorithm with dynamic environments and its application to greenhouse control","263058584":"Optimization in Dynamic Environments Utilizing a Novel Method Based on Particle Swarm Optimization","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","284995524":"Gain and Order Scheduling for Fractional Order Controllers","3418893":"Max-min surrogate-assisted evolutionary algorithm for robust design","221007382":"Adaptive farming strategies for dynamic economic environment","3418894":"Locating and Tracking Multiple Dynamic Optima by a Particle Swarm Model Using Speciation”. IEEE Trans Evol Comput 10:(4)","221019670":"Discovering Process Models with Genetic Algorithms Using Sampling","3418895":"Multiswarms, exclusion, anti-convergence in dynamic environments","266872020":"Ant algorithms with immigrants schemes for the dynamic vehicle routing problem","3418891":"A general noise model and its effects on evolution strategy performance. IEEE Trans Evolut Comput","257391635":"A two-stage hybrid particle swarm optimization algorithm for the stochastic job shop scheduling problem","257296403":"A hybrid approach of support vector regression with genetic algorithm optimization for aquaculture water quality prediction","251399604":"The adARC pattern analysis architecture for adaptive human activity recognition systems","235838790":"A multiple local search algorithm for continuous dynamic optimization. J Heuristics","225650238":"Survival of the flexible: Explaining the recent popularity of nature-inspired optimization within a rapidly evolving world","279355368":"Lecture Notes in Computer Science","220742247":"Noise, fitness distribution, and selection intensity in genetic algorithms.","224570930":"A systems approach to evolutionary multiobjective structural optimization and beyond","221006462":"Incremental approximation of nonlinear constraint functions for evolutionary constrained optimization.","3418982":"Evolving Problems to Learn About Particle Swarm Optimizers and Other Search Algorithms","220743291":"The effects of solution density in the search space on finding spatially robust solutions","268526421":"Takeover Time in Evolutionary Dynamic Optimization: From theory to practice","252045395":"Multi-Objective PI controller design with an application to speed control of Permanent Magnet DC motor drives","261038296":"Adaptive Differential Evolution with Locality based Crossover for Dynamic Optimization","224330247":"DPGA: A Simple Distributed Population Approach to Tackle Uncertainty","257921031":"An analysis of multiobjective evolutionary algorithms for optimization problems with time constraints","257636352":"Dynamic index tracking via multi-objective evolutionary algorithm","281887632":"Evolutionary Computation for Real-World Problems","238860639":"A Markov chain that models genetic algorithms in noisy environments","221008456":"Memetic Algorithm based Fuzzy clustering","259539997":"A Simulated Annealing Algorithm for Noisy Multiobjective Optimization","46119384":"Stratégies de calcul pour l\u0027optimisation multiobjectif des structures composites","262329547":"Evolutionary Dynamic Optimization: Methodologies","225613336":"Collaborative Evolutionary Swarm Optimization with a Gauss Chaotic Sequence Generator","260013076":"An improved firefly algorithm for solving dynamic multidimensional knapsack problems","51724409":"Runtime Analysis of an Evolutionary Algorithm for Stochastic Multi-Objective Combinatorial Optimization","261038305":"A comparison of PSO and Reinforcement Learning for multi-robot obstacle avoidance","266717332":"Innovations in hybrid intelligent systems. Selected papers based on the presentations at the 2nd international workshop on hybrid artificial intelligence systems, (HAIS 2007), Salamance, Spain, November 2007","220742234":"Evolutionary Multiobjective Optimization","220365398":"Does cumulative advantage affect collective learning in science? An agent-based simulation","251965564":"Ant Colony Optimization with Direct Communication for the Traveling Salesman Problem","224580122":"Evolutionary Optimization of Dynamics Models in Sequential Monte Carlo Target Tracking","220942929":"A Study of Schedule Robustness for Job Shop with Uncertainty.","227210998":"On Similarity-Based Surrogate Models for Expensive Single- and Multi-objective Evolutionary Optimization","220132963":"A survey on metaheuristics for stochastic combinatorial optimization","262332636":"A Comparative Study on Particle Swarm Optimization in Dynamic Environments","220175968":"Optimization in dynamic environments: a survey on problems, methods and measures. Soft Comput","220702296":"A Steady-State Genetic Algorithm with Resampling for Noisy Inventory Control","267407473":"ONLINE ENSEMBLE LEARNING IN THE PRESENCE OF CONCEPT DRIFT","224186077":"A genetic algorithm for combinational optimization problems with uncertainties","263369777":"Multi-objective optimization using metaheuristics: Non-standard algorithms","273338319":"Shifted robust multi-objective test problems","226856450":"A Robust-Solution-Based Methodology to Solve Multiple-Objective Problems with Uncertainty","220951202":"Parallel Processing for Multi-objective Optimization in Dynamic Environments","266863717":"Dynamic Scheduling for Autonomous Robotics","233870973":"Balancing Population- and Individual-Level Adaptation in Changing Environments","263430204":"On Using Surrogates with Genetic Programming","257680587":"Scheduling Multi-Mode Projects under Uncertainty to Optimize Cash Flows: A Monte Carlo Ant Colony System Approach","257680585":"Evolutionary Optimization: Pitfalls and Booby Traps","29625943":"A Method for Handling Uncertainty in Evolutionary Optimization With an Application to Feedback Control of Combustion","220867262":"Compound Particle Swarm Optimization in Dynamic Environments","220313268":"Evolutionary algorithms for optimization problems with uncertainties and hybrid indices. Inf Sci","225730274":"Robust optimization using multi-objective particle swarm optimization","235709851":"Evolution strategies for robust optimization","274730999":"Evolutionary algorithm enhancement for model predictive control and real-time decision support","282916676":"Twisted Helical Antenna for Satellite-Mobile Handset Using Dynamic Multi-objective Self-adapting Differential Evolution Algorithm","224602879":"Evolutionary Optimization in Dynamic Environment","220740277":"A PSO-based framework for dynamic SVM model selection","220964534":"Endocrine Control Evolutionary Algorithm.","225138421":"A memetic algorithm with adaptive hill climbing strategy for dynamic optimization problems","247981400":"The robustness requirement in stochastic dynamic programing - preliminary draft of a draft","287567491":"Dynamic Combinatorial Optimization Problems: A Fitness Landscape Analysis","282905465":"A distributed noise-resistant Particle Swarm Optimization algorithm for high-dimensional multi-robot learning","45416733":"Simultaneous Kriging-Based Sampling For Optimization And Uncertainty Propagation","224645835":"Solving Problems with Hidden Dynamics – Comparison of Extremal Optimisation and Ant Colony System","47350138":"A hybrid approach for the control of axonal outgrowth: Preliminary simulation results","264331373":"Evolutionary Visual Exploration: Evaluation With Expert Users","225787608":"An Evolutionary Approach for Assessing the Degree of Robustness of Solutions to Multi-Objective Models","271532929":"Particle Swarm Optimization for Time Series Motif Discovery","4254704":"Evolutionary Computation on Multitask Reinforcement Learning Problems","283520854":"Algorithm Portfolios for Noisy Optimization","261264419":"Investigation of robust solution of evolutionary algorithms in dynamic environments","226604595":"Evolving the Tradeoffs between Pareto-Optimality and Robustness in Multi-Objective Evolutionary Algorithms","284160861":"Towards a dynamic modeling of the predator prey problem","220867225":"A Preliminary Study on Handling Uncertainty in Indicator-Based Multiobjective Optimization","227584548":"Markov chain analysis of genetic algorithms applied to fitness functions perturbed concurrently by additive and multiplicative noise","240985576":"Geometric Thermodynamical Selection for Evolutionary Multi-Objective Optimization: Geometric Thermodynamical Selection for Evolutionary Multi-Objective Optimization","224645845":"Bacterial Foraging Algorithm For Dynamic Environments","222073482":"A single front genetic algorithm for parallel multi-objective optimization in dynamic environments","224645848":"Evolution Strategies for Robust Optimization","226588223":"On Use of Unstable Behavior of a Dynamical System Generated by Phenotypic Evolution","27516515":"Methods for Improving Reliability of Evolutionary Computation Algorithms and Accelerating Problem Solving","4307841":"Uncertainties reducing Techniques in evolutionary computation","221007596":"On the Behavior of Cooperative Coevolution in Dynamic Environments","252016837":"An adaptive strategy for updating the memory in Evolutionary Algorithms for dynamic optimization","271736819":"Evolutionary robustness analysis for multi-objective optimization: Benchmark problems","265080846":"Sequential Sampling in Noisy Multi-Objective Evolutionary Optimization","261141586":"An Improved Differential Evolution Algorithm for Practical Dynamic Scheduling in Steelmaking-Continuous Casting Production","45158773":"Dynamic Problems and Nature Inspired Meta-heuristics","38134147":"Learning behavior in abstract memory schemes for dynamic optimization problems. Soft Comput","267324457":"The Dynamical Systems Approach - Progress Measures and Convergence Properties","232653337":"New Dynamic Multiobjective Evolutionary Algorithm with Core Estimation of Distribution","228655721":"Managing population and drought risks using many-objective water portfolio planning under uncertainty","221008613":"On the role of modularity in evolutionary dynamic optimisation","270053330":"Tracking global optima in dynamic environments with efficient global optimization","4307850":"A collaborative model for tracking optima in dynamic environments","257432726":"Danger theory based artificial immune system solving dynamic constrained single-objective optimization","232626706":"Dynamic Crowding Distance?A New Diversity Maintenance Strategy for MOEAs","37851536":"On Convergence of Evolutionary Computation for Stochastic Combinatorial Optimization","224645809":"A PSO-based Mobile Sensor Network for Odor Source Localization in Dynamic Environment: Theory, Simulation and Measurement","221008633":"Diversity enhanced Adaptive Evolutionary Programming for solving single objective constrained problems","46491920":"Evolutionary optimisation of noisy multi-objective problems using confidence-based dynamic resampling","220199625":"Discussions of worker ants\u0027 rule-based CHC dealing with changing environments","260293716":"Efficient Design under Uncertainty of Renewable Power Generation Systems Using Partitioning and Regression in the Course of Optimization","278649676":"A Review of Random Search Methods","224301702":"Dynamic evolutionary algorithm with variable relocation vectors","262328442":"Evolutionary Dynamic Optimization: Test and Evaluation Environments","224453308":"Evolutionary multi-objective optimization of robustness and innovation in redundant genetic representations","252259540":"Generalized Density-Estimate Memory for Dynamic Problems","276123563":"Novel prediction and memory strategies for dynamic multiobjective optimization","221837016":"Resampling Methods for Meta-Model Validation with Recommendations for Evolutionary Computation","273397675":"The Rolling Tide Evolutionary Algorithm: A Multiobjective Optimizer for Noisy Optimization Problems","226962021":"Particle Swarms for Dynamic Optimization Problems","235903469":"Evolutionary Approaches to Expensive Optimisation","262330432":"Finding Robust Solutions to Dynamic Optimization Problems","232699450":"A Cluster-Based Differential Evolution Algorithm With External Archive for Optimization in Dynamic Environments","220176120":"Qian, S.: Artificial immune system in dynamic environments solving time-varying non-linear constrained multi-objective problems. Soft Comput. 15(7), 1333-1349","262997066":"Robust optimization of nonlinear impulsive rendezvous with uncertainty","215617334":"Adaptation and Self-Organization in Evolutionary Algorithms","227179111":"Multi-Objective Optimization Using Evolutionary Algorithms","225638047":"Markov Chain Analysis of Genetic Algorithms Applied to Fitness Functions Perturbed by Multiple Sources of Additive Noise","220551882":"Use of gene dependent mutation probability in evolutionary neural networks for non-stationary problems","221024990":"Future Challenges.","258508956":"A Simulation-based Decision Support System to Improve Healthcare Facilities Performance – Elaborated on an Irish Emergency Department","226558580":"A Hybrid Approach Based on Evolutionary Strategies and Interval Arithmetic to Perform Robust Designs","284218117":"Power system robust reactive power optimization for load uncertainties","250417435":"FINDING ROBUST SOLUTIONS TO MULTI-OBJECTIVE OPTIMISATION PROBLEMS USING POLYNOMIAL CHAOS","6883217":"Optimum Tracking with Evolution Strategies","275015582":"Population statistics for particle swarm optimization: Single-evaluation methods in noisy optimization problems"},"index":468}