{"abs":"Reliability assessment of buckling limit state for imperfect stiffened panels made from elastic homogenous and isotropic material and subjected to uniform axial compression was performed in this work. The stiffened panel was assumed to suffer a single localized geometric imperfection having the form of a rectangular depression patch that is situated either on a web or a segment of the panel. A parametric study was performed with regards to the buckling strength variations for both perfect and imperfect panels as affected by the defect depth and position. Imperfect panels were generated by placing a depression square of fixed size and variable depth at various locations of the web and the plate. The obtained results have shown that buckling strength of stiffened panels is largely affected by the system geometric parameters and the defect characteristics. For an imperfect stiffened panel with a defect present either on a web or a segment, a drastic reduction of the buckling stress was obtained. The relative influence of defect position and depth was found to depend on whether the defect is located on a web or a segment of the stiffened panel. For a given configuration of the panel, focus was done on the effect of uncertainties affecting the plate geometric dimensions, the defect characteristics and the applied loading. These parameters were assumed to be random variables. Their means and standard deviations were assumed to be known, while no prior information is available about their densities of probabilities. First Order Reliability Method was applied to a response surface representation of the buckling limit state which was derived through quadratic polynomial regression of finite element results that were collected according to a full factorial design of experiment table built on the key intervening factors. The influence of the distributions of probabilities chosen to model the problem uncertainties for the perfect and imperfect stiffened panels was analyzed. It was found that these modify significantly reliability results. INTRODUCTION Reliability is associated to the ability of a system to accomplish some required functions, during a considered period of time (AFNOR, Eurocode1; Technical Report XP ENV 1, 1996). Reliability concepts intent assuring safety of structures within the context where there is no perfect knowledge about the real data intervening in the problem, but where statistics that describe their variations are available (Lemaire, 1997; Der Kiureghian and Dakessian, 1998). Reliability analysis is usually performed in order to take into account, for a given performance state of a structural system, uncertainties that affect mechanical, geometrical and loading parameters. This enables modeling uncertainties propagation between some given basic variables considered as the system inputs that vary randomly and the desired system outputs: called performance states. Many structures and engineering components take the form of stiffened panels. In the presence of initial geometric imperfections, they could suffer important decrease of buckling strength in comparison with the situation of perfect structures. There are numerous evidences in the literature which prove that the presence of geometric imperfections can reduce drastically the buckling stresses of structures (Faulkner, 1975; Carlsen, 1980; Smith et al., 1991; Grondin et al., 1998; Grondin et al., 1999). The experimental evaluation of buckling strength is such a costly and tedious task and the results could be rather controversial due to the inherent variations that could change the intervening parameters (Ghavami, 1973; Hu et al., 1997; Pan et al., 1999; Sheikh et al., 2002; Ghavami and Khedmatib, 2006). Simulating the effect of key geometric and loading parameters of the considered stiffened plate may then enable understanding such variability in order to assess more effectively reliability of design against buckling risk for these vital structures. Among important research that has been performed in this field, one finds analytical models using Ritz\u0027s energy method (Liu and Pavlovic, 2007). Both single and double Fourier series were used as deflection series to compute the values for buckling coefficients. But no theoretical solutions could exist for more complicated cases of stiffened plates. Therefore, numerical solutions are often preferred to analyze","title":"Reliability Assessment of Buckling for Stiffened Panels by Considering Localized Geometric Imperfections","id":274312193,"url":"https://www.researchgate.net/publication/274312193_Reliability_Assessment_of_Buckling_for_Stiffened_Panels_by_Considering_Localized_Geometric_Imperfections","names":["Ouadia Mouhat","Abdellatif Khamlichi","A. Limam"],"references":{"222413121":"Improved prediction of simultaneous local and overall buckling of stiffened panels","232372925":"Methods for ultimate limit state assessment of ships and ship-shaped offshore structures: Part II stiffened panels","238167988":"Experimental study of stiffened plates in compression up to collapse","256379905":"Structural Reliability Under Combined Random Load Sequences","229563172":"Response surface approximations for structural optimization","227770367":"Reliability‐Based Load and Resistance Factor Design (LRFD) Guidelines for Unstiffened Panels of Ship Structures","247697420":"Taguchi Method: A Hands-on Approach","222423570":"Numerical and experimental investigations on the compression behavior of stiffened plates","223848868":"Stiffened Steel Plates under Compression and Bending","257392195":"Reliability and mechanical design","229092691":"Experimental and numerical studies on the response of stiffened plates subjected to gas explosions","228611957":"Buckling of stiffened steel plates - A parametric study","263047733":"Structural Reliability Methods","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","243758427":"An Exact and Invariant First Order Reliability Format","245151520":"Elastic stability of flat rectangular plates under patch compression","245196289":"Methods for ultimate limit state assessment of ships and ship-shaped offshore structures: Part III hull girders","222087010":"Probabilistic Corrosion Rate Estimation Model for Longitudinal Strength Members of Bulk Carriers","223307920":"Multiple design points in first and second-order reliability","221957477":"Ultimate collapse tests of stiffened-plate ship structural units"},"citedIn":{},"index":475}