{"abs":"Since the mid-twentieth century, prestressed concrete (PC) bridges have been significantly developed to become the most important type of bridge in the world. However, only a few studies have dealt with the reliability-based design optimisation (RBDO) of PC bridges despite the fact that RBDO demonstrates the real behaviour of structures. Moreover, the corrosion of post-tensioned tendon in PC bridges seriously caused sudden failures which have been recorded in the world. Since then, this study presents the probabilistic model and approach to formulate and analyse the RBDO of PC box girder bridges which consider the pitting corrosion phenomenon of shear, torsion reinforcements and post-tensioned tendon. A practical example of a typical PC box girder bridge is presented and discussed. Sensitive analyses are performed to evaluate the influence of ultimate target reliability index on the optimal solution. For the simple support PC box girder bridge, the ultimate target reliability index should be in the range of βult: 3.5–5 in order to produce the optimal design.","title":"Reliability-based optimisation design of post-tensioned concrete box girder bridges considering pitting corrosion attack","id":232951308,"url":"https://www.researchgate.net/publication/232951308_Reliability-based_optimisation_design_of_post-tensioned_concrete_box_girder_bridges_considering_pitting_corrosion_attack","names":["Van-Son Nguyen","Min Chul Jeong","Tong-Seok Han","Jung Sik Kong","Structure and Infrastructure Engineering"],"references":{"250694128":"Optimum integer number and position of several groups of prestressing tendons for given concrete dimensions","247385084":"Reliability and Statistical Methods in Engineering Design","222166846":"Single objective reliability-based optimization of prestressed concrete beams","223245835":"Multi-objective reliability-based optimization of prestressed concrete beams","270852259":"Optimal Design with Probabilistic Objective and Constraints","250072672":"Effect of pitting corrosion on capacity of prestressing wires","245302678":"Reliability Assessment of Prestressed Concrete Beams","250694048":"Optimum design of prestressed beams","37427434":"Probability Concepts in Engineering Planning and Design, Vol. II. Decision, Risk, and Reliability","30833156":"Live load model for highway bridges","222289965":"On Computation Methods for Structural Reliability Analysis","223879563":"Reliability-based optimum design of reinforced concrete girder","222188522":"Reliability analysis of chloride penetration in saturated concrete","226037996":"An Incompatible Singular Elastic Element for Two- and Three-Dimensional Crack Problems","239390737":"Reliability of Reinforced Concrete Girders Under Corrosion Attack","250696553":"Integrating system reliability and optimization in prestressed concrete design","250696552":"Optimized design of the prestress in continuous bridge decks","243768286":"Multiobjective Optimization of Prestressed Concrete Structures","250694059":"An interactive design algorithm for prestressed concrete girders","222578585":"Spatial time-dependent reliability analysis of corroding pretensioned prestressed concrete bridge girders","245288897":"Structural Safety and Serviceability of Concrete Bridges Subject to Corrosion","245301372":"Basic Analysis of Structural Safety","248356904":"Film model for coated cement concrete","245303866":"Life-Cycle Cost Design of Deteriorating Structures","229938520":"Monte Carlo Simulation","245211955":"Local Domain Monte Carlo Simulation","245211891":"Mechanical behaviour of pitting corrosion of flexural and shear reinforcement and its effect on structural reliability of corroding RC beams","228892683":"Optimizing Lifetime Condition and Reliability of Deteriorating Structures with Emphasis on Bridges","239820411":"Corrosion of the Strand - Anchorage System in Post-Tensioned Grouted Assemblies","257940462":"Probability Concepts in Engineering Planning and Design, Vol I and II","247949878":"Corrosion induced failure mechanisms of prestressing steel","236488746":"Corrosion Engineering","223551328":"Failure analysis of cold drawn prestressing steel wires subjected to stress corrosion cracking","223764385":"Reinforcement corrosion initiation and activation times in concrete structures exposed to severe marine environments","245303912":"Reliability of Deteriorating RC Slab Bridges","259666818":"Optimizing Lifetime Condition and Reliability of Deteriorating Structures with Emphasis on Bridges","228597530":"Bridge research in Europe","222709690":"Sensitivity analysis of simplified diffusion-based corrosion initiation model of concrete structures exposed to chlorides","238184782":"Design Optimization With System-Level Reliability Constraints","24322701":"ADS—A Fortran Program for Automated Design Synthesis"},"citedIn":{"275221347":"An Assessment of the Quality-Achieving Reliability of Mechanical Products Based on Information-Poor Theory","254215385":"Maintenance, management, life-cycle design and performance of structures and infrastructures: a brief review","282701430":"Reliability-Based Structural Design of Concrete Pipes"},"index":476}