{"abs":"Discrete-event simulation is a significant analysis tool for designing complex systems. In the research literature, several deterministic search algorithms have been linked with simulation for industrial applications; but there are few empirical comparisons of the various algorithms. This paper compares the Hooke–Jeeves pattern search, Nelder–Mead simplex, simulated annealing, and genetic algorithm optimization algorithms on variations of four industrial case study simulation problems. The simulation models include combinations of real variables, integer variables, non-numeric variables, deterministic constraints, and stochastic constraints. The genetic algorithm was the most robust, as it found near best solutions for all 25 test problems. However, it required the most replications of all the algorithms. The pattern search algorithm also found near best solutions to small- and medium-sized problems with no non-numeric variables, while requiring fewer replications than the genetic algorithm.","title":"Empirical comparison of search algorithms for discrete event simulation","id":222919851,"url":"https://www.researchgate.net/publication/222919851_Empirical_comparison_of_search_algorithms_for_discrete_event_simulation","names":["T Lacksonen","Computers \u0026 Industrial Engineering"],"references":{"50332097":"Introduction to optimization theory.","236523258":"Genetic Algorithms and Simulated Annealing. Pitman, London","243450406":"Minimization Algorithms for Functions with Random Noise","235186115":"Simulation Optimization by Genetic Search: A Comprehensive Study with Applications to Production Management","234125560":"Discret-Event System Simulation","236620214":"Using evolutionary algorithms and simulation for the optimization of manufacturing systems","222316173":"Genetic algorithms and neural networks: Optimizing connections and connectivity. Parallel Computing, 14:347-361","216301002":"Simulated Annealing: Theory and Application","251738127":"A Gradient Technique for General Buffer Storage Design in a Serial Production Line","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","258950396":"Simulation Modeling and Analysis","3528198":"Comparison of global search methods for design optimization usingsimulation","229754661":"Optimization in Simulation: Current Issues and Future Outlook","30873058":"Genetic + Data Structures \u003d Evolution Programs","225953250":"Optimization via Simulation: a Review","222211241":"Simulation optimization using simulated Annealing","222283208":"Optimizing discrete stochastic systems using simulated annealing and simulation","262356052":"Simulation optimization by genetic search","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","223614729":"A generative simulation-optimization system","201382078":"Introduction to simulation using SIMAN","31050886":"A Simplex Method for Function Minimization Comput","255681666":"Optimization in Simulation: A Survey of Recent Results"},"citedIn":{"223368593":"A review of optimization techniques in metal cutting processes. Comp Ind Eng 50(1-2):15-34","262352225":"Co-evolutionary simulation-driven optimization for generating alternatives in waste management facility expansion planning","264438849":"Waste management facility expansion planning using simulation-optimisation with Grey programming and penalty functions","255583352":"Maintenance policies for a production system with constrained production rate and buffer capacity","279940652":"Modelling to Generate Alternative Policies in Highly Uncertain Environments: An Application to Municipal Solid Waste Management Planning","254222435":"A novel method for supplier selection by two competitors, including multiple criteria","232616725":"Optimal Model for Multi-Echelon Inventory System Based on GAAA Algorithms","260411468":"Supply chain design using simulation-based NSGA-II approach","7792573":"Policy planning under uncertainty: Efficient starting populations for simulation-optimization methods applied to municipal solid waste management","241013457":"Efficient generation of alternative perspectives in public environmental policy formulation: Applying co-evolutionary simulation-optimization to municipal solid waste management","47715159":"MULTIOBJECTIVE SIMULATION OPTIMIZATION USING ENHANCED EVOLUTIONARY ALGORITHM APPROACHES","271501665":"Multi-objective optimization of six-bar mechanisms using NSGA-II","266630452":"Simulation based Genetic Algorithm Approach for Integrating Process Planning and Scheduling Functions","224300426":"A job shop scheduling approach based on simulation optimization","244448135":"A COMPARISON OF MEMS SYNTHESIS TECHNIQUES","3997803":"Optimization of buffer sizes in assembly systems using intelligent techniques","225981935":"Neural network simulation metamodels and genetic algorithms in analysis and design of manufacturing cells","50926800":"A simulation-based multi-objective genetic algorithm approach for networked enterprises optimization","220215421":"An ordinal optimization theory-based algorithm for a class of simulation optimization problems and application","279848560":"Embedding Optimization with Discrete Event Simulation","224366784":"Integrating Simulation Optimization with VR for Facility Layout Evaluation","254027003":"Emergency materials dispatching considering reverse logistics in view of simulation optimization approach","221524884":"A comparative study of genetic algorithm components in simulation-based optimisation","224366910":"A simulation optimization approach for facility layout problem","233435215":"Modelling and optimisation of a product recovery network","231538026":"Simulation-based NSGA-II approach for multi-unit process plans generation in reconfigurable manufacturing system","221529427":"Simulation-based optimization of a complex mail transportation network","271261132":"Models and Methods for Operations in Port Container Terminals","267945362":"Simulation-Optimization techniques for modelling to generate alternatives in waste management planning","267621208":"Dynamic Simulation of Dependability of Nickel Reduction Plant","276112539":"Simulation optimization in inventory replenishment: A classification","277887970":"Multi-Objective Genetic Algorithm for Berth Allocation Problem Considering Daytime Preference","281488885":"Pre-operative planning of multiple probes in three dimensions for liver cryosurgery: Comparison of different optimization methods","229542365":"Improved Policies for Solid Waste Management in the Municipality of Hamilton‐Wentworth, Ontario","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","221527682":"IBM Supply-chain Network Optimization Workbench: An integrated optimization and simulation tool for supply chain design","228797397":"An Evolutionary Grey, Hop, Skip and Jump Approach: Generating Alternative Policies for the Expansion of Waste Management Facilities","233864457":"ChemInform Abstract: Empowering Systems Analysis for Solid Waste Management: Challenges, Trends, and Perspectives","220381400":"A simulation optimization methodology for supplier selection problem","43294574":"Real time evolutionary algorithms in robotic neural control systems.","262346649":"A computational approach optimizing push/pull flow in an aerospace transmission overhaul shop","223942051":"A GA-based parameter design for single machine turning process with high-volume production","239795249":"A Comparative Study of Production Control Mechanisms using Simulation-based Multi-Objective Optimization","222050247":"Solid waste planning under uncertainty using evolutionary simulation-optimization","223612840":"Incorporating robustness into genetic algorithm search of stochastic simulation outputs. Simul Model Pract Theory","220938006":"A Two-Level Programming Method for Collaborative Scheduling in Construction Supply Chain Management","222229441":"A simulation-based evolutionary multiobjective approach to manufacturing cell formation","220518043":"A More Effective Technique of Design Synthesis For MEMS with Expected Performance"},"index":479}