{"abs":"In this paper we present an evolutionary algorithm for solving the nutrition problem of composing and balancing healthy meals. We treat this problem as a single-objective and multiconstrained fractional knapsack problem that is easy to formulate, yet, its decision problem is in the class of NP-complete problems. In other words, some heuristic algorithm is required to provide good problem solutions in reasonable (polynomial) computational time. We applied a genetic algorithm and modified its parameters to yield high-quality and reliable solutions (healthy and balanced meals) that respect multiple weakly-correlated dietary recommendations and guidelines and include as much seasonal functional foods as possible. Functional foods contain physiologically active compounds that provide health benefits beyond their nutrient contributions. Povzetek: V članku predstavljamo evolucijski algoritem za reševanje problema optimalne sestave jedilnika.","title":"Evolutionary Balancing of Healthy Meals","id":228854616,"url":"https://www.researchgate.net/publication/228854616_Evolutionary_Balancing_of_Healthy_Meals","names":["Barbara Koroušić Seljak","Informatica"],"references":{"220885610":"Constrained Genetic Optimization via Dynarnic Reward-Penalty Balancing and Its Use in Pattern Recognition.","228057735":"Computers and Intractability: A Guide to NP-Completeness","226023753":"Efficient Algorithms for Solving Multiconstraint Zero-One Knapsack Problems to Optimality","30873058":"Genetic + Data Structures \u003d Evolution Programs","223615660":"Solving inverse initial-value, boundary-value problems via genetic algorithm","38981323":"Understanding Normal \u0026 Clinical Nutrition","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","215459436":"Adaptation in Natural and Artificial Systems: An Introductory Analysis With Applications to Biology, Control, and Artificial Intelligence","4940310":"Zero-One Programming With Many Variables and Few Constraints","226952778":"Beasley, J.E.: A Genetic Algorithm for the Multidimensional Knapsack Problem. Journal of Heuristics 4, 63-86","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"238381912":"Computer-based dietary menu planning","259936705":"Characterisation of Knowledge Incorporation into Solution Models for the Meal Planning Problem"},"index":48}