{"abs":"Various reliability methods have been suggested in the literature, but the bound of an estimated reliability has received less attention. The maximum entropy principle is used to obtain the reliability bound with respect to the first moment truncated for the first time. Compared to the previous methods of probability bounding based on given moments, our method is demonstrated to generate a tight upper bound that is practically useful for engineering applications. Numerical examples have shown that a good upper bound of probability of failure is well obtained up to four given moments, but with more moments a divergence problem can occur. KeywordsFirst truncated moment-Probability of failure-Reliability bound-Maximum entropy-Moment based distribution bounding-Upper bound of probability","title":"Reliability bound based on the maximum entropy principle with respect to the first truncated moment","id":226143593,"url":"https://www.researchgate.net/publication/226143593_Reliability_bound_based_on_the_maximum_entropy_principle_with_respect_to_the_first_truncated_moment","names":["Young Hwa Sung","Byung Man Kwak","Journal of Mechanical Science and Technology"],"references":{"228651616":"An Extended Polynomial Dimensional Decomposition Method for Arbitrary Probability Distributions","230663741":"Distributions. In Continuous Univariate Distributions, Vol. 2","247385084":"Reliability and Statistical Methods in Engineering Design","247085688":"Orthogonal Polynomials: Computation and Approximation. Oxford, New York","245330525":"Efficient statistical tolerance analysis for general distribution using three-point information","220022167":"Information Theory and Statistical Mechanics I","243766218":"The Classical Moment Problem and Some Related Questions in Analysis (Engl. transl. N. Kemmer)","268242866":"Geometry of Moment Spaces","222616267":"Hausdorff moment problem and maximum entropy: A unified approach","226878164":"Application of maximum entropy principle for reliability-based design optimization","254071478":"Enriched Performance Measure Approach (PMA+) for Reliability-Based Design","237127798":"Entropy Optimization Principles With Applications","227250142":"Improved moment-based quadrature rule and its application to reliability-based design optimization","283599999":"“Quadratic Limit States in Structural Reliability”","224481917":"Performance evaluation of precision nanopositioning devices caused by uncertainties due to tolerances using function approximation moment method","222206944":"Response surface augmented moment method for efficient reliability analysis","245301372":"Basic Analysis of Structural Safety","238184598":"Uncertainty Analysis by Dimension Reduction Integration and Saddlepoint Approximations","242790877":"Existence and stability of a discrete probability distribution by maximum entropy approach","234814104":"A mathematical theory of communication. AT\u0026T Tech J","235418978":"A Mathematical Theory of Communication","242698525":"Calculation of Gauss Quadrature Rules","7201926":"Geometry of Reduced Moment Spaces.","226308881":"Robust Design with Arbitrary Distributions Using Gauss-Type Quadrature Formula","222832250":"Xu, H.: A univariate dimension-reduction method for multi-dimensional integration in stochastic mechanics. Probabilitic Engineering Mechanics 19, 393-408","254332955":"Statistical Tolerancing Using a Modification of Taguchi\u0027s Method","236660847":"Exact and Invariant Second Moment Code Format","222408376":"A moments based distribution bounding method","220689117":"Safety Factors and Reliability - Friends or Foes?","246783755":"Maximum entropy in the problem of moments"},"citedIn":{"257775119":"Multi-source data fusion based small sample prediction of gear random reliability","258177050":"Dynamic reliability of gears in a wind turbine gearbox under the conditions of variable wind speed and small samples"},"index":481}