{"abs":"Structural reliability is nowadays largely used to take into account uncertainties related to the input data of a structural model. When the structural response becomes complex, the mechanical model is designed within the framework of the finite element method and therefore, the computational time required by a coupling reliability/finite element analysis is driven by the number of performance function calls. This paper aims at proposing an original approach to approximate implicit limit state functions. It is based on the support vector machine used in regression trained with an adaptive experimental design. Several numerical examples proposed in the published literature are considered to assess the efficiency of the proposed method.","title":"A response surface method based on support vector machines trained with an adaptive experimental design","id":257007030,"url":"https://www.researchgate.net/publication/257007030_A_response_surface_method_based_on_support_vector_machines_trained_with_an_adaptive_experimental_design","names":["Benjamin Richard","Christian Cremona","Lucas Adelaide","Structural Safety"],"references":{"222527371":"High-order limit state functions in the response surface method for structural reliability analysis","256379905":"Structural Reliability Under Combined Random Load Sequences","221985142":"An efficient computational scheme to calculate structural failure probabilities. Probabilistic Engineering Mechanics 4(1):10-18","220343922":"Support Vector Network","223416196":"“Response surface method using vector projeted sampling points”","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","229328945":"Cumulative formation of response surface and its use in reliability analysis","271513141":"Support Vector Networks","223905476":"A three-dimensional steel/concrete interface model including corrosion effects","238002417":"A multi-fiber approach for modeling corroded reinforced concrete structures","220694713":"Statistical Learning Theory","222475741":"Structural reliability analysis of elastic-plastic structures using neural networks and Monte Carlo simulation. Computer Methods in Applied Mechanics and Engineering 136: 145-163","248560911":"Importance sampling in structural system","239371227":"Isotropic continuum damage mechanics for concrete under cyclic loading: Stiffness recovery, inelastic strains and frictional sliding","216300359":"Empirical Model Building and Response Surface","245301372":"Basic Analysis of Structural Safety","285368545":"Utilisation des surfaces de réponse dans le calcul de la fiabilité des composants mécaniques","222211162":"Search-based importance sampling","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","2423042":"Support Vector Machines for Classification and Regression. Technical Report","255672338":"Reliability Analysis Using Parabolic Failure Surface Approximation","222287247":"Neural-network-based reliability analysis: A comparative study","273800355":"Probability Integration by Directional Simulation","223351842":"Analysis of one-dimensional stochastic finite elements using neural networks","223287356":"Filtered importance sampling with support vector margin: A powerful method for structural reliability analysis","236660847":"Exact and Invariant Second Moment Code Format","239546749":"Statistical Learning Theory","245186087":"Adaptive response surface method based on a double weighted regression technique","222780925":"A new adaptive importance sampling scheme","256968428":"Bond slip model for the simulation of reinforced concrete structures","222945716":"Optimization algorithms for structural reliability","264910325":"Structural reliability. Statistical learning perspectives","223895399":"Probabilistic approach to corrosion risk due to carbonation via an adaptive response surface method"},"citedIn":{"282543143":"An adaptive reliability method combining relevance vector machine and importance sampling","264660199":"First order reliability method for time-variant problems using series expansions","273353434":"A multiwavelet support vector regression method for efficient reliability assessment","276860018":"Multi-objective optimization of the vehicle ride comfort based on Kriging approximate model and NSGA-II","258791226":"Karhunen-Loève decomposition of random fields based on a hierarchical matrix approach","276172321":"Reliability analysis on resonance for low-pressure compressor rotor blade based on least squares support vector machine with leave-one-out cross-validation","267329383":"Nonlinear Dynamic Probabilistic Analysis for Turbine Casing Radial Deformation Using Extremum Response Surface Method Based on Support Vector Machine","276516034":"Vibration reliability analysis for aeroengine compressor blade based on support vector machine response surface method","284887200":"The Role of Computational Intelligence in Experimental Design: A Literature Review"},"index":484}