{"abs":"Selecting the sequence of tools to use for the rough machining of components is an important task in manufacturing, which greatly affects the overall machining time and cost of the process. In this paper a multi-objective approach is presented, which supports the use of tools with different geometrical properties and offers the process planner a set of Pareto optimal solutions. An industrial simulator is employed, which allows important information to be captured in the model but has the disadvantage of being computationally expensive. A master/slave approach to parallelization is implemented, which can be used on existing grid or cloud computing infrastructures. Synchronous generational and asynchronous steady-state multi-objective algorithms are compared on their search performance and runtimes on two components. Particular attention is paid to potential problems faced by asynchronous search caused by heterogeneous evaluation times due to characteristics present in individual tool sequences. Results show that the algorithms achieve a similar search performance, with the synchronous algorithm occasionally finding a slightly more diverse spread of solutions. However, the asynchronous algorithm is considerably faster, and provides good solutions in a short runtime that means this approach could be easily and inexpensively implemented in an industrial setting.","title":"Tool sequence optimization using synchronous and asynchronous parallel multi-objective evolutionary algorithms with heterogeneous evaluations","id":261109929,"url":"https://www.researchgate.net/publication/261109929_Tool_sequence_optimization_using_synchronous_and_asynchronous_parallel_multi-objective_evolutionary_algorithms_with_heterogeneous_evaluations","names":[],"references":{"220741544":"Reference Point Based Multi-Objective Optimization Using Evolutionary Algorithms","254461803":"Metaheuristic Approaches to Tool Selection Optimisation","225342796":"Rough milling optimisation for parts with sculptured surfaces using genetic algorithms in a Stackelberg gam","245386151":"Automatic tool selection for milling operations. Part 2: Tool sorting and variety reduction","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","224316884":"A study of master-slave approaches to parallelize NSGA-II","225769374":"Optimisation of Multiple Tool CNC Rough Machining of a Hemisphere as a Genetic Algorithm Paradigm Application","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","233407300":"Applications of Multi-Objective Evolutionary Algorithms","220701704":"Lecture Notes in Computer Science","44261840":"Optimal Selection of Tools for Rough Machining of Sculptured Surfaces","216300368":"Integrating User Preferences into Evolutionary Multi-Objective Optimization","225530949":"Applications of genetic algorithms in process planning: tool sequence selection for 2.5-axis pocket machining","220381687":"Optimization and selection of cutters for 3D pocket machining","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","220582611":"An optimal approach to multiple tool selection and their numerical control path generation for aggressive rough machining of pockets with free-form boundaries","226767006":"A Multiple-Tool Approach to Rough Machining of Sculptured Surfaces","261646405":"Optimizing tool selection","220583451":"Automated tool sequence selection for 3-axis machining of free-form pockets","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","220382045":"A computer aided tool selection system for 3D die/mould-cavity NC machining using both a heuristic and analytical approach"},"citedIn":{"280025628":"Understanding Simple Asynchronous Evolutionary Algorithms"},"index":486}