{"abs":"An efficient procedure for the reliability analysis of frame structures with respect to the buckling limit state is proposed under the assumption that no imperfections are present and that the elastic parameters are uncertain and modeled as random variables. The approach allows a deeper investigation of structures which are not sensitive to imperfections. The procedure relies on a Response Surface Method adopting simple ratio of polynomials without cross-terms as performance function. Such a relationship approximates analytically the dependence between the buckling load and the basic variables furnishing a limit state equation which is very close to the exact one when a proper experimental design is adopted. In this way a Monte Carlo Simulation applied to the response surface leads to a good approximation with low computational effort. Several numerical examples show the accuracy and effectiveness of the method varying structural complexity, correlation between basic variables and their distribution.","title":"Probabilistic eigenvalue buckling analysis solved through the ratio of polynomial response surface","id":256918041,"url":"https://www.researchgate.net/publication/256918041_Probabilistic_eigenvalue_buckling_analysis_solved_through_the_ratio_of_polynomial_response_surface","names":["Umberto Alibrandi","Nicola Impollonia","G. Ricciardi","Computer Methods in Applied Mechanics and Engineering"],"references":{"245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","223859735":"A response surface approach for the static analysis of stochastic structures with geometrical nonlinearities","228954980":"A comparison of approximate response functions in structural reliability analysis, Probabilistic","248877590":"Slope Reliability and Response Surface Method","230270782":"The use stochastic stresses in the static approach of probabilistic limit analysis","252279745":"Buckling of a Stochastically Imperfect Finite Column on a Nonlinear Elastic Foundation: A Reliability Study","222210675":"Explicit solutions in the stochastic dynamics of structural systems","223592988":"A new look at the response surface approach for reliability analysis","263793526":"Stochastic post-buckling of frames using Koiter\u0027s method","223416196":"“Response surface method using vector projeted sampling points”","257940484":"Structural Reliability Analysis, Prediction","245284547":"A Response Surface Approach for Reliability Analysis","223307920":"Multiple design points in first and second-order reliability","260855533":"Erratum to ?A new approach for the stochastic analysis of finite element modelled structures with uncertain parameters? 6Comput. Methods Appl. Mech. Engrg. 191 (2002) 5067?50859","259570201":"Stability of Structures: Elastic, Inelastic, Fracture and Damage Theories","222316002":"The stochastic finite element method in structural reliability","239368679":"About the accuracy of a novel response surface method for the analysis of finite element modeled uncertain structures","246909972":"Multivariate distribution models with prescribed marginals and covariances","222251738":"A new approach for the stochastic analysis of finite element modelled structures with uncertain parameters","223164520":"The effect of material and thickness variability on the buckling load of shells with random initial imperfections","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","222073620":"Stochastic dynamics of linear elastic trusses in presence of structural uncertainties (virtual distortion approach)","257922293":"A non linear performance function for probabilistic buckling analysis","239343791":"A method to derive approximate explicit solutions for structural mechanics problems","232838093":"Narrow Reliability Bounds for Structural Systems","222308527":"Buckling analysis of imperfect frames using a stochastic finite element method","223284991":"Effect of response surface parameter variation on structural reliability estimates","245589392":"Buckling analysis of cylindrical shells with random geometric imperfections","2463953":"Numerical Computation Of Multivariate Normal Probabilities","222335862":"Reliability of axially compressed cylindrical shells with random axisymmetric imperfections","245425942":"Toward a Probabilistic Preliminary Design Criterion for Buckling Critical Composite Shells","245303529":"Effects of Uncertain Material Properties on Structural Stability","275188753":"Optimal Discretization of Random Fields","223255606":"Probabilistic analysis of truss structures with uncertain parameters (virtual distortion method approach)","245057121":"Random initial imperfections of structures","251350663":"Bounds on System Reliability by Linear Programming","27346909":"Reliability of axially compressed cylindrical shells with random axisymmetric imperfections"},"citedIn":{"255969635":"Buckling load variability of cylindrical shells with stochastic imperfections","256968659":"Metamodel-based regional vulnerability estimate of irregular steel moment-frame structures subjected to earthquake events","256918068":"Multiparametric response surface construction by means of proper generalized decomposition: An extension of the PARAFAC procedure","277668968":"Implications of High-Dimensional Geometry for Structural Reliability Analysis and a Novel Linear Response Surface Method Based on SVM","284359830":"Explicit solution for linear systems with parametric stiffness and application to uncertain structures","283477133":"Secant Hyperplane Method for Structural Reliability Analysis","259695767":"A Linear Response Surface based on SVM for Structural Reliability Analysis","265167329":"The improved FORM for Stochastic Dynamic Analysis","257922286":"Structural Reliability Analysis solved through a SVM-based Response Surface","273481561":"Green’s Function Method for Stability Analysis of Stochastic Structures","267953134":"Probabilistic Approach to Buckling Analysis of Thin Panels Subject to Combined Loads","256917990":"Hybrid perturbation-Polynomial Chaos approaches to the random algebraic eigenvalue problem","257922471":"Post-Buckling analysis of frames with uncertain parameters","275280785":"A new sampling strategy for SVM-based Response Surface for Structural Reliability Analysis","265172085":"Robust stability analysis of structures with uncertain parameters using mathematical programming approach","241087424":"A gradient-free method for determining the design point in nonlinear stochastic dynamic analysis"},"index":487}