{"abs":"A procedure for statistical moment estimation and reliability analysis using design of experiment (DOE) is proposed. A numerical method of finding the optimal levels and weights of DOE for statistical moment estimation is established and applied to three- and five-level cases. The four statistical moments of the system response function are then calculated from the full-factorial DOE, and the probability distribution of the system response function is obtained using the empirical distribution systems such as the Pearson system. The proposed method is tested through several examples and compared with other analysis methods, including the previous developments of a three-level full-factorial design. The results show that it relieves much of the difficulties met in the previous method and provides good accuracy compared to other methods for various input distributions.","title":"Multilevel design of experiments for statistical moment and probability calculation","id":227295038,"url":"https://www.researchgate.net/publication/227295038_Multilevel_design_of_experiments_for_statistical_moment_and_probability_calculation","names":["Sang-Hoon Lee","H. S. Choi","B. M. Kwak","Structural and Multidisciplinary Optimization"],"references":{"223207565":"Structural reliability methods for seismic safety assessment: A review","245330525":"Efficient statistical tolerance analysis for general distribution using three-point information","230663741":"Distributions. In Continuous Univariate Distributions, Vol. 2","230872901":"Stochastic Finite Elements","256379905":"Structural Reliability Under Combined Random Load Sequences","257765524":"Approximate Calculation of Integrals","237107634":"Continuous Univariate Distributions - II","238808367":"Component tolerance design for minimum quality loss and manufacturing cost","283763647":"Zon-normal dependent vectors in structural safety","242500899":"Statistical Models in Engmeering","220694640":"Introduction to Numerical Analysis","2457917":"Numerical Integration using Sparse Grids","227605578":"A generalized dimension‐reduction method for multidimensional integration in stochastic mechanics","222206944":"Response surface augmented moment method for efficient reliability analysis","223307920":"Multiple design points in first and second-order reliability","236660920":"Methods of Structural Safety","222450980":"The stochastic finite-element method","265794417":"Method of Structural Safety","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","222832250":"Xu, H.: A univariate dimension-reduction method for multi-dimensional integration in stochastic mechanics. Probabilitic Engineering Mechanics 19, 393-408","254332955":"Statistical Tolerancing Using a Modification of Taguchi\u0027s Method","236660847":"Exact and Invariant Second Moment Code Format","233074451":"Performance analysis design. Int J Prod Res","254331474":"An Application of Numerical Integration Techniques to Statistical Tolerancing","275970953":"An Introduction to Numerical Analysis"},"citedIn":{"226878164":"Application of maximum entropy principle for reliability-based design optimization","267487817":"A Multiscale Design Approach With Random Field Representation of Material Uncertainty","268574634":"A New Weighted Stochastic Response Surface Method for Uncertainty Propagation","245366774":"Efficient Random Field Uncertainty Propagation in Design Using Multiscale Analysis","223193812":"A Better Understanding of Model Updating Strategies in Validating Engineering Models","227527173":"Complexity science of multiscale materials via stochastic computations","245571928":"Robust Structural Optimization Using Gauss-type Quadrature Formula","268292593":"Scatter assessment of rotating system vibrations due to uncertain residual unbalances and bearing properties","226308881":"Robust Design with Arbitrary Distributions Using Gauss-Type Quadrature Formula","266982132":"Maximum-Entropy Method for Evaluating the Slope Stability of Earth Dams","238860930":"Chaos control for numerical instability of first order reliability method"},"index":488}