{"abs":"In many applications of evolutionary algorithms, the time required to evaluate the fitness of individuals is long and variable. When the variance in individual evaluation times is non-negligible, traditional, synchronous master-slave EAs incur idle time in CPU resources. An asynchronous approach to parallelization of EAs promises to eliminate idle time and thereby to reduce the amount of wall-clock time it takes to solve a problem. However, the behavior of asynchronous evolutionary algorithms is not well understood. In particular, it is not clear exactly how much faster the asynchronous algorithm will tend to run, or whether its evolutionary trajectory may follow a sub-optimal search path that cancels out the promised benefits. This paper presents a preliminary analysis of simple asynchronous EA performance in terms of speed and problem-solving ability.","title":"Understanding Simple Asynchronous Evolutionary Algorithms","id":280025628,"url":"https://www.researchgate.net/publication/280025628_Understanding_Simple_Asynchronous_Evolutionary_Algorithms","names":["Eric \u0027Siggy Scott","Kenneth De Jong"],"references":{"222220349":"Hierarchical parallel approach for GSM mobile network design","216300130":"Experimental Research in Evolutionary Computation---The New Experimentalism","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","224316884":"A study of master-slave approaches to parallelize NSGA-II","3810167":"Effect of global parallelism on the behavior of a steady state genetic algorithm for design optimization","2447990":"A Parallel Genetic Algorithm for Multiobjective Microprocessor Design","222837468":"Analyzing synchronous and asynchronous parallel distributed genetic algorithms","220742064":"GPU-based asynchronous particle swarm optimization","266464570":"An asynchronous steady-state NSGA-II algorithm for multi-objective optimization of Diesel combustion","3837542":"Parallel genetic algorithm taxonomy","220701818":"A New Asynchronous Parallel Evolutionary Algorithm for Function Optimization","224645831":"Using a Queue Genetic Algorithm to Evolve Xpilot Control Strategies on a Distributed System","257553598":"Designing and testing a pool-based evolutionary algorithm","3418716":"Parallelism and evolutionary algorithms","243779054":"Efficient and Accurate Parallel Genetic Algorithms. Boston: Kluwer","221977360":"Asynchronous Master-Slave Parallelization of Differential Evolution for Multi-Objective Optimization","201975911":"Median-Selection for Parallel Steady-State Evolution Strategies","6577234":"Parallel asynchronous particle swarm optimization","261109929":"Tool sequence optimization using synchronous and asynchronous parallel multi-objective evolutionary algorithms with heterogeneous evaluations","242378571":"Parallel Particle Swarm Optimization Algorithm Accelerated by Asynchronous Evaluations","2700307":"Generation Gaps Revisited","222652286":"A new asynchronous parallel global optimization method based on simulated annealing and differential evolution","2899927":"C2.7 Generation gap methods","265929829":"HIERARCHICAL ASYNCHRONOUS GENETIC ALGORITHMS FOR PARALLEL/DISTRIBUTED SIMULATION{BASED OPTIMIZATION","220691482":"Evolutionary Computation – A Unified Approach"},"citedIn":{"278022171":"Performance Comparison of Generational and Steady-State Asynchronous Multi-Objective Evolutionary Algorithms for Computationally-Intensive Problems"},"index":489}