{"abs":"In this paper, we propose a reliability–mechanical study combination for treating the metal forming process. This combination is based on the augmented Lagrangian method for solving the deterministic case and the response surface method. Our goal is the computation of the failure probability of the frictionless contact problem. Normally, contact problems in mechanics are particularly complex and have to be solved numerically. There are several numerical techniques available for computing the solution. However, some design parameters are uncertain and the deterministic solutions could be unacceptable. Thus, a mechanical contact study is an important subject for reliability analysis: the augmented Lagrangian method coupled with the first order reliability method, and we use the Monte Carlo method to obtain the founding results. The metal forming process is treated numerically to validate the new approach.","title":"Reliability analysis of the metal forming process","id":264495817,"url":"https://www.researchgate.net/publication/264495817_Reliability_analysis_of_the_metal_forming_process","names":["Bouchaib Radi","Abdelkhalak ELHami","Mathematical and Computer Modelling"],"references":{"240460597":"Les Inéquation en Mécanique et en Physique","267002248":"Numerical methods for frictional contact problems and applications","245124926":"Treatment of the frictional contact via a Lagrangian formulation","245301372":"Basic Analysis of Structural Safety","285368545":"Utilisation des surfaces de réponse dans le calcul de la fiabilité des composants mécaniques","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","253386236":"Nonlocal and Nonlinear Friction Laws and Variational Principles for Contact Problems in Elasticity","222871791":"Reliability analysis of a mechanical contact between deformable solids","233160461":"Elément fini de coque à trois nœuds pour le calcul des structures minces en grandes déformations","222750063":"An Augmented Lagrangian Treatment of Contact Problem Friction Problems","257295996":"An augmented Lagrangian treatment of the metal forming process","223592988":"A new look at the response surface approach for reliability analysis","235276502":"Finite element modelling of the stamping of anisotropic sheet metals","229603839":"Subdomain methods in structural mechanics","222759378":"A stochastic model of rough surfaces for finite element contact analysis","229969039":"New strategy for the solution of frictional contact problems","245359425":"Linear Complementary Formulations Involving Frictional Contact for ElastoPlastic Deformable Bodies","222861590":"Various numerical methods for solving unilateral contact problems with friction"},"citedIn":{"257779294":"A two-pronged approach for springback variability assessment using sparse polynomial chaos expansion and multi-level simulations","236028789":"Reliability-based design for soil tillage machines","264238907":"Random Material\u0027s Characteristics to Study Fluid-Structure Interaction","281204646":"Probabilistic approach to study the hydroformed sheet","254860245":"Optimization under uncertainty of metal forming processes - an overview : literature report","225813171":"The frictional contact of the composite fabric’s shaping","263651568":"Hydroforming Process: Identification of the Material\u0027s Characteristics and Reliability Analysis","235611459":"Theoretical Analysis of the Spatial Variability in Tillage Forces for Fatigue Analysis of Tillage Machines","264083604":"Electrostriction study for single-walled carbon nanotubes-based composite","277814470":"A perturbation approach for the dynamic analysis of one stage gear system with uncertain parameters","235693798":"Estimating the variability of tillage forces on a chisel plough shank by modeling the variability of tillage system parameters","273769948":"A polynomial chaos method to the analysis of the dynamic behavior of spur gear system","265857965":"A model for reliability analysis of multi-state manufacturing systems","233544284":"The Study of the Composites Fabric\u0027s Shaping using an Augmented Lagrangian Approach","273831365":"A polynomial chaos method to the analysis of the dynamic behavior of spur gear system","223473579":"Optimization of sheet metal forming processes by adaptive response surface based on intelligent sampling method. J Mater Process Technol","264495679":"The frictional contact of the shaping of the composite fabric. International Journal","259174479":"Reliability-based Design Optimization (RBDO)"},"index":492}