{"abs":"The purpose of this paper is to present a law of large numbers and a central limit theorem for Adaptive Multilevel Splitting algorithms. In rare event estimation, Multilevel Splitting is a sequential Monte Carlo method to estimate the probability of a rare event as well as to simulate realisations of this event. Contrarily to the fixed-levels version of Multilevel Splitting, where the successive levels are predefined, the adaptive version of this algorithm estimates the sequence of levels on the fly and in an optimal way at the price of a low additional computational cost. However, if a lot of results are available for the fixed-levels version thanks to a connection with the general framework of Feynman-Kac formulae, this is unfortunately not the case for the adaptive version. Hence, the aim of the present article is to go one step forward in the understanding of this practical and efficient method, at least from the law of large numbers and central limit viewpoints. In particular, we show that the asymptotic variance of the adaptive version is the same as the one of the fixed-levels version where the levels would have been placed in an optimal manner.","title":"Fluctuation Analysis of Adaptive Multilevel Splitting","id":265127940,"url":"https://www.researchgate.net/publication/265127940_Fluctuation_Analysis_of_Adaptive_Multilevel_Splitting","names":["Frederic Cerou","Pierre Del Moral","Arnaud Guyader","Florent Malrieu"],"references":{"242331345":"On the Convergence of Adaptive Sequential Monte Carlo Methods","243737318":"Measure Theory and Fine Properties of Functions","228057717":"An Introduction to Probability Theory and Its Applications II","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","239061974":"An Introduction to Probability Theory and Its Applications – Volume I and II","264854211":"Combinatorial analysis of the adaptive last particle method","268718670":"Rare Event Simulation Using Monte Carlo Methods","226031060":"Sequential Monte Carlo for rare event estimation","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","242386046":"Estimation of Particle Transmission by Random Sampling","246868698":"Rosenbluth, M. N. \u0026 Rosenbluth, A. W. Monte Carlo calculation of the average extension of molecular chains. J. Chem. Phys. 23, 356","270363953":"Empirical Processes With Applications to Statistics","45858997":"Effective dynamics using conditional expectations","226592753":"The Gibbs Cloner for Combinatorial Optimization, Counting and Sampling","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","230675276":"A Probablistic Theory of Pattern Recognition","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","230569226":"New Insights Into Approximate Bayesian Computation","29596955":"Genetic Genealogical Models in Rare Event Analysis","263021460":"Analysis of Adaptive Multilevel Splitting algorithms in an idealized case","38339957":"Counterexamples in importance sampling for large deviations probabilities. Ann. Appl. Probab. 7, 731-746"},"citedIn":{"284750937":"Rare event simulation and spliting for discontinuous random variables","283810285":"Recent advances in various fields of numerical probability","272793915":"Large deviations principle for the Adaptive Multilevel Splitting Algorithm in an idealized setting","279808481":"Rare Event Simulation and Splitting for Discontinuous Random Variables","276211339":"Unbiasedness of some generalized Adaptive Multilevel Splitting algorithms"},"index":498}