{"abs":"GA\u0027s have more success with optimizing a single configuration than with optimizing multiple configurations with connectivity constraints tying them together, i.e., variable geometry problems such as designing the variable geometry wings of a plane. This paper describes a GA based approach to solve variable geometry optimization problems where (a) the connectivity requirement cannot be easily specified or tested, (b) the space of configurations is made up of multiple disconnected spaces, thus making it likely that a GA would find sets of configurations that are not connected and (c) the cost of testing for connectivity, while examining each pair of configurations, is prohibitive. The approach has been tested and evaluated on a problem from computational biology, modeling the bones of a snake jaw.","title":"Using a genetic algorithm to optimize the gape of a snake jaw","id":221001480,"url":"https://www.researchgate.net/publication/221001480_Using_a_genetic_algorithm_to_optimize_the_gape_of_a_snake_jaw","names":["Chun Wai Liew"],"references":{"12737730":"Animal movement, mechanical tuning and coupled systems","10987255":"Force transmission via axial tendons in undulating fish: A dynamic analysis","222947257":"A search space toolkit: SST","245434898":"Automated Optimal Design of Two-Dimensional Supersonic Missile Inlets","220450471":"A combined neuronal and mechanical model of fish swimming. Biol Cybern","2749484":"A Search Space Toolkit","3596864":"A search space toolkit: SST","2754972":"Automated Optimization of Two Dimensional High Speed Missile Inlets","13477381":"Self-propelled anguilliform swimming: Simultaneous solution of the two-dimensional Navier-Stokes equations and Newton\u0027s laws of motion","222501755":"A genetic algorithm for continuous design space search","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms"},"citedIn":{"221438997":"Exploration or Convergence? Another Meta-Control Mechanism for GAs.","51113361":"Go Reconfigure: How Fish Change Shape as They Swim and Evolve","4249775":"Using Artificial Organisms To Study The Evolution of Backbones in Fish"},"index":50}