{"abs":"We describe a hybrid and adaptive coevolutionary optimization method that can efficiently solve a wide range of multi-objective optimization problems (MOOPs) as it successfully combines positive traits from three main classes of multi-objective evolutionary algorithms (MOEAs): classical approaches that use Pareto-based selection for survival criteria, approaches that rely on differential evolution, and decomposition-based strategies. A key part of our hybrid evolutionary approach lies in the proposed fitness sharing mechanism that is able to smoothly transfer information between the coevolved subpopulations without negatively impacting the specific evolutionary process behavior that characterizes each subpopulation. The proposed MOEA also features an adaptive allocation of fitness evaluations between the coevolved populations to increase robustness and favor the evolutionary search strategy that proves more successful for solving the MOOP at hand. Apart from the new evolutionary algorithm, this paper also contains the description of a new hypervolume and racing-based methodology aimed at providing practitioners from the field of multi-objective optimization with a simple means of analyzing/reporting the general comparative run-time performance of multi-objective optimization algorithms over large problem sets.","title":"DECMO2: a robust hybrid and adaptive multi-objective evolutionary algorithm","id":262808470,"url":"https://www.researchgate.net/publication/262808470_DECMO2_a_robust_hybrid_and_adaptive_multi-objective_evolutionary_algorithm","names":["Ciprian Zavoianu","Edwin Lughofer","Gerd Bramerdorfer","Wolfgang Amrhein","E.P. Klement","Soft Computing"],"references":{"266476642":"MOEA/D: a multi-objective evolutionary algorithm based on decomposition","216300453":"Evolutionary Algorithms for Solving Multi-Objective Problems SE – Genetic and Evolutionary Computation","3949503":"Scalable multi-objective optimization test problems","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","262914211":"Efficient Multi-Objective Optimization using 2-Population Cooperative Coevolution","216457263":"Lecture Notes in Computer Science","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","224472234":"Performance Assessment of Generalized Differential Evolution 3 with a Given Set of Constrained Multi-Objective Test Problems","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","224208525":"Multiphysic Modeling of a High-Speed Interior Permanent-Magnet Synchronous Machine for a Multiobjective Optimal Design","4201424":"GDE3: The third evolution step of generalized differential evolution","235709918":"Nonlinear Multiobjective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2335418":"A Combined Genetic Adaptive Search (GeneAS) for Engineering Design","220291960":"JMetal: A Java framework for multi-objective optimization","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","216301055":"Essentials of Metaheuristics. Lulu","262914357":"On the Performance of Master-Slave Parallelization Methods for Multi-Objective Evolutionary Algorithms","268889569":"Differential Evolution","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","262914204":"Hybridization of Multi-Objective Evolutionary Algorithms and Artificial Neural Networks for Optimizing the Performance of Electrical Drives","3418509":"Macready, W.G.: No Free Lunch Theorems for Optimization. IEEE Transactions on Evolutionary Computation 1(1), 67-82","222665656":"Zaharie, D.: Influence of crossover on the behavior of differential evolution algorithms. Applied Soft Computing 9, 1126-1138","3418697":"Jaszkiewicz, A.: On the Performance of Multiple-Objective Genetic Local Search on the 0/1 Knapsack Problem - A Comparative Experiment. IEEE Trans. on Evolutionary Computation 6, 402-412","224472028":"The performance of a new version of MOEA/D on CEC09 unconstrained MOP test instances"},"citedIn":{"278022171":"Performance Comparison of Generational and Steady-State Asynchronous Multi-Objective Evolutionary Algorithms for Computationally-Intensive Problems"},"index":500}