{"abs":"A framework for optimization of wideband antennas including statistical reliability considerations is proposed. Using predetermined tolerances of the manufacturing process, the reliability analysis provides a failure probability of the considered antenna according to imposed specifications. In addition, a sensitivity analysis is conducted in order to quantify the relative weight of the antenna’s parameters on the variability of |S11|. On this basis, a reliability-aware definition of optimization parameters can be derived to minimize failure probability during fabrication. For demonstration, a particular type of antenna, namely the tapered half-mode substrate-integrated waveguide (HMSIW) leaky-wave antenna, is chosen for the reliability analysis and optimization. This antenna is optimized for operation in the band from 7 GHz to 14 GHz (with specification |S11| \u003c 􀀀10 dB) with a calculated failure probability of less than 1%. A fabrication of the designed prototype yields measurements showing a strict adherence to specifications, which exemplifies the relevance of the statistical analysis. The study can be generalized to any wideband antenna provided that a fast computation of cost function can be obtained.","title":"Reliability-Aware Optimization of a Wideband Antenna","id":288834294,"url":"https://www.researchgate.net/publication/288834294_Reliability-Aware_Optimization_of_a_Wideband_Antenna","names":["Attibaud Kouassi","Nghia Nguyen Trong","Thomas Kaufmann","Sébastien Lalléchère","Pierre Bonnet","Christophe Fumeaux","IEEE Transactions on Antennas and Propagation"],"references":{"265058957":"Safety assessment of a transmission line with EMC requirements","261170642":"Wideband transition from coaxial line to half-mode substrate integrated waveguide","242025259":"A Wideband Omnidirectional Horizontally Polarized Traveling-Wave Antenna Based on Half-Mode Substrate Integrated Waveguide","260466817":"Full-Wave Analysis and Design of Circular Half-Width Microstrip Leaky-Wave Antennas","265366105":"Determination des distribution dont les marges sont donnees","262771939":"A Semi-Analytical Solution of a Tapered Half-Mode Substrate-Integrated Waveguide With Application to Rapid Antenna Optimization","50996224":"Handbook of Monte Carlo Methods","3480763":"Half width leaky wave antennas","3479843":"Efficient computation of stochastic electromagnetic problems using unscented transforms. IET Sci Meas Technol","270724858":"An Array of Half-Width Microstrip Leaky-Wave Antennas Radiating on Boresight","263047733":"Structural Reliability Methods","224091843":"Electromagnetic Compatibility Uncertainty, Risk, and Margin Management","3130422":"Adjoint Techniques for Sensitivity Analysis in High-Frequency Structure CAD","224563769":"Characterization of the Propagation Properties of the Half-Mode Substrate Integrated Waveguide","258792624":"Microwave Near-Field Focusing Properties of Width-Tapered Microstrip Leaky-Wave Antenna","269167255":"A Stochastic Framework for the Variability Analysis of Textile Antennas","260421028":"An Efficient Technique Based on Polynomial Chaos to Model the Uncertainty in the Resonance Frequency of Textile Antennas Due to Bending","38367467":"Remarks on a multivariate transformation. Ann Math Stat","220401664":"Ellipsoidal Method for Design Centering and Yield Estimation","210222819":"Simulation and the Monte Carlo Method","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","3130710":"Guide-wave and leakage characteristics of substrate integrated waveguide","220024164":"Information Theory and Statistical Mechanics .2.","3185482":"Yield Optimization for Arbitrary Statistical Distributions: Part I-Theory","276916541":"Characterizing Physically Transient Antennas"},"citedIn":{},"index":501}