{"abs":"In this paper, we are applying a hybrid soft computing approach for optimizing the performance of electrical drives where many degrees of freedom are allowed in the variation of design parameters. The hybrid nature of our approach originates from the application of multi-objective evolutionary algorithms (MOEAs) to solve the complex optimization problems combined with the integration of non-linear mappings between design and target parameters. These mappings are based on artificial neural networks (ANNs) and they are used for the fitness evaluation of individuals (design parameter vectors). The mappings substitute very time-intensive finite element simulations during a large part of the optimization run. Empirical results show that this approach finally reduces the computation time for single runs from a few days to several hours while achieving Pareto fronts with a similar high quality.","title":"A Hybrid Soft Computing Approach for Optimizing Design Parametersof Electrical Drives","id":239917589,"url":"https://www.researchgate.net/publication/239917589_A_Hybrid_Soft_Computing_Approach_for_Optimizing_Design_Parametersof_Electrical_Drives","names":["Ciprian Zavoianu","Gerd Bramerdorfer","Edwin Lughofer","Siegfried Silber","Wolfgang Amrhein"],"references":{"220314593":"Multi-objective robust PID controller tuning using two lbests multi-objective particle swarm optimization","224645793":"Combining Model-based and Genetics-based Offspring Generation for Multi-objective Optimization Using a Convergence Criterion","3949503":"Scalable multi-objective optimization test problems","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","265439255":"Neural Networks. A Comprehensive Foundation","216457263":"Lecture Notes in Computer Science","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","224316884":"A study of master-slave approaches to parallelize NSGA-II","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","224208525":"Multiphysic Modeling of a High-Speed Interior Permanent-Magnet Synchronous Machine for a Multiobjective Optimal Design","2333106":"Simulated Binary Crossover for Continuous Search Space","215990408":"The weka data mining software: an update. SIGKDD Explor Newsl","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","222546331":"Kumar, U.A.: Neural networks and statistical techniques: A review of applications. Expert Systems with Applications 36(1), 2-17","220291960":"JMetal: A Java framework for multi-objective optimization","279233597":"Beyond Regression: New Tools for Prediction and Analysis in the Behavioral Science. Thesis (Ph. D.). Appl. Math. Harvard University","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","252056283":"A Review of Recent Developments in Electrical Machine Design Optimization Methods With a Permanent-Magnet Synchronous Motor Benchmark Study","221228592":"On the Effect of the Steady-State Selection Scheme in Multi-Objective Genetic Algorithms","233556491":"Acceleration of the convergence speed of evolutionary algorithms using multi-layer neural networks","3419028":"Particle Swarm Optimization: Basic Concepts, Variants and Applications in Power Systems","222797300":"Multilayer Feedforward Networks are Universal Approxmations Neural Networks 2 No 5, 359-366","4302134":"Ant Colony Optimization for Multi-Objective Optimization Problems","220551640":"Hybrid learning machines"},"citedIn":{"262914357":"On the Performance of Master-Slave Parallelization Methods for Multi-Objective Evolutionary Algorithms","279538359":"Identification of a nonlinear PMSM model using symbolic regression and its application to current optimization scenarios"},"index":502}