{"abs":"The Targeted Random Sampling (TRS) method is extended to moderate-to-high dimensional time invariant reliability analysis. TRS is an adaptive sampling method rooted in stratified sampling variance reduction technique and represents a specific algorithm for Refined Stratified Sampling. In this work, a Markov Chain is used to sample the space densely in the vicinity of the limit stat and multi-dimensional stratum division is proposed along with a neural network based approximation of the performance function. The method is shown to perform efficiently and accurately for estimation of probability of failure for a 20 dimensional problem.","title":"Targeted Random Sampling for Time-invariant Reliability Analysis","id":283235980,"url":"https://www.researchgate.net/publication/283235980_Targeted_Random_Sampling_for_Time-invariant_Reliability_Analysis","names":["Michael Shields","Sundar VS"],"references":{"223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","236660920":"Methods of Structural Safety","210222819":"Simulation and the Monte Carlo Method","267681136":"Stochastic Finite Element Methods and Reliability A State-of-the-Art Report","276211091":"Refined Stratified Sampling for efficient Monte Carlo based uncertainty quantification","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","260498156":"Simulation of Stochastic Processes by Spectral Representation","283075694":"Targeted random sampling: A new approach for efficient reliability estimation for complex systems","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","236660847":"Exact and Invariant Second Moment Code Format","222672830":"Benchmark study on reliability estimation in higher dimensions of structural systems – An overview","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{},"index":503}