{"abs":"Abstract In the following article, we provide an exposition of exact computational methods to perform parameter inference from partially observed network models. In particular, we consider the duplication attachment model that has a likelihood function that typically cannot be evaluated in any reasonable computational time. We consider a number of importance sampling (IS) and sequential Monte Carlo (SMC) methods for approximating the likelihood of the network model for a fixed parameter value. It is well-known that, for IS, the relative variance of the likelihood estimate typically grows at an exponential rate in the time parameter (here this is associated with the size of the network); we prove that, under assumptions, the SMC method will have relative variance that can grow only polynomially. In order to perform parameter estimation, we develop particle Markov chain Monte Carlo algorithms to perform Bayesian inference. Such algorithms use the aforementioned SMC algorithms within the transition dynamics. The approaches are illustrated numerically.","title":"Computational Methods for a Class of Network Models","id":258062774,"url":"https://www.researchgate.net/publication/258062774_Computational_Methods_for_a_Class_of_Network_Models","names":["Junshan Wang","Ajay Jasra","Maria De Iorio","Journal of computational biology: a journal of computational molecular cell biology"],"references":{"51932281":"Linear Variance Bounds for Particle Approximations of Time-Homogeneous Feynman-Kac Formulae","7097838":"A likelihood approach to analysis of network data","227522317":"Particle Markov Chain Monte Carlo . . .","268209561":"M Carlo Statistical Methods","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","228623464":"A Tutorial on Particle Filtering and Smoothing: Fifteen Years Later","50425579":"On the Stability of Sequential Monte Carlo Methods in High Dimensions","220461774":"Adaptive importance sampling for network growth models","232062873":"Efficient implementation of Markov chain Monte Carlo when using an unbiased likelihood estimator","240241982":"Simulating Probability Distributions in the Coalescent","29607955":"On Adaptive Resampling Procedures for Sequential Monte Carlo Methods","46587412":"The Time Machine: A Simulation Approach for Stochastic Trees","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","228613972":"Efficient Block Sampling Strategies for Sequential Monte Carlo Methods","221668291":"On adaptive resampling strategies for sequential Monte Carlo methods","35261007":"Sequential Monte Carlo methods in filter theory /","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","248395314":"Path storage in the particle filter","1924769":"Sharp failure rates for the bootstrap particle filter in high dimensions","4993330":"Sequential Monte Carlo Samplers","47733478":"Efficient Bayesian Inference for Switching State-Space Models using Discrete Particle Markov Chain Monte Carlo Methods"},"citedIn":{"274730386":"Bayesian Inference for Duplication-Mutation with Complementarity Network Models","269417068":"A Stable Particle Filter in High-Dimensions","289367110":"Monte Carlo algorithms for computing $$\\alpha $$ α -permanents","225045394":"A Bayesian Mixture of Lasso Regressions with t-Errors","248395314":"Path storage in the particle filter"},"index":504}