{"abs":"In this note we introduce an estimate for the marginal likelihood associated to hidden Markov models (HMMs) using sequential Monte Carlo (SMC) approximations of the generalized two-filter smoothing decomposition (Briers, 2010). This estimate is shown to be unbiased and a central limit theorem (CLT) is established. This latter CLT also allows one to prove a CLT associated to estimates of expectations w.r.t. a marginal of the joint smoothing distribution; these form some of the first theoretical results associated to the SMC approximation of the generalized two-filter smoothing decomposition. The new estimate and its application is investigated from a numerical perspective.","title":"Marginal Likelihood Computation for Hidden Markov Models via GeneralizedTwo-Filter Smoothing","id":230779504,"url":"https://www.researchgate.net/publication/230779504_Marginal_Likelihood_Computation_for_Hidden_Markov_Models_via_GeneralizedTwo-Filter_Smoothing","names":["Adam Persing","Ajay Jasra","Statistics [?] Probability Letters"],"references":{"51932281":"Linear Variance Bounds for Particle Approximations of Time-Homogeneous Feynman-Kac Formulae","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","227522317":"Particle Markov Chain Monte Carlo . . .","227464410":"A sequential smoothing algorithm with linear computational cost","29597157":"A Backward Particle Interpretation of Feynman-Kac Formulae","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","24168855":"On the Forward Filtering Backward Smoothing particle approximations of the smoothing distribution in general state spaces models","236853542":"Inference in Hidden Markov Models","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","225535085":"Smoothing algorithms for state–space models","245321282":"Two-filter formulae for discrete-time non-linear bayesian smoothing"},"citedIn":{"260757081":"Double Markov Process Blind estimation: Application to communication in a long memory channel","265687011":"Theory of Parallel Particle Filters for Hidden Markov Models"},"index":506}