{"abs":"In this paper, we introduce a computer-based method for menu planning, which applies evolutionary computation. First, we formalize the n-day menu-planning problem, decomposing it into several sub-problems at the daily-menu and meal-planning level. We reduce the problem to a multi-dimensional knapsack problem. Then, we define an evolutionary algorithm that quickly finds a diverse set of feasible solutions (i.e. optimal menus) with the optimum objective functions’ values, without examining all the possibilities. As the problem is constrained, infeasible solutions need to be repaired in order to direct the “evolution” towards the feasible regions. We present greedy repairing methods that slightly differ at the global level and the sub-problems’ levels. At the meal-planning level, we couple repairing with linear programming to balance infeasible meals. We conclude the paper with the presentation of empirical results, which showed that the evolutionary method may outperform a human. A computer was able to find the Pareto-optimal front of 21-day menus with respect to a dietary advice in equal or less time than a human professional, who designed a daily menu. However, the human factor is still important in the last stage, when a solution has to be selected from the Pareto front.","title":"Computer-based dietary menu planning","id":238381912,"url":"https://www.researchgate.net/publication/238381912_Computer-based_dietary_menu_planning","names":["Barbara Koroušić Seljak","Journal of Food Composition and Analysis"],"references":{"200621973":"Artificial Intelligence through Simulated Evolution, Wiley, New York","17128069":"Menu planning by computer: The random approach","221228551":"Comparison Between Lamarckian and Baldwinian Repair on Multiobjective 0/1 Knapsack Problems","220419818":"Menu planning by computer","220106135":"Using Stigmergy to Solve Numerical Optimization Problems.","220739555":"A comparison of GAs using penalizing infeasible solutions and repairing infeasible solutions on restrictive capacity knapsack problem","226952778":"Beasley, J.E.: A Genetic Algorithm for the Multidimensional Knapsack Problem. Journal of Heuristics 4, 63-86","11544894":"Linear and nonlinear programming to optimize the nutrient density of a population\u0027s diet: An example based on diets of preschool children in rural Malawi","228057735":"Computers and Intractability: A Guide to NP-Completeness","216300725":"Lecture Notes in Computer Science","27524752":"Problem solving in open worlds: a case study in design","240114140":"Menu planning system for a large catering corporation","265696290":"On the complexity of linear programming","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","30873058":"Genetic + Data Structures \u003d Evolution Programs","15338175":"Problems Encountered in Meeting the Recommended Dietary Allowances for Menus Designed According to the Dietary Guidelines for Americans","220695890":"Computers and Intractability, A Guide To The Theory of NP-Completeness","35533227":"Automated menu planning /","228560680":"Integrating Case‐Based and Rule‐Based Reasoning to Meet Multiple Design Constraints","223615660":"Solving inverse initial-value, boundary-value problems via genetic algorithm","281069850":"Menu planning by computer","228854616":"Evolutionary Balancing of Healthy Meals","220742263":"Self-adaptive simulated binary crossover for real-parameter optimization"},"citedIn":{"272042036":"Application of a Menu-Planning Template As a Tool for Promoting Healthy Preadolescent Diets","267697047":"Computer-generated vegan menus: The importance of food composition database choice","234954855":"Feasibility of Integrated Menu Recommendation and Self‐Order System for Small‐Scale Restaurants","236250130":"The Slovenian food composition database","3568606":"A team oriented approach to department organization in the microelectronics industry","248580184":"7th International Food Data Conference: Food composition and biodiversity","224241334":"Developing an expert system for diet recommendation","220118901":"Guided restarting local search for production planning","261051620":"An extension of menu planning algorithm for two-phase homemade cooking","224253585":"A Proposal of a Menu Planning Algorithm for Two-phase Cooking by Busy Persons","221020866":"Computer-Based Dietary Menu Planning: How to Support It by Complex Knowledge?","262282541":"Production scheduling with a memetic algorithm","236250139":"Food composition databases for effective quality nutritional care","264816158":"MatPort - Online mathematics learning with a bioinspired decision-making system","47661729":"Web-based eHealth applications with reference to food composition data","261452514":"Particle Swarm Optimization-based method for generating healthy lifestyle recommendations","264584093":"Comparison of Paper- and Web-Based Dietary Records: A Pilot Study","275155070":"Nutritional Menu Planning: A Hybrid Approach and Preliminary Tests","221130452":"Mathport - Web Application to Support Enhancement in Elementary Mathematics Pedagogy.","273767530":"Comparison of a web-based dietary assessment tool with software for the evaluation of dietary records","236628198":"Application of memetic algorithm in production planning","51116340":"The use of summary statistics for sample size allocation for food composition surveys and an application to the potato group","259936705":"Characterisation of Knowledge Incorporation into Solution Models for the Meal Planning Problem"},"index":507}