{"abs":"This article provides a new theory for the analysis of forward and backward particle approximations of Feynman-Kac models. Such formulae are found in a wide variety of applications and their numerical (particle) approximation are required due to their intractability. Under mild assumptions, we provide sharp and non-asymptotic first order expansions of these particle methods, potentially on path space and for possibly unbounded functions. These expansions allows one to consider upper and lower bound bias type estimates for a given time horizon $n$ and particle number $N$; these non-asymptotic estimates are of order $\\mathcal{O}(n/N)$. Our approach is extended to tensor products of particle density profiles, leading to new sharp and non-asymptotic propagation of chaos estimates. The resulting upper and lower bound propagation of chaos estimates seems to be the first result of this kind for mean field particle models. As a by-product of our results, we also provide some analysis of the particle Gibbs sampler, providing first order expansions of the kernel and minorization estimates.","title":"A Sharp First Order Analysis of Feynman-Kac Particle Models","id":268391801,"url":"https://www.researchgate.net/publication/268391801_A_Sharp_First_Order_Analysis_of_Feynman-Kac_Particle_Models","names":["Hock Peng Chan","Pierre Del Moral","Ajay Jasra"],"references":{"259572152":"Uniform Ergodicity of the Particle Gibbs Sampler","227522317":"Particle Markov Chain Monte Carlo . . .","2129637":"Coalescent tree based functional representations for some Feynman-Kac particle models","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","259346940":"A general theory of particle filters in hidden Markov models and some applications","221664028":"Sequential Monte Carlo smoothing for general state space hidden Markov\nmodels","240637660":"Quantum Monte Carlo simulations of fermions. A mathematical analysis of the xed-no de approximation","234000706":"An introduction to particle methods in finance","259441094":"Uniform Ergodicity of the Iterated Conditional SMC and Geometric Ergodicity of Particle Gibbs samplers","227285820":"A pedagogical introduction to Quantum Monte-Carlo","200744518":"Sequential Monte-Carlo Methods in Practice","266991325":"Free Energy Computations: A Mathematical Perspective","222687664":"Computation of free energy differences through nonequilibrium stochastic dynamics: The reaction coordinate case","236853542":"Inference in Hidden Markov Models","228721976":"Limit theorems for weighted samples with applications to Sequential Monte Carlo Methods","45847137":"Diffusion Monte Carlo method: Numerical Analysis in a Simple Case","247033028":"On the Control of an Interacting Particle Approximation of Schr?odinger Groundstates","233810033":"Feynman-Kac Particle Integration with Geometric Interacting Jumps"},"citedIn":{"284900779":"An island particle algorithm for rare event analysis","274196694":"A duality formula for Feynman–Kac path particle models"},"index":510}