{"abs":"In the last two decades, multi-objective evolutionary algorithms (MOEAs) have become ever more used in scientific and industrial decision support and decision making contexts the require an a posteriori articulation of preference. The present work is focused on a comparative analysis of the performance of two master–slave parallelization (MSP) methods, the canonical generational scheme and the steady-state asynchronous scheme. Both can be used to improve the convergence speed of multi-objective evolutionary algorithms that must use computationally-intensive fitness evaluation functions. Both previous and present experiments show that a correct choice for one or the other parallelization method can lead to substantial improvements with regard to the overall duration of the optimization process.Our main aim is to provide practitioners of MOEAs with a simple but effective method of deciding which MSP option is better given the particularities of the concrete optimization process. This in turn, would give the decision maker more time for articulating preferences (i.e., more flexibility). Our analysis is performed based on 15 well-known MOOP benchmark problems and two simulation-based industrial optimization process from the field of electrical drive design. For the first industrial MOOP, when comparing with a preliminary study, applying the steady-state asynchronous MSP enables us to achieve an overall speedup (in terms of total wall-clock computation time) of ≈25%. For the second industrial MOOP, applying the steady-state MSP produces an improvement of ≈12%. We focus our study on two of the best known and most widely used MOEAs: the Non-dominated Sorting Genetic Algorithm II (NSGA-II) and the Strength Pareto Evolutionary Algorithm (SPEA2).","title":"Performance Comparison of Generational and Steady-State Asynchronous Multi-Objective Evolutionary Algorithms for Computationally-Intensive Problems","id":278022171,"url":"https://www.researchgate.net/publication/278022171_Performance_Comparison_of_Generational_and_Steady-State_Asynchronous_Multi-Objective_Evolutionary_Algorithms_for_Computationally-Intensive_Problems","names":["Ciprian Zavoianu","Edwin Lughofer","Werner Koppelstaetter","Günther Weidenholzer","Wolfgang Amrhein","E.P. Klement","Knowledge-Based Systems"],"references":{"266476642":"MOEA/D: a multi-objective evolutionary algorithm based on decomposition","216300453":"Evolutionary Algorithms for Solving Multi-Objective Problems SE – Genetic and Evolutionary Computation","3949503":"Scalable multi-objective optimization test problems","221228524":"DEMO: Differential Evolution for Multiobjective Optimization","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","216457263":"Lecture Notes in Computer Science","224316884":"A study of master-slave approaches to parallelize NSGA-II","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","4201424":"GDE3: The third evolution step of generalized differential evolution","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","220291960":"JMetal: A Java framework for multi-objective optimization","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","262914357":"On the Performance of Master-Slave Parallelization Methods for Multi-Objective Evolutionary Algorithms","221228592":"On the Effect of the Steady-State Selection Scheme in Multi-Objective Genetic Algorithms","2460803":"Normal-Boundary Intersection: A New Method for Generating the Pareto Surface in Nonlinear Multicriteria Optimization Problems","2782915":"A Variant of Evolution Strategies for Vector Optimization","280025628":"Understanding Simple Asynchronous Evolutionary Algorithms","262914204":"Hybridization of Multi-Objective Evolutionary Algorithms and Artificial Neural Networks for Optimizing the Performance of Electrical Drives","220105513":"Distributed computing in practice: the condor experience. Concurr Pract Exp 17(2-4):323-356","243785982":"Distributed computing in practice: The Condor experience","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","262808470":"DECMO2: a robust hybrid and adaptive multi-objective evolutionary algorithm"},"citedIn":{},"index":513}