{"abs":"Studying failure scenarios allows one to gain insights into their cause and consequence, providing information for effective mitigation, contingency planning and improving system resilience. A new efficient algorithm is here proposed to solve applications where an expensive-to-evaluate computer model is involved. The algorithms allows to generate the conditional samples for the Subset simulation by representing each random variable by an arbitrary number of hidden variables. The resulting algorithm is very simple yet powerful and it does not required the use of the Markov Chain Monte Carlo method. The proposed algorithm has been implemented in a open source general purpose software, OpenCossan allowing the solution of large scale problems of industrial interest by taking advantages of High Performance Computing facilities. The applicability and flexibility of the proposed approach is shown by solving a number of different problems.","title":"Efficient Monte Carlo Algorithm For Rare Failure Event Simulation","id":280224186,"url":"https://www.researchgate.net/publication/280224186_Efficient_Monte_Carlo_Algorithm_For_Rare_Failure_Event_Simulation","names":["Edoardo Patelli","Siu-Kui Au"],"references":{"269191450":"Estimation of the Lower and Upper Probabilities of Failure Using Random Sets and Subset Simulation","259483221":"Parallel Markov Chain Monte Carlo","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","261880463":"Approximate Bayesian Computation by Subset Simulation","242246486":"Parallel Processing in Structural Reliability","263732354":"OpenCossan: An Efficient Open Tool for Dealing with Epistemic and Aleatory Uncertainties","264177701":"Efficient Monte Carlo simulation procedures in structural uncertainty and reliability analysis - recent advances","257021930":"General purpose software for efficient uncertainty management of large finite element models","215446267":"Monte Carlo Strategies in Scientic Computing","5710491":"The Monte Carlo method","245286947":"Approximate Reliability-Based Optimization Using a Three-Step Approach Based on Subset Simulation","221985142":"An efficient computational scheme to calculate structural failure probabilities. Probabilistic Engineering Mechanics 4(1):10-18"},"citedIn":{"281863842":"Line sampling approach for extreme case analysis in presence of aleatory and epistemic uncertainties"},"index":516}