{"abs":"The use of evolutionary algorithms (EA s) for solving multiobjective optimization problems has been very active in the last few years. The main reasons for this popularity are their ease of use with respect to classical mathematical programming techniques, their scalability, and their suitability for finding trade-off solutions in a single run. However, these algorithms may be computationally expensive because (1) many real-world optimization problems typically involve tasks demanding high computational resources and (2) they are aimed at finding a whole front of optimal solutions instead of searching for a single optimum. Parallelizing EAs emerges as a possible way of reducing the CPU time down to affordable values, but it also allows researchers to use an advanced search engine – the parallel model – that provides the algorithms with an improved population diversity and enable them to cooperate with other (eventually nonevolutionary) techniques. The goal of this chapter is to provide the reader with an up-to-date review of the recent literature on parallel EAs for multiobjective optimization.","title":"Parallel Multiobjective Evolutionary Algorithms","id":283804158,"url":"https://www.researchgate.net/publication/283804158_Parallel_Multiobjective_Evolutionary_Algorithms","names":["Francisco Luna","Enrique Alba"],"references":{"288810035":"Parallel computing model for time-varied coordinated voltage/reactive power control","220846508":"Parallel multi-objective genetic algorithms for associative classification rule mining","225747324":"An improved hybrid multi-objective parallel genetic algorithm for hybrid flow shop scheduling with unrelated parallel machines","220701870":"pMODE-LD+SS: An Effective and Efficient Parallel Differential Evolution Algorithm for Multi-Objective Optimization","225433316":"Parallel and Distributed Optimization of Dynamic Data Structures for Multimedia Embedded Systems","220381225":"A review of multiobjective test problems and a scalable test problem toolkit.","224472045":"Many-objective Reconfiguration of Operational Satellite Constellations with the Large-Cluster Epsilon Non-dominated Sorting Genetic Algorithm-II","256918493":"Robust design optimisation using multi-objective evolutionary algorithms. Comput Fluids","224116054":"A Study of Multiobjective Metaheuristics When Solving Parameter Scalable Problems","227320322":"Continuous and discrete time Zhang dynamics for time-varying 4th root finding","221392803":"Parallel Library of Multi-objective Evolutionary Algorithms","281049682":"On Using Populations of Sets in Multiobjective Optimization","224225486":"Efficient Hybrid-Game Strategies Coupled to Evolutionary Algorithms for Robust Multidisciplinary Design Optimization in Aerospace Engineering","223778499":"Robust evolutionary algorithms for UAV/UCAV aerodynamic and RCS design optimisation","220618929":"DEMCMC-GPU: an efficient multi-objective optimization method with GPU acceleration on the Fermi architecture. New Gener Comput","224472313":"Effects of Using Two Neighborhood Structures on the Performance of Cellular Evolutionary Algorithms for Many-Objective Optimization","43274508":"A hybrid genetic algorithm for multiobjective problems with activity analysis-based local search","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","46888786":"Single- and Multi-Objective Cooperation for the Flexible Docking Problem","225592552":"Robust multidisciplinary UAS design optimisation","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","229748783":"Parallel Heterogeneous Metaheuristics","224330048":"Towards Generating Diverse Topologies of Path Tracing Compliant Mechanisms Using A Local Search Based Multi-Objective Genetic Algorithm Procedure","220176063":"Implementation of cellular genetic algorithms with two neighborhood structures for single-objective and multi-objective optimization","237670923":"Parallel Evolutionary Multi-Objective Optimization on Large, Heterogeneous Clusters: An Applications Perspective","223934585":"An evolutionary algorithm for the vehicle routing problem with route balancing","228341949":"A cellular genetic algorithm for multiobjective optimization","224177791":"Combining multiobjective and single-objective genetic algorithms in heterogeneous island model","220701955":"Solving Three-Objective Optimization Problems Using a New Hybrid Cellular Genetic Algorithm.","265587315":"Parallel genetic algorithms. Theory and real world applications","232380656":"Hybrid-Game Strategies for multi-objective design optimization in engineering","220291470":"Parallelism on multicore processors using Parallel.FX","226064331":"Parallel Evolutionary Multiobjective Optimization","216300369":"Parallelizing Multi-Objective Evolutionary Algorithms: Cone Separation","222073482":"A single front genetic algorithm for parallel multi-objective optimization in dynamic environments","3421955":"Grid Implementation of a Parallel Multiobjective Genetic Algorithm for Optimized Allocation of Chlorination Stations in Drinking Water Distribution Systems: Chojnice Case Study","220665104":"Internal combustion engine control for series hybrid electric vehicles by parallel and distributed genetic programming/multiobjective genetic algorithms","220743056":"Parallel hyperheuristic: a self-adaptive island-based model for multi-objective optimization","224247009":"Effective ranking + speciation \u003d Many-objective optimization","220948245":"Parallel Hypervolume-Guided Hyperheuristic for Adapting the Multi-objective Evolutionary Island Model","201977143":"Strategies for the Parallel Implementation of Metaheuristics","220160417":"Metco: a Parallel Plugin-Based Framework for Multi-Objective Optimization.","229764337":"Parallel Metaheuristics: A New Class of Algorithms","223417107":"Optimum design of externally pressurized air bearing using Cluster OpenMP","256212231":"Rough set","224177823":"A parallel framework for multi-objective evolutionary optimization","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","221608816":"Distribution of Computational Effort in Parallel MOEA/D","227655361":"Convergence speed in multi‐objective metaheuristics: Efficiency criteria and empirical study","220358256":"Comparison of parallel multi-objective approaches to protein structure prediction","221582951":"Hyperheuristics for a Dynamic-Mapped Multi-Objective Island-Based Model","234127014":"Multilayered composite structure design optimisation using distributed/parallel multi-objective evolutionary algorithms","245425907":"Optimal Morphing-Wing Design Using Parallel Nondominated Sorting Genetic Algorithm II","245283915":"Optimization Research: Enhancing the Robustness of Large-Scale Multiobjective Optimization in Construction","226376359":"Evolutionary Optimisation Methods with Uncertainty for Modern Multidisciplinary Design in Aeronautical Engineering","47363336":"Mono and multi-objective optimization techniques applied to a large range of industrial test cases using Metamodel assisted Evolutionary Algorithms","273974708":"Active Transonic Aerofoil Design Optimization Using Robust Multiobjective Evolutionary Algorithms","224333502":"Optimizing the Configuration of a Broadcast Protocol through Parallel Cooperation of Multi-objective Evolutionary Algorithms","220881999":"Examination of multi-objective Genetic Algorithm using the concept of a Peer-to-Peer network","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","224177979":"Double Shock Control Bump design optimization using hybridised evolutionary algorithms","221020747":"On the Comparison of Parallel Island-Based Models for the Multiobjectivised Antenna Positioning Problem.","239578400":"Using MPI: Portable Parallel Programming with the Message-Passing Interface 2nd Edition","257196223":"A Parallel Multiple Reference Point Approach for Multi-objective Optimization","225398531":"A Parallel Evolutionary Algorithm to Optimize Dynamic Data Types in Embedded Systems","220866887":"Parallel Multi-Objective Approaches for Inferring Phylogenies","220381133":"Considerations in engineering parallel multiobjective evolutionary algorithms.","225885977":"Approaching Dynamic Multi-Objective Optimization Problems by Using Parallel Evolutionary Algorithms","239392299":"Aerodynamic Optimization Using a Parallel Asynchronous Evolutionary Algorithm Controlled by Strongly Interacting Demes","221204575":"A parallel multi-objective Ab initio approach for protein structure prediction","225608963":"Optimization of sonic crystal attenuation properties by ev-MOGA multiobjective evolutionary algorithm","228932692":"GPU-accelerated differential evolutionary Markov Chain Monte Carlo method for multi-objective optimization over continuous space. In: BADS’10 Proceedings of the 2nd workshop on Bio-inspired algorithms for distributed systems","221228382":"Parallelization of Multi-objective Evolutionary Algorithms Using Clustering Algorithms","4370736":"Parallel Multi-objective GA Based Rotamer Optimization on Grid","222544049":"Response Surface Approximation of Pareto Optimal Front in Multi-objective Optimization","221608774":"A Parallel Multi-Objective Evolutionary Algorithm for Phylogenetic Inference","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","221228378":"Optimizing the DFCN Broadcast Protocol with a Parallel Cooperative Strategy of Multi-Objective Evolutionary Algorithms","221616463":"Optimal Viable Path Search for a Cheese Ripening Process using a Multi-objective EA.","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","280735301":"Parallelizing Multi-objective Evolutionary Genetic Algorithms","224151587":"A Selective Migration Parallel Multi-objective Genetic Algorithm"},"citedIn":{},"index":517}