{"abs":"Although importance sampling is an established and effective sampling and estimation technique, it becomes unstable and unreliable for high-dimensional problems. The main reason is that the likelihood ratio in the importance sampling estimator degenerates when the dimension of the problem becomes large. Various remedies to this problem have been suggested, including heuristics such as resampling. Even so, the consensus is that for large-dimensional problems, likelihood ratios (and hence importance sampling) should be avoided. In this paper we introduce a new adaptive simulation approach that does away with likelihood ratios, while retaining the multi-level approach of the cross-entropy method. Like the latter, the method can be used for rare-event probability estimation, optimization, and counting. Moreover, the method allows one to sample exactly from the target distribution rather than asymptotically as in Markov chain Monte Carlo. Numerical examples demonstrate the effectiveness of the method for a variety of applications.","title":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","id":225469492,"url":"https://www.researchgate.net/publication/225469492_An_Efficient_Algorithm_for_Rare-event_Probability_Estimation_Combinatorial_Optimization_and_Counting","names":["Zdravko I. Botev","Dirk P. Kroese","Methodology And Computing In Applied Probability"],"references":{"242328432":"RESTART: A method for accelerating rare event simulations","3152250":"Quick estimation of rare events in stochastic networks","226538122":"A Stochastic Minimum Cross-Entropy Method for Combinatorial Optimization and Rare-event Estimation*","242386046":"Estimation of Particle Transmission by Random Sampling","263381984":"How to Deal with the Curse of Dimensionality of Likelihood Ratios in Monte Carlo Simulation","258187760":"Generalized Cross-entropy Methods with Applications to Rare-event Simulation and Optimization","43471748":"Nonparametric Density Estimation via Diffusion Mixing","41222435":"Monte Carlo Statistical Method","225304570":"Non-Uniform Random Variate Generation","225551595":"The Cross-Entropy Method for Continuous Multi-Extremal Optimization","265815481":"An Introduction to Rare Event Simulation","210222819":"Simulation and the Monte Carlo Method","224839810":"An Introduction to the Boot-Strap","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","220049076":"An Introduction To The Bootstrap","225694233":"How Many Needles are in a Haystack, or How to Solve #P-Complete Counting Problems Fast","225579612":"Semi-Iterative Minimum Cross-Entropy Algorithms for Rare-Events, Counting, Combinatorial and Integer Programming","2484042":"The Cross-Entropy Method for Combinatorial and Continuous Optimization","200744518":"Sequential Monte-Carlo Methods in Practice","43475168":"Three examples of a Practical Exact Markov Chain Sampling","45622656":"Monte Carlo Statistical Methods","226405955":"Two-Stage Nested Partitions Method for Stochastic Optimization","220345500":"Exact sampling with couple Markov chains and applications to statistical mechanics","3885893":"Introduction to simulation","252344245":"Three Examples of Monte-Carlo Markov Chains: At the Interface Between Statistical Computing, Computer Science, and Statistical Mechanics"},"citedIn":{"225392942":"A combined splitting—cross entropy method for rare-event probability estimation of queueing networks","220462560":"A hybrid simulation-optimization algorithm for the Hamiltonian cycle problem. Annals of Operations Research","276922885":"Layered Adaptive Importance Sampling","265127940":"Fluctuation Analysis of Adaptive Multilevel Splitting","234078458":"OCCASION: a new Planning Tool for Optimal Climate Change Adaption Strategies in Irrigation","29601545":"Rare event simulation for a static distribution","264854211":"Combinatorial analysis of the adaptive last particle method","224366100":"Randomized methods for solving the Winner Determination Problem in combinatorial auctions","279808481":"Rare Event Simulation and Splitting for Discontinuous Random Variables","277004303":"An Adaptive Population Importance Sampler: Learning From Uncertainty","275167977":"Some Recent Results in Rare Event Estimation","273401497":"Markov chain splitting methods in structural reliability integral estimation","282963214":"Stochastic Enumeration Method for Counting Trees","274455951":"Pilot symbol assisted channel estimation for OFDM-based cognitive radio systems","266943935":"A survey of rare event simulation methods for static input-output models","259162661":"Rare event simulation of non-Markovian queueing networks using RESTART method","261190025":"A control based on a knapsack problem for solar hydrogen production","220399354":"Hierarchical Cross-Entropy Optimization for Fast On-Chip Decap Budgeting","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","269298519":"A generalized coverage-preserving scheduling in WSNs: A case study in structural health monitoring","280310254":"Estimating the small failure probability of a nuclear passive safety system by means of an efficient Adaptive Metamodel-Based Subset Importance Sampling method","233065791":"On the Use of Smoothing to Improve the Performance of the Splitting Method","258082621":"Efficient and Robust Allocation Algorithms in Clouds under Memory Constraints","226907993":"Entropy and Cloning Methods for Combinatorial Optimization, Sampling and Counting Using the Gibbs Sampler","232062731":"A Stochastic Optimization Method for Partially Decomposable Problems, with Applications to Analysis of NMR Spectra","50908649":"Counting with Combined Splitting and Capture-Recapture Methods","284750937":"Rare event simulation and spliting for discontinuous random variables","51892081":"Splitting method for spatio-temporal search efforts planning","220538627":"MCDB-R: Risk analysis in the database","231964667":"How to generate uniform samples on discrete sets using the splitting method","257665458":"Stochastic approximation Monte Carlo importance sampling for approximating exact conditional probabilities","236652465":"Entropy from State Probabilities: Hydration Entropy of Cations","267041025":"A Combinatorial Optimization Problem to Control a Solar Reactor","226031060":"Sequential Monte Carlo for rare event estimation","220813380":"Investigations of Continual Computation.","220505099":"The Splitting Method for Decision Making","226592753":"The Gibbs Cloner for Combinatorial Optimization, Counting and Sampling","262160020":"Splitting Method for Spatio-temporal Sensors Deployment in Underwater Systems","251300174":"Stochastic Enumeration Method for Counting NP-Hard Problems","43510688":"Splitting Methods for Efficient Combinatorial Counting and Rare-Event Probability Estimation","43526433":"Rare-event probability estimation with conditional Monte Carlo","225130001":"Randomized Algorithms with Splitting: Why the Classic Randomized Algorithms Do Not Work and How to Make them Work","270979226":"A novel adaptive importance sampling algorithm based on Markov chain and low-discrepancy sequence","45895681":"A Monte Carlo Algorithm for Universally Optimal Bayesian Sequence Prediction and Planning","228312742":"Variance Reduction Techniques in Monte Carlo Methods"},"index":52}