{"abs":"There is a growing interest in inverse initial-value, boundary-value (inverse IVBV) problems, and in the development of robust, computationally efficient methods suitable for their solution. Inverse problems are prominent in science and engineering where often an effect is measured and the cause is not known; scientists and engineers observe the response of a system and desire to know the particulars of the system that elicited such a response. IVBV problems result when the equations that govern the behavior of a system are partial differential equations (wave phenomena, diffusion, potential of all kinds, etc.). Thus, inverse IVBV problems stem from systems governed by partial differential equations in which a response has been measured and a characteristic of the system must be computed. In this paper, an approach to solving inverse IVBV problems is presented in which the stated problem is transformed into a nonlinear optimization problem which is then solved using a genetic algorithm. Results are presented demonstrating the effectiveness of this approach for solving inverse problems that result from systems governed by three specific partial differential (1) the heat equation, (2) the wave equation, and (3) Poisson’s equation.","title":"Solving inverse initial-value, boundary-value problems via genetic algorithm","id":223615660,"url":"https://www.researchgate.net/publication/223615660_Solving_inverse_initial-value_boundary-value_problems_via_genetic_algorithm","names":["Charles L. Karr","Igor Yakushin","Keith Nicolosi","Engineering Applications of Artificial Intelligence"],"references":{"261001961":"Numerical Recipes in C—The Art of Scientific Computing","267071635":"An Introduction to the Mathematical Theory of Inverse Problems","201976647":"Modeling Simple Genetic Algorithms"},"citedIn":{"228839267":"Combining Legendre\u0027s Polynomials and Genetic Algorithm in the Solution of Nonlinear Initial-Value Problems","236970782":"Bat Algorithm for Topology Optimization in Microelectronic Applications","258379559":"Identification of the heat transfer coefficient in phase change problems","263287728":"Two-Step Genetic Algorithm to Solve the In- verse Problem in Electrocardiography for Cardiac Sources","224172767":"Research on identification of coal and waste rock based on PCA and GA-ANN","222189181":"An artificial intelligence approach to the efficiency improvement of a universal motor","245324376":"Identification of the Cooling Condition in 2-D and 3-D Continuous Casting Processes","3931696":"Evolutionary optimization of a universal motor","228743849":"Identification of interfacial parameters in a particle reinforced metal matrix composite A16061-10%A12O3 by hybrid method and genetic algorithm","256913758":"Thermal analysis of washer-on-disk wear test by micro-genetic algorithm","245314382":"Solving the inverse Stefan design problem using genetic algorithms","225125368":"An approach to parameters estimation of a chromatography model using a clustering genetic algorithm based inverse model","240631234":"Short communication Optimizing cardiac material parameters with a genetic algorithm","242286565":"EDITORIAL BOARDS, PUBLISHING COUNCIL","285368600":"Engineering Optimization","267782186":"Genetic Algorithm Coupled with the Neural Network for Fatigue Properties of Welding Joints Predicting","278679292":"Application of Genetic Algorithm in Numerical Solution of Two-dimensional Laplace\u0027s Equation","259875868":"Determination of Optimal Parameters for the Immune Algorithm Used for Solving Inverse Heat Conduction Problems with and without a~Phase Change","223233706":"The solutions of vibration control problems using artificial neural networks","228894016":"Electrical engineering design with an evolutionary approach","6739982":"Optimizing cardiac material parameters with a genetic algorithm","259603793":"Engineering Optimization—An Introduction with Metaheuristic Applications. Wiley, New York","262321034":"Cuckoo search for inverse problems and simulated-driven shape optimization","257392381":"Estimating soil thermal properties from sequences of land surface temperature using hybrid Genetic Algorithm–Finite Difference method","238710609":"An inverse problem solution based on genetic algorithms for chromatography with variants in adsorbent geometry","225757023":"An automatic spring-back compensation method in die design based on a genetic algorithm","238381912":"Computer-based dietary menu planning","285368687":"Engineering Optimization","3218143":"Universal motor efficiency improvement using evolutionary optimization","227528417":"Evolutionary optimization techniques as versatile solvers for hard‐to‐converge problems in computational fluid dynamics","221920456":"Assessment of Various Methods in Solving Inverse Heat Conduction Problems","250329821":"Forecasting of the Fatigue Life of Metal Weld Joints Based on Combined Genetic Neural Network","234930999":"An Automatic Spring‐back Compensation Die Design Method Based on Genetic Algorithm and Isotropic‐Kinematic Hardening Laws","258385374":"Error Upper Bounds for a Computational Method for Nonlinear Boundary and Initial-Value Problems","3916162":"Improving the technical quality of a universal motor using an evolutionary approach","224646297":"Dietary Menu Planning Using an Evolutionary Method","220055334":"Automatic large-scale integrated circuit synthesis using allocation-based scheduling algorithm","228854616":"Evolutionary Balancing of Healthy Meals","288315987":"Cuckoo Search for Inverse Problems and Topology Optimization","6780377":"Biomechanics of the cardiovascular system: The aorta as an illustratory example","225967241":"A comparative study of genetic algorithm parameters for the inverse problem-based fault diagnosis of liquid rocket propulsion systems"},"index":522}