{"abs":"This article describes a two stage Reliability-Based Design Optimization (RBDO) algorithm. The first stage consists of solving an approximated RBDO problem using meta-models. In order to use gradient-based techniques, the sensitivity of failure probabilities are derived with respect to hyper-parameters of random variables as well as, and this is a novelty, deterministic variables. The second stage focuses on the local refinement of the meta-models around the first stage solution using generalized \" max-min \" samples. The approach is demonstrated on three examples including a crashworthiness problem with 11 random variables and 10 probabilistic constraints.","title":"A Sampling-based RBDO Algorithm with Local Refinement and Efficient Gradient Estimation","id":280105735,"url":"https://www.researchgate.net/publication/280105735_A_Sampling-based_RBDO_Algorithm_with_Local_Refinement_and_Efficient_Gradient_Estimation","names":["Sylvain Lacaze","Samy Missoum","Loïc Brevault","Mathieu Balesdent"],"references":{"245366298":"Chen, W.: Sequential Optimization and Reliability Assessment method for Efficient Probabilistic Design. ASME J Mech Des 126, 225-233","245186106":"An innovating analysis of the Nataf transformation from the copula viewpoint","223791793":"Subset simulation for structural reliability sensitivity analysis","41781559":"Gaussian Process for Machine Learning","226630153":"Sampling-Based RBDO Using the Dynamic Kriging (D-Kriging) Method and Stochastic Sensitivity Analysis","245401585":"Optimisation and robustness for crashworthiness of side impact","222540978":"Probablistic methods for centroidal Voronoi tessellations and their parallel implementations","221997066":"The Nature of Satistical Learning Theory","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","238184454":"A New Study on Reliability-Based Design Optimization","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","222945716":"Optimization algorithms for structural reliability","267810473":"Reliability-Based Design Optimization using Kriging and Support Vector Machines"},"citedIn":{},"index":523}