{"abs":"This paper is part of work aimed at investigating an approach to knowledge incorporation into solution models of the Meal Planning Problem (MPP) for use in mobile web-based HIV/AIDS nutrition therapy management within the context of developing countries, particularly, in Sub-Saharan Africa. This paper presents a characterisation of the incorporation of knowledge into the models for the MPP. The characterisation is important for assessing the extent to which MPP models can be adapted for use in different clinical problems with different nutrition guideline knowledge and in different regions of the world with differently customised versions of the guidelines. The characterisation was applied to thirty one works in the literature on MPP models. The main outcome of the application of the characterisation was the finding that the existing MPP models do not provide for the incorporation of nutrition guideline knowledge as first class concepts with identifiable and manageable structures, which makes almost impossible the transfer of knowledge from health experts to patients and from one region of the world to another.","title":"Characterisation of Knowledge Incorporation into Solution Models for the Meal Planning Problem","id":259936705,"url":"https://www.researchgate.net/publication/259936705_Characterisation_of_Knowledge_Incorporation_into_Solution_Models_for_the_Meal_Planning_Problem","names":["Ngonidzashe Zanamwe","Kudakwashe Dube","JasmineS. Thomson","Fredrick Mtenzi","GilfordT. Hapanyengwi"],"references":{"261058958":"Hierarchical heterogeneous Ant Colony Optimization","4089916":"A quantum particle swarm optimization","229524906":"Diet Assessment Based on Type-2 Fuzzy Ontology and Fuzzy Markup Language","3755900":"A Modified Particle Swarm Optimizer","224645801":"Preference Incorporation in Multi-objective Evolutionary Algorithms: A Survey","26843927":"Evaluation of Menu Planning Capability Based on Multi-dimensional 0/1 Knapsack Problem of Nutritional Management System","225146943":"A Formal Domain Model for Dietary and Physical Activity Counseling","267987040":"Optimizing Human Diet Problem Based on Price and Taste Using Multi-Objective Fuzzy Linear Programming Approach","40033208":"Individual diet modeling translates nutrient recommendations into realistic and individual-specific food choices","45276584":"Position of the American Dietetic Association: Nutrition Intervention and Human Immunodeficiency Virus Infection","224175111":"Integration of Preferences in Hypervolume-Based Multiobjective Evolutionary Algorithms by Means of Desirability Functions","221175221":"Game Model Based Co-evolutionary Algorithm and Its Application for Multiobjective Nutrition Decision Making Optimization Problems","261276238":"Preference-Based Evolutionary Multi-objective Optimization","251898268":"An Improved Multi-objective Evolutionary Algorithm for Hypertension Nutritional Diet Problems","224331263":"FOODS: A Food-Oriented Ontology-Driven System","3418832":"Evolutionary algorithms + domain knowledge \u003d real-world evolutionary computation","225622230":"Knowledge Incorporation in Multi-objective Evolutionary Algorithms","265802227":"Fuzzy Linear Programming Approach in Balance Diet Planning for Eating Disorder and Disease-related Lifestyle","232653752":"Nutritional Diet Decision Using Multi-objective Difference Evolutionary Algorithm","225499035":"Computer-Based Dietary Menu Planning: How to Support It by Complex Knowledge?","220774467":"Automatic meal planning using artificial intelligence algorithms in computer aided diabetes therapy","224241334":"Developing an expert system for diet recommendation","228944713":"Application Of A Multi-Objective Genetic Algorithm To The Modified Diet Problem","266908164":"Optimizing Human Diet Problem with Fuzzy Price Using Fuzzy Linear Programming Approach","238381912":"Computer-based dietary menu planning","221020866":"Computer-Based Dietary Menu Planning: How to Support It by Complex Knowledge?","26300415":"Diet Optimization Methods Can Help Translate Dietary Guidelines into a Cancer Prevention Food Plan","234067228":"Mobile Phone Applications for the Care and Prevention of HIV and Other Sexually Transmitted Diseases: A Review","7372160":"A novel artificial intelligence method for weekly dietary menu planning","221006430":"Incorporation of imprecise goal vectors into evolutionary multi-objective optimization","5590113":"Nutri-Educ, a nutrition software application for balancing meals, using fuzzy arithmetic and heuristic search algorithms","224587863":"Combined Quantum Particle Swarm Optimization Algorithm for Multi-objective Nutritional Diet Decision Making","273453883":"Particle Swarm Optimization","275977290":"Diet Problem and Nutrient Requirement using Fuzzy Linear Programming Approach","224646297":"Dietary Menu Planning Using an Evolutionary Method","228854616":"Evolutionary Balancing of Healthy Meals","2795606":"Possibilistic Constraint Satisfaction Problems or \"How to handle soft constraints ?\"","220690138":"Foundations of Constraint Satisfaction","220742615":"Healthy daily meal planner"},"citedIn":{},"index":524}