{"abs":"The improved line sampling (LS) technique, an effective numerical simulation method, is employed to analyze the probabilistic characteristics and reliability sensitivity of flutter with random structural parameter in transonic flow. The improved LS technique is a novel methodology for reliability and sensitivity analysis of high dimensionality and low probability problem with implicit limit state function, and it does not require any approximating surrogate of the implicit limit state equation. The improved LS is used to estimate the flutter reliability and the sensitivity of a two-dimensional wing, in which some structural properties, such as frequency, parameters of gravity center and mass ratio, are considered as random variables. Computational fluid dynamics (CFD) based unsteady aerodynamic reduced order model (ROM) method is used to construct the aerodynamic state equations. Coupling structural state equations with aerodynamic state equations, the safety margin of flutter is founded by using the critical velocity of flutter. The results show that the improved LS technique can effectively decrease the computational cost in the random uncertainty analysis of flutter. The reliability sensitivity, defined by the partial derivative of the failure probability with respect to the distribution parameter of random variable, can help to identify the important parameters and guide the structural optimization design.","title":"Reliability and Sensitivity Analysis of Transonic Flutter Using Improved Line Sampling Technique","id":222983493,"url":"https://www.researchgate.net/publication/222983493_Reliability_and_Sensitivity_Analysis_of_Transonic_Flutter_Using_Improved_Line_Sampling_Technique","names":["Song Shufang","Lu Zhenzhou","Weiwei Zhang","Ye Zhengyin","Chinese Journal of Aeronautics"],"references":{"222305920":"A general procedure for first/second-order reliabilitymethod (FORM/SORM)","247345850":"Realistic and efficient reliability estimation in space engineering","235021002":"Modeling Fluid Structure Interaction","266732142":"Modeling of fluid-structure interaction","229374179":"Reliability sensitivity method by line sampling","222528589":"Flutter reliability analysis of suspension bridges","250693054":"Realistic and efficient reliability estimation for aerospace structures","223592988":"A new look at the response surface approach for reliability analysis","269204700":"Aeroservoelastic Analysis for Supersonic and Hypersonic Missiles","239387091":"Stochastic FEM Based on Local Averages of Random Vector Fields","232395587":"Reduced-order modeling: new approaches for computational physics. Prog Aerosp Sci","223055314":"A stochastic finite element method for real eigenvalue problem","222809246":"A response surface method based on weighted regression for structural reliability analysis","272048109":"Improved Line Sampling Reliability Analysis Method and its Application","257940484":"Structural Reliability Analysis, Prediction","245303042":"Finite Element-Based Flutter Analysis of Cable-Suspended Bridges","222631320":"Probabilistic flutter criteria for long span bridges","4658405":"Computational methods for efficient structural reliability and reliability sensitivity analysis. AIAA J","245301372":"Basic Analysis of Structural Safety","223632759":"Control law design for transonic aeroservoelasticity","210222819":"Simulation and the Monte Carlo Method","257101557":"Reliability of structures in high dimensions. Part II. Theoretical validation","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","222223190":"Probabilistic free vibration and flutter analyses of suspension bridges","223094692":"Application of a reliability analysis model to bridge flutter under extreme winds","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","273800443":"Second‐Order Reliability Approximations","239414633":"Reduced-Order-Model-Based Flutter Analysis at High Angle of Attack","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","223284991":"Effect of response surface parameter variation on structural reliability estimates","222174282":"Variable screening and ranking using sampling-based sensitivity measures","229222620":"Reliability analysis of suspension bridges against flutter","223296308":"Modeling physical uncertainties in dynamic stall induced fluid–structure interaction of turbine blades using arbitrary polynomial chaos","245225507":"Transonic limit cycle oscillation analysis using reduced order aerodynamic models"},"citedIn":{"3568084":"Motion estimation with wavelet transform and the application to motion compensated interpolation","279069104":"ABCLS method for high-reliability aerospace mechanism with truncated random uncertainties","251621820":"Monte Carlo Simulation-based Sensitivity Analysis of the model of a Thermal-Hydraulic Passive System","275844422":"Uncertainty Importance Measure by Fast Fourier Transform for Wing Transonic Flutter","278680715":"Machining accuracy reliability analysis of multi-axis machine tool based on Monte Carlo simulation","258177033":"Subset simulation-based method for cumulative distribution function sensitivity of output response in random environment"},"index":525}