{"abs":"One of the more successful techniques for solving zero-one integer programs has been the implicit enumeration strategy first introduced by E. Balas. However, experience has shown that the efficiency of these enumerative techniques depends critically upon the bumber of variables. In this paper an algorithm is developed and computational experience provided for solving zero-one integer programs with many variables and few constraints. Sub-problems solved via implicit enumeration are generated from the linear programming relaxation and the variables in these sub-problems correspond to the fractional variables obtained in the linear program. Since the number of fractional variables in the linear program is bounded by the number of constraints in the linear program, the sub-problems will in general contain many fewer variables than the original zero-one integer program.","title":"Zero-One Programming With Many Variables and Few Constraints","id":4940310,"url":"https://www.researchgate.net/publication/4940310_Zero-One_Programming_With_Many_Variables_and_Few_Constraints","names":["A.L. Soyster","B. Lev","W. Slivka","European Journal of Operational Research"],"references":{"226157818":"Experimental results on Hillier\u0027s linear search","265681936":"An Improved Implicit Enumeration Approach For Integer Programming","239283430":"Efficient Heuristic Procedures for Integer Linear Programming with an Interior","247043004":"On the merit of the generalized origin and restarts in implicit enumeration","242911772":"Canonical Cuts on the Unit Hypercube","227443159":"Computational Experience with Variants of the Balas Algorithm Applied to the Selection of R\u0026D Projects","239550456":"An Additive Algorithm for Solving Linear Programs With Zero-One Variables"},"citedIn":{"239066558":"A genetic algorithm for the multiconstrained knapsack problem","222989261":"The multidimensional 0–1 knapsack problem: An overview","4940359":"Zero-one integer programs with few constraints --Lower bounding theory","220469558":"Improved core problem based heuristics for the 0/1 multi-dimensional knapsack problem","220200075":"Hybrid metaheuristics in combinatorial optimization: A survey","242286565":"EDITORIAL BOARDS, PUBLISHING COUNCIL","223774275":"New convergent heuristics for 0–1 mixed integer programming","220676912":"Metaheuristic Search with Inequalities and Target Objectives for Mixed Binary Optimization - Part II: Exploiting Reaction and Resistance.","4360409":"A Socio-Cognitive Particle Swarm Optimization for Multi-Dimensional Knapsack Problem","235022110":"Optimizing Mean Mission Duration for Multiple-Payload Satellites","228819517":"Tabu search: Global intensification using dynamic programming","35219897":"Solving single and multiple plant sourcing problems with a multidimensional knapsack model [electronic resource] /","220461574":"The Multidimensional 0-1 Knapsack Problem—Bounds and Computational Aspects","287337864":"Variable and single neighbourhood diving for MIP feasibility","220469518":"The reduced cost branch and bound algorithm for mixed integer programming","226023753":"Efficient Algorithms for Solving Multiconstraint Zero-One Knapsack Problems to Optimality","238194819":"New greedy heuristics for the Multiple-choice Multidimensional Knapsack Problem","267312733":"A Filter-and-Fan Metaheuristic for the 0-1 Multidimensional Knapsack Problem","4035336":"Exploiting surrogate constraint analysis for fixing variables in both bounds for multidimensional knapsack problems","223816802":"A dynamic programming based procedure for the multidimensional 0-1 knapsack problem","267311062":"A Hybrid Heuristic for the 0–1Knapsack Sharing Problem","220461592":"Improved convergent heuristics for the 0–1 multidimensional knapsack problem","259170633":"Improved binary artificial fish swarm algorithm for the 0–1 multidimensional knapsack problems","227150388":"The 0-1 bidimensional knapsack problem: Toward an efficient high-level primitive tool","226466624":"Inequalities and Target Objectives for Metaheuristic Search – Part I: Mixed Binary Optimization","226952778":"Beasley, J.E.: A Genetic Algorithm for the Multidimensional Knapsack Problem. Journal of Heuristics 4, 63-86","238875249":"A survey of effective heuristics and their application to a variety of knapsack problems","266038420":"New Variants of Variable Neighbourhood Search for 0-1 Mixed Integer Programming and Clustering","276833616":"Solving Large 0–1 Multidimensional Knapsack Problems by a New Simplified Binary Artificial Fish Swarm Algorithm","30512512":"Heuristiques hybrides pour la résolution de problèmes en variables 0-1 mixtes","263369702":"Hybrid approaches for the two‐scenario max–min knapsack problem","266532028":"Variable neighborhood formulation space search for circle packing","220403325":"Alternating control tree search for knapsack/covering problems","221411181":"New Hybrid Matheuristics for Solving the Multidimensional Knapsack Problem","283848500":"New variable neighbourhood search based 0-1 MIP heuristics","234898400":"Metaheuristic Search with Inequalities and Target Objectives for Mixed Binary Optimization – Part II","220472133":"Variable neighbourhood decomposition search for 0–1 mixed integer programs","258407559":"Hybrid Metaheuristics","220462657":"Cutting and Surrogate Constraint Analysis for Improved Multidimensional Knapsack Solutions","262281024":"Solving Multidimensional 0–1 Knapsack Problem with an Artificial Fish Swarm Algorithm","223059496":"An efficient preprocessing procedure for the multidimensional 0–1 knapsack problem","268746080":"A quantum particle swarm optimization for the 0–1 generalized knapsack sharing problem","229055298":"On bounds available from branch-and-price decomposition of the multidimensional knapsack problem with generalized upper bound constraints","229930835":"Corporate Graffiti","245331443":"Modeling multiple plant sourcing decisions","229604061":"A Heuristic Solution Procedure for the Multiconstraint Zero-One Knapsack Problem","35458152":"Developing new multidimensional knapsack heuristics based on empirical analysis of legacy heuristics /","245231339":"Single-plant sourcing decisions with a multidimensional knapsack model","228854616":"Evolutionary Balancing of Healthy Meals"},"index":528}