{"abs":"Latin hypercube sampling (LHS) is generalized in terms of a spectrum of stratified sampling (SS) designs referred to as partially stratified sample (PSS) designs. True SS and LHS are shown to represent the extremes of the PSS spectrum. The variance of PSS estimates is derived along with some asymptotic properties. PSS designs are shown to reduce variance associated with variable interactions, whereas LHS reduces variance associated with main effects. Challenges associated with the use of PSS designs and their limitations are discussed. To overcome these challenges, the PSS method is coupled with a new method called Latinized stratified sampling (LSS) that produces sample sets that are simultaneously SS and LHS. The LSS method is equivalent to an Orthogonal Array based LHS under certain conditions but is easier to obtain. Utilizing an LSS on the subspaces of a PSS provides a sampling strategy that reduces variance associated with both main effects and variable interactions and can be designed specially to minimize variance for a given problem. Several high-dimensional numerical examples highlight the strengths and limitations of the method. The Latinized partially stratified sampling method is then applied to identify the best sample strategy for uncertainty quantification on a plate buckling problem.","title":"The generalization of Latin hypercube sampling","id":280498317,"url":"https://www.researchgate.net/publication/280498317_The_generalization_of_Latin_hypercube_sampling","names":["Michael Shields","Jiaxin Zhang","Reliability Engineering [?] System Safety"],"references":{"2311011":"Centered L_2-Discrepancy Of Random Sampling And Latin Hypercube Design, And Construction Of Uniform Designs","222550405":"A study on algorithms for optimization of Latin hypercubes","269777234":"Spectral representation-based neural network assisted stochastic structural mechanics","243048186":"A Distribution-Free Approach to Inducing Rank Correlation Among Input Variates","222868929":"On Latin Hypercube Sampling for structural reliability analysis","245286228":"Stochastic Finite-Element Analysis of Seismic Soil–Structure Interaction","227809048":"Uncertainties in Material and Geometric Strength and Load Variables","216756580":"Orthogonal Column Latin Hypercubes and Their Application in Computer Experiments","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","243102952":"Latin Hyperrectangle Sampling for Computer Experiments","216756606":"Orthogonal Array-Based Latin Hypercubes","223818049":"Correlation control in small-sample Monte Carlo type simulations I: A simulated annealing approach","216756605":"Orthogonal Arrays for Computer Experiments, Integration and Visualization","215519811":"An efficient sampling scheme: Updated Latin Hypercube Sampling","222540952":"Algorithmic Construction of Symmetric Latin Hypercube Designs","245425404":"Polynomial Chaos Expansion with Latin Hypercube Sampling for Estimating Response Variability","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","285702041":"ON THE MAXIMUM DEFLECTION OF PLATING IN NEWLY BUILT SHIPS.","222135261":"Exploratory Designs for Computational Experiments","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","276211091":"Refined Stratified Sampling for efficient Monte Carlo based uncertainty quantification","245315385":"A Review of: “Experiments: Planning, Analysis, and Parameter Design Optimization”","216756493":"Survey of Sampling-Based Methods for Uncertainty and Sensitivity Analysis","222490346":"Minimax and Maximin Distance Designs","216756610":"Optimal Latin-hypercube designs for computer experiments","222873121":"Improvements to and limitations of Latin Hypercube Sampling","216756608":"Efficient Nearly Orthogonal and Space-Filling Latin Hypercubes","223025120":"Uncertainty Modeling in Plate Buckling","216756612":"Orthogonal-Maximin Latin Hypercube Designs","31104170":"An Automatic Method for Finding Greatest or Least Value of a Function","283075694":"Targeted random sampling: A new approach for efficient reliability estimation for complex systems","253328104":"Global Sensitivity Analysis. The Primer","31729749":"Experiments : Planning, Analysis, and Parameter Design Optimization / C.F.J. Wu, M. Hamada.","252062709":"Latin Hypercube Sampling Techniques for Power Systems Reliability Analysis With Renewable Energy Sources","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","241914077":"Fast generation of space-filling Latin hypercube sample designs","222178438":"A Comparison of Uncertainty and Sensitivity Analysis Results Obtained With Random and Latin Hypercube Sampling","222906224":"Optimal Latin-hypercube designs for computer experiments","223912354":"Latin Hypercube Sampling and the Propagation of Uncertainty in Analyses of Complex Systems, Technical Report, SAND2001-0417","284476942":"The role of latin hypercube sampling method in reliability engineering","222780925":"A new adaptive importance sampling scheme","281543283":"SIMPLIFIED COLLAPSE ANALYSIS OF STIFFENED PLATES.","233946639":"A method to improve design reliability using optimal Latin hypercube sampling"},"citedIn":{},"index":530}