{"abs":"Two techniques of population control are currently used in the field of serial genetic algorithms: generational and steady state. Although they have been used somewhat interchangeably in the past, it has become apparent that the two techniques are actually quite different. In this paper, I study the behavior of each with regard to reproduction, and show that while each can be made similar with respect to the schema theorem, in practice their behavior is quite different.","title":"A Study of Reproduction in Generational and Steady State Genetic Algorithms","id":201976468,"url":"https://www.researchgate.net/publication/201976468_A_Study_of_Reproduction_in_Generational_and_Steady_State_Genetic_Algorithms","names":["Gilbert Syswerda"],"references":{},"citedIn":{"4250689":"Evolutionary Exploration of Generalized Julia Sets","3701819":"Trajectory generation for redundant manipulator using virus evolutionary genetic algorithm","220609824":"Evolutionary mutation testing","224227675":"Search-Based Procedural Generation of Maze-Like Levels","222381384":"Heterogeneous Computing and Parallel Genetic Algorithms","238005797":"Neurotransmitters in Emotional Model of A Vision-Based Partner Robot for Natural Communication with Human","4239435":"Illuminance measurement of a mobile robot based on computational intelligence","220160275":"Genetic Programming with Linear Representation: a Survey.","223345985":"Optimal allocation of elements in a linear multi-state sliding window system","221007165":"A comparative study of diversity in evolutionary algorithms","261353346":"Self-efficacy using fuzzy control for long-term communication in robot-assisted language learning","220216626":"Genetic algorithm and large neighbourhood search to solve the cell formation problem","4239444":"Teleoperation of a vision-based mobile robot under office automation floors","220741950":"Entropic and Real-Time Analysis of the Search with Panmictic, Structured, and Parallel Distributed Genetic Algorithms.","224349566":"Characterization of extremal epidemic networks with diffusion characters","226735533":"A study of canonical GAs for NSOPs","3604486":"The genetic planner: The automatic generation of plans for a mobile robot via genetic programming","220472592":"A new evolutionary approach to cutting stock problems with and without contiguity","242752077":"AN EMPHASIS ON HEURISTICS COMBINED WITH GA TO IMPROVE THE QUALITY OF THE SOLUTIONS: SOME METHODS USED TO SOLVE VRPs AND VRPTCs","226816433":"Embryogenesis of Artificial Landscapes","226878909":"Cooperative Coevolutionary Methods","2700307":"Generation Gaps Revisited","288189719":"Supervised learning based Multi-modal perception for robot partners using smart phones","226188614":"A Genetically Optimized Level Set Approach to Segmentation of Thyroid Ultrasound Images","18202966":"[Biochemical activity of 56 strains of \"B. cereus\" isolated from foods].","3676283":"Natural motion trajectory generation of biped locomotion robot using genetic algorithm through energy optimization","261460947":"Island-based differential evolution with panmictic migration for multi-core CPUs","4089977":"An application of graph based evolutionary algorithms for diversity preservation","223424797":"Optimal series–parallel topology of multi-state system with two failure modes","254461799":"Asynchronous Master/Slave MOEAs and Heterogeneous Evaluation Costs","3810420":"Numerical and real time analysis of parallel distributed GAs with structured and panmictic populations","238660215":"A Method for Utilizing Diploid/Dominance in Genetic Search World Conference on Computational Intelligence (1994) IEEE (pp. 439-444)","222881031":"Virus-evolutionary genetic algorithm for a self-organizing manufacturing system","220948836":"Evolutionary Algorithms for Optimal Placement of Antennae in Radio Network Design.","226491692":"Multi-Objective Design of Neuro-Fuzzy Controllers for Robot Behavior Coordination","221399398":"Evolutionary Robot Vision and Fuzzy Evaluation for Natural Communication of Partner Robots.","234814888":"An unorthodox introduction to Memetic Algorithms","227603916":"Genetic algorithms and applications to finance","265747383":"PROFESSOR FLORIAN MIRCEA BOIAN AT HIS SIXTIES","2355270":"Evolution of Corridor Following Behavior in a Noisy World","254365519":"A Knowledge-Based Genetic Algorithm for the Job Shop Scheduling Problem","224058684":"Human-Friendly Networked Partner Robots toward Sophisticated Services for A Community","228615623":"Ephemeral resource constraints in optimization and their effects on evolutionary search","224472329":"A Statistical Study of The Differential Evolution based on Continuous Generation Model","23750912":"Optimal version sequencing in fault-tolerant programs","2460745":"Parameter Control in Evolutionary Algorithms","225665310":"An asymmetric multileveled symbiotic evolutionary algorithm for integrated FMS scheduling. Journal of Intelligent Manufacturing 18(6): 631-645","3810379":"Graph based genetic algorithms","4275252":"Hybrid Learning Approach based on Multi-Objective Behavior Coordination for Multiple Robots","261079029":"Generalized Thermal Agents with Multiple Boundary Conditions and Three-Dimensional Thermal Agents","220951888":"An Analysis of Synchronous and Asynchronous Parallel Distributed Genetic Algorithms with Structured and Panmictic Islands","220301662":"Functional genetic programming and exhaustive program search with combinator expressions.","2544807":"Aspects Of Modelling And Simulation Of Genetic Algorithms: A Formal Approach","223910352":"Optimal allocation of multi-state elements in linear consecutively connected systems with vulnerable nodes","220160406":"Evolving the Update Strategy of the Particle Swarm Optimisation Algorithms.","41823989":"On Potential Energy Models for EA-based Ab Initio Protein Structure Prediction","282897487":"Arm Angle Estimation for Computational System Rehabilitation with Range Image Sensor","280535085":"Toward a unifying framework for evolutionary processes","261109511":"Evolutionary cellular automata bonsai","220714429":"Illuminance Measurement and SLAM of A Mobile Robot based on Computational Intelligence","2425017":"A Genetic Algorithm Tutorial","4170909":"Understanding particle swarm optimisation by evolving problem landscapes","228756737":"An Efficient Distributed Genetic Algorithm Architecture for Vector Quantizer Design","221358484":"Gesture Recognition for A Partner Robot Based on Computational Intelligence","239060630":"Efficient Automatic Engineering Design Synthesis via Evolutionary Exploration","4086935":"Re-formation of mobile robots using genetic algorithm and reinforcement learning","220180916":"On the behavior of parallel genetic algorithms for optimal placement of antennae in telecommunications","278018082":"Evolution of 2D Apoptotic Cellular Automata","6138094":"Scaling Genetic Programming to Large Datasets Using Hierarchical Dynamic Subset Selection","220007850":"Competition, Coevolution and the Game of Tag","238720755":"Parameter Setting in Evolutionary Algorithms","225101216":"Comparative analysis of modern optimization tools for the p-median problem","225705383":"Self-Adaptation in Evolutionary Algorithms","4090084":"On taxonomy of evolutionary computation problems","2817268":"Deletion Schemes for Classifier Systems. A Technical Report.","261452619":"Landscape automata for search based procedural content generation","228370813":"Growing Neural Gas for Intelligent Robot Vision with Range Imaging Camera","226094491":"Self-Adaptation in Evolutionary Algorithms for Combinatorial Optimisation","221345234":"Removing the Genetics from the Standard Genetic Algorithm","3859673":"Study on multi-objective genetic algorithm","220497351":"Multi-stage fuzzy evaluation in evolutionary robot vision for face detection","2651340":"Evolving Artificial Neural Networks for Medical Applications","251621915":"Service task partition and distribution in star topology computer grid subject to data security constraints","225133966":"An evolutionary, agent-assisted strategy for conceptual design space decomposition","223891888":"An endosymbiotic evolutionary algorithm for the integration of balancing and sequencing in mixed-model U-lines","220785088":"Adaptive Vision System for Segmentation of Echographic Medical Images Based on a Modified Mumford-Shah Functional.","3002564":"SSME parameter model input selection using genetic algorithms","3910866":"Genetic programming for life-time learning of a mobile robot","222052813":"Genetic feature selection in a fuzzy rule-based classification system learning process for high-dimensional problems","225627520":"A two-leveled symbiotic evolutionary algorithm for clustering problems","215562282":"A survey of parallel distributed genetic algorithm","225228191":"Adaptive Restricted Tournament Selection for the identification of multiple sub-optima in a multi-modal function","261321575":"Development platform for robot partners using smart phones","282855461":"Fuzzy Spiking Neural Network for Abnormality Detection in Cognitive Robot Life Supporting System","224493980":"Structured learning for partner robots based on natural communication","261343085":"Impact of regulatory genes on optimization behavior","3413194":"Making use of population information in evolutionary artificial neural networks","223443374":"A symbiotic evolutionary algorithm for the integration of process planning and job shop scheduling. Computers and Operations Research 30: 1151-1171","224177244":"Localization of human in informationally structured space based on sensor networks","264175292":"Detection and quantification of structural damage under ambient vibration environment","222016562":"Learning of mobile robots using perception-based genetic algorithm","257628753":"Dealing with hardware heterogeneity: A new parallel search model","251893262":"Estimating gasoline demand in Iran using different soft computing techniques","224058453":"Virus-Evolutionary Genetic Algorithm for Fuzzy Spiking Neural Network of A Mobile Robot in A Dynamic Environment","2452789":"Solving CSP Instances Beyond the Phase Transition Using Stochastic Search Algorithms","222555222":"A direct stochastic algorithm for global search. Appl Math Comput 146(2-3):729-758","254947877":"EVOLUTIONARY OPTIMISATION OF KERNEL FUNCTIONS FOR SVMS","28245177":"Evolutionary Design of Fuzzy Logic Controllers Using Strongly-Typed GP","224273477":"Pseudo-hill climbing genetic algorithm (PHGA) for function optimization","226351200":"Prediction-Based Perceptual System of a Partner Robot for Natural Communication","225153141":"Hybridization of Estimation of Distribution Algorithms with a Repair Method for Solving Constraint Satisfaction Problems","251893283":"Coal demand estimating in Iran based on socio-economic indicators using particle swarm optimisation and genetic algorithm","37538589":"Modelling Genetic Algorithms and Evolving Populations","224060536":"Performance of Switch Blocking on Multithreaded Architectures","2790669":"ADAPTIVE SEARCH MANAGER: An Engineering Design Decision Support Approach","4257128":"An Utterance System of a Partner Robot Based on Interaction and Perception","4257134":"Human Hand Detection for Gestures Recognition of A Partner Robot","7404865":"A Weighted Sum Validity Function for Clustering With a Hybrid Niching Genetic Algorithm","252699198":"A two-stage damage detection approach based on subset selection and genetic algorithms","220205081":"Multileveled Symbiotic Evolutionary Algorithm: Application to FMS Loading Problems","4028679":"Perceptual system for a mobile robot under a dynamic environment","224472157":"Evolutionary design of the energy function for protein structure prediction","221024274":"Mimetic Evolution","224342112":"Growing topological map for SLAM of mobile robots","242919226":"Genetic Algorithms as Global Random Search Methods: An Alternative Perspective","31486113":"Solving the Graph Planarization Problem Using an Improved Genetic Algorithm","2467172":"The Application Of Genetic Algorithms To Feature Recognition And Object Counting","3575157":"Evolving SSE: a Stochastic Schemata Exploiter","3575153":"A method for utilizing diploid/dominance in genetic search","256970262":"Developing Domain-Knowledge Evolutionary Algorithms for Network-on-Chip Application Mapping","3413374":"Constraining the optimization of a fuzzy logic controller using an enhanced genetic algorithm","225163301":"Evolutionary algorithms for route selection and rate allocation in multirate multicast networks. J Appl Intell","220460140":"Evolutionary Computation for Modeling and Optimization.","257635860":"Multi-selection of instances: A straightforward way to improve evolutionary instance selection","37450603":"A probabilistic search algorithm for finding optimally directed solutions","221105276":"Evolutionary Computation for Simultaneous Localization and Mapping Based on Topological Map of a Mobile Robot","3708269":"Fuzzy manufacturing scheduling by virus-evolutionary genetic algorithm in self-organizing manufacturing system","257635852":"Parameter control system of evolutionary algorithm that is aided by the entire search history","280156655":"Single and Multi-objective Optimization Methodologies in CNC Machining","220887114":"Route Selection and Rate Allocation Using Evolutionary Computation Algorithms in Multirate Multicast Networks.","2583886":"Evolution of Genetic Programming Populations","263168705":"On the practical usage of genetic algorithms in ecology and evolution","51893880":"Ethane: A Heterogeneous Parallel Search Algorithm for Heterogeneous\nPlatforms","224212015":"Cognitive Development in Partner Robots for Information Support to Elderly People","289802293":"Evolving Artificial Neural Network Ensembles","220801117":"A Fully Characterized Test Suite for Genetic Programming.","221786191":"Human Detection and Gesture Recognition Based on Ambient Intelligence","2238814":"Evolving a Sort: Lessons in Genetic Programming","35515233":"Symbiotic evolution of neural networks in sequential decision tasks /","257392171":"Cold-standby sequencing optimization considering mission cost","228713693":"2 Evolutionary Algorithms in Modeling and Animation","226179079":"Information transformation by virus-evolutionary genetic programming","261124844":"Multiobjective differential evolution algorithm with opposition-based parameter control","224644327":"The Role of Spiking Neurons for Visual Perception of a Partner Robot","220160153":"Learning SVM with Complex Multiple Kernels Evolved by Genetic Programming.","279884073":"A computational study of hybrid approaches of metaheuristic algorithms for the cell formation problem","6301162":"Reducing the Number of Fitness Evaluations in Graph Genetic Programming Using a Canonical Graph Indexed Database","254214828":"AN EMOTIONAL MODEL FOR NATURAL COMMUNICATION OF A PARTNER ROBOT","222353627":"Guaranteeing the probability of success using repeated runs of genetic algorithm","224246977":"Fitness functions for searching the Mandelbrot set","224246978":"Autogeneration of fractal photographic mosaic images","2296194":"Generality and Difficulty in Genetic Programming: Evolving a Sort","50284379":"What else is the evolution of PSO telling us?","34666420":"A modular data analysis pipeline for the discovery of novel RNA motifs /","226607142":"Genetic and hybrid algorithms for graph coloring","2547086":"An Evolved, Vision-Based Model of Obstacle Avoidance Behavior","3575195":"Solving small and large scale constraint satisfaction problems using a heuristic-based microgenetic algorithm","2785688":"Behavior Hierarchy for Autonomous Mobile Robots: Fuzzy-Behavior Modulation and Evolution","4116877":"Generational versus steady-state evolution for optimizing neural network learning","221161627":"An efficient real-coded genetic algorithm for real-parameter optimization","240644065":"Distributed Behavior Learning of Multiple Mobile Robots based on Spiking Neural Network and Steady-State Genetic Algorithm","2745744":"Solving Combinatorial Problems Using Evolutionary Algorithms","225475788":"GP challenge: Evolving energy function for protein structure prediction","230612994":"Leapfrogging and Synoptic Leapfrogging: a new optimization approach","266359391":"Evolutionary algorithms. Genenetic algorithms – strategies and optimization procedures – exemplary applications","225750199":"Evolutionary design of Evolutionary Algorithms","3865086":"GP-preprocessed fuzzy inference for the energy load prediction","3773950":"Motion learning for redundant manipulator with structured intelligence","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","266404392":"Chapter 13 Evolving Neural Networks for Cancer Radiotherapy","222575758":"Computational intelligence for structured learning of a partner robot based on imitation","4151796":"A fast converging evolutionary neural network for the prediction of uplift capacity of Suction Caissons","3958256":"Using spare network computing power for genetic algorithm problems","220742908":"Evolutionary change in developmental timing","12368228":"A Simple Model of Unbounded Evolutionary Versatility as a Largest-Scale Trend in Organismal Evolution","220372218":"Using evolution to improve neural network learning: Pitfalls and solutions","238692320":"Transparent Decision Support Using Statistical Evidence","222560411":"Parallel evolutionary algorithms can achieve super-linear performance","5406093":"A new pheromone trail-based genetic algorithm for comparative genome assembly","228973636":"Heterogeneidad, WAN y nuevas aplicaciones de los algoritmos evolutivos paralelos","251931365":"Genetic Complex Multiple Kernel for Relevance Vector Regression","2548164":"An Evolved, Vision-Based Behavioral Model of Coordinated Group Motion","242429841":"Exact and Memetic Algorithms for Two Network Design Problems","232646709":"A Genetic Multiple Kernel Relevance Vector Regression Approach","3218904":"Perceptual Control Based on Prediction for Natural Communication of a Partner Robot","261467772":"Design support system for emotional expression of robot partners using interactive evolutionary computation","220231887":"Comparative Study of Some Solution Methods for Traveling Salesman Problem Using Genetic Algorithms.","221442247":"Towards Efficient Training on Large Datasets for Genetic Programming.","220176159":"Multiple fuzzy state-value functions for human evaluation through interactive trajectory planning of a partner robot","2853422":"An Empirical Comparison of Selection Methods in Evolutionary Algorithms","261447056":"Estimation of human transport modes by fuzzy spiking neural network and evolution strategy in informationally structured space","221020961":"Human Hand Detection Using Evolutionary Computation for Gestures Recognition of a Partner Robot","3607078":"Genetic algorithm with age structure and its application to self-organizing manufacturing system","220176142":"Metaheuristic optimization frameworks: A survey and benchmarking","251636973":"EVOLUTIONARY COALITION FORMATION IN COMPLEX NETWORKS","2455094":"Global Optimization Of Energy And Production In Basic Industries: A Genetic Algorithm Application","221006655":"Translation tables: A genetic code in a evolutionary algorithm","3152420":"Multistate Series-parallel system expansion-scheduling subject to availability constraints","261496192":"Evolutionary computation, combined with support vector machines, for gene structure prediction","3686959":"Global optimisation by evolutionary algorithms","221018935":"Computational Intelligence for Cyclic Gestures Recognition of a Partner Robot.","3652137":"RBF fuzzy controller with virus-evolutionary genetic algorithm","224722810":"Predicting alarms in supermarket refrigeration systems using evolved neural networks and evolved rulesets","4262499":"Steady-State Genetic Algorithm for Self-localization in Illuminance Measurement of A Mobile Robot","224645959":"Evaluating Distance Measures for RNA Motif Search","228847493":"Human tracking and natural communication of partner robots","261161399":"A comparison of representations for the prediction of ground-level ozone concentration","221531923":"Modular Fuzzy Neural Networks for Imitative Learning of A Partner Robot.","220694283":"Evolutionary Computation for Modeling and Optimization","49292511":"COVNET: A cooperative coevolutionary model for evolving artificial neural networks. IEEE Trans Neural Networks","41481303":"Evolutionary techniques applied to mask-layout synthesis in micro-mechanical-electronic systems (MEMS)","224180076":"Automatic generation of game elements via evolution","226448207":"Structured intelligence for self-organizing manufacturing systems","3642886":"Evolutionary design of artificial neural networks with different nodes","3693066":"Evolving Modular Neural Networks Which Generalise Well","220741404":"Selection Intensity in Genetic Algorithm with Generation Gaps.","263864718":"OPTIMAL ALLOCATION OF MULTISTATE ELEMENTS IN LINEAR CONSECUTIVELY-CONNECTED SYSTEMS WITH DELAYS","220204821":"Improving classification performance of Support Vector Machine by genetically optimising kernel shape and hyper-parameters. Appl Intell","272645749":"Genetic Optimization for Associative Semantic Ranking Models of Satellite Images by Land Cover","220743440":"Parameter sweeps for exploring GP parameters","261194152":"Improved genetic and Harmony Search Algorithms for single and multi stage expansion planning of power system","35001388":"Compositional evolution : interdisciplinary investigations in evolvability, modularity, and symbiosis /","220867344":"Experimental Comparison of Two Evolutionary Algorithms for the Independent Set Problem","3192335":"Geometric primitive extraction using genetic algorithm","220742423":"Distributed Steady-State Neuro-Evolutionary Path Planning in Non-Stationary Environments Using Adaptive Replacement.","252039482":"Alternative implementation techniques of parallelized Differential Evolution for multi-core processors","222064508":"Understanding and using genetic algorithms Part 2. Representation, configuration and hybridization","2764394":"A Comparison of the Randomised Hough Transform and a Genetic Algorithm for Ellipse Extraction","221136751":"A Novel Variation Operator for More Rapid Evolution of DNA Error Correcting Codes.","3865211":"Evolving pet robot with emotional model","267189679":"Comprehensive Evolution of Neural Networks","2740844":"An On-Line Method to Evolve Behavior and to Control a Miniature Robot in Real Time with Genetic Programming","220344167":"A cooperative coevolutionary algorithm for instance selection for instance-based learning","221439860":"Survival selection methods for the Differential Evolution based on continuous generation model.","238456945":"Towards Structural Evolution of Classification Workflows","229006305":"Generation of Evaluation Function for Life-time Learning of An Intelligent Robot","2768482":"Real Time Control of a Khepera Robot using Genetic Programming","2824804":"Exploring the Sound-Space of Synthesis Algorithms Using Interactive Genetic Algorithms.","221006717":"Parameter control by the entire search history: Case study of history-driven evolutionary algorithm","2985599":"An intelligent robotic system based on a fuzzy approach","224081676":"Integration of intelligent technologies for simultaneous localization and mapping","251419812":"New Schemes of Biologically Inspired Evolutionary Computation","260578769":"Optimal Allocation of Multistate Components in Consecutive Sliding Window Systems","4335131":"Visualization of perceptual information of a partner robot","224645945":"Evolving High-Performance Evolutionary Computations for Space Vehicle Design","220470143":"A mathematical model and a genetic algorithm for two-sided assembly line balancing","225900331":"Evolutionary Optimisation of Kernel and Hyper-Parameters for SVM","3418716":"Parallelism and evolutionary algorithms","3455581":"Evolving artificial neural network ensembles. IEEE Comput Intell Mag","4048465":"Interactive trajectory generation using evolutionary programming for a partner robot","220949319":"Heterogeneous parallel algorithms to solve epistatic problems.","251581586":"Application of PSO (particle swarm optimization) and GA (genetic algorithm) techniques on demand estimation of oil in Iran","3152477":"Redundancy optimization for multi-state system with fixed resource-requirements and unreliable sources. IEEE Transactions on Reliability 50: 52-59","4201006":"Genetic algorithm for a fuzzy spiking neural network of a mobile robot","3766858":"Learning, adaptation and evolution of intelligent robotic system","221583168":"ARGEN + AREPO: Improving the Search Process with Artificial Genetic Engineering.","223255353":"Trajectory generation for biped locomotion robot","220743505":"Alternative evolutionary algorithms for evolving programs: Evolution strategies and steady state GP","225189653":"Genetic algorithms and neighbourhood search","221007701":"On the effects of graph based evolutionary algorithms for training finite state classifiers","274225698":"Self-Tuning Fuzzy Controller Based on Virus Theory of Evolution","224623391":"Human recognition of a partner robot based on relevance theory and neuro-fuzzy computing","2442840":"Evolutionary Algorithms with Local Search for Combinatorial Optimization","228961061":"Numerical optimisation using genetic algorithms","220856232":"Applying Evolutionary Algorithms to Combinatorial Optimization Problems","5595869":"Liu, Y.: A New Evolutionary System for Evolving Artificial Neural Networks. IEEE Transactions on Neural Networks 8, 694-713","222759883":"Genetic algorithm for open-loop distribution system design","3418809":"Evolution of Processor Microcode","234807146":"Alternative evolutionary algorithms for evolving programs: evolution strategies and steady state GP","221024187":"The Importance of Selection Mechanisms in Distribution Estimation Algorithms","2809527":"Finite Markov Chain Models of an Alternative Selection Strategy for the Genetic Algorithm","2485892":"Gaining New Fields of Application for OOP: the Parallel Evolutionary Algorithm Case","221008782":"Rapid training of thermal agents with single parent genetic programming","222386153":"Trajectory planning of cellular manipulator system using virus-evolutionary genetic algorithm","220881794":"Experiment study of a Structured Differential Evolution with mixed strategies.","223460346":"Evolving evolutionary algorithms using evolutionary algorithms","224685007":"Perceptual System of A Partner Robot for Natural Communication Restricted by Environments","221006720":"Comparison of evolved epidemic networks with diffusion characters","3623558":"Raising GA performance by simultaneous tuning of selective pressure and recombination disruptiveness","2794136":"Exploring Alternative Operators and Search Strategies in Genetic Programming","245079081":"Optimal structure of fault-tolerant software systems","228899613":"Multiple Human Face Detection Based on Local Genetic Algorithm Clustering Using Mobile iPhone Platform","37996674":"Rapid generation of motion plans for modular robotic systems","225573813":"Genetic algorithms with age structure","2628326":"Continuous Dynamical System Models of Steady-State Genetic Algorithms","224167826":"Dielectric properties of polypropylene containing synthetic and natural organoclays","220292085":"Single- and multi-objective shape design of Y-noise barriers using evolutionary computation and boundary elements","221024245":"A Genetic Algorithm with Parallel Steady-State Reproduction.","258162111":"Enhancing distributed EAs by a proactive strategy","275153592":"Stable Drug Designing By Minimizing Drug Protein Interaction Energy Using PSO","3152623":"Optimal allocation of multistate elements in a linear consecutively-connected system","226130853":"Parameter Sweeps for Exploring Parameter Spaces of Genetic and Evolutionary Algorithms","3418833":"Cooperative Coevolution of Artificial Neural Network Ensembles for Pattern Classification","224256950":"Human motion tracking for cognitive rehabilitation in informationally structured space based on sensor networks","220284879":"‘Cheap grid’: Leveraging system failure using stochastic computation","49401857":"Clustering with Niching Genetic K-means Algorithm","4222644":"Depth Annotation of RNA Folds for Secondary Structure Motif Search","239602876":"Time Series Prediction Using Evolving Polynomial Neural Networks","2825950":"A Genetic Programming System Learning Obstacle Avoiding Behavior and Controlling a Miniature Robot in Real Time","220606416":"A Novel Hybrid Framework of Coevolutionary GA and Machine Learning.","233350928":"Forecasting Energy Demand in Iran Using Genetic Algorithm (GA) and Particle Swarm Optimization (PSO) Methods","227164019":"Evolutionary Exploration of Complex Fractals","3865280":"Iterated function system fractals for the detection and display of DNA reading frame","4304572":"Evolutionary Robot Vision for Multiple Human Heads Tracking of A Partner Robot","257177687":"Maximal profit service task partition and distribution in computer grid","2456365":"Production And Energy Optimization In An Industrial Complex: A Genetic Algorithm Approach","281970628":"Non-Dominated Quantum Iterative Routing Optimization for Wireless Multihop Networks","271952702":"Theoretical analysis of steady state genetic algorithms","228558483":"Genetic algorithms for automated texture classification","290441793":"Genetic Algorithm Control using Reinforcement Learning --- Introducing the auto-tune and auto-control (ATAC) framework","221420092":"Steady-State Genetic Algorithms for Growing Topological Mapping and Localization","3949357":"Reinforcement learning in steady-state cellular genetic algorithms","2414389":"An Analysis of Synchronous and Asynchronous Parallel Distributed Genetic Algorithms with Structured and Panmictic Islands","251621868":"Dynamic evolution of the genetic search region through fuzzy coding","222565969":"Process synthesis of laser forming by genetic algorithm","2265909":"Evolutionary Computation","222521940":"Kwong, S.: To combine steady-state genetic algorithm and ensemble learning for data clustering. Pattern Recogn. Lett. J. 29(9), 1416-1423","3639086":"Virus-evolutionary genetic algorithm-ecological model on planar grid","24292973":"Understanding Genetic Algorithm Dynamics Using Harvesting Strategies","4250466":"Evolutionary Parameter Setting of Multi-clustering","3418896":"Graph-based evolutionary algorithms","251923489":"A GP-based kernel construction and optimization method for RVM","260524194":"Minimizing Bypass Transportation Expenses in Linear Multistate Consecutively-Connected Systems","4063003":"Estimation of Bayesian network algorithm with GA searching for better network structure","224645700":"An Updated Taxonomy of Evolutionary Computation Problems using Graph-based Evolutionary Algorithms","220696079":"Parallel Genetic Algorithms","2745088":"An Arithmetic Test Suite for Genetic Programming","2318089":"Solving CSPs with Ant Colonies","244424127":"Dimensionally Aware Genetic Programming","228800141":"A Simple Model of Unbounded Evolutionary Versatility","224301676":"Evolutionary robot vision and particle swarm optimization for Multiple human heads tracking of a partner robot","220286484":"Troya, J.M.: Improving flexibility and efficiancy by adding parallelism to genetic algorithms. Statistics and Computing 12(2), 91-114","251825207":"Hybrid Learning Approach for the Collision Avoidance Behavior of a Mobile Robot","43550126":"Análisis y diseño de algoritmos genéticos paralelos distribuidos","29650675":"DGA and Pareto Elitism : Improving Pareto Optimization","224301670":"Evolutionary robot vision for human tracking of partner robots in ambient intelligence","224301671":"Trajectory generation based on a steady-state genetic algorithm for imitative learning of a partner robot","2454303":"Constrained GA applied to Production and Energy Management of a Pulp and Paper Mill","220356120":"Assessment of Electricity Demand in Iran\u0027s Industrial Sector Using Different Intelligent Optimization Techniques.","2690834":"Niching Methods for Genetic Algorithms","224645727":"Improving Design Diversity Using Graph Based Evolutionary Algorithms","224301665":"Behavior learning of multiple mobile robots based on spiking neural networks with a parallel genetic algorithm","221019756":"A Perceptual System for a Vision-Based Mobile Robot Under Office Automation Floors.","227093197":"Optimising Multiple Kernels for SVM by Genetic Programming","220702307":"Testing the Intermediate Disturbance Hypothesis: Effect of Asynchronous Population Incorporation on Multi-Deme Evolutionary Algorithms","3672944":"Trajectory planning of reconfigurable redundant manipulator using virus-evolutionary genetic algorithm","220204648":"An Endosymbiotic Evolutionary Algorithm for Optimization","220741216":"Best SubTree genetic programming","224356886":"Evolutionary Robot Vision for People Tracking Based on Local Clustering","220677740":"Lowering Costs of Timber Shear-Wall Design using Global Search","3810166":"Design exploration: extending the bounds of the search space","224910890":"A Comparative Study of Content Statistics of Coding Regions in an Evolutionary Computation Framework for Gene Prediction","3810154":"Perception-based genetic algorithm for a mobile robot with fuzzy controllers","3418982":"Evolving Problems to Learn About Particle Swarm Optimizers and Other Search Algorithms","268038316":"Optimization of thin noise barrier designs using Evolutionary Algorithms and a Dual BEM Formulation","278017994":"Evolving Fractal Art with a Directed Acyclic Graph Genetic Programming Representation","220867184":"Optimising Multiple Kernels for SVM by Genetic Programming","3810151":"Genetic algorithm inspired by gene duplication","220885621":"Forking Genetic Algorithm with Blocking and Shrinking Modes (fGA).","3949402":"Fault-tolerant network computation of individuals in genetic algorithms","224626181":"Fuzzy Computing for Communication of A Partner Robot Based on Imitation","225738259":"A constrained, globalized, and bounded Nelder–Mead method for engineering optimization","222422566":"Globalized Nelder-Mead Method for engineering optimization.","2769728":"Evaluating and Improving Steady State Evolutionary Algorithms on Constraint Satisfaction Problems","224673288":"Genetic-based Mobile Robot Path Planning using Vertex Heuristics","251958376":"Active perception based on Hough transform and evolutionary computation using 3D range sensor","221008450":"Solution transfer rates in graph based evolutionary algorithms","220885594":"Evolutionary Computation in Air Traffic Control Planning","222657072":"Chaos automata: Iterated function systems with memory","3678018":"Individual aging in genetic algorithms","224247334":"DMEA — An algorithm that combines differential mutation with the fitness proportionate selection","27224800":"Adaptive Learning of Polynomial Networks: Genetic Programming, Backpropagation and Bayesian Methods","4307911":"A fractal representation for real optimization","224301785":"Learnability in human gesture recognition for a partner robot based on computational intelligence","225126115":"Characterising DNA/RNA Signals with Crisp Hypermotifs: A Case Study on Core Promoters","3755959":"Evolutionary training of artificial neural networks for radiotherapy treatment of cancers","222551762":"Identification of crack profiles using genetic programming and fuzzy inference","224177871":"Robot design support system based on interactive evolutionary computation using Boltzmann selection","222837468":"Analyzing synchronous and asynchronous parallel distributed genetic algorithms","224645884":"Finding Social Landscapes for PSOs via Kernels","2676616":"Fitness Landscapes and Inductive Genetic Programming","2811786":"Efficient Reinforcement Learning Through Symbiotic Evolution","4068253":"Content-based image retrieval incorporating models of human perception","220462726":"Parameter-free genetic algorithm using pseudo-simplex method","224688834":"An Evolutionary Algorithm for the Selection of Geographically Informative Species","237460877":"Evolutionary Computation and Fractal Visualization of Sequence Data","4113299":"Genetic algorithm extensions","224688841":"Filtration and Depth Annotation Improve Non-linear Projection for RNA Motif Discovery","229217799":"Optimal allocation of multi-state retransmitters in acyclic transmission networks","220740230":"Adaptation of expansion rate for real-coded crossovers","2488215":"Analysis of Schema Variance and Short Term Extinction Likelihoods","242570702":"An Analysis of Cooperative Coevolutionary Algorithms A dissertation submitted in partial fulfillment of the requirements for the degree of Doctor of Philosophy at George Mason University","221136531":"Developing Antibiotic Regimens Using Evolutionary Algorithms.","28762632":"GAS, a Concept on Modeling Species in Genetic Algorithms","223847062":"Uneven allocation of elements in linear multi-state sliding window system","221157103":"Improving SVM Performance Using a Linear Combination of Kernels","2555874":"Using Dynastic Exploring Recombination to Promote Diversity in Genetic Search","290702997":"Intelligent Robotic Systems Based on Soft Computing—Adaptation, Learning and Evolution","242097568":"Cooperative Perceptual Systems for Partner Robots Based on Sensor Network","2672614":"Symbiotic Evolution of Neural Networks in Sequential Decision Tasks","288364287":"HydroCM: A Hybrid Parallel Search Model for Heterogeneous Platforms","225127099":"A Linear Genetic Programming Approach to Intrusion Detection","223355523":"Optimal sectionalizer allocation in electric distribution systems by genetic algorithm","220742396":"Clustering with Niching Genetic K-means Algorithm","286050008":"Parallel genetic algorithms: Theory and realworld applications","220403446":"Crowding with nearest neighbors replacement for multiple species niching and building blocks preservation in binary multimodal functions optimization","259086505":"An Introduction to Evolutionary Algorithms","3676130":"Virus-evolutionary genetic algorithm with subpopulations: application to trajectory generation of redundant manipulator through energy optimization","220204799":"Influence of the Migration Policy in Parallel Distributed GAs with Structured and Panmictic Populations","224752262":"A real-time multi face detection technique using positive-negative lines-of-face template","221318878":"Global Search through Sampling Using a PDF","4201391":"Evolving problems to learn about particle swarm and other optimisers","220064492":"Visual Perception for a Partner Robot Based on Computational Intelligence.","222505648":"Evaluating evolutionary algorithms. Artif Intell J","216569628":"Adaptive Vision System for Segmentation of Medical Images based on Modified Mumford Shah Functional","220443348":"Revisiting the Memory of Evolution","3755974":"Function optimization in nonstationary environment using steady state genetic algorithms with aging of individuals"},"index":537}