{"abs":"Printout. Thesis (Ph. D.)--University of Illinois at Urbana-Champaign, 1999. Vita. Includes bibliographical references (leaves 140-146).","title":"Efficient and Accurate Parallel Genetic Algorithms","id":35750879,"url":"https://www.researchgate.net/publication/35750879_Efficient_and_Accurate_Parallel_Genetic_Algorithms","names":["Erick Cantu-Paz"],"references":{},"citedIn":{"245440160":"A Genetic Algorithm/Method of Moments Approach to the Optimization of an RF Coilfor MRI Applications --- Theoretical Considerations","41042035":"A new Lamarckian genetic algorithm for flexible ligand-receptor docking","225163629":"Implementation of Parallel Genetic Algorithms on Graphics Processing Units","273024576":"Computational-Based Approach to Estimating Travel Demand in Large-Scale Microscopic Traffic Simulation Models","220742447":"The Shifting Balance Genetic Algorithm as More than Just Another Island Model GA","242452084":"Applying Multi-Moves in Parallel Genetic Algorithm for the Flow Shop Problem","222516042":"A Parallel Evolutionary Algorithm to Optimize Dynamic Memory Managers in Embedded Systems","260676994":"ACO on multiple GPUs with CUDA for faster solution of QAPs","225397603":"Machine Learning to Analyze Migration Parameters in Parallel Genetic Algorithms","228917163":"A software system for scalable parameter estimation on clusters","2330162":"Asynchronous Migration in Parallel Genetic Programming","221309218":"A New Rough Set Reduct Algorithm Based on Particle Swarm Optimization","220105483":"Using parallelization and hardware concurrency to improve the performance of a genetic algorithm","220602161":"Reducing forgeries in writer-independent off-line signature verification through ensemble of classifiers.","226699162":"Tailoring complex weld geometry through reliable heat-transfer and fluid-flow calculations and a genetic algorithm","251979039":"Extending an agent-based FMS scheduling approach with parallel genetic algorithms","220742920":"A Specialized Island Model and Its Application in Multiobjective Optimization","221927195":"Performance of Simple Genetic Algorithm Inserting Forced Inheritance Mechanism and Parameters Relaxation","226962862":"GA-EDA: A New Hybrid Cooperative Search Evolutionary Algorithm","42622112":"Asynchronous Multi-Objective Optimisation in Unreliable Distributed Environments","227245990":"Evolutionary Paradigms","226007381":"The Ant Colony Optimization Metaheuristic: Algorithms, Applications, and Advances","224330098":"Exploring Population Structures for Locally Concurrent and Massively Parallel Evolutionary Algorithms","226630573":"Optimization of Artificial Neural Network Architectures for Time Series Prediction Using Parallel Genetic Algorithms","286457121":"A Comparative Study for Efficient Synchronization of Parallel ACO on Multi-core Processors in Solving QAPs","220742430":"Design of Multithreaded Estimation of Distribution Algorithms","6506068":"A parallel genetic algorithm for single class pattern classification and its application for gene expression profiling in Streptomyces coelicolor","225625395":"Feature Selection for Ensembles Using the Multi-Objective Optimization Approach","220702051":"Migration of Probability Models Instead of Individuals: An Alternative When Applying the Island Model to EDAs","264977292":"2014-04-15-11-05-Paper-WDC-CSK-and-BBIC-to-Information-Sciences","259884849":"GABF: Genetic algorithm with base fitness for obtaining generality from partial results: Study in autonomous intersection by fuzzy logic","254461799":"Asynchronous Master/Slave MOEAs and Heterogeneous Evaluation Costs","262172656":"A Parallel Genetic Algorithm for Floorplan Area Optimization","263483366":"A hybrid algorithm for solving inverse problems in elasticity","4362257":"Cellular compact genetic algorithm for evolvable hardware","226613714":"When Huge Is Routine: Scaling Genetic Algorithms and Estimation of Distribution Algorithms via Data-Intensive Computing","283714234":"Performance analysis of a parallel path planning algorithm based on evolutionary artificial potential field","261192644":"Multi-GPU island-based genetic algorithm for solving the knapsack problem","224357641":"An Adaptive Hardware Classifier in FPGA based-on a Cellular Compact Genetic Algorithm and Block-based Neural Network","220691833":"Introduction to Genetic Algorithms","6635066":"Evolutionary computation and multimodal search: A good combination to tackle molecular diversity in the field of peptide design","220697927":"Multiple-Deme Parallel Estimation of Distribution Algorithms: Basic Framework and Application","220742474":"Complex Function Sets Improve Symbolic Discriminant Analysis of Microarray Data","227890679":"Optimizing the reservoir operation rule curves by genetic algorithms. Hydrol Process","260595693":"Empirical Modeling using Genetic Programming: A Survey of Issues and Approaches","235694698":"State of the Art for Genetic Algorithms and Beyond in Water Resources Planning and Management","257431870":"Coarse-grained parallel genetic algorithm applied to a vector based land use allocation optimization problem: The case study of Tongzhou Newtown, Beijing, China","245135092":"A niching genetic algorithm applied to a nuclear power plant auxiliary feedwater system surveillance tests policy optimization","225146114":"Evolvable Agents: A Framework for Peer-to-Peer Evolutionary Algorithms","256847653":"Asymptotic Guarantee of Success for Multi-Agent Memetic Systems","225398531":"A Parallel Evolutionary Algorithm to Optimize Dynamic Data Types in Embedded Systems","225470208":"A Parallel Island Model for Estimation of Distribution Algorithms","268750452":"Island-based harmony search for optimization problems","222704439":"Vibro-acoustic noise control treatments for payload bays of launch vehicles: Discrete to fuzzy solutions","224084777":"Parallel probabilistic model-building genetic algorithms with elitism","257435439":"A parallel genetic algorithm for adaptive hardware and its application to ECG signal classification","221583181":"Variable Selection in a GPU Cluster Using Delta Test","220866903":"A Genetic Algorithm for the Index Selection Problem.","288794441":"Evolutionary algorithms for affinity scheduling heuristics in heterogeneous computing systems","4201669":"MRMOGA: parallel evolutionary multiobjective optimization using multiple resolutions","221228455":"Design Issues in a Multiobjective Cellular Genetic Algorithm","221112230":"Symbolic Discriminant Analysis for Mining Gene Expression Patterns","277663232":"Improving Performance of Genetic Algorithms for Transportation Systems: Case of Parallel Genetic Algorithms","224302032":"The importance of a two-level perspective for island model design","222704598":"Reducing forgeries in writer-independent off-line signature verification through ensemble of classifiers","1957001":"An Architecture for Massive Parallelization of the Compact Genetic Algorithm","261226246":"An Adaptive Invasion–based Model for Distributed Differential Evolution","227080465":"A Genetic Algorithm for the Index Selection Problem","4253914":"Hybrid optimisation method using PGA and SQP algorithm","222046624":"Efficient Distributed Genetic Algorithm for Rule extraction","225141238":"Local models—an approach to distributed multi-objective optimization","261399350":"A performance evaluation of a probabilistic parallel genetic algorithm: FPGA vs. multi-core processor","2329739":"Parallel Genetic Algorithm for Finite-State Machine Synthesis from Input/Output Sequences","271494278":"Parallel particle swarm optimization with genetic communication strategy and its implementation on GPU","10673679":"Ritchie, M. D., White, B. C., Parker, J. S., Hahn, L. W. \u0026 Moore, J. H. Optimization of neural network architecture using genetic programming improves the detection and modeling of gene-gene interactions in studies of human diseases. BMC Bioinform. 4, 28","239391466":"Comparative Analysis of Evolutionary, Local Search, and Hybrid Approaches to O/D Traffic Estimation","225595843":"Sporadic model building for efficiency enhancement of the hierarchical BOA","221547398":"Use of Local Ranking in Cellular Genetic Algorithms with Two Neighborhood Structures","232635243":"A Parallel Genetic Algorithm for Shortest Path Routing Problem","282715234":"A Brief Introduction to Evolutionary Algorithms and the Genetic Doping Algorithm","220702183":"On Fitness Distributions and Expected Fitness Gain of Mutation Rates in Parallel Evolutionary Algorithms","221900792":"A Review of Evolutionary Algorithms for Data Mining","2531557":"A Totally Distributed Genetic Algorithm: From a Cellular System to the Mesh of Processors","284887615":"Evolutionary Algorithms: Perspectives on the Evolution of Parallel Models","220163545":"Feature selection for ensembles applied to handwriting recognition","266967841":"Multithreaded Parallel Dual Population Genetic Algorithm (MPDPGA) for unconstrained function optimizations on multi-core system","225513402":"Swarm Intelligence: Foundations, Perspectives and Applications","225209760":"Integration of Process Planning and Scheduling Using Multi-Agent Learning","282458624":"SYNTHESIS OF NEURO-FUZZY MODEL FOR PATIENT HEALTH PREDICTING BASED ON PARALLEL COMPUTING","220702192":"Effects of Using Two Neighborhood Structures in Cellular Genetic Algorithms for Function Optimization","261283653":"Improved Group Search Optimizer based on cooperation among groups for feedforward networks training with Weight Decay","223487882":"A Metropolis Algorithm applied to a Nuclear Power Plant Auxiliary Feedwater System surveillance tests policy optimization","266475323":"Evolutionary algorithms and other metaheuristics in water resources: Current status, research challenges and future directions","222578591":"Face recognition by fusing thermal infrared and visible imagery","285622237":"The Generalized Island Model","229748079":"Fundamentals of Genetic Algorithms","225156532":"Experimental Investigation of Three Distributed Genetic Programming Models","2558200":"The Master-Slave Architecture for Evolutionary Computations Revisited","261156720":"Discovering interesting rules from biological data using parallel genetic algorithm","221228493":"Multiobjective Evolutionary Algorithms on Complex Networks","224330173":"FPGA Implementation of a Cellular Univariate Estimation of Distribution Algorithm and Block-Based Neural Network as an Evolvable Hardware","3418834":"Parallel Implementation of EDAs Based on Probabilistic Graphical Models","221392852":"On the Application of Multiple-Deme Parallel Genetic Algorithms in Astrophysics.","257518515":"A hierarchical parallel genetic approach for the graph coloring problem. Appl Intell","221024199":"Parallelization of an Evolutionary Algorithm on a Platform with Multi-core Processors","241711751":"A framework of integrating GIS and parallel computing for spatial control problems – a case study of wildfire control","220701655":"Enhancing the Efficiency of the ECGA","270704342":"Studying Fault-Tolerance in Island-Based Evolutionary and Multimemetic Algorithms","224166313":"Balancing exploration and exploitation in an adaptive three-dimensional cellular genetic algorithm via a probabilistic selection operator","45715008":"Scaling simple, compact and extended compact genetic algorithms using MapReduce","238623936":"Multiscale island injection genetic algorithms for groundwater remediation","221145556":"Study of migration topology in island model parallel hybrid-GA for large scale quadratic assignment problems.","224078752":"Towards 3D Architectures: A Comparative Study on Cellular GAs Dimensionality","2533595":"Time Continuation in Genetic Algorithms","41623684":"Comparison of Neural Network Optimization Approaches for Studies of Human Genetics","221205037":"Cunning Ant System for Quadratic Assignment Problem with Local Search and Parallelization","221006383":"A co-evolutionary framework for regulatory motif discovery","262808239":"Nature-Inspired Meta-Heuristics on Modern GPUs: State of the Art and Brief Survey of Selected Algorithms","224107093":"Hardware architecture and FPGA implementation of a parallel elitism-based compact genetic algorihm","227152005":"Multiobjective Genetic Fuzzy Systems","220199438":"Efficient Differential Evolution algorithms for multimodal optimal control problems","225970793":"The Challenge of Producing Human-Competitive Results by Means of Genetic and Evolutionary Computation","261086877":"Fault tolerant Block Based Neural Networks","263371936":"A robust Island Parallel Genetic Algorithm for the Quadratic Assignment Problem","279258038":"It’s Not a Bug, It’s a Feature: Wait-Free Asynchronous Cellular Genetic Algorithm","225154173":"Hierarchical Bayesian Optimization Algorithm","225333369":"Parallel genetic programming: Synchronous and asynchronous migration","261054104":"Cooperative Group Search Optimization","2571070":"GAME-HDL: Implementation of Evolutionary Algorithms Using Hardware Description Languages","220176900":"A new initialization procedure for the distributed estimation of distribution algorithms. Soft Comput","222826580":"Improving food processing using modern optimization methods","226829467":"Exploration/Exploitation Tradeoff with cell-shift and Heuristic Crossover for Evolutionary Algorithms","224254018":"Genetic parameter identification of the Doyle-Fuller-Newman model from experimental cycling of a LiFePO4 battery","220464652":"Two-frame structure from motion using optical flow probability distributions for unmanned air vehicle obstacle avoidance","225315911":"Analysis of Cancer Data Using Evolutionary Computation","220702221":"Examining the Effect of Elitism in Cellular Genetic Algorithms Using Two Neighborhood Structures","220742660":"Large-scale data mining using genetics-based machine learning","263664793":"Optimization of one-dimensional Bin Packing Problem with island parallel grouping genetic algorithms","1957171":"Let\u0027s Get Ready to Rumble: Crossover Versus Mutation Head to Head","4375917":"An Agent Framework with an efficient information exchange model for Distributed Genetic Algorithms","262394514":"Cloud Scale Distributed Evolutionary Strategies for High Dimensional Problems","265642724":"Bent Function Synthesis by Means of Cartesian Genetic Programming","2880799":"Are Multiple Runs of Genetic Algorithms Better than One?","263125657":"Clustering of web search results based on the cuckoo search algorithm and Balanced Bayesian Information Criterion","220285977":"Simdist: A distribution system for easy parallelization of evolutionary computation","221228562":"Multiobjective EA Approach for Improved Quality of Solutions for Spanning Tree Problem","220826644":"Self-organized Parallel Cooperation for Solving Optimization Problems","221006444":"Solving inverse problems by the multi-deme hierarchic genetic strategy","251993156":"(N-1) contingency planning in radial distribution networks using genetic algorithms","257224728":"Genetic identification and fisher identifiability analysis of the Doyle–Fuller–Newman model from experimental cycling of a LiFePO4 cell","3412346":"Network-Based Distributed Planning Using Coevolutionary Agents: Architecture and Evaluation","225145381":"A Hybrid Cellular Genetic Algorithm for the Capacitated Vehicle Routing Problem","2330988":"Speedup Improvement on Automatic Robot Programming by Parallel Genetic Programming","235253073":"Bar-system representation for topology optimization using genetic algorithms","6440756":"Recirculation of germinal center B cells: A multilevel selection strategy for antibody maturation","4376852":"Efficient Distributed Genetic Algorithm for Rule Extraction","220739697":"Distributed Probabilistic Model-Building Genetic Algorithm","245331398":"A parallel genetic algorithm for dynamic cell formation in cellular manufacturing systems","220132931":"Observer-invariant histopathology using genetics-based machine learning","220867700":"Hierarchical Cellular Genetic Algorithm","8337693":"Modeling and convergence analysis of distributed coevolutionary algorithms. IEEE Trans Syst Man Cybern B Cybern","273134885":"Path planning for mobile robots using Bacterial Potential Field for avoiding static and dynamic obstacles","263124170":"SASEGASA: A New Generic Parallel Evolutionary Algorithm for Achieving Highest Quality Results: Special Issue: New Advances on Parallel Meta-Heuristics for Complex Problems (Guest Editor: Enrique Alba)","261312247":"Partial Decomposition and Parallel GA (PD-PGA) for Constrained Optimization","257628735":"A parallel evolutionary algorithm for technical market indicators optimization","225338887":"Parallel Genetic Algorithms for Architecture Optimization of Neural Networks for Pattern Recognition","226985709":"Parallel Bivariate Marginal Distribution Algorithm with Probability Model Migration","264894628":"Towards Highly Optimized Cartesian Genetic Programming: From Sequential via SIMD and Thread to Massive Parallel Implementation","266717332":"Innovations in hybrid intelligent systems. Selected papers based on the presentations at the 2nd international workshop on hybrid artificial intelligence systems, (HAIS 2007), Salamance, Spain, November 2007","249808273":"See and avoidance behaviors for autonomous navigation","267947148":"PARALLEL PARTICLE SWARM OPTIMIZATION ALGORITMS IN NUCLEAR PROBLEMS","249869201":"Multi-Project Scheduling using Competent Genetic Algorithms","220291668":"Multi-objective pump scheduling optimisation using evolutionary strategies","225149459":"A Fast Parallel Genetic Algorithm for Traveling Salesman Problem","226952445":"Genetic Algorithms","284723075":"Optimización en la Aproximación de Curvas NURBS con Algoritmos Genéticos Paralelos en un GPU","223204402":"Coarse-grained parallel genetic algorithm applied to a nuclear reactor core design optimization problem","220701863":"Team Algorithms Based on Ant Colony Optimization – A New Multi-Objective Optimization Approach","258383590":"A Parallel Implementation of Unscheduled Flow Control in Interconnected Power Systems","290073290":"Automatic Parallelization of EC on GPGPUs and Clusters of GPGPU Machines with EASEA and EASEA-CLOUD","226008825":"Nature Inspired Multi-Swarm Heuristics for Multi-Knowledge Extraction","234817149":"Efficiency of parallel genetic algorithm for solving N-queens problem on multicomputer platform","269308814":"Applying Genetic Algorithm Combining Operation Tree (GAOT) for Estimating Salinity of Taiwan Strait Using MODIS/Terra","291008734":"A Multi-agent Based Migration Model for Evolving Cooperation in the Spatial N-Player Snowdrift Game","221405370":"Reconfigurable Parallel Architecture for Genetic Algorithms: Application to the Synthesis of Digital Circuits","220881574":"Applications of Parallel Genetic Algorithms in Ground Water Contamination Problems: An Overview.","221148834":"A Coarse-Grained Parallel Genetic Algorithm with Migration for Shortest Path Routing Problem","225968361":"Evolutionary Algorithms for Data Mining","221008061":"Parallel Multi-objective Optimization using Master-Slave Model on Heterogeneous Resources","220380854":"Parallel Implementation of EDAs Based on Probabilistic Graphical Models.","225850594":"ORIGINAL PAPER EvAg: a scalable peer-to-peer evolutionary algorithm","225415930":"An Analysis of Dynamic Mutation Operators for Conformational Sampling","269039507":"The Influence of Elitism Strategy on Migration Intervals of a Distributed Genetic Algorithm","266967669":"Serial DPGA vs. parallel multithreaded DPGA: Threading aspects","220741301":"Empirical investigations on parallel competent genetic algorithms","220176063":"Implementation of cellular genetic algorithms with two neighborhood structures for single-objective and multi-objective optimization","220698246":"A Memory-Efficient Elitist Genetic Algorithm","224301818":"Distributed classifier migration in XCS for classification of electroencephalographic signals","224688833":"Understanding the Evolutionary Process of Grammatical Evolution Neural Networks for Feature Selection in Genetic Epidemiology","287677070":"Parallel multidimensional scaling using grid computing: Assessment of performance","224177911":"Parallelization of binary and real-coded genetic algorithms on GPU using CUDA. Evolutionary Computation (CEC)","225582302":"On the Use of Distributed Genetic Algorithms for the Tuning of Fuzzy Rule Based-Systems","291829962":"Soft computing methods in concrete mix performance approximation and optimization","280943887":"A Memetic Framework for Solving Difficult Inverse Problems","220741787":"Distribution of Evolutionary Algorithms in Heterogeneous Networks","226076355":"A Dynamic Multi Agent-Based Approach to Parallelizing Genetic Algorithm","221057174":"Greedy Dynamic Crossover Management in Hardware Accelerated Genetic Algorithm Implementations Using FPGA.","7359948":"Atrial cell action potential parameter fitting using genetic algorithms","4307965":"Parallel BMDA with probability model migration","221531275":"ALife in the Galapagos: Migration Effects on Neuro-Controller Design","225722036":"Handling Constraints in Global Optimization Using Artificial Immune Systems: A Survey","221078255":"Network Distributed Virtual Design using Coevolutionary Agents.","2555874":"Using Dynastic Exploring Recombination to Promote Diversity in Genetic Search","241728941":"Jobshop lot streaming with routing flexibility, sequence-dependent setups, machine release dates and lag time","225745084":"A Review on Parallel Estimation of Distribution Algorithms","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","7302563":"Comparison of P-RnaPredict and mfold - algorithms for RNA secondary structure prediction","6172050":"Regulatory Motif Discovery Using a Population Clustering Evolutionary Algorithm","256847489":"Island Model as Markov Dynamic System","2330092":"Comparison Between Synchronous and Asynchronous Implementation of Parallel Genetic Programming","226977365":"A Grid-Based Hybrid Hierarchical Genetic Algorithm for Protein Structure Prediction","279057776":"Improvement of the Performance of the Quantum Evolutionary Algorithms Structure, Operators","286050008":"Parallel genetic algorithms: Theory and realworld applications","228666489":"An enhanced genetic algorithm for structural topology optimization","3418607":"Markov chain models of parallel genetic algorithms","224246918":"Robot Routing Using Clustering-Based Parallel Genetic Algorithm with Migration","266890294":"Solving Economic and Environmental Optimal Control in Dumping of Sewage with a Flexible and Parallel Evoluationary Computation","261496948":"Hybrid approach in design of GA implementation for MapReduce","226131615":"Diversity Mechanisms in Pitt-Style Evolutionary Classifier Systems","2520526":"Nature\u0027s Heuristics for Scheduling Jobs on Computational Grids","220739801":"Chromosome Reuse in Genetic Algorithms","220858590":"Multi-Agent System for Irregular Parallel Genetic Computations","225142431":"Evaluation of Sequential, Multi-objective, and Parallel Interactive Genetic Algorithms for Multi-objective Floor Plan Optimisation","224301738":"A shared-memory ACO+GA hybrid for combinatorial optimization","288264923":"Evaluation of sequential, multi-objective, and parallel interactive genetic algorithms for multi-objective optimization problems","220977373":"Lava Invasion Susceptibility Hazard Mapping Through Cellular Automata","225269402":"Efficiency Enhancement of Estimation of Distribution Algorithms","256905899":"Data Classification through an Evolutionary Approach Based on Multiple Criteria","277474677":"Optimal DG Allocation in Radial Distribution Systems with High Penetration of Non-Linear Loads","220866775":"Parallel Genetic Algorithm on the CUDA Architecture","222814905":"Parallelization strategies for rapid and robust evolutionary multiobjective optimization in water resources applications"},"index":538}