{"abs":"The Steady State variants of the Multi-Objective Covariance Matrix Adaptation Evolution Strategy (SS-MO-CMA-ES) generate one offspring from a uniformly selected parent. Some other parental selection operators for SS-MO-CMA-ES are investigated in this paper. These operators involve the definition of multi-objective rewards, estimating the expectation of the offspring survival and its Hypervolume contribution. Two selection modes, respectively using tournament, and inspired from the Multi-Armed Bandit framework, are used on top of these rewards. Extensive experimental validation comparatively demonstrates the merits of these new selection operators on unimodal MO problems.","title":"Lecture Notes in Computer Science","id":48414194,"url":"https://www.researchgate.net/publication/48414194_Lecture_Notes_in_Computer_Science","names":["Ilya Loshchilov","Marc Schoenauer","Michèle Sebag"],"references":{"220740712":"Comparing Results of 31 Algorithms from the Black-Box Optimization Benchmarking BBOB-2009","29625892":"A Simple Modification in CMA-ES Achieving Linear Time and Space Complexity","220375075":"Completely Derandomized Self-Adaptation in Evolution Strategies","221228555":"Steady-State Selection and Efficient Covariance Matrix Update in the Multi-objective CMA-ES","220742254":"A computational efficient covariance matrix update and a (1+1)-CMA for evolution strategies","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","47615610":"Mirrored Sampling and Sequential Selection for Evolution Strategies","10710734":"Reducing the Time Complexity of the Derandomized Evolution Strategy with Covariance Matrix Adaptation (CMA-ES)","220343796":"Finite-time Analysis of the Multiarmed Bandit Problem","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","3025398":"Adaptive step size random search","45229384":"Active Covariance Matrix Adaptation for the (1+1)-CMA-ES","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","216457304":"Lecture Notes in Computer Science"},"citedIn":{"261264005":"Feasibility study of optimization of a genetic algorithm for traffic network division for distributed road traffic simulation","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","235709701":"Recent Developments in Derivative-Free Multiobjective Optimisation","254461799":"Asynchronous Master/Slave MOEAs and Heterogeneous Evaluation Costs","257153822":"An adaptive penalty based covariance matrix adaptation–evolution strategy"},"index":540}