{"abs":"A parallel asynchronous evolutionary algorithm controlled by strongly interacting demes for single- and multi-objective optimization problems is proposed. It is suitable even for non-homogeneous, multiprocessor systems, ensuring maximum exploitation of the available processors. The search algorithm utilizes a structured topology of evaluation agents organized in a number of inter-communicating demes arranged on a 2D supporting mesh. Once an evaluation terminates and a processor becomes idle, a series of intra- and inter-deme processes determines the next agent to undergo evaluation on this specific processor. Real coding and differential evolution operators are used. Mathematical and aerodynamic-turbomachinery optimization problems are presented to assess the proposed method in terms of CPU cost, parallel efficiency and quality of solutions obtained within a predefined number of evaluations. Comparisons with conventional evolutionary algorithms, parallelized based on the master–slave model on the same computational platform, are presented.","title":"Aerodynamic Optimization Using a Parallel Asynchronous Evolutionary Algorithm Controlled by Strongly Interacting Demes","id":239392299,"url":"https://www.researchgate.net/publication/239392299_Aerodynamic_Optimization_Using_a_Parallel_Asynchronous_Evolutionary_Algorithm_Controlled_by_Strongly_Interacting_Demes","names":["Varvara G. Asouti","Kyriakos C. Giannakoglou","Engineering Optimization"],"references":{"243766735":"An Augmented Lagrange Multiplier Based Method for Mixed Integer Discrete Continuous Optimization and Its Applications to Mechanical Design","243766734":"GeneAS: A Robust Optimal Design Technique for Mechanical Component Design","222381384":"Heterogeneous Computing and Parallel Genetic Algorithms","2362670":"A Survey of Parallel Genetic Algorithms","224301970":"Multilevel optimization strategies based on metamodel-assisted evolutionary algorithms, for computationally expensive problems","201975941":"A Connectionist Machine for Genetic Hill-Climbing","220380076":"Grid computing for parallel bioinspired algorithms","235710019":"Problem Definitions and Evaluation Criteria for the CEC 2005 Special Session on Real-Parameter Optimization","222837468":"Analyzing synchronous and asynchronous parallel distributed genetic algorithms","4262485":"Solving Nonlinear Constrained Optimization Problems by the ε Constrained Differential Evolution","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","220285304":"Grid enabled, hierarchical distributed metamodel-assisted evolutionary algorithms for aerodynamic shape optimization","243666463":"Nonlinear Integer and Discrete Programming in Mechanical Design Optimization","222914963":"Efficient Hierarchical Parallel Genetic Algorithms using Grid computing","245310660":"On the use of metamodel-assisted, multi-objective evolutionary algorithms","3837542":"Parallel genetic algorithm taxonomy","250693102":"A multilevel approach to single- and multiobjective aerodynamic optimization","226003545":"Aerodynamic Shape Optimization Methods on Multiprocessor Platforms","2800139":"Fine-Grained Parallel Genetic Algorithm: A Stochastic Optimisation Method","201976557":"Fine-Grained Parallel Genetic Algorithms","3418716":"Parallelism and evolutionary algorithms","248336865":"Viscous-Inviscid Analysis of Transonic and Low Reynolds Number Airfoils","223381820":"Acceleration of a Navier–Stokes equation solver for unstructured grids using agglomeration multigrid and parallel processing","222425260":"Wang, L.: An effective co-evolutionary particle swarm optimization for constrained engineering design problems. Eng. Appl. Artif. Intel. 20, 89-99","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","222697333":"Constraint-handling in genetic algorithms through the use of dominance-based tournament selection","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","201976957":"Evolutionary Algorithms in Theory and Practice","30873058":"Genetic + Data Structures \u003d Evolution Programs","236888804":"A One-Equation Turbulence Model for Aerodynamic Flows","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization"},"citedIn":{"264816457":"Design of a matrix hydraulic turbine using a metamodel-assisted evolutionary algorithm with PCA-driven evolution operators","260622144":"Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","254461799":"Asynchronous Master/Slave MOEAs and Heterogeneous Evaluation Costs","254230314":"An Asynchronous Metamodel-Assisted Memetic Algorithm for CFD-based shape optimization","283567049":"Master–slave model-based parallel chaos optimization algorithm for parameter identification problems","266532016":"DESIGN OF A HYDROMATRIX TURBINE RUNNER USING AN ASYNCHRONOUS EVOLUTIONARY ALGORITHM ON A MULTI-PROCESSOR PLATFORM","283804158":"Parallel Multiobjective Evolutionary Algorithms","225984495":"A grid-enabled asynchronous metamodel-assisted evolutionary algorithm for aerodynamic optimization","245309255":"The benefits of adaptive parametrization in multi-objective Tabu Search optimization","230825241":"A chemical evolutionary mechanism for instantiating service-based applications","18201865":"[Effect of the strong doses of triated thymidine on development and the chromosomes of the triton Pleurodeles waltlii Michah].","236189741":"Parallel Metaheuristics: Recent Advances and New Trends"},"index":541}