{"abs":"Many real-world optimisation problems approached by evolutionary algorithms are subject to noise. When noise is present, the evolutionary selection process may become unstable and the convergence of the optimisation adversely affected. In this paper, we present a new technique that efficiently deals with noise in multi-objective optimisation. This technique aims at preventing the propagation of inferior solutions in the evolutionary selection due to noisy objective values. This is done by using an iterative resampling procedure that reduces the noise until the likelihood of selecting the correct solution reaches a given confidence level. To achieve an efficient utilisation of resources, the number of samples used per solution varies based on the amount of noise in the present area of the search space. The proposed algorithm is evaluated on the ZDT benchmark problems and two complex real-world problems of manufacturing optimisation. The first real-world problem concerns the optimisation of engine component manufacturing in aviation industry, while the second real-world problem concerns the optimisation of a camshaft machining line in automotive industry. The results from the optimisations indicate that the proposed technique is successful in reducing noise, and it competes successfully with other noise handling techniques.","title":"Evolutionary optimisation of noisy multi-objective problems using confidence-based dynamic resampling","id":46491920,"url":"https://www.researchgate.net/publication/46491920_Evolutionary_optimisation_of_noisy_multi-objective_problems_using_confidence-based_dynamic_resampling","names":["Anna Syberfeldt","Amos H.C. Ng","Robert John","Philip Moore","European Journal of Operational Research"],"references":{"222997259":"Multi-objective simulation-based evolutionary algorithm for an aircraft spare parts allocation problem","225304684":"An evolutionary algorithm for multi-objective optimization of combustion processes","216300453":"Evolutionary Algorithms for Solving Multi-Objective Problems SE – Genetic and Evolutionary Computation","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","220805164":"Handling Uncertainties in Evolutionary Multi-Objective Optimization","255589501":"A modified NSGA-II to solve noisy multiobjective problems","220741295":"Fitness inheritance for noisy evolutionary multi-objective optimization","220381224":"An Investigation on Noisy Environments in Evolutionary Multiobjective Optimization","216300590":"Metamodel—Assisted Evolution Strategies","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220289455":"Solving multiobjective vehicle routing problem with stochastic demand via evolutionary computation","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","258950396":"Simulation Modeling and Analysis","12809680":"Deb, K.: Multi-Objective Genetic Algorithms: Problem Difficulties and Construction of Test Problems. Evolutionary Computation 7, 205-230","2427505":"Genetic Algorithms, Selection Schemes, and the Varying Effects of Noise","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","216300467":"A Study of the Parallelization of a Coevolutionary Multi-objective Evolutionary Algorithm","4090022":"Applying evolutionary algorithms to problems with noisy, time-consuming fitness functions","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","216300285":"Evolutionary algorithms in noisy environments: Theoretical issues and guidelines for practice","221228598":"Evolutionary Multi-objective Ranking with Uncertainty and Noise","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","243775590":"Multi-Objective Genetic Algorithms: Problem Di±culties and Construction of Test Functions","220403650":"Simulated annealing in the presence of noise","261500276":"An Investigation on Noisy Environments in Evolutionary Multi-Objective Optimization","2889038":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","3301905":"Approximation Capability in by Multilayer Feedforward Networks and Related Problems","220045365":"Multiobjective Optimization Using Evolutionary Algorithms. Wiley, New York","5576441":"Using additive noise in back-propagation training","28352157":"Noisy Optimization with Evolution Strategies","223648868":"An investigation on noise-induced features in robust evolutionary multi-objective optimization","221228511":"Pareto-Front Exploration with Uncertain Objectives","220742169":"Selection in the Presence of Noise","221527431":"New Advances and Applications for Marrying Simulation and Optimization.","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","235709562":"A Reduced-Cost Multi-Objective Optimization Method Based on the Pareto Front Technique, Neural Networks and PVM","216300371":"Efficient Fitness Estimation in Noisy Environments","220343829":"Genetic Algorithms in Noisy Environments","222670527":"Evolutionary algorithms in noisy environments: theoretical issues and guidelines for practice","221228373":"Evolutionary Multi-objective Optimization for Simultaneous Generation of Signal-Type and Symbol-Type Representations","3418766":"Reducing the Run-Time Complexity of Multiobjective EAs: The NSGA-II and Other Algorithms","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II"},"citedIn":{"273397675":"The Rolling Tide Evolutionary Algorithm: A Multiobjective Optimizer for Noisy Optimization Problems","241732554":"A data mining approach to evolutionary optimisation of noisy multi-objective problems","259539997":"A Simulated Annealing Algorithm for Noisy Multiobjective Optimization","257778678":"Genetic algorithms based optimization of artificial neural network architecture for buildings’ indoor discomfort and energy consumption prediction","280552279":"Regularity Model for Noisy Multiobjective Optimization","6532179":"Diffusion tensor imaging: techniques and clinical applications.","261060697":"A comparative study of dynamic resampling strategies for guided Evolutionary Multi-objective Optimization","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","257196355":"Multi-objective evolutionary algorithm for donor–recipient decision system in liver transplants","220743569":"Accumulative sampling for noisy evolutionary multi-objective optimization","221765453":"Multi-Objective Optimization with Estimation of Distribution Algorithm in a Noisy Environment","273329457":"Interval-based ranking in noisy evolutionary multi-objective optimization","281687665":"Implicit and explicit averaging strategies for simulation-based optimization of a real-world production planning problem","274974334":"Maintenance scheduling of a fleet of fighter aircraft through multi-objective simulation-optimization","279314171":"Differential evolution for noisy multiobjective optimization"},"index":542}