{"abs":"This paper describes the use of both robotic and digital organisms to help in the study and understanding of the evolution of biological structures. Our premise in this paper is that simulations using robotic and digital organisms are an effective methodology for studying how some features evolved in swimming fish. Experiments with the artificial organisms allow us to evaluate the hypothesis that backbones evolved in fish in part because they result in higher velocity, acceleration and maneuverability. The use of both robotic and digital organisms provides the ability to (1) use computers to efficiently explore a very large search space of possibilities, (2) validate (using the robotic organisms) that the digital models accurately reflect the physical constraints of the environment","title":"Using Artificial Organisms To Study The Evolution of Backbones in Fish","id":4249775,"url":"https://www.researchgate.net/publication/4249775_Using_Artificial_Organisms_To_Study_The_Evolution_of_Backbones_in_Fish","names":["Chun Wai Liew","Robert G Root","John H Long, Jr","T.J. Koob"],"references":{"12737730":"Animal movement, mechanical tuning and coupled systems","232188116":"Studies on the Structure and Development of Vertebrates, Vol. II","220450471":"A combined neuronal and mechanical model of fish swimming. Biol Cybern","49747769":"Animats and what they can tell us","242090465":"The Vertebrate Body Axis: Evolution and Mechanical Function1","12760653":"The biomechanics of fast-starts during ontogeny in the common carp Cyprinus carpio","10987255":"Force transmission via axial tendons in undulating fish: A dynamic analysis","225626915":"Predicting muscle force generation during fast-starts for the common carp Cyprinus carpio","222011049":"Ecology of the hagfish, Myxine glutinosa L., in the Gulf of Maine: II. Potential impact on benthic communities and commercial fisheries","248615561":"Vertebrate paleontology and evolution","13268817":"Body bending during fast-starts in fish can be explained in terms of muscle torque and hydrodynamic resistance","37423909":"Evolving Swimming Controllers for a Simulated Lamprey with Inspiration from Neurobiology","2466309":"Perception and Learning in Artificial Animals","10951685":"Mechanical and thermal properties of novel polymerized NDGA-gelatin hydrogels","221958809":"Natural Selection in The Wild","221001480":"Using a genetic algorithm to optimize the gape of a snake jaw","2379457":"Using Evolutionary Methods to Parameterize Neural Models: a Study of the Lamprey Central Pattern Generator","11594645":"Material properties of polymerized NDGA-collagen composite fibers: Development of biologically based tendon constructs","202001711":"Adaptation and Natural Selection: A Critique of Some Current Thought","265821949":"The mechanical consequences of vertebral centra","13360685":"White muscle strain in the common carp and red to white muscle gearing ratios in fish","221438997":"Exploration or Convergence? Another Meta-Control Mechanism for GAs.","44439756":"Vertebrate paleontology and evolution / Robert L. Carroll","225657822":"The kinematics of phototaxis in larvae of the ascidian Aplidium constellatum","3232030":"A Navigational Primitive: Biorobotic Implementation of Cycloptic Helical Klinotaxis in Planar Motion","228748179":"Biologically-inspired control of perception-action systems: helical klinotaxis in 2D robots","6684253":"Biomimetic evolutionary analysis: Testing the adaptive value of vertebrate tail stiffness in autonomous swimming robots","246265687":"Functional Anatomy of The Vertebrates, An Evolutionary Perspective","245582877":"Before the Backbone, Views on the Origin of Vertebrates","51335665":"Compliant Realignment of Binding Sites in Muscle: Transient Behavior and Mechanical Tuning","229428883":"The Importance of Body Stiffness in Undulatory Propulsion"},"citedIn":{"224453045":"Biomimetic evolutionary analysis: Robotically-simulated vertebrates in a predator-prey ecology"},"index":543}