{"abs":"A new methodology has been developed for the automated optimal design of two-dimensional highspeed inlets. A semiempirical flow solver and an improved genetic algorithm are linked within an automated loop. The purpose of this process is to maximize the total pressure recovery of the missile inlet: first of all, for one upstream now condition, and secondly, for an entire mission. This innovative design strategy allows great improvement of the original inlet design in a very short period of time. Successful results are presented for optimizations of inlets originally designed and tested at the Institute of Theoretical and Applied Mechanics in Novosibirsk, Russia. The significant improvements of the total pressure recovery, achieved by the automated optimization Loop, are verified using a full Navier-Stokes solver.","title":"Automated Optimal Design of Two-Dimensional Supersonic Missile Inlets","id":245434898,"url":"https://www.researchgate.net/publication/245434898_Automated_Optimal_Design_of_Two-Dimensional_Supersonic_Missile_Inlets","names":["Michael Blaize","Doyle Knight","Khaled Rasheed","Journal of Propulsion and Power"],"references":{"259059569":"Three-dimensional aerodynamic shape optimization of wings using sensitivity analysis","2845729":"Multilevel Algorithms For Nonlinear Optimization","268999362":"Neuromorphic approach to inverse problems in aerodynamics","2755367":"Investigation of Low-Reynolds-Number Rocket Nozzle Design Using PNS-Based Optimization Procedure","269078535":"An unstructured grid approach to sensitivity analysis and shape optimization using the Euler equations","245450033":"Applications of Genetic Algorithm to Aerodynamic Shape Optimization","3754280":"Rapid modeling, assembly and simulation in design","27341168":"Multi-point aerodynamic design by optimization","23888127":"Aerodynamic design optimization using sensitivity analysis and computational fluid dynamics","245429366":"CFD-based aerodynamic approximation concepts optimization of a two-dimensional scramjet vehicle","245429502":"Gradient-Based Aerodynamic Shape Optimization Using Alternating Direction Implicit Method","2812341":"User\u0027s Guide for CFSQP Version 2.5: A C Code for Solving (Large Scale) Constrained Nonlinear (Minimax) Optimization Problems, Generating Iterates Satisfying All Inequality Constraints","23602377":"Numerical optimization design of advanced transonic wing configurations","2290886":"Grid Sensitivity And Aerodynamic Optimization Of Generic Airfoils","261288758":"GADO: A Genetic Algorithm for Continuous Design Optimization","244524980":"Variable-complexity aerodynamic optimization of a high-speed civil transport wing","24319707":"Design optimization of natural laminar flow bodies in compressible flow","2686212":"Automated Optimal Design Using CFD and High Performance Computing","245429198":"Inverse method for airfoil design","2681560":"A Surrogate Approach To The Experimental Optimization Of Multielement Airfoils","269057023":"Stochastic optimization applied to CFD shape design","245429784":"Multiobjective Genetic Algorithm for Multidisciplinary Design of Transonic Wing Planform","2779926":"Intelligent Automated Quality Control for Computational Simulation","246371666":"High-lift design optimization using Navier-Stokes equations","23913683":"Wing Design by Numerical Optimization"},"citedIn":{"238189330":"Multicriteria Design Optimization of Integrated Three-Dimensional Supersonic Inlets","222222108":"Optimization of heat transfer utilizing graph based evolutionary algorithms","271557997":"Evolutionary optimization of energy systems using population graphing and neural networks","262260482":"Parallel Shape Optimization of a Missile on a Grid Infrastructure","221001480":"Using a genetic algorithm to optimize the gape of a snake jaw","222044504":"A new methodology for evolutionary optimization of energy systems","3418896":"Graph-based evolutionary algorithms","242819292":"Evolutionary optimization of energy systems using population graphing and neural networks","245435524":"Multicriteria Design Optimization of a Supersonic Inlet Based upon Global Missile Performance","221438997":"Exploration or Convergence? Another Meta-Control Mechanism for GAs.","267584665":"New Evolutionary Techniques for Optimization of Energy Systems Utilizing Computational Fluid Dynamics","267486586":"Developing Multiple Diverse Potential Designs for Heat Transfer Utilizing Graph Based Evolutionary Algorithms","237136622":"Low Fidelity Analysis Based Design of Two Dimensional Bifurcated Duct","245435532":"Multi-Objective Shape Optimization Study for a Subsonic Submerged Inlet","256842465":"Multi-criteria Design Optimization of a Two dimensional Supersonic Inlet","268559790":"Toward the Aerodynamical Optimization of a Supersonic Airplane Using a Genetic Algorithm and a PNS Solver","269207993":"Aerodynamic Optimization of Turbomachinery Cascades Using Euler/Boundary-Layer Coupled Genetic Algorithms","238189089":"Performance Analysis for High-Speed Missile Inlets","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","239424253":"Engineering optimization of an improved plancha stove"},"index":545}