{"abs":"Multi-objective evolutionary algorithms which use non-dominated sorting and sharing have been mainly criticized for their (i) O(MN s) computational complexity (where M is the number of objectives and N is the population size), (ii) non-elitism approach, and (iii) the need for specifying a sharing parameter. In this paper, we suggest a non-dominated sorting based multi-objective evolutionary algorithm (we called it the Non-dominated Sorting GA-II or NSGA-II) which alleviates all the above three difficulties. Specifically, a fast non-dominated sorting approach with O(MN 2) computational complexity is presented. Second, a selection operator is presented which creates a mating pool by combining the parent and child populations and selecting the best (with respect to fitness and spread) N solutions. Simulation results on a number of difficult test problems show that the proposed NSGA-II, in most problems, is able to find much better spread of solutions and better convergence near the true Pareto-optimal front compared to PAES and SPEA two other elitist multi-objective EAs which pay special attention towards creating a diverse Pareto-optimal front. Moreover, we modify the definition of dominance in order to solve constrained multi-objective problems efficiently. Simulation results of the constrained NSGA-II on a number of test problems, including a five-objective, seven-constraint non-linear problem, are compared with another constrained multi-objective optimizer and much better performance of NSGA-II is observed. Because of NSGA-II\u0027s low computational requirements, elitist approach, parameter-less niching approach, and simple constraint-handling strategy, NSGA-II should find increasing applications in the coming years.","title":"A fast and elitist multi-objective genetic algorithm: NSGA II","id":2526557,"url":"https://www.researchgate.net/publication/2526557_A_fast_and_elitist_multi-objective_genetic_algorithm_NSGA_II","names":["Kalyan Deb","Amrit Pratap","Sameer Agarwal","T. Meyarivan","IEEE Transactions on Evolutionary Computation"],"references":{"2710889":"Learning Gene Linkage to Efficiently Solve Problems of Bounded Difficulty Using Genetic Algorithms","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","2521413":"Understanding Interactions Among Genetic Algorithm Parameters","2454246":"Evolutionary Search under Partially Ordered Fitness Sets","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","2782915":"A Variant of Evolution Strategies for Vector Optimization","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","2333106":"Simulated Binary Crossover for Continuous Search Space","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","201976350":"Messy Genetic Algorithms: Motivation, Analysis, and First Results","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","3662955":"GA-based decision support system for multicriteria optimization","216457304":"Lecture Notes in Computer Science","220702040":"On the Performance Assessment and Comparison of Stochastic Multiobjective Optimizers."},"citedIn":{},"index":546}