{"abs":"OF THE DISSERTATION GADO: A Genetic Algorithm for Continuous Design Optimization by Khaled Mohamed Rasheed Dissertation Director: Haym Hirsh Genetic algorithms (GAs) have been extensively used as a means for performing global optimization in a simple yet reliable manner. However, in some realistic engineering design optimization domains a general purpose GA is often inefficient and unable to reach the global optimum. In this thesis we describe a GA for continuous designspace optimization that uses new GA operators and strategies tailored to the structure and properties of engineering design domains. Empirical results in several realistic engineering design domains as well as benchmark design domains demonstrate that using our system can greatly decrease the cost of design space search, and can also improve the quality of the resulting designs. ii Acknowledgements I thank all members of the Rutgers HPCD (Hypercomputing and Design) project. In particular, I thank my advisors, Haym Hirs...","title":"Gado: A Genetic Algorithm For Continuous Design Optimization","id":2261304,"url":"https://www.researchgate.net/publication/2261304_Gado_A_Genetic_Algorithm_For_Continuous_Design_Optimization","names":["Mohamed Rasheed","Graduate School---new Brunswick","Haym Hirsh","Khaled Mohamed Rasheed"],"references":{"220801069":"Performance Degradation of Genetic Algorithms under Coordinate Rotation.","2485857":"Genetic Algorithms for Real Parameter Optimization","30870161":"Genetic engineering and design problems","2331428":"Guided Crossover: A New Operator for Genetic Algorithm Based Optimization","201976515":"A Comparative Evaluation of Search Methods Applied to Parametric Design of Aircraft","220118677":"Optimization by Simulated Annealing","221345340":"An Advanced Evolution Should Not Repeat its Past Errors.","23864802":"The application of artificial intelligence technology to aeronautical system design","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","243674974":"Optimal Blank Nesting Using Simulated Annealing","2295802":"Integrating A Genetic Algorithm Into A Knowledge-Based System For Ordering Complex Design Processes","2312952":"Intelligent Gradient-Based Search of Incompletely Defined Design Spaces","2787313":"Optimizing Engineering Designs Using a Combined Genetic Search","243776152":"The utility of nonlinear programming algorithms","228075706":"Machine Learning","220885705":"Car Suspension Design for Comfort Using Genetic Algorithm.","2507330":"The Generation Of Form Using An Evolutionary Approach","2787342":"A Comparison of Parallel and Sequential Niching Methods","3418513":"Evolutionary Computation: Comments on the History and Current State","2598475":"Working from Blueprints: Evolutionary Learning for Design","23832325":"Structural optimization by multilevel composition","220375122":"A Genetic Algorithm for Channel Routing in VLSI Circuits","242356870":"Adaptation In Natural And Artificial Systems","2754972":"Automated Optimization of Two Dimensional High Speed Missile Inlets","220885597":"An Experimental Comparison of Binary and Floating Point Representations in Genetic Algorithms.","243657714":"Numerical Optimization Techniques for Engineering Design: With Application","222501755":"A genetic algorithm for continuous design space search","2333082":"Using Case-Based Learning to Improve Genetic-Algorithm-Based Design Optimization","242372494":"Genetic algorithm in search","223938660":"Using Modeling Knowledge to Guide Design Space Search"},"citedIn":{"241294753":"Utility-Guided Search of Stochastically Generated Trees","220741097":"A Comparison of Genetic Algorithm Methods In Aerial Spray Deposition Management.","228488282":"MULTI-DISCIPLINARY OPTIMISATION OF A SUPERSONIC TRANSPORT AIRCRAFT WING PLANFORM","220743148":"Intelligent exploration for genetic algorithms: Using self-organizing maps in evolutionary computation","2331428":"Guided Crossover: A New Operator for Genetic Algorithm Based Optimization","235948311":"Validating Learnable Evolution Model on Selected Optimization and Design Problems","220547565":"Searching stochastically generated multi-abstraction-level design spaces","237712290":"An Evolutionary Approach To Standard Cell Design Automation","228569686":"Optimizing complex systems by intelligent evolution: The LEMd method and case study","222433864":"Optimization of 3D trusses with adaptive approach in genetic algorithms","237427113":"List of References on Constraint-Handling Techniques used with Evolutionary Algorithms","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","235948352":"Handling constrained optimization problems and using constructive induction to improve representation spaces in Learnable Evolution Model","264816219":"Optimising Aspects of Rotor Blades in Forward Flight","258549500":"Waveguide optimization via Evolutionary Algorithms","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","242578147":"Intelligent Exploration for Genetic Algorithms","3421614":"Multiobjective GA Optimization Using Reduced Models","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","2680118":"Applying Parallelism to Improve Genetic Algorithm-based Design Optimization","2356412":"An Adaptive Penalty Approach for Constrained Genetic-Algorithm Optimization","242190000":"A COMPARISON OF NATURE INSPIRED INTELLIGENT OPTIMIZATION METHODS IN AERIAL SPRAY DEPOSITION MANAGEMENT","220741321":"ASAGA: An adaptive surrogate-assisted genetic algorithm","2336578":"Optimization by Searching a Tree of Populations","221001480":"Using a genetic algorithm to optimize the gape of a snake jaw","2832654":"Constrained Multi-Objective GA Optimization Using Reduced Models","233002052":"Application of data-driven design optimization methodology to a multi-objective design optimization problem","256842467":"Multi-disciplinary optimisation of a supersonic transport aircraft wing planform","2269007":"Three Dimensional Optimization of Supersonic Inlets","221187202":"Solving the Economic Dispatch in Power System via a Modified Genetic Particle Swarm Optimization","256842465":"Multi-criteria Design Optimization of a Two dimensional Supersonic Inlet","256842081":"Single and Multi-Point Aerodynamic Optimizations of a Supersonic Transport Aircraft Wing Using Optimization Strategies Involving Adjoint Method and Genetic Algorithm","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","250889665":"A generative evolutionary design method","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","256842739":"Three-dimensional Optimization of Supersonic Inlets","249944474":"Nature Inspired Heuristics in Aerial Spray Deposition Management"},"index":550}