{"abs":"A simulated neural network has been connected to a simulated mechanical environment. The network is based on a model of the spinal central pattern generator producing rhythmic swimming movements in the lamprey and the model is similar to that used in earlier simulations of fictive swimming. Here, the network has been extended with a model of how motoneuron activity is transformed via the muscles to mechanical forces. Further, these forces are used in a two-dimensional mechanical model including interaction with the surrounding water, giving the movements of the different parts of the body. Finally, these movements are fed back through stretch receptors interacting with the central pattern generator. The combined model provides a platform for various simulation experiments relating the currently known neural properties and connectivity to the behavior of the animal in vivo. By varying a small set of parameters, corresponding to brainstem input to the spinal network, a variety of basic locomotor behaviors, like swimming at different speeds and turning can be produced. This paper describes the combined model and its basic properties.","title":"A combined neuronal and mechanical model of fish swimming. Biol Cybern","id":220450471,"url":"https://www.researchgate.net/publication/220450471_A_combined_neuronal_and_mechanical_model_of_fish_swimming_Biol_Cybern","names":["Örjan Ekeberg","Biological Cybernetics"],"references":{"247602944":"Directional Control of Fish Movement","233986550":"Fish Locomotion","249779686":"Locomotion in lamprey and trout: The relative timing of activation and movement","21278402":"Controlling the dynamics of a two-joined arm by central patterning and reflex-like processing - A two-stage hybrid model","21482176":"Neuronal Network Generating Locomotor Behavior in Lamprey: Circuitry, Transmitters, Membrane Properties, and Simulation","16905606":"Activation of NMDA receptors elicits ‘Active locomotion’ in lamprey spinal cord in vitro","19406178":"Simulation studies on the control of posture and movement in a multi-jointed limb","21604612":"Neural network simulations of coupled locomotor oscillators in the lamprey spinal cord. Biol. Cybern., 66:367-374","30759384":"Hydromechanics of swimming propulsion. Part 1. Swimming of a two-dimensional flexible plate at variable speeds in an inviscid fluid","21224270":"A model for neural control of gradation of muscle force","21243998":"Self-organized control of bipedal locomotion by neural oscillators in unpredictable environment. Biol Cybern 65:147-159","234150703":"Hydromechanics of Aquatic Animal Propulsion","21873110":"A computer-based model for realistic simulations of neural networks. II: The segmental network generating locomotor rhythmicity in the lamprey. J. Neurophysiol., 68:1939-1950","245388094":"Analysis of the Swimming of Long and Narrow Animals","21243995":"A computer based model for realistic simulations of neural networks. I. The single neuron and synaptic interaction. Biol Cybern","18722492":"On the generation of locomotion in the spinal dogfish. Exp Brain Res","21585195":"Matsushima, T. \u0026 Grillner, S. Neural mechanisms of intersegmental coordination in lamprey: local excitability changes modify the phase coupling along the spinal cord. J. Neurophysiol. 67, 373−388","21176234":"Synaptic effects of intraspinal stretch receptor neurons mediating movement-related feedback during locomotion. Brain Res","21432878":"Computer simulations of N-Methyl-D-Aspartate receptor-induced membrane properties in a neuron model J. Neurophysiol., 66(2):473-483","15054286":"Anguilliform Body Dynamics: Modelling the Interaction between Muscle Activation and Body Curvature","16011419":"Mechanosensitive neurons in the spinal cord of the lamprey. Brain Res","25461365":"Animal Locomotion","21743290":"Phase coupling by synaptic spread in chains of coupled oscillators. Science, 258:662-665","242082271":"Hydromechanics of swimming propulsion","15949895":"Entrainment of the spinal pattern generators for swimming by mechano-sensitive elements in the lamprey spinal cord in vitro","20298508":"N-Methyl-D-Aspartate (NMDA), kainate and quisqualate receptors and the generation of fictive locomotion in the lamprey spinal cord","17043262":"Fictive locomotion in the lamprey spinal cord in vitro compared with swimming in the intact and spinal animal. J Physiol (Lond)","228004781":"Control of Locomotion in Bipeds, Tetrapods, and Fish"},"citedIn":{"235966482":"Stability Analysis on Quadrupedal Gaits according to Body’s Flexibility using Musculoskeletal Robot","221530935":"Synthetic Approaches to Neurobiology: Review and Case Study in the Control of Anguiliform Locomotion","235966488":"A Study on Trunk Stiffness and Gait Stability in Quadrupedal Locomotion Using Musculoskeletal Robot","6927458":"Axiomatic Scalable Neurocontroller Analysis via the Shapley Value","222784843":"Emergence of bipedal locomotion through entrainment among the neuro-musculo-skeletal system and the environment. Phys D Nonlin Phenom 75(1-2): 190-208","260415381":"Fish (Spinibarbus Hollandi) dynamics in relation to changing hydrological conditions: Physical modelling, individual-based numerical modelling, and case study","224296783":"CPG-based control of a simulated snake-like robot adaptable to changing ground friction","3299366":"Motion planning for anguilliform locomotion","24205671":"The interaction of positive and negative sensory feedback loops in dynamic regulation of a motor pattern","3955237":"Experiments in closed-loop control for an underwater eel-like robot","228796346":"Undulatory locomotion of polychaete annelids: mechanics, neural control and robotic prototypes","2406975":"Biologically Inspired Neural Controllers for Motor Control in a Quadruped Robot.","224506234":"A Hybrid CPG–ZMP Controller for the Real-Time Balance of a Simulated Flexible Spine Humanoid Robot","271915028":"Pattern Generation and Control of a Double Pendulum using a Nonlinear Oscillator","7475281":"Corbacho, F., et al.: Schema-based learning of adaptable and flexible prey-catching in anurans I. The basic architecture. Biol. Cybern. 93, 391-409","224211838":"EEG discrimination using wavelet packet transform and a reduced-dimensional recurrent neural network","221001480":"Using a genetic algorithm to optimize the gape of a snake jaw","224141178":"Optimal Gaits for Mechanical Rectifier Systems","226632622":"Simulating the motion of the leech: A biomechanical application of DAEs","221531417":"Co-evolution of Structures and Controllers for Neubot Underwater Modular Robots","235966498":"An Adaptive Locomotion of a Quadruped Robot on Irregular Terrain using Simple Biomimetic Oscillator and Reflex Controllers without Visual Information","243611830":"Analysis of hydrodynamic forces on the model of a swimming salamander","235797560":"From lamprey to salamander: An exploratory modeling study on the architecture of the spinal locomotor networks in the salamander","220168489":"Modeling of Substance P and 5-HT Induced Synaptic Plasticity in the Lamprey Spinal CPG: Consequences for Network Pattern Generation.","222659453":"A waypoint-tracking controller for a biomimetic autonomous underwater vehicle","221530894":"Evolving Central Pattern Generators with Varying Number of Neurons","29608447":"Mouvements optimisés pour une propulsion anguilliforme","225100584":"CPG-based control of a turtle-like underwater vehicle","13542539":"Activity-dependent modulation of adaptation produces a constant burst proportion in a model of the lamprey spinal locomotor generator","4296198":"Optimized Gait Generation for Anguiliform Motion","261378012":"Dynamic model of a hyper-redundant, octopus-like manipulator for underwater applications","260283338":"Amphibious Pattern Design of a Robotic Fish with Wheel-propeller-fin Mechanisms","261237720":"Counter-propagating waves enhance maneuverability and stability: A bio-inspired strategy for robotic ribbon-fin propulsion","278711511":"Simulation of the Spinal Circuits Controlling Swimming Movements in Fish","10987255":"Force transmission via axial tendons in undulating fish: A dynamic analysis","5300738":"Ijspeert, A. J. Central pattern generators for locomotion control in animals and robots: A review. Neural Netw. 21, 642-653","259195172":"Simulation and Robotics Studies of Salamander Locomotion: Applying Neurobiological Principles to the Control of Locomotion in Robots","226480423":"Mapping motor neuron activity to overt behavior in the leech","4076646":"Neural oscillator network-based controller for meandering locomotion of snake-like robots","220474237":"Adaptive creeping locomotion of a CPG-controlled snake-like robot to environment change","222035809":"Neuromuscular control of reactive behaviors for undulatory robots","240041492":"Turning Maneuvers of an Octopus-inspired Multi-arm Robotic Swimmer","224623421":"Serpentine locomotion of a snake-like robot controlled by cyclic inhibitory CPG model","220142463":"Design, implementation and analysis of an alternation-based Central Pattern Generator for multidimensional trajectory generation","2806856":"Robot Arm Control Exploiting Natural Dynamics","228589564":"The influence of friction on gait and energy efficiency of the walking robot based on rhythmic control","232733116":"Proximal-to-Distal Sequencing Behavior and Motor Cortex","263380948":"Development of adaptive locomotion of a caterpillar-like robot based on a sensory feedback CPG model","40806409":"Mathematical study on ionic mechanism of lamprey central pattern generator model","277495010":"A model of the neuro-musculo-skeletal system for human locomotion I. Emergence of basic gait","240962103":"Modeling of the Spinal Neuronal Circuitry Underlying Locomotion in a Lower Vertebratea","276361747":"Octopus-inspired multi-arm robotic swimming","225265921":"A Novel Tuning Method for Neural Oscillators with a Ladder-Like Structure Based on Oscillation Analysis","7801369":"An Analysis of Neural Models for Walking Control","12917418":"Simulations of neuromuscular control in lamprey swimming","12758706":"Neural mechanisms potentially contributing to the intersegmental phase lag in lamprey II.: Hemisegmental oscillations produced by mutually coupled excitatory neurons","2474580":"Fair Attribution of Functional Contribution in Artificial and Biological Networks","44630748":"Entrainment ranges of forced phase oscillators","24177930":"Sensory Feedback Induced by Front-Leg Stepping Entrains the Activity of Central Pattern Generators in Caudal Segments of the Stick Insect Walking System","282792613":"Propulsive force of a magnetic, MRI - Based swimmer","270283363":"Modeling of underwater snake robots","243403267":"Swimming at low Reynolds number: A beginners guide to undulatory locomotion","12011571":"Bending the lamprey spinal cord causes a slowly-decaying increase in the frequency of fictive swimming","239064250":"The Neural Control of Fish Swimming Studied Through Numerical Simulations","4147897":"Reinforcement learning for a snake-like robot controlled by a central pattern generator","13494346":"A neuro-mechanical model of legged locomotion: Single leg control","253543829":"Flapping flexible fish. Periodic and secular body reconfigurations in swimming lamprey, Petromyzon marinus","228344593":"Evolving functional symmetry in a three dimensional model of an elongated organism","257334745":"Modeling and optimal design of Neuro-Mechanical Shape Memory Devices","272377517":"Strategies for swimming: explorations of the behaviour of a neuro-musculo-mechanical model of the lamprey","235782814":"Monte Carlo Methods for Simulating Realistic Synaptic Microphysiology Using MCell","216546942":"Modeling, Simulation and Optimization of Anguilliform Swimmers","282314826":"Finding answers to biological control methods using modulated patterns: An application to bio-inspired robotic fish","250949739":"Dynamics of two neuronlike elements with inhibitory feedback","240306893":"A Forced Damped Oscillation Framework for Undulatory Swimming Provides New Insights into How Propulsion Arises in Active and Passive Swimming","220648326":"Bio-mimetic trajectory generation using a neural time-base generator.","252029860":"Analytical control design for a biomimetic robotic fish","222572002":"A new mathematical formulation and fast algorithm for fully resolved simulation of self-propulsion","281946216":"A Neuronal Model of Central Pattern Generator to Account for Natural Motion Variation","5578994":"Location of Spinal Cord Pathways That Control Hindlimb Movement Amplitude and Interlimb Coordination During Voluntary Swimming in Turtles","287159220":"Experimental investigation of efficient locomotion of underwater snake robots for lateral undulation and eel-like motion patterns","6655695":"Simulations of optimized anguilliform swimming","3450526":"Polychaete-Like Undulatory Robotic Locomotion in Unstructured Substrates","6518472":"Computer simulation study on central pattern generator: From biology to engineering","4202733":"Increased swimming control with evolved lamprey CPG controllers","242314462":"COMPUTATIONAL PLAUSIBILITY OF STRETCH RECEPTORS AS THE BASIS FOR MOTOR CONTROL IN C. elegans","49729094":"A 3D Musculo-Mechanical Model of the Salamander for the Study of Different Gaits and Modes of Locomotion","270283437":"Modeling of underwater snake robots moving in a vertical plane in 3D","220065707":"Theoretical Analysis on Neural oscillator toward Biomimic Robot Control.","9077297":"Estimating the Strength and Direction of Functional Coupling in the Lamprey Spinal Cord","13573135":"Kafkafi, N. \u0026 Golani, I. A traveling wave of lateral movement coordinates both turning and forward walking in the ferret. Biol. Cybern. 78, 441-453","51242444":"Building a robotic link between muscle dynamics and hydrodynamics","33042741":"A simulation model of the locomotion controllers for the nematode Caenorhabditis elegans","254056425":"Sliding mode control design for a carangiform robotic fish","251752915":"Computer Simulation Of Heart Muscle In Contraction","2379457":"Using Evolutionary Methods to Parameterize Neural Models: a Study of the Lamprey Central Pattern Generator","221067205":"Dynamic model of a hyper-redundant, octopus-like manipulator for underwater applications","266474760":"Localization of Function via Multi-Perturbation Analysis: Theory And Applications for the Analysis of Neural Networks","221786069":"Central Pattern Generators for Gait Generation in Bipedal Robots","4249775":"Using Artificial Organisms To Study The Evolution of Backbones in Fish","224571793":"Coupled Van Der Pol oscillators utilised as Central pattern generators for quadruped locomotion","235632888":"Octopus-inspired Eight-arm Robotic Swimming by Sculling Movements","35442921":"Toward a formal framework for open-loop stabilization of rhythmic tasks.","7642764":"Biophysically detailed modelling of microcircuits and beyond","260254072":"Gating of steering signals through phasic modulation of reticulospinal neurons during locomotion","2489563":"Locomotion Vertebrate","228571489":"Numerical simulation of impact and lift-off events in the hydrostatic skeleton of the leech","257435743":"Backward swimming gaits for a carangiform robotic fish","281438671":"Integration of sensory feedback into CPG model for locomotion control of caterpillar-like robot","6532457":"Systems approach to modeling the neuronal CPG for leech swimming","42807680":"Reflexes and preflexes: on the role of sensory feedback on rhythmic patterns in insect locomotion. Biological Cybernetics 102:513-531","35275018":"Self-organization of locomotory controllers in robots and animals /","37423915":"A neuromechanical investigation of salamander locomotion","256540760":"A bioinspired autonomous swimming robot as a tool for studying goal-directed locomotion","228592311":"Swimming fish and fish-like models: the harmonic structure of undulatory waves suggests that fish actively tune their bodies","45941156":"Activity of bifunctional motoneurons during fictive locomotion: a computational modeling study","2646321":"A 3-D biomechanical model of the salamander","265970881":"Robotics and Neuroscience","37423911":"Evolution of neural controllers for salamander-like locomotion","37423910":"Synthetic approaches to neurobiology: review and case study in the control of anguiliform locomotion","224685178":"Generating Thrust with a Biologically-Inspired Robotic Ribbon Fin","37423909":"Evolving Swimming Controllers for a Simulated Lamprey with Inspiration from Neurobiology","23236162":"Nonlinear Muscles, Passive Viscoelasticity and Body Taper Conspire To Create Neuromechanical Phase Lags in Anguilliform Swimmers","255598111":"Mouvements optimis´ es pour une propulsion anguilliforme Optimised gait for Anguilliform Motion","37423901":"Evolution of a central pattern generator for the swimming and trotting gaits of the salamander","37423900":"Artificial Lampreys: Comparing Naturally and Artificially Evolved Swimming Controllers","245387148":"Guidance and control of a biomimetic autonomous underwater vehicle using body-fin propulsion","257889393":"Analysis of the gait generation principle by a simulated quadruped model with a CPG incorporating vestibular modulation","13068276":"A kinematic comparison of forward and backward swimming in the eel Anguilla anguilla","265516262":"Self-Organizing Map With Time-Varying Structure to Plan and Control Artificial Locomotion","220828703":"Fast simulation of animal locomotion: lamprey swimming","225249371":"Robust Simulation of Lamprey Tracking","38011261":"The Brain in Its Body: Motor Control and Sensing in a Biomechanical Context","245461919":"Design of a cyclic inhibitory CPG controller for the locomotion of a snakelike robot","225756727":"Central Pattern Generators: Optimisation and Application","225169447":"Improved, Simpler Neural Controllers for Lamprey Swimming","222074994":"Super-lampreys and wave energy: Optimised control of artificially-evolved, simulated swimming lamprey","51877465":"Theoretical and Evolutionary Parameter Tuning of Neural Oscillators with a Double-Chain Structure for Generating Rhythmic Signals","260586183":"Oscillation, Orientation, and Locomotion of Underactuated Multilink Mechanical Systems","6819129":"An elastic rod model for anguilliform swimming","259330086":"Flapping flexible fish","260340439":"Feedback Control as a Framework for Understanding Tradeoffs in Biology","228570826":"Geometric control of robotic locomotion systems","242206522":"Oscillator-Mechanical Model of the Pattern Transition on Quadrupedal Locomotion Based on Energy Expenditure","224342025":"A study on adaptive gait transition of quadruped locomotion","2680688":"From Lampreys to Salamanders: Evolving Neural Controllers for Swimming and Walking","7625518":"Integrating behavioral and neural data in a model of zebrafish network interaction","251859545":"Platform-Based Design of an Embedded Control System for Three-Dimensional Robotic Fish","259164200":"Locomotion Generation and Motion Library Design for an Anguilliform Robotic Fish","278694343":"Biomechanics and Neural Control of Posture and Movement","251848281":"CPG-based adaptable control of a snake-like robot","29649049":"Fast Quadratic Local Meta-Models for Evolutionary Optimization of Anguilliform Swimmers","261081810":"Control of flapping-wing rectifier systems in natural oscillation","252368494":"Chapter 7.2 Biologically Inspired Robots","225163279":"Locomotion of snake-like robots using adaptive neural oscillators","5586224":"On the derivation and tuning of phase oscillator models for lamprey central pattern generators","224651275":"Design of a snake-like robot controller with cyclic inhibitory CPG model","263866577":"EFFECT OF A FLEXIBLE SPINE EMOTIONAL BELLY DANCING ROBOT ON HUMAN PERCEPTIONS","49788315":"Mechanisms underlying rhythmic locomotion: Body-fluid interaction in undulatory swimming","235690851":"Decoding the mechanisms of gait generation in salamanders by combining neurobiology, modeling and robotics","282916781":"The Kinematics and Dynamics of Undulatory Motion of a Tuna-mimetic Robot","222551606":"A biomimetic sensor for a crawling minirobot","8444917":"Fair Attribution of Functional Contribution in Artificial and Biological Networks","256919078":"Optimal design of neuro-mechanical oscillators","286547054":"Biomimetic Adaptive Control Algorithms","213772602":"Hydrodynamics of Undulatory Propulsion","5360600":"Towards a general neural controller for quadrupedal locomotion. Neural Netw 21: 667-681","27529262":"Synthesis and analysis of a physical model of biological rhythmic motor control with sensorimotor feedback","242090465":"The Vertebrate Body Axis: Evolution and Mechanical Function1","4298192":"Neural Oscillator based Conrtol for Wrist Tremor Attenuation","223293149":"Assessing sensory function in locomotor systems using neuro-mechanical simulations. Trends Neurosci 29(11): 625-631","12665684":"Evolution and Development of a Central Pattern Generator for the Swimming of a Lamprey","6795260":"Systems-level modeling of neuronal circuits for leech swimming","221140149":"A Biologically Inspired Neural CPG for Sea Wave Conditions/Frequencies.","6683129":"Experiments and models of sensorimotor interactions during locomotion. Biol Cybern 95(6): 607-627","10918202":"From swimming to walking: A single basic network for two different behaviors","221603496":"Reinforcement Learning for CPG-Driven Biped Robot.","255608995":"Gait transition from swimming to walking: investigation of salamander locomotion control using nonlinear oscillators","259918558":"Sensitivity to external signals and synchronization properties of a non-isochronous auto-oscillator with delayed feedback","274382846":"Incremental Embodied Chaotic Exploration of Self-Organized Motor Behaviors with Proprioceptor Adaptation","7366613":"Sensory Feedback Mechanism Underlying Entrainment of Central Pattern Generator to Mechanical Resonance","14257022":"A Model of the Hydrostatic Skeleton of the Leech","224183030":"Simple Karman Street model","263904273":"FROM LAMPREY TO HUMANOID: THE DESIGN AND CONTROL OF A FLEXIBLE SPINE BELLY DANCING HUMANOID ROBOT WITH INSPIRATION FROM BIOLOGY","242140610":"Nonlinear Dynamics of the Human Motor Control RealTime and Anticipatory Adaptation of Locomotion and Development of Movements","6658505":"Dynamic control of the central pattern generator for locomotion. Biological Cybernetics, 95(6), 555-566","4176268":"Path Following Control for an Eel-Like Robot","228669458":"A dynamic body model of the nematode c. Elegans with neural oscillators","45598978":"The Dynamics of Legged Locomotion: Models, Analyses, and Challenges","15628120":"Neural networks controlling locomotion and body orientation in lamprey","12663671":"A Central pattern generator to control a pyloric-based system. Biological Cybernetics 82:85-94","51502759":"From neuron to behavior: Dynamic equation-based prediction of biological processes in motor control","254017692":"Gait generation and sliding mode control design for anguilliform biomimetic robotic fish","220741268":"Importing the Computational Neuroscience Toolbox into Neuro-Evolution---Application to Basal Ganglia","261731364":"A numerical investigation of flow around octopus-like arms: near-wake vortex patterns and force development","6408671":"Reinforcement learning for a biped robot based on a CPG-actor-critic method","233728559":"Hydrodynamic Analysis of Octopus-like Robotic Arms","232651807":"Locomotion Through Karman Street Using Adaptive Oscillator","2795497":"An Integrated Neuronal and Mechanical Model of Fish Swimming","220122330":"Optimal Gaits for Dynamic Robotic Locomotion.","270822381":"Schutter E. (ed.) Computational neuroscience. Realistic modeling for experimentalists (CRC, 2001)(ISBN 0849320682)(355s) B","11523426":"Evolutionary autonomous agents: A neuroscience perspective","221080291":"Causal Neural Control of a Latching Ocean Wave Point Absorber.","14511372":"Mapping motor neurone activity to overt behaviour in the leech. Internal pressures produced during locomotion. J. Exp. Biol., 199:1415-1428","15535929":"A model of the neuromusculoskeletal system for human locomotion. I. Emergence of basic gait. Biol Cybern","233728570":"Robotic Underwater Propulsion Inspired by the Octopus Multi-arm Swimming","224340106":"Gait Transition by Tuning Muscle Tones using Pneumatic Actuators in Quadruped Locomotion","2237946":"A Framework for Steering Dynamic Robotic Locomotion Systems","4262297":"Structural Evolution of Central Pattern Generators for Bipedal Walking in 3D Simulation","258282687":"Mutually opposing forces during locomotion can eliminate the tradeoff between maneuverability and stability","282884352":"Implementation of biomimetic central pattern generators on field-programmable gate array","235966413":"A Simulation Approach for an Infant Robot to Understand the Acquisition Process of Human Locomotion","15535922":"A model of the neuro-musculo-skeletal system for human locomotion II. Real-time adaptability under various constraints","221908187":"Tele-operation and Human Robots Interactions","40766860":"A hybrid CPG–ZMP control system for stable walking of a simulated flexible spine humanoid robot","224283324":"Chaotic Exploration and Learning of Locomotion Behaviors","10624327":"Intersegmental Coordination of Rhythmic Motor Patterns","235966454":"Feasibility Study on Stability of Gait Patterns with Changeable Body Stiffness Using Pneumatic Actuators in a Quadruped Robot","220168440":"Estimation of Coupling Strength in Regenerated Lamprey Spinal Cords Based on a Stochastic Phase Model","11979613":"A Connectionist Central Pattern Generator for the Aquatic and Terrestrial Gaits of a Simulated Salamander","221105350":"Parameter Design for a Central Pattern Generator Based Locomotion Controller.","281789735":"Research on realization and environmental adaptability of serpentine locomotion for a snake robot","221166301":"Evolving multi-segment \u0027super-lamprey\u0027 CPG\u0027s for increased swimming control.","2645469":"Visual Tracking in Simulated Salamander Locomotion","224651414":"Optimizationof CPG-network for decentralized control of a snake-like robot","7906703":"Dynamic Model of the Octopus Arm. I. Biomechanics of the Octopus Reaching Movement","45604172":"Neuromechanical Simulation","220168417":"Modulation of Burst Frequency by Calcium-Dependent Potassium Channels in the Lamprey Locomotor System: Dependence of the Activity Level.","222067907":"Ma, S.: CPG-based control of serpentine locomotion of a snake-like robot. Mechatronics 20(2), 326-334"},"index":551}