{"abs":"The graphics processing unit (GPU) has emerged as a powerful and cost effective processor for general performance computing. GPUs are capable of an order of magnitude more floating-point operations per second as compared to modern central processing units (CPUs), and thus provide a great deal of promise for computationally intensive statistical applications. Fitting complex statistical models with a large number of parameters and/or for large datasets is often very computationally expensive. In this study, we focus on Gaussian process (GP) models -- statistical models commonly used for emulating expensive computer simulators. We demonstrate that the computational cost of implementing GP models can be significantly reduced by using a CPU+GPU heterogeneous computing system over an analogous implementation on a traditional computing system with no GPU acceleration. Our small study suggests that GP models are fertile ground for further implementation on CPU+GPU systems.","title":"A Short Note on Gaussian Process Modeling for Large Datasets usingGraphics Processing Units","id":221669294,"url":"https://www.researchgate.net/publication/221669294_A_Short_Note_on_Gaussian_Process_Modeling_for_Large_Datasets_usingGraphics_Processing_Units","names":["Mark Franey","Pritam Ranjan","Hugh Chipman"],"references":{"220060988":"State-of-the-art in Heterogeneous Computing","216301381":"The Design and Analysis Computer Experiments","45904702":"A Computationally Stable Approach to Gaussian Process Interpolation of\nDeterministic Computer Simulation Data","225533427":"Optimization of Gaussian Process Models with Evolutionary Algorithms","51153575":"A Simple Approach to Ranking Differentially Expressed Gene Expression Time Courses through Gaussian Process Regression","51914869":"Efficient emulators of computer experiments using compactly supported correlation functions, with application to cosmology","228765709":"Covariance Tapering for Interpolation of Large Spatial Datasets","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","220105391":"Exploiting the capabilities of modern GPUS for dense matrix","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","243026761":"A modeling approach for large spatial datasets","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","220951249":"Multi-dimensional characterization of temporal data mining on graphics processors.","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","3512298":"ScaLAPACK: A scalable linear algebra library for distributed memory concurrent computers","223929671":"Reliable multi-objective optimization of high-speed WEDM process based on Gaussian process regression. Int J Mach Tool Manuf"},"citedIn":{"258082179":"Massively Parallel Approximate Gaussian Process Regression","265252310":"Speeding up neighborhood search in local Gaussian process prediction"},"index":555}