{"abs":"Evolutionary multi-objective optimization (EMO) may be computationally quite demanding, because instead of searching for a single optimum, one generally wishes to find the whole front of Pareto-optimal solutions. For that reason, parallelizing EMO is an important issue. Since we are looking for a number of Pareto-optimal solutions with different tradeoffs between the objectives, it seems natural to assign different parts of the search space to different processors. We propose the idea of cone separation which is used to divide up the search space by adding explicit constraints for each process. We show that the approach is more efficient than simple parallelization schemes, and that it also works on problems with a non-convex Pareto-optimal front.","title":"Parallelizing Multi-Objective Evolutionary Algorithms: Cone Separation","id":216300369,"url":"https://www.researchgate.net/publication/216300369_Parallelizing_Multi-Objective_Evolutionary_Algorithms_Cone_Separation","names":["Juergen Branke","Hartmut Schmeck","Kalyan Deb","Reddy.S Maheshwar"],"references":{"216300868":"Scalable Test Problems for Evolutionary Multi-Objective Optimization","3418741":"Considerations in engineering parallel multiobjective evolutionary algorithms. IEEE Trans Evol Comput","220265441":"Dual Guidance in Evolutionary Multi-objective Optimization by Localization","245531009":"Asynchronous migration of island parallel GA for multi-objective optimization problems","3418716":"Parallelism and evolutionary algorithms","243779054":"Efficient and Accurate Parallel Genetic Algorithms. Boston: Kluwer","3776434":"Sub-population policies for a parallel multiobjective genetic algorithm with applications to wing design","2333106":"Simulated Binary Crossover for Continuous Search Space","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","221392742":"PSFGA: A Parallel Genetic Algorithm for Multiobjective Optimization.","216300368":"Integrating User Preferences into Evolutionary Multi-Objective Optimization","2751388":"Parallel Genetic Solution for Multiobjective MDO","243785938":"Parallel implementations of evolutionary algorithms","3865100":"New model of parallel genetic algorithm in multi-objective optimization problems - Divided Range Multi-Objective Genetic Algorithm","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","221228629":"Distributed Computing of Pareto-Optimal Solutions with Evolutionary Algorithms","216457304":"Lecture Notes in Computer Science"},"citedIn":{"272367925":"Feature selection in high-dimensional EEG data by parallel multi-objective optimization","224316884":"A study of master-slave approaches to parallelize NSGA-II","265145799":"PARALLELIZATION OF AN EVOLUTIONARY ALGORITHM FOR MULTIOBJECTIVE OPTIMIZATION","224384981":"Dynamic Multiple Swarms in Multiobjective Particle Swarm Optimization","257614928":"Approaches to Parallelize Pareto Ranking in NSGA-II Algorithm","221008061":"Parallel Multi-objective Optimization using Master-Slave Model on Heterogeneous Resources","281049682":"On Using Populations of Sets in Multiobjective Optimization","233076342":"Implementing co-evolution and parallelization in a multi-objective particle swarm optimizer","224472181":"Dynamic Search Initialisation Strategies for Multi-Objective Optimisation in Peer-to-Peer Networks","283804158":"Parallel Multiobjective Evolutionary Algorithms","257512782":"The review of multiple evolutionary searches and multi-objective evolutionary algorithms","225141238":"Local models—an approach to distributed multi-objective optimization","281897298":"A hybrid evolutionary multiobjective optimization algorithm with adaptive multi-fitness assignment","216457282":"Multi-objective particle swarm optimization on computer grids","221025416":"Parallel Approaches for Multiobjective Optimization","228442037":"An Empirical Study on Parallel Multi-objective Genetic Algorithms: 0/1 Knapsack Problem-A Case Study","230712168":"Multiple Populations for Multiple Objectives: A Coevolutionary Technique for Solving Multiobjective Optimization Problems","265869425":"Distinct Candidates Optimization: A Novel Approach to Applied Evolutionary Multi-and Many-Objective Optimization","288981648":"Parallel Multi-objective Memetic Algorithm for Competitive Facility Location","42622112":"Asynchronous Multi-Objective Optimisation in Unreliable Distributed Environments","220200113":"Multi-objective Distinct Candidates Optimization: Locating a few highly different solutions in a circuit component sizing problem","278698163":"Effective local evolutionary searches distributed on an island model solving bi-objective optimization problems. Appl Intell","226064331":"Parallel Evolutionary Multiobjective Optimization","257635560":"An effective model of multiple multi-objective evolutionary algorithms with the assistance of regional multi-objective evolutionary algorithms: VIPMOEAs","281961722":"An evolutionary multiobjective optimization algorithms framework with algorithm adaptive selection","220204312":"A Hybrid Parallel Multi-Objective Genetic Algorithm for 0/1 Knapsack Problem.","235013304":"Using Application-Domain Knowledge in the Runtime Support of Multi-Experiment Computational Studies","228571684":"Hybrid Representation for Compositional Optimization and Parallelizing MOEAs","224202342":"MpAssign: A framework for solving the many-core platform mapping problem","220826644":"Self-organized Parallel Cooperation for Solving Optimization Problems","220948245":"Parallel Hypervolume-Guided Hyperheuristic for Adapting the Multi-objective Evolutionary Island Model","220160417":"Metco: a Parallel Plugin-Based Framework for Multi-Objective Optimization.","276534853":"Distributed Evolutionary Algorithms and Their Models: A Survey of the State-of-the-Art","264827383":"Distributed Localized Bi-objective Search","274834977":"Clustering Based Parallel Many-Objective Evolutionary Algorithms Using the Shape of the Objective Vectors","230583804":"Self-organized Invasive Parallel Optimization","221608816":"Distribution of Computational Effort in Parallel MOEA/D","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","47757713":"Lecture Notes in Computer Science","254461799":"Asynchronous Master/Slave MOEAs and Heterogeneous Evaluation Costs","262605034":"Decomposition of a Multiobjective Optimization Problem Into a Number of Simple Multiobjective Subproblems","272014689":"Parallel alternatives for evolutionary multi-objective optimization in unsupervised feature selection","221228534":"Recombination of Similar Parents in EMO Algorithms","225232566":"Interleaving Guidance in Evolutionary Multi-Objective Optimization","235709910":"pMOHypEA: Parallel Evolutionary Multiobjective Optimization using Hypergraphs","30859148":"Design for Disassembly With High-Stiffness Heat-Reversible Locator-Snap Systems","230825241":"A chemical evolutionary mechanism for instantiating service-based applications","224678329":"Parallel Multi-Objective Evolutionary Algorithm with Multi-Front Equitable Distribution","221611242":"A Parallel Plugin-Based Framework for Multi-objective Optimization","261598582":"Controller tuning using evolutionary multi-objective optimisation: Current trends and applications","262367685":"MpAssign: A Framework for Solving the Many-Core Platform Mapping Problem","228998479":"Discussion of Clustering and Network Inversion for Multi-Objective Genetic Algorithms","265675583":"Parallelizing Multi-objective Evolutionary Genetic Algorithms","264709932":"Physical programming for preference driven evolutionary multi-objective optimization","228771794":"Communication strategies in distributed evolutionary algorithms for multi-objective optimization","220741721":"Discussion of parallel model of multi-objective genetic algorithms on heterogeneous computational resources","221228382":"Parallelization of Multi-objective Evolutionary Algorithms Using Clustering Algorithms","220742234":"Evolutionary Multiobjective Optimization","221024990":"Future Challenges.","221228379":"Adaptation of Scalarizing Functions in MOEA/D: An Adaptive Scalarizing Function-Based Multiobjective Evolutionary Algorithm","229000784":"The Multi-Objective Distinct Candidates Optimization approach","258108308":"Comparison of Frameworks for Parallel Multiobjective Evolutionary Optimization in Dynamic Problems","280735301":"Parallelizing Multi-objective Evolutionary Genetic Algorithms"},"index":557}