{"abs":"a b s t r a c t The interacting particle system (IPS) is a recent probabilistic model proposed to estimate rare event probabilities for Markov chains. The principle of IPS is to apply alternatively selection and mutation stages to a set of initial particles in order to estimate probabilities or quantiles more accurately than with usual estimation techniques. The practical issue of IPS is the tuning of a parameter in the selection stage. Kriging-based optimisation strategy with a low simulation cost is thus proposed in order to minimise the probability estimate relative error. The efficiency of the proposed strategy is demonstrated on different test cases.","title":"Optimisation of interacting particle systems for rare event estimation","id":241707670,"url":"https://www.researchgate.net/publication/241707670_Optimisation_of_interacting_particle_systems_for_rare_event_estimation","names":["Jérôme Morio","Damien Jacquemart","Mathieu Balesdent","Julien Marzat","Computational Statistics \u0026 Data Analysis"],"references":{"226593475":"Branching and Interacting Particle Interpretations of Rare Event Probabilities","257335184":"A benchmark of kriging-based infill criteria for noisy optimization","222527684":"Sequential Monte Carlo estimation of aerosol size distributions","46510925":"Particle methods for the estimation of credit portfolio loss distributions","245432489":"Conflict Probability for Free Flight","2830179":"Automatic Parameter Selection by Minimizing Estimated Error","242386046":"Estimation of Particle Transmission by Random Sampling","29607955":"On Adaptive Resampling Procedures for Sequential Monte Carlo Methods","233801151":"Generalized Cross-Validation as a Method for Choosing a Good Ridge Parameter","227446046":"Importance Sampling for Stochastic Simulations","3114301":"Genetic algorithms in controller design and tuning","29596955":"Genetic Genealogical Models in Rare Event Analysis","216300861":"A Taxonomy of Global Optimization Methods Based on Response Surfaces","223543241":"Soft computing approach for reliability optimization: State-of-the-art survey","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","223779720":"Interacting sequential Monte Carlo samplers for trans-dimensional simulation","3152495":"Splitting-based importance-sampling algorithm for fast simulation of Markov reliability models with general repair-policies","265815481":"An Introduction to Rare Event Simulation","216301381":"The Design and Analysis Computer Experiments","222821925":"Simulations of rare events in fiber optics by interacting particle systems","239415015":"Automated Tuning of an Extended Kalman Filter Using the Downhill Simplex Algorithm","226216344":"Lipschitzian Optimisation Without the Lipschitz Constant","220218116":"Particle swarm optimization for parameter determination and feature selection of support vector machines","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","224208186":"Automatic tuning via Kriging-based optimization of methods for fault detection and isolation","222550692":"Model Selection for Support Vector Machine Classification","3304543":"Prediction from wrong models: The Kriging approach","238342681":"Principles of geostatistics. Econ Geol (Lancaster)","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","222540659":"Simulation-based sequential analysis of Markov switching stochastic volatility models","223882024":"A model for parameter setting based on Bayesian networks","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","269212986":"Conflict probability estimation for free flight","256081136":"Conflict probability estimation between aircraft with dynamic importance Splitting","2126101":"Genealogical particle analysis of rare events","221668291":"On adaptive resampling strategies for sequential Monte Carlo methods","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","226437062":"Interacting particle systems for the computation of rare credit portfolio losses","216301406":"Computer Experiments and Global Optimization","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","254407956":"A particle swarm algorithm with broad applicability in shape-constrained estimation","4213821":"Limit theorems for the multilevel splitting algorithm in the simulation of rare events","3885893":"Introduction to simulation","216300827":"Automatic Algorithm Configuration based on Local Search","41896000":"Bayesian Wombling: Curvilinear Gradient Assessment Under Spatial Process Models."},"citedIn":{"275722245":"Probability of failure sensitivity with respect to decision variables"},"index":559}