{"abs":"We present some applications of an Interacting Particle System (IPS) methodology to the field of Molecular Dynamics. This IPS method allows several simulations of a switched random process to keep closer to equilibrium at each time, thanks to a selection mechanism based on the relative virtual work induced on the system. It is therefore an efficient improvement of usual non-equilibrium simulations, which can be used to compute canonical averages, free energy differences, and typical transitions paths.","title":"Equilibrium Sampling From Nonequilibrium Dynamics","id":1848003,"url":"https://www.researchgate.net/publication/1848003_Equilibrium_Sampling_From_Nonequilibrium_Dynamics","names":["Mathias Rousset","Gabriel Stoltz","Journal of Statistical Physics"],"references":{"215625690":"Statistical Mechanics of Fluid Mixtures","220132508":"On the Control of an Interacting Particle Estimation of Schrödinger Ground States","12059515":"Free-energy reconstruction from nonequilibrium single-molecule experiments","245917742":"Di usion Monte Carlo with a xed number of walkers","241322602":"Population Annealing and Its Application to a Spin Glass","222071733":"Multicanonical algorithms for 1st order phase-transitions","222866627":"Constrained Reaction Coordinate Dynamics for the Simulation of Rare Events","220118677":"Optimization by Simulated Annealing","41713393":"Theoretical and numerical comparison of some sampling methods for molecular dynamics. Esaim Math. Model. Numer. Anal. 41, 351-389","246374880":"High temperature equation of state by a perturbation method","266311824":"Random perturbations of dynamical systems: Large deviations and averaging","247650070":"Stochastic boundary con-ditions for molecular dynamics simulations of ST2 water","225136380":"Branching and Interacting Particle Systems Approximations of Feynman–Kac Formulae with Applications to Non-linear Filtering","1825409":"Sequential monte carlo samplers","1824256":"Extended Ensemble Monte Carlo","6933621":"Practical Applicability of the Jarzynski Relation in Statistical Mechanics: A Pedagogical Example †","255482463":"Brownian Motion and Stochastic Calculus","8441701":"Single-ensemble nonequilibrium path-sampling estimates of free energy differences","1990329":"Simulated Tempering: A New Monte Carlo Scheme","6933632":"Biased Sampling of Nonequilibrium Trajectories: Can Fast Switching Simulations Outperform Conventional Free Energy Calculation Methods? †","222440936":"Stochastic boundary conditions for molecular dynamics simulations of ST2 water","246864219":"Molecular dynamics of liquid alkanes","38326887":"Simulating Normalizing Constants: From Importance Sampling to Bridge Sampling to Path Sampling","228696977":"Equilibrium free energies from path sampling of nonequilibrium trajectories","240676904":"Free-energy calculation in material research","12240074":"Diffusion Monte Carlo with a fixed number of walker","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","200744518":"Sequential Monte-Carlo Methods in Practice","222729525":"Non-Physical Sampling Distributions in Monte-Carlo Free-Energy Estimation - Umbrella Sampling","228645651":"An interacting particle system approach for molecular dynamics","241615189":"High-Temperature Equation of State by a Perturbation Method. II. Polar Gases","2306327":"Annealed Importance Sampling","222687664":"Computation of free energy differences through nonequilibrium stochastic dynamics: The reaction coordinate case","244424743":"Editors: Sequential Monte Carlo Methods in Practice","234895543":"High‐Temperature Equation of State by a Perturbation Method. I. Nonpolar Gases","1871781":"Equilibrium free-energy differences from nonequilibrium measurements: A master-equation approach","226242182":"Nonequilibrium Measurements of Free Energy Differences for Microscopically Reversible Markovian Systems","1824801":"A \"fast growth\" method of computing free energy differences","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","1869025":"Nonequilibrium Equality for Free Energy Differences","263450188":"Annealed importance sampling. Statist"},"citedIn":{"222665157":"Path sampling with stochastic dynamics: Some new algorithms","7173864":"Direct Evaluation of Large-Deviation Functions","238623199":"Ecole ECODOQUI: résumé du cours Dynamique moléculaire et calcul d\u0027énergie libre","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","278816281":"Mathematical and numerical analysis of some models for materials, from the microscopic scale to the macroscopic scale","266541321":"Stochastic models and methods. An introduction with applications","41705552":"Some remarks on sampling methods in Molecular Dynamics","225164549":"Web ensemble averages for retrieving relevant information from rejected Monte Carlo moves","220286671":"On population-based simulation for static inference","48167921":"A comparison between the quasi-species evolution and stochastic\nquantization of fields","29607955":"On Adaptive Resampling Procedures for Sequential Monte Carlo Methods","50425584":"Sequential Monte Carlo Samplers: Error Bounds and Insensitivity to Initial Conditions","222687664":"Computation of free energy differences through nonequilibrium stochastic dynamics: The reaction coordinate case","5226904":"Measurement of nonequilibrium entropy from space-time thermodynamic integration","1825409":"Sequential monte carlo samplers","4993330":"Sequential Monte Carlo Samplers"},"index":563}