{"abs":"It has recently been shown that the Helmholtz free energy difference between two equilibrium configurations of a system may be obtained from an ensemble of finite-time (nonequilibrium) measurements of the work performed in switching an external parameter of the system. Here this result is established, as an identity, within the master equation formalism. Examples are discussed and numerical illustrations provided. Comment: 29 pages + 9 figures, to appear in Phys Rev E","title":"Equilibrium free-energy differences from nonequilibrium measurements: A master-equation approach","id":1871781,"url":"https://www.researchgate.net/publication/1871781_Equilibrium_free-energy_differences_from_nonequilibrium_measurements_A_master-equation_approach","names":["Christopher Jarzynski","Physical review. E, Statistical physics, plasmas, fluids, and related interdisciplinary topics"],"references":{"252276105":"Absolute entropy of simple point charge model water by adiabatic switching processes","237008770":"Understanding Molecular Simulation: From Algorithms to Applications (Academic Press","234930051":"Free Energy of Hydrophobic Hydration: A Molecular Dynamics Study of Noble Gases in Water","200105001":"Equation of State by Fast Computing Machines","13392806":"Hoover, W.R.: Canonical dynamics: Equilibrium phase-space distributions. Phys. Rev. A 31, 1695","13329760":"Free energy via thermostatted dynamic potential-energy changes","13246855":"Direct dynamical calculation of entropy and free energy by adiabatic switching","222449901":"Efficient Estimation of Free Energy Differences from Monte Carlo Data","222729525":"Non-Physical Sampling Distributions in Monte-Carlo Free-Energy Estimation - Umbrella Sampling","227194265":"The goodness of ergodic adiabatic invariants","20939755":"Molecular-Dynamics simulations in biology.","252268159":"Variational path optimization and upper and lower bounds to free energy changes via finite time minimization of external work","237725107":"Kinetic moments method for the canonical ensemble distribution","234992346":"A finite‐time variational method for determining optimal paths and obtaining bounds on free energy changes from computer simulations","231446807":"An Approach to the Application of Free Energy Perturbation Methods Using Molecular Dynamics: Applications to the Transformations of CH3OHCH3CH3, H3O+NH, GlycineAlanine, and AlaninePhenylalanine in Aqueous Solution and to H3O+(H2O)3NH (H2O)3 in the Gas Phase","1869025":"Nonequilibrium Equality for Free Energy Differences"},"citedIn":{"237816364":"Computational Design of New Peptide Inhibitors for Amyloid Beta (Aβ) Aggregation in Alzheimer\u0027s Disease: Application of a Novel Methodology","51021570":"Determining Equilibrium Constants for Dimerization Reactions from Molecular Dynamics Simulations","47733457":"Free energy computations by minimization of Kullback-Leibler divergence: An efficient adaptive biasing potential method for sparse representations","233736676":"Biotic Abstract Dual Automata (BiADA): A Novel Tool for Studying the Evolution of Prebiotic Order (and the Origin of Life)","1883154":"Illustration of the Jarzynski nonequilibrium work relation for an ideal gas","24395131":"Efficient extraction of free energy profiles from nonequilibrium experiments","265869256":"Forcing substrates through channels","281197776":"Polymer folding via external potentials in ab-initio calculations","1908750":"Getting Your Eye In: A Bayesian Analysis of Early Dismissals in Cricket","46422737":"Formation of the internal structure of solids under severe load","7952495":"Dynamical generalization of nonequilibrium work relation","46422749":"Physical origins of entropy production, free energy dissipation, and their mathematical representations","51475211":"Towards computional specificity screening of DNA-binding proteins","6933621":"Practical Applicability of the Jarzynski Relation in Statistical Mechanics: A Pedagogical Example †","51394317":"Nonequilibrium fluctuation theorems in the presence of local heating","243102303":"Amathematical approach to jarzynski\u0027s identity in nonequilibrium statistical mechanics","23952713":"QM/MM methods for biomolecular systems. Angew Chem Int Ed 48:1198","264742882":"Entropy production in a non-Markovian environment","283030776":"Thermodynamics and Kinetics of Drug Binding","261404607":"Fun and Games in Berkeley: The Early Years (1956-2013)","1846317":"Foundations of Statistical Mechanics: in and out of Equilibrium","7305307":"Ordering of limits in the Jarzynski equality","271710213":"Free energies of molecular clusters determined by guided mechanical disassembly","1824801":"A \"fast growth\" method of computing free energy differences","2167838":"Systematic Finite-Sampling Inaccuracy in Free Energy Differences and Other Nonlinear Quantities","261672871":"Optimal driving of isothermal processes close to equilibrium","43022034":"Three Detailed Fluctuation Theorems","275717160":"On the ambiguity of conformational states: A B\u0026S-LEUS simulation study of the helical conformations of decaalanine in water","263052263":"Equivalence of two Bochkov-Kuzovlev equalities in quantum two-level systems","241590824":"On the sampling requirements for exponential-work free-energy calculations","222577942":"Quantum work statistics of linear and nonlinear parametric oscillators","7715878":"Free Energy Surfaces from Single-Molecule Force Spectroscopy","269935685":"Fluctuations in driven systems","11398392":"Crooks, G. E. Entropy production fluctuation theorem and the nonequilibrium work relation for free energy differences. Phys. Rev. E 60, 2721-2726","8443095":"Calculating potentials of mean force from steered molecular dynamics simulation","230590950":"Estimation of Free-Energy Differences from Computed Work Distributions: An Application of Jarzynski\u0027s Equality","45889248":"Linear response theory and transient fluctuation relations for diffusion processes: A backward point of view","37256792":"Empty space and how things move around in it","23999754":"A potential of mean force estimator based on nonequilibrium work exponential averages","234843543":"Stochastic thermodynamics: An introduction","10715338":"Developing an energy landscape for the novel function of a ( / )8 barrel: Ammonia conduction through HisF","224023859":"Molecular Dynamics and the Accuracy of Numerically Computed Averages","258667271":"Numerical Study on the Generalized Second Law for a Brownian Particle under the Linear Feedback Control","265608123":"Potential and flux field landscape theory. II. Non-equilibrium thermodynamics of spatially inhomogeneous stochastic dynamical systems","1733742":"The \"footprints\u0027\u0027 of irreversibility","7604225":"Conformational Substates Modulate Hydride Transfer in Dihydrofolate Reductase","7888910":"Structural Elements in IGP Synthase Exclude Water to Optimize Ammonia Transfer","263703488":"Nonequilibrium thermodynamics and fluctuation relations for small systems","49720974":"Understanding free-energy perturbation calculations through a model of harmonic oscillators: Theory and implications to improve the sampling efficiency by molecular simulation","49699470":"A Generalized Free Energy Perturbation Theory Accounting for End States with Differing Configuration Space Volume","231078331":"The transient fluctuation theorem of sample entropy production for general stochastic processes","222665157":"Path sampling with stochastic dynamics: Some new algorithms","46586432":"Modified Fluctuation-dissipation theorem for non-equilibrium\nsteady-states and applications to molecular motors","225787389":"Generalized Jarzynski’s Equality of Inhomogeneous Multidimensional Diffusion Processes","11513895":"Forces and energetics of hapten-antibody dissociation: A biased molecular dynamics simulation study","7387387":"Kolmogorov-Sinai Entropy of the Dilute Wet Granular Gas","23146986":"Accuracy and convergence of free energy differences calculated from nonequilibrium switching processes","12036154":"Steered molecular dynamics and mechanical functions of proteins. Curr. Opin. Struct. Biol. 11: 224-230","278321176":"Single-Molecule Biophysics: Experiment and Theory, Volume 146","233756031":"New Soft-Core Potential Function for Molecular Dynamics Based Alchemical Free Energy Calculations","24279521":"Assessment of Nonequilibrium Free Energy Methods","271702183":"Work and heat fluctuations of mechanical systems driven out of equilibrium (Fluctuations du travail et de la chaleur dans des systèmes mécaniques hors d\u0027équilibre)","233872720":"Comparison of free-energy estimators and their dependence on dissipated work","7669972":"Entropy and density of states from isoenergetic nonequilibrium processes","1849535":"Relativistic Fluctuation Theorems","231248235":"Simple, Efficient, and Reliable Computation of Multiple Free Energy Differences from a Single Simulation: A Reference Hamiltonian Parameter Update Scheme for Enveloping Distribution Sampling (EDS)","24411607":"Optimizing the switching function for nonequilibrium free-energy calculations: An on-the-fly approach","258442180":"Optimal protocols and the Jarzynski equality","7900368":"Enhancing the accuracy, the efficiency and the scope of free energy simulations","257591286":"Entropy production of a mechanically driven single oligomeric enzyme: A consequence of fluctuation theorem","243569205":"Nonequilibrium Relations for Spin Glasses with Gauge Symmetry","8995898":"Large Scale Simulation of Protein Mechanics and Function","43350563":"Coarse-Grained Potential Models for Phenyl-Based Molecules: I. Parametrization Using Experimental Data","260003784":"Boosting work characteristics and overall heat-engine performance via shortcuts to adiabaticity: Quantum and classical systems","49648207":"Behavior of the ATP grasp domain of biotin carboxylase monomers and dimers studied using molecular dynamics simulations","255687553":"Fluctuation Relations in Stochastic Thermodynamics","5492974":"Study on the mechanism of the BtuF periplasmic-binding protein for vitamin B12","40691409":"Helix propensities calculations for amino acids in alanine based peptides using Jarzynski\u0027s equality","6162590":"Single molecule pulling with large time steps","51572689":"The mean reaction force: A method to study the influence of the environment on reaction mechanisms","225117615":"Nonequilibrium Fluctuations of a Single Biomolecule","26858845":"Extended forms of the second law for general time-dependent stochastic processes","49819198":"Escorted free energy simulations","6162585":"Nonequilibrium work fluctuations for oscillators in non-Markovian baths","51462102":"Large-scale integrated super-computing platform for next generation virtual drug discovery","276126909":"Molecular Dynamics Simulations of the Human Glucose Transporter GLUT1","49750590":"Unfying approach for fluctuation theorems from joint probability distributions","51417052":"Brownian motion of a classical harmonic oscillator in a magnetic field","26720602":"Fluctuation relations for a classical harmonic oscillator in an electromagnetic field","283433002":"Einstein Relation for Electrons in an Electric Field","24172964":"Exploring hysteresis and energy dissipation in single-molecule force spectroscopy","26858828":"Asymptotics of work distributions in nonequilibrium systems","266320646":"Mechanisms of Integral Membrane Protein Insertion and Folding","224056704":"Recent results from computer simu-lations of membrane channels and pumps","260584276":"Multiscale Modeling of Elasticity and Fracture in Organic Nanotubes","26720586":"Generalized integral fluctuation theorem for diffusion processes","7542956":"Scalable molecular dynamics with NAMD. Comp. Chem. 26, 1781-1802","6705337":"Crooks equation for steered molecular dynamics using a Noś-Hoover thermostat","266856196":"Capturing Exponential Variance Using Polynomial Resources: Applying Tensor Networks to Nonequilibrium Stochastic Processes","279520330":"Nanomechanics of PCNA: a protein-made DNA sliding clamp","1821950":"Population Monte Carlo algorithms Trans","233146624":"Approaching post-Hartree-Fock quality potential energy surfaces with simple pair-wise expressions: Parameterising point-charge-based force fields for liquid water using the adaptive force matching method","279991381":"Orthogonal sampling in free-energy calculations of residue mutations in a tripeptide: TI versus -LEUS","243413604":"LETTER TO THE EDITOR: Integral fluctuation theorem for the housekeeping heat","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","44612161":"Protein Thermostability Calculations Using Alchemical Free Energy Simulations","6449295":"Jarzynski equality: Connections to thermodynamics and the second law","45898322":"Non-Equilibrium Statistical Physics of Currents in Queuing Networks","1954024":"Thermodynamic Irreversibility from High-Dimensional Hamiltonian Chaos","222687664":"Computation of free energy differences through nonequilibrium stochastic dynamics: The reaction coordinate case","263990089":"Nonequilibrium Work Relations for Polymer Dynamics in Dilute Solutions","51417066":"Continuous-time random walk for open systems: Fluctuation theorems and counting statistics","273471664":"Deep Unsupervised Learning using Nonequilibrium Thermodynamics","236959516":"Model Selection Approach Suggests Causal Association between 25-Hydroxyvitamin D and Colorectal Cancer","26858653":"Understanding interactions between capped nanocrystals: Three-body and chain packing effects","269181197":"Towards bulk thermodynamics via non-equilibrium methods: Gaseous methane as a case study","231859417":"Nonadiabatic entropy production for non-Markov dynamics","264870594":"Fluctuation Relations for Stochastic Systems far from Equilibrium","29467850":"Deterministic derivation of non-equilibrium free energy theorems for natural isothermal isobaric systems","43020190":"Characterizing steady state and transient properties of reaction-diffusion systems","29470931":"Dissipation and the Relaxation to Equilibrium","234942230":"Fast-growth thermodynamic integration: Error and efficiency analysis","235410206":"On the origin and use of fluctuation relations on the entropy","266858224":"Flexible Docking-Based Molecular Dynamics/Steered Molecular Dynamics Calculations of Protein–Protein Contacts in a Complex of Cytochrome P450 1A2 with Cytochrome b5","264463066":"Proton-coupled sugar transport in the prototypical major facilitator superfamily protein XylE","227232937":"Perspective: Free Energies and Phase Equilibria","23670861":"Domain motions of hyaluronan lyase underlying processive hyaluronan translocation","50948654":"Nonequilibrium Work on Spin Glasses in Longitudinal and Transverse Fields","230723815":"ChemInform Abstract: Covalent Mechanochemistry: Theoretical Concepts and Computational Tools with Applications to Molecular Nanomechanics","234868951":"Generalized Jarzynski’s equality in inhomogeneous Markov chains","221778960":"GMCT: A Monte Carlo simulation package for macromolecular receptors","6449481":"On the work distribution for the adiabatic compression of a dilute classical gas","256985724":"Structure-Based, Rational Design of T Cell Receptors","40769344":"Feature Article Basic Ingredients of Free Energy Calculations: A Review","232739056":"Solvent-driven symmetry of self-assembled nanocrystal superlattices-A computational study","7294300":"Calculating potentials of mean force and diffusion coefficients from nonequilibrium processes without Jarzynski equality","2306327":"Annealed Importance Sampling","233737430":"Stochastic thermodynamics, fluctuation theorems, and molecular machines","1858855":"Negative Entropy Production in Oscillatory Processes","8387907":"Effect of Quantum Collapse on the Distribution of Work in Driven Single Molecules","47819673":"A Note on Non-equilibrium Work Fluctuations and Equilibrium Free Energies","244989915":"Dynamic phase transitions in simple driven kinetic networks","264872586":"Theorie zu kraftmikroskopischen Einzelmolekülexperimenten an Biopolymeren","250754999":"Chapter 4 Alchemical Free Energy Calculations: Ready for Prime Time?","257376797":"Nanoindentation of biomembrane by carbon nanotubes – MD simulation","1736022":"Fluctuation relations in simple examples of non-equilibrium steady states","51230274":"Free energy calculations of protein-ligand interactions","23997503":"Nonequilibrium work relations for systems subject to mechanical and thermal changes","51395138":"Escorted Free Energy Simulations: Improving Convergence by Reducing Dissipation","1831247":"Mechanical Response of Random Heteropolymers","291814448":"Using nonequilibrium measurements to determine macromolecule free-energy differences","6904125":"Theory for non-equilibrium statistical mechanics","51417669":"Nonequilibrium Free-Energy Relations for Thermal Changes","51944015":"Nonequilibrium Work Relation in Macroscopic System","259650081":"Probing the Mechanisms of Translation with Force","257918469":"The nonequilibrium work relation in small systems","7484718":"Calculation of Absolute Protein-Ligand Binding Affinity Using Path and Endpoint Approaches","252670546":"Thermal fluctuations in systems driven away from equilibrium","251411362":"Nonequilibrium Umbrella Sampling and the Functional Crooks Fluctuation Theorem","235439958":"Free Energy of Adsorption for a Peptide at a Liquid/Solid Interface via Nonequilibrium Molecular Dynamics","264826518":"Suppression of work fluctuations by optimal control: An approach based on Jarzynski\u0027s equality","7291151":"Work distribution functions for hysteresis loops in a single-spin system","243568612":"Fluctuations and Response in Nonequilibrium Steady State","51946104":"Cortical phase transitions, non-equilibrium thermodynamics and the time-dependent Ginzburg-Landau equation. Int J Mod Phys B 26(6):1250035","51961466":"Inelastic collisions as a source of entropy?","225911829":"Computing the chemical reaction path with a ray-based fast marching technique for solving the Hamilton-Jacobi equation in a general coordinate system","222300195":"Non-extensive thermodynamics of transition-metal nanoclusters","230719651":"Use of Umbrella Sampling to Calculate the Entrance/Exit Pathway for Z-Pro-Prolinal Inhibitor in Prolyl Oligopeptidase","1760626":"Onsager-Machlup Theory and Work Fluctuation Theorem for a Harmonically Driven Brownian Particle","23315467":"Bizarro, J.P.S.: Entropy production in irreversible processes with friction. Phys. Rev. E 78, 021137","276361489":"Constrained Unfolding of a Helical Peptide: Implicit versus Explicit Solvents","7553310":"C. Gromacs: fast, Flexible, and Free","230883500":"Temperature measurement from perturbations","277414374":"Work distribution function for a Brownian particle driven by a nonconservative force","9067002":"Superoperator representation of nonlinear response: Unifying quantum field and mode coupling theories","257766958":"Shape change as entropic phase transition: A study using Jarzynski relation#","43078629":"Quantum Effects on the Free Energy of Ionic Aqueous Clusters Evaluated by Nonequilibrium Computational Methods","235737976":"Predicting virus-receptor mutant binding by molecular dynamics simulation","200147604":"The Development of Replica-Exchange-Based Free-Energy Methods","7837965":"Experimental Test of the Fluctuation Theorem for a Driven Two-Level System with Time-Dependent Rates","262732499":"Nonequilibrium Steady State in Open Quantum Systems: Influence Action, Stochastic Equation and Power Balance","227990762":"The Second Law of Nonequilibrium Thermodynamics: How Fast Time Flies","6329826":"Statistics of Entropy Production in Linearized Stochastic Systems","226563081":"The Fluctuation Theorem and its Implications for Materials Processing and Modeling","5458398":"Fluctuation Theorems","227589150":"Work fluctuation theorem for coloured noise driven open systems","221910184":"Four Exactly Solvable Examples in Non-Equilibrium Thermodynamics of Small Systems","264460881":"Looking for some free energy? Call JEFREE (…)","232718409":"Proposal of a Checking Parameter in the Simulated Annealing Method\nApplied to the Spin Glass Model","260642323":"Ensemble and Trajectory Thermodynamics: A Brief Introduction","274514371":"Theoretical investigation on the restoring step of the carbonic anhydrase catalytic cycle for natural and promiscuous substrates","6619588":"Steered Molecular Dynamics Studies of the Potential of Mean Force of a Na + or K + Ion in a Cyclic Peptide Nanotube","220308610":"Free energy computation by controlled Langevin dynamics","6519238":"Stochastic thermodynamics of chemical reaction networks","262072891":"Delivery of Nitric Oxide to the Interior of Mammalian Cell by Carbon Nanotube: MD Simulation.","234063962":"Structural elements of imidazole glycerol phosphate synthase exclude water to optimize ammonia transfer","227314725":"A gate mechanism indicated in the selectivity filter of the potassium channel KscA","283475276":"Simulations in generalized ensembles through noninstantaneous switches","281102699":"Monte Carlo : Statistical Physics","264904289":"Multiple branched adaptive steered molecular dynamics","11956505":"Steered molecular dynamics investigations of protein function","236062653":"Steered Molecular Dynamics Studies of the Potential of Mean Force for Peptide Amphiphile Self-Assembly into Cylindrical Nanofibers","264247919":"Improved Reweighting of Accelerated Molecular Dynamics Simulations for Free Energy Calculation","8195530":"Probing Molecular Free Energy Landscapes by Periodic Loading","45602572":"Free Energy Landscape of the Retinol/Serum Retinol Binding Protein Complex: A Biological Host-Guest System","7173585":"Coherence and correlations in multitime quantum measurements of stochastic quantum trajectories","266251802":"Effect of external pulling forces on the length distribution of peptides","11320683":"Statistical mechanics: Far from equilibrium","1874395":"Free energy differences : Representations, estimators, and sampling strategies","281312515":"Work relations for a system governed by Tsallis statistics","250196769":"Prediction, determination and validation of phase diagrams via the global study of energy landscapes","269187523":"A framework for modelling gene regulation which accomodates non-equilibrium mechanisms","231015436":"Optimal protocols for Hamiltonian and Schrödinger dynamics","45628274":"Good Practices in Free-Energy Calculations","258310831":"Power-fluctuation theorem for a Brownian oscillator in a thermal bath","283323689":"The Trigger Factor Chaperone Encapsulates and Stabilizes Partial Folds of Substrate Proteins","243568457":"Steady Thermal Conduction Far From Equilibrium in DingDong Model","221882615":"Carbinolamine Formation and Dehydration in a DNA Repair Enzyme Active Site","45855604":"Field Theory of the RNA Freezing Transition","29607955":"On Adaptive Resampling Procedures for Sequential Monte Carlo Methods","229338235":"Generalization of the second law for a transition between nonequilibrium states","244328257":"Molecular dynamics simulations of substrate channeling through an α-β Barrel protein","225286335":"Exploring the energetics of water permeation in Photosystem II by multiple steered molecular dynamics simulations","282496259":"Time reversal invariance, entropy production and work dissipation in stochastic thermodynamics","228116559":"Molecular Dynamics Simulations Suggest Ligand’s Binding to Nicotinamidase/Pyrazinamidase","222215401":"Free energy methods in molecular simulation","231143455":"Analyzing friction forces with the Jarzynski equality","277169499":"100 Years of Brownian motion","11320691":"Equilibrium Information from Nonequilibrium Measurements in an Experimental Test of Jarzynski\u0027s Equality","37431257":"Estimating equilibrium properties from non-Hamiltonian dynamics","6449541":"Fluctuation theorems for a molecular refrigerator","236862453":"TESIS CARRERA DE DOCTORADO EN FISICA (PhD Thesis in Spanish)","1849841":"Ludwig Boltzmann, Transport Equation and the Second Law","49740571":"Bayesian evidence computation for model selection in geoacoustic inversion","230976566":"Application of steered molecular dynamics (SMD) to study DNA–drug complexes and probing helical propensity of amino acids","43020133":"Large deviation theory for coin tossing and turbulence","224040097":"Exchange Fluctuation Theorem for correlated quantum systems","51962597":"Quantum Fluctuation Relations for the Lindblad Master Equation","267339282":"Summation through stochastic drawing of addends under steered morphing","228030359":"Structure, dynamics and thermodynamics in complex systems: Theoretical challenges and opportunities","225264492":"Observability of Extensive Variables","42335367":"Dissipazione in sistemi molecolarisottoposti a trasformazioni di non-equilibrio: aspetti generali e studio di un caso modello","260183425":"Duration of local violations of the second law of thermodynamics along single trajectories in phase space","255971654":"Work distribution of an expanding gas and transverse energy production in relativistic heavy ion collisions","221888305":"Antigen-Antibody Interactions and Structural Flexibility of a Femtomolar-Affinity Antibody","51944727":"Microscopic reversibility of quantum open systems","231247832":"A Benchmark Test Set for Alchemical Free Energy Transformations and Its Use to Quantify Error in Common Free Energy Methods","223107933":"Fractional power scaling of excess heat production","23981951":"Chapter 12 Molecular Modeling and Simulation Studies of Ion Channel Structures, Dynamics and Mechanisms","226422635":"Universal interpretation of efficacy parameter in perturbed\nnonequilibrium systems","225502054":"Nonequilibrium work relations: Foundations and applications","278786694":"Active Site Dynamical Effects in the Hydrogen Transfer Rate-limiting Step in the Catalysis of Linoleic Acid by Soybean Lipoxygenase-1 (SLO-1): Primary and Secondary Isotope Contributions","5500493":"Nonequilibrium work distributions for a trapped Brownian particle in a time-dependent magnetic field","273704527":"Efficiency Statistics and Bounds for Systems with Broken Time-Reversal Symmetry","254267654":"Stability of solid phases in the dipolar hard sphere system","284165841":"Strategies to reduce end-product inhibition in family 48 glycoside hydrolases","259446099":"Finite domain simulations with adaptive boundaries: Accurate potentials and nonequilibrium movesets","48205047":"Nonequilibrium work performed in quantum annealing","46583016":"Two Refreshing Views of Fluctuation Theorems Through Kinematics Elements and Exponential Martingale","225126212":"Entropy Production for Mechanically or Chemically Driven Biomolecules","45853844":"Eulerian and Lagrangian Pictures of Non-equilibrium Diffusions","228696977":"Equilibrium free energies from path sampling of nonequilibrium trajectories","23136081":"Study of the Interaction between Progesterone and β-Cyclodextrin by Electrochemical Techniques and Steered Molecular Dynamics","49907915":"Asymptotics of work distributions: The pre-exponential factor","221916937":"Thermohydrodynamics: Where Do We Stand?","7676494":"What Makes an Aquaporin a Glycerol Channel? A Comparative Study of AqpZ and GlpF","225837901":"What Is the Microscopic Response of a System Driven Far From Equilibrium?","272128515":"Local Elevation Umbrella Sampling Applied to the Calculation of Alchemical Free-Energy Changes via λ-Dynamics: The λ-LEUS Scheme","225798985":"Free Energy Calculations with Non-Equilibrium Methods: Applications of the Jarzynski Relationship","277722803":"Principle of Minimal Work Fluctuations","222684026":"Nonequilibrium thermodynamics at the microscale: Work relations and the second law","230974340":"Irreversible work in a thermal medium with colored noise","5951003":"Ion exclusion mechanism in aquaporin at an atomistic level","265632144":"Absolute Free Energy Calculations for Biomolecular Systems","45873406":"Dissipation and lag in irreversible processes","290432778":"One-Particle Representation of Heat Conduction Described within the Scope of the Second Law","10726117":"Quantum Extension of the Jarzynski Relation: Analogy with Stochastic Dephasing","277675716":"Computing Equilibrium Free Energies Using Non-Equilibrium Molecular Dynamics","227524550":"Projection of diffusions on submanifolds: Application to mean force computation","238135421":"Fast-growth Thermodynamic Integration∶ Results for Sodium Ion Hydration","225894203":"Reconstructing Free Energy Profiles from Nonequilibrium Relaxation Trajectories","222447377":"Reconstructing Potentials of Mean Force through Time Series Analysis of Steered Molecular Dynamics Simulations","229188604":"Zip gating of the KcsA channel studied by targeted molecular dynamics","283148983":"Nanothermodynamics","7709228":"Introduction: 100 years of Brownian motion","231247762":"Boxed Molecular Dynamics: Decorrelation Time Scales and the Kinetic Master Equation","30516109":"Fluctuations dans les systèmes hors d\u0027équilibre","230849438":"Exploring Substrate Diffusion in Channels Using Biased Molecular Dynamics Simulations","5500430":"Nonequilibrium work distribution of a quantum harmonic oscillator","222671652":"Nonequilibrium relations in spin glasses","24173332":"Generalized Clausius relation and power dissipation in nonequilibrium stochastic systems","1764991":"Jarzynski Relation, Fluctuation Theorems, and Stochastic Thermodynamics for Non-Markovian Processes","6846979":"A proof of Jarzynski\u0027s nonequilibrium work theorem for dynamical systems that conserve the canonical distribution","1881713":"Jarzynski equality for the Jepsen gas","244742395":"Challenges in thermodynamics: Irreversible processes, nonextensive entropies, and systems without equilibrium states","273787425":"Using Reweighted Pulling Simulations to Characterize Conformational Changes in Riboswitches","230666188":"Quasi-harmonic fluctuations of two bound peptides","247769277":"Integral Quantum Fluctuation Theorems under Measurement and Feedback control","248607912":"Quantum entropy production in phase space","260578569":"Fluctuation theorem for counting statistics in electron transport through quantum junctions","7173864":"Direct Evaluation of Large-Deviation Functions","278816281":"Mathematical and numerical analysis of some models for materials, from the microscopic scale to the macroscopic scale","44599328":"Molecular Order in a Chromonic Liquid Crystal: A Molecular Simulation Study of the Anionic Azo Dye Sunset Yellow","7173863":"Statistical Mechanical Derivation of Jarzynski’s Identity for Thermostated Non-Hamiltonian Dynamics","40497380":"A unified description of two theorems in non-equilibrium statistical mechanics: The fluctuation theorem and the work relation","262302003":"Meta-work and the analogous Jarzynski relation in ensembles of dynamical trajectories","265504065":"Steered Molecular Dynamics","1826441":"An Introduction to Monte Carlo Simulation of Statistical physics Problem","222038959":"Overcoming finite-sampling errors in fast-switching free-energy estimates: Extrapolative analysis of a molecular system","226499347":"Understanding and Improving Free Energy Calculations in Molecular Simulations: Error Analysis and Reduction Methods","222695379":"Optimum bias for fast-switching free energy calculations","45875241":"Posterior Probability and Fluctuation Theorem in Stochastic Processes","256683483":"Influence of ionization states of antigen on anti-fluorescein antibodies","23315451":"Time-dependent response theory and nonequilibrium free-energy relations","23315448":"Microscopic work distribution of small systems in quantum isothermal processes and the minimal work principle","228924217":"Work and power production in non-equilibrium systems","11025974":"Computation of a chemical potential using a residence weight algorithm","266798405":"Multidimensional integration through Markovian sampling under steered function morphing: A physical guise from statistical mechanics","250755156":"Chapter 8 Nonequilibrium Approaches to Free Energy Calculations","1946298":"Microscopic Analysis of Clausius–Duhem Processes","7388887":"Work-probability distribution in systems driven out of equilibrium","23463886":"Quantum free-energy differences from nonequilibrium path integrals. I. Methods and numerical application","23463887":"Quantum free-energy differences from nonequilibrium path integrals. II. Convergence properties for the harmonic oscillator","229318402":"On the work–free energy relations in a driven isothermal system: A historical and stochastic perspective","47756402":"Steered molecular dynamics simulations of ligand–receptor interaction in lipocalins","282623603":"Exfoliation of Electrolyte-Intercalated Graphene: Molecular Dynamics Simulation Study","263952663":"A Toolkit for the Analysis of Free-Energy Perturbation Calculations","290789368":"Steered molecular dynamics study of inhibitor binding in the internal binding site in dehaloperoxidase-hemoglobin","1894060":"Long-time convergence of an Adaptive Biasing Force method","228645651":"An interacting particle system approach for molecular dynamics","234035022":"Energy and chemical force profiles from the Marcus equation","7526066":"Nonequilibrium theory of polymer stretching based on the master equation","7097004":"Molecular Dynamics: A Survey of Methods for Simulating the Activity of Proteins","265644309":"Interference of Identical Particles and the Quantum Work Distribution","23558063":"The glass transition and the Jarzynski equality","40448160":"Boxed Molecular Dynamics: A Simple and General Technique for Accelerating Rare Event Kinetics and Mapping Free Energy in Large Molecular Systems","2134762":"A mathematical approach to the nonequilibrium work theorem","1899216":"Fluctuation Relations for Diffusion Processes","47697944":"Nonequilibrium Thermodynamics and Nose-Hoover Dynamics","45535335":"Molecular Dynamics Study of a Heteroditopic-Calix[4]diquinone-Assisted Transfer of KCl and Dopamine Through a Water-Chloroform Liquid-Liquid Interface","257217926":"Stochastic resonance and heat fluctuations in a driven double-well system","6775476":"The Rectified Second Law of Thermodynamics †","258729400":"Introduction to Molecular Dynamics: Theory and Applications in Biomolecular Modeling","273383071":"Markov Processes linking Thermodynamics and Turbulence","277158482":"Optimal protocols for Hamiltonian and Schr\\\"odinger dynamics","259246500":"Interaction of a calix[4]arene derivative with a DOPC bilayer: Biomolecular simulations towards chloride transport","45911141":"Driven Soft Matter: Entropy Production and the Fluctuation-Dissipation Theorem","272834200":"Probing the conformational energetics of alkyl thiols on gold surfaces by means of a morphing/steering non-equilibrium tool","258729399":"Computational Modeling of Biological Systems","1848003":"Equilibrium Sampling From Nonequilibrium Dynamics","260441446":"Jarzynski equality for quantum stochastic maps","261136752":"Nonequilibrium work equalities in isolated quantum systems","46424096":"Nonequilibrium Dynamics and Umbrella Sampling","236913915":"Microscopic reversibility and heat for thermostatted systems","11374155":"Energetics of glycerol conduction through aquaglyceroporin GlpF. Proc Natl Acad Sci U S A","51899888":"Classical open systems with nonlinear nonlocal dissipation and state-dependent diffusion: Dynamical responses and the Jarzynski equality","1859316":"Asymmetry of the work probability distribution","266541321":"Stochastic models and methods. An introduction with applications","51395067":"Optimized Free Energies from Bidirectional Single-Molecule Force Spectroscopy","225557407":"A path-sampling scheme for computing thermodynamic properties of a many-body system in a generalized ensemble","288153539":"Applications of Molecular Dynamics Simulations in Drug Design","231247655":"Adaptive Steered Molecular Dynamics of the Long-Distance Unfolding of Neuropeptide Y","284788233":"Topological sigma models \u0026 dissipative hydrodynamics","260340084":"Derivation of not-so-common fluctuation theorems","45893704":"Quantum Annealing with Jarzynski Equality (CCP2009)","257217954":"Jarzynski equation for the expansion of a relativistic gas and black-body radiation","260715890":"Symmetry for the duration of entropy-consuming intervals","5302958":"Accurate calculations of free-energy differences by the distribution method","49761289":"Erratum: “Estimating equilibrium ensemble averages using multiple time slices from driven nonequilibrium processes: Theory and application to free energies, moments, and thermodynamic length in single-molecule pulling experiments” [J. Chem. Phys. 134, 024111 (2011)]","260441464":"Large deviation function and fluctuation theorem for classical particle transport","11064233":"Theory of a Systematic Computational Error in Free Energy Differences","225201773":"Nonequilibrium Methods for Equilibrium Free Energy Calculations","268525319":"Statistical Work-Energy Theorems in Deterministic Dynamics","253446162":"Classical Diamagnetism Revisited","273005385":"Non-equilibrium steady state of a driven levitated particle with feedback cooling","26655365":"Umbrella Sampling Simulations of Biotin Carboxylase: Is a Structure with an Open ATP Grasp Domain Stable in Solution?","49780193":"Density-dependent analysis of nonequilibrium paths improves free energy estimates II. A Feynman-Kac formalism","231635673":"Equalities for the Nonequilibrium Work Transferred from an External Potential to a Molecular System. Analysis of Single-Molecule Extension Experiments","50998301":"Monte Carlo Investigation of the Thermodynamic Properties of (H2O)(n) and (H2O)(n)H-2 (n\u003d2-20) Clusters","263507092":"Heat fluctuations and initial ensembles","264390886":"Unzipping of neuronal snare protein with steered molecular dynamics occurs in three steps","236339504":"Toward quantitative estimates of binding affinities for protein-ligand systems involving large inhibitor compounds: A steered molecular dynamics simulation route","24269397":"Nonequilibrium Thermodynamics of Time-dependent Langevin Systems: Energy Balance Relation and the Extended Form of the Second Law","224018035":"On free energy calculations using fluctuation theorems of work","258307150":"Failure of the free energy relation under a non-Markovian heat bath temperature change","5486463":"Efficient free energy calculation of water across lipid membranes","237198607":"Path-breaking schemes for nonequilibrium free energy calculations","45853078":"Classical and Thermodynamic work fluctuations","1877810":"Work distribution and path integrals in mean-field systems","23440971":"Protein-Ligand Binding Affinity by Nonequilibrium Free Energy Methods","48381388":"Thermodynamics of Small Systems","5337982":"Determination of free energy profiles by repository based adaptive umbrella sampling: Bridging nonequilibrium and quasiequilibrium simulations","12008324":"Steady-State Thermodynamics of Langevin Systems","46008717":"Protein dynamics and ligand migration interplay as studied by computer simulation","221666818":"Microscopic Reversibility for Nonequilibrium Classical Open Systems","8604598":"Tools for channels: Moving towards molecular calculations of gating and permeation in ion channel biophysics","259768398":"Single-Molecule Studies of Intrinsically Disordered Proteins","281499633":"Fluctuations and Interactions of Brownian particles in multiple Optical Traps","44636574":"Prediction of protein-ligand binding affinity by free energy simulations: Assumptions, pitfalls and expectations","5521261":"A Differential Fluctuation Theorem †","262489241":"Nonequilibrium Markov Processes Conditioned on Large Deviations","235448628":"Statistics and fluctuation theorem for boson and fermion transport through mesoscopic junctions","268670783":"Deciphering the scaling of single-molecule interactions using Jarzynski’s equality","23652949":"Quantifying Multiscale Noise Sources in Single-Molecule Time Series","45286798":"Force-Induced Lysozyme—HyHEL5 Antibody Dissociation and Its Analysis by Means of a Cooperative Binding Model","244306352":"Excess free energy of nanoparticles in a polymer brush","263156975":"Annealed Importance Sampling Reversible Jump MCMC Algorithms","265995417":"The Thermodynamics of Small Driven Systems","51528791":"Nonequilibrium fluctuations for linear diffusion dynamics","260998347":"Determining elasticity from single polymer dynamics","272751368":"Annealed importance sampling with constant cooling rate","8651721":"The Mechanism of Proton Exclusion in Aquaporin Channels","256683009":"Photoexcitation free energies of solvated molecules from raw absorption spectra: Can a Jarzynski-like equality be employed?","250610110":"Free Energy Calculations with Reduced Potential Cutoff Radii","23420468":"Nonequilibrium fluctuations, fluctuation theorems, and counting statistics in quantum systems","260761817":"Analyzing machupo virus-receptor binding by molecular dynamics simulations","248475035":"Theoretical and computational hierarchical nanomechanics of protein materials: Deformation and fracture","45507040":"An efficient umbrella potential for the accurate calculation of free energies by molecular simulation","235645276":"Thermal Contact I : Symmetries ruled by Exchange Entropy Variations","230574822":"Gauging the Flexibility of the Active Site in Soybean Lipoxygenase-1 (SLO-1) through an Atom-Centered Density Matrix Propagation (ADMP) Treatment That Facilitates the Sampling of Rare Events","5802756":"Passive Water−Lipid Peptide Translocators with Conformational Switches: From Single-Molecule Probe to Cellular Assay","5778182":"Waiting Cycle Times and Generalized Haldane Equality in the Steady-State Cycle Kinetics of Single Enzymes","5230353":"Protein-Protein Interaction Investigated by Steered Molecular Dynamics: The TCR-pMHC Complex","51605581":"Role of a Mutated Residue at the Entrance of the Substrate Access Channel in Cytochrome P450 Engineered for Vitamin D-3 Hydroxylation Activity","231052967":"Non-equilibrium work theorems for the two-dimensional Ising model","277694447":"Free Energy Methods in Ligand Design","228986560":"Rapid, Accurate, and Precise Calculation of Relative Binding Affinities for the SH2 Domain Using a Computational Grid","38081837":"Improving fast-switching free energy estimates by dynamical freezing","5915440":"Entropy fluctuation theorems in driven open systems: Application to electron counting statistics","8560622":"Dynamics and energetics of water permeation through the aquaporin channel","263979217":"Ice Ih–Water Interfacial Free Energy of Simple Water Models with Full Electrostatic Interactions","281895843":"Equilibrium free energy from non-Hamiltonian dynamics","1861490":"On the efficiency of path sampling methods for the calculation of free energies from non-equilibrium simulations","47386018":"Statistical properties of entropy production derived from fluctuation theorems","227587810":"Stochastic thermodynamics: Principles and perspectives","221660739":"Fluctuation Relations: A Pedagogical Overview","51095677":"Disaccharide Binding to Galectin-1: Free Energy Calculations and Molecular Recognition Mechanism","1859435":"Jarzynski equation for a simple quantum system: Comparing two definitions of work","45861315":"Generalization of the Second Law for a Nonequilibrium Initial State","267873421":"Implementation of the Forward–Reverse Method for Calculating the Potential of Mean Force Using a Dynamic Restraining Protocol","225694216":"QM/MM methods biological systems","23230179":"Lower bounds on dissipation upon coarse graining","228734497":"Excursions in statistical dynamics","51989661":"Refined Second Law of Thermodynamics for Fast Random Processes","230995522":"Joint probability distributions and fluctuation theorems","51097740":"Comparing and Combining Implicit Ligand Sampling with Multiple Steered Molecular Dynamics to Study Ligand Migration Processes in Heme Proteins","26274330":"Comparison of three enveloping distribution sampling Hamiltonians for the estimation of multiple free energy differences from a single simulation","4662225":"Calculating Free Energies Using a Scaled-Force Molecular Dynamics Algorithm","41133540":"Dynamics of DNA in Nucleosomes and Plasmids studied by Brownian dynamics","45930788":"The Jarzynski identity and the AdS/CFT duality","6162368":"Fluctuation theorems: Work is not an observable","26316303":"Chloride Ion Conduction Without Water Coordination in the Pore of ClC Protein","224931531":"Delineation of the Unbinding Pathway of α-Conotoxin ImI from the α7 Nicotinic Acetylcholine Receptor","6752194":"The Jarzynski identity derived from general Hamiltonian or non-Hamiltonian dynamics reproducing NVT or NPT ensembles","7069644":"Fluctuation theorems for quantum master equations","51592372":"Slow Dissociation of a Charged Ligand: Analysis of the Primary Quinone Q(A) Site of Photosynthetic Bacterial Reaction Centers","1856437":"Biological and synthetic membranes: What can be learned from a coarse-grained description? Physics Reports, 434, 113-176","271220608":"Capturing the Landauer bound through the application of a detailed Jarzynski equality for entropic memory erasure","23930566":"Single Molecule Probing of SNARE Proteins by Atomic Force Microscopy","285648554":"Keldysh Field Theory for Driven Open Quantum Systems","6415308":"Multidimensional Potentials of Mean Force from Biased Experiments along a Single Coordinate","233949788":"A Molecular Dynamics Approach to Ligand-Receptor Interaction in the Aspirin-Human Serum Albumin Complex","43020606":"Work exchange between quantum systems: The spin-oscillator model","275358663":"Thermal Stabilization of Dihydrofolate Reductase Using Monte Carlo Unfolding Simulations and Its Functional Consequences","7668676":"Quantum version of free-energy-irreversible-work relations","8352718":"Efficient use of nonequilibrium measurement to estimate free energy differences for molecular systems","51915945":"Brownian Motion of Charged Particles Driven by Correlated Noise in Magnetic Field","266321005":"Challenges in Computational Studies of Enzyme Structure, Function and Dynamics","8034249":"Asymmetric bias in free-energy perturbation measurements using two Hamiltonian-based models","45856008":"A generalized integral fluctuation theorem for general jump processes","225051358":"Replica exchange with nonequilibrium switches: Enhancing equilibrium sampling by increasing replica overlap","9064255":"Bias and error in estimates of equilibrium free-energy differences from nonequilibrium measurements","8379337":"A quantum chemical approach to the free energy calculations in condensed systems: The QM/MM method combined with the theory of energy representation","46424434":"Quantum Annealing with the Jarzynski Equality","283162459":"Computational Pharmaceutics","47524201":"Splitting rate matrix as a definition of time reversal in master\nequation systems","240149998":"Nonequilibrium Statistical Physics of Small Systems: Fluctuation Relations and Beyond","279310107":"The inflow rate, a time-symmetric observable obeying fluctuation relations","269711315":"Quantum nonequilibrium equalities with absolute irreversibility","29799937":"The molecular mechanism of multi-ion conduction in K+ channels","224956079":"The free energy of expansion and contraction: Treatment of arbitrary systems using the Jarzynski equality","261065800":"Effective potentials between gold nano crystals – functional dependence on temperature","8193974":"Model for small-sample bias of free-energy calculations applied to Gaussian-distributed nonequilibrium work measurements","270963693":"Generalized Metropolis acceptance criterion for hybrid non-equilibrium molecular dynamics—Monte Carlo simulations","12059510":"How does a system respond when driven away from thermal equilibrium?","261324893":"Single-Molecule Methods for Ligand Counting: Linking Ion Uptake to DNA Hairpin Folding","1860556":"A temperature-extended Jarzynski relation: Application to the numerical calculation of surface tension","225047225":"In Silico Strategies Toward Enzyme Function and Dynamics","24357538":"Path integral analysis of Jarzynski\u0027s equality: Analytical results","231016982":"Jarzynski\u0027s equality illustrated by simple examples","1761230":"Nonequilibrium Steady State Thermodynamics and Fluctuations for Stochastic Systems","256836763":"Ligand-induced stabilization of the aptamer terminal helix in the add adenine riboswitch","258525373":"Microcanonical work and fluctuation relations for an open system: An exactly solvable model","235221459":"On non-equilibrium physics and string theory","1821644":"A Quantum Analogue of the Jarzynski Equality","43020615":"Optimum protocol for fast-switching free-energy calculations","23166649":"Molecular Simulations of Interacting Nanocrystals","51899598":"Heat generation and transport due to time-dependent forces","26880576":"Optimal estimators and asymptotic variances for nonequilibrium path-ensemble averages","271710186":"Open Heisenberg chain under boundary fields: A magnonic logic gate","264829973":"Temperature Dependence of the Complexation Mechanism of Celecoxib and Hydroxyl-β-cyclodextrin in Aqueous Solution","7069620":"Rare events and the convergence of exponentially averaged work values","5760904":"Springs and Speeds in Free Energy Reconstruction from Irreversible Single-Molecule Pulling Experiments †","267872279":"Nonequilibrium equalities in absolutely irreversible processes","6162367":"Generalization of the Jarzynski and Crooks nonequilibrium work theorems in molecular dynamics simulations","6543232":"A Network of Conserved Interactions Regulates the Allosteric Signal in a Glutamine Amidotransferase †","224921229":"Characterizing dynamical transitions in bistable systems using a non-equilibrium measurement of work","232063539":"Symmetries of cyclic work distributions for an isolated harmonic\noscillator","278851444":"Interaction of Individual Ions, Ion-Water Clusters with Aquaglyceroporin and Aquaporin-1 Channels","6653834":"Free energy for protein folding from nonequilibrium simulations using the Jarzynski equality","233725470":"Assembly and Stability of α-Helical Membrane Proteins","228072041":"A Steered Molecular Dynamics Study of Binding and Translocation Processes in the GABA Transporter","230340169":"QM/MM‐Methoden für biomolekulare Systeme","258843801":"Reconstruction of Energy Surfaces from Friction Force Microscopy Measurements with the Jarzynski Equality","276425614":"Multistate λ-Local-Elevation Umbrella-Sampling (MS-λ-LEUS): Method and Application to the Complexation of Cations by Crown Ethers","226242182":"Nonequilibrium Measurements of Free Energy Differences for Microscopically Reversible Markovian Systems","273158070":"Construction and Optimization of the Quantum Analog of Carnot Cycles"},"index":565}