{"abs":"A safe control of genetic evolution consists inpreventing past errors of evolution from beingrepeated. This could be done by keepingtrack of the history of evolution, but maintainingand exploiting the complete historyis intractable.This paper investigates the use of machinelearning (ML), in order to extract manageableinformation from this history. More precisely,induction from examples of past trialsand errors provides rules discriminating errorsfrom successful trials. Such rules...","title":"An Advanced Evolution Should Not Repeat its Past Errors.","id":221345340,"url":"https://www.researchgate.net/publication/221345340_An_Advanced_Evolution_Should_Not_Repeat_its_Past_Errors","names":["Caroline Ravise","Michèle Sebag"],"references":{"2447173":"Inserting Introns Improves Genetic Algorithm Success Rate: Taking a Cue from Biology.","201976495":"Adapting Operator Probabilities in Genetic Algorithm","2754050":"Adapting Crossover in a Genetic Algorithm","3114631":"Grefenstette, J.J.: Optimization of control parameters for genetic algorithms. IEEE Trans. Syst. Man Cybern. 16(1), 122-128","2263691":"What Makes a Problem Hard for a Genetic Algorithm? Some Anomalous Results and Their Explanation","2457743":"Delaying the Choice of Bias : A Disjunctive Version Space Approach","216301417":"Numerical Optimization of Computer Models","201976967":"An Introduction to Cultural Algorithms","225182237":"Controlling Crossover through Inductive Learning","222445329":"A Theory and Methodology of Inductive Learning","247607255":"A Formal Analysis of the Role of MultiPoint Crossover in Genetic Algorithms","226222944":"Induction of Decision Trees","242372494":"Genetic algorithm in search"},"citedIn":{"238329266":"TAO - Th emes Apprentissage et Optimisation Machine Learning, Data Mining and Evolutionary Optimization","235948311":"Validating Learnable Evolution Model on Selected Optimization and Design Problems","235948313":"Speeding Up Evolution through Learning: LEM","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","223830657":"Hybridation of Bayesian networks and evolutionary algorithms for multi-objective optimization in an integrated product design and project management context","3692961":"Genetic algorithm involving coevolution mechanism to search for effective genetic information","220048519":"Hybrid Metaheuristics","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","3949479":"A preliminary study of learnable evolution methodology implementedwith C4.5","220063745":"A New Approach to Optimizing Complex Engineering Systems and its Application to Designing Heat Exchangers","29637721":"Using Datamining Techniques to Help Metaheuristics: A Short Survey","228699068":"Theory and Implementation of the Learnable Evolution Model","221112176":"Continuous Mimetic Evolution","220801099":"Inductive Learning of Mutation Step-Size in Evolutionary Parameter Optimization.","220885647":"Toward Civilized Evolution: Developing Inhibitions.","2765700":"Inductive Learning of Mutation Step-size in Evolutionary Parameter Optimization","220380941":"Society and civilization: An optimization algorithm based on the simulation of social behavior","235948320":"The Effects of Training Set Size and Keeping Rules on the Emergent Selection Pressure of Learnable Evolution Model","3865289":"Experimental validations of the learnable evolution model","3418755":"Liew, K.M.: Society and civilization: An optimization algorithm based on the simulation of social behavior. IEEE Trans. Evol. Comput. 7, 386-396","220443348":"Revisiting the Memory of Evolution","6883217":"Optimum Tracking with Evolution Strategies","3693057":"A society of hill-climbers","2333082":"Using Case-Based Learning to Improve Genetic-Algorithm-Based Design Optimization","220343454":"Learnable Evolution Model: Evolutionary Processes Guided by Machine Learning.","221024274":"Mimetic Evolution"},"index":570}