{"abs":"An adaptitle interpreter for a programming language adapts to particular applications by learning from execution experience. This paper describes PROLEARN, a prototype adaptive interpreter for a subset of Prolog. It uses two methods to speed up a given program: explanation-based generalization and partial evaluation. The generalization of computed results differentiates PROLEARN from programs that cache and reuse specilic values. We illustrate PROLEARN on several simple programs and evaluate its capabilities and limitations. The effects of adding a learning component to Prolog can be summarized as follows: the more search and subroutine calling in the original query, the more speedup after learning; a learned subroutine may slow down queries that match its head but fail its body.","title":"PROLEARN: Towards a Prolog Interpreter that Learns.","id":221603472,"url":"https://www.researchgate.net/publication/221603472_PROLEARN_Towards_a_Prolog_Interpreter_that_Learns","names":["Armand Prieditis","Jack Mostow"],"references":{"220813720":"Verification-based Learning: A Generalized Strategy for Inferring Problem-Reduction Methods.","220343557":"Chunking in Soar: The Anatomy of a General Learning Mechanism","220343973":"Explanation-Based Generalization: A Unifying View","220812049":"Selectively Generalizing Plans for Problem-Solving.","245683868":"Cognitive economy in artificial intelligence systems","220816272":"Learning by Discovering Macros in Puzzle Solving.","220605259":"Partial Evaluation, Programming Methodology, and Artificial Intelligence.","220812759":"Learning Effective Search Heuristics."},"citedIn":{"235177285":"A Language for Higher-Order Explanation-Based Learning","2783275":"Utilization Filtering: a method for reducing the inherent harmfulness of deductively learned knowledge","2368678":"Integrating ILP and EBL","2674092":"Learning Search-Control Heuristics for Logic Programs: Applications to Speedup Learning and Language Acquisition","2534115":"Learning Flexible Concepts Using A Two- Tiered Representation","2297454":"Learning High Utility Rules by Incorporating Search Control","220814311":"Failsafe - A Floor Planner that Uses EBG to Learn from Its Failures.","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","226764308":"Higher-order and modal logic as a framework for explanation-based generalization (Extended abstract","226308268":"Learning two-tiered descriptions of flexible concepts: The POSEIDON system","51893573":"The Divide-and-Conquer Subgoal-Ordering Algorithm for Speeding up Logic\nInference","2793337":"Knowledge Refinement in Diagnostic Expert Systems","221606625":"Quantitative Results Concerning the Utility of Explanation-Based Learning.","221345897":"Higher-Order and Modal Logic as a Framework for Explanation-Based Generalization.","220812080":"The Effect of Rule Use on the Utility of Explanation-Based Learning.","2931447":"The Divide-and-Conquer Subgoal-Ordering Algorithm for Speeding up Logic Inference","228685820":"Transformational Analyses of Learning in Soar.","222460448":"Explanation-based generalisation \u003d partial evaluation","225132681":"The limitations of partial evaluation","226558690":"Book ReviewLearning Search Control Knowledge: An Explanation-Based Approach, by Steven Minton. Kluwer Academic Publishers, 1988, 214 pages","221388182":"L-ATMS: A tight integration of EBL and the ATMS","222749025":"Acquiring search-control knowledge via static analysis","228572984":"Explanation-Based Learning in Logic Programming","242916829":"Learning search control knowledge: An explanation-based approach","2639362":"Bounding the Cost of Learned Rules","220344079":"LT Revisited: Explanation-Based Learning and the Logic of Principia Mathematica.","2410505":"Explanation-Based Interpretation of Open-Textured Concepts in Logical Models of Legislation","251414675":"Generalizing Explanation Structures","220566485":"Explanation-Based Learning: A Survey of Programs and Perspectives.","32152152":"KRASNOSEL\u0027SKII-MANN型点列について (バナッハ空間と関数空間の研究とその応用)","226604914":"Explanation Generalization in EGGS","2608529":"Learning Efficient Rules by Maintaining the Explanation Structure","238599311":"Explanation-Based Learning in Logic Programming Extended Abstract","220344149":"The Problem of Expensive Chunks and Its Solution by Restricting Expressiveness","220637662":"Explanation-Based Learning: A survey","222478394":"The refinement of probabilistic rule sets: Sociopathic interactions","235155389":"Sociopathic Knowledge Bases: Correct Knowledge Can Be Harmful Even Given Unlimited Computation","220344025":"Discrete Sequence Prediction and Its Applications","227614125":"ABDUCTION and EXPLANATION‐BASED LEARNING: CASE STUDIES IN DIVERSE DOMAINS","238698055":"and Explanation-Base d Learning: Case Studies in Diverse Domains","2368026":"Speeding-up Logic Programs by Combining EBG and FOIL","220343580":"Information Filtering: Selection Mechanisms in Learning Systems","220547035":"An Apprentice-Based Approach to Knowledge Acquisition.","2733271":"A Transformational Analysis of the EBL Utility Problem in Soar"},"index":571}