{"abs":"The subset simulation (SS) method is a probabilistic approach which is devoted to efficiently calculating a small failure probability. Contrary to Monte Carlo Simulation (MCS) methodology which is very time-expensive when evaluating a small failure probability, the SS method has the advantage of assessing the small failure probability in a much shorter time. However, this approach does not provide any information about the probability density function (PDF) of the system response. In addition, it does not provide any information about the contribution of each input uncertain parameter in the variability of this response. Finally, the SS approach cannot be used to calculate the partial safety factors which are generally obtained from a reliability analysis. To overcome these shortcomings, the SS approach is combined herein with the Collocation-based Stochastic Response Surface Method (CSRSM) to compute these outputs. This combination is carried out by using the different values of the system response obtained by the SS approach for the determination of the unknown coefficients of the polynomial chaos expansion in CSRSM. An example problem that involves the computation of the ultimate bearing capacity of a strip footing is presented to demonstrate the efficiency of the proposed procedure. The validation of the present method is performed by comparison with MCS methodology applied on the original deterministic model. Finally, a probabilistic parametric study is presented and discussed.","title":"Extension of subset simulation approach for uncertainty propagation and global sensitivity analysis","id":254219020,"url":"https://www.researchgate.net/publication/254219020_Extension_of_subset_simulation_approach_for_uncertainty_propagation_and_global_sensitivity_analysis","names":["Ashraf Ahmed","Abdul-Hamid Soubra","Georisk Assessment and Management of Risk for Engineered Systems and Geohazards"],"references":{"209805057":"Evaluation of geotechnical property variability","229350702":"Modified Metropolis–Hastings algorithm with reduced chain correlation for efficient subset simulation","240894844":"Probabilistic Analysis of Pressurized Tunnels against Face Stability Using Collocation-Based Stochastic Response Surface Method","222834177":"Application of Subset Simulation Methods to Reliability Benchmark Problems","240892722":"Probabilistic analysis and design of strip foundations resting on rocks obeying Hoek–Brown failure criterion","13564002":"Stochastic Response Surface Methods (SRSMs) for Uncertainty Propagation: Application to Environmental and Biological Systems","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","222526449":"Global sensitivity analysis using polynomial chaos expansion","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","35471497":"Analysis and design of embankment dam slopes : a probabilistic approach /","233170672":"Probabilistic analysis of a one-dimensional soil consolidation problem","251542695":"Stochastic response surface method for reliability analysis of rock slopes involving correlated non-normal variables","249028683":"Geotechnical probabilistic analysis by collocation-based stochastic response surface method: An Excel Add-in implementation","221990278":"Implementing advanced Monte Carlo simulation under spreadsheet environment"},"citedIn":{"259008967":"Efficient sparse polynomial chaos expansion methodology for computationally expensive deterministic models","257067688":"Probabilistic Analysis of Strip Footings Resting on Spatially Varying Soils and Subjected to Vertical or Inclined Loads","281913142":"Risk and Reliability Analysis of Multibarrier System for Near-Surface Disposal Facilities"},"index":573}