{"abs":"A multi-level design strategy for supersonic missile inlet design is developed. The multi-level design strategy combines an efficient simple physical model analysis tool and a sophisticated CFD Navier-Stokes analysis tool. The efficient simple analysis tool is incorporated into the optimization loop and the sophisticated CFD analysis tool is used to verify, select and filter the final design. The Genetic Algorithms and Multistart gradient line search optimizers are used to search the non-smooth design space. A geometry model for the supersonic missile inlet is developed. A supersonic missile inlet which starts at Mach 2.6 and cruises at Mach 4 was designed. Significant improvement of the inlet total pressure recovery has been obtained. Detailed flow field analysis is also presented. 3 Postdoctoral Fellow, Dept. of Mechanical and Aerospace Engineering. AIAA Member. y Assistant Professor, Computer Science Dept. AIAA Member. z Ph.D. Candidate, Computer Science Dept. x Ph....","title":"High Performance Supersonic Missile Inlet Design Using Automated Optimization","id":2336982,"url":"https://www.researchgate.net/publication/2336982_High_Performance_Supersonic_Missile_Inlet_Design_Using_Automated_Optimization","names":["Ge-cheng Zha","Donald Smith","Mark Schwabacher","Khaled Rasheed","Andrew Gelsey","Doyle Knight","Journal of Aircraft"],"references":{"245450033":"Applications of Genetic Algorithm to Aerodynamic Shape Optimization","2283746":"Automated Redesign of the NASA P8 Hypersonic Inlet Using Numerical Optimization Vijay Shukla","243774545":"Practical considerations in aerodynamic design optimization","245365496":"An Effective Mixed Annealing/Heuristic Algorithm for Problems in Mechanical Design","2695809":"NPARC Simulation and Redesign of the NASA P2 Hypersonic Inlet","222501755":"A genetic algorithm for continuous design space search","243766378":"Optimum Aerodynamic Design Using CFD And Control Theory","223938660":"Using Modeling Knowledge to Guide Design Space Search","24320413":"Aerodynamic Design via Control Theory","2812341":"User\u0027s Guide for CFSQP Version 2.5: A C Code for Solving (Large Scale) Constrained Nonlinear (Minimax) Optimization Problems, Generating Iterates Satisfying All Inequality Constraints"},"citedIn":{"271557997":"Evolutionary optimization of energy systems using population graphing and neural networks","266498279":"An Indexed Bibliography of Genetic Algorithms in Military Applications compiled by","268561860":"Simulations of a Low-Boom, Axisymmetric, External Compression Inlet","2331428":"Guided Crossover: A New Operator for Genetic Algorithm Based Optimization","220547565":"Searching stochastically generated multi-abstraction-level design spaces","249598378":"Design Optimization in Computational Fluid Dynamics","235211406":"Multi-Flight Condition Optimization of Three Dimensional Supersonic Inlets","267486586":"Developing Multiple Diverse Potential Designs for Heat Transfer Utilizing Graph Based Evolutionary Algorithms","220269805":"A Design Space Approach to Analysis of Information Retrieval Adaptive Filtering Systems","237136622":"Low Fidelity Analysis Based Design of Two Dimensional Bifurcated Duct","2760294":"Numerical Simulation of HSCT Inlet Operability with Angle of Attack","228615148":"Modeling, Dynamic Simulation, and Controller Design for an Air-Breathing Combustion System","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","267420961":"An Indexed Bibliography of Genetic Algorithms in Geosciences, Astronomy, Aerospace Engineering, and Aerodynamics compiled by","2555186":"Guided Crossover: A New Operator for Genetic Algorithm Based Optimization","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","267489770":"An Exploratory Framework for Combining CFD Analysis and Evolutionary Optimization Into a Single Integrated Computational Environment","269053909":"Optimization of an integrated inlet/ejector of an RBCC engine using collaborative optimization","220204668":"Determining Worst-Case Gust Loads on Aircraft Structures Using an Evolutionary Algorithm","239473819":"Computational Approaches for Aerosp. Design: The Pursuit of Excellence","2356412":"An Adaptive Penalty Approach for Constrained Genetic-Algorithm Optimization","275559053":"Efficient global optimization incorporating feasibility criterion for the design of a supersonic inlet","222222108":"Optimization of heat transfer utilizing graph based evolutionary algorithms","238070355":"Virtual Engineering Approach to Developing Selective Harvest Technologies","268565026":"Numerical Analysis and Optimization of Two-Dimensional Hypersonic Inlets","222044504":"A new methodology for evolutionary optimization of energy systems","268559077":"Application of Optimization Algorithms to Scramjet Inlet Design","242819292":"Evolutionary optimization of energy systems using population graphing and neural networks","245435524":"Multicriteria Design Optimization of a Supersonic Inlet Based upon Global Missile Performance","220287947":"Operations research in the space industry","256842468":"Multi-Flight Condition Optimization of Three Dimensional Supersonic Inlets","2686212":"Automated Optimal Design Using CFD and High Performance Computing","275920094":"Tradeoffs in Jet Inlet Design: A Historical Perspective","245435532":"Multi-Objective Shape Optimization Study for a Subsonic Submerged Inlet","261448699":"Multidisciplinary Design of S-Shaped Intake","222501755":"A genetic algorithm for continuous design space search","239424253":"Engineering optimization of an improved plancha stove","2333082":"Using Case-Based Learning to Improve Genetic-Algorithm-Based Design Optimization","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","223938660":"Using Modeling Knowledge to Guide Design Space Search","270470625":"Numerical Investigation of Symmetrical Supersonic Inlet with Boundary Layer Suction","275559059":"Performance study of an inlet in supersonic flow"},"index":574}