{"abs":"The optimal thinning and rotation age policy for a stand subject to risk of destruction by windthrow is investigated. In particular, risk is not assumed exogenous as in previous research, but is modelled as endogenous to stand management. It is shown that the optimal solution when risk is endogenous differs significantly from the optimal solution to a problem where risk is assumed absent or exogenous. We find that in spite of substantial fixed costs related to thinning, the optimal number of thinnings increases and the optimal intensity of each thinning decreases. Furthermore, we find that the shortening effect of risk on the optimal rotation age is reduced substantially, when the thinning strategy is optimized subject to the effect on the risk levels. We conclude that the presence of endogenous risk strongly affects the optimal management strategy, and that an ecologically better founded approach to stand management is optimal in such cases. A group of solutions centred around a local optimum was characterized by fewer, more intense thinnings and a drastic shortening of the rotation age. If fixed costs were to increase substantially, this local optimum may become global, but still result in a longer rotation and more frequent thinnings than in the case of exogenous risk. Finally, features of the model\u0027s risk dynamics allow an analysis of the effect of changing the stand\u0027s resistance to and ability to recover from (i.e. the stand\u0027s resilience) the disturbances caused by thinnings, measured as changes in the susceptibility to windthrow. We find that in spite of the fixed costs related to thinning, a decrease in resistance or resilience makes it optimal to increase the number of thinnings, while at the same time making each thinning less intense.","title":"Optimal stand management with endogenous risk of sudden destruction","id":223881139,"url":"https://www.researchgate.net/publication/223881139_Optimal_stand_management_with_endogenous_risk_of_sudden_destruction","names":["Bo Jellesmark Thorsen","Finn Helles","Forest Ecology and Management"],"references":{"233658569":"The Effect of Potential Catastrophic Mortality and Other Unpredictable Events on Optimal Forest Rotation Policy","233310669":"Windthrow Probability as a Function of Stand Characteristics and Shelter","222482436":"Consumption/Pollution Tradeoffs in an Environment Vulnerable to Pollution-Related Catastrophic Collapse","249532568":"Optimal harvest scheduling at the forest level in the presence of the risk of fire","222751343":"The Efeects of the Risk of Fire on the Optimal Rotation of a Forest","233591296":"A Multistage Stochastic Programming Model for Sustainable Forest-Level Timber Supply Under Risk of Fire","233550918":"A Nonlinear Programming Approach to Stand Optimization","222459443":"On the application of stability concepts in ecology. Ecol Model","233644766":"Simultaneous Optimization of Thinnings And Rotation with Continuous Stocking and Entry Intervals","233544312":"Optimizing Any-Aged Management of Mixed-Species Stands: II. Effects of Decision Criteria","249533164":"Optimizing any-aged management of mixed-species stands. I. Performance of a coordinate-search process","233489406":"Optimal Rotation and Thinning","237867672":"The Optimal Rotation of a Flammable Forest Stand","237868376":"Assessing the long-run yield of a forest stand subject to the risk of fire","222596860":"Ecological stability of forests and sustainable silviculture. For Ecol Manag 3:85-96","237869397":"A comparison of numerical methods for optimizing even aged stand management","233673846":"The Simultaneous Determination of Optimal Thinning Schedule and Rotation for an Even-Aged Forest","237868882":"Techniques for assessing the effects of pest hazards on long-run timber supply","40210874":"Dependence of rotation and thinning regime on economic factors and silvicultural constraints: results of an application of dynamic programming"},"citedIn":{"30072905":"Thinning of Norway spruce","256549196":"Impact of storm risk on Faustmann rotation","259461373":"Models for the optimal management of Pinus radiata D. Don in Galicia (North-Western Spain) under risk of fire","33515955":"Improving diameter growth prediction of Douglas-fir in eastern Washington State, U.S.A. by incorporating precipitation and temperature","254371577":"Decision Support for Active Risk Management in Sustainable Forestry","274162055":"Influencing Natural Forest Disturbance through Timber Harvesting: Tradeoffs among Disturbance Processes, Forest Values, and Timber Condition","225583776":"Assessing natural hazards in forestry for risk management: A review","23752063":"Firefights and Fuel Management: A Nested Rotation Model for Wildfire Risk Mitigation","225404218":"A stochastic approach to optimize Maritime pine (Pinus pinaster Ait.) stand management scheduling under fire risk. An application in Portugal","41703083":"Optimising the management of Pinus sylvestris L. stand under risk of fire in Catalonia (north-east of Spain)","225714221":"Integrating fire risk in stand management scheduling. An application to Maritime pine stands in Portugal","267838383":"Evaluating Forestry Incentive and Assistance Programmes in Europe – Challenges to Improve Policy Effectiveness","273286931":"Optimising forest stand management in Galicia, north-western Spain","227416916":"When and to what extent do risk premia work? Cases of threat and optimal rotation","34034716":"The Effects of Ice Damage on Management Decisions for Loblolly Pine Plantations located in the Piedmont Region of Virginia","237741616":"Firefights and Fuel Management: A Nested Rotation Model for Wildfire Risk","239940176":"A Stochastic Dynamic Programming Approach to Optimize Short-Rotation Coppice Systems Management Scheduling: An Application to Eucalypt Plantations under Wildfire Risk in Portugal","233258937":"Effects of initial stand states on optimal thinning regime and rotation of Picea abies stands","223518258":"A Danish example of optimal thinning strategies in mixed-species forest under changing growth conditions caused by climate change","42425703":"Integrating fire risk into forest planning","47932159":"Silvicultural decisions based on simulation-optimization systems","223194088":"A density-dependent stand-level optimization approach for deriving management prescriptions for interior northwest (USA) landscapes","23942664":"Hedges and Trees: Incorporating Fire Risk into Optimal Decisions in Forestry Using a No-Arbitrage Approach","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","262981642":"Optimal management of Pinus pinaster in Galicia (Spain) under risk of fire","224840065":"Database on Forest Disturbances in Europe (DFDE) - Technical Description","227416934":"Ice damage and forest stand management. J Forest Econ","227416935":"Faustmann Rotation and population dynamics in the presence of a risk of destructive events","265967537":"Regeneration decisions in forestry under climate change related uncertainties and risks: Effects of three different aspects of uncertainty","227357027":"A dynamic bioeconomic analysis of mountain pine beetle epidemics","233604061":"Economics of Forest Thinnings and Rotation Periods for Finnish Conifer Cultures","248427642":"Optimal spatial harvest planning under risk of windthrow","239939963":"Review.Assessing uncertainty and risk in forest planning and decision support systems: Review of classical methods and introduction of innovative approaches","271419994":"Assessing fire risk in stand-level management in Galicia (north-western Spain)","3822210":"Numerical modeling of adsorption and scattering of EM energy radiated by cellular phones by human arms","237866517":"The regeneration decision: A sequential two-option approach","226559611":"Erratum to: A review of decision-making approaches to handle uncertainty and risk in adaptive forest management under climate change","227416948":"Forestry\u0027s Golden Rule and the Development of the Optimal Forest Rotation Literature","236894757":"Faustmann Rotation and Aquaculture in the presence of an epidemic risk","241756629":"An economic evaluation of strategies for transforming even-aged into near-natural forestry in a conifer-dominated forest in Denmark"},"index":575}