{"abs":"In this paper we introduce interval-schemata as a tool for analyzing real-coded genetic algorithms (GAs). We show how interval-schemata are analogous to Holland\u0027s symbol-schemata and provide a key to understanding the implicit parallelism of real-valued GAs. We also show how they support the intuition that real-coded GAs should have an advantage over binary coded GAs in exploiting local continuities in function optimization. On the basis of our analysis we predict some failure modes for real-coded GAs using several different crossover operators and present some experimental results that support these predictions. We also introduce a crossover operator for real-coded GAs that is able to avoid some of these failure modes.","title":"Real-Coded Genetic Algorithms and Interval-Schema","id":201976655,"url":"https://www.researchgate.net/publication/201976655_Real-Coded_Genetic_Algorithms_and_Interval-Schema","names":["Larry J. Eshelman","J. David Schaffer"],"references":{},"citedIn":{"255606586":"Parameter Estimation of Pramecium Model using Real-coded Genetic Algorithm","223319363":"New stability criteria for a class of neutral systems with discrete and distributed time-delays: An LMI approach","232381909":"Development of a robot assisted carotid blood flow measurement system","245419694":"New Constraint-Handling Method for Multi-Objective and Multi-Constraint Evolutionary Optimization","225695101":"Semantic Driven Fuzzy Clustering for Human-Centric Information Processing Applications","283998435":"Particle swarm optimization with crossover: a review and empirical analysis","24295805":"Multiobjective Optimization of Rocket Engine Pumps Using Evolutionary Algorithm","220702006":"Theoretical Analysis of Simplex Crossover for Real-Coded Genetic Algorithms","2539573":"Real-Coded Evolutionary Approaches to Unconstrained Numerical Optimization","248694471":"Transonic axial-flow blade shape optimization using evolutionary algorithm and three-dimensional navier-stokes solver","271943715":"Fitting of self-exciting threshold autoregressive moving average nonlinear time-series model through genetic algorithm and development of out-of-sample forecasts","270280714":"The Introduction of Asymmetry on Traditional 2-Parent Crossover Operators for Crowding and Its Effects","239406686":"Optimum design of rolling element bearings using a genetic algorithm–differential evolution (GA–DE) hybrid algorithm","225138039":"Constraint-Handling in Evolutionary Aerodynamic Design","223298896":"Genetic algorithms and Tabu Search: hybrids for optimization. Computers é4 Operations Research, 22: 111-134","278720643":"Improved Genetic Algorithm for Structural Damage Detection","262641541":"Multi-Objective Genetic Algorithm for voltage stability enhancement using rescheduling and FACTS devices","227280302":"Evolutionary Particle Swarm Optimization: A Metaoptimization Method with GA for Estimating Optimal PSO Models","251969312":"Evolving Q-learners for stochastic games: Study on video game agent controllers","221359387":"Hypoglycemia detection using fuzzy inference system with genetic algorithm","233551297":"Vibrational genetic algorithm enhanced with neural networks in RCS problems","224644435":"3D Forensic Model Reconstruction by Scatter Search-based Pair-wise Image Registration","2533395":"Optimal Anytime Search For Constrained Nonlinear Programming","280721549":"447 - Tabu Search in Analytics and Computational Science","258705235":"IVTURS: A Linguistic Fuzzy Rule-Based Classification System Based On a New Interval-Valued Fuzzy Reasoning Method With Tuning and Rule Selection","242460233":"Design andanalysisof radiometric instrumentsusing high-levelnumerical modelsand geneticalgorithms","287035687":"Incorporating Genetic Algorithms in Transport Management","2615321":"The Reproductive Plan Language RPL2: Motivation, Architecture and Applications","4089857":"Evaluating a hybrid encoding and three crossover operators on the constrained portfolio selection problem","268750916":"Metaheuristics in large-scale global continues optimization: A survey","225369391":"Performance evaluation of memetic approaches in 3D reconstruction of forensic objects","2402405":"Multidisciplinary Optimization Of Transonic Wing Design Based On Evolutionary Algorithms Coupled With Cfd Solver","221019492":"Experimental Analysis of the Aging Operator for Static and Dynamic Optimisation Problems","226192691":"A genetic-algorithm-based optimization model for scheduling flexible assembly lines","256495367":"Multi-method algorithms: Investigating the entity-to-algorithm allocation problem","221007203":"Genetic algorithm based fuzzy multiple regression for the nocturnal Hypoglycaemia detection.","232836528":"Development of an Optimum Design Methodology of Cylindrical Roller Bearings Using Genetic Algorithms","226456874":"Climato-hydrological environment inferred from Lake Baikal sediments based on an automatic orbitally tuned age model","263901165":"GENERATION OF SYMMETRICAL COLORED IMAGES VIA SOLUTION OF THE INVERSE PROBLEM OF CHEMICAL REACTIONS DISCRETE CHAOTIC DYNAMICS","257392384":"A multi-objective optimization based solution for the combined economic-environmental power dispatch problem","228634106":"Global Optimization Accuracy and Evolutionary Dynamics of the Generalized Generation Gap Algorithm with Adaptive Mutation","257722118":"Economic analysis of a hybrid solar-fuel cell power delivery system using tuned genetic algorithm","261042133":"Evolutionary Medical Image Registration using Automatic Parameter Tuning","228787704":"High fidelity swept and leaned rotor blade design optimization using evolutionary algorithm","227603916":"Genetic algorithms and applications to finance","3917925":"Global optimization of deformable surface meshes based on geneticalgorithms","257144588":"How to analyse evolutionary algorithms","227890679":"Optimizing the reservoir operation rule curves by genetic algorithms. Hydrol Process","6662151":"Development of a Culture Sub‐population Induction Model: Signaling Pathways Synergy and Taxanes Production by Taxuscanadensis","285391206":"Computational Intelligence: Synergies of Fuzzy Logic, Neural Networks and Evolutionary Computing","278302963":"tourism final","255704923":"Genetic Algorithm to Estimate Cumulative Prospect Theory Parameters for Selection of High-Occupancy-Vehicle Lane","265181097":"Guest editorial: Special issue on data mining","2400323":"An Overview of Genetic Algorithms: Part 2, ResearchTopics","221007179":"A memetic algorithm for dosimetric optimization in CyberKnife robotic radiosurgical treatment planning","224472329":"A Statistical Study of The Differential Evolution based on Continuous Generation Model","8569067":"Multi objective water resources systems analysis using genetic algorithms—application to Chou-Shui river basin Taiwan. J Water Sci Technol","221078848":"Evolving Spiking Neural Parameters for Behavioral Sequences.","221582661":"Diversity and Multimodal Search with a Hybrid Two-Population GA: An Application to ANN Development.","221539655":"Capturing User\u0027s Preferences using a Genetic Algorithm - Determining Essential and Dispensable Item Attributes.","4089931":"Vulnerability analysis of AIS-based intrusion detection systems via genetic and particle swarm red teams","220757329":"Optimization Design of a Stewart Platform Type Leg Mechanism for Biped Walking Vehicle","223497515":"Recurrent fuzzy network design using hybrid evolutionary learning algorithms","52009830":"A hybrid analytical-heuristic method for calibrating land-use change models","245440222":"GLOBAL OPTIMIZATION: APPLICATIONS TO ADVANCED REFLECTOR ANTENNAS SYNTHESIS AND DIAGNOSIS TECHNIQUES","2939054":"Evolutionary Algorithms","8268025":"Heuristic Extraction of Rules in Pruned Artificial Neural Networks Models Used for Quantifying Highly Overlapping Chromatographic Peaks","220306858":"Hierarchical component-based representations for evolving microelectromechanical systems designs","226078196":"Hierarchical Evolutionary Algorithms and Noise Compensation via Adaptation","220065170":"Real-Coded Genetic Algorithm for Solving Generalized Polynomial Programming Problems.","226708754":"Real-Coded Genetic Algorithm for Rule-Based Flood Control Reservoir Management","259399655":"Improved genetic algorithm for voltage security constrained optimal power flow problem","261238528":"Creating new functions in a P2P network using a source routing based method and a genetic algorithm","220497329":"Evolutionary parallel and gradually distributed lateral tuning of fuzzy rule-based systems","228543752":"Algoritmos Genéticos para el Ajuste de Parámetros y Selección de Reglas en el Control Difuso de un Sistema de Climatización HVAC para Grandes Edificios","261412621":"Obtaining accurate TSK Fuzzy Rule-Based Systems by Multi-Objective Evolutionary Learning in high-dimensional regression problems","254050238":"A proposal of model-based alignment using swarm intelligence and condensation","2414776":"Formal Algorithms + Formal Representations \u003d Search Strategies","2425017":"A Genetic Algorithm Tutorial","220016000":"Evolvable subsethood product fuzzy neural network for pattern classification","37243559":"Sélection et réglage de paramètres pour l\u0027optimisation de logiciels d\u0027ordonnancement industriel","224079354":"Free Search - A Model of Adaptive Intelligence","220315012":"Replacement strategies to preserve useful diversity in steady-state genetic algorithms","221162888":"FPRGA Based on Construction of Multiwavelets in Term of a Novel Transformation","220702080":"Steady-State Evolutionary Path Planning, Adaptive Replacement, and Hyper-Diversity","225664472":"Stochastic sketching: A new method for global optimization","220175796":"Role differentiation and malleable mating for differential evolution: An analysis on large-scale optimisation","220743046":"India and Pakistan, a classic \"Richardson\" Arms Race: A Genetic Algorithmic approach.","220175789":"Sánchez AM. Hybrid crossover operators for real-coded genetic algorithms: an experimental study","224599511":"Autonomous Car Fuzzy Control Modeled by Iterative Genetic Algorithms","239550193":"Detection of doors using a genetic visual fuzzy system for mobile","251403850":"A Real-coded Genetic Algorithm using the Unimodal Normal Distribution Crossover","220175784":"Memetic algorithms based on local search chains for large scale continuous optimisation problems: MA-SSW-Chains","224384413":"An Adaptive Penalty Formulation for Constrained Evolutionary Optimization","220110299":"A Comparison of Genotype Representations to Acquire Stock Trading Strategy Using Genetic Algorithms","3113193":"Optimization of Extra-High-Voltage SF $_{6}$ Circuit Breaker Based on Improved Genetic Algorithm","223815057":"CAS algorithm-based optimum design of PID controller in AVR system","223772049":"Optimal predicted fuzzy controller of a constant turning force system with fixed metal removal rate","238720755":"Parameter Setting in Evolutionary Algorithms","223442328":"Integration of genetic fuzzy systems and artificial neural networks for stock price forecasting","221009382":"Evolution of Search Algorithms Using Graph Structured Program Evolution.","261267294":"Pure and Hybrid Optimizers Applicable to Large-Scale Design Problem","233045294":"Engineering design optimization using swarm with an intelligent information sharing among individuals","220706280":"Self-configuration of Wireless Access Points Based on Mechanisms of Biological Development and Evolution.","254416894":"Interactions Between Evolution and Learning","225705383":"Self-Adaptation in Evolutionary Algorithms","261283655":"A study of crossover operators and reference set sizes for scatter search in unconstrained function optimization","283277364":"Landmark-based music recognition system optimisation using genetic algorithms","19220988":"Clostridium thermosaccharolyticum strain deficient in acetate production","230825241":"A chemical evolutionary mechanism for instantiating service-based applications","240600715":"Dead Load Based Damage Identification Method for Long-term Structural Health Monitoring","220868087":"Improving Fuzzy Rule-Based Decision Models by Means of a Genetic 2-Tuples Based Tuning and the Rule Selection.","229748079":"Fundamentals of Genetic Algorithms","261500744":"Evolution of strategies in a spatial IPD game with a number of different representation schemes","242190000":"A COMPARISON OF NATURE INSPIRED INTELLIGENT OPTIMIZATION METHODS IN AERIAL SPRAY DEPOSITION MANAGEMENT","228975943":"Discovering hierarchical decision rules with evolutive algorithms in supervised learning","224503170":"Evolutionary Neural Network Prediction for Cumulative Failure Modeling","220702159":"A New Proposal for Multiobjecive Optimization Using Particle Swarm Optimization and Rough Sets Theory.","227116384":"A newly cooperative PSO - Multiple particle swarm optimizers with diversive curiosity, MPSOα/DC","221228483":"High-Fidelity Multidisciplinary Design Optimization of Wing Shape for Regional Jet Aircraft.","224599439":"Evolution of Cooperative Behavior in a Spatial Iterated Prisoner\u0027s Dilemma Game with Different Representation Schemes of Game Strategies","260280173":"Revisiting evolutionary algorithms in feature selection and nonfuzzy/fuzzy rule based classification","220601801":"Genetic approaches for topological active nets optimization","41204356":"A framework for hybrid dynamic evolutionary algorithms : multiple offspring sampling (MOS)","220497366":"Rule base and adaptive fuzzy operators cooperative learning of Mamdani fuzzy systems with multi-objective genetic algorithms","261267296":"An Expandable Genetic Cell System for Solving Global Optimization Problem on Continuous Multimodal Functions","4253878":"Evolutionary Algorithms in the Presence of Noise: To Sample or Not to Sample","270723288":"An Evolutionary Multiobjective Approach to Sparse Reconstruction","220313053":"Supervised learning by means of accuracy-aware evolutionary algorithms","3995841":"Real-coded genetic algorithm for signal timing optimization of a single intersection","256919471":"Multiobjective Optimization of Trusses Using Genetic Algorithms","260945778":"Sparse Bayesian Hierarchical Prior Modeling Based Cooperative Spectrum Sensing in Wideband Cognitive Radio Networks","224719972":"Highly Interpretable Linguistic Knowledge Bases Optimization: Genetic Tuning versus Solis-Wetts. Looking for a good interpretability-accuracy trade-off","221469746":"Growing Compact RBF Networks Using a Genetic Algorithm.","221230125":"Using context history to personalize a resource recommender via a genetic algorithm","220470306":"Multi-operator based evolutionary algorithms for solving constrained optimization problems. Comput Oper Res","220341285":"DoE framework for catalyst development based on soft computing techniques","244117382":"Optimization of membrane gas separation systems using genetic algorithm","26587269":"Particle Swarm Optimization with Diversive Curiosity - An Endeavor to Enhance Swarm Intelligence","251123687":"A Web-Based Tool for the Automatic Segmentation of Cardiac MRI","224216140":"Evolution of Strategies With Different Representation Schemes in a Spatial Iterated Prisoner\u0027s Dilemma Game","261342849":"Multi-objective optimization using a hybrid differential evolution algorithm","239984479":"Discussion of the crossover method of interactive Genetic Algorithm for extracting multiple peaks on Kansei landscape","281692633":"Application of a Translational Tuned Mass Damper Designed by Means of Genetic Algorithms on a Multistory Cross-Laminated Timber Building","223741000":"Parameter estimation of three-winding transformers using genetic algorithm","268749083":"Genetic learning of the membership functions for mining fuzzy association rules from low quality data","257635963":"A decomposition-based hybrid multiobjective evolutionary algorithm with dynamic resource allocation","226651296":"Two-Loop Real-Coded Genetic Algorithms with Adaptive Control of Mutation Step Sizes","232635647":"A New Modified Accurate Genetic Algorithm for Multivariable Systems","221006859":"Design of an Evolutionary Controller and Its Application","224289910":"Research on Float-Coded Genetic Algorithm Based on Wavelet Denoising Mutation","256495201":"Investigating the Use of Local Search for Improving Meta-Hyper-Heuristic Performance","233327810":"Hybrid-coded crossover for binary-coded genetic algorithms in constrained optimization","1958193":"Dominance Based Crossover Operator for Evolutionary Multi-objective Algorithms","8337745":"Gray-Scale Image Enhancement as an Automatic Process Driven by Evolution","257511031":"An optimization of energy addition to suppress the coalescence of the shock waves","221006876":"Fitness diversity based adaptation in Multimeme Algorithms: A comparative study","238720778":"Applications of Computational Intelligence in Biology: Current Trends and Open Problems","221187097":"A Float Code Genetic Algorithm Based on Orthonormal Multiwavelet Denoising Mutation","220701727":"Multiobjective Design Optimization of Merging Configuration for an Exhaust Manifold of a Car Engine","220199972":"Distance-based relevance feedback using a hybrid interactive genetic algorithm for image retrieval","221469711":"A Hybrid Genetic Algorithm for Finding Stable Conformations of Small Molecules.","220199971":"Two-layer particle swarm optimization for unconstrained optimization problems","2529563":"Improving Constrained Nonlinear Search Algorithms Through Constraint Relaxation","286287917":"LandParcelS: A module for automated land partitioning","225227821":"Particle Swarm Optimization with Diversive Curiosity and Its Identification","220550255":"Parallel multiobjective memetic RBFNNs design and feature selection for function approximation problems","227136708":"Theoretical and Experimental Study of Crossover Operators of Genetic Algorithms","222909444":"A hybrid coevolutionary algorithm for designing fuzzy classifiers","5548314":"P300-Based BCI Mouse With Genetically-Optimized Analogue Control","261308124":"An image registration approach using genetic algorithms","241159951":"Research on FCGA Based on Orthonormal Multiwavelet Denoising Mutation","251238305":"Comparison between Genetic Algorithms and Differential Evolution for Solving the History Matching Problem","220626041":"Hyperbox classifiers for arrhythmia classification","221006924":"Adaptive elevator dispatching with co-neuroevolution.","227101930":"Evolutionary Multi-Objective Optimization Without Additional Parameters","242394903":"Path-Planning Via the Evolution of General Regression Neural Networks Submitted to Committee Members","254043713":"An new crossover operator for real-coded genetic algorithm with selective breeding based on difference between individuals","256937527":"Geometricity of genetic operators for real-coded representation","282933681":"Interval arithmetic and genetic algorithms in global optimization","267974295":"Multidisciplinary Design Exploration of Wing Shape for Silent Supersonic Technology Demonstrator","224064558":"A new scheme of case-based decision support systems by using DEA and GA techniques","224105517":"Integration of an Index to Preserve the Semantic Interpretability in the Multiobjective Evolutionary Rule Selection and Tuning of Linguistic Fuzzy Systems","264789694":"Massively Parallel Evolutionary Computation on GPGPUs","261447404":"Memetic Algorithm with PSO or BFO\u0027s chemotaxis mechanism as local search for function optimization","220742738":"A continuous variable neighbourhood search based on specialised EAs: application to the noiseless BBO-benchmark 2009.","255827525":"Fuzzy decision support for tools selection in the core front end activities of new product development","264273595":"Evolutive Approaches for Variable Selection Using a Non-parametric Noise Estimator","233751699":"Searching for rules to detect defective modules: A subgroup discovery approach","221582518":"Node Level Crossover Applied to Neural Network Evolution.","242096106":"Operadores de cruce por intervalo de confianza en problemas de modelado utilizando algoritmos genéticos con codificación real","222401737":"A fast and accurate approach for 3D image registration using the scatter search evolutionary algorithm","237270953":"YAPAY SİNİR AĞI İLE GÜÇLENDİRİLMİŞ GENETİK ALGORİTMA VE TERSTEN KANAT PROFİLİ DİZAYNI","268859787":"New developments in computational fluid dynamics. Proceedings of the sixth international Nobeyama workshop on the new century of computational fluid dynamics, Nobeyama, Japan, April 21–24, 2003","257588951":"Utilizing expected improvement and generalized data envelopment analysis in multi-objective genetic algorithms","276836621":"Theoretical and Numerical Studies of Dynamic Scaling of a Six-Degree-of-Freedom Laser Propulsion Vehicle","224720107":"A New Multiobjective RBFNNs Designer and Feature Selector for a Mineral Reduction Application","2333106":"Simulated Binary Crossover for Continuous Search Space","37993426":"A design tool architecture for the rapid evaluation of product design tradeoffs in an Inernet-based system modeling environment","234024035":"On the Design of Constraint Covariance Matrix Self-Adaptation Evolution Strategies Including a Cardinality Constraint (August, pg 578, 2012)","4012462":"Robust PD sway control of a lifted load for a mobile crane using a genetic algorithm","222160046":"Systematic approach to consider system contingencies in PSS design","257636040":"Review of phenotypic diversity formulations for diagnostic tool","4262357":"An Evolutionary Algorithm for Optimizing Functions with UV Structures","35468168":"Análise de reabilitação de redes de distribuição de água para abastecimento via algoritmos genéticos multiobjetivo.","43602703":"Estimación de un Control Lateral Difuso de Vehículos","220372152":"A pseudo genetic algorithm","248254295":"Integrating genetic algorithm and support vector machine for polymer flooding production performance prediction","2468280":"Object-based Design Modeling and Optimization with Genetic Algorithms","267501164":"Optimum Design and Sensitivity Analysis of Axial Flow Compressor With Combination of Analytical Method, Qualitative and Quantitative Rules and Genetic Algorithm","228846654":"Modified predator-prey (MPP) algorithm for constrained multi-objective optimization","3903909":"A swarm with an effective information sharing mechanism for unconstrained and constrained single objective optimisation problems","228846653":"Modified predator-prey algorithm for constrained and unconstrained multi-objective optimisation","3418516":"Evolutionary programming techniques for constrained optimization problems","222368992":"Solution of Economic Load Dispatch using real coded Hybrid Stochastic Search","250885975":"DESIGNING DIELECTRIC GRATING FILTERS WITH PGAPACK","3418513":"Evolutionary Computation: Comments on the History and Current State","41481182":"Robust mask-layout and process synthesis in micro-electro-mechanical-systems (MEMS) using genetic algorithms","3301781":"Theoretical Analysis of Evolutionary Algorithms With an Infinite Population Size in Continuous Space Part II: Analysis of the Diversification Role of Crossover","245061427":"Vibrational genetic algorithm enhanced with fuzzy logic and neural networks","3903889":"A crossover operator using independent component analysis for real-coded genetic algorithms","257423101":"Data Mining of Pareto-Optimal Transonic Airfoil Shapes Using Proper Orthogonal Decomposition","227603514":"Applying simulation optimization to dynamic financial analysis for the asset-liability management of a property-casualty insurer","220701835":"Optimum Design of Surface Acoustic Wave Filters Based on the Taguchi’s Quality Engineering with a Memetic Algorithm","225582302":"On the Use of Distributed Genetic Algorithms for the Tuning of Fuzzy Rule Based-Systems","257720048":"Genetic Algorithm for the History Matching Problem","224634062":"Performance Improvement of Hybrid Real-Coded Genetic Algorithm with Local Search and Its Applications","223931638":"An improved genetic algorithm for planar and spatial straightness error evaluation","221105309":"Mobile Robot Controller Design by Evolutionary Multiobjective Optimization in Multiagent Environments.","261054013":"On the recombination operator in the real-coded genetic algorithms","220740763":"Uniform Crossover Revisited: Maximum Disruption in Real-Coded GAs","232723564":"Interpretable fuzzy systems modeling with cooperation between expert and induced knowledge","228762647":"In Silico 3D Structure Prediction of Activated GPCRs as a Drug Target","4256245":"Solving non convex Min-Max predictive controller","229891078":"An Efficient Preprocessing Method for Suboptimal Route Computation","3336586":"Automatic Tuning of a Fuzzy Visual System Using Evolutionary Algorithms: Single-Objective Versus Multiobjective Approaches","237148058":"An Efficient Genetic Algorithm for Maximum Coverage Deployment in Wireless Sensor Networks","228901918":"Exhaust Manifold Design for a Car Engine Based on Engine Cycle Simulation","224619736":"Evolutionary design of robust PD sway control of a lifted load for a crane","287330461":"IMPACT ANALYSIS OF CROSSOVERS IN MULTIOBJECTIVE EVOLUTIONARY ALGORITHM","261054000":"Particle swarm optimization with discrete crossover","248702738":"A Parallel Multi-objective Local Search for AEDB Protocol Tuning","2462181":"A Flexible Optimization Procedure for Mechanical Component Design Based on Genetic Adaptive Search","6525345":"A Fast Adaptive Memetic Algorithm for Online and Offline Control Design of PMSM Drives","255682302":"EVOLUTIONARY AND ADAPTIVE SYNTHESIS METHODS","3809785":"New approaches to the true worst-case evaluation in circuittolerance analysis. I. Calculation of the inner solution by geneticalgorithms","260621899":"A Hybrid Multiobjective Evolutionary Algorithm for Multiobjective Optimization Problems","237434850":"An Empirical Comparison of Seven Iterative and Evolutionary Heuristics for Static Function Optimization (Extended Abstract)","3418608":"Test-case generator for nonlinear continuous parameter optimization techniques","272126449":"Operation Optimization in the Hot-Rolling Production Process","224720041":"A Multi-Objective Evolutionary Algorithm for Rule Selection and Tuning on Fuzzy Rule-Based Systems","222569617":"Linking chemical knowledge and genetic algorithms using two populations and focused multimodal search","220701951":"Multi-parent Recombination in Genetic Algorithms with Search Space Boundary Extension by Mirroring","258221756":"A spatial genetic algorithm for automating land partitioning","221949155":"Free Search - A comparative analysis","237510644":"Genetic Algorithms, Evolutionary Algorithms and Scatter Search: Changing Tides and Untapped Potentials","220701947":"Theoretical Analysis of the Confidence Interval Based Crossover for Real-Coded Genetic Algorithms","50252575":"Robust power system stabilizer design by evolutionary algorithms","3809755":"Quaternary coded genetic algorithms","284277008":"A Hybrid Method for Short-Term Traffic Congestion Forecasting Using Genetic Algorithms and Cross Entropy","233147399":"Application of hybrid evolutionary algorithms to low exhaust emission diesel engine design","3418583":"Gradual Distributed Genetic Algorithms","257636030":"Adaptive directed mutation for real-coded genetic algorithms","13267245":"Conjugate Schema and Basis Representation of Crossover and Mutation Operators","221007044":"Two-Dimensional Barcode Decoration Based on Real-Coded Genetic Algorithm","251627281":"EEG simulation by 2D interconnected chaotic oscillators","39431094":"Evolutionaty training for dynamical recurrent neural networks: an application in finantial time series prediction","222428336":"Feature-based image registration by means of the CHC evolutionary algorithm","234099712":"Novel Computational Methodologies for Structural Modeling of Spacious Ligand Binding Sites of G-Protein-Coupled Receptors: Development and Application to Human Leukotriene B4 Receptor","262315611":"Impact of Different Recombination Methods in a Mutation-Specific MOEA for a Biochemical Application","226243718":"Multi-parent Recombination Operator with Multiple Probability Distribution for Real Coded Genetic Algorithm","238559170":"Evolutionary Optimization of Combined Sewer Overflow","238659527":"A Study on Flapping Motion for MAV Design Using Design Exploration","216301286":"Survey on multiobjective evolutionary and real coded genetic algorithms","220753706":"Combining interpretable fuzzy rule-based classifiers via multi-objective hierarchical evolutionary algorithm","233041893":"Genetic algorithm for the optimal design of axially loaded non-prismatic columns","261275035":"Genetic search for fast object detection","222420811":"Real/binary-like coded versus binary coded genetic algorithms to automatically generate fuzzy knowledge bases: A comparative study","228355991":"Real‐parameter crossover operators with multiple descendents: An experimental study","268207600":"Kinetics Oxidation of Heavy Oil. 2. Application of Genetic Algorithm for Evaluation of Kinetic Parameters","241171538":"Robust PSS Design Considering Power System Contingencies Based on a Recursive PSO","220176142":"Metaheuristic optimization frameworks: A survey and benchmarking","222342994":"A Markov Chain analysis of genetic algorithms with power of 2 cardinality alphabets","261373324":"Learning TSK-0 linguistic fuzzy rules by means of local search algorithms","251833634":"Notice of Violation of IEEE Publication PrinciplesSecurity Enhancement of Optimal Power Flow using Genetic Algorithm","225181513":"Evolutionary Brain Computer Interfaces","3693086":"Hybrid evolutionary motion planning via visibility-based repair","221927196":"The Roles of Crossover and Mutation in Real-Coded Genetic Algorithms","249009407":"Sequential multiobjective optimization for large-scale passive filter synthesis","3418648":"On self-adaptive features in real-parameter evolutionary algorithm. IEEE T Evolut Comput","222062352":"An effective genetic algorithm for circularity error unified evaluation","227332001":"Knowledge Base Learning of Linguistic Fuzzy Rule-Based Systems in a Multi-objective Evolutionary Framework","3418651":"Evolutionary pattern search algorithms for unconstrained and linearly constrained optimization","222820212":"Cordón, O.: A historical review of evolutionary learning methods for Mamdani-type fuzzy rule-based systems: Designing interpretable genetic fuzzy systems. International Journal of Approximate Reasoning 52, 894-913","220176172":"Fuzzy-genetic optimization of the parameters of a low cost system for the optical measurement of several dimensions of vehicles","223248251":"A new mutation operator for real coded genetic algrithms","222998397":"Genetic Algorithm with adaptive elitist-population strategies for multimodal function optimization. Appl Soft Comput","5614191":"Evolutionary learning of hierarchical decision rules. IEEE Trans Syst Man Cybern B","225740623":"Human Motion Retrieval System Based on LMA Features Using Interactive Evolutionary Computation Method","220741398":"Breeding swarms: a GA/PSO hybrid","222197505":"A genetic algorithm estimation of the term structure of interest rates","3224177":"A genetic algorithm framework for test generation","5874205":"Mathematical Identification of Critical Reactions in the Interlocked Feedback Model","226867136":"Optimal Predicted Fuzzy PI Gain Scheduling Controller of Constant Turning Force Systems with Fixed Metal Removal Rate","223452951":"Design of arbitrary FIR log filters by genetic algorithm approach","221439860":"Survival selection methods for the Differential Evolution based on continuous generation model.","257666333":"Cellular genetic algorithms without additional parameters","220204903":"A multi-objective evolutionary algorithm for an effective tuning of fuzzy logic controllers in heating, ventilating and air conditioning systems. Appl Intell","220403565":"Adaptive Reservoir Evolutionary Algorithm: An Evolutionary On-Line Adaptation Scheme for Global Function Optimization","3865194":"Evolving neural networks in environments with delayed rewards by a real-coded GA using the unimodal normal distribution crossover","10584818":"Tools for intelligent control: Fuzzy controllers, neural networks and genetic algorithms","3240548":"An evolutionary algorithm for the synthesis of multilayer coatingsat oblique light incidence","221398890":"Distributed Genetic Tuning of Fuzzy Rule-Based Systems.","221007734":"The \"Natura Non Facit Saltus\" Principle in Memetic Computing","224245506":"Evolutionary Prediction for Cumulative Failure Modeling: A Comparative Study","27524035":"Process Optimization for Machining of Hardened Steels","235316324":"Vibrational genetic algorithm as a new concept in airfoil design","3623508":"GENOCOP III: A co-evolutionary algorithm for numerical optimization problems with nonlinear constraints","222697253":"Approximate k-NN delta test minimization method using genetic algorithms: Application to time series","228556793":"Selección heurística en imágenes 3D para la reconstrucción forense de cráneos con búsqueda dispersa","2656846":"Software Reliability Engineering: An Evolutionary Neural Network Approach","225799965":"Evolving Solutions: The Genetic Algorithm and Evolution Strategies for Finding Optimal Parameters","260621792":"A Review of the Application of Multiobjective Evolutionary Fuzzy Systems: Current Status and Further Directions","220372808":"Cho, S.B.: A Comprehensive Survey on Functional Link Neural Networks and an Adaptive PSO-BP Learning for CFLNN. Neural Computing and Applications 19(2), 187-205","225611545":"Application of Crossover Operators Based on Confidence Interval in Modeling Problems Using Real-Coding Genetic Algorithms","220467016":"Automatic Tuning of a Fuzzy Visual System Using Evolutionary Algorithms: Single-Objective Versus Multiobjective Approaches.","222648107":"Genetic granular classifiers in modeling software quality","245314801":"Inverse airfoil design by using an accelerated genetic algorithm via distribution strategies","257330488":"A Framework for Hybrid Dynamic Evolutionary Algorithms: Multiple Offspring Sampling (MOS)","224218930":"Comparison between Conventional, GA and PSO with respect to optimal capacitor placement in agricultural distribution system","3623491":"Solving randomly generated constraint satisfaction problems using a micro-evolutionary hybrid that evolves a population of hill-climbers","232656810":"Advancing Artificial Intelligence Through Biological Process Applications","2409052":"Real Representations","261506538":"Improving a fuzzy association rule-based classification model by granularity learning based on heuristic measures over multiple granularities","233533334":"Selecting SNPs for pharmacogenomic association study","274567712":"High-yield hydrogen production from biomass by in vitro metabolic engineering: Mixed sugars coutilization and kinetic modeling","241171489":"Degree preserving based crossover for constrained optimization problems","267971975":"Constrained Optimization of Rotor-Bearing Systems by Evolutionary Algorithms","220176224":"An investigation on niching multiple species based on population replacement strategies for multimodal functions optimization","279525931":"Towards Climate Optimized Flight Trajectories in a Climate Model: AirTraf","226377725":"DNA computation simulator based on abstract bases","221001647":"Immunity-based intrusion detection system design, vulnerability analysis, and GENERTIA\u0027s genetic arms race","3754673":"GA-based grey fuzzy dynamic sliding mode controller design","6314729":"Genetic Algorithms for Finite Mixture Model Based Voxel Classification in Neuroimaging","256202188":"Fuzzy-valued Evolution Strategy for Evolving Neural Networks with Fuzzy Weights and Biases","226043890":"Searching performance of a real-coded genetic algorithm using biased probability distribution functions and mutation","3418808":"Intelligent Evolutionary Algorithms for Large Parameter Optimization Problems","221024161":"An Agent System for Learning Profiles in Broadcasting Applications on the Internet.","251237492":"On the evolutionary optimization of k-NN by label-dependent feature weighting","290390976":"An enhancement of selection and crossover operations in real-coded genetic algorithm for large-dimensionality optimization","255585705":"Study on Rotor Critical Speeds Optimal Adjustment to Disks Positions","3218083":"Passive filter design using genetic algorithms","280177185":"A Crossover Operator of Genetic Algorithms for Periodic Function Optimization","12118574":"A real-coded genetic algorithm for training recurrent neural networks. Neural Netw","2335418":"A Combined Genetic Adaptive Search (GeneAS) for Engineering Design","228818745":"Genetic algorithms for finite mixture model based tissue classification in brain MRI","257684928":"An effective genetic algorithm to VDA with discontinuous “on-off” switches","236678279":"Turbofan Multiobjective-Multipoint Optimization for UAV/UCAV Applications","262339902":"METSK-HDe: A multiobjective evolutionary algorithm to learn accurate TSK-fuzzy systems in high-dimensional and large-scale regression problems","220118974":"Evolutionary computing based mobile robot localization","257779199":"Application of a Genetic Algorithm on the Assessment of the Capabilities of Cctuator Systems for Laser Mircro Adjustment","248880253":"Optimal Design of Water Networks Using a Modified Genetic Algorithm with Reduction in Search Space","228372279":"New methodologies based on delta test for variable selection in regression problems","3865239":"Towards Automatic Image Enhancement Using Genetic Algorithms","226637618":"Genetic Lateral and Amplitude Tuning with Rule Selection for Fuzzy Control of Heating, Ventilating and Air Conditioning Systems","4315895":"A multi-series grey forecasting model based on neural network improved by genetic algorithm","43655203":"An adaptive hierarchical fair competition genetic algorithm for large-scale numerical optimization.","232654693":"Research on Floating Point Representation Denoising Mutation Based on GFMRA","225337298":"A new weather-routing system that accounts for ship stability based on a real-coded genetic algorithm","3822215":"A new approach for security constrained economic emission dispatch in power systems","3412724":"OPSO: Orthogonal Particle Swarm Optimization and Its Application to Task Assignment Problems","220375009":"Optical Coating Designs Using the Family Competition Evolutionary Algorithm","224178072":"Population-based quasi-Bayesian algorithm for high-dimensional sequential problems and hierarchization of it for distributed computing environments","241112215":"A new vibrational genetic algorithm enhanced with a Voronoi diagram for path planning of autonomous UAV","229035887":"Using genetic algorithms to aid in a vulnerability analysis of national missile defense simulation software","221024230":"Recombination and Self-Adaptation in Multi-objective Genetic Algorithms","276398772":"Generation of Pareto Optimal Solutions Using Expected Improvement and Generalized Data Envelopment Analysis","3861227":"Evolving neural induction regular language using combined evolutionary algorithms","256214422":"Multiobjective Optimization and Comparison of Nonsingleton Type-1 and Singleton Interval Type-2 Fuzzy Logic Systems","12135009":"A Genetic Algorithm with Adaptive Mutations and Family Competition for Training Neural Networks","225148849":"Comparing the niches of CMA-ES, CHC and pattern search using diverse benchmarks","224264071":"Human Gait Modeling Using a Genetic Fuzzy Finite State Machine","249777208":"Going nonlinear: Towards automated puff intercept","265078035":"Senin A framework for mixed parametric and catalog-based design problem modeling and optimization","221231055":"Continuous Variable Neighbourhood Search Algorithm Based on Evolutionary Metaheuristic Components: A Scalability Test","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","220372937":"A Robust Evolutionary Algorithm for Training Neural Networks","242107522":"MultiCriteria Decision Making for Sustainability-Oriented Chemical Process Design","242381983":"A Bi-population Scheme for Real-coded GAs: The Basic Concept","227102564":"A Realistic Information Retrieval Environment to Validate a Multiobjective GA-P Algorithm for Learning Fuzzy Queries","3865289":"Experimental validations of the learnable evolution model","245331051":"Evolutionary algorithms applied to project scheduling problems - A survey of the state-of-the-art","261332330":"Distributed human-based genetic algorithm utilizing a mobile ad hoc network","220555227":"Multidimensional and multideme genetic algorithms for the construction of fuzzy systems","259949952":"Incremental Social Learning in Swarm Intelligence Algorithms for Continuous Optimization","282352171":"Datum unit optimization for robustness of a journal bearing diagnosis system","227778195":"Improved genetic algorithm for multi‐objective reactive power dispatch problem","221333042":"A threshold denoising based floating point representation genetic algorithm.","239541571":"This paper presents a GA algorithm for function optimization that combines the features of Simplex","221228587":"Designing Multi-objective Variation Operators Using a Predator-Prey Approach.","3234615":"Robust vector quantization for wireless channels","2429730":"Evolutionary Pattern Search Algorithms","225402472":"An efficient evolutionary algorithm for fuzzy inference systems","221228583":"A Real-Coded Predator-Prey Genetic Algorithm for Multiobjective Optimization","243783053":"Mask-Layout Synthesis Through an Evolutionary Algorithm","220462633":"A GA-Simplex Hybrid Algorithm for Global Minimization of Molecular Potential Energy Functions","236176665":"Design-Informatics Approach for Intimate Configuration of Silent Supersonic Technology Demonstrator","221001255":"Daily demand forecasting of new products utilizing diffusion models and genetic algorithms","245310867":"Exhaust manifold design with tapered pipes using divided range MOGA","251997192":"Distribution System Fault Location Considering Voltage Sag Characteristics","3756841":"True-worst-case evaluation in circuit tolerance and sensitivity analysis using genetic algorithms and affine mathematics","245439927":"Development of Multi-Objective Six Sigma Approach for Robust Design Optimization","246044092":"Improving Performance via Population Growth and Local Search: The Case of the Artificial Bee Colony Algorithm","226948753":"RCGA-S/RCGA-SP Methods to Minimize the Delta Test for Regression Tasks","222580319":"An Overview of Evolutionary Algorithms: Practical Issues and Common Pitfalls. Information and Software Technology","228957886":"Reproduction Strategy Based on Self-Organizing Map for Real-coded Genetic Algorithms","226436708":"Automatic 3D Modeling of Skulls by Scatter Search and Heuristic Features","4225889":"Sequential Circuit Test Generation in a Genetic Algorithm Framework","3949337":"A real-coded genetic algorithm involving a hybrid crossover method for power plant control system design","255611930":"Algoritmos Genéticos con Codificación Real: Operadores de Cruce Híbridos Basados en Entornos con Múltiples Descendientes","224177780":"Controlling bots in a First Person Shooter game using genetic algorithms","227104416":"A heuristic to solve a sea cargo revenue management problem","220204553":"Improving fuzzy logic controllers obtained by experts: A case study in HVAC systems","224177783":"Evolving search spaces to emphasize the performance difference of real-coded crossovers using genetic programming","225717848":"An Improved Genetic Algorithm with Average-bound Crossover and Wavelet Mutation Operations","221228545":"Visualization and Data Mining of Pareto Solutions Using Self-Organizing Map","267566301":"Aerodynamic Optimization of Transonic Wing Design Based on Evolutionary Algorithm","266663115":"Genetic-based Characterization of Fractured Reservoirs from Interpreted Well Tests","236176675":"Evolutionary-Based Multidisciplinary Design Exploration for Silent Supersonic Technology Demonstrator Wing","289501811":"Non-revisiting genetic algorithm with adaptive mutation using constant memory","2704154":"Soft Genetic Operators in Evolutionary Algorithms","222008840":"Concurrent assembly planning with genetic algorithms","251925552":"A fuzzy associative classification system with genetic rule selection for high-dimensional problems","255638532":"Algoritmos Culturales Aplicados a Optimización con Restricciones y Optimización Multiobjetivo","3011348":"A crack identification microwave procedure based on a genetic algorithm for nondestructive testing","220743274":"Vulnerability Analysis of Immunity-Based Intrusion Detection Systems Using Evolutionary Hackers","237071715":"Developing an intelligent fiber migration simulator in spun yarns using a genetic fuzzy system","220935784":"A Bi-level Genetic Algorithm for Multi-objective Scheduling of Multi- and Mixed-Model Apparel Assembly Lines.","228822759":"A robust real-coded genetic algorithm using unimodal normal distribution crossover augmented by uniform crossover: Effects of self-adaptation of crossover …","227024589":"Optimization of Multireservoir Systems by Genetic Algorithm","236176725":"Multidisciplinary Design Optimization and Data Mining of Transonic Regional-Jet Wing","241724709":"An Optimal Design Methodology of Tapered Roller Bearings Using Genetic Algorithms","222324241":"Multi-sensor fusion: an Evolutionary algorithm approach","235005266":"Human activity recognition in indoor environments by means of fusing information extracted from intensity of WiFi signal and accelerations","236236096":"Human gait modeling using a genetic fuzzy finite state machine","229666537":"Structural damage assessment with antiresonances versus mode shapes using parallel genetic algorithms. Struct Control Health Monit","266257538":"Advances in information systems. 2nd international conference, ADVIS 2002, Izmir, Turkey, October 23–25, 2002. Proceedings","257403913":"An adaptive rule-based approach for managing situation-awareness","259480617":"AEDB Protocol Tuning with a Fast Efficient Parallel Multi-Objective Local Search","220132988":"Learning short multivariate time series models through evolutionary and sparse matrix computation","237727054":"Prescriptive Treatment Optimization Using a Genetic Algorithm: A Tool for Forest Management","263509201":"Comparison and design of interpretable linguistic vs. scatter FRBSs: GM3M generalization and new rule meaning index for global assessment and local pseudo-linguistic representation","3418963":"Natural Encoding for Evolutionary Supervised Learning","3949396":"A comparison of reproductive success and the effect of mating restrictions in coarse-grained parallel genetic algorithms","245439945":"Aerodynamic Multiobjective Design Exploration of a Flapping Airfoil Using a Navier–Stokes Solver","225750552":"Improving Fuzzy Rule-Based Decision Models by Means of a Genetic 2-Tuples Based Tuning and the Rule Selection","272081732":"Genetic Algorithm Optimization of Point Charges in Force Field Development: Challenges and Insights","225123858":"Linkage Identification by Nonlinearity Check for Real-Coded Genetic Algorithms","221228626":"Individual Evaluation Scheduling for Experiment-Based Evolutionary Multi-objective Optimization","290073290":"Automatic Parallelization of EC on GPGPUs and Clusters of GPGPU Machines with EASEA and EASEA-CLOUD","259198194":"Evolving Spike Neural Network Sensors to Characterize the Alcoholic Brain Using Visually Evoked Response Potential","2511780":"Testcase Generator for Nonlinear Continuous Parameter Optimization Techniques","37413310":"Multi-objective optimisation applied to industrial energy problems","3560368":"Environmental issues in Asia and the Pacific-a perspective towards the information in decision making","224177883":"Automatic generation method to derive for the design variable spaces for interactive Genetic Algorithms","263814193":"Portfolio Strategy Optimizing Model for Risk Management Utilizing Evolutionary Computation","239603137":"Pareto-Optimality-Based Constraint-Handling Technique and Its Application to Compressor Design","236684688":"Genetic Fuzzy-based Steering Wheel Controller using a Mass-Produced Car","221398716":"Multi-objective Evolutionary Fuzzy Modelling in Mobile Robotics","220743352":"Genetic algorithms using low-discrepancy sequences","245314831":"Different approaches for the solution of a backward heat conduction problem","251958416":"Evolutionary identification using closed-loop data for a mechanical system","220528306":"Multi-objective hierarchical genetic algorithm for interpretable fuzzy rule-based knowledge extraction","220403386":"Improving crossover operator for real-coded genetic algorithms using virtual parents","255480992":"Evolution for Behavior Selection Accelerated by Activation/Termination Constraints","255704225":"New Clustering Search Approaches Applied to Continuous Domain Optimization","257635579":"An algorithm comparison for dynamic optimization problems","228396607":"Learning the membership function contexts forming fuzzy association rules by using genetic algorithms","220835469":"Design Optimization for Tapered Roller Bearings Using Genetic Algorithms.","242927059":"Combining Richardson\u0027s equations with canard, explosion theory in a Genetic Algorithm to predict instabilities in the India/Pakistan arms race","225433284":"Genetic Algorithm to Optimize Fitness Function with Sampling Error and its Application to Financial Optimization Problem","220372623":"Cooperative binary-real coded genetic algorithms for generating and adapting artificial neural networks","2765700":"Inductive Learning of Mutation Step-size in Evolutionary Parameter Optimization","4744166":"Real-Parameter Evolutionary Monte Carlo With Applications to Bayesian Mixture Models","220900996":"Adaptive Intelligence Applied to Numerical Optimisation","221583002":"Parallel Multi-objective Memetic RBFNNs Design and Feature Selection for Function Approximation Problems","220558986":"Aerospace Design Optimization Using a Steady State Real-Coded Genetic Algorithm","254737566":"A Novel Accurate Genetic Algorithm for Multivariable Systems","220176045":"An incremental particle swarm for large-scale continuous optimization problems: an example of tuning-in-the-loop (re)design of optimization algorithms. Soft Comput","225461957":"On the Usefulness of MOEAs for Getting Compact FRBSs Under Parameter Tuning and Rule Selection","230362627":"Parallelization of genetic algorithm with sexual selection","46590331":"Algoritmos meméticos con aplicación adaptativa de la búsqueda local para optimización continua","239392251":"Pareto optimization using the struggle genetic crowding algorithm","222514940":"A genetic rule weighting and selection process for fuzzy control of heating, ventilating and air conditioning systems","278410072":"Mono-Objective Optimization for Direct Detection Optical OFDM Transmissions in Short-Range Links","245310814":"Identification of the dynamical properties of structures using free vibration data and distributed genetic algorithms","4377473":"Traffic Signal Optimization with Vehicles Queue and the Number of Pedestrians Non-Complying at Single Intersection","3810302":"Using knowledge-based evolutionary computation to solve nonlinear constraint optimization problems: A cultural algorithm approach","3996657":"Parallel simulated annealing with adaptive temperature determined by genetic algorithm","220380908":"Solving constraint satisfaction problems using hybrid evolutionary search","221163260":"Estimating Strength of Concrete Using a Grammatical Evolution.","235443678":"Body Posture Recognition By Means Of A Genetic Fuzzy Finite State Machine","221355752":"Global Optimization of Deformable Surface Meshes Based on Genetic Algorithms.","228730491":"Airfoil Design Optimization for Airplane for Mars Exploration","226530907":"Evolutionary Multi-Objective Optimization and Visualization","256937144":"A Directed Genetic Algorithm for global optimization","256756900":"Development of plotting position for the general extreme value distribution","224446098":"A Multiobjective Evolutionary Approach to Concurrently Learn Rule and Data Bases of Linguistic Fuzzy-Rule-Based Systems","2548693":"Towards Evolutionary Design Of Intelligent Transportation Systems","3156935":"A data modem for GSM voice channel","242077075":"SUPERVISED METHODS FOR FEATURE EXTRACTION","4209598":"Improving the efficiency of an evolutionary algorithm in the optimization of analog microwave circuits using regularized RBF networks","225134229":"EM323: A line search based algorithm for solving high-dimensional continuous non-linear optimization problems","263568311":"Transonic airfoil design and optimisation by using vibrational genetic algorithm","222544192":"Including a simplicity criterion in the selection of the best rule in a genetic fuzzy learning algorithm","259105650":"IMPROVED DIFFERENTIAL EVOLUTION APPROACH FOR MULTI OBJECTIVE REACTIVE POWER PLANNING INCORPORATING VOLTAGE STABILITY","220313897":"Search Space Boundary Extension Method in Real-Coded Genetic Algorithms","267097063":"Compact Evolutionary Interval-Valued Fuzzy Rule-Based Classification System for the Modeling and Prediction of Real-World Financial Applications with Imbalanced Data","4213839":"Multiobjective simulation optimization using an enhanced genetic algorithm","220449074":"Evolutionary Computation and Its Applications in Neural and Fuzzy Systems","245430963":"Aircraft Geometry Design and Optimization for Sonic Boom Reduction","4275282":"Control of Modular Robot with Parameter Estimation Using Genetic Algorithms","255666985":"Posicionamiento autom´ atico de las c´ amaras en un sistema de medici´ on visual de cotas de veh´ iculos","3810348":"A parabolic operator for parameter optimization problems","251939602":"Orthonormal multiwavelet denoising mutation based FPRGA","221579564":"Forward kinematics of the 3RPR planar parallel manipulators using real coded Genetic Algorithms","43466379":"Evolutionary design of robust flight control for a hypersonic aircraft","261270450":"Design of a closed-loop data based evolutionary controller","220739849":"Alternative voting systems in stock car racing","2626563":"A Study in Set Recombination","244994737":"Operating Rules for Multi-Reservoir Systems","2817025":"Genetic Algorithms Applications to Fuzzy Logic Based Systems","221419806":"Generation of Optimal Biped Walking for Humanoid Robot by Co-evolving Morphology and Controller","259224414":"New State-of-the-art Results for Cassini2 Global Trajectory Optimization Problem","3810325":"Incorporation family competition into Gaussian and Cauchy mutations to training neural networks using an evolutionary algorithm","46589673":"Soft-computing and computer vision techniques applied to autonomous robot navigation and human-robot interaction","277804220":"Cooperación entre sistemas de inferencia, métodos de defuzzificación y aprendizaje de sistemas difusos lingüísticos","228624788":"Hybrid Evolutionary Algorithms and Clustering Search","3959814":"Design optimisation of the Nadaraya-Watson fuser using a genetic algorithm","220176735":"Adaptation and application of multi-objective evolutionary algorithms for rule reduction and parameter tuning of fuzzy rule-based systems. Soft Comput","226808261":"Evolutionary Optimization of Least-Squares Support Vector Machines","221053294":"Cooperation between the Inference System and the Rule Base by Using Multiobjective Genetic Algorithms","258378530":"A Novel Learning Scheme for Chebyshev Functional Link Neural Networks","221399414":"A Multiobjective Evolutionary Algorithm for Tuning Fuzzy Rule Based Systems with Measures for Preserving Interpretability.","221008232":"Assessment of an evolutionary particle swarm optimizer with inertia weight","224256283":"The proposal of model-based initial frame alignment using real-coded GA for mixed reality","225167660":"Optimization of Budget Allocation for TV Advertising","220635497":"A numerical evaluation of meta-heuristic techniques in portfolio optimisation","260232146":"Empowering difficult classes with a similarity-based aggregation in multi-class classification problems","220301680":"Parameter Mapping: A genetic programming approach to function optimization.","221196670":"PSO Based Memetic Algorithm for Unimodal and Multimodal Function Optimization","228637171":"Multi-objective optimum design of balanced SAW filters using generalized differential evolution","4201494":"The use of a genetic algorithm to optimize the functional form of a multi-dimensional polynomial fit to experimental data","221999457":"Blended biogeography-based optimization for constrained optimization","288093557":"Enhancing difficult classes in one-vs-one classifier fusion strategy using restricted equivalence functions","245459710":"Variable-length segmental transmission line and its design guidelines","2772040":"Fuzzy Connectives Based Crossover Operators to Model Genetic Algorithms Population Diversity","224219454":"Bouvry, P.: Improving Classical and Decentralized Differential Evolution with New Mutation Operator and Population Topologies. IEEE Transactions on Evolutionary Computation 15(1), 67-98","4201510":"Crossover effect over penalty methods in function optimization with constraints","259988245":"Biomedical image segmentation using geometric deformable models and metaheuristics","3972174":"Co-evolution of morphology and walking pattern of biped humanoid robot using evolutionary computation. Consideration of characteristic of the servomotors","235707000":"Robotic swarm cooperation by co-adaptation","220215637":"An improved sales forecasting approach by the integration of genetic fuzzy systems and data clustering: Case study of printed circuit board","220754269":"Evolutionary multi-objective optimization using expected improvement and generalized DEA","225173789":"Translation Initiation Site Recognition by Means of Evolutionary Response Surfaces","277296381":"Abstract Fuzzy Sets and Systems 138 (2003) 381–398 Evolving two-dimensional fuzzy systems","47547989":"Optimización de procesos de adquisición de conocimiento en Biología Computacional","268424062":"Global optimization and antennas synthesis and diagnosis, part one: Concepts, tools, strategies and performances","229040418":"Stability criteria for large-scale time-delay systems: The LMI approach and the Genetic Algorithms","245430820":"Simultaneous Airframe and Propulsion Cycle Optimization for Supersonic Aircraft Design","221417911":"Using Knowledge-Based System with Hierarchical Architecture to Guide the Search of Evolutionary Computation.","221008318":"Multiple solution search based on hybridization of real-coded evolutionary algorithm and Quasi-Newton method","277939204":"multi-parent recombination operators with polynimial and lognormal distribution for real coded genetic algorithm","226165217":"Real-Valued Genetic Algorithms with Disagreements","4201691":"A scatter search based optimizer for the registration of 3D surfaces","222024103":"Real-coded genetic algorithm for system identification and controller tuning","222300640":"Genetic learning as an explanation of stylized facts of foreign exchange markets","224170493":"Diversity Improvement by Non-Geometric Binary Crossover in Evolutionary Multiobjective Optimization","227832114":"Using a hybrid genetic algorithm–simulated annealing algorithm for fuzzy programming of reservoir operation","4201706":"Robust optimum design of SAW filters with the Taguchi method and a memetic algorithm","260606758":"Thakur, M.: A new genetic algorithm for global optimization of multimodal continuous functions. J. Comput. Sci. 5, 298-311","34487999":"Global optimization-based deformable meshes for surface extraction from medical images /","284077148":"Crossover-first differential evolution for improved global optimization in non-uniform search landscapes","221053337":"Label Dependent Evolutionary Feature Weighting for Remote Sensing Data","3421314":"Adaptive-edge search for power plant start-up scheduling","3951749":"Fuzzy filters design on image processing by genetic algorithm approach","12184579":"Symmetry axis computation for almost-Symmetrical and asymmetrical objects: Application to pigmented skin lesions","237468312":"amaras en un sistema de medici´ on bajo una caracterizaci ´ on borrosa del error de medida","221196779":"Parent to Mean-Centric Self-Adaptation in SBX Operator for Real-Parameter Optimization","220742126":"New entropy model for extraction of structural information from XCS population","258028454":"Enhanced Van der Waals calculations in genetic algorithms for protein structure prediction","271002863":"Enhancing ontology alignment through a memetic aggregation of similarity measures","258388909":"Optimization the Initial Weights of Artificial Neural Networks via Genetic Algorithm Applied to Hip Bone Fracture Prediction","224618926":"GA type IMC control for pneumatic servo system","235295435":"A novel usage of neural network in optimization and implementation to the internal flow systems","228356434":"APRENDIZAJE COOPERATIVO DE LA BASE DE REGLAS Y EL SISTEMA DE INFERENCIA MEDIANTE ALGORITMOS GENÉTICOS MULTIOBJETIVO","2503925":"E1.3 Recombination parameters","222333331":"Efficiency speed-up strategies for evolutionary computation: Fundamentals and fast-GAs","221049337":"Analysis of the Performance of a Semantic Interpretability-Based Tuning and Rule Selection of Fuzzy Rule-Based Systems by Means of a Multi-Objective Evolutionary Algorithm","251823061":"Optimization of ANN applied to non-linear system identification based in UWB","225456552":"Optimal Design of Water Distribution System by Multiobjective Evolutionary Methods","224399804":"Design of Japanese Kimono using Interactive Genetic Algorithm","221905382":"Optimum Design of Balanced Surface Acoustic Wave Filters Using Evolutionary Computation","229540209":"A taxonomy for the crossover operator for real-coded genetic algorithms: an experimental study. Int. J. Intell. Syst. 18, 309-338","11957334":"Self-Adaptive Genetic Algorithms with Simulated Binary Crossover","11957335":"A Comparison Study of Self-Adaptation in Evolution Strategies and Real-Coded Genetic Algorithms","228577662":"Hybrid Controller of Neural Network and Linear Regulator for Multi-trailer Systems Optimized by Genetic Algorithms","261036910":"Optimization in multi-modal continuous space with little globally convex using differential evolution on scattered parents","220176889":"Scalability of generalized adaptive differential evolution for large-scale continuous optimization","228733259":"Coello Coello, C.A.: Constraint-handling using an evolutionary multiobjective optimization technique. Civ. Eng. Environ. Syst. 17, 319-346","263791443":"Using particle swarm optimization to evolve cooperation in multiple choices iterated prisoner\u0027s dilemma game","220176880":"Multiobjective genetic fuzzy rule selection of single granularity-based fuzzy classification rules and its interaction with the lateral tuning of membership functions","222677429":"Continuous scatter search: An analysis of the integration of some combination methods and improvement strategies","266545937":"Evolutionary Computation and Heuristics","37605064":"A genetic algorithm for resource-constrained scheduling","2536667":"Path-Planning Via the Evolution of General Regression Neural Networks","220867028":"Prudent-Daring vs Tolerant Survivor Selection Schemes in Control Design of Electric Drives","4074814":"An adaptive neighborhood-based multi-parent crossover operator for real-coded genetic algorithms","220061726":"Optimal Grey-Fuzzy Gain-Scheduler Design Using Taguchi-HGA Method.","220801070":"On the Application of Cohort-Driven Operators to Continuous Optimization Problems Using Evolutionary Computation.","220741679":"Sampling Bias and Search Space Boundary Extension in Real Coded Genetic Algorithms.","282975703":"JMES2010(wylin)","228556948":"Operations Research/Computer Science Interfaces Series","288371773":"Multi-Space competitive DGA for model selection and its application to localization of multiple signal sources","224118869":"Weeding Manipulator Exploiting Its Oscillatory Motion for Force Generation: Parameter Optimization of VDP Oscillator using Real-Coded Genetic Algorithm","221048867":"Promising Search Regions of Crossover Operators for Function Optimization.","238111526":"STABILITY CONDITION OF TS FUZZY SYSTEM VIA ROBUST APPROACH","226549911":"Scatter Search and Star-Paths: Beyond the Genetic Metaphor,” OR Spektrum, 17: 125-137","229036223":"A NEW COLLABORATIVE DESIGN METHOD BASED ON IN-TERACTIVE GENETIC ALGORITHMS","238103339":"P300-based Brain Computer Interface Mouse with Genetically-optimised Analogue Control","220063744":"Hybrid Crossover Operators with Multiple Descendents for Real-Coded Genetic Algorithms: Combining Neighborhood- Based Crossover Operators","46272479":"Comparative study of three commonly used continuous deterministic methods for modeling gene regulation networks","242322258":"NavierStokes Optimization of Supersonic Wings with Four Objectives Using Evolutionary Algorithm","223041647":"Ensembling evidential k-nearest neighbor classifiers through multi-modal perturbation","226879649":"Barcode design by evolutionary computation","226623657":"Agent-Based Simulation of Learning Social Norms in Traffic Signal Systems","4042003":"A General and Robust Method for Multi-criteria Design of Microwave Oscillators Using an Evolutionary Strategy","23477334":"Doya, K.: Finding intrinsic rewards by embodied evolution and constrained reinforcement learning. Neural Netw. 21(10), 1447-1455","220739611":"The Virtual Gene Genetic Algorithm","220739613":"Use of domain information to improve the performance of an evolutionary algorithm.","220741662":"Real-Parameter Genetic Algorithms for Finding Multiple Optimal Solutions in Multi-modal Optimization","221007892":"Automatic generation method to derive for the design variable spaces for interactive Genetic Algorithms.","269567277":"Optimization of Active/Passive Flow Control Parameters on Airfoils at Transonic Speeds","220856343":"Automatic Segmentation of Cardiac MRI Using Snakes and Genetic Algorithms","4375935":"Transformation-Based Hierarchical Decision Rules using Genetic Algorithms and its Application to Handwriting Recognition Domain","220559387":"Robust control for uncertain neutral systems with time-delays in state and control input via LMI and GAs","251374522":"Particle swarm optimization with genetic recombination: a hybrid evolutionary algorithm","224895014":"Problem Decomposition and Adaptation in Cooperative Neuro-evolution","228557018":"On the sampling property of real-parameter crossover","3663216":"Hybrid evolutionary programming with fast convergence for constrained optimization problems","222494724":"Evolutionary Algorithms for Constrained Engineering Problems","221165670":"Classification by means of Evolutionary Response Surfaces.","258167338":"Artificial bee colonies for continuous optimization: Experimental analysis and improvements","220661867":"Optimisation With Real-Coded Genetic Algorithms Based On Mathematical Morphology","220463209":"Constrained Optimization by α Constrained Genetic Algorithm (αGA)","232628371":"A Performance Analysis of Mono and Multi-objective Evolutionary Algorithms Assisted by Meta-modeling","51877465":"Theoretical and Evolutionary Parameter Tuning of Neural Oscillators with a Double-Chain Structure for Generating Rhythmic Signals","220801126":"Applying Family Competition to Evolution Strategies for Constrained Optimization.","238189410":"Transonic Axial-Flow Blade Optimization: Evolutionary Algorithms/Three-Dimensional Navier-Stokes Solver","243776468":"Multi-parent recombination with simplex crossover in real-coded genetic algorithms","220514416":"A practical tutorial on the use of nonprametric statistical tests as a methodology for comparing evolutionary and swarm intelligence algorithm","220838013":"Improving the Evolutionary Coding for Machine Learning Tasks.","265077400":"ROBUST AERODYNAMIC AIRFOIL DESIGN OPTIMIZATION AGAINST WIND VARIATIONS FOR MARS EXPLORATORY AIRPLANE","3741037":"Genetic optimisation of interval mathematics-based sensitivity analysis of switching converters","220741756":"Global multiobjective optimization via estimation of distribution algorithm with biased initialization and crossover","220375156":"Schoenauer, M.: Evolutionary Algorithms for Constrained Parameter Optimization Problems. Evolutionary Computation 4(1), 1-32","4046180":"Co-evolution of morphology and walking pattern of biped humanoid robot using evolutionary computation - evolutionary designing method and its evaluation","220739697":"Distributed Probabilistic Model-Building Genetic Algorithm","238175087":"On the use of genetic algorithm for finding the neutral instability curve in plane Poiseuille flow","228438211":"Evaluation of various evolutionary methods for medical image registration","220801099":"Inductive Learning of Mutation Step-Size in Evolutionary Parameter Optimization.","269051244":"Flow Field Data Mining of Pareto-Optimal Airfoils Using Proper Orthogonal Decomposition","237128516":"An interactive genetic algorithm with co-evolution of weights for multiobjective problems","228661446":"Minimising the delta test for variable selection in regression problems","51936881":"CIXL2: A Crossover Operator for Evolutionary Algorithms Based on\nPopulation Features","228853965":"Application of genetic algorithms to lubrication pump stacking design","221020225":"Building a Better Air Defence System Using Genetic Algorithms.","4013395":"Genetic learning as an explanation of stylized facts of foreign exchange markets","261124863":"Strategy evolution in a spatial IPD game where each agent is not allowed to play against itself","224894999":"Forward kinematics of the 6-6 general parallel manipulator using Real Coded Genetic Algorithms","260715259":"Uncertainty analysis of water supply networks using the fuzzy set theory and NSGA-II","229589202":"Applying a real‐coded multi‐population genetic algorithm to multi‐reservoir operation","227281138":"Multi-objective Model Predictive Control Using Computational Intelligence","224217123":"Adaptive Adjustment of Weight Parameters for Diploid Genetic Algorithm with a Network Structure","5465555":"Finding Alternatives and Reduced Formulations for Process-Based Models","2788777":"Genetic Algorithm in Search and Optimization: The Technique and Applications","222832844":"Evolutionary system for automatically constructing and adapting radial basis function networks","242502641":"Modeling Decisions for Artificial Intelligence, Third International Conference, MDAI 2006, Tarragona, Spain, April 3-5, 2006, Proceedings","268434040":"Edición de Conjuntos de Entrenamiento no Balanceados, haciendo uso de Operadores Genéticos y la Teoría de los Conjuntos Aproximados","237417389":"Dominance Based Crossover Operator for Evolutionary Multi-objective Algorithms DRAFT VERSION","255175333":"GA-optimized feedforward-PID tracking control for a rugged electrohydraulic system design","282651973":"Comparação de Algoritmos Evolutivos para o Problema de Ajuste de Histórico utilizando o modelo IMPES","45229868":"Estratégia paralela para alinhamento múltiplo de sequências com algoritmo genético multi-ilha","241079294":"Flatness error evaluation and verification based on new generation geometrical product specification (GPS)","224028920":"Evolutionary Regression Prediction for Software Cumulative Failure Modeling: a comparative study","2452864":"Theoretical Investigation on the Generalized Crossover Operator","259224278":"New State-of-the-art Results for Cassini2 Global Trajectory Optimization Problem","264387172":"Cooperative Coevolution for Large-Scale Optimization Based on Kernel Fuzzy Clustering and Variable Trust Region Methods","3708310":"Using information measures for determining the relevance of the predictive variables in learning problems","228677649":"Applications of information theory, genetic algorithms, and neural models to predict oil flow","228411436":"Multi-Objective Six Sigma Approach Applied to Robust Airfoil Design for Mars Airplane","225351903":"Vibration control of load for rotary crane system using neural network with GA-based training","224653526":"Neural Network Online Decoupling for a Class of Nonlinear System","221161627":"An efficient real-coded genetic algorithm for real-parameter optimization","220176548":"Robust confidence intervals applied to crossover operator for real-coded genetic algorithms","234898364":"Tabu Search - in Handbook of Combinatorial Optimization V3","227336241":"Evolutionary Design of a Brain-Computer Interface","220020899":"Towards Cost-Effective Bio-inspired Optimization: A Prospective Study on the GPU Architecture","2473370":"An Evolutionary Algorithm With A Multilevel Pairing Strategy For Single And Multiobjective Optimization","3642866":"A combined evolutionary algorithm for real parameters optimization","257432211":"How landscape ruggedness influences the performance of real-coded algorithms: A comparative study","263891569":"Charge Scheduling of an Energy Storage System under Time-of-Use Pricing and a Demand Charge","265554457":"An Improved Genetic Algorithm with a Local Optimization Strategy and an Extra Mutation Level for Solving Traveling Salesman Problem","223754369":"A real multi-parent tri-hybrid evolutionary optimization method and its application in wind velocity estimation from wind profiler data","4375962":"Density Estimation using Crossover Kernels and its Application to a Real-coded Genetic Algorithm","7060913":"OR/AND neurons and the development of interpretable logic models","236985338":"Wavelet feature extraction and genetic algorithm for biomarker detection in colorectal cancer data","265052695":"A multi-objective evolutionary method for learning granularities based on fuzzy discretization to improve the accuracy-complexity trade-off of fuzzy rule-based classification systems: D-MOFARC algorithm","220797173":"Evolutionary Behavior Selection with Activation/Termination Constraints.","46589723":"Modelado lingüístico flexible mediante el uso de la representación de 2-tuplas lingüísticas","3415530":"A family competition evolutionary algorithm for automated docking of flexible ligands to proteins","225390769":"Fuzzy Rule Reduction and Tuning of Fuzzy Logic Controllers for a HVAC System","241191871":"Effects of configuration of agents with different strategy representations on the evolution of cooperative behavior in a spatial IPD game","220739784":"Real-coded crossover as a role of kernel density estimation","220176637":"Modeling dynamics of a real-coded CHC algorithm in terms of dynamical probability distributions","224344252":"Signal Optimization Problem with Pedestrians Non-complying at A Single Intersection","40906643":"Memetic Algorithms for Continuous Optimisation Based on Local Search Chains","220741851":"Application domain study of evolutionary algorithms in optimization problems","267041305":"High performance architecture for NSGA-II","220199146":"Evolutionary operators for optimal gate location in liquid composite moulding","221008091":"Modified SBX and adaptive mutation for real world single objective optimization","226214018":"Combinatorial Evolutionary Methods in Wireless Mobile Computing","251560708":"A clash of cultures (and lawyers): Anglo Platinum and mine-affected communities in Limpopo Province, South Africa","271635919":"A new model for optimal generation scheduling of power system considering generation units availability","278623896":"Social Learning about Consumption","227038080":"A Survey of Optimization by Building and Using Probabilistic Models","258390383":"Sufficient Conditions for Global Convergence of Differential Evolution Algorithm","224598897":"Self-adaptive mutation for enhancing evolutionary search in real-coded genetic algorithms","224516979":"Power system stability enhancement by designing PSS and SVC parameters coordinately using RCGA","4329044":"A hybrid method of optimal data mining and artificial neural network for voltage stability assessment","225362809":"Combination of Genetic Algorithms and Evolution Strategies with Self-adaptive Switching","2473534":"Genetic Algorithms, Numerical Optimization, and Constraints","274382401":"AN XML-BASED GENETIC ALGORITHM TOOL – SYSTEM FEATURES AND MODELING","224674680":"Novel Adaptive Heuristic For Search And Optimisation","289271587":"IEC-Based 3D model retrieval system","269047336":"Improvement of Flow Control Performance of Plasma Actuator Using Wind-Tunnel Test Based Efficient Global Optimization","245426307":"Fast Evolutionary Algorithm for Airfoil Design via Neural Network","228967302":"Structural Damage Assessment under Varying Temperature Conditions","227175343":"Solution of the Inverse Problem of Creating a Uniform Magnetic Field in Coercimeters with Partially Closed Magnetic Systems","221186821":"Multiobjective Optimal Design of Symmetrical Langevin Transducers","222909287":"Multiobjective optimization of synthesis gas production using non-dominated sorting genetic algorithm","41481303":"Evolutionary techniques applied to mask-layout synthesis in micro-mechanical-electronic systems (MEMS)","232633325":"Comparison of Artificial Intelligence Based Techniques for Short Term Load Forecasting","261167520":"Evolutionary power-aware routing in VANETs using Monte-Carlo simulation","221186845":"Grey Synthetical Prediction Model of Military Logistics Based on Evolutionary Neural Network","3323398":"Genetic optimization of interval arithmetic-based worst case circuit tolerance analysis","266013167":"Handbook of Metaheuristics","4075018":"Constrained optimization based on a multiobjective evolutionary algorithm","251894071":"Multi-objective evolution of the Pareto optimal set of neural network classifier ensembles","3202568":"Electromagnetic inverse scattering of two-dimensional perfectly conducting objects by real-coded genetic algorithm","256721268":"An adaptive parameter binary-real coded genetic algorithm for constraint optimization problems: Performance analysis and estimation of optimal control parameters","221547274":"A Comparative Study of Different Variants of Genetic Algorithms for Constrained Optimization","222368638":"A genetic method of LAD estimation for models with censored data","220742423":"Distributed Steady-State Neuro-Evolutionary Path Planning in Non-Stationary Environments Using Adaptive Replacement.","220701543":"Dominance Based Crossover Operator for Evolutionary Multi-objective Algorithms.","220316523":"Discovering hierarchical decision rules with evolutive algorithms in supervised learning.","256790787":"Comparison of the reactivities of (Me3Si)3CSiMe2I and (PriMe2Si) 3CSiMe2I","275246634":"Fast GA-based project scheduling for computing resources allocation in a cloud manufacturing system","225491775":"Analyzing the statistical features of CIXL2 crossover offspring","3927658":"An adaptive neighboring search using crossover-like mutation for multi modal function optimization","220754809":"Variation operator performance for evolved image reconstruction transforms","224645936":"Formal Descriptions of Real Parameter Optimisation","228953073":"Multiobjective optimization of a multi-stage compressor using evolutionary algorithm","222759698":"Optimal reactive power dispatch using self-adaptive real coded genetic algorithm","271390325":"Multi-Objective Differential Evolution for Voltage Security Constrained Optimal Power Flow in Deregulated Power Systems","224645946":"Multi-Objective Optimum Design of DMS Filters Using Robust Engineering and Genetic Algorithm","224645945":"Evolving High-Performance Evolutionary Computations for Space Vehicle Design","228836291":"A Distributed Evolutionary Approach to Subtraction Radiography","3870299":"A survey of optimization by building and using probabilistic models","286412658":"Automatic design of an effective image filter based on an evolutionary algorithm for venous analysis","220701510":"Offspring Generation Method Using Delaunay Triangulation for Real-Coded Genetic Algorithms.","224301887":"Structural learning of neural networks by differential evolution with degeneration using mappings","279998161":"Linguistic Description of Complex Phenomena","220701512":"Crossover Operator Effect in Function Optimization with Constraints.","262152656":"Adaptive Operator Selection at the Hyper-level","49798278":"Representations and Evolutionary Operators for the Scheduling of Pump Operations in Water Distribution Networks","239570995":"Operational Optimisation of Water Distribution Networks","224324394":"An Improved Float-Coded Genetic Algorithm Based on Wavelet Denoising Mutation","277294834":"Genetic Algorithms Applications to Fuzzy Logic Based Systems","2813522":"Fuzzy Tools to Improve Genetic Algorithms","225667851":"Evolutionary robot controllers with competitive and cooperative neural networks","233368466":"Characterization of Reservoir Heterogeneity Using Inverse Model Equipped with Parallel Genetic Algorithm","3413576":"Theoretical Proof of Edge Search Strategy Applied to Power Plant Start-up Scheduling","3329615":"Robust mask-layout and process synthesis","224617245":"BMI optimization based on unimodal normal distribution crossover GA with relaxed LMI convex estimation","228961061":"Numerical optimisation using genetic algorithms","223224779":"A GA-DE hybrid evolutionary algorithm for path synbook of four-bar linkage. Mech Mach Theory","260313345":"Risk design optimization using many-objective evolutionary algorithm with application to performance-based wind engineering of tall buildings","220312489":"A theoretical and empirical study on unbiased boundary-extended crossover for real-valued representation","238774451":"Animated QR Code Generation Using Optimization Algorithms","271484583":"Embed a linear irregular fresnel lens into a simple empty chamber to let a medium or large LED-sourced Edge Lighting Backlight Module be thin, lightweight, low-cost, and possess high effect of guiding light rays","253288850":"An Analysis of Exit-Flow Drainage Jets over the Chesapeake Bay","3323582":"True worst-case circuit tolerance analysis using genetic algorithms and affine arithmetic","221139874":"Finding Exploratory Rewards by Embodied Evolution and Constrained Reinforcement Learning in the Cyber Rodents","276414199":"The runner-root algorithm: A metaheuristic for solving unimodal and multimodal optimization problems inspired by runners and roots of plants in nature","239960258":"Discussion on a Crossover Method using Probabilistic Model for interactive Genetic Algorithm","220474292":"Detection of doors using a genetic visual fuzzy system for mobile robots","3970733":"Evolutionary computation in designing a robust PD sway controller for a mobile crane","220881848":"Solving nonlinear optimization problems by Differential Evolution with a rotation-invariant crossover operation using Gram-Schmidt process.","220701619":"Heuristic Crossovers for Real-Coded Genetic Algorithms Based on Fuzzy Connectives.","222016418":"An advanced evolutionary algorithm for parameter estimation of the discrete Kalman filter","235407507":"OpenCL Implementations of a Genetic Algorithm for Feature Selection in Periocular Biometric Recognition","222661594":"Logic-driven fuzzy modeling with fuzzy multiplexers","262527237":"A hybrid harmony search with arithmetic crossover operation for economic dispatch","221582224":"RCGA-S/RCGA-SP Methods to Minimize the Delta Test for Regression Tasks.","220881794":"Experiment study of a Structured Differential Evolution with mixed strategies.","228688651":"MEJORAS EN EL DISEÑO MULTIOBJETIVO DE REDES DE FUNCIONES DE BASE RADIAL","221342619":"Initial Solution Set Improvement for a Genetic Algorithm in a Metadata Generation Support System for Landscape Photographs","222126994":"Genetic algorithm approach for designing higher-order digital differentiators","4267761":"Research on threshold denoising of FPRGA","257518058":"Evolutionary response surfaces for classification: an interpretable model. Appl Intell","223486951":"A new crossover operator for real coded genetic algorithms. Appl Math Comput","282801772":"Developing an Evolutionary Algorithm to Search for an Optimal Multi-Mother Wavelet Packets Combination","220242844":"Building-Block Supply in Real-Coded Genetic Algorithms: A First Step on the Population-Sizing Model.","222667652":"An hybrid real genetic algorithm to detect structural damage using modal properties. Mech Syst Signal Process","225135528":"Vibrational Genetic Algorithm (VGA) for Solving Continuous Covering Location Problems","238745855":"Free Search Towards Multidimensional Optimisation Problems","222585729":"Analysis and comparison of aircraft landing control using recurrent neural networks and genetic algorithms approaches","4062971":"An improved genetic algorithm for sphericity error evaluation","220292070":"Investigation of self-organizing map for genetic algorithm","220529645":"Evolving two-dimensional fuzzy systems","228356946":"An IDEA for Design","220742648":"Breeding swarms: A new approach to recurrent neural network training","238741739":"VISUALISATION OF ADVANCED SEARCH","220867577":"Evolutionary Brain Computer Interfaces.","224744369":"Co-evolution of morphology and walking pattern of biped humanoid robot using evolutionary computation - Designing the real robot","282269189":"An empirical comparison of two crossover operators in real-coded genetic algorithms for constrained numerical optimization problems","224232327":"A Fuzzy Association Rule-Based Classification Model for High-Dimensional Problems With Genetic Rule Selection and Lateral Tuning","223624079":"Hybridization of intelligent techniques and ARIMA models for time series prediction","262320509":"Analysing mutation schemes for real-parameter genetic algorithms","216300037":"A Socio--Behavioural Simulation Model For Engineering Design Optimization","261523827":"Mental non-motor imagery tasks classifications of brain computer interface for wheelchair commands using genetic algorithm-based neural network","3335892":"Fuzzy neural networks-based quality prediction system for sintering process","3413724":"Evolutionary Parallel Local Search for Function Optimization","228414327":"Concurrent implementation of differential evolution","281685542":"A Real Coded Genetic Algorithm for a Class of Continuous Space Location-Allocation Problems","3751625":"A genetic algorithm for learning profiles in broadcasting applications on the Internet","261052799":"An Expandable Genetic Cell Array for Global Optimization of Continuous Multimodal Functions","254960071":"FISSION: An Evolutionary Method for Fuzzy Learning","220740560":"Effects of the Use of Non-Geometric Binary Crossover on Evolutionary Multiobjective Optimization","221008854":"Development and Investigation of Efficient GA/PSO-Hybrid Algorithm Applicable to Real-World Design Optimization","2582311":"Using Region-Schema to Solve Nonlinear Constraint Optimization Problems: a Cultural Algorithm Approach","221008417":"Investigating the impact of alternative evolutionary selection strategies on multi-method global optimization","265879767":"Genetic Algorithms in Chemical Engineering: A Tutorial","2664250":"Applying Genetic Algorithms in Fuzzy Optimization Problems","226380394":"Detecting Promising Areas by Evolutionary Clustering Search","223859264":"Optimal parameter design of input filters for general purpose inverter based on genetic algorithm","232647370":"Research on Genetic Algorithm of Floating Point Representation Denoising Mutation Based on DTCWT","222552666":"An experimental study on the applicability of evolutionary algorithms to craniofacial superimposition in forensic identification","4274011":"Craniofacial Superimposition in Forensic Identification using Genetic Algorithms","220885558":"Fuzzy Recombination for the Breeder Genetic Algorithm.","284078066":"Differential Evolution with Grid-Based Parameter Adaptation","263268524":"Active flow control of airfoil using mesh/meshless methods coupled to hierarchical genetic algorithms for drag reduction design","225507950":"An Introduction to Genetic Algorithms","2627383":"Self-Adaptation in Real-Parameter Genetic Algorithms with Simulated Binary Crossover","223664715":"Design of two-dimensional FIR digital filters for sampling structure conversion by genetic algorithm approach","222421601":"A lexicographically fair allocation of discrete bandwidth for multirate multicast traffics","245531009":"Asynchronous migration of island parallel GA for multi-objective optimization problems","224148095":"A Dual-Population Genetic Algorithm for Adaptive Diversity Control","276078429":"Automatic Evolutionary Medical Image Segmentation using Deformable Models","224645705":"Enhancement of the Variable-Length-Transmission-Line design method for multi-point optimization","221399577":"Rule Base and Inference System Cooperative Learning of Mamdani Fuzzy Systems with Multiobjective Genetic Algorithms.","228774543":"Damage Assessment of a Bridge under Varying Environmental Conditions","220887559":"Lecture Notes in Computer Science","3776279":"Neural networks training using genetic algorithms","43550126":"Análisis y diseño de algoritmos genéticos paralelos distribuidos","220942866":"Multiple Crossover per Couple with Selection of the Two Best Offspring: An Experimental Study with the BLX-alpha Crossover Operator for Real-Coded Genetic Algorithms.","227599017":"A crossover operator that uses Pareto optimality in its definition","2690834":"Niching Methods for Genetic Algorithms","238680327":"Conceptualizing Meme on ALife and its Analysis","222630401":"Vulnerability analysis of immunity-based intrusion detection systems using genetic and evolutionary hackers","229092065":"Genetic algorithm based reactive power dispatch for voltage stability improvement","221497973":"A CHC Evolutionary Algorithm for 3D Image Registration","201976668":"Object-based Design Modeling and Optimization with Genetic Algorithms","235719002":"Shopova\u0026Vaklieva BASIC","220797555":"Co-evolution of Morphology and Controller for Biped Humanoid Robot","220742263":"Self-adaptive simulated binary crossover for real-parameter optimization","255631454":"Operadores de Cruce con Múltiples Descendientes para Algoritmos Genéticos con Codificación Real: Estudio Experimental","228934339":"A Quick Presentation of Evolutionary Computation","266750094":"Multi-objective unit commitment with introduction of a methodology for probabilistic assessment of generating capacities availability","225585691":"Replacement Strategies to Maintain Useful Diversity in Steady-State Genetic Algorithms","226155031":"Self-adaptive differential evolution algorithm using population size reduction and three strategies","221002330":"Mining Interesting Regions using an Evolutionary Algorithm","8357640":"Real-Coded Memetic Algorithms with Crossover Hill-Climbing","273166143":"Adaptive pair bonds in genetic algorithm: An application to real-parameter optimization","220742224":"A GA for maximum likelihood phylogenetic inference using neighbour-joining as a genotype to phenotype mapping","225597966":"A scatter search-based technique for pair-wise 3D range image registration in forensic anthropology","249944474":"Nature Inspired Heuristics in Aerial Spray Deposition Management","229032480":"Multiobjective aerodynamic optimization of supersonic wings using navier-stokes equations","277286656":"A COMPARISON OF NATURE INSPIRED INTELLIGENT OPTIMIZATION METHODS IN AERIAL SPRAY DEPOSITION MANAGEMENT Electronic Version Approved:","221498036":"Analyzinig the Performance of a Multiobjective GA-P Algorithm for Learning Fuzzy Queries in a Machine Learning Environment.","8161264":"Heterogeneous Fuzzy Logic Networks: Fundamentals and Development Studies","237427113":"List of References on Constraint-Handling Techniques used with Evolutionary Algorithms","3755945":"Theoretical Analysis of the Unimodal Normal Distribution Crossover for Real-coded Genetic Algorithms","46589271":"Modelos de recuperación de la información basados en información lingüística difusa y algoritmos evolutivos. Mejorando la representación de las necesidades de información","2240435":"On the Analysis of Self-Adaptive Evolutionary Algorithms","268883863":"Path optimization and control of a shape memory alloy actuated catheter for endocardial radiofrequency ablation","222419668":"CLIP4: Hybrid inductive machine learning algorithm that generates inequality rules","251910294":"Fitness-Based Recombination Operator Applying to the Real-Coded Genetic Algorithms","274730999":"Evolutionary algorithm enhancement for model predictive control and real-time decision support","224645883":"A Two-Population Evolutionary Algorithm for Constrained Optimization Problems","224670457":"Applying permutation modulation to spread-spectrum systems","224094916":"Multi-objective Chaotic Optimization Algorithm by Combining Gray and Real Codes","225569489":"Crossover Operator Effect in Function Optimization with Constraints","228770304":"Evolutionary Algorithms","220170938":"Fan-shape optimisation using CFD and genetic algorithms for increasing the efficiency of electric motors","220256902":"Model selection via Genetic Algorithms for RBF networks","221504149":"Hierarchical planning method for product supply based on multi objective Genetic Algorithm","220740230":"Adaptation of expansion rate for real-coded crossovers","256598264":"A multi-population genetic algorithm approach for PID controller auto-tuning","221053595":"Craniofacial Superimposition Based on Genetic Algorithms and Fuzzy Location of Cephalometric Landmarks","242541002":"FREE SEARCH IN TRACKING TIME DEPENDENT OPTIMA","2723734":"A Testbed for Solving Optimization Problems Using Cultural Algorithms","222251767":"Automatic lateral control for unmanned vehicles via genetic algorithms","249581867":"Optimal design of composite turbine blade using genetic algorithms","222646926":"An Evolutionary Approach to Estimating Software Development Projects","220218093":"Applying multiobjective RBFNNs optimization and feature selection to a mineral reduction problem","223761031":"FuelGen: A genetic algorithm-based system for fuel loading pattern design in nuclear power reactors","236177858":"JavaEvA A Java based framework for Evolutionary Algorithms","3756011":"A study on the effect of multi-parent recombination in real coded genetic algorithms","269033437":"Automatic Design of a Novel Image Filter Based on the GA-EM Algorithm for Vein Shapes","220437238":"OS-CFAR and CMLD threshold optimization in distributed systems using evolutionary strategies","252016848":"Evolutionary Multi-Objective Algorithm to effectively improve the performance of the classic tuning of fuzzy logic controllers for a heating, ventilating and Air Conditioning system","228702839":"Evolutionary algorithm vs. adjoint method applied to sst shape optimization","221086453":"A genetic fuzzy expert system for stock price forecasting","226445989":"Tackling Real-Coded Genetic Algorithms: Operators and Tools for Behavioural Analysis","283029252":"Inversion of reservoir porosity, saturation, and permeability based on a robust hybrid genetic algorithm","2787313":"Optimizing Engineering Designs Using a Combined Genetic Search","260972629":"Frequency band-wise passive control of linear time invariant structural systems with H∞ optimization","224301697":"Hybrid optimization using DIRECT, GA, and SQP for global exploration","235733485":"A tree-structured covalent-bond-driven molecular memetic algorithm for optimization of ring-deficient molecules","220867273":"Memetic Variation Local Search vs. Life-Time Learning in Electrical Impedance Tomography","4202407":"Real-coded genetic algorithm with average-bound crossover and wavelet mutation for network parameters learning","228362875":"A multi-objective genetic algorithm for tuning and rule selection to obtain accurate and compact linguistic rule-based system","225176193":"VXQR: Derivative-free unconstrained optimization based on QR factorizations","228633164":"An improved multi-objective genetic algorithm for tuning linguistic fuzzy systems","261492838":"Fourier analysis of the fitness landscape for evolutionary search acceleration","3755976":"Multiobjective evolutionary path planning via fuzzy tournament selection","222544562":"BASIC—A genetic algorithm for engineering problems solution","228346477":"Tabu Search","270583762":"Software Defect Prediction using a High Performance Neural Network","265809956":"Computational intelligence. Revised and selected papers of the 3rd international joint conference, IJCCI 2011, Paris, France, October 24–26, 2011","221008598":"Alternative hyper-heuristic strategies for multi-method global optimization","2531289":"The Theory And Applications Of Discrete Constrained Optimization Using Lagrange Multipliers"},"index":577}