{"abs":"http://deepblue.lib.umich.edu/bitstream/2027.42/3572/5/bab2694.0001.001.pdf http://deepblue.lib.umich.edu/bitstream/2027.42/3572/4/bab2694.0001.001.txt","title":"Genetic algorithms as function optimizers","id":30821765,"url":"https://www.researchgate.net/publication/30821765_Genetic_algorithms_as_function_optimizers","names":["A. D. (Albert Donally) Bethke"],"references":{"201976029":"The Performance of Genetic Algorithms on Walsh Polynomials: Some Anomalous Results and Their Explanation","242356870":"Adaptation In Natural And Artificial Systems","2526190":"Fundamental Principles of Deception in Genetic Search","220045412":"Adoption in Natural and Artificial System","35578608":"An Analysis of the Behavior of a Class of Genetic Adaptive Systems","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"224377183":"A SAT approach for solving the nurse scheduling problem","3810363":"Shuffle crossover and mutual information","220406049":"Between classical and ideal: Enhancing wildland fire prediction using cluster computing","245306006":"Road-Maintenance Planning Using Genetic Algorithms. I: Formulation","2610222":"Comparing Genetic Operators with Gaussian Mutations in Simulated Evolutionary Processes Using Linear Systems","220844832":"A Genetic Approach to Training Support Vector Data Descriptors for Background Modeling in Video Data","2335279":"Combinatorial Landscapes","3114528":"A Markov Chain Analysis on Simple Genetic Algorithms","225505633":"Fitness landscapes","201976351":"An Analysis of a Reordering Operator on a GA-Hard Problem","2579006":"Estimating the Significant Non-Linearities in the Genome Problem-Coding","239752785":"Decision Diagram Representations for Fitness and Average Fitness Functions in Analysis of Genetic Algorithms","221157171":"Fuzzy Relation-Based PNNs with the Aid of IG and Symbolic Gene Type-Based GAs","223298896":"Genetic algorithms and Tabu Search: hybrids for optimization. Computers é4 Operations Research, 22: 111-134","3094027":"Fuzzy Relation-Based Neural Networks and Their Hybrid Identification","2581505":"Fitness Variance of Formae and Performance Prediction","2778124":"Evolving Networks: Using the Genetic Algorithm with Connectionist Learning","24058178":"Breeding Hybrid Strategies: Optimal Behaviour for Oligopolists.","13098218":"Predicting Epistasis from Mathematical Models","243776169":"GLOBAL OPTIMIZATION STUDIES ON THE ID PHASE PROBLEM","221442332":"Moving Target Prediction Using Evolutionary Algorithms","220995843":"Adapting binary fitness functions in Genetic Algorithms","4089868":"Analysis of encoding in 1+1-EA","3703307":"Whole-word phonetic distances and the PGPfone alphabet","226505653":"Evaluation of the genetic algorithm parameters on the optimization performance: A case study on pump-and-treat remediation design","241178197":"A Growing Evolutionary Algorithm for Data Mining","232655849":"Broadband maximum likelihood wave parameter estimation using polarization sensitive arrays","228827540":"Satisficing, Optimization, and Adaptive Systems","14166753":"An alternative explanation for the manner in which genetic algorithms operate","265756142":"Subiyanto, Algoritma Genetik dan Wavelet Packet","1915940":"An Indirect Genetic Algorithm for Set Covering Problems","242460233":"Design andanalysisof radiometric instrumentsusing high-levelnumerical modelsand geneticalgorithms","228341671":"Genetic symbiosis algorithm generating test data for constraint automata","220142935":"Evolutionary robotics: The Sussex approach","2615407":"A Pareto Frontier for Full Stern Submarines via Genetic Algorithm","2446958":"Reconstructing Incomplete Signals Using Nonlinear Interpolation and Genetic Algorithms","29606798":"On the huge benefit of quasi-random mutations for multimodal optimization with application to grid-based tuning of neurocontrollers","222673675":"Adaptive Multiresolution Search: How to Beat Brute Force?","243735752":"8 The Evolution of Size and Shape","3643000":"Comparison of steady state and generational genetic algorithms for use in nonstationary environments","220974459":"On Stopping Criteria for Genetic Algorithms","224751924":"Adaptive probabilities of crossover and mutation in genetic algorithms based on clustering technique","228565453":"Adaptive Approaches Towards Better GA Performance in Dynamic Fitness Landscapes.","238665325":"A Framework for modelling stochastic optimisation algorithms with Markov chains","2371187":"Genetic Optimization Using Derivatives","4218909":"An Investigation into Statistical Properties of Partitioning and Floorplanning Problems","2381946":"The Algebra of Genetic Algorithms","226717661":"Robust Optimizers for Nonlinear Programming in Approximate Dynamic Programming","257144588":"How to analyse evolutionary algorithms","3810395":"Enhancing transposition performance","225213199":"Computer-aided pipeline operation using genetic algorithms and rule learning. PART I: Genetic algorithms in pipeline optimization","5583923":"An Introduction to Simulated Evolutionary Optimization","243364073":"Natural algorithms for choosing source locations in active control systems","270396533":"An improved genetic algorithm for pipe network optimisation","2832451":"Adaptive simulated annealing (ASA): lessons learned. J Control Cybern","26413561":"Sheta, A.: Estimation of the COCOMO model parameters using genetic algorithms for NASA software projects. J. Comput. Sci. 2(2), 118-123","221007175":"Examining the use of a non-trivial fixed genotype-phenotype mapping in genetic algorithms to induce phenotypic variability over deceptive uncertain landscapes","220816197":"Applying Adaptive Algorithms to Epistatic Domains.","3642971":"A new evolutionary model based on family eugenics: the first results","3284063":"Scrapping Small Lots in a Low-Yield and High-Price Scenario","242382879":"Applying the XCS Learning Classifler System to Continuous-Valued Data-mining Problems Technical Report UWELCSG05-001","5583931":"Convergence analysis of canonical genetic algorithm. IEEE Trans Neural Netw","221582661":"Diversity and Multimodal Search with a Hybrid Two-Population GA: An Application to ANN Development.","1782889":"Isolated-Word Confusion Metrics and the PGPfone Alphabet","220742992":"Monotonic solution concepts in coevolution","251349635":"Experimental and numerical analysis of wood thermodegradation Mass loss kinetics","220642655":"Construction of High-Order Deceptive Functions Using Low-Order Walsh Coefficients.","245558494":"Scheduling of Pavement Maintenance To Minimize Traffic Delays","3623607":"A non-linearity measure of a problem\u0027s crossover suitability","237778089":"The most powerful compu","224302043":"The effect of selection on the development of mutational robustness","2706094":"Computing with Haar Functions","2428589":"Genetic Algorithm Difficulty and the Modality of Fitness Landscapes","3002534":"Adaptive Image Segmentation Using Genetic and Hybrid Search Methods","220857254":"Genetic Evolution Approach for Target Movement Prediction","222560207":"Evolutionary Computing","221645755":"Nonlinear programming in approximate dynamic programming - bang-bang solutions, stock-management and unsmooth penalties.","226282481":"Basic aspects of evolution strategies","238783156":"UNCONSTRAINED SHIPS OF MINIMUM TOTAL DRAG","222723543":"Multi-FNN identification based on HCM clustering and evolutionary fuzzy granulation","261109505":"Using GA for the stratified sampling of electricity consumers","220285878":"Detecting the epistatic structure of generalized embedded landscape","225941486":"Genetic Algorithms and Neural Networks: A Comparison Based on the Repeated Prisoners Dilemma","3413167":"A further result on the Markov chain model of genetic algorithms and its application to a simulated annealing-like strategy","225648080":"A Model-Assisted Memetic Algorithm for Expensive Optimization Problems","2574465":"Learning to Translate: A Psycholinguistic Approach to the Induction of Grammars and Transfer Functions","221029258":"Can the Genetic Algorithm Be a Good Tool for Software Engineering Searching Problems?","3336341":"Genetically optimized fuzzy polynomial neural networks","3114631":"Grefenstette, J.J.: Optimization of control parameters for genetic algorithms. IEEE Trans. Syst. Man Cybern. 16(1), 122-128","24057799":"“Two Measures of Difficulty,”","3693712":"Wavelet packets and genetic algorithms","3978388":"Parallel and distributed evolutionary computations for multimodal function optimization","2263691":"What Makes a Problem Hard for a Genetic Algorithm? Some Anomalous Results and Their Explanation","226934059":"Why Is Optimization Difficult?","3623576":"Co-evolution of the fitness function and design solution for design exploration","220947844":"An Introduction to Evolutionary Algorithms and Their Applications","220371858":"Genetic algorithm representations for laminate layups.","221107604":"Generalized Discrete Hartley Transforms","224209310":"Metric properties of populations in artificial immune systems using Hadamard representation","2749165":"Adaptation on the Evolutionary Time Scale: A Working Hypothesis and Basic Experiments","251423801":"An Improved Genetic Algorithm for Pipe Network Optimization","2359532":"Building Block Superiority, Multimodality and Synchronization Problems","222824832":"Computing the moments of -bounded pseudo-Boolean functions over Hamming spheres of arbitrary radius in polynomial time","3857139":"Agent societies without dilemmas: an evolutionary approach","226376117":"Learning with genetic algorithms: An overview. Mach Learn 3:121-138","262258034":"Optimization metaheuristics for minimizing variance in a real-world statistical application","226342312":"Discrete space location-allocation solutions from genetic algorithms","257588610":"Derivative-free optimization: A review of algorithms and comparison of software implementations","3610863":"GAFPGA: Genetic algorithm for FPGA technology mapping","225777068":"Genetic algorithm and simultaneous parameter estimation of the nested logit model","220742134":"Computing the variance of large-scale traveling salesman problems","225855401":"A genetic algorithm approach to optimization of asynchronous automatic assembly systems","228734275":"Systematic testing of real-time systems","2249408":"Evolutionary Exploration of Search Spaces","2535108":"Cultural Enhancement Of Neuroevolution","221345234":"Removing the Genetics from the Standard Genetic Algorithm","2773705":"Signal-to-noise, Crosstalk and Long Range Problem Difficulty in Genetic Algorithms","3639507":"Sequential test and parameter estimation for array processing ofseismic data","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","221008330":"Population Dynamics Model for Gene Frequency Prediction in Evolutionary Algorithms","4201641":"Efficiently minimizing expensive cost functions with a hybrid evolutionary algorithm using clustering and a derivative-free optimizer: preliminary results","220314575":"Epistasis in Genetic Algorithms Revisited.","228399474":"Genetic Matching for Estimating Causal Effects: A General Multivariate Matching Method for Achieving Balance in Observational Studies","252702176":"Implementation of a spatial decision support system for rural land use planning: integrating GIS and environmental models with search and optimisation algorithms","222832056":"A parallelized genetic algorithm for the calibration of Lowry model","222414256":"An indirect genetic algorithm for a nurse scheduling problem. Comput Oper Res","13754912":"A Genetic Algorithm for Multiple Molecular Sequence Alignment","235426546":"Genetic Algorithms and Very Fast Simulated Reannealing: A Comparison","220375001":"An Overview of Evolutionary Algorithms for Parameter Optimization","220375004":"The Simple Genetic Algorithm and the Walsh Transform: Part I, Theory","2247968":"The Royal Road for Genetic Algorithms: Fitness Landscapes and GA Performance","4257090":"Benchmarking Punctuated Anytime Learning for Evolving a Multi-Agent Team\u0027s Binary Controllers","2660139":"Genetic Algorithms and The Design of Experiments","2775342":"Automatic Word Categorization with Genetic Algorithms","2771232":"Conditions for Implicit Parallelism","2744098":"Evolution Strategies: An Alternative Evolutionary Algorithm","2461993":"Dimensionality Optimization By Heuristic Greedy Learning Vs. Genetic Algorithms in Knowledge Discovery and Data Mining","220080144":"Adaptive-predictive game-playing programs","226448496":"Genetic Algorithms for numerical optimization","1911048":"Exploiting problem structure in a genetic algorithm approach to a nurse rostering problem","220642864":"Deception, Dominance and Implicit Parallelism in Genetic Search.","2614079":"Genetic Algorithms and Heuristic Search","220742707":"Predicting mining activity with parallel genetic algorithms","238571300":"Inversion of seismic refraction data using genetic algorithm","2486073":"Adaptive Linkage Crossover","215992257":"Genetic Optimization Using Derivatives: The rgenoud Package for R","45132719":"Genetic algorithms: a tool for optimization in econometrics - basic concept and an example for empirical applications","230902499":"Bottom geoacoustic inversion by matched field processing - a sensitivity study","228911237":"Research of Pareto set by genetic algorithm, application to multicriteria optimization of fuzzy controler","24122964":"Ex-vessel Pricing and IFQs: A Strategic Approach","225704022":"Conceptual Design of Fixtures using Genetic Algorithms","3418898":"Clustering-Based Adaptive Crossover and Mutation Probabilities for Genetic Algorithm","221606930":"Maintaining Diversity in Genetic Search.","242392409":"The Prisoner\u0027s Dilemma Computer Tournaments Revisited","2607882":"Walsh and Haar Functions in Genetic Algorithms","242393436":"8 REFERENCES","4375923":"Solving Deceptive Problems Using A Genetic Algorithm with Reserve Selection","220150829":"Theory of Evolutionary Algorithms: A Birds Eye View","228945554":"Applying genetic algorithms to land use planning","242092377":"Graduate Course An Introduction to Genetic Algorithms","2302235":"The Artificial Evolution of Adaptive Behaviour","226661054":"Building Better Nurse Scheduling Algorithms","242919226":"Genetic Algorithms as Global Random Search Methods: An Alternative Perspective","2710889":"Learning Gene Linkage to Efficiently Solve Problems of Bounded Difficulty Using Genetic Algorithms","220375137":"Predictive Models for the Breeder Genetic Algorithm I. Continuous Parameter Optimization","290070537":"Use of Genetic and Neural Technologies in Oil Equipment Computer-Aided Design","253712471":"Artificial Intelligence Approach of Optimal Route Selection in Telematics","226150449":"Tool planning in the scenario of multiple existing semiconductor fabs","200734884":"The GARP modelling system: problems and solutions to automated spatial prediction. Int J Geog Inf Sci 13:143-158","2252145":"Predicting Epistasis Directly from Mathematical Models","2447217":"A Genetic Algorithm for the Induction of Nondeterministic Pushdown Automata","11019772":"Embedded Landscapes","253434435":"A primer on Bethke\u0027s Walsh schema transform","220701311":"A Knowledge-Intensive Learning System for Document Retrieval.","2420601":"SEARCH, Polynomial Complexity, And The Fast Messy Genetic Algorithm","235062109":"Rapid Target Modeling Through Genetic Inheritance Mechanism Genetically Evolved Target Prototypmg (GETP). Phase I","2706294":"Using Neural Networks And Genetic Algorithms As Heuristics For NP-Complete Problems","226447902":"Enhanced Direct and Indirect Genetic Algorithm Approaches for a Mall Layout and Tenant Selection Problem","240620851":"Un etat des lieux de l\u0027optimisation evolutionnaire et de ses implications en sciences pour l\u0027ingenieur","264953519":"Genetic algorithm based approach to bi-level linear programming","12044242":"Gene Expression and Fast Construction of Distributed Evolutionary Representation","220414538":"Computers and Gradualness: The Selfish Meme.","251420563":"Evolving Coordinated Agents","215635881":"Population-Based Incremental Learning: A Method for Integrating Genetic Search Based Function Optimization and Competitive Learning","235720063":"An application of a GA with Markov network surrogate to feature selection","224377899":"Gradualness Facilitates Knowledge Refinement","254736473":"Fuzzy Relation-Based Fuzzy Neural-Networks Using a Hybrid Identification Algorithm","221613133":"A Statistical Mechanical Formulation of the Dynamics of Genetic Algorithms.","221161046":"The Study of Special Encoding in Genetic Algorithms and a Sufficient Convergence Condition of GAs","246387669":"Genetic Algorithms in Timetabling and Scheduling","228713693":"2 Evolutionary Algorithms in Modeling and Animation","251924088":"Text clustering based on term weights automatic partition","26736362":"Granular Neural Networks and Their Development Through Context-Based Clustering and Adjustable Dimensionality of Receptive Fields","220867243":"Adapting to Complexity During Search in Combinatorial Landscapes","2788777":"Genetic Algorithm in Search and Optimization: The Technique and Applications","3692989":"An empirical comparison of simulated annealing and genetic algorithms on NK fitness landscapes","222512837":"Adaptation and Evolution in Dynamic Persistent Environments","2439586":"Mutation-Crossover Isomorphisms and the Construction of Discriminating Functions","235084170":"An Examination of Hypercube Implementations of Genetic Algorithms","6301161":"An Information-Theoretic Analysis on the Interactions of Variables in Combinatorial Optimization Problems","239545804":"Het meten van GA-hardheid — Measuring GA-hardness","3603896":"A genetic algorithm with neutral mutations for solving nonstationary function optimization problems","227119111":"Maynard Smith, optimization, and evolution","2363819":"Genetic Algorithms Applied To Real Time Multiobjective Optimization Problems","38083018":"Optimization aspects of carcinogenesis","2697658":"Breeding Grammars: Grammatical Inference with a Genetic Algorithm","289157796":"Using Neural Networks and Genetic Algorithms as Heuristics for NP-Complete Problems","2716597":"Crossover Non-linearity Ratios and the Genetic Algorithm: Escaping the Blinkers of Schema Processing and Intrinsic Parallelism","2324414":"From GAs to Artificial Immune Systems: Improving Adaptation in Time Dependent Optimization","247981400":"The robustness requirement in stochastic dynamic programing - preliminary draft of a draft","220963976":"An Adjusted Simulated Annealing Approach to Particle Swarm Optimization: Empirical Performance in Decision Making","223885565":"Genetic algorithm representations for laminate layups","242091977":"Optimisation multicritère de contrôleur flou par une stratégie d\u0027évolution approchant la zone de Pareto","2250117":"Deception Considered Harmful","3810192":"Problem perturbation: implications on the fitness landscape","224159478":"Optimization of induction motor control using genetic algorithms","221522584":"Hybrid Two-Population Genetic Algorithm.","220867226":"Fluctuating Crosstalk as a Source of Deterministic Noise and Its Effects on GA Scalability.","235949986":"A genetic algorithm for induction of nondeterministic push-down automata","241724379":"Theoretical And Empirical Properties Of The Genetic Algorithm As A Numerical Optimizer","234797642":"”A study of Automatic Rule Generation and Adaption”","2725788":"Spectral Landscape Theory","216300382":"A Note on Research Methodology and Benchmarking Optimization Algorithms","3454857":"Nonlinear tuning of aircraft controllers using genetic global optimization: A new periodic mutation operator","222373631":"GA-based learning for a model-based object recognition system","3575177":"A parallel genetic algorithm on the CM-2 for multi-modal optimization","1907679":"A Pyramidal Evolutionary Algorithm with Different Inter-Agent Partnering Strategies for Scheduling Problems","229901943":"Adaptive knowledge representation: A content sensitive recombination mechanism for genetic algorithms","228723814":"Self-organizing polynomial neural networks based on genetically optimized multi-layer perceptron architecture","237434850":"An Empirical Comparison of Seven Iterative and Evolutionary Heuristics for Static Function Optimization (Extended Abstract)","2526190":"Fundamental Principles of Deception in Genetic Search","222444682":"Macro-cell and module placement by genetic adaptive search with bitmap-represented chromosome","3810289":"A coevolutionary genetic algorithm for constrained optimization","220742372":"Walsh transforms, sum theorems and partition coefficients multary alphabets","221112547":"An Overview of Evolutionary Computation","2824165":"Using Genetic Algorithms with Sexual or Asexual Transposition: a Comparative Study","15903014":"Evolution and gradualness","224687281":"Constrained Stochastic Tournament Selection in Flight Control Problems","221497573":"Online Learning via Congregational Gradient Descent.","2651633":"Performance of a Genetic Algorithm with Variable Local Search Range Relative to Frequency of the Environmental Changes","220176070":"Covariance matrix self-adaptation evolution strategies and other metaheuristic techniques for neural adaptive learning","2873334":"GA-Hardness Revisited","220701895":"A Modified Edge Recombination Operator for the Travelling Salesman Problem.","2295746":"Handling Deceptive Problems Using a different Genetic Search","221618902":"Genetic Algorithms and Explicit Search Statistics.","13267246":"Adapting Operator Settings in Genetic Algorithms","201976303":"Genetic Algorithms for the Development of Real-Time Multi-Heuristic Search Strategies","220618944":"Why DGAs work well on GA-hard functions?","224301752":"A foundational study on the applicability of genetic algorithm to software engineering problems","245493065":"Tool planning in multiple product-mix under cycle time constraints for wafer foundries using genetic algorithm","226886255":"Guided Genetic Algorithm and its Application to Radio Link Frequency Assignment Problems","1955318":"Potholes on the Royal Road","261045347":"Fitness Modeling With Markov Networks","220739804":"Fluctuating crosstalk, deterministic noise, and GA scalability","222304954":"The Coevolution of Automata in the Repeated Prisoner\u0027s Dilemma","220885712":"Tracing the Behavior of Genetic Algorithms Using Expected Values of Bit and Walsh Products.","221271243":"Genetic Algorithms are NOT Function Optimizers.","220740819":"Empirical Analysis of Ideal Recombination on Random Decomposable Problems","2754004":"Solving The Radio Link Frequency Assignment Problem With The Guided Genetic Algorithm","226819707":"“Genetic Algorithms: Foundations and Applications,”"},"index":578}