{"abs":"Many authors have pointed out the need to firm up the ‘fuzzy’ ecosystem management paradigm and develop operationally practical processes to allow forest managers to accommodate more effectively the continuing rapid change in societal perspectives and goals. There are three spatial scales where clear, precise, practical ecosystem management processes are needed: the regional assessment scale, the forest-level scale, and the project-level scale. This paper proposes a practical decision analysis process for ecosystem management at the project-level scale. Goals are the focal point of management. To achieve them requires a formal, structured goal hierarchy, desired future conditions, several interesting alternatives, scenario analysis, and monitoring and evaluation of the results. The proposed process is firmly grounded in the body of theory and practice organized in the scientific literature under the heading of multi-objective decision analysis. An illustrative example of this decision analysis process is presented using the Bent Creek Experimental Forest of the Pisgah National Forest near Asheville, NC as a test case.","title":"A practical decision-analysis process for forest ecosystem management","id":223396279,"url":"https://www.researchgate.net/publication/223396279_A_practical_decision-analysis_process_for_forest_ecosystem_management","names":["H.Michael Rauscher","F.Thomas Lloyd","David L. Loftis","Mark J. Twery","Computers and Electronics in Agriculture"],"references":{"228436639":"Radically Contested Assertions in Ecosystem Management","242201127":"REGENERATION OF SOUTHERN HARDWOODS: SOME ECOLOGICAL CONCEPTS","24928247":"Decisions with Multiple Objectives: Preferences and Value Tradeoffs","271686458":"Ecosystem Management with Multiple Owners: Landscape Dynamics in a Southern Appalachian Watershed","234812083":"Intelligent Decision Systems","257197977":"Ecosystem Management Decision Support for Federal Forests in the United States: A Review","4940868":"Expert systems approach to decision support","235710428":"The Dictionary of Forestry","277515483":"The Structure of Unstructured Decision Process","233549114":"Regenerating Southern Appalachian Mixed Hardwood Stands with the Shelterwood Method","220040783":"Ecosystem management with multiple owners: landscape dynamics in a Southern Appalachian watershed","31665649":"Decision sciences : an integrative perspective / P.R. Kleindorfer, H.C. Kunreuther, P.J.H. Schoemaker.","222348306":"Seven Pillars of Ecosystem Management","222130665":"Goals and goal orientation in decision support systems for ecosystem management","292007409":"Forestry\u0027s fuzzy concepts an examination of ecosystem management","291978234":"The RPA/NFMA: solution to a nonexistent problem","243554343":"Multi-Criteria Decision Making: The Analytic Hierarchy Process","239567778":"Artificial Intelligence and the Design of Expert Systems","223481466":"AppBuilder for DSSTools: An application development environment for developing decision support systems in Prolog","222681839":"NED-1: Integrated analyses for forest stewardship decisions","38990972":"The Practice of Silviculture","40932292":"Decision Analysis for Management Judgment, Third Edition","239800689":"Silviculture and Forest Aesthetics Within Stands","31679327":"Decision support systems : a knowledge-based approach / C.W. Holsapple, A.B. Whinston.","246651727":"Large-Scale Management Experiments and Learning by Doing","37712066":"Value-Focused Thinking"},"citedIn":{"259150707":"Selecting the efficient harvesting method using multiple criteria analysis: A case study in south-west Western Australia","281691087":"Management in Support of Sustainable Forestry: a Review","222186808":"Spatial Forest Planning: A Review","228982060":"Intelligent model management in a forest ecosystem management decision support system","253644567":"Determination of the best canopy gap area on the basis of soil characteristics using of Analytical Hierarchy Process (AHP)","220110096":"Design of forest management planning DSS for wildfire risk reduction","7140962":"Application of Multicriteria Decision Analysis in Environmental Decision Making","238712362":"A framework for setting land conservation priorities using multi-criteria scoring and an optimal fund allocation strategy","233179764":"Prioritizing Long-term Watershed Management Strategies Using Group Decision Analysis","226727184":"FORESTAR:","24016887":"Spatial optimization of the pattern of fuel management activities and subsequent effects on simulated wildfires","233492976":"Testing the performance of a forest ecosystem model (FORECAST) against 29 years of field data in a Pseudotsuga menziesii plantation","259458412":"Flood Hazard Zonation-A GIS aided Multi Criteria Evaluation (MCE) Approach with Remotely Sensed Data","242103283":"Decision Support for Ecosystem Management and Ecological Assessments","40732144":"Harnessing Ecosystem Models and Multi-Criteria Decision Analysis for the Support of Forest Management","280733092":"Soil carbon stocks in a Sitka spruce chronosequence following afforestation.","223282024":"Multiple Criteria Decision Support in Forest Management – The Approach, Methods Applied, and Experiences Gained","227416998":"Social acceptability of alternative forest regimes in Mount Kilimanjaro, Tanzania, using stakeholder attitudes as metrics of uncertainty","288546330":"Information and knowledge management for sustainable forestry","222681839":"NED-1: Integrated analyses for forest stewardship decisions","222905699":"Making forestry decisions with multiple criteria: A review and an assessment","220479374":"Trends in spatial forest planning","283725509":"Influence of existing secondary forest road network on the selection of timber extraction technologies at the tactical level of planning","222511468":"Integrated decision support for sustainable forest management in the United States: Fact or fiction?","259801932":"Past, current and future drivers for the development of decision support systems in forest management","270437926":"Joint production of timber and water: A case study","286292138":"Composite assessment of productive, protective and recreational functions in forest planning","277784756":"Social participation into regional forest planning attending to multifunctional objectives","269602218":"Evaluating continuous cover forestry based on the forest owner’s objectives by combining scenario analysis and multiple criteria decision analysis","222688120":"NED-2: An agent-based decision support system for forest ecosystem management","222575623":"Integrating stand and landscape decisions for multi-purposes of forest harvesting","7141416":"From Optimization to Adaptation: Shifting Paradigms in Environmental Management and Their Application to Remedial Decisions","221549298":"PROLOG/RDBMS integration in the NED intelligent information system","241715375":"Remote sensing, spatial multi criteria evaluation (SMCE) and analytical hierarchy process (AHP) in optimal cropping pattern planning for a flood prone area","261839568":"Ecosystem-based coastal zone management: A comprehensive assessment of coastal ecosystems in the Yangtze Estuary coastal zone","234166843":"Simulation and multicriteria analysis in sustainable coastal planning: The case of aquaculture in Thermaikos Gulf, Greece","260247884":"The application of a hierarchical, decision-support system to evaluate multi-objective forest management strategies: A case study in northeastern British Columbia, Canada","230866577":"Development of forest ecosystems after heavy deposition loads considering Dübener Heide as example - challenges for a process-oriented forest management planning","220210170":"Reversing the Perspective on the Applications of Decision Analysis (Comment on Keefer et al. 2004)","226060323":"Multi-Criteria Decision Analysis: A Framework for Structuring Remedial Decisions at Contaminated Sites","7803435":"Modelling ecological expertise for forest planning calculations-rationale, examples, and pitfalls","279537908":"The PractiSFM multi-resource inventory protocol and Decision Support System A model to address the private forest resource information gap in Ireland","266055609":"Application of Multi-Criteria Methods in Natural Resource Management – A Focus on Forestry","278077431":"Integrated decision support for sustainable forest management in the United States: Fact or fiction?","237727054":"Prescriptive Treatment Optimization Using a Genetic Algorithm: A Tool for Forest Management","237049028":"An information system to support sustainable management of Habitats and Rare Priority and Protected Species (HaRPPS) in British forests","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","256384046":"Scaling issues in forest ecosystem management and how to address them with models","222433067":"Linkov I, Satterstrom FK, Kiker G, Batchelor C, Bridges T, Ferguson E. 2006a. From comparative risk assessment to multi-criteria decision analysis and adaptive management: Recent developments and applications. Environment International","237049045":"Establishment Management Information System (EMIS): Delivering Good Practice Advice on Tree Establishment in the Uplands of Britain","287551957":"Adaptive management: A review and framework for integration with multi-criteria decision analysis","3926851":"The interplay between nonlinear effects in modern opticalcommunications systems","242142994":"This thesis describes the development of a knowledge-based system to evaluate forested land for availability of wildlife habitat. NED is an acronym derived from \"Northeast Decision Model\". The NED DSS, a collection of software products, was"},"index":582}