{"abs":"Particle splitting methods are considered for the estimation of rare events. The probability of interest is that a Markov process first enters a set B before another set A, and it is assumed that this probability satisfies a large deviation scaling. A notion of subsolution is defined for the related calculus of variations problem, and two main results are proved under mild conditions. The first is that the number of particles generated by the algorithm grows subexponentially if and only if a certain scalar multiple of the importance function is a subsolution. The second is that, under the same condition, the variance of the algorithm is characterized (asymptotically) in terms of the subsolution. The design of asymptotically optimal schemes is discussed, and numerical examples are presented.","title":"Splitting for rare event simulation: A large deviation approach to design and analysis","id":222297395,"url":"https://www.researchgate.net/publication/222297395_Splitting_for_rare_event_simulation_A_large_deviation_approach_to_design_and_analysis","names":["Thomas A. Dean","Paul Dupuis","Stochastic Processes and their Applications"],"references":{"243040124":"COMMUNICATIONS OF THE MOSCOW MATHEMATICAL SOCIETY: Autonomous random perturbations of dynamical systems","268023193":"Capuzzo-Dolcetta, I.: Optimal Control and Viscosity Solutions of Hamilton-Jacobi-Bellman Equations. Birkhaüser, Boston","227423851":"Metastability for Non-Linear Random Perturbations of Dynamical Systems","220442470":"Subsolutions of an Isaacs Equation and Efficient Schemes for Importance Sampling","230945060":"Random Perturbations of Dynamical Systems","3023205":"A large deviations perspective on the efficiency of multilevel splitting","220136433":"Analysis of an importance sampling estimator for tandem queues ACM TOMACS 4, 22-42","266311824":"Random perturbations of dynamical systems: Large deviations and averaging","2118579":"Dynamic importance sampling for uniformly recurrent Markov chains","265442406":"Control Markov Processes and Viscosity Solutions","2126101":"Genealogical particle analysis of rare events","250892878":"Controlled markov processes and viscosity solutions","2214973":"Dynamic importance sampling for queueing networks","38339957":"Counterexamples in importance sampling for large deviations probabilities. Ann. Appl. Probab. 7, 731-746"},"citedIn":{"257665561":"Bayesian Parameter Inference for Partially Observed Stopped Processes","51931870":"A basic introduction to large deviations: Theory, applications,\nsimulations","49819199":"A multiple replica approach to simulate reactive trajectories","254306656":"Optimal Splitting for Rare-event Simulation","257642130":"Analysis of an interacting particle method for rare event estimation","50996224":"Handbook of Monte Carlo Methods","228665450":"Parameter inference for stopped processes","51889883":"Small Variance Estimators for Rare Event Probabilities","266468270":"Optimal Sampling of Overflow Paths in Jackson Networks","282739466":"Bridging the gap between deterministic and probabilistic uncertainty quantification using advanced proxy based methods","264922008":"On Efficiency of Multilevel Splitting","266943935":"A survey of rare event simulation methods for static input-output models","282983494":"A separated splitting technique for disconnected rare event sets","259535143":"Maximum-Likelihood Maximum-Entropy Constrained Probability Density Function Estimation for Prediction of Rare Events","266856196":"Capturing Exponential Variance Using Polynomial Resources: Applying Tensor Networks to Nonequilibrium Stochastic Processes","228389880":"Importance Sampling for Rare Events","263127049":"Min-max representations of viscosity solutions of Hamilton-Jacobi equations and applications in rare-event simulation","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","269329444":"Efficient splitting-based rare event simulation algorithms for heavy-tailed sums","281629792":"Some ideas for bias and variance reduction in the splitting algorithm for diffusion processes","50425579":"On the Stability of Sequential Monte Carlo Methods in High Dimensions","4102609":"Integrated 0.9 V charge-control switching converter with self-biased current sensor","259875278":"Moderate deviations for recursive stochastic algorithms","45931848":"Analysis of a Splitting Estimator for Rare Event Probabilities in Jackson Networks","41035462":"Queueing networks: rare events and fast simulations","220462294":"The design and analysis of a generalized RESTART/DPR algorithm for rare event simulation","257665517":"Analysis of adaptive directional stratification for the controlled estimation of rare event probabilities","254916297":"Rare Event Simulation using Monte Carlo Methods","251712760":"State-dependent importance sampling for rare-event simulation: An overview and recent advances","51927459":"Importance Sampling for Multiscale Diffusions","228312742":"Variance Reduction Techniques in Monte Carlo Methods","220136480":"A Variant of Importance Splitting for Rare Event Estimation: Fixed Number of Successes"},"index":584}