{"abs":"The seismic risk assessment of a structure in performance-based design (PBD) may be significantly affected by the representation of ground motion uncertainty. In PBD, the uncertainty in the ground motion is often represented by a probabilistic description of a scalar parameter, or low-dimensional vector of parameters, known as the intensity measure (IM), rather than a full probabilistic description of the ground motion time history in terms of a stochastic model. In this work, a new procedure employing relative sufficiency measure is introduced on the basis of information theory concepts to quantify the suitability of one IM relative to another in the representation of ground motion uncertainty. On the basis of this relative sufficiency measure, several alternative scalar- and vector-valued IMs are compared in terms of the expected difference in information they provide about a predicted structural response parameter, namely, the seismically induced drift in an existing reinforced-concrete frame structure. It is concluded that the most informative of the eight considered IMs for predicting the nonlinear drift response are two scalar IMs and a vector IM that depend only on the spectral ordinates at the periods of the first two (small-amplitude) modes of vibration.","title":"Analyzing the Sufficiency of Alternative Scalar and Vector Intensity Measures of Ground Shaking Based on Information Theory","id":275182238,"url":"https://www.researchgate.net/publication/275182238_Analyzing_the_Sufficiency_of_Alternative_Scalar_and_Vector_Intensity_Measures_of_Ground_Shaking_Based_on_Information_Theory","names":["F. Jalayer","J. L. Beck","F. Zareian","Journal of Engineering Mechanics"],"references":{"228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","252482973":"Stochastic Modeling of California Ground Motions","227715888":"Vector-valued ground motion intensity measure consisting of spectral acceleration and epsilon","227674032":"Effects of Two Alternative Representations of Ground Motion Uncertainty on Probabilistic Seismic Demand Assessment of Structures","227514492":"Hysteretic Models that Incorporate Strength and Stiffness Deterioration","28784913":"Engineering Features of the San Fernando Earthquake of February 9","234814104":"A mathematical theory of communication. AT\u0026T Tech J","227644678":"Alternative non-linear demand estimation methods for probability-based seismic assessments. Earthq Eng Struct Dyn","277526365":"Earthquake, Records and Nonlinear MDOF Responses","38975992":"Life-cycle cost optimal design of passive dissipative devices","233666544":"Probabilistic seismic hazard analysis and design earthquakes: Closing the loop","245939078":"Disaggregation of Seismic Hazard"},"citedIn":{"276890881":"Preliminary ranking of alternative scalar and vector intensity measures of ground shaking","277400376":"SEISMIC RETROFIT DECISION-MAKING OF BRIDGES BASED ON LIFE-CYCLE COST CRITERIA","280642505":"Spectral Shape Proxies and Simplified Fragility Analysis of Mid- Rise Reinforced Concrete Buildings","276854517":"Bayesian Cloud Analysis: Efficient structural fragility assessment using linear regression","263428698":"A performance-based framework for adaptive seismic aftershock risk assessment","271738297":"Analytical versus observational fragilities: the case of Pettino (L’Aquila) damage data database","277399767":"Towards quantifying the effect of aftershocks in seismic risk assessment"},"index":585}