{"abs":"In this article we describe an approach to the construction of a general learning mechanism based on chunking in Soar. Chunking is a learning mechanism that acquires rules from goal-based experience. Soar is a general problem-solving architecture with a rule-based memory. In previous work we have demonstrated how the combination of chunking and Soar could acquire search-control knowledge (strategy acquisition) and operator implementation rules in both search-based puzzle tasks and knowledge-based expert-systems tasks. In this work we examine the anatomy of chunking in Soar and provide a new demonstration of its learning capabilities involving the acquisition and use of macro-operators.","title":"Chunking in Soar: The Anatomy of a General Learning Mechanism","id":220343557,"url":"https://www.researchgate.net/publication/220343557_Chunking_in_Soar_The_Anatomy_of_a_General_Learning_Mechanism","names":["John E. Laird","Paul Rosenbloom","Allen Newell","Machine Learning"],"references":{"243777607":"An Overview of Machine Learning, in Machine Learning: An Artificial Intelligence Approach","30873428":"Principles of Artificial Intelligence","220546080":"SOAR: An Architecture for General Intelligence","223114633":"A new basis for state-space learning systems and a successful implementation","222467015":"RI: A Rule-based Configurer of Computer Systems","220343973":"Explanation-Based Generalization: A Unifying View","253155025":"``Memo\u0027\u0027 Functions and Machine Learning","220546349":"Toward a Model of Representation Changes.","220815842":"Learning and Problem Solving.","10255186":"The Magical Number Seven, Plus Or Minus 2: Some Limits On Our Capacity for Processing Information","240781386":"A Universal Weak Method","232537228":"Production system models of practice effects.","222475024":"Korf, R.E.: Depth-first iterative-deepening: an optimal admissible tree search. Artif. Intell. 27, 97-109","235033937":"An Overview of Production Systems","223247002":"Macro-operators: A weak method for learning","243621331":"The chunking of goal hierarchies: a generalized model of practice","239570704":"Knowledge compilation: Mechanisms for the automatization of cognitive skills","221603117":"Towards Chunking as a General Learning Mechanism.","222891794":"EURISKO: A program that learns new heuristics and domain concepts","243783833":"Mechanisms of skill acquisition and the law of practice","235051613":"AM: An Artificial Intelligence Approach to Discovery in Mathematics as Heuristic Search","247767835":"The Architecture Of Cognition","220812297":"A Model for Learning Systems","22649722":"The Theory of Learning by Doing","235140455":"Production Systems: Models of Control Structures","267089998":"Memo functions, the graph traverser, and a simple control situation","222465509":"Rete: A Fast Algorithm for Many Pattern/Many Object Pattern Match Problem","247348311":"Reasoning, problem-solving, and decision processes: The problem space as a fundamental category","200773342":"SOAR: An Architecture for General Intelligence","234790103":"A Computer Model of Skill Acquisition","35358005":"Shift of bias for inductive concept learning /","220813254":"Generalizations Based on Explanations.","31610067":"Artificial intelligence / E. Rich.","224377902":"R1-Soar: An Experiment in Knowledge-Intensive Programming in a Problem-Solving Architecture","220814557":"Adaptive Production Systems.","220814302":"A Universal Weak Method: Summary of Results.","36336977":"The chunking of goal hierarchies : a model of practice and stimulus-response compatibility /","220546718":"Learning and Executing Generalized Robot Plans.","247341954":"Perception in Chess","237132958":"Learning and executing generalized robot","237127519":"Knowledge compilation: the general learning mechanism","220812759":"Learning Effective Search Heuristics.","220547290":"EURISKO: A Program That Learns New Heuristics and Domain Concepts.","267016149":"Computers and thought. A collection of articles","223513709":"Repair Theory: A Generative Theory of Bugs in Procedural Skills","235700979":"The Architecture of Cognition"},"citedIn":{"2783275":"Utilization Filtering: a method for reducing the inherent harmfulness of deductively learned knowledge","200040429":"Concepts and experiments in computational reflection","222917960":"A protocol-based coding scheme for the analysis of medical reasoning","222813505":"Verification and Validation and Artificial Intelligence","227327364":"Tree search and quantum computation","2593834":"Generating Search Knowledge in a Class of Games","221604152":"Formulating Concepts According to Purpose.","2519081":"Learning Analytically and Inductively","220321075":"Learning Recursive Control Programs from Problem Solving.","3421223":"ITERATE: A conceptual clustering algorithm for data mining","225070457":"Knowledge maintenance: The state of the art","220183813":"Modeling by Example","233045502":"The Role of Evolutionary Inheritance in Developing Knowledge Bases for Conceptual Design of Engineering Products","228730300":"Andronache V.: The APOC Framework for the Comparison of Agent Architectures","222710104":"Cognitive architectures: research issues and challenges. Cogn Syst Res","2834443":"Adaptive Agents: Emotion Learning","51853110":"RACE/A: An Architectural Account of the Interactions Between Learning, Task Control, and Retrieval Dynamics","222438758":"A theory of human knowledge","240321142":"Evolutionary Feature Selection and Construction","222749025":"Acquiring search-control knowledge via static analysis","228362678":"Structural transfer of cognitive skills","220097844":"The agent network architecture (ANA)","3113989":"Identifying tacit strategies in aircraft maneuvers","264998886":"Extending Soar with Dissociated Symbolic Memories","221604120":"Adaptive Search by Explanation-Based Learning of Heuristic Censors.","2820102":"Reflection and Hyper-Programming in Persistent Programming Systems","35028537":"Learning hierarchical decomposition rules for planning : an inductive logic programming approach /","44569223":"Conditional Routing of Information to the Cortex: A Model of the Basal Ganglia\u0027s Role in Cognitive Coordination","242427459":"Domains: A Preliminary Report","221099289":"Enhancing Flexibility of Production Systems by Self-optimization","223663464":"Design by derivational analogy:Issues in the automated replay of design plans","221112592":"Theoretical Results on Reinforcement Learning with Temporally Abstract Options.","220343580":"Information Filtering: Selection Mechanisms in Learning Systems","228534689":"laini or ces to Create Useful Concepts for Evaluating States","228393438":"Salt \u0026 Pepper Architecture and Toolkit","256121612":"Introduction:Paradigms for machine learning","254212973":"Human Memory Models for Operator Simulation","256110351":"Exemplar-based knowledge acquisition","224075030":"A novel cold-FET method for determining extrinsic capacitances using a capacitive transmission line model","1961043":"A Formal Framework for Speedup Learning from Problems and Solutions","2431082":"Learning Database Abstractions For Query Reformulation","2584691":"A Framework for Goal-Driven Learning","2771071":"The Application of Machine Learning to Student Modeling: Survey and Analysis","277838038":"Integrated Cognitive Architectures For Robust Decision Making","239025764":"INFERENTIAL THEORY OF LEARNING: Developing Foundations for Multistrategy Learning","220097859":"An Architecture for Bounded Rationality.","222487840":"Mapping Part-Whole Hierarchies into Connectionist Networks","1961086":"A Selective Macro-learning Algorithm and its Application to the NxN Sliding-Tile Puzzle","2632780":"Flexible Strategy Learning: Analogical Replay of Problem Solving Episodes","220343623":"Multi Level Knowledge in Modeling Qualitative Physics Learning","3497040":"Learning control information in rule-based systems: a weak method","220079480":"When Processes Learn: Steps Toward Crafting an Intelligent Organization","2341963":"Goal-Driven Learning in Multistrategy Reasoning and Learning Systems","220547404":"Explanation-Based Learning: A Problem Solving Perspective.","220320075":"Transfer Learning for Reinforcement Learning Domains: A Survey.","3497050":"Argo: a system for design by analogy","2771032":"Analysis and Empirical Studies of Derivational Analogy","3497030":"A learning model for the selection of problem solving strategies in continuous physical systems","220628309":"Argo: A System for Design by Analogy.","2751582":"Learning by Experimentation: The Operator Refinement Method","222828848":"Acquisition of hierarchical reactive skills in a unified cognitive architecture","2984108":"Expert System Technology for the Military: Selected Samples","2368678":"Integrating ILP and EBL","2272417":"Automated Design Of Knowledge-Lean Heuristics: Learning, Resource Scheduling, And Generalization","258637805":"A Need for Understanding Collective Intelligent Characters","225221094":"Cost-Sensitive Learning of Classification Knowledge and Its Applications in Robotics","220773795":"Adaptive Learning Using a Qualitative Feedback Loop.","220773816":"Learning Operators While Planning.","221606311":"Hierarchical Chunking in Classifier Systems.","245282317":"Constructability Analysis: Machine Learning Approach","220343735":"Editorial: Human and Machine Learning","220343732":"Derivational Analogy in PRODIGY: Automating Case Acquisition, Storage, and Utilization","2683070":"Perception and Experience in Problem Solving Abstract","2676913":"Integrated Architectures for Artificial Intelligence","27537668":"Knowledge Compilation and Speedup Learning in Continuous Task Domains","3996828":"Induction of search control rules for hard real-time task scheduling","31889735":"A chunking mechanism in a neural system for the parallel processing of a propositional production rules","222601696":"Artificial intelligence and large scale computation: A physics perspective","221388182":"L-ATMS: A tight integration of EBL and the ATMS","24318427":"Knowledge and regularity in planning","2818179":"Anomaly Driven Concept Acquisition","223008227":"Proposals for chunking and tabu search","221413785":"COGNITO: An Extended Computational Theory of Cognition.","225257926":"Integrated cognitive architectures: A survey","225843674":"Correcting Imperfect Domain Theories: A Knowledge-Level Analysis","222831078":"Model-based reasoning about learner behaviour","226237906":"On Acquiring Expertise in Medicine","222065042":"Driving Tabu Search with case-based reasoning","268362575":"Improving Acquisition of Teleoreactive Logic Programs through Representation Change","222736880":"Inductive learning of search control rules for planning","2427037":"Analogy in Problem Solving","222705150":"Ontology infrastructure for execution-oriented autonomous agents","220343707":"CSM: A Computational Model of Cumulative Learning","220202396":"Spatio-temporal Conflict Detection and Resolution","220925334":"Restructuring Rule Bases to Improve Performance.","2305251":"Learning Action Strategies for Planning Domains","262172513":"Book Review: Exemplar-Based Knowledge Acquisition, by Ray Bareiss. Academic Press, 1989","284560439":"Promoting the experimental dialogue between working memory and chunking: Behavioral data and simulation","220343788":"Classifier Systems that Learn Internal World Models","2951395":"From AI Technology Research to Applications","2684153":"Learning from Experience in Continuous Domains","220970488":"Learning Options in Reinforcement Learning","21511581":"Computers as clinicians: An update","235084506":"Low-Level Cognitive Modeling of Aircrew Function Using the Soar Artificial Intelligence Architecture","255619047":"Kapitel 5b: Computermodelle des Probleml¨ osens","241310399":"Plausible Generalization: Extending a Model of Human Plausible Reasoning","228808062":"Comprehensibility and overfitting avoidance in genetic programming for technical trading rules","223329681":"Embedding decision-analytic control in a learning architecture","30012716":"Reflection Patterns in the Context of Object and Component Technology","4269223":"Secure Position Routing Using Ad hoc Network","220812750":"An Augmented EBL and its Application to the Utility Problem.","235129579":"Parse Completion: A Study of an Inductive Domain","222484906":"Rule acquisition events in the discovery of problem-solving strategies","233453826":"Strategy Selection and Metacognition","230601043":"The situated common-sense knowledge in FunGramKB","2514120":"Speedup Mechanisms for Large Learning Systems","3657925":"Modelling for cognitive engineering of user interfaces: need, basisand one promising implementation","223381931":"Learning Plan Schemata from Observation: Explanation-Based Learning for Plan Recognition","248942122":"Modeling Individual Differences in Students\u0027 Learning Strategies","224090533":"Knowledge-based Control of a Humanoid Robot","235122428":"Testing and Refining a Core Theory of Human Plausible Reasoning","3497268":"Task-centered research: understanding, augmenting and discovering managerial expertise","242583412":"Multiagent learning through collective memory","222470208":"Episodic Learner Modeling","2825507":"Between MDPs and Semi-MDPs: Learning, Planning, and Representing Knowledge at Multiple Temporal Scales","239667010":"The value of cognitive foundations for dynamic social theory","221619262":"Multi-time Models for Temporally Abstract Planning.","221537318":"Machine learning in the liberal arts curriculum","244956044":"A Framework For Humanoid Control and Intelligence","30858435":"Enhancing Intelligent Agents with Episodic Memory","226441319":"Learning in Uncertain Environments","2762032":"Learning Procedural Planning Knowledge In Complex Environments","226054244":"Problem Solving via Analogical Retrieval and Analogical Search Control","258438776":"A Need for Understanding Collective Intelligent Characters","221203471":"Using Introspective Learning to Improve Retrieval in CBR: A Case Study in Air Traffic Control.","34443048":"Wayfinding choremes : conceptualizing wayfinding and route direction elements /","220815375":"Concurrent Hierarchical Reinforcement Learning.","2608395":"Strategy Learning: A Survey Of Problems, Methods, And Architectures","242637656":"Using Reflection to Support Type-Safe Evolution in Persistent Systems","228862101":"A framework for learning and control in intelligent humanoid robots","2808088":"A design for the ICARUS architecture","220793887":"Using background knowledge to speed reinforcement learning in physical agents","220080168":"Prodigy bidirectional planning","220480531":"Non-LIFO Execution of Cognitive Procedures","265357033":"A Generic Machine Learning Model Using Semantic Primitives","255755782":"Assessing the complexity of students\u0027 knowledge in chemistry","235088696":"CEREBRAL WEEVIL: A Machine Learning Model for Hemispheric Categorization of Complex Visual Patterns","238390025":"Integrating Planning and Learning: The PRODIGY Architecture 1","220813334":"Eliminating Expensive Chunks by Restricting Expressiveness.","3500412":"Explanation-based learning of diagnostic heuristics: a comparison of learning from success and failure","222483465":"Rationality and intelligence","2441576":"Explaining Temporal Differences to Create Useful Concepts for Evaluating States","2528617":"A Framework for Programming Embedded Systems: Initial Design and Results","239019887":"Toward a Theory of Impasse-Driven Learning","220542069":"Learning Preconditions for Planning from Plan Traces and HTN Structure.","222474259":"Automatically generating abstractions for planning","238742376":"Efficient Matching Algorithms for the SOARlOPS Production System","246074361":"A Framework for Goal-Driven Learning1","2612594":"Learning to Improve Uncertainty Handling in a Hybrid Planning System","220571760":"Voting experts: An unsupervised algorithm for segmenting sequences","238688108":"Beiträge zum 14. Arbeitstreffen der GI-Fachgruppe","2565499":"Learning Action Strategies for Planning Domains","228985083":"Relational reinforcement learning: An overview","2777419":"Learning Cooperative Procedures","221602897":"Plan Abstraction Based on Operator Generalization.","222527526":"Rethinking cognitive architecture via graphical models","2813260":"TD Models: Modeling the World at a Mixture of Time Scales","2413902":"Between MDPs and Semi-MDPs: A Framework for Temporal Abstraction in Reinforcement Learning","221108289":"Agent-Augmented Co-Space: Toward Merging of Real World and Cyberspace","34947962":"An integrated architecture for engineering problem-solving [electronic resource].","220936280":"CaMeL: Learning method preconditions for HTN planning","49400709":"Learning perceptual schemas to avoid the utility problem","270277993":"Building Artistic Computer Colleagues with an Enactive Model of Creativity","220073062":"PM: A System to Support the Automatic Acquisition of Programming Knowledge.","221606989":"Mapping Explanation-Based Generalization onto Soar.","222483512":"Concerning the emergence of tag-mediated lookahead in classifier systems","220340312":"Problem-solving and Quantum Computation","280664382":"The challenge of complexity for cognitive systems","2433440":"Acquiring Recursive and Iterative Concepts with Explanation-Based Learning","225219819":"An Incremental Deductive Strategy for Controlling Constructive Induction in Learning from Examples","220978339":"Constructing Game Agents from Video of Human Behavior","220546222":"Learning Problem Solving Strategies Using Refinement and Macro Generation.","235078543":"Flexible Integration of Path-Planning Capabilities","3296702":"SHAPES: A novel approach for learning search heuristics in under-constrained optimization problems","287015063":"Biologically Inspired Architecture for Spatiotemporal Learning of Mobile Robots","2474408":"Using Distribution-Free Learning Theory to Analyze Solution Path Caching Mechanisms","2331052":"Learning While Doing: A Knowledge Compilation Approach to Learning in External Environments","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","255685292":"Toward the Design of Adaptive Instructions and Help for Knowledge Communication with the Problem Solving Monitor ABSYNT","2409910":"CHILD: A First Step Towards Continual Learning","228943920":"Representing and reasoning over time in a symbolic cognitive architecture","256181971":"A skill refinement learning model for prioritized rule-based expert systems","220756144":"Mining heuristics for scheduling distributed hard real-time tasks","238675879":"Hierarchical Reinforcement Learning: A Hybrid Approach","251809436":"Two-staged scheme for subgoaling decomposition and ordering for path search problem","2450821":"Integration of Different Reasoning Modes in a Go Playing and Learning System","222646497":"Reactive goal management in a cognitive architecture","220231814":"Machinery for Artificial Emotions.","2789762":"Symbolic and Subsymbolic Learning for Vision: Some Possibilities","2775430":"35 Kinds of Knowledge Maintenance","253202107":"Metrics for Cognitive Architecture Evaluation","222504173":"Goals and Learning in Microworlds","2921880":"A Framework For Humanoid Control and","2608529":"Learning Efficient Rules by Maintaining the Explanation Structure","30512230":"Une contribution de l\u0027intelligence artificielle et de l\u0027apprentissage symbolique automatique à l\u0027élaboration d\u0027un modèle d\u0027enseignement de l\u0027écoute musicale","266205799":"Transforming Evolutionary Search into Higher-Level Evolutionary Search by Capturing Problem Structure","35698587":"Automated discovery of options in reinforcement learning /","259602107":"Learning to Improve Agent Behaviours in GOAL","247326590":"RADAR-SOAR: Towards an artificial organization composed of intelligent agents","229383272":"Self-supervised learning for an operational knowledge-based system","221412599":"Dilemmas in Computational Societies.","221313270":"Validating a high level behavioral representation language (HERBAL): A docking study for ACT-R","3505651":"Scaffolding the RETE network","27526248":"Introspective multistrategy learning : constructing a learning strategy under reasoning failure","2480619":"Abstraction in Control Learning","2506230":"Design of Representation-Changing Algorithms","244269917":"Some Approaches to Learning in Problem Solving","243775317":"The Nature of the Social Agent","2764281":"Toward Learning Systems That Integrate Different Strategies and Representations","4250007":"Knowledge Transfer Using Local Features","267563563":"Interactive Learning when Human and Machine Utilise Different Feature Spaces","222502041":"Episodic Indexing: A Model of Memory for Attention Events","2554362":"Lazy Incremental Learning of Control Knowledge for Efficiently Obtaining Quality Plans","226295971":"Prolog programming techniques","2522617":"Abductive Non-Linear Planning and Deductive Reasoning","235023331":"Acquiring Domain Knowledge for Planning by Experimentation","232657971":"Heuristic Revision by Heuristic Space Exploration","2322894":"Learning to Solve Complex Planning Problems: Finding Useful Auxiliary Problems","2698712":"Efficient Incremental Induction of Decision Lists - Can Incremental Learning Outperform Non-Incremental Learning?","30861359":"A Computational Unification of Cognitive Control, Emotion, and Learning.","226507899":"A review of machine learning at AAAI-87","221605067":"The FERMI System: Inducing Iterative Macro-Operators from Experience.","220813097":"Learning Subgoal Sequences for Planning.","225133423":"Learning by analogical replay in PRODIGY: first results","267550202":"The Match Cost of Adding a New Rule: A Clash of Views","235115531":"Introspective Reasoning Models for Multistrategy Case-Based and Explanation","226238327":"A quantum production model","221451071":"Toward the Design of Adaptive Instructions and Helps for Knowledge Communication with the Problem Solving Monitor ABSYNT.","233955324":"Metacognition in Strategy Selection","240289884":"The Central Importance of Student Modelling to Intelligent Tutoring","222698313":"Near-term memory in programming: a simulation-based analysis","2522676":"Learning Structured Reactive Navigation Plans from Executing MDP Navigation Policies","228622263":"Towards a new cognitive hourglass: Uniform implementation of cognitive architecture via factor graphs","3562031":"Learning strategy knowledge incrementally","237322303":"Comprehensibility, Overfitting and Co-Evolution in Genetic Programming for Technical Trading Rules","239589467":"On Analyzing Planning Applications","220178179":"Computational Reflection in PowerEpsilon.","240713841":"A Generic Machine Learning Model Using Semantic Primitives 楊勝源","2639362":"Bounding the Cost of Learned Rules","2787841":"Machine Learning for Intelligent Systems","2468363":"Recursion Theoretic Models of Learning: Some Results and Intuitions","233057234":"Computational organization theory: Autonomous agents and emergent behavior","229767054":"Tutoring systems: the state‐of‐the‐art in Great Britain","2297454":"Learning High Utility Rules by Incorporating Search Control","18241368":"Planning.","234771376":"An object-oriented approach to the acquisition of software engineering knowledge","250727614":"Learning in order to avoid search in logic programming","13506177":"Metareasoning and meta-level learning in a hybrid knowledge-based architecture","252112214":"Planning for Complex Tasks: Replay and Merging of Multiple Plans","224222991":"Autonomous task execution of a humanoid robot using a cognitive model","279434993":"Machine Learning","200521129":"SimKnowledge – Analyzing Impact of Knowledge Management Measures on Team Organizations with Multi Agent-Based Simulation","263593450":"The situated common-sense knowledge in FunGramKB","2461253":"Introspective Reasoning Using Meta-Explanations for Multistrategy Learning","234791837":"Learning to Learn: Introduction and Overview","228747204":"alogic ay of","2798149":"Macro-Actions in Reinforcement Learning: An Empirical Analysis","2403924":"A Comparison of Rule and Exemplar-Based Learning Systems","228792274":"Experiments in transfer across multiple learning mechanisms","228731862":"Learning from Errors by Counterfactual Reasoning in a Unified Cognitive Architecture","220344151":"Inferential Theory of Learning as a Conceptual Basis for Multistrategy Learning","2767452":"Learning Hierarchical Behaviors","220344149":"The Problem of Expensive Chunks and Its Solution by Restricting Expressiveness","2338395":"A Learning Mechanism for Logic Programs Using Dynamically Shared Substructures","249914523":"Finding and transferring policies","247130171":"AUTOMATED LEARNING OF LOAD-BALANCING STRATEGIES FOR A DISTRIBUTED COMPUTER SYSTEM","221252539":"Some prolog macros for rule-based programming: why? how?","223676376":"Errata: Algebra Mal-Rules and Cognitive Accounts of Error","2629304":"Induction and the Organization of Knowledge","290108381":"Integrating Perceptual Learning with External World Knowledge in a Simulated Student","220815283":"Execution Architectures and Compilation.","220816306":"Call-Graph Caching: Transforming Programs into Networks.","215510596":"Multi Level Knowledge in Modeling Qualitative PhysicsLearning","223223763":"Machine learning for intelligent support of conflict resolution","220837815":"Learning Qualitative Metabolic Models","245574659":"Automatic Aggregation of QualitativeReasoning Networks","263242002":"Explanation-Based Learning and Reinforcement Learning: A Unified View","2309761":"Learning to Take Actions","220660610":"Autonomous Agents that Learn to Better Coordinate","220815247":"Towards a General Framework for Composing Disjunctive and Iterative Macro-operators.","220813209":"Learning General Search Control from Outside Guidance.","220344209":"A Study of Explanation-Based Methods for Inductive Learning.","2523797":"CaMeL: Learning Method Preconditions for HTN Planning","220080041":"Adaptive Search through Constraint Violations","235061433":"Putting It All Together: Final Comments","2663062":"Learning Efficient Query Processing Strategies","220474266":"Finding and transferring policies using stored behaviors","220480484":"Modeling Novice-to-Expert Shifts in Problem-Solving Strategy and Knowledge Organization","220881897":"Perception-based approach in recognition of structured patterns","254024162":"Controlling a humanoid robot in home environment with a cognitive architecture","225517497":"A selected artificial intelligence bibliography for operations researchers","3281659":"Learning by an autonomous robot at a process control panel","220106707":"Adaptive agent tracking in real-world multiagent domains: A preliminary report","220814311":"Failsafe - A Floor Planner that Uses EBG to Learn from Its Failures.","220554230":"The centrality of autonomous agents in theories of action under uncertainty","271453946":"Incremental Rule Chunking for Problem Solving","36260095":"The replay of program derivations /","2947834":"Integrating planning and learning: The PRODIGY architecture","222488474":"Finding optimal derivation strategies in redundant knowledge bases","228955001":"Cognitive Flexibility through Learning from Constraint Violations","222463902":"Investigating production system representations for non-combinatorial match","2734838":"Inductive Learning Using Generalized Distance Measures","242074767":"Some Frontiers of Cognitive Modeling: A Modest Research Agenda Exploring Emotions and Usability","221539281":"Networks at Work: A Connectionist Approach to Non-Deductive Legal Reasoning.","2337477":"Toward Incremental Knowledge Correction for Agents in Complex Environments","23389066":"Hiearchically organized behavior and its neural foundations: A reinforcement learning perspective","220566485":"Explanation-Based Learning: A Survey of Programs and Perspectives.","225727367":"Interactive support for planning visual programs in the problem solving monitor ABSYNT giving feedback to user hypotheses on the language level","226604914":"Explanation Generalization in EGGS","223015871":"Learning plans for an intelligent observing user behavior","221437895":"Intelligent Architectures for Knowledge Sharing: A Soar Example and General Issues.","2527955":"How to Do the Right Thing","282057273":"Student Modeling and Machine Learning","222903230":"Quantitative results concerning the utility of explanation-based learning","242247817":"iCORE Research Grant Proposal Reinforcement Learning and Artificial Intelligence","3498703":"KSL: a reflective object-oriented programming language","220541913":"Learning to Solve Problems from Exercises.","223915942":"Measurement of object-oriented software spatial complexity","220547035":"An Apprentice-Based Approach to Knowledge Acquisition.","222773176":"A neural model of frontostriatal interactions for behavioural planning and action chunking","220479451":"The challenge of complexity for cognitive systems","2807594":"Systematic Approach to the Design of Representation-Changing Algorithms","2617124":"Spoken Word Recognition: A Combined Computational and Experimental Approach","2648875":"Experience, Introspection, and Expertise: Learning to Refine the Case-Based Reasoning Process","228603556":"Incremental learning of control knowledge for improvement of planning efficiency and plan quality","220629539":"A Skill Refinement Learning Model for Rule-Based Expert Systems","268377334":"Interoperating Learning Mechanisms in a Cognitive Architecture","2250543":"Combining FOIL and EBG to speed up logic programs","3113761":"Unsupervised Credit Assignment in Knowledge-Based Sensor Fusion Systems","257581140":"Effective and efficient forgetting of learned knowledge in Soar’s working and procedural memories","234785512":"Soar/PSM-E: investigating match parallelism in a learning production sytsem","220108296":"Cognitive Primitives.","221604396":"On the Masking Effect.","220483134":"Reflection and Hyper-Programming in Persistent Programming Systems","2724661":"Failure-Driven Learning As Model-Based Self-Redesign","3495722":"A computational view of group problem saving","2650935":"Symbolic Performance \u0026 Learning In Continuous-valued Environments","221562388":"Computational Reflection","222448227":"On the Role of Biomedical Knowledge in Clinical Reasoning by Experts, Intermediates and Novices","228095675":"Compositional Planning Using Optimal Option Models","220547584":"Learning in Mathematically-Based Domains: Understanding and Generalizing Obstacle Cancellations.","220343813":"Classifier Systems and the Animat Problem","287108662":"Learning Feature-Based Heuristic Functions","220814876":"Selective Learning of Macro-operators with Perfect Causality.","238687494":"Versatile Kernels for Aspect-Oriented Programming","223804010":"Model of fault diagnosis performance of expert marine engineers","2389784":"Learning in Deduction by Knowledge Migration and Shadowing","2863983":"Experience- and Model-based Transformational Learning of Symbolic Behavior Specifications","221603442":"Knowledge Level Learning in Soar.","267794609":"Computermodelle des Denkens und Problemlösens","267572411":"Transitional feedback schedules during computer-based problem-solving practice","50830413":"The AHA! Experience: Creativity Through Emergent Binding in Neural Networks","265025668":"Integrating Representation Learning and Skill Learning in a Human-Like Intelligent Agent","266067080":"Learning from Failures for Cognitive Flexibility","228694774":"Learning with Fuzzy Definitions of Goals","2766717":"Using Experience-Based Learning in Game Playing","45651424":"A symbolic/subsymbolic interface protocol for cognitive modeling","228572870":"Learning Planning Operators and Acting in Stochastic Domains","2298751":"Combining Left and Right Unlinking for Matching a Large Number of Learned Rules","253421691":"Learning Hierarchical Skills from Problem Solutions Using Means-Ends Analysis","226558690":"Book ReviewLearning Search Control Knowledge: An Explanation-Based Approach, by Steven Minton. Kluwer Academic Publishers, 1988, 214 pages","226434588":"Bioinspired framework for general-purpose learning","215502779":"Automated Discovery of Options in Factored Reinforcement Learning","249678213":"Electronic Mail and Scientific Communication: A Study of the Soar Extended Research Group","2766670":"Metaprogramming Forced Moves","35973443":"Autonomous discovery of temporal abstractions from interaction with an environment /","226756323":"Philosophical and computational models of explanation","34690429":"Hierarchical Reinforcement in Continuous State and Multi-Agent Environments","221612633":"Learning Qualitative Models of Physical and Biological Systems","235098483":"A Unified Framework for Planning and Learning","225802756":"PRODILOGY/ANALOGY: Analogical reasoning in general problem solving","2397015":"Knowledge Representation in Machine Learning","220343894":"Learning to Perceive and Act by Trial and Error","222121547":"A formal analysis of machine learning systems for knowledge acquisition","2600799":"Continual Learning In Reinforcement Environments","220801616":"Layered Approximation Approach to Knowledge Elicitation in Machine Learning.","222630463":"Plans and Semantics in Human Processing of Language","271995723":"MACHINERY FOR ARTIFICIAL EMOTIONS","228919847":"Scaling reinforcement learning systems","237104546":"Relational Learning by Observation","228416024":"Representing and Reasoning over Time in a Unified Cognitive Architecture","220343973":"Explanation-Based Generalization: A Unifying View","19979959":"A graph-dynamic model of the power law of practice and the problem-solving fan-effect","279721760":"Categorization, Concept Learning, and Problem-Solving: A Unifying View","230670898":"Proactive Action Preparation: Seeing Action Preparation as a Continuous and Proactive Process","2292653":"Automated Acquisition of Control Knowledge to Improve the Quality of Plans","220343986":"The changing science of machine learning","2903996":"A Theory of Unsupervised Speedup Learning","30869057":"Artificial Intelligence at Edinburgh University","232537668":"The Chunking of Skill and Knowledge","220343998":"On-Line Learning from Search Failures.","3296172":"PM: A System to Support the Automatic Acquisition of Programming Knowledge","222489312":"A Preliminary Analysis of the Soar Architecture as a Basis for General Intelligence","221603472":"PROLEARN: Towards a Prolog Interpreter that Learns.","242916829":"Learning search control knowledge: An explanation-based approach","2520961":"Learning Strategy Knowledge Incrementally","221438619":"Subgoal Discovery for Hierarchical Reinforcement Learning Using Learned Policies.","220701321":"Creating High Level Knowledge Structures from Simple Elements.","27523596":"Learning to Troubleshoot: Multistrategy Learning of Diagnostic Knowledge for a Real-World Problem-Solving Task","266487894":"Assistenz durch selbstbeschreibende Software","225180371":"Learning Teleoreactive Logic Programs from Problem Solving","241628633":"Problem solving and learning for a humanoid robot","252813524":"Learning Hierarchical Skills for Game Agents from Video of Human Behavior","223097483":"A structural theory of explanation-based learning","2365411":"Learning Procedural Knowledge to Better Coordinate","222468746":"Training sequences","220816099":"CYPRESS-Soar: A Case Study in Search and Learning in Algorithm Design.","2921446":"A Formalization of Explanation-Based Macro-operator Learning","220142287":"Planning and execution of tasks for a domestic robot","221218558":"Metacognition in computation: A selected history","263329888":"Episodic indexing: a model of memory for attention events - A revised model of visual search","220815101":"Towards a Model of Grounded Concept Formation.","2441202":"Automatically Generating Abstractions for Problem Solving","251248928":"HEBBIAN NEURON GRIDS: SYSTEM THEORETIC APPROACH","2257912":"Learning Design Rules For Wind Bracings In Tall Buildings","2753521":"Explanation-Based Learning and Reinforcement Learning: A Unified View","228632189":"Interleaving Learning, Problem-Solving, and Execution in the ICARUS Architecture","220637947":"Learning, Goals, and Learning Goals: A Perspective on Goal-Driven Learning.","242817447":"Building a chemical process design system within soar—1. Design issues","259636391":"Interview with Peter Stone and Matthew E. Taylor","35942852":"Coaching : learning and using environment and agent models for advice /","221605588":"A Frameworkfor Investigating Production System Formulations with Polynomially Bounded Match.","235050464":"An Integrated Cognitive Architecture for Autonomous Agents","2742220":"Systematic Experimentation with Deductive Learning: Satisficing vs. Optimizing search","220815041":"Combining Weak Learning Heuristics in General Problem Solvers.","284493598":"Means-Ends Planning: An Example Soar System","2806746":"Planning with Closed-Loop Macro Actions","222468785":"Pragmatic Action","222481078":"On the Interaction of Theory and Data in Concept Learning","235091448":"Theory of Endorsements and Reasoning with Uncertainty","220344031":"A Heuristic Approach to the Discovery of Macro-Operators.","224296608":"Transfer of policies based on trajectory libraries","258407576":"Autonomic and Trusted Computing"},"index":590}