{"abs":"It is not unusual that an approximate model is needed for fitness evaluation in evolutionary computation. In this case, the convergence properties of the evolutionary algorithm are unclear due to the approximation error of the model. In this paper, extensive empirical studies are carried out to investigate the convergence properties of an evolution strategy using an approximate fitness function on two benchmark problems. It is found that incorrect convergence will occur if the approximate model has false optima. To address this problem, individual- and generation-based evolution control are introduced and the resulting effects on the convergence properties are presented. A framework for managing approximate models in generation-based evolution control is proposed. This framework is well suited for parallel evolutionary optimization, which is able to guarantee the correct convergence of the evolutionary algorithm, as well as to reduce the computation cost as much as possible. Control of the evolution and updating of the approximate models are based on the estimated fidelity of the approximate model. Numerical results are presented for three test problems and for an aerodynamic design example","title":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","id":3418714,"url":"https://www.researchgate.net/publication/3418714_A_framework_for_evolutionary_optimization_with_approximate_fitness_functions_IEEE_Trans_Evol_Comput","names":["Yaochu Jin","Markus Olhofer","Bernhard Sendhoff","IEEE Transactions on Evolutionary Computation"],"references":{"3642935":"Adapting arbitrary normal mutation distributions in evolution strategies: The covariance matrix adaptation","2375460":"A Multi-Stage Approach for the Thermal Generator Maintenance Scheduling Problem","220375075":"Completely Derandomized Self-Adaptation in Evolution Strategies","226129532":"Actuator placement based on reachable set optimization for expected disturbance","226464504":"Design by natural selection","3418942":"Interactive Evolutionary Computation-Based Hearing Aid Fitting","37811275":"The Origins Order. Self-Organization and Selection in Evolution","2385583":"A Rigorous Framework for Optimization of Expensive Functions by Surrogates","201975941":"A Connectionist Machine for Genetic Hill-Climbing","2748217":"Managing Approximation Models in Optimization","3810347":"Optimal sampling strategies for learning a fitness model","246121913":"Evolutionary Computation: Toward a New Philosophy of Machine Intelligence, IEEE Press, Piscatway, NJ","220720947":"Artificial Evolution for Computer Graphics. Computer Graphics 25:319-328","227085212":"Approximation Concepts for Optimum Structural Design -A Review","220694079":"The Nurbs Book","3810214":"“An updated survey of evolutionary multiobjective optimization techniques: State of the art and future trends,” in: Congress on evolutionary computation","245091588":"A summary of research on parallel ge-netic algorithms","2455557":"Information--Based Objective Functions for Active Data Selection","2342018":"GenJam: A Genetic Algorithm for Generating Jazz Solos","220375041":"A Derandomized Approach to Self-Adaptation of Evolution Strategies","220740621":"On Evolutionary Optimization with Approximate Fitness Functions.","243628576":"A summary of Research on Parallel Genetic Algorithms","226106204":"On Model-Based Evolutionary Computation","236365884":"Mathematical Programming The State of the Art","226337873":"A comparison of polynomial approximations and artificial neural nets as response surfaces","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","247074186":"Optimisation of a Stator Blade Used in a Transonic Compressor Cascade with Evolution Strategies","220742553":"Heuristics for Evolutionary Off-line Routing in Telecommunication Networks.","216300624":"Evolution Computation: Toward a New Philosophy of Machine Intelligence","2266395":"Active Learning in Multilayer Perceptrons","3810428":"Evolutionary design of electronic devices and circuits","243723471":"Optimization with Genetic Algorithm Hybrids that Use Local Search","220701677":"Accelerating the Convergence of Evolutionary Algorithms by Fitness Landscape Approximation.","3810417":"A multi-stage approach for the thermal generator maintenance scheduling problem","2516586":"An Updated Survey of Evolutionary Multiobjective Optimization Techniques :","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","2807160":"GP-Music: An Interactive Genetic Programming System for Music Generation with Automated Fitness Raters","5583875":"Selecting Concise Training Sets from Clean Data","226846290":"Optimal sizing, geometrical and topological design using a genetic algorithm","269078354":"Genetic algorithms in multidisciplinary rotor blade design","245435132":"Response Surface and Neural Network Techniques for Rocket Engine Injector Optimization","2852086":"Evolutionary Parameter Optimization for Visual Obstacle Detection","264923669":"Genetic Algorithms, Noise, and the Sizing of Populations","236822466":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","2627148":"Evolutionary Search of Approximated N-Dimensional Landscapes","2268869":"An Updated Survey of Evolutionary Multiobjective Optimization Techniques: State of the Art and Future Trends","31104170":"An Automatic Method for Finding Greatest or Least Value of a Function","239400118":"Turbomachinery Blade Design Using a Navier–Stokes Solver and Artificial Neural Network","2824153":"Improving Generalization Ability through Active Learning","3556037":"Graphic object layout with interactive genetic algorithms","201976957":"Evolutionary Algorithms in Theory and Practice","5602080":"Statistical active learning in multilayer perceptrons","243694587":"A Version of the Bundle Idea for Minimizing a Nonsmooth Function: Conceptual Idea, Convergence Analysis, Numerical Results"},"citedIn":{"237337637":"Research Topics on Evolution and Learning at Honda Research Institute Europe","4089918":"Neural network regularization and ensembling using multi-objective evolutionary algorithms","4201537":"Multi-objective evolutionary optimization of subsonic airfoils by kriging approximation and evolution control","224330077":"Reducing Function Evaluations in Differential Evolution using Rough Approximation-Based Comparison","265978841":"Assessment of an hybrid multi-objective pattern search filter method","224049497":"Evolutionary Optimization of Computationally Expensive Problems via Surrogate Modeling","3421747":"Combining global and local surrogate models to accelerate evolutionary optimization. IEEE Trans Syst Man Cybern Part C Appl Rev","225156972":"Genesis of Organic Computing Systems: Coupling Evolution and Learning","250752255":"EVOLUTIONARY ALGORITHMS WITH SURROGATE MODELING FOR COMPUTATIONALLY EXPENSIVE OPTIMIZATION PROBLEMS","221008162":"Tchebycheff Approximation in Gaussian Process Model Composition for Multi-objective Expensive Black Box","255909714":"Toward the Coevolution of Novel Vertical-Axis Wind Turbines","276834453":"Structure and fluid optimization of the guide vane blade with the decomposition of the optimization problem","221009210":"Decreasing the Number of Evaluations in Evolutionary Algorithms by Using a Meta-model of the Fitness Function","268215787":"Efficient PCA-driven EAs and metamodel-assisted EAs, with applications in turbomachinery","258399601":"Automatic Circle Detection on Images Based on an Evolutionary Algorithm That Reduces the Number of Function Evaluations","274706503":"An Evolutionary Approach with Surrogate Models and Network Science Concepts to Design Optical Networks","18201865":"[Effect of the strong doses of triated thymidine on development and the chromosomes of the triton Pleurodeles waltlii Michah].","221165363":"Synergies between Evolutionary and Neural Computation.","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","245426307":"Fast Evolutionary Algorithm for Airfoil Design via Neural Network","261527472":"Multi-modal optimisation using a localised surrogates assisted evolutionary algorithm","4075030":"Global convergence of unconstrained and bound constrained surrogate-assisted evolutionary search in aerodynamic shape design","224301936":"Surrogate based EA for expensive optimization problems","4075022":"DAFHEA: a dynamic approximate fitness-based hybrid EA for optimisation problems","4075023":"A framework for optimization using approximate functions","224301933":"DE-AEC: A differential evolution algorithm based on adaptive evolution control","6532182":"Functional brain imaging with BOSS FMRI","221616386":"Metamodel-Assisted Global Search Using a Probing Technique.","2922005":"Evolution Strategies assisted by Gaussian Processes with Improved Pre-Selection Criterion","221276938":"An Efficient Differential Evolution Algorithm with Approximate Fitness Functions Using Neural Networks","267654095":"Automated design of analog and high-frequency circuits. A computational intelligence approach","222712701":"Automatic Tuning of Agent-Based Models Using Genetic Algorithms","229714314":"Efficient optimization processes using kriging approximation models in electrical impedance tomography","261499306":"Efficient constrained optimization by the ε constrained differential evolution with rough approximation using kernel regression","256276346":"An overview of population-based algorithms for multi-objective optimisation","241113696":"Numerical assessment of metamodelling strategies in computationally intensive optimization","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","30512020":"Le calibrage de modèles à base d\u0027agents pour la simulation de systèmes complexes.","257392402":"Hoeffding bound based evolutionary algorithm for symbolic regression","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","259170620":"How can surrogates influence the convergence of evolutionary algorithms?","224330000":"Metamodel Accuracy Assessment in Evolutionary Optimization","257392388":"A computational intelligence algorithm for expensive engineering optimization problems","225111358":"Vibration Control of Suspension System Based on a Hybrid Intelligent Control Algorithm","221411175":"A Hybrid Multi-Objective Evolutionary Algorithm Using an Inverse Neural Network.","221608800":"A Classifier-Assisted Framework for Expensive Optimization Problems: A Knowledge-Mining Approach","262328308":"An evolution strategy assisted by an ensemble of local Gaussian process models","235892312":"Expensive Optimisation: A Metaheuristics Perspective","267175348":"Evolutionary Multi-Multi-Objective Optimization - EMMOO","221228406":"Multiobjective Optimization on a Budget of 250 Evaluations","220285304":"Grid enabled, hierarchical distributed metamodel-assisted evolutionary algorithms for aerodynamic shape optimization","273474071":"Surrogate assisted-hybrid differential evolution algorithm using diversity control","261131215":"Pareto Rank Learning in Multi-objective Evolutionary Algorithms","224301825":"Non-separable fitness functions for evolutionary shape optimization Benchmarking","239392295":"A Multi-Objective Metamodel-Assisted Memetic Algorithm with Strength-based Local Refinement","241515526":"A Study on Metamodeling Techniques, Ensembles, and Multi-Surrogates in Surrogate-Assisted Memetic Algorithms","235694698":"State of the Art for Genetic Algorithms and Beyond in Water Resources Planning and Management","221008709":"Functionalization of microarray devices: Process optimization using a multiobjective PSO and multiresponse MARS modeling","220741955":"Validating a Model of Colon Colouration Using an Evolution Strategy with Adaptive Approximations","263656922":"Multi-disciplinary Shape Optimization of an Entry Capsule Integrated with Custom neural Network Approximation and Multi-fidelity Approach","237150284":"Sampling strategies in ordinal regression for surrogate assisted evolutionary optimization","228707279":"Metamodel-Assisted Simulation-Based Optimization of a Real-World Manufacturing Problem","253178233":"Optimal Groundwater Remediation Design Using Trust Region Based Meta models within a Genetic Algorithm","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","4283439":"Adaptive Fuzzy Fitness Granulation in Structural Optimization Problems","277818592":"Update-based evolution control: A new fitness approximation method for evolutionary algorithms","49798279":"Multi-Objective Reliability-Based Optimization with Stochastic Metamodels","242392582":"Evolutionary-based multi-objective meta-model approach for rainfall-runoff model calibration","268484729":"Embedding Neural Networks in Multiobjective Genetic Algorithms for Water Distribution System Design","28351434":"Evolution von Laufrobotersteuerungen mit Genetischer Programmierung","220714332":"Multi-processor system-on-chip Design Space Exploration based on multi-level modeling techniques","258724624":"Review of surrogate modeling in water resources Water Resources Research 48:n/a-n/a","221165392":"Efficient evolutionary optimization using individual-based evolution control and neural networks: A comparative study","238767173":"Artificial Intelligence and Computational Intelligence - International Conference, AICI 2010, Sanya, China, October 23-24, 2010, Proceedings, Part II","259911678":"A simulated annealing algorithm based approach for balancing and sequencing of mixed-model U-lines","220381096":"Max-Min Surrogate-Assisted Evolutionary Algorithm for Robust Design","256721350":"Evolutionary algorithm assisted by surrogate model in the framework of ordinal optimization and optimal computing budget allocation","220702133":"Ordinal Regression in Evolutionary Computation","223849924":"CFD-based analysis and two-level aerodynamic optimization on graphics processing units","221112248":"Explicit Local Models: Towards \"Optimal\" Optimization Algorithms.","220381108":"Local Function Approximation in Evolutionary Algorithms for the Optimization of Costly Functions","225984495":"A grid-enabled asynchronous metamodel-assisted evolutionary algorithm for aerodynamic optimization","279661106":"Efficiency Improvement of Evolutionary Multiobjective Optimization Methods for CFD-Based Shape Optimization","220176770":"Memetic algorithm using multi-surrogates for computationally expensive optimization problems. Soft Comput","4358368":"Efficient MOEAs with an Adaptive Sampling Technique in Searching Robust Optimal Solutions","280622619":"A Surrogate-Assisted Evolutionary Algorithm Based on the Genetic Diversity Objective","225648080":"A Model-Assisted Memetic Algorithm for Expensive Optimization Problems","272397471":"Numerische Optimierung elektrifizierter Antriebsstränge","221006731":"A Similarity-based Surrogate Model for Expensive Evolutionary Optimization with Fixed Budget of Simulations","220316557":"A Multi-Objective Evolutionary Algorithm Using Neural Networks to Approximate Fitness Evaluations.","262826244":"Multi-objective memetic algorithm: Comparing artificial neural networks and pattern search filter method approaches","220741511":"A Pareto Following Variation Operator for Fast-Converging Multiobjective Evolutionary Algorithms","233775451":"Exploiting Genomic Knowledge in Optimising Molecular Breeding Programmes: Algorithms from Evolutionary Computing","273396479":"A New Memetic Algorithm With Fitness Approximation for the Defect-Tolerant Logic Mapping in Crossbar-Based Nanoarchitectures","223385573":"Optimal design of aeroengine turbine disc based on kriging surrogate models","4201722":"A study on polynomial regression and Gaussian Process global surrogate model in hierarchical surrogate-assisted evolutionary algorithm","228648733":"A CASE STUDY OF USING SIMULATION AND SOFT COMPUTING TECHNIQUES FOR OPTIMISATION OF MANUFACTURING SYSTEMS","221008275":"Classification-assisted Differential Evolution for computationally expensive problems","242323150":"Se han utilizado las siguientes claves para denotar los tipos de publicaciones en que cada trabajo fue referenciado: LIB ING \u003d Libro en ing´ es, JOUR INT \u003d Journal Internacional, CONG INT \u003d Congreso Internacional, CONG NAC \u003d Congreso Na","253023189":"Artificial neural networks and genetic algorithms in engineering design","220741610":"A study on metamodeling techniques, ensembles, and multi-surrogates in evolutionary computation","220509670":"Knowledge-based fast evaluation for evolutionary learning.","267669302":"Success in evolutionary computation","235770575":"Algorithm for Increasing the Speed of Evolutionary Optimization and its Accuracy in Multi-objective Problems","220320738":"Evolutionary Model Type Selection for Global Surrogate Modeling","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","2948847":"Evolution Strategies with Controlled Model","220701668":"Comparison of Steady-State and Generational Evolution Strategies for Parallel Architectures.","228951393":"Resource-Aware Parameterizations of EDA","257758617":"Gaussian process assisted coevolutionary estimation of distribution algorithm for computationally expensive problems","23493038":"Array-based evolution of DNA aptamers allows modelling of an explicit sequence-fitness landscape","4090102":"Evolution strategies with controlled model assistance","261447517":"Towards the evolution of novel vertical-axis wind turbines","257439633":"Multi-objective Optimization Design of Wing Structure with the Model Management Framework","236962001":"A surrogate-model based multi-disciplinary shape optimization method with application to a 2D subsonic airfoil","238719733":"Multikriterielle Optimierung mit lambda-geregelten modellgestützten Evolutionsstrategien (Model Assisted Multiobjective Optimization with lambda-Control)","220743160":"Model-Assisted Steady-State Evolution Strategies","227111256":"The design and analysis of complex system neural network metamodels","232237830":"Evolutionary multimodal optimization using the principle of locality","221905385":"Surrogate-Assisted Artificial Immune Systems for Expensive Optimization Problems","4090093":"Performance of kriging and cokriging based surrogate models within the unified framework for surrogate assisted optimization","221061113":"A correlation-based design space exploration methodology for multi-processor systems-on-chip","238688493":"A fast Evolutionary-based Meta-Modelling Approach for the Calibration of a Rainfall-Runoff Model","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","220880371":"Meta-model Assisted Optimization for Design Space Exploration of Multi-Processor Systems-on-Chip","282382349":"Runner Development for the YBBS 2020 Rehabilitation Project at Ybbs-Persenbeug Power Plant in Austria","280557155":"Multifidelity Physics-Based Method for Robust Optimization Applied to a Hovering Rotor Airfoil","2876151":"Hierarchical Surrogate-Assisted Evolutionary Optimization Framework","228706625":"Effectiveness of weighted aggregation of objectives for evolutionary multiobjective optimization: methods, analysis and applications","221160910":"Fuzzy cerebellar model articulation controller (FCMAC) for vibration control on ocean engineering vehicles","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","220740556":"Improved Image Halftoning Technique Using GAs with Concurrent Inter-block Evaluation","250096641":"Application of Free Form Deformation Techniques in Evolutionary Design Optimisation","264961313":"Modeling and optimization. Theory and applications. Selected contributions from the MOPTA 2012 conference, Bethlehem, PA, USA, July 30 – August 1, 2012","228520309":"Optimization by gaussian processes assisted evolution strategies","264942369":"Single and Multi-Objective Approaches to 3D Evolutionary Aerodynamic Design Optimization","233529605":"Increasing the Density of Available Pareto Optimal Solutions","260711290":"An Efficient Method for Antenna Design Optimization Based on Evolutionary Computation and Machine Learning Techniques","261369702":"Pareto Front Estimation for Decision Making","4375735":"Prediction of Convergence Dynamics of Design Performance using Differential Recurrent Neural Networks","225379736":"Hybrid evolutionary algorithm with hermite radial basis function interpolants for computationally expensive adjoint solvers. Comput Optim Appl","225602949":"An efficient evolutionary optimisation framework applied to turbine blade firtree root local profiles","271738053":"A two-layer surrogate-assisted particle swarm optimization algorithm","284014098":"A knowledge-based evolutionary proactive scheduling approach in the presence of machine breakdown and deterioration effect","28358320":"Controlled Model Assisted Evolution Strategy with Adaptive Preselection","224472164":"A Comparative Study on Kernel Smoothers in Differential Evolution With Estimated Comparison Method for Reducing Function Evaluations","224177748":"Efficient multi-objective optimization with fitness landscape — A special application to the optimal design of alloy-steels","4074804":"Comparing neural networks and Kriging for fitness approximation in evolutionary optimization","220740642":"Evolutionary algorithms for dynamic optimization problems: workshop preface.","242677117":"Meta Model Based EA for Complex Optimization","220742181":"Expensive optimization, uncertain environment: An EA-based solution","224572019":"An effective intelligent algorithm for stochastic optimization problem","220981818":"An improved local best searching in Particle Swarm Optimization using Differential Evolution.","229659299":"Hierarchical distributed metamodel‐assisted evolutionary algorithms in shape optimization","227114128":"Multiobjective Metamodel–Assisted Memetic Algorithms","255686688":"Robust Design of a Reentry Unmanned Space Vehicle by Multifidelity Evolution Control","228405437":"Finding the Optimal Search Dimension for Evolution Strategies with A Small Population","4375906":"Automatic Model Type Selection with Heterogeneous Evolution: An application to RF circuit block modeling","254379016":"METAMODEL-ASSISTED MULTI-OBJECTIVE EVOLUTIONARY OPTIMIZATION","3418902":"Efficient search for robust solutions by means of evolutionary algorithms and fitness approximation","222547040":"A probabilistic cooperative–competitive hierarchical model for global optimization","248808944":"Uncertainty-based multiobjective optimization of groundwater remediation design. Water Resour Res 44:W02,404","220045368":"Enhanced Evolutionary Algorithms for Multidisciplinary Design Optimization: A Control Engineering Perspective","224645706":"Trusted Evolutionary Algorithm","257405053":"DS-DPSO: A dual surrogate approach for intelligent watermarking of bi-tonal document image streams","268157142":"Large-scale parallelization of the Borg multiobjective evolutionary algorithm to enhance the management of complex environmental systems","251894327":"Adaptive RBFN model for 2D spatial interpolation","257635951":"Blood sugar regularization based evolutionary algorithm for data classification","232620264":"Accelerating Particle Swarm Optimization Algorithms Using Gaussian Process Machine Learning","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","3418893":"Max-min surrogate-assisted evolutionary algorithm for robust design","263269002":"An analysis of the impact of the initial sample on evolutionary metamodel-assisted optimization","40535381":"Evolution und Lernen zur Optimierung neuronaler Strukturen","262605029":"Evolutionary Programming for High-Dimensional Constrained Expensive Black-Box Optimization Using Radial Basis Functions","5303060":"Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria","233967286":"Towards the Evolution of Novel Vertical-Axis Wind Turbines","228858082":"A Kriging Metamodel Assisted Multi-Objective Genetic Algorithm for Design Optimization","220291686":"A computational intelligence algorithm for simulation-driven optimization problems","221047397":"Gaussian Process Assisted Differential Evolution Algorithm for Computationally Expensive Optimization Problems.","289626122":"Reducing the Number of Simulations in Operation Strategy Optimization for Hybrid Electric Vehicles","273186054":"Numerical Optimisation of Electro Hybrid Powertrains","224570930":"A systems approach to evolutionary multiobjective structural optimization and beyond","224570931":"Closed-loop evolutionary multiobjective optimization","223184920":"Performance evaluation of efficient multi-objective evolutionary algorithms for design space exploration of embedded computer systems","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","257635852":"Parameter control system of evolutionary algorithm that is aided by the entire search history","261197001":"Self-adaptive lower confidence bound: A new general and effective prescreening method for Gaussian Process surrogate model assisted evolutionary algorithms","259716640":"Stochastic Optimisation of America\u0027s Cup Class Yachts","221278827":"A Design Space Exploration Methodology Supporting Run-Time Resource Management for Multi-Processor Systems-on-Chip","221494383":"On the Performance of Metamodel Assisted MOEA/D","254230087":"Reduced order model assisted evolutionary algorithms for multi-objective flow design optimization","220870731":"NN-Based GA for Engineering Optimization.","2889038":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","268270233":"An Investigation on Two Surrogate-based EAs","240620851":"Un etat des lieux de l\u0027optimisation evolutionnaire et de ses implications en sciences pour l\u0027ingenieur","267819667":"You can judge a book by its cover – Evolution of gait controllers based on program code analysis","285965923":"An Initialization Strategy for High-Dimensional Surrogate-Based Expensive Black-Box Optimization","51464312":"Method for Optimizing Coating Properties Based on an Evolutionary Algorithm Approach","220702283":"Constrained Evolutionary Optimization by Approximate Ranking and Surrogate Models","220702281":"Local Meta-models for Optimization Using Evolution Strategies","221025346":"Real-World Applications of Multiobjective Optimization","278697453":"Electromagnetic Design Automation: Surrogate Model Assisted Evolutionary Algorithm","223853092":"A hybrid genetic algorithm–neural network strategy for simulation optimization","253383273":"A Framework for Accurate Geospatial Modeling of Recharge and Discharge Maps using Image Ranking and Machine Learning","2602835":"Artificial Intelligence Technologies in Complex Engineering Design","29601462":"Parameter Space Exploration of Agent-Based Models","272374601":"Multi objective optimization of computationally expensive multi-modal functions with RBF surrogates and multi-rule selection","266656415":"Generational neuro-evolution: Restart and retry for improvement","224916508":"Evolution by Adapting Surrogates","227210998":"On Similarity-Based Surrogate Models for Expensive Single- and Multi-objective Evolutionary Optimization","3421621":"Accelerating Evolutionary Algorithms With Gaussian Process Fitness Function Models","229356066":"Generator approach to evolutionary optimization of catalysts and its integration with surrogate modeling","240821719":"Quality Measures for Approximate Models in Evolutionary Computation","263123488":"An algorithm for computationally expensive engineering optimization problems","263430204":"On Using Surrogates with Genetic Programming","225666274":"A Memetic Algorithm Using a Trust-Region Derivative-Free Optimization with Quadratic Modelling for Optimization of Expensive and Noisy Black-box Functions","221432993":"Comparison of Global Optimization Methods for Drag Reduction in the Automotive Industry","263679522":"Multi-Objective Optimization of Bulk Vinyl Acetate Polymerization with Branching","239798227":"A hybrid model-classifier framework for managing prediction uncertainty in expensive optimisation problems","3421615":"Knowledge-Based Fast Evaluation for Evolutionary Learning","4307930":"Construction of surrogate model ensembles with sparse data","257479364":"A genetic algorithm with neural network fitness function evaluation for IMRT beam angle optimization","32173687":"Automotive Engine Calibration with Experiment-Based Evolutionary Multi-objective Optimization","259527910":"STOCHASTIC OPTIMISATION OF AMERICA\u0027S CUP CLASS YACHTS","239798229":"Centroid-based memetic algorithm – adaptive Lamarckian and Baldwinian learning","239798228":"A low-cost evolutionary algorithm for the unit commitment problem considering probabilistic unit outages","258329796":"Organic Computing","230872675":"Mathematical Aspects of CFD-Based Optimization","239407586":"Multi-objective evolutionary optimization of subsonic airfoils by meta-modelling and evolution control","35459509":"Sustainable evolutionary algorithms and scalable evolutionary synthesis of dynamic systems /","266652748":"Aerodynamic shape design using hybrid evolutionary computation and fitness approximation","277597991":"A systematic approach to determining metamodel scope for risk-based optimization and its application to water distribution system design","220754584":"Inter-block evaluation method in multi-level image halftoning technique using GA","261202465":"Multi co-objective evolutionary optimization: Cross surrogate augmentation for computationally expensive problems","227102777":"Machine Learning for Global Optimization","232362088":"Successive approximate model based multi-objective optimization for an industrial straight grate iron ore induration process using evolutionary algorithm","257680622":"Classification- and Regression-Assisted Differential Evolution for Computationally Expensive Problems","248808801":"Optimal groundwater remediation design using an Adaptive Neural Network Genetic Algorithm. Water Resour Res 42(5):W05407","3665281":"System overview and applications of a panoramic imaging perimeter sensor","227047473":"Improving Local Convergence in Particle Swarms by Fitness Approximation Using Regression","231214195":"A New Surrogate-Assisted Interactive Genetic Algorithm With Weighted Semisupervised Learning","226738239":"Multilevel Optimization Algorithms Based on Metamodel- and Fitness Inheritance-Assisted Evolutionary Algorithms","280304905":"SMAS: A Generalized and Efficient Framework for Computationally Expensive Electronic Design Optimization Problems","225410770":"Evolutionary Shape Optimization Using Gaussian Processes","261021233":"Parametric reconfigurable designs with Machine Learning Optimizer","271736819":"Evolutionary robustness analysis for multi-objective optimization: Benchmark problems","225989818":"An Evolutionary Multi-objective Adaptive Meta-modeling Procedure Using Artificial Neural Networks","225852085":"Reducing Function Evaluations Using Adaptively Controlled Differential Evolution with Rough Approximation Model","271880689":"Memetic algorithms and memetic computing optimization: A literature review","224281752":"Fuzzy Cerebellar Model Articulation Controller (FCMAC) for Vibration Control of Semi-Active Suspension System","38092675":"Multi-objective optimization with controlled model assisted evolution strategies","280695677":"Evolutionary Multimodal Optimization: A Short Survey","51872477":"Neuroevolutionary reinforcement learning for generalized control of simulated helicopters","270276055":"Problems Detected by a Ripple-Down Rules Based Medication Review Decision Support System: Are They Relevant?","240630683":"Design Space Exploration of Multi-Processor Systems-on-Chip","233661472":"A framework for design optimization using surrogates","3885557":"Interaction of hemodynamics and gas exchange: a computer simulation","261096000":"An improved local best searching in Particle Swarm Optimization using Differential Evolution","236177858":"JavaEvA A Java based framework for Evolutionary Algorithms","225736364":"A framework for memetic optimization using variable global and local surrogate models","226058401":"A Metamodel-Assisted Steady-State Evolution Strategy for Simulation-Based Optimization","269387735":"An adaptive-topology ensemble algorithm for engineering optimization problems","263656557":"Robust multi-fidelity design of a micro re-entry unmanned space vehicle","264174181":"Simulation, analysis and optimal design of fuel tank of a locomotive","250028807":"Multi-Objective Optimization: Hybridization of an Evolutionary Algorithm with Artificial Neural Networks for fast Convergence","221837016":"Resampling Methods for Meta-Model Validation with Recommendations for Evolutionary Computation","256719021":"Low cost surrogate model based evolutionary optimization solvers for inverse heat conduction problem","235903469":"Evolutionary Approaches to Expensive Optimisation","262841416":"Comparative analysis of Direct Adaptive-NSGA-II \u0026 NSGA-II Optimization Algorithms","224309437":"Coevolution of Fitness Predictors","291978370":"Truss sizing and shape optimization with stress and local buckling constraints","257352368":"Aggregate meta-models for evolutionary multiobjective and many-objective optimization","262323269":"A Surrogate Based Multiobjective Evolution Strategy with Different Models for Local Search and Pre-Selection","261460605":"Evolutionary truss layout optimization using the vectorized structure approach","4201386":"Crawling along the Pareto front: Tales from the practice","261045347":"Fitness Modeling With Markov Networks","269723618":"Reduction of function evaluation in differential evolution using nearest neighbor comparison","221162716":"On Evolutionary Optimization of Large Problems Using Small Populations","224645777":"Approximate Evolution Strategy using Stochastic Ranking","4307891":"A novel general framework for evolutionary optimization: Adaptive fuzzy fitness granulation","261430381":"Recurrent neural network ensembles for convergence prediction in surrogate-assisted evolutionary optimization","220743377":"Reduced computation for evolutionary optimization in noisy environment","220176614":"Faster convergence by means of fitness estimation","225583755":"Individual-based Management of Meta-models for Evolutionary Optimization with Application to Three-Dimensional Blade Optimization","221186772":"A Cooperative Optimization Algorithm Based on Gaussian Process and Particle Swarm Optimization for Optimizing Expensive Problems","257432740":"A cooperative group optimization system","269229043":"Managing Variable Fidelity Models in Population-based Optimization using Adaptive Model Switching"},"index":593}