{"abs":"It is a common engineering practice to use approximate models instead of the original computationally expensive model in optimization. When an approximate model is used for evolutionary optimization, the convergence properties of the evolutionary algorithm are unclear due to the approximation error. In this paper, extensive empirical studies on convergence of an evolution strategy are carried out on two bench-mark problems. It is found that incorrect convergence will occur if the approximate model has false optima. To address this problem, individual and generation based evolution control is introduced and the resulting effects on the convergence properties are presented. A framework for managing approximate models in generation-based evolution control is proposed. This framework is well suited for parallel evolutionary optimization that is able to guarantee the correct convergence of the evolutionary algorithm and to reduce the computation costs as much as possible. Control o...","title":"A Framework for Evolutionary Optimization with Approximate Fitness Functions","id":233870892,"url":"https://www.researchgate.net/publication/233870892_A_Framework_for_Evolutionary_Optimization_with_Approximate_Fitness_Functions","names":["Yaochu Jin","Markus Olhofer","Bernhard Sendhoff","IEEE Transactions on Evolutionary Computation"],"references":{},"citedIn":{"237337637":"Research Topics on Evolution and Learning at Honda Research Institute Europe","235770575":"Algorithm for Increasing the Speed of Evolutionary Optimization and its Accuracy in Multi-objective Problems","280695677":"Evolutionary Multimodal Optimization: A Short Survey","23493038":"Array-based evolution of DNA aptamers allows modelling of an explicit sequence-fitness landscape","242677117":"Meta Model Based EA for Complex Optimization","233661472":"A framework for design optimization using surrogates","220742181":"Expensive optimization, uncertain environment: An EA-based solution","221008162":"Tchebycheff Approximation in Gaussian Process Model Composition for Multi-objective Expensive Black Box","273186054":"Numerical Optimisation of Electro Hybrid Powertrains","220743160":"Model-Assisted Steady-State Evolution Strategies","269093082":"Robust Optimization of a Helicopter Rotor Airfoil Using Multi-fidelity Approach","220702133":"Ordinal Regression in Evolutionary Computation","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","235892312":"Expensive Optimisation: A Metaheuristics Perspective","261197001":"Self-adaptive lower confidence bound: A new general and effective prescreening method for Gaussian Process surrogate model assisted evolutionary algorithms","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","262011655":"Behavioral Programming: A Broader and More Detailed Take on Semantic GP","285582494":"Steady State IBEA Assisted by MLP Neural Networks for Expensive Multi-Objective Optimization Problems","283810551":"An Improved Evolutionary Algorithm for Reducing the Number of Function Evaluations","235903469":"Evolutionary Approaches to Expensive Optimisation","272397471":"Numerische Optimierung elektrifizierter Antriebsstränge","268270233":"An Investigation on Two Surrogate-based EAs","266652748":"Aerodynamic shape design using hybrid evolutionary computation and fitness approximation","285886691":"Review of surrogate modeling in water resources","282698485":"Behavioral Program Synthesis: Insights and Prospects","220702283":"Constrained Evolutionary Optimization by Approximate Ranking and Surrogate Models","285503528":"DYNAMIC ANALYSES OF A CURVED CABLE-STAYED FOOTBRIDGE UNDER HUMAN INDUCED VIBRATIONS: NUMERICAL MODELS AND EXPERIMENTAL TESTS","232362088":"Successive approximate model based multi-objective optimization for an industrial straight grate iron ore induration process using evolutionary algorithm","269723618":"Reduction of function evaluation in differential evolution using nearest neighbor comparison","272374601":"Multi objective optimization of computationally expensive multi-modal functions with RBF surrogates and multi-rule selection","282698478":"Metaheuristic Design Pattern: Surrogate Fitness Functions","225602949":"An efficient evolutionary optimisation framework applied to turbine blade firtree root local profiles","220743377":"Reduced computation for evolutionary optimization in noisy environment","220714332":"Multi-processor system-on-chip Design Space Exploration based on multi-level modeling techniques","282899617":"Machine Learning Algorithm for the Fitness Landscape Learning Evolutionary Computation","225410770":"Evolutionary Shape Optimization Using Gaussian Processes"},"index":596}