{"abs":"In the comments letter by Huang et al. (ibid. vol.9 (1998)) the authors claimed that the boundedness of a sigmoidal function σ(x) is neither sufficient nor necessary condition for the validity of the approximation theorem discussed in our original paper (ibid. vol.6 (1995)). In this paper, we show that this claim is incorrect","title":"Some queries on “Comments on `Approximation capability in C(R¯n) by multilayer feedforward networks and related problems\u0027”","id":3302979,"url":"https://www.researchgate.net/publication/3302979_Some_queries_on_Comments_on_Approximation_capability_in_CRn_by_multilayer_feedforward_networks_and_related_problems\u0027","names":["Tianping Chen","IEEE Transactions on Neural Networks"],"references":{"3301746":"Location and stability of the high-gain equilibria of nonlinear neural networks","5587684":"Complex-Valued Multistate Neural Associative Memory","3302465":"Comments on Approximation Capability in C(Rn) by Multilayer Feedforward Networks and Related Problems","3301905":"Approximation Capability in by Multilayer Feedforward Networks and Related Problems","16246447":"Hopfield, J.J.: Neural Network and Physical Systems with Emergent Collective Computational Abilities. Proc. Natl. Acad. Sci. 79, 2554-2558","3302888":"Improving the capacity of complex-valued neural networks with a modified gradient descent learning rule","10832600":"Memory and Learning of Sequential Patterns by Nonmonotone Neural Networks","243011298":"Global Convergence and Asymptotic Stability of Asymmetric Hopfield Neural Networks","222346959":"Asymmetric Hopfield-type networks: Theory and applications"},"citedIn":{"257432440":"Generalized extreme learning machine acting on a metric space","232616604":"Predicting the Corrosion Rates of Steels in Sea Water Using Artificial Neural Network","224368072":"Traffic Flow Prediction of Chaos Time Series by Using Subtractive Clustering for Fuzzy Neural Network Modeling","257435200":"Surface reconstruction based on extreme learning machine","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","261038359":"Intelligent modeling of a piezoelectric tube actuator","263250075":"Functional data learning by Hilbert feedforward neural networks","257336522":"A comparative study on the use of black box modelling for piezoelectric actuators","236856434":"Fuzzy controllers gains tuning: A constrained nonlinear optimization approach","4279532":"Chromatism Classification System Based on Hybrid Intelligent"},"index":602}