{"abs":"We study sequential collusion-resistant fingerprinting, where the fingerprinting code is generated in advance but accusations may be made between rounds, and show that in this setting both the dynamic Tardos scheme and schemes building upon Wald\u0027s sequential probability ratio test (SPRT) are asymptotically optimal. We further compare these two approaches to sequential fingerprinting, highlighting differences between the two schemes. Based on these differences, we argue that Wald\u0027s scheme should in general be preferred over the dynamic Tardos scheme, even though both schemes have their merits. As a side result, we derive an optimal sequential group testing method for the classical model, which can easily be generalized to different group testing models.","title":"Optimal sequential fingerprinting: Wald vs. Tardos","id":272193983,"url":"https://www.researchgate.net/publication/272193983_Optimal_sequential_fingerprinting_Wald_vs_Tardos","names":["Thijs Laarhoven"],"references":{"48200414":"Asymptotically false-positive-maximizing attack on non-binary Tardos\ncodes","262174372":"Optimal suspicion functions for Tardos traitor tracing schemes","243963918":"Dynamic Traitor Tracing Schemes, Revisited","51955218":"Optimal symmetric Tardos traitor tracing schemes","258442349":"Fingerprinting Codes and the Price of Approximate Differential Privacy","220722230":"Optimization of Tardos’s Fingerprinting Codes in a Viewpoint of Memory Amount","230570028":"Answering n^{2+o(1)} Counting Queries with Differential Privacy is Hard","2864441":"Optimal Probabilistic Fingerprint Codes","220617395":"Efficient Dynamic Traitor Tracing","3079606":"Collusion-secure fingerprinting for digital data","225133682":"Sequential Traitor Tracing","220780339":"High rate fingerprinting codes and the fingerprinting capacity","45340968":"EM Decoding of Tardos Traitor Tracing Codes","38368084":"The Detection of Defective Members of Large Population","45340972":"Estimating the Minimal Length of Tardos Code","224258556":"On the Saddle-Point Solution and the Large-Coalition Asymptotics of Fingerprinting Games","241638980":"Toward Practical Joint Decoding of Binary Tardos Fingerprinting Codes","259195482":"Efficient Probabilistic Group Testing Based on Traitor Tracing","224578763":"Saddle-point Solution of the Fingerprinting Capacity Game Under the Marking Assumption","259845207":"Capacities and Capacity-Achieving Decoders for Various Fingerprinting Games","270665234":"Riding the Saddle Point: Asymptotics of the capacity-achieving simple decoder for bias-based traitor tracing","260647869":"Bias Equalizer for Binary Probabilistic Fingerprinting Codes","38367996":"Sequential Tests of Statistical Hypotheses","261121192":"Decoding Fingerprinting Using the Markov Chain Monte Carlo Method","277348287":"A Capacity-Achieving Simple Decoder for Bias-Based Traitor Tracing Schemes","236965920":"Enhanced Blind Decoding of Tardos Codes with New Map-Based Functions","238048888":"Performance and code length optimization of joint decoding tardos fingerprinting","220484717":"Tardos fingerprinting is better than we thought","220722285":"On the Design and Optimization of Tardos Probabilistic Fingerprinting Codes","263036385":"Tuple decoders for traitor tracing schemes","261336287":"The holey grail A special score function for non-binary traitor tracing","220479080":"Low Bandwidth Dynamic Traitor Tracing Schemes","268671057":"Sequential Experimentation in Clinical Trials","224101513":"Blind decoder for binary probabilistic traitor tracing codes","50894943":"Towards Joint Tardos Decoding: The \u0027Don Quixote\u0027 Algorithm","220478972":"Dynamic Traitor Tracing","38367760":"Optimum Character of the Sequential Probability Ratio Test","267056179":"Sequential Analysis and Optimal Design","224101511":"Worst case attacks against binary probabilistic traitor tracing codes","4361380":"1 Universal Fingerprinting: Capacity and Random-Coding Exponents","224191028":"Linear Universal Decoding for Compound Channels","267660575":"Sequential Methods and Their Applications","235360744":"Discrete Distributions in the Tardos Scheme, Revisited","224246316":"Group testing meets traitor tracing","265506081":"Group Sequential Methods with Applications to Clinical Trials. Chapman and Hall/CRC, Boca Raton, FL","226986997":"Dynamic subtree tracing and its application in pay-TV systems","221210715":"Expectation Maximisation decoding of Tardos probabilistic fingerprinting code","51956079":"Dynamic Tardos Traitor Tracing Schemes","266561055":"Interactive Fingerprinting Codes and the Hardness of Preventing False Discovery"},"citedIn":{},"index":609}