{"abs":"The authors consider two new attacks on water- marked video specific to HD 60 fps H.264 High and Main profiles: selective I/P frames’ removal and zeroing of residuals in B frames. We propose the method of embedding of a readable watermark for H.264 High Profile video robust to such attacks. The video stream is partially decoded removing entropy coding, then a watermark is embedded into low-frequency DCT residuals and motion vectors of B frames, so that it could be later extracted in an uncompressed domain even if almost all I and P frames were removed by the attacker during transcoding. The method is non- blind, robust to new attacks and to such attacks as transcoding, down-scale, and post processing filters due to robustness of low frequency DCT coefficients. The method consists of two stages: computationally intensive preprocessing stage performed to each video and low complexity payload embedding stage performed to each copy. So it is specifically suitable for fingerprinting of Video- on-Demand (VoD) systems, where a unique watermark should be embedded in each video’s copy.","title":"A method of H.264 video watermarking robust to attack on I and P frames by removal","id":273106587,"url":"https://www.researchgate.net/publication/273106587_A_method_of_H264_video_watermarking_robust_to_attack_on_I_and_P_frames_by_removal","names":["Alexandra Afanasyeva","D Ivanov","E Linsky","D Ryzhov","Sergey I. Salishev"],"references":{"5567414":"Secure spread spectrum watermarking for multimedia","2864441":"Optimal Probabilistic Fingerprint Codes","224312492":"H.264/AVC stream replacement technique for video watermarking","3327793":"“Image Quality Assessment: From Error Visibility to Structural Similarity,” IEEE Trans","224176458":"A Low Complexity Video Watermarking in H.264 Compressed Domain","228548918":"DCT quantization matrices visually optimized for individual images","4354184":"A Compressed Video Watermarking Scheme with Temporal Synchronization","220931409":"A hybrid watermarking scheme for H.264/AVC video","221566607":"Robust Perceptual Image Hashing Based Temporal Synchronization for Watermarked H.264 Frames","220307598":"A practical design of digital video watermarking in H.264/AVC for content authentication"},"citedIn":{},"index":611}