{"abs":"Enterprise digital rights management (E-DRM) systems protect business digital applications by allowing an author in an organization to securely upload his confidential package/file and store the contents in a private way on secure servers. This is done in a way that -- later -- allows an authorized user who is able to prove his authorization for the package to an authorization authority to download and use these contents in a private way. However, the user maybe authorized for many archived packages and files of very large sizes and at the same time, he is targeting only a file that contains certain private keywords. It is inadequate that the user downloads and decrypts all the materials he is authorized for in order to pick one. In this paper we propose an efficient (E-DRM) protocol for robust and secure storage and retrieval of digital contents with the property that allows the user in a non-interactive way to search the files in their encrypted form for matching private keywords and then to download these particular files.","title":"Efficient Robust and Secure E-DRM with Encrypted Content Search","id":280530763,"url":"https://www.researchgate.net/publication/280530763_Efficient_Robust_and_Secure_E-DRM_with_Encrypted_Content_Search","names":["Maged Hamada Ibrahim","International journal on information"],"references":{"4355170":"A practical scheme for non-interactive verifiable secret sharing","221353840":"AONT-RS: Blending Security and Performance in Dispersed Storage Systems.","262347239":"Electronic Copyright Management Systems: Requirements, Players and Technologies","262257925":"Asymptotic Fingerprinting Capacity in the Combined Digit Model","232647000":"Security architectures for controlled digital information dissemination","2725632":"All-Or-Nothing Encryption and The Package Transform","227088517":"Efficient signature generation by smart cards","220425267":"How to Share a Secret","222668533":"Robust Threshold DSS Signatures","2864441":"Optimal Probabilistic Fingerprint Codes","289100360":"Group-based authentication to protect digital content for business applications","280530958":"Secure and Robust Enterprise Digital Rights Management Protocol with Efficient Storage","46122408":"Resisting Traitors in Linkable Democratic Group Signatures","290264948":"A group-oriented digital right management scheme with reliable and flexible access policies","225722958":"Secure Distributed Key Generation for Discrete-Log Based Cryptosystems","220432248":"Rabin, M.O.: Efficient dispersal of information for security, load balancing, and fault tolerance. J. ACM. 36, 335-348","221355210":"Secret Sharing Made Short","228689533":"Enterprise digital rights management: Solutions against information theft by insiders","226577502":"Non-Interactive and Information-Theoretic Secure Verifiable Secret Sharing"},"citedIn":{"282372604":"AATCT: Anonymously Authenticated Transmission on the Cloud with Traceability","282372777":"Secure Anonymously Authenticated and Traceable Enterprise DRM System"},"index":612}