{"abs":"This paper defines a class of spaces which are easy for genetic algorithms and hard for stochastic hill--climbers. These spaces require genetic recombination for successful search and are partially deceptive. Problems where tradeoffs need to be made subsume spaces with these properties. Preliminary results comparing a genetic algorithm without crossover against one with two--point crossover support these claims. Further we show how a genetic algorithm using pareto optimality for selection, outperforms both. These results provide insight into the kind of spaces where recombination is necessary suggesting further study of properties of such spaces, and what it means to be GA--easy and hill--climbing hard. 1 INTRODUCTION Recombination plays a central role in genetic algorithms (GAs) and constitutes one of the major differences between GAs and other blind search algorithms. 1 The answer to the question of whether a search space is particularly suited to a genetic algorithm therefore hin...","title":"Pareto Optimality, GA-easiness and Deception","id":2252671,"url":"https://www.researchgate.net/publication/2252671_Pareto_Optimality_GA-easiness_and_Deception","names":["Sushil J. Louis","Gregory J. E. Rawlins"],"references":{"201976349":"Genetic Algorithms and Walsh Functions: Part I{I, Deception and its Analysis","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","201976015":"GA-Easy Does Not Imply Steepest Ascent Optimizable","243779034":"Adaptation in Natural and Arti cial Systems","2777732":"Relative Building-Block Fitness and the Building-Block Hypothesis","2611416":"A Survey of Evolution Strategies","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"6937065":"A multi-objective evolutionary approach to the protein structure prediction problem. J R Soc Interface 3:139-151","269224015":"Using Pareto genetic algorithms for preliminary subsonic wing design","2597729":"Learning by Objectives for Adaptive Shop-Floor Scheduling","3865212":"A framework of fuzzy modeling using genetic algorithms with appropriate combination of evaluation criteria","220867180":"Lecture Notes in Computer Science","226134707":"Multidimensional Optimization with a Fuzzy Genetic Algorithm","260675586":"Multi-Objectivization of Reinforcement Learning Problems by Reward Shaping","261192989":"An evolutionary multi-agent system for production scheduling","263372158":"Multi-objectivization, fitness landscape transformation and search performance: A case of study on the hp model for protein structure prediction","226671887":"Predictive Modeling on Multiple Marketing Objectives Using Evolutionary Computation","265500829":"Using multi-objective evolutionary algorithms for single-objective optimization","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","3829288":"Interactive multiple objective decision method for water supply scheduling in hybrid network models","2316980":"Reducing Local Optima in Single-Objective Problems by Multi-objectivization","3421935":"Pareto-Based Multiobjective Machine Learning: An Overview and Case Studies","2472517":"Evolutionary Algorithms in Data Mining: Multi-Objective Performance Modeling for Direct Marketing","3910618":"Evolutionary algorithm based fuzzy modeling using conciseness measure","2438983":"Design of Combinational Logic Circuits through an Evolutionary Multiobjective Optimization Approach","221047694":"Optimization of Pulse Pattern for a Multi-robot Sonar System Using Genetic Algorithm.","226072411":"Evaluating solution sets of a posteriori solution techniques for bi-criteria combinatorial optimization problems","2576708":"Co-operation through Hierarchical Competition in Genetic Data Mining","245438148":"Design of a Guided Missile Interceptor Using a Genetic Algorithm","226165021":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","221228488":"Comparison of Multiple Objective Genetic Algorithms for Parallel Machine Scheduling Problems","220998916":"Acquisition of modulation pulses for a multi-robot system using genetic algorithm","2768198":"F1.12: Multicriteria Decision Making and Evolutionary Computation","263453855":"Helper-Objectives: Using Multi-Objective Evolutionary Algorithms for Single-Objective Optimisation: Evolutionary Computation Combinatorial Optimization (Editors: Jens Gottlieb, Emma Hart, Martin Middendorf, Günter Raidl and Colin Reeves)","267432540":"Helper-Objectives: Using Multi-Objective Evolutionary Algorithms for Single-Objective Optimisation","220412622":"Pareto analysis of evolutionary and learning systems","272194198":"Analysis of Solution Quality of a Multiobjective Optimization-based Evolutionary Algorithm for Knapsack Problem","2448149":"Fundamental Limitations on Search Algorithms: Evolutionary Computing in Perspective","235206582":"A Comparison of Trajectory Determination Approaches for Small UAVs","228568681":"Predictive control of synchronous generator: a multiciterial optimization approach","228568677":"Fuzzy modeling using genetic algorithms with fuzzy entropy as conciseness measure","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","283943383":"Using multi-objective evolutionary algorithms for single-objective constrained and unconstrained optimization","228568675":"MULTI-OBJECTIVE OPTIMIZATION FOR MIXED-INTEGER PROGRAMS THROUGH HYBRID GENETIC ALGORITHM WITH VALUE FUNCTION MODELED BY …","243666680":"F1.9 Multicriterion decision making"},"index":613}