{"abs":"For the Tardos traitor tracing scheme, we show that by combining the symbol-symmetric accusation function of Skoric et al. with the improved analysis of Blayer and Tassa we get further improvements. Our construction gives codes that are up to 4 times shorter than Blayer and Tassa\u0027s, and up to 2 times shorter than the codes from Skoric et al. Asymptotically, we achieve the theoretical optimal codelength for Tardos\u0027 distribution function and the symmetric score function. For large coalitions, our codelengths are asymptotically about 4.93% of Tardos\u0027 original codelengths, which also improves upon results from Nuida et al.","title":"Optimal symmetric Tardos traitor tracing schemes","id":51955218,"url":"https://www.researchgate.net/publication/51955218_Optimal_symmetric_Tardos_traitor_tracing_schemes","names":["Thijs Laarhoven","Benne de Weger","Designs Codes and Cryptography"],"references":{"2864441":"Optimal Probabilistic Fingerprint Codes","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","220484717":"Tardos fingerprinting is better than we thought","224578763":"Saddle-point Solution of the Fingerprinting Capacity Game Under the Marking Assumption","225366004":"An improvement of discrete Tardos fingerprinting codes","220678956":"Tardos Fingerprinting is Better Than We Thought","220780339":"High rate fingerprinting codes and the fingerprinting capacity","220639083":"Improved versions of Tardos’ fingerprinting scheme"},"citedIn":{"270665234":"Riding the Saddle Point: Asymptotics of the capacity-achieving simple decoder for bias-based traitor tracing","257555338":"False Negative probabilities in Tardos codes","257555322":"Binary and q-ary Tardos codes, revisited","243963918":"Dynamic Traitor Tracing Schemes, Revisited","272193983":"Optimal sequential fingerprinting: Wald vs. Tardos","51956079":"Dynamic Tardos Traitor Tracing Schemes","277348287":"A Capacity-Achieving Simple Decoder for Bias-Based Traitor Tracing Schemes","247769550":"Efficient Probabilistic Group Testing Based on Traitor Tracing","275719364":"Tally-Based Simple Decoders for Traitor Tracing and Group Testing","281675201":"Anticollusion solutions for asymmetric fingerprinting protocols based on client side embedding","261336287":"The holey grail A special score function for non-binary traitor tracing"},"index":614}