{"abs":"This paper deals with active fingerprinting a.k.a. traitor tracing where a collusion of dishonest users merges their individual versions of a content to yield a pirated copy. The Tardos codes are one of the most powerful tools to fight against such collusion process by identifying the colluders. Instead of studying as usual the necessary and sufficient code length in a theoretical setup, we adopt the point of view of the practitioner. We call this the operational mode, i.e. a practical setup where a Tardos code has already been deployed and a pirated copy has been found. This new paradigm shows that the known bounds on the probability of accusing an innocent in the theoretical setup are way too pessimistic. Indeed the practitioner can resort to much tighter bounds because the problem is fundamentally much simpler under the operational mode. In the end, we benchmark under the operational mode several single decoders recently proposed in the literature. We believe this is a fair comparison reflecting what matters in reality.","title":"Tardos codes for real","id":281597600,"url":"https://www.researchgate.net/publication/281597600_Tardos_codes_for_real","names":["Teddy Furon","Mathieu Desoubeaux"],"references":{"2864441":"Optimal Probabilistic Fingerprint Codes","257555322":"Binary and q-ary Tardos codes, revisited","267128815":"Concentration inequalities. A nonasymptotic theory of independence","234832204":"Experimental Assessment of the Reliability for Watermarking and Fingerprinting Schemes","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","224191028":"Linear Universal Decoding for Compound Channels","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","235357389":"Large Deviation Methods for Approximate Probabilistic Inference","259845207":"Capacities and Capacity-Achieving Decoders for Various Fingerprinting Games","236965920":"Enhanced Blind Decoding of Tardos Codes with New Map-Based Functions"},"citedIn":{"281675201":"Anticollusion solutions for asymmetric fingerprinting protocols based on client side embedding"},"index":619}