{"abs":"Evolutionary algorithms (EAs) are often wellsuited for optimization problems involving several, often conflicting objectives. Since 1985, various evolutionary approaches to multiobjective optimization have been developed that are capable of searching for multiple solutions concurrently in a single run. However, the few comparative studies of different methods presented up to now remain mostly qualitative and are often restricted to a few approaches. In this paper, four multiobjective EAs are compared quantitatively where an extended 0/1 knapsack problem is taken as a basis. Furthermore, we introduce a new evolutionary approach to multicriteria optimization, the Strength Pareto EA (SPEA), that combines several features of previous multiobjective EAs in a unique manner. It is characterized by (a) storing nondominated solutions externally in a second, continuously updated population, (b) evaluating an individual\u0027s fitness dependent on the number of external nondominated points that domina...","title":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","id":2240388,"url":"https://www.researchgate.net/publication/2240388_Thiele_L_Multiobjective_Evolutionary_Algorithms_A_Comparative_Case_Study_and_the_Strength_Pareto_Approach_IEEE_Trans_on_Evolutionary_Computation_3_257-271","names":["Eckart Zitzler","Lothar Thiele","IEEE Transactions on Evolutionary Computation"],"references":{"2754984":"Finding Multimodal Solutions Using Restricted Tournament Selection","220201252":"System-Level Synthesis Using Evolutionary Algorithms","3642928":"Multi-objective optimization by genetic algorithm: a review","248122432":"Tournament Selection Niching and the Preservation of Diversity","220885536":"Use of Genetic Algorithms in Multicriteria Optimization to Solve Industrial Problems.","3642940":"An interactive fuzzy satisficing method for multiobjective multidimensional 0-1 knapsack problems through genetic algorithms","220885542":"The Neighborhood Constraint Method: A Genetic Algorithm-Based Multiobjective Optimization Technique.","34058890":"Theory of evolutionary algorithms and application to system synthesis /","2802724":"Searching for Diverse, Cooperative Populations with Genetic Algorithms","220885541":"A Non-Generational Genetic Algorithm for Multiobjective Optimization.","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","233349362":"Reducing the Pareto optimal set in multicriteria optimization","200622062":"Knapsack Problems: Algorithms and Computer Implementation","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107","220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","2581382":"The Zero/One Multiple Knapsack Problem and Genetic Algorithms","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","216300992":"Evolution Strategies for Vector Optimization","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","221271170":"Fitness Functions for Multiple Objective Optimization Problems: Combining Preferences with Pareto Rankings.","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","220885661":"A Multiple Criteria Genetic Algorithm for Containership Loading.","3418509":"Macready, W.G.: No Free Lunch Theorems for Optimization. IEEE Transactions on Evolutionary Computation 1(1), 67-82","216300639":"Compaction of Symbolic Layout using Genetic Algorithms","2690834":"Niching Methods for Genetic Algorithms","216457304":"Lecture Notes in Computer Science","225811765":"Genetic algorithms for the 0/1 knapsack problem","2243429":"A Non-generational Genetic Algorithm for Multiobjective Optimization","3662832":"Solving large knapsack problems with a genetic algorithm","2299624":"Population Diversity in an Immune System Model: Implications for Genetic Search","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","220471028":"Reducing the size of the nondominated set: Pruning by clustering.","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","220885497":"The Symbiotic Evolution of Solutions and Their Representations.","2627581":"Evolution Strategies for Vector Optimization","227113566":"Lecture Notes in Computer Science","3686754":"An evolutionary approach to system-level synthesis","221032054":"Multi-Objective Genetic Local Search Algorithm.","220045504":"Multiple Criteria Optimization: Theory, Computation and Application. N.Y., Wiley","216300417":"Graphical Methods For Data Analysis","2782915":"A Variant of Evolution Strategies for Vector Optimization","35578608":"An Analysis of the Behavior of a Class of Genetic Adaptive Systems","2600791":"Using Genetic Algorithms to Explore Pattern Recognition in the Immune System","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","242356870":"Adaptation In Natural And Artificial Systems","220375002":"A ComDarison of Selection Schemes Used in Evolutionary Algorithms","220045412":"Adoption in Natural and Artificial System","243666680":"F1.9 Multicriterion decision making","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{},"index":62}