{"abs":"In this work we consider the large-coalition asymptotics of various fingerprinting and group testing games, and derive explicit expressions for the capacities for each of these models. We do this both for simple decoders (fast but suboptimal) and for joint decoders (slow but optimal). For fingerprinting, we show that if the pirate strategy is known, the capacity often decreases linearly with the number of colluders, instead of quadratically as in the uninformed fingerprinting game. For many attacks the joint capacity is further shown to be strictly higher than the simple capacity. For group testing, we improve upon known results about the joint capacities, and derive new explicit asymptotics for the simple capacities. These show that existing simple group testing algorithms are suboptimal, and that simple decoders cannot asymptotically be as efficient as joint decoders. For the traditional group testing model, we show that the gap between the simple and joint capacities is a factor 1.44 for large numbers of defectives.","title":"Asymptotics of Fingerprinting and Group Testing: Tight Bounds From Channel Capacities","id":261512931,"url":"https://www.researchgate.net/publication/261512931_Asymptotics_of_Fingerprinting_and_Group_Testing_Tight_Bounds_From_Channel_Capacities","names":["Thijs Laarhoven","IEEE Transactions on Information Forensics and Security"],"references":{"247043001":"On the Medians of Gamma Distributions and an Equation of Ramanujan","242959929":"The separating property of random matrices","222669638":"Secure frameproof codes, key distribution patterns, group testing algorithms and related structures","243963918":"Dynamic Traitor Tracing Schemes, Revisited","48200408":"Asymptotic Fingerprinting Capacity for Non-binary Alphabets","242996604":"On two random search problems","238048888":"Performance and code length optimization of joint decoding tardos fingerprinting","247769550":"Efficient Probabilistic Group Testing Based on Traitor Tracing","263036385":"Tuple decoders for traitor tracing schemes","224106390":"Compressed Sensing with Probabilistic Measurements: A Group Testing Solution","221960629":"Adaptive group testing as channel coding with feedback","47386140":"Note on Noisy Group Testing: Asymptotic Bounds and Belief Propagation\nReconstruction","252048596":"Bounds for threshold and majority group testing","46585495":"Group Testing With Probabilistic Tests: Theory, Design and Application","224101513":"Blind decoder for binary probabilistic traitor tracing codes","2864441":"Optimal Probabilistic Fingerprint Codes","51918219":"Non-adaptive probabilistic group testing with noisy measurements:\nNear-optimal bounds with efficient algorithms","261248449":"On the Fingerprinting Capacity Games for Arbitrary Alphabets and Their Asymptotics","3079606":"Collusion-secure fingerprinting for digital data","220478972":"Dynamic Traitor Tracing","220780339":"High rate fingerprinting codes and the fingerprinting capacity","45900583":"Improved Constructions for Non-adaptive Threshold Group Testing","45340968":"EM Decoding of Tardos Traitor Tracing Codes","224101510":"Capacity-achieving fingerprint decoding","261563273":"Asymptotics of Fingerprinting and Group Testing: Capacity-Achieving Log-Likelihood Decoders","224258556":"On the Saddle-Point Solution and the Large-Coalition Asymptotics of Fingerprinting Games","228083513":"Dynamic Traitor Tracing for Arbitrary Alphabets: Divide and Conquer","241638980":"Toward Practical Joint Decoding of Binary Tardos Fingerprinting Codes","220616325":"Optimal Two-Stage Algorithms for Group Testing Problems","4361380":"1 Universal Fingerprinting: Capacity and Random-Coding Exponents","31448247":"Group Testing with a Dilution Effect","238523934":"Majority group testing with density tests","224106354":"Noisy group testing: An information theoretic perspective","224578763":"Saddle-point Solution of the Fingerprinting Capacity Game Under the Marking Assumption","221663325":"Non-Adaptive Group Testing: Explicit Bounds and Novel Algorithms","259845207":"Capacities and Capacity-Achieving Decoders for Various Fingerprinting Games","235357099":"The Capacity of Adaptive Group Testing","268498029":"Bounds on the length of disjunctive codes","226569772":"Separating codes and a new combinatorial search model","224246316":"Group testing meets traitor tracing","221210715":"Expectation Maximisation decoding of Tardos probabilistic fingerprinting code","236248545":"Near-Optimal Stochastic Threshold Group Testing","222414516":"Nonadaptive algorithms for threshold group testing","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","51956079":"Dynamic Tardos Traitor Tracing Schemes","45860807":"Boolean Compressed Sensing and Noisy Group Testing","245096422":"A survey of superimposed distance codes","224218274":"Maximin optimality of the arcsine fingerprinting distribution and the interleaving attack for large coalitions"},"citedIn":{"271533022":"Limits on Support Recovery with Probabilistic Models: An Information-Theoretic Framework","284029184":"Phase Transitions in Group Testing","261563273":"Asymptotics of Fingerprinting and Group Testing: Capacity-Achieving Log-Likelihood Decoders"},"index":621}