{"abs":"An essential issue in surrogate model-based reliability analysis is the selection of training points. Approaches such as efficient global reliability analysis (EGRA) and adap-tive Kriging Monte Carlo simulation (AK-MCS) methods have been developed to adaptively select training points that are close to the limit state. Both the learning functions and convergence criteria of selecting training points in EGRA and AK-MCS are defined from the perspective of individual responses at Monte Carlo samples. This causes two problems: (1) some extra training points are selected after the reliability estimate already satisfies the accuracy target; and (2) the selected training points may not be the optimal ones for reliability analysis. This paper proposes a Global Sensitivity Analysis enhanced Surrogate (GSAS) modeling method for reliability analysis. Both the convergence criterion and strategy of selecting new training points are defined from the perspective of reliability estimate instead of individual responses of MCS samples. The new training points are identified according to their contribution to the uncertainty in the reliability estimate based on global sensitivity analysis. The selection of new training points stops when the accuracy of the reliability estimate reaches a specific target. Five examples are used to assess the accuracy and efficiency of the proposed method. The results show that the efficiency and accuracy of the proposed method are better than those of EGRA and AK-MCS.","title":"Global sensitivity analysis-enhanced surrogate (GSAS) modeling for reliability analysis","id":283308843,"url":"https://www.researchgate.net/publication/283308843_Global_sensitivity_analysis-enhanced_surrogate_GSAS_modeling_for_reliability_analysis","names":["Zhen hu","Sankaran Mahadevan","Structural and Multidisciplinary Optimization"],"references":{"256392972":"Global Sensitivity Analysis—A Computational Implementation of the Fourier Amplitude Sensitivity Test (FAST)","222227065":"A new uncertainty importance measure","43344722":"Global Sensitivity Analysis for Systems with Independent and/or Correlated Inputs","220056020":"Extending a global sensitivity analysis technique to models with correlated parameters","260145162":"Metamodel-based importance sampling for reliability sensitivity analysis","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","223592988":"A new look at the response surface approach for reliability analysis","222545943":"Modeling uncertainty in flow simulations via generalized polynomial chaos","236843208":"Kriging Models for Global Approximation in Simulation-Based Multidisciplinary Design Optimization","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","51890126":"Metamodel-based importance sampling for structural reliability analysis","51991936":"The Wiener--Askey Polynomial Chaos for Stochastic Differential Equations","222662110":"Kriging metamodeling in simulation: a review. Eur J Oper Res","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","245284547":"A Response Surface Approach for Reliability Analysis","222727526":"Limit state function identification using Support Vector Machines for discontinuous responses and disjoint failure domains","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","250697237":"Adaptive explicit decision functions for probabilistic design and optimization using support vector machines","223269739":"Comparison of response surface and neural network with other methods for structural reliability analysis","223079085":"An adaptive algorithm to build up sparse polynomial chaos expansions for stochastic finite element analysis","222684963":"Adapted polynomial chaos expansion for failure detection","223791793":"Subset simulation for structural reliability sensitivity analysis","227730169":"A Nonstationary Covariance Based Kriging Method for Metamodeling in Engineering Design","265682213":"Global Sensitivity Analysis","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","231484400":"First order reliability method with truncated random variables"},"citedIn":{},"index":624}