{"abs":"We study the large-coalition asymptotics of fingerprinting and group testing, and derive explicit decoders that provably achieve capacity for many of the considered models. We do this both for simple decoders (fast but suboptimal) and for joint decoders (slow but optimal), and both for informed and uninformed settings. For fingerprinting, we show that if the pirate strategy is known, the Neyman-Pearson-based log-likelihood decoders provably achieve capacity, regardless of the strategy. The decoder built against the interleaving attack is further shown to be a universal decoder, able to deal with arbitrary attacks and achieving the uninformed capacity. This universal decoder is shown to be closely related to the Lagrange-optimized decoder of Oosterwijk et al. and the empirical mutual information decoder of Moulin. Joint decoders are also proposed, and we conjecture that these also achieve the corresponding joint capacities. For group testing, the simple decoder for the classical model is shown to be more efficient than the one of Chan et al. and it provably achieves the simple group testing capacity. For generalizations of this model such as noisy group testing, the resulting simple decoders also achieve the corresponding simple capacities.","title":"Asymptotics of Fingerprinting and Group Testing: Capacity-Achieving Log-Likelihood Decoders","id":261563273,"url":"https://www.researchgate.net/publication/261563273_Asymptotics_of_Fingerprinting_and_Group_Testing_Capacity-Achieving_Log-Likelihood_Decoders","names":["Thijs Laarhoven","EURASIP Journal on Information Security"],"references":{"222669638":"Secure frameproof codes, key distribution patterns, group testing algorithms and related structures","243963918":"Dynamic Traitor Tracing Schemes, Revisited","48200408":"Asymptotic Fingerprinting Capacity for Non-binary Alphabets","247769550":"Efficient Probabilistic Group Testing Based on Traitor Tracing","263036385":"Tuple decoders for traitor tracing schemes","220639083":"Improved versions of Tardos’ fingerprinting scheme","47386140":"Note on Noisy Group Testing: Asymptotic Bounds and Belief Propagation\nReconstruction","46585495":"Group Testing With Probabilistic Tests: Theory, Design and Application","224101513":"Blind decoder for binary probabilistic traitor tracing codes","2864441":"Optimal Probabilistic Fingerprint Codes","51918219":"Non-adaptive probabilistic group testing with noisy measurements:\nNear-optimal bounds with efficient algorithms","261248449":"On the Fingerprinting Capacity Games for Arbitrary Alphabets and Their Asymptotics","3079606":"Collusion-secure fingerprinting for digital data","220478972":"Dynamic Traitor Tracing","220780339":"High rate fingerprinting codes and the fingerprinting capacity","45340968":"EM Decoding of Tardos Traitor Tracing Codes","216301177":"On the Problem of the Most Efficient Tests of Statistical Hypotheses","224258556":"On the Saddle-Point Solution and the Large-Coalition Asymptotics of Fingerprinting Games","228083513":"Dynamic Traitor Tracing for Arbitrary Alphabets: Divide and Conquer","241638980":"Toward Practical Joint Decoding of Binary Tardos Fingerprinting Codes","4361380":"1 Universal Fingerprinting: Capacity and Random-Coding Exponents","224191028":"Linear Universal Decoding for Compound Channels","221663325":"Non-Adaptive Group Testing: Explicit Bounds and Novel Algorithms","259845207":"Capacities and Capacity-Achieving Decoders for Various Fingerprinting Games","268498029":"Bounds on the length of disjunctive codes","235360744":"Discrete Distributions in the Tardos Scheme, Revisited","224246316":"Group testing meets traitor tracing","221210715":"Expectation Maximisation decoding of Tardos probabilistic fingerprinting code","261512931":"Asymptotics of Fingerprinting and Group Testing: Tight Bounds From Channel Capacities","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","51956079":"Dynamic Tardos Traitor Tracing Schemes","45860807":"Boolean Compressed Sensing and Noisy Group Testing","245096422":"A survey of superimposed distance codes"},"citedIn":{"261512931":"Asymptotics of Fingerprinting and Group Testing: Tight Bounds From Channel Capacities"},"index":625}