{"abs":"La simulation est devenue dans la dernière décennie un outil essentiel du traitement statistique de modèles complexes et de la mise en oeuvre de techniques statistiques avancées, comme le bootstrap ou les méthodes d\u0027inférence simulée. Ce livre présente les éléments de base de la simulation de lois de probabilité (génération de variables uniformes et de lois usuelles) et de leur utilisation en Statistique (intégration de Monte Carlo, optimisation stochastique). Après un bref rappel sur les chaînes de Markov, les techniques plus spécifiques de Monte Carlo par chaînes de Markov (MCMC) sont présentées en détail, à la fois du point de vue théorique (validité et convergence) et du point de vue de leur implémentation (accélération, choix de paramètres, limitations). Les algorithmes d\u0027échantillonnage de Gibbs sont ainsi distingués des méthodes générales de Hastings-Metropolis par leur plus grande richesse théorique. Les derniers chapitres contiennent un exposé critique sur l\u0027état de l\u0027art en contrôle de convergence de ces algorithmes et une présentation unifiée des diverses applications des méthodes MCMC aux modèles à données manquantes. De nombreux exemples statistiques illustrent les méthodes présentées dans cet ouvrage destiné aux étudiants de deuxième et troisième cycles universitaires en Mathématiques Appliquées ainsi qu\u0027aux chercheurs et praticiens désirant utiliser les méthodes MCMC. Monte Carlo statistical methods, particularly those based on Markov chains, are now an essential component of the standard set of techniques used by statisticians. This new edition has been revised towards a coherent and flowing coverage of these simulation techniques, with incorporation of the most recent developments in the field. In particular, the introductory coverage of random variable generation has been totally revised, with many concepts being unified through a fundamental theorem of simulation There are five completely new chapters that cover Monte Carlo control, reversible jump, slice sampling, sequential Monte Carlo, and perfect sampling. There is a more in-depth coverage of Gibbs sampling, which is now contained in three consecutive chapters. The development of Gibbs sampling starts with slice sampling and its connection with the fundamental theorem of simulation, and builds up to two-stage Gibbs sampling and its theoretical properties. A third chapter covers the multi-stage Gibbs sampler and its variety of applications. Lastly, chapters from the previous edition have been revised towards easier access, with the examples getting more detailed coverage. This textbook is intended for a second year graduate course, but will also be useful to someone who either wants to apply simulation techniques for the resolution of practical problems or wishes to grasp the fundamental principles behind those methods. The authors do not assume familiarity with Monte Carlo techniques (such as random variable generation), with computer programming, or with any Markov chain theory (the necessary concepts are developed in Chapter 6). A solutions manual, which covers approximately 40% of the problems, is available for instructors who require the book for a course. oui","title":"Monte Carlo Statistical Method","id":41222435,"url":"https://www.researchgate.net/publication/41222435_Monte_Carlo_Statistical_Method","names":["Christian P. Robert","George Casella","Technometrics"],"references":{},"citedIn":{"282687705":"Bayesian sparse estimation of targets with range-Doppler grid mismatch","224312668":"Bayesian node localisation in wireless sensor networks","282603739":"Bayesian Fuzzy Clustering","281465024":"A Bayesian Monte Carlo Integration Strategy for Connecting Stochastic Models of HIV/AIDS with Data. Deterministic and Stochastic Models of AIDS Epidemics and HIV Infections with Intervention. World Scientific Publishing Company, 2005. Editors W.Y. Tan and H. Wu. Chapter 3, pages 61-76.","245030546":"Boosting Probabilistic Graphical Model Inference by Incorporating Prior Knowledge from Multiple Sources","227681691":"Likelihood inference","47626975":"Minimum correlation in construction of multivariate distributions","47733457":"Free energy computations by minimization of Kullback-Leibler divergence: An efficient adaptive biasing potential method for sparse representations","280873140":"GMM Estimation of Affine Term Structure Models","4288587":"On Resampling Algorithms for Particle Filters","6520936":"Incorporating multiple mixed stocks in mixed stock analysis: ‘Many-to-many\u0027 analyses","47626970":"Exact Bayesian Analysis of Mixtures","224367953":"A hybrid systems model for supervisory cognitive state identification and estimation in neural prosthetics","1916941":"Bayes in the sky: Bayesian inference and model selection in cosmology","4288592":"Online Multiple Target Tracking and Sensor Registration Using Sequential Monte Carlo Methods","4925528":"Dynamic Stochastic General Equilibrium (DSGE) Priors for Bayesian Vector Autoregressive (BVAR) Models: DSGE Model Comparison","23935358":"The Econometrics of DSGE Models","259432290":"Dynamic elicited priors for updating covert networks","267325434":"AN OVERVIEW OF INVERSE MATERIAL IDENTIFICATION WITHIN THE FRAMEWORKS OF DETERMINISTIC AND STOCHASTIC PARAMETER ESTIMATION","251107041":"WIZER: Automated Model Improvement in Multi-Agent Social-Network Systems","5234777":"Automated classification of normal and pathologic pulmonary tissue by topological texture features extracted from multi-detector CT in 3D","46306010":"P- and T-Wave Delineation in ECG Signals Using a Bayesian Approach and a Partially Collapsed Gibbs Sampler","227687818":"The Risk Microstructure of Corporate Bonds: A Case Study from the German Corporate Bond Market","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","285311256":"Échantillonnage préférentiel quasi-optimal par krigeage pour l’évaluation de la fiabilité des cuves de réacteur à eau pressurisée","4288602":"State-of-the-Art for the Marginalized Particle Filter","228838847":"A Bayesian approach to estimating the long memory parameter","261494708":"Bayesian estimation for the multifractality parameter","40886860":"Parametric Non-Mixture Cure Models for Schedule-Finding of Therapeutic Agents","24269143":"Implementing Loss Distribution Approach for Operational Risk","1886265":"Assessment and Propagation of Input Uncertainty in Tree-based Option Pricing Models","236959290":"Inference of Gene Regulatory Networks with Sparse Structural Equation Models Exploiting Genetic Perturbations","288059662":"Multivariate Output Analysis for Markov chain Monte Carlo","258520910":"Applications of geometric discrepancy in numerical analysis and statistics","234028501":"A reference Earth model for the heat-producing elements and associated geoneutrino flux. Geochem Geophys Geosys","251803434":"Laplace expansions in MCMC algorithms","284272857":"Discrete Spatial Variation","233854424":"Assessing wavestorm hazard evolution in the NW Mediterranean with hindcast and buoy data","24187226":"Evaluating Cognitive Theory: A Joint Modeling Approach Using Responses and Response Times","224296304":"Hybrid Statistical/Electromagnetic Optimization and Performance Capability Modeling of an LTCC Compact Soft/Hard Surface Structure","51929911":"Gradient Flow from a Random Walk in Hilbert Space","269271102":"Maximum marginal likelihood estimation of the granularity coefficient of a Potts-Markov random field within an MCMC algorithm","284219590":"Accelerating pseudo-marginal Metropolis-Hastings by correlating auxiliary variables","263126933":"Multi-objective Reinforcement Learning with Continuous Pareto Frontier Approximation","230266247":"Dynamic style analysis of Spanish balanced pension plans: A Bayesian approach","6275168":"Inferring the skeleton cell cycle regulatory network of malaria parasite using comparative genomic and variational Bayesian approaches","26532310":"Bearings-Only Tracking of Manoeuvring Targets Using Particle Filters","261035981":"Towards a Standalone Methodology for Robust Algorithms Evaluation: A Case Study in 3D Reconstruction","220964200":"InCoME: Integrated Cost Model for Product Line Engineering","267653041":"The smoothed Monte Carlo method in robustness optimization","283500707":"Decomposition into Low-rank plus Additive Matrices for Background/Foreground Separation: A Review for a Comparative Evaluation with a Large-Scale Dataset","47690399":"Estimation of ECHAM5 climate model closure parameters with adaptive MCMC. Atmos Chem Phys","260407244":"George Box and Bayesian inference","220894566":"A Nonparametric Bayesian Learning Model: Application to Text and Image Categorization","242271777":"Zamanla Deien Özbalanimli Cauchy Süreçlerinin Parçacik Süzgeçleri ile Kestirimi* Time-Varying Autoregressive Parameter Estimation of Cauchy Processes by Particle Filters","259538732":"A hierarchical Bayesian approach for the analysis of climate change impact on runoff extremes","264898460":"Performance-Based Reliability Analysis of Laterally Loaded Drilled Shafts","224314630":"Models and Algorithms for Detection and Tracking of Coordinated Groups","229860842":"How Big is Your Neighbourhood? Spatial Implications of Market Participation Among Filipino Smallholders","26798531":"Efficient estimation of decay parameters in acoustically coupled-spaces using slice sampling","257777414":"Adaptive allocation of power transmission for high-altitude platforms","23482680":"Seed dispersal patterns in a temperate forest during a mast event: Performance of alternative dispersal kernels","46545574":"Share prices and accounting variables: a hierarchical Bayesian analysis","266729349":"Bayesian estimation and unit root tests for random coefficient autoregressive models","23281923":"A Dual Receptor Crosstalk Model of G-Protein-Coupled Signal Transduction","251424414":"Two-component mixtures of normal, gamma, and Gumbel distributions for hydrological applications","264556455":"Segmentation of high frequency ultrasound images using a spatially coherent generalized Rayleigh mixture model (regular paper)","255563615":"Why, How and When Do Prices Land? Evidence from the Videogame Industry","277946612":"Integrating geological prior information into the inverse gravimetric problem: the Bayesian approach","229711316":"On optimal control of constrained linear systems with imperfect state information and stochastic disturbances","276082706":"Bayesian quantile regression with approximate likelihood","228179454":"Life Tables in Actuarial Models: From the Deterministic Setting to a Bayesian Approach","262637504":"PARAMETER ESTIMATION OF THE MARGINAL CUMULATIVE DISTRIBUTION FUNCTIONS AND OF THE COPULA APPLIED IN HYDROLOGY","228359669":"Data Driven Intelligent Systems","48419464":"Simulation of hyper-inverse Wishart distributions for non-decomposable graphs","220380488":"Upper bounds on the connection probability for 2-D meshes and tori","220327245":"Wideband array signal processing using MCMC methods.","224439569":"Exploiting Structure in Wavelet-Based Bayesian Compressive Sensing","228892118":"Parameter estimation of a continuous chemical plume source","256476989":"Minimizing Finite Sums with the Stochastic Average Gradient","257629998":"Monte Carlo Simulations of Product Distributions and Contained Metal Estimates","4182090":"Iterative multiuser detection based on Monte Carlo probabilistic data association","41222656":"ABC likelihood-free methods for model choice in Gibbs random fields","220554578":"Learning parameters of Bayesian networks from incomplete data via importance sampling","6842399":"The design of simulation studies in medical statistics. Stat Med","267218837":"The impact of weight matrices on parameter estimation and inference: A case study of binary response using land-use data","241632799":"An efficient stochastic clustering auction for heterogeneous robot teams","221304137":"Towards Improved Observation Models for Visual Tracking: Selective Adaptation","224093477":"A Reduced-State-Space Markov Chain Monte Carlo Method for Iterative Spatial Multiplexing MIMO","286837145":"Bayesian Analysis and Model Selection of GARCH Models with Additive Jumps","235761295":"Relative fixed-width stopping rules for Markov Chain Monte Carlo simulations","276916226":"Response surface methodology considering Poisson and Weibull regression models: a case study","33517941":"Essays in sequential Monte Carlo methods for economics and finance","224873963":"Bayesian Inference for Change Points in Dynamical Systems with Reusable States—a Chinese Restaurant Process Approach","257558486":"On the Statistical Dependence for the Components of Random Elasticity Tensors Exhibiting Material Symmetry Properties","285903238":"A Bayesian non-parametric approach to asymmetric dynamic conditional correlation model with application to portfolio selection","51104646":"A Topographic Latent Source Model for fMRI Data","31146325":"Solidary and Functional Costs: Explaining the Presidential Appointment Contradiction","227425566":"A new proof of convergence of MCMC via the ergodic theorem","224947707":"Integrating biological knowledge into variable selection: an empirical Bayes approach with an application in cancer biology","4366551":"Shannon Capacity for a Simple Communication Channel Model in Dense MANETs","283531376":"Getting started with particle Metropolis-Hastings for inference in nonlinear dynamical models","259174372":"Research-Based Innovation: A Tale of Three Projects in Model-Driven Engineering","220558781":"Modeling and inversion of net ecological exchange data using an Ito stochastic differential equation approach","227343636":"Adaptive Markov Random Fields for Joint Unmixing and Segmentation of Hyperspectral Images","227302679":"A Hierarchical Ornstein–Uhlenbeck Model for Continuous Repeated Measurement Data","226418149":"A Survey of Techniques to Estimate the Uncertainty in Material Parameters","264040231":"Optimization of Decentralized Random Field Estimation Networks Under Communication Constraints through Monte Carlo Methods","228570371":"Ethnicity, insurgency, and civil war revisited","280330280":"Gradient Importance Sampling","263012108":"Accelerating Metropolis-Hastings algorithms: Delayed acceptance with prefetching","230079765":"Scoring Models for Operational Risks","6711493":"Random Partition Models and Exchangeability for Bayesian Identification of Population Structure","31355256":"Dynamic Tempered Transitions for Exploring Multimodal Posterior Distributions","243357222":"Black–Scholes’ model and Bollinger bands","279724037":"On the modeling of breath-by-breath oxygen uptake kinetics at the onset of high-intensity exercises: simulated annealing vs. GRG2 method","235316908":"FE-DD based permittivity tolerance analysis in microwave waveguide filters","261537594":"Population dynamics of species-rich ecosystems: The mixture of matrix population models approach","230587664":"Exact Event-Driven Implementation for Recurrent Networks of Stochastic Perfect Integrate-and-Fire Neurons","258772931":"Bayesian Area-to-Point Kriging using Expert Knowledge as Informative Priors","263530245":"Fuzzy-Based Model for Predicting Failure of Oil Pipelines","50875321":"Sampling-based optimization with mixtures","261058365":"Adaptive filtering in the presence of outliers","30515554":"Modèles bayésiens hiérarchiques pour le traitement multi-capteur","230569226":"New Insights Into Approximate Bayesian Computation","220462485":"Management of the risk of wind damage in forestry: A graph-based Markov decision process approach","280911878":"Stochastic modeling and survival analysis of marginally trapped neutrons for a magnetic trapping neutron lifetime experiment","228767003":"Hierarchical spatial models of abundance and occurrence from imperfect survey data","23593426":"A Stochastic-Dynamic Model for the Spatial Structure of Forecast Error Statistics","225428948":"Multivariate Bayesian analysis of atmosphere-ocean general circulation models. Environ Ecol Stat","278759457":"Identification of non-parametric probabilistic models from measured transfer functions","260138813":"On Sampling with Prescribed Second-order Inclusion Probabilities","30073207":"Planning under risk and uncertainty","44567062":"Estimation de modèles markoviens discrets dans un cadre industriel fiabiliste à données manquantes","1771684":"Uncertainty quantification in complex systems using approximate solvers","227423566":"Simulation of conditioned diffusion and application to parameter estimation","221619700":"Bayesian Estimation of Time-Frequency Coefficients for Audio Signal Enhancement.","4253825":"Sparsity Promotion Models for the Choquet Integral","265645844":"A Unified Framework of Latent Feature Learning in Social Media","23456167":"Latent-Space Variational Bayes","221967865":"Change Point Estimation in Monitoring Survival Time","32964913":"Universal Transfer Learning","220626400":"Monte Carlo simulation for solving Fredholm integral equations","23968170":"Hierarchical Bayesian Markov switching models with application to predicting spawning success of shovelnose sturgeon","23787936":"Latimer, A. M., S. Banerjee, H. Sang, E. S. Mosher, and J. A. Silander. Hierarchical models facilitate spatial analysis of large data sets: a case study on invasive plant species in the northeastern United States. Ecology Letters","277633094":"Stochastic progressive failure analysis of laminated composite plates using Pucks failure criteria","23968161":"Parameter estimation for partially observed hypoelliptic diffusions","221083104":"Modeling Interference in Wireless Ad Hoc Networks","10606703":"Bayesian Latent Variable Models for Median Regression on Multiple Outcomes","222549388":"Approximate Bayesian inference for hierarchical Gaussian Markov random fields","223618437":"Prediction of geometric uncertainty effects on Fluid Dynamics by Polynomial Chaos and Fictitious Domain method","221607399":"Crowd-Based Data Sourcing - (Abstract).","270594292":"Likelihood-free Bayesian inference on the minimum clinically important difference","10606708":"Autoregressive Models for Capture-Recapture Data: A Bayesian Approach","282298373":"Fast r-adaptivity for multiple queries of heterogeneous stochastic material fields","262678384":"Mortality inequality in populations with equal life expectancy: Arriaga\u0027s decomposition method in SAS, Stata, and Excel","44698226":"Coregulation of Ion Channel Conductances Preserves Output in a Computational Model of a Crustacean Cardiac Motor Neuron","264623908":"Discrepancy Estimates for Acceptance-Rejection Samplers Using Stratified Inputs","254062528":"Two-Branch Selection in Wireless Space-Diversity Reception: An Upper Bound for its Output Power","234089749":"BroadPeak: A novel algorithm for identifying broad peaks in diffuse ChIP-seq datasets","225287556":"Bayesian shared spatial-component models to combine and borrow strength across sparse disease surveillance sources","24136090":"Modeling Foreign Exchange Rates with Jumps","33929966":"Numerical study of spin-fermion models for diluted magnetic semiconductors and high Tc cuprates [electronic resource] /","258211729":"A Hierarchical Multilevel Markov Chain Monte Carlo Algorithm with Applications to Uncertainty Quantification in Subsurface Flow","236871405":"Bayesian Multi-Dipole Modeling of Single MEG Topographies by Adaptive Sequential Monte Carlo Samplers","2734298":"A quick introduction to Markov chains and Markov chain Monte Carlo","274407592":"A new network approach to Bayesian inference in partial differential equations: A New Network Approach to Bayesian Inference in Partial Differential Equations","264429366":"Predictive Modeling and Uncertainty Quantification of Laser Shock Processing by Bayesian Gaussian Processes With Multiple Outputs","290372025":"Additional file 1","4372666":"A new survey on knowledge discovery and data mining","221885889":"Epidemiological models of Mycobacterium tuberculosis complex infections","11546697":"Spatial Mixture Relative Risk Models Applied to Disease Mapping","46447165":"Concepts of and tools for Nonlinear Time-Series Modelling","235945706":"Parameter estimation in models with hidden variables : An application to a biotech process","226663801":"Estimation of the Parameters in an Item-Cloning Model for Adaptive Testing","44319327":"Calculation of Posterior Probabilities for Bayesian Model Class Assessment and Averaging from Posterior Samples Based on Dynamic System Data","224249249":"A Monte Carlo Method for Mobile Target Counting","289860024":"Bayesian inversion of multi-mode NEMS mass spectrometry signal","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","226890886":"Introduction to Markov Chain Monte Carlo Methods in Molecular Evolution","220464164":"A Combinatorial Optimization Approach for Determining Composition and Sequence of Polymers","228856996":"The Bayesian approach to default risk: A guide","267120362":"Multicanonical MCMC for sampling rare events: An illustrative review","260054658":"Computers in the Human Interaction Loop","280932795":"State-dependent swap strategies and automatic reduction of number of temperatures in adaptive parallel tempering algorithm","225928318":"Classifier evaluation and attribute selection against active adversaries","285065719":"Connectivity for 3 3 K contingency tables","235300620":"Reducing simulation time using design of experiments","224576617":"Specification and synthesis of sensory datasets in pervasive spaces","45495229":"Discovery of complex pathways from observational data","35658540":"Spatial small area analyses of disease risk around sources of environmental pollution : modelling tools for a system using high resolution register data /","4993344":"Inference and model choice for sequentially ordered hidden Markov models","228957352":"Efficiency and sensitivity of methods for assessing ambiguity in data association decisions - art. no. 69690V","285462542":"Numerical Aspects in the Evaluation of Measurement Uncertainty","242073443":"Hierarchical Models in Environmental Science","45915058":"Bayesian estimation of regularization and PSF parameters for Wiener-Hunt deconvolution","41089916":"Meta-regression with partial information on summary trial or patient characteristics","224183379":"Simultaneous state and parameter estimation for physics-based tracking of heart surface motion","230618287":"Bayesian model selection validates a biokinetic model for zirconium processing in humans","3207458":"Estimation via Markov chain Monte Carlo","224117833":"A New Start-Up Demonstration Test","227300505":"Site-specific prediction for energy simulation by integrating computational fluid dynamics","280793513":"Chapter 6. Statistical Methods for Distributional Analysis","24135784":"\"Markov Switching Asymmetric Stochastic Volatility Model with Application to TOPIX Data -A Permutation Sampler Approach-\"(in Japanese)","50518555":"Device-free localization with received signal strength measurements in wireless networks","228945081":"A Frank mixture copula family for modeling higher-order correlations of neural spike counts","228316345":"Efficient High-Dimensional Importance Sampling in Mixture Frameworks","225080398":"Identifying targets of multiple co-regulating transcription factors from expression time-series by Bayesian model comparison","230706405":"Exact Hamiltonian Monte Carlo for Truncated Multivariate Gaussians","227009696":"Adaptive Importance Sampling in General Mixture Classes","267212485":"EFFICIENT PARTICLE-BASED ONLINE SMOOTHING IN GENERAL HIDDEN MARKOV MODELS","7381337":"On the Multivariate Probit Model for Exchangeable Binary Data with Covariates","249601998":"Advanced Feature Recognition and Classification Using Artificial Intelligence Paradigms","224197746":"Determining the Point of Minimum Error for 6DOF Pose Uncertainty Representation","224138350":"Turbo reconstruction of structured sparse signals","4338033":"Learning fuzzy measure parameters by logistic LASSO","227845280":"Combining numerical model output and particulate data using Bayesian space–time modeling","4772221":"Approximating hidden Gaussian Markov random fields","216817114":"Surrogating the surrogate: accelerating Gaussian-process-based global optimization with a mixture cross-entropy algorithm","5661025":"Statistical estimation of transmission loss from geoacoustic inversion using a towed array","225309786":"Toward Bayesian uncertainty quantification for forestry models used in the United Kingdom Greenhouse Gas Inventory for land use, land use change, and forestry","239828851":"The Probability Approach to Default Probabilities","228920476":"Bayesian estimation of semiparametric duration models with spatial dependence","225236053":"A Statistician’s View on Bayesian Evaluation of Informative Hypotheses","41483077":"Inference in hybrid systems with applications in neural prosthetics","279968145":"Riemannian Gaussian Distributions on the Space of Symmetric Positive Definite Matrices","229514384":"Probability from chaos","220136480":"A Variant of Importance Splitting for Rare Event Estimation: Fixed Number of Successes","238053233":"STATISTICAL DESIGN AND IMAGING OF POSITION-ENCODED 3D MICROARRAYS","258371109":"One-dimensional PIC (Particle In Cell) simulation of electrostatic solitary waves and double layers in a nonthermal electron distributed plasma","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","291573797":"Formal Approach for Route Agility against Persistent Attackers","228613360":"Bayesian Risk Aggregation: Correlation Uncertainty and Expert Judgement","226993367":"Non-stationary covariance function modelling in 2D least-squares collocation","220451955":"DECODE: A new method for discovering clusters of different densities in spatial data","258278967":"Quantification of Cloud Microphysical Parameterization Uncertainty Using Radar Reflectivity","281340306":"Coalescent: An open-science framework for importance sampling in coalescent theory","228400324":"Modular Design Method for Sustainable Life-Cycle of Product Family Considering Future Market Changes","41827107":"A Hierarchical Model to Estimate Fish Abundance in Alpine Streams by using Removal Sampling Data from Multiple Locations","4993299":"Bayesian variable selection and regularization for time-frequency surface estimation","282831236":"Convergence of Monte Carlo distribution estimates from rival samplers","291827718":"An entropy-driven method for exploring extreme and unexpected accident scenarios in the risk assessment of dynamic engineered systems","257392181":"A goal-based approach for qualification of new technologies: Foundations, tool support, and industrial validation","6772997":"An alternative competing risk model to the Weibull distribution in lifetime data analysis","7514385":"Estimation of Amino Acid Residue Substitution Rates at Local Spatial Regions and Application in Protein Function Inference: A Bayesian Monte Carlo Approach","233266308":"Preserving spatial structure for inverse stochastic simulation using blocking Markov chain Monte Carlo method","259218966":"Interpreting Thermal 3D Models of Indoor Environments for Energy Efficiency","224298040":"Distributed Filtering with Wireless Sensor Networks","245366776":"A Clustering-Based Surrogate Model Updating Approach to Simulation-Based Engineering Design","4221224":"Unified framework for sampling/importance resampling algorithms","251903594":"Executive stock option pricing based on volatility estimated by SV-GED model: Evidence from Shanghai and Shenzhen 300 Index","6322443":"Unsupervised clustering of over-the-counter healthcare products into product categories","227818744":"Estimating the number of ozone peaks in Mexico City using a non‐homogeneous Poisson model","226727150":"Bayesian stochastic modelling for avalanche predetermination: From a general system framework to return period computations","238522179":"A Bayesian inference approach for batch trajectory estimation","51604070":"Lack of confidence in approximate Bayesian computational (ABC) model choice","283531667":"The sample size required in importance sampling","264466100":"Independent doubly Adaptive Rejection Metropolis Sampling","4772144":"Bayesian inversion of geoelectrical resistivity data","261193449":"A subspace-based variational Bayesian method","225418262":"Hierarchical space-time modelling of epidemic dynamics: An application to measles outbreaks","281901494":"Fast Bayesian approach to model calibration of vehicle occupant restraint systems","273318198":"Bayesian Modeling for Robust Synthesis of Nanostructures","234019982":"Markov chain Monte Carlo inference for Markov jump processes via the linear noise approximation","277772787":"Towards Smooth Particle Filters for Likelihood Estimation with Multivariate Latent Variables","261416468":"Dual-arm redundancy resolution based on null-space dynamically-scaled posture optimization","47356752":"MetAssimulo:Simulation of Realistic NMR Metabolic Profiles","227644434":"On the Flexibility of Metropolis–Hastings Acceptance Probabilities in Auxiliary Variable Proposal Generation","30513234":"Modèles linéaires généralisés à effets aléatoires : contributions au choix de modèle et au modèle de mélange","255909571":"On Generalized Bayesian Data Fusion with Complex Models in Large Scale Networks","228813863":"The regression analysis of correlated interval-censored data: Review of accelerated failure time models with flexible distributional assumptions","220736684":"Biochemical Transport Modeling, Estimation, and Detection in Realistic Environments","5788125":"Application of the Hotelling and ideal observers to detection and localization of exoplanets","228623402":"Sequential Monte Carlo methods for the optimization of a general class of objective functions","220066967":"Theory and Use of the EM Algorithm","265121345":"Complex Probability Theory and Prognostic","5142978":"Computational Statistics","260275726":"A Bayesian direction-of-arrival model for an undetermined number of sources using a two-microphone array","4993474":"A latent Gaussian model for compositional data with zeros","280924462":"Incorporating heterogeneity into count data models in marketing.","226749459":"Decomposing inequalities in performance scores: The role of student background, peer effects and school characteristics","221621409":"Speedup and Tracking Accuracy Evaluation of Parallel Particle Filter Algorithms Implemented on a Multicore Architecture.","255737515":"Identification of Growth Phases and Influencing Factors in Cultivations with AGE1.HN Cells Using Set-Based Methods","227617800":"Environmental risk assessment in the Tuscany region: A proposal","288989346":"COOPERATIVE PARALLEL PARTICLE FILTERS FOR ON-LINE MODEL SELECTION AND APPLICATIONS TO URBAN MOBILITY","281035101":"A Hierarchical Multilevel Markov Chain Monte Carlo Algorithm with Applications to Uncertainty Quantification in Subsurface Flow","8159708":"Semi-parametric modelling for costs of health care technologies","47819641":"Robust adaptive Metropolis algorithm with coerced acceptance rate","221064335":"Humanoid robot noise suppression by particle filters for improved automatic speech recognition accuracy","221478039":"Estimating noise from noisy speech features with a Monte Carlo variant of the expectation maximization algorithm","285391014":"The R Book, Second Edition","51892927":"Ergodic Mirror Descent","24199384":"A mating method for inbreeding and multitrait selection in dairy cattle populations","220320906":"Linear-Time Estimators for Propensity Scores.","284897621":"Innovation for Failure Detection and Correction in Safety-Related Systems Which Based on a New Estimator","261344800":"Bayesian robust adaptive beamforming based on random steering vector with bingham prior distribution","224345316":"Detection of Multiple Changes in Fractional Integrated ARMA Processes","276462022":"Supply Chain Inventory Coordination under Uncertain Demand via Combining Monte Carlo Simulation and Fitness Inheritance PSO","228875289":"Joint Regional Simulation of Annual Area Burned in Canadian Forest Fires","224236771":"A Fade Level Skew-Laplace Signal Strength Model for Device-Free Localization with Wireless Networks","240500630":"Evaluation des modèles de calcul des flux polluants des rejets urbains par temps de pluie","46494465":"A mixture model-based approach to the clustering of exponential repeated data","3912190":"Sequential Monte Carlo filtering techniques applied to integrated navigation systems","51966685":"Measure transformation and efficient quadrature in reduced-dimensional\nstochastic modeling of coupled problems","289826945":"Case Studies in Bayesian Statistical Modelling and Analysis","41505712":"Capacity access in telecommunication networks: evaluating the symmetry of cost-based access prices using option pricing theory","23759011":"Estimating population haplotype frequencies from pooled DNA samples using PHASE algorithm","220060887":"Scalability of Parallel Scientific Applications on the Cloud","51966674":"Dimension reduction in stochastic modeling of coupled systems","233991225":"A rejection sampling scheme for posterior probability distributions via the ratio-of-uniforms method","220343532":"Bayesian learning of graphical vector autoregressions with unequal lag-lengths","226645069":"Satellite-based precipitation measurement using PERSIANN system","29607955":"On Adaptive Resampling Procedures for Sequential Monte Carlo Methods","233991203":"New Accept/Reject Methods for Independent Sampling from Posterior Probability Distributions","287973627":"Recursive Deviance Information Criterion for the Hidden Markov Model","267763239":"An improved Bayesian inversion method for the estimation of multimodal particle size distributions using Multiangle Dynamic Light Scattering measurements","6889914":"Major gene detection for fusiform rust resistance using Bayesian complex segregation analysis in loblolly pine","272845206":"Adaptive numerical designs for the calibration of computer codes","251189037":"Frequentist analysis of hierarchical models for population dynamics and demographic data","259114660":"Hierarchical Approximate Bayesian Computation","228838517":"DIGRAPH DYNAMICS WITH HETEROGE-NEOUS VERTICES","229364854":"Terraced fields and Mediterranean landscape structure: An analytical case study from Antikythera, Greece","226151591":"MEMS yield simulation with Monte Carlo method","265317902":"Markov Chain Monte Carlo and Numerical Differential Equations","4772247":"Ascent-based Monte Carlo expectation- maximization","250685201":"A Model Based Approach to Statistical, Multi-Modal Sensor Fusion","229020742":"Traffic analysis for the calibration of risk assessment methods","288073930":"From low- to high-energy nuclear data evaluations","266147387":"Identification of jump Markov linear models using particle filters","265416246":"Recommendations for the tuning of rare event probability estimators","221986001":"Hierarchical multispectral galaxy decomposition using a MCMC algorithm with multiple temperature simulated annealing","3232218":"Estimation of Transmission Loss in the Presence of Geoacoustic Inversion Uncertainty","231609381":"Extending INLA to a class of near-Gaussian latent models","4993442":"Assessing Poisson variation of intestinal tumor multiplicity in mice carrying a Robertsonian translocation","225053828":"Semi-blind Sparse Image Reconstruction with Application to MRFM","220343501":"Using duration models to reduce fragmentation in audio segmentation","277330293":"Real-Time Prognosis of Crack Growth Evolution Using Sequential Monte Carlo Methods and Statistical Model Parameters","271473112":"Uncertainty in prognostics: Computational methods and practical challenges","281030969":"Bayesian Estimation for Target Tracking: Part III, Monte Carlo Filters","234083337":"Efficient Bayesian estimation of Markov model transition matrices with given stationary distribution","2480602":"A Bayesian Approach to Bergman\u0027s Minimal Model","280898238":"Book reviews, Winter 2011","225122155":"A Probability Conditioning Method (PCM) for Nonlinear Flow Data Integration into Multipoint Statistical Facies Simulation","284924665":"Rare Event Simulation in Finite-Infinite Dimensional Space","222113598":"Understanding the behavior of financial ratios: The adjustment process","3457591":"Low Bit-Rate Object Coding of Musical Audio Using Bayesian Harmonic Models","47861980":"Interacting and Annealing Particle Filters: Mathematics and a Recipe for Applications","241871971":"Probability Collectives for Optimization of Computer Simulations","24052580":"Optimal Estimation and Cramér-Rao Bounds for Partial Non-Gaussian State Space Models","220499752":"An Effective Bayesian Neural Network Classifier with a Comparison Study to Support Vector Machine","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","260636060":"Distributed Fusion of PHD Filters Via Exponential Mixture Densities","224200520":"Instrument parameter estimation in Bayesian convex deconvolution","228652982":"Spike and slab prior distributions for simultaneous Bayesian hypothesis testing, model selection, and prediction, of nonlinear outcomes","24136551":"Spatial models for flood risk assessment","267625962":"An Integrated Procedure for Bayesian Reliability Inference Using MCMC","1919495":"Bayesian Inference on Finite Mixtures of Distributions","220438328":"How to Improve Postgenomic Knowledge Discovery Using Imputation","249375937":"Correcting for Survey Misreports Using Auxiliary Information with an Application to Estimating Turnout","261504394":"A nonparametric Bayesian approach for enhanced pedestrian detection and foreground segmentation","221617960":"Hot Coupling: A Particle Approach to Inference and Normalization on Pairwise Undirected Graphs.","47792327":"Toward better QSAR/QSPR modeling: Simultaneous outlier detection and variable selection using distribution of model features","220286782":"A generalization of the adaptive rejection sampling algorithm","23493446":"Bayesian Clustering of Fuzzy Feature Vectors Using a Quasi-Likelihood Approach","229900179":"Spatial analysis of relative risk of lip cancer in Iran: a Bayesian approach","228603782":"Predicting the outcome of a game","270909955":"Do learning rates adapt to the distribution of rewards?","4137496":"A fast importance sampling algorithm for unsupervised learning of over-complete dictionaries","7842384":"On the Number of New World Founders: A Population Genetic Portrait of the Peopling of the Americas","256081252":"Missile target accuracy estimation with importance splitting","257408368":"Harris-SOM","285590317":"Common method bias in PLS-SEM: A full collinearity assessment approach","12442261":"From Quantal Counts to Mechanisms and Systems: The Past, Present, and Future of Biometrics in Environmental Toxicology","220286729":"Improved auxiliary mixture sampling for hierarchical models of non-Gaussian data. Statistics and Computing, 19, 479-492","49856720":"Statistical Design of Position-Encoded Microsphere Arrays","228919179":"Forecasting household response in database marketing: A latent trait approach","281418473":"Challenging Differential Privacy:The Case of Non-interactive Mechanisms","250918087":"Residual Component Analysis of Hyperspectral Images—Application to Joint Nonlinear Unmixing and Nonlinearity Detection","262849950":"Interspecific relationships and environmentally driven catchabilities estimated from fisheries data","282864360":"Weighted Principal Component Analysis for Wiener System Identification - Regularization and non-Gaussian Excitations","261199268":"A storage life modeling based on fuzzy stress-strength interface reliability model","220555026":"A computation method in robust Bayesian decision theory","224907102":"Adaptive parallel tempering algorithm","282311400":"Jeffreys’ priors for mixture estimation","224130919":"Optimal cost preventative maintenance scheduling for high reliability aerospace systems","5552662":"Bayesian semiparametric ROC curve estimation and diagnosis","46493831":"On variance stabilisation in Population Monte Carlo by double Rao-Blackwellisation","45279473":"A stochastic model of the single photon response in Drosophila photoreceptors","3320438":"Monte Carlo Methods for Adaptive Sparse Approximations of Time-Series","227540934":"Bayesian analysis of mixture of autoregressive components with an application to financial market volatility","261486047":"Simulation in Statistics","276923083":"Sequential Bayesian inference for implicit hidden Markov models and current limitations","254037359":"Channel capacity in dense MANETs for a propagation model considering the law of conservation of energy and fading","228962286":"Cooperative adaptive sampling of random fields with unknown covariance","275055145":"Probabilistic Clustering of Time-Evolving Distance Data","251964746":"Market-based transmission expansion planning under uncertainty","11473632":"On Estimation and Prediction for Spatial Generalized Linear Mixed Models","51947849":"Adaptive Bayesian multivariate density estimation with Dirichlet mixtures","227694533":"Ocean ensemble forecasting. Part I: Ensemble Mediterranean winds from a Bayesian hierarchical model","11473655":"Bayesian Models for Multivariate Current Status Data with Informative Censoring","281340573":"Impact of homicide and traffic crashes on life expectancy in the largest Latin American country","24111924":"An Adaptive Version for the Metropolis Adjusted Langevin Algorithm with a Truncated Drift","243414233":"LETTERS AND COMMENTS: Importance sampling: how to approach the optimal density?","44902640":"Bayesian estimation of regularization and point spread function parameters for Wiener-Hunt deconvolution","232257418":"The Impact of Winter and Spring Temperatures on Temperate Tree Budburst Dates: Results from an Experimental Climate Manipulation","4909589":"Bayesian Forecasting of an Inhomogeneous Poisson Process With Applications to Call Center Data","224145214":"Influence of particle filter parameters on error correction accuracy in traffic surveillance using sensor networks","225437450":"An unscented particle filter for ground maneuvering target tracking","46538915":"Space-time modelling of precipitation by using a hidden Markov model and censored Gaussian distributions","282837693":"Robust recovery of wideband block-sparse spectrum based on MAP and MMSE estimator","256840997":"Input variable selection in time-critical knowledge integration applications: A review, analysis, and recommendation paper","5026337":"Estimating Nonlinear Dynamic Equilibrium Economies: A Likelihood Approach","235895904":"Estimating the Granularity Coefficient of a Potts-Markov Random Field Within a Markov Chain Monte Carlo Algorithm","282460838":"Determining the causes behind the collapse of a small pelagic fishery using Bayesian population modeling","264773049":"Why the Monte Carlo method is so important today","283273878":"Tractable Bayesian teaching","268250507":"Statistical and Computational Inverse Problems, (. . . and a little uncertainty quantification)","264424884":"Uncertainty in Nutrient Spiraling: Sensitivity of Spiraling Indices to Small Errors in Measured Nutrient Concentration","1921642":"Incorporating a contrast in the Bayesian formula: What consequences for the MAP estimator and the posterior distribution? Applications in spatial statistics","227536886":"Bayesian power-spectrum inference for Large Scale Structure data","4762162":"Introduction to Applied Bayesian Statistics and Estimation for Social Scientists by Scott M. Lynch","29973426":"Traitement statistique du signal spectrométrique: étude du désempilement de spectre en énergie pour la spectrométrie Gamma","49907842":"Lack of confidence in ABC model choice","281488058":"ABORT-like detectors: a Bayesian approach","6273570":"The SAEM algorithm for group comparison tests in longitudinal data analysis based on non-linear mixed-effects model","228222746":"Inference on Impulse Response Functions in Structural VAR Models","277289477":"1 Introduction Preliminary Dissertation Proposal","4993736":"Stationary Autoregressive Models via a Bayesian Nonparametric Approach","222062520":"Simultaneous credible intervals for small area estimation problems","259704318":"Supervised nonlinear spectral unmixing using a post-nonlinear mixing model for hyperspectral imagery","259298800":"Simulation based methods for model updating in structural condition assessment","228812581":"Correcting wind-induced bias in solid precipitation measurements in case of limited and uncertain data","248257604":"Using all Metropolis-Hastings proposals to estimate mean values","264717646":"Extending Integrated Nested Laplace Approximation to a Class of Near-Gaussian Latent Models","5110468":"2001 Lawrence R. Klein Lecture Estimating Distributions of Treatment Effects with an Application to the Returns to Schooling and Measurement of the Effects of Uncertainty on College Choice","47642714":"Rejoinder to ???Joint Regression Analysis for Discrete Longitudinal Data??? by Madsen and Fang","261717268":"Parameter-Independent Model Reduction of Transient Groundwater Flow Models: Application to Inverse Problems","228953899":"Recovery of the coefficients of the elastodynamics equation using two statistical estimators","261225758":"The Infinite Hidden Markov Random Field Model Based on Student\u0027s t-Distribution","275167977":"Some Recent Results in Rare Event Estimation","255991254":"PROGRAM COMPACTION FOR REAL-TIME APPLICATIONS","275833572":"The BPP program for species tree estimation and species delimitation","47347783":"Spatial and temporal patterns of CH\u003csub\u003e4\u003c/sub\u003e and N\u003csub\u003e2\u003c/sub\u003eO fluxes in terrestrial ecosystems of North America during 1979–2008: application of a global biogeochemistry model","228677431":"Convergence of adaptive MCMC algorithms: Ergodicity and law of large numbers","261051671":"On the estimation accuracy of degree distributions from graph sampling","51523976":"Simultaneous estimation of multiple quantitative trait loci and growth curve parameters through hierarchical Bayesian modeling","41031919":"Guaranteed steady-state bounds for uncertain chemical processes","263273772":"Uncertainty in nutrient spiraling: sensitivity of uptake calculations to small errors in nutrient concentration","266749304":"Bayesian inference and model comparison for random choice structures","220207039":"A multi-resolution, non-parametric, Bayesian framework for identification of spatially-varying model parameters","283495034":"Dose-response-time modelling: Second-generation turnover model with integral feedback control","230569757":"On the Convergence Rates of Some Adaptive Markov Chain Monte Carlo\nAlgorithms","260166946":"Decomposition Sampling applied to Parallelization of Metropolis-Hastings","228656901":"Forecasting the yield curve with linear factor models","261254455":"Direct Learning of Sparse Changes in Markov Networks by Density Ratio Estimation","51935677":"Reverse engineering gene regulatory networks using approximate Bayesian\ncomputation","4260585":"On Probability of Making a Given Decision: A Theoretically Justified Transition From Interval to Fuzzy Uncertainty","226410454":"Dynamic Linear Models with R","269116067":"Sparse Variational Bayesian Approximations for Nonlinear Inverse Problems: applications in nonlinear elastography","238879895":"Transdimensional Markov Chains","229787423":"A Bayesian approach to Lagrangian data assimilation","272861939":"Sensitivity of Subjective Decisions in the GLUE Methodology for Quantifying the Uncertainty in the Flood Inundation Map for Seymour Reach in Indiana, USA","227276601":"An Introduction to MCMC for Machine Learning","221118367":"A System Dynamics Approach to Modeling the Sensitivity of Inappropriate Emergency Department Utilization","51659169":"A Detailed History of Intron-rich Eukaryotic Ancestors Inferred from a Global Survey of 100 Complete Genomes","265508198":"Bayesian trend analysis of extreme wind using observed and hindcast series off the Catalan coast, NW Mediterranean Sea","276922932":"Statistical unfolding of elementary particle spectra: Empirical Bayes estimation and bias-corrected uncertainty quantification","237153429":"A hierarchical model to estimate the abundance and biomass of salmonids by using removal sampling and biometric data from multiple locations","278733354":"Bayesian Inference for the Multivariate Extended-Skew Normal Distribution","254211484":"Penalized wavelets: Embedding wavelets into semiparametric regression","278733347":"Accelerated dimension-independent adaptive Metropolis","51913126":"Bayesian Decision-theoretic Methods for Parameter Ensembles with\nApplication to Epidemiology","51245491":"A rank-based statistical test for measuring synergistic effects between two gene sets","44261475":"Robustness Analysis of Pulse Width Modulation Control of Motor Speed","220538853":"Online Aggregation for Large MapReduce Jobs","30515989":"Optimisation robuste des réseaux de télécommunications","229449576":"Bayesian density estimation using ranked set samples","220411877":"Mixed Multiscale Finite Element Methods for Stochastic Porous Media Flows","263929213":"Bayesian inferences on mixture of two Von-Mises distribution","259626417":"Hierarchical Dose-Response Modeling for High-Throughput Toxicity Screening of Environmental Chemicals","261700944":"Using informative priors in the estimation of mixtures over time with application to aerosol particle size distributions","228151125":"Bayesian Multi-Resolution Spatial Analysis with Applications to Marketing","225832891":"Earth return path impedances of underground cable for three-layer earth","47335453":"BPDA - A Bayesian peptide detection algorithm for mass spectrometry","283247152":"Bayesian updating and model class selection with Subset Simulation","44843134":"Semiparametric regression and graphical models","254694909":"The Particle Filter in Practice","224229262":"Method for detection and confirmation of multiple failure modes with numerous survivor data","224229256":"Method for investigating repair/refurbishment effectiveness","26657600":"Highest Density Difference Region Estimation with Application to Flow Cytometric Data","233379646":"Nonlinear Bayesian Filtering in the Gaussian Scale Mixture Context","257162628":"Analysing the influence of crop management on pesticide use intensity while controlling for external sources of variability with Linear Mixed Effects Models","256660891":"High-degree Cubature Kalman filter","246547563":"Sakari Salonen J., Ilvonen L., Seppä H., Holmström L., Telford R.J., Gaidamavičius A., Stančikaitė M., Subetto D. 2012. Comparing different calibration methods (WA/WA-PLS regression and Bayesian modelling) and different-sized calibration sets in pollen-based quantitative climate reconstruction. The Holocene, 22(4), 413–424.","7449258":"Concordance correlation coefficient applied to discrete data","254049791":"An importance sampling method based on a one-step look-ahead density from a Markov chain","258823601":"A generalized, likelihood-free method for posterior estimation","29973268":"Evaluation des modèles de calcul des flux polluants des rejets urbains par temps de pluie: Apport de l\u0027approche bayésienne","230795036":"Multiresolution Gaussian Processes","280773217":"A MAP approach for $\\ell_q$-norm regularized sparse parameter estimation using the EM algorithm","228525889":"Automatic Markov chain Monte Carlo procedures for sampling from multivariate distributions","5298831":"Sustainable long-term conservation of rare cattle breeds using rotational AI sires","265809207":"Eberle, A.: Error bounds for Metropolis-Hastings algorithms applied to perturbations of gaussian measures in high dimensions. Ann. Appl. Probab. 24(1), 337-377","249429052":"A Bayesian approach to determining and parametrizing earthquake focal mechanisms","45895774":"Introducing Monte Carlo Methods with R Solutions to Odd-Numbered Exercises","38006949":"Multistage mean-variance portfolio selection in cointegrated vector autoregressive systems","260838763":"A joint frailty model to estimate the recurrence process and the disease-specific mortality process without needing the cause of death","253185510":"Mixture of Skewed alpha-Stable Distributions","6140588":"Farcomeni AA review of modern multiple hypothesis testing, with particular attention to the false discovery proportion. Stat Methods Med Res 17:347-388","224333742":"Statistical Modeling with SystemC-AMS for Automotive Systems","259704201":"Supervised nonlinear spectral unmixing using a polynomial post nonlinear model for hyperspectral imagery","267552006":"Preemptive Bidding, Target Resistance and Takeover Premia: An Empirical Investigation We are grateful to","260707711":"Twenty Years of Mixture of Experts","220848092":"Astrophysical Source Separation Using Particle Filters","2486995":"How to Combine Fast Heuristic Markov Chain Monte Carlo with Slow Exact Sampling","260683134":"Optimal Oral Antithrombotic Regimes for Patients with Acute Coronary Syndrome: A Network Meta-Analysis","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","4919988":"Bayesian Survival Analysis Using Bernstein Polynomials","283761174":"Emission of toxic chemicals from traditional cigarette and e-cigarette side-stream smoke","48415202":"Conditional simulations","252177414":"Inclusion of historical information in flood frequency analysis using a Bayesian MCMC technique: a case study for the power dam Orlík, Czech Republic","224503395":"State your position","220855852":"Dynamically Identifying and Tracking Contaminants in Water Bodies","281992139":"Variational Bayesian approximation with scale mixture prior: a comparison between three algorithms","255829049":"A study of solitary wave trains generated by injection of a blob into plasmas","5487450":"Probabilistic Inference of Transcription Factor Binding from Multiple Data Sources","26335899":"Respondent Driven Sampling as Markov Chain Monte Carlo","221304380":"MCMC-Based Multiview Reconstruction of Piecewise Smooth Subdivision Curves with a Variable Number of Control Points","236694794":"Toward Trait-Based Mortality Models for Tropical Forests","226170473":"Robustness-based design optimization under data uncertainty","269591299":"On the maximum likelihood estimation of the ToA under an imperfect path loss exponent","257397828":"Nonautonomous Stochastic Search in Global Optimization","262376629":"Multi-scale information, network, causality, and dynamics: mathematical computation and Bayesian inference to cognitive neuroscience and aging","221842990":"Supervised Nonlinear Spectral Unmixing Using a Postnonlinear Mixing Model for Hyperspectral Imagery","223966788":"Probabilistic Latent Tensor Factorization Model for Link Pattern\nPrediction in Multi-relational Networks","228949690":"MCMC METHODS FOR INCOMPLETE STRUCTURAL MODELS OF SOCIAL INTERACTIONS","267926759":"nihms-452672","225818196":"Neural Probabilistic Language Models","282334192":"Identifying climatic drivers of tropical forest dynamics","227954354":"A Bayesian hierarchical approach to ensemble weather forecasting","257627251":"Variational learning for dirichlet process mixtures of Dirichlet distributions and applications. Multimedia Tools Appl 1-18","227704507":"Tuning and control of dimensional consistency in molded products","4772710":"A semiparametric multilevel survival model","226774698":"Bayesian Data—Model Integration in Plant Physiological and Ecosystem Ecology","44677531":"Approximate inference for disease mapping with sparse Gaussian processes","263599237":"Bayesian state space models with time-varying parameters: Interannual temperature forecasting","281814009":"Kullback-Leibler Divergence-Based Differential Evolution Markov Chain Filter for Global Localization of Mobile Robots","260062390":"Bayesian analysis of zero inflated spatiotemporal HIV/TB child mortality data through the INLA and SPDE approaches: Applied to data observed between 1992 and 2010 in rural North East South Africa","221914636":"Multi-Classifier Approaches for Post-Placement Surface-Mount Devices Quality Inspection","261121192":"Decoding Fingerprinting Using the Markov Chain Monte Carlo Method","6554461":"Weighted distributions and estimation of resource selection probability Functions","3457805":"Joint Detection and Tracking of Time-Varying Harmonic Components: A Flexible Bayesian Approach","224149093":"Markov Chain Monte Carlo MIMO Detection for Systems with Imperfect Channel State Information","254393360":"Mean-plus-noise factor models: An empirical exploration","51965988":"A multi-point Metropolis scheme with generic weight functions","4789110":"Subsample distribution distance and McMC convergence","47864293":"Large Deviation Theory for a Homogenized and \"Corrected\" Elliptic ODE","258243623":"A Tutorial on Bernoulli Filters: Theory, Implementation and Applications","227645140":"“What You Match Does Matter: The Effects of Data on DSGE Estimation","260838602":"How Large is Congressional Dependence in Agriculture? Bayesian Inference about ‘Scale’ and ‘Scope’ in Measuring a Spatial Externality","222834177":"Application of Subset Simulation Methods to Reliability Benchmark Problems","3320699":"Covariance Matrix Estimation With Heterogeneous Samples","46582156":"Rate estimation in partially observed Markov jump processes with measurement errors","51683422":"Lower confidence bounds for prediction accuracy in high dimensions via AROHIL Monte Carlo","264983681":"Extensions of saddlepoint-based bootstrap inference","266540204":"Applicability of Subsampling Bootstrap Methods in Markov Chain Monte Carlo","261448922":"Monte Carlo methods in spatio-temporal regression modeling of migration in the EU","224878134":"Accelerated maximum likelihood parameter estimation for stochastic biochemical systems","254051446":"Infinite Dirichlet Mixture Model and Its Application via Variational Bayes","220198476":"Bayesian adaptive nearest neighbor","227243743":"Is Assortment Selection a Popularity Contest?","221304421":"Hierarchical Organization of Shapes for Efficient Retrieval","224136715":"Generative Model for Maneuvering Target Tracking","228017871":"Interval Computation as an Important Part of Granular Computing: An Introduction","259644450":"Parameter estimation of a two-parameter Lindley distribution under hybrid censoring","276296492":"Improving Simulated Annealing through Derandomization","278637511":"Water Science and Technology Library","259118125":"Discussion of paper: “A new efficient simulation method to approximate the probability of failure and most probable point”: M. Rashki, M. Miri and M.A. Moghaddam, Structural Safety 39 (2012) 22–29","51767412":"Some Alternatives to Asymptotic Tests for the Analysis of Pharmacogenetic Data Using Nonlinear Mixed Effects Models","51871859":"Modelling and Simulation in the Pharmaceutical Industry–Some Reflections","243105048":"Duration distribution of the conjunction of two independent F processes","222672416":"Bayesian extensions to Diebold-Li term structure model","37996837":"Studies integrating geometry, probability, and optimization under convexity","47409588":"Estimation et Classification des Signaux Altimétriques","225762835":"Accounting for threshold uncertainty in extreme value estimation","230885028":"Inference on Population Histories by Approximating Infinite Alleles Diffusion","45855187":"Stochastic optimization on continuous domains with finite-time guarantees by Markov chain Monte Carlo Methods","220837443":"Using Bayesian Networks in an Industrial Setting: Making Printing Systems Adaptive","264742060":"MULTIPLE ENDMEMBER SPECTRAL UNMIXING WITHIN A MULTI-TASK FRAMEWORK","228749010":"Surface Classification via BRDF Parameters, using Population Monte Carlo for MRF Parameter Estimation","220286546":"Particle methods for maximum likelihood estimation in latent variable models","24056340":"Asset allocation and multivariate position based trading","6589208":"Modelling effectiveness of internally heterogeneous organizations in the presence of survey non-response: An application to the ULTRA study","256080958":"Estimating separation distance loss probability between aircraft in uncontrolled airspace in simulation","235994478":"Temporal Moments revisited: Why there is there no better way for physically-based model reduction in time","228996825":"MULTI-TARGET TRACKING WITH MCMC-BASED PARTICLE FILTERS","226014968":"A Bayesian study for the comparison of generalized gamma model with its components","235349383":"Understanding Intra-Urban Trip Patterns from Taxi Trajectory Data","289587906":"Variational Inference: A Review for Statisticians","221114031":"Semi-supervised Tumor Detection in Magnetic Resonance Spectroscopic Images Using Discriminative Random Fields","263599156":"Bayesian spatial extreme value analysis to assess the changing risk of concurrent high temperatures across large portions of European cropland","6716387":"Time Squared: Repeated Measures on Phylogenies","45900090":"Estimating and Sampling Graphs with Multidimensional Random Walks","220655265":"Predictability of Music Descriptor Time Series and its Application to Cover Song Detection.","220286635":"Evolutionary stochastic approximation Monte Carlo for global optimization","258225390":"Drift Homotopy Methods for a non-Gaussian Filter","266501225":"Statistique Bayésienne Notes de cours","48908666":"Décompositions parcimonieuses : approches Bayésiennes et application à la compression d\u0027image","8594195":"Modeling the Response of the Mediterranean Fruit Fly (Diptera:Tephritidae) to Cold Treatment","4791256":"Modelling response error in school effectiveness research","41152993":"Modélisation de la dépendance et simulation de processus en finance","225523426":"System reliability based vehicle design for crashworthiness and effects of various uncertainty reduction measures","278747912":"Markov Random Fields","4791263":"Bayesian assessment of dimensionality in reduced rank regression","227870210":"The speed of adjustment of financial ratios: A hierarchical Bayesian approach using mixtures","26337798":"On the inference of spatial structure from population genetics data","221851297":"Modeling transmission of multitype infectious agents: Application to carriage of Streptococcus pneumoniae","257596611":"Extending the double difference location technique—improving hypocenter depth determination","41482722":"Stochastic System Design and Applications to Stochastically Robust Structural Control","262986800":"Numerical Integrators for the Hybrid Monte Carlo Method","225943275":"NMPC for Complex Stochastic Systems Using a Markov Chain Monte Carlo Approach","47620427":"Quantifying uncertainty, variability and likelihood for ordinary differential equation models","221410963":"An Ideal Observer for a Model of X-Ray Imaging in Breast Parenchymal Tissue","7766996":"A population-based Bayesian approach to the minimal model of glucose and insulin homeostasis","247162136":"Estimation of Insurance Premiums for Coverage against Natural Disaster Risk: An Application of Bayesian Inference","46559599":"Identifying business cycle turning points with sequential Monte Carlo methods: an online and real-time application to the Euro area","259929300":"Aplicación de MCMC para procesos AR polinomiales con regimen de Markov","235169198":"Wide Area Detection and Identification of Underwater UXO Using Structural Acoustic Sensors","254061710":"CS Decomposition Based Bayesian Subspace Estimation","228437552":"Efficient Gaussian graphical model determination under G-Wishart distributions","42539303":"A dynamic term structure model of Central Bank policy","51386529":"Computational chemistry development of a unified free energy Markov model for the distribution of 1300 chemicals to 38 different environmental or biological systems","220812955":"Planning under Risk and Knightian Uncertainty.","236328357":"A Probabilistic Method for Computing Quantitative Risk Indexes from Medical Injuries Compensation Claims","23266007":"Network Inference using Informative Priors","224251625":"Monte Carlo Optimization of Decentralized Estimation Networks Over Directed Acyclic Graphs Under Communication Constraints","241638867":"A Comparison of Methods for Estimating Track-to-Track Assignment Probabilities","236340641":"Uncertainty quantification in vibration-based damage assessment by means of model updating","227694117":"Monte Carlo methods","225556171":"Comparison study between MCMC-based and weight-based Bayesian methods for identification of joint distribution","259570886":"Efficient Sampling Methods for Truncated Multivariate Normal and Student-t Distributions Subject to Linear Inequality Constraints","46582137":"Multiplicative random walk Metropolis-Hastings on the real line","240233873":"Semiparametric fitting of cost distributions with tails based on extreme value theory","290429577":"Adaptive Step Size Selection for Hessian-Based Manifold Langevin Samplers","269228996":"Statistical Sensitivity Analysis Considering both Aleatory and Epistemic Uncertainties in Multidisciplinary Design","26335834":"Modelling Tree Roots in Mixed Forest Stands by Inhomogeneous Marked Gibbs Point Processes","50235701":"Optimal scaling and diffusion limits for the Langevin algorithm in high dimensions. Ann. Appl. Probab. 22, 2320-2356","242476479":"These presentee pour l\u0027obtention du titre de Docteur de l\u0027Universite Paris-Est","220540650":"Algorithm and Parallel Implementation of Particle Filtering and its Use in Waveform-Agile Sensing","227606080":"Cooperative adaptive sampling of random fields with partially known covariance","51073241":"A hierarchical state space approach to affective dynamics","279458683":"Exact and approximate inference in graphical models: variable elimination and beyond","38064528":"Stochastic development in biologically structured population models","228009539":"Reducing temperature uncertainties by stochastic geothermal reservoir modeling","269329368":"A Bayesian approach for modeling and analysis of call center arrivals","257287299":"Bayesian and non-Bayesian inferences of the Burr-XII distribution for progressive first-failure censored data","227651142":"Case Selection and the Study of Judicial Politics","257223811":"Un entorno de aprendizaje y una propuesta de enseñanza de Simulación de Eventos Discretos con GPSS","263679086":"Two-Stage Importance Sampling With Mixture Proposals","7664558":"Recombination hotspots as a point process","278618950":"A Gradient-like Variational Bayesian Approach for Unsupervised Extended Emission Map-Making from SPIRE/HERSCHEL DATA","220802804":"Specialising Simulator Generators for High-Performance Monte-Carlo Methods","289858201":"Bayesian unsupervised unmixing of hyperspectral images using a post-nonlinear model","259212435":"Likelihood analysis for a class of beta mixed models","256081059":"Plug-in estimation of d-dimensional density minimum volume set of a rare event in a complex system","262327362":"An Efficient Stochastic Clustering Auction for Heterogeneous Robotic Collaborative Teams","261536887":"Imputation","224241343":"Stochastic Receding Horizon Control With Bounded Control Inputs: A Vector Space Approach","23939721":"Current Methods for Recurrent Events Data With Dependent Termination","220659393":"Learning to Recognize Objects with Little Supervision","236037622":"Spatial and spatio-temporal models with R-INLA","222729902":"Data analysis using regression models with missing observations and long-memory: An application study","220286665":"Confidence bands for Brownian motion and applications to Monte Carlo simulation","241092023":"The use of sampling techniques in dynamic data driven simulations","6550410":"Bayesian modelling of the dynamics of hepatotoxicity","262679617":"Meta-analyses using information reweighting: An application to online advertising","2599885":"Marginal Map Estimation Using Markov Chain Monte Carlo","26532478":"Variable Selection by Perfect Sampling","227733112":"Theory and inference for a Markov switching GARCH model","51075297":"A note on consistency of non-parametric rank tests and related rank transformations","46537002":"C-Lock (Patent Pending): A System for Estimating and Certifying Carbon Emission Reduction Credits for the Sequestration of Soil Carbon on Agricultural Land","6914949":"Three allele combinations associated with Multiple Sclerosis","265894967":"Segregation in Social Networks: * A Structural Approach I thank","222647979":"A Bayesian approach to the ecosystem inverse problem","3343325":"On performance of sphere decoding and Markov chain Monte Carlo detection methods","220286671":"On population-based simulation for static inference","234819088":"Blind equalization of a nonlinear satellite system using MCMC simulation methods","220129006":"A Stochastic Optimization Approach for Joint Relay Assignment and Power Allocation in Orthogonal Amplify-and-Forward Cooperative Wireless Networks","45629769":"Exemplar models as a mechanism for performing Bayesian inference","258352272":"A Sequential Bayesian Approach for Hydrologic Model Selection and Prediction","224249514":"A Rao-Blackwellized Markov Chain Monte Carlo Algorithm for Efficient MIMO Detection","273959843":"Measuring corporative social performance in firms: a Bayesian factor analysis approach","277699445":"Molecular Imaging in Nano MRI","43694435":"Characterizing economic trends by Bayesian stochastic model specification search","235138559":"Statistical and Adaptive Signal Processing for UXO Discrimination for Next-Generation Sensor Data","8498044":"Risk of malignancy in follicular neoplasms without nuclear atypia: statistical analysis of 397 thyroidectomies","5942180":"Coherent psychometric modeling with Bayesian nonparametrics","260062334":"Dependence of synchronisation frequency of Kuramoto oscillators on symmetry of natural frequency distribution","285321983":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation","225519985":"Non-linear regression models for Approximate Bayesian Computation. Statistics and Computing, 20: 63-73","286549268":"Probabilistic vs Deterministic Power System Stability and Reliability Assessment","228614563":"MCMC using an approximation","243118712":"The Evolution of Markov Chain Monte Carlo Methods","230996417":"Bayesian Analysis of Simple Random Densities","225997183":"Computational Complexity of Metropolis-Hastings Methods in High Dimensions","23258469":"A Bayesian model averaging approach for cost-effectiveness analyses","224770402":"Serum IgG Responses and Seroconversion Patterns to Cryptosporidium gp15 among Children in a Birth Cohort in South India","230545845":"Generalized stochastic approach for constitutive equation in linear elasticity: A random matrix model","6300777":"Variance Decomposition Using an IRT Measurement Model","226918795":"Computers in Fisheries Population Dynamics","51959561":"Summarizing Posterior Distributions in Signal Decomposition Problems when the Number of Components is Unknown","51891974":"Semiparametric Bivariate Zero-Inflated Poisson Models with Application\nto Studies of Abundance for Multiple Species","221849899":"What Is the Best Way to Estimate Hospital Outcome Quality? A Simulation Approach","236059141":"Unsupervised Bayesian linear unmixing of gene expression microarrays","281969883":"A New Bayesian Unit Root Test in Unobserved-ARCH Models","258247538":"Estimating Uncertainties in Statistics Computed from DNS","5141593":"Forecasting Output Growth Rates and Median Output Growth Rates: A Hierarchical Bayesian Approach.","51760909":"Receptive Field Inference with Localized Priors","224252230":"Exploiting task redundancy in industrial manipulators during drilling operations","282815687":"A Bayesian network approach for population synthesis","7732329":"Determining a Maximum-Tolerated Schedule of a Cytotoxic Agent","222789979":"Learning hybrid Bayesian networks using mixtures of truncated exponentials","258229113":"Travel time estimation for ambulances using Bayesian data augmentation","51654454":"Single-cell behavior and population heterogeneity: Solving an inverse problem to compute the intrinsic physiological state functions","24001868":"Hierarchical statistical modeling of xylem vulnerability to cavitation: Methods","225767766":"Constraining ocean diffusivity from the 8.2 ka event","282148082":"IMPLEMENTASI ALGORITMA EXPECTATION-MAXIMIZATION UNTUK ESTIMASI PARAMETER MODEL DISTRIBUSI CAMPURAN","41479762":"Wiener chaos expansion and numerical solutions of stochastic partial differential equations","10878095":"PopHist: inferring population history from the spectrum of allele frequencies","228618642":"On some method for diagnosing convergence in MCMC setups via atoms and renewal sets","7773253":"Multilevel IRT using dichotomous and polytomous items","267017177":"Bayesian inference for hidden truncation Pareto (II) models","283491537":"Flexible Link Functions in Nonparametric Binary Regression with Gaussian Process Priors","260193204":"Simulation-free Bayesian Analysis for Temporally Misaligned Data with Application to Ice Cores","3898380":"Structure of the Internet?","6810704":"A Statistical Test of the Hypothesis that Polyclonal Intestinal Tumors Arise by Random Collision of Initiated Clones","51386151":"Modelling the influence of MDR1 polymorphism on digoxin pharmacokinetic parameters","261114792":"Quantifying operational flexibility of VSC-HVDC lines and SVCs","230775291":"Bayesian compressed sensing with new sparsity-inducing prior","267211729":"Probabilistic Assessment of Lifetime of Low-Earth-Orbit Spacecraft: Uncertainty Propagation and Sensitivity Analysis","226718140":"From Electrodynamics to Monte Carlo Simulations","220885352":"Combining Goal Models, Expert Elicitation, and Probabilistic Simulation for Qualification of New Technology.","228360670":"New Inputs and Methods for Markov Chain Quasi-Monte Carlo","261333969":"Improving Parallelisation of a Monte Carlo Radiotherapy Simulation Using MPI","259765049":"Sparse Signal and Image Recovery Using A Proximal Bayesian Algorithm","238596731":"Control variates for estimation based on reversible Markov chain Monte Carlo samplers","283319463":"Uncertainty of biological indicators for the WFD in Swedish water bodies: current procedures and a proposed framework for the future.","220385639":"Wind Speed Parameter Estimation from One-month Sample Via Bayesian Approach","254059362":"Blind Deconvolution of Sparse Pulse Sequences Under a Minimum Distance Constraint: A Partially Collapsed Gibbs Sampler Method","41698875":"The marginalized particle filter – analysis, applications and generalizations","261055432":"Modeling Software Rejuvenation on a Redundant System Using Monte Carlo Simulation","29629836":"Using Bayesian methods for the parameter estimation of deformation monitoring networks","227598811":"Sampling schemes for generalized linear Dirichlet process random effects models","221284734":"ViVUD: Virtual Server Cluster Based View-Upload Decoupling for Multi-Channel P2P Video Streaming Systems","248906374":"Statistical Model-Based Approaches to Audio Restoration and Analysis","45907693":"Diffusion limits of the random walk Metropolis algorithm in high dimensions authors. Ann. Appl. Probab. 22, 881-930","226304300":"Application of the two-stage Markov chain Monte Carlo method for characterization of fractured reservoirs using a surrogate flow model","2182267":"Technique(s) for Spike - Sorting","258794289":"A Smooth Transition Model for Multiple-Regime Time Series","284644521":"The Art of Modeling Financial Options: Monte Carlo Simulation","4766760":"Monetary Policy, Inflation Forecasting and the Term Structure of Interest Rates","4914219":"Structural learning with time-varying components: Tracking the crosssection of financial time series","228315641":"Exploration of the Brazilian Term Structure in a Hidden Markov Framework","229063109":"Up to fourth virial coefficients from simple and efficient internal-coordinate sampling: Application to neon","236067441":"Value associated with mindfulness meditation and moderate exercise intervention in acute respiratory infection: The MEPARI Study","238703186":"Measuring Household Response in Database Marketing: A Latent Construct Approach","264868793":"Performance analysis of the token bucket control mechanism subject to stochastic traffic","233757086":"Communications in Statistics - Simulation and Computation","222818615":"Efficient uncertainty quantification techniques in inverse problems for Richards’ equation using coarse-scale simulation models","224868630":"osDesign : An R Package for the Analysis, Evaluation, and Design of Two-Phase and Case-Control Studies","280874188":"Multivariate Markov models for the conditional probability of toxicity in phase II trials","255970101":"Bayesian semiparametric Wiener system identification","224575764":"Generative Spectrogram Factorization Models for Polyphonic Piano Transcription","41848326":"Bayesian Estimation of Linear Mixtures Using the Normal Compositional Model. Application to Hyperspectral Imagery","260961271":"On variance stabilisation by double Rao-Blackwellisation","278791397":"Iterative experiment design guides the characterization of a light-inducible gene expression circuit","11304144":"Bayesian Prediction of Spatial Count Data Using Generalised Linear Mixed Models","11304145":"Modeling Spatial Survival Data Using Semiparametric Frailty Models","236751457":"Modelling Temporal Uncertainty in Archaeological Analysis","262013921":"Classical and Bayesian estimation of P(Y \u003c X) for Kumaraswamy\u0027s distribution","264241984":"On the reliability of NMR relaxation data analyses: A Markov Chain Monte Carlo approach","8668166":"Hierarchical Bayesian Modeling in Dichotomous Processes in the Presence of Nonresponse","225563124":"Convergence of the SMC Implementation of the PHD Filter","283706467":"Resampling methods for particle filtering: identical distribution, a new method, and comparable study","5518559":"Ameliorative missing value imputation for robust biological knowledge inference","224461294":"Detection from a multi-channel sensor using a hierarchical Bayesian model","24264167":"Pregnancy Outcomes After Kidney Donation","44652094":"Nonparametric Bayes Shrinkage for Assessing Exposures to Mixtures Subject to Limits of Detection","235604627":"Two general methods for population pharmacokinetic modeling: Non-parametric adaptive grid and non-parametric Bayesian","2124985":"Perfect simulation for a class of positive recurrent Markov chains","262302520":"Time-resolved particle image velocimetry measurements with wall shear stress and uncertainty quantification for the FDA benchmark nozzle model","51052438":"Optimal Partitioning for Linear Mixed Effects Models: Applications to Identifying Placebo Responders","48168512":"Topics in statistical data analysis for high-energy physics","284705881":"Analysis on Accuracy of Bias, Linearity and Stability of Measurement System in Ball screw Processes by Simulation","227660082":"Non‐parametric Bayesian inference on bivariate extremes","221700496":"Convergence of adaptive and interacting Markov chain Monte Carlo\nalgorithms","38278895":"Décomposition et classification de composantes spectrales dans des cubes de données radio-astronomiques","5104870":"Extensões Bayesianas do Modelo de Estrutura a Termo de Diebold-Li","269087906":"A comparison of Bayesian estimators for unsupervised Hidden Markov Model POS taggers","251767725":"A transformation-based derivation of the Kalman filter and an extensive unscented transform","281947232":"Simulation techniques for parameter estimation via a stochastic ECM algorithm with applications to plant growth modeling","265061219":"Monte Carlo methods for dynamical systems","258243540":"Labeled Random Finite Sets and Multi-Object Conjugate Priors","252492732":"Stochastic Optimisation for Allocation Problem with Shortfall Risk Constraints 1","51916712":"On nonlinear Markov chain Monte Carlo","5844202":"Detecting Positively Selected Sites From Amino Acid Sequences: An Implicit Codon Model","45864462":"Regeneration and Fixed-Width Analysis of Markov Chain Monte Carlo Algorithms","51933102":"Sparse Estimation by Exponential Weighting","262974228":"Study of the nonlinear longitudinal dynamics of a stochastic system","24063446":"Bayesian modeling of measurement error in predictor variables","227352887":"Bayesian Factor Selection in Dynamic Term Structure Models","38278900":"Extraction de composants purs et démélange linéaire bayésiens en imagerie hyperspectrale","257412074":"Assessment of a stochastic downscaling methodology in generating an ensemble of hourly climate time series","252021690":"Reasearch on spaceborn TDI CCD camera imaging simulation based on Monte-Carlo ray tracing","228245797":"Distribution-Valued Solution Concepts","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation","33418556":"Applying the ICM algorithm for separating pictures consisting of two main parts, background and object application to fMRI recordings and mole pictures","221850104":"Graphical modeling of binary data using the LASSO: A simulation study","46538244":"Testing Conditional Asset Pricing Models Using a Markov Chain Monte Carlo Approach","273788050":"Automated Parameter Blocking for Efficient Markov-Chain Monte Carlo Sampling","230547838":"Cost analysis in choosing group size when group testing for Potato virus Y in the presence of classification errors","243014328":"Stability of evolutionary algorithms","226423227":"The Phylogenetic Indian Buffet Process: A Non-Exchangeable Nonparametric\nPrior for Latent Features","227369290":"Self-Selectivity in Firm\u0027s Decision to Withdraw IPO: Bayesian Inference for Hazard Models of Bankruptcy With Feedback","226795852":"A Blocking Markov Chain Monte Carlo Method for Inverse Stochastic Hydrogeological Modeling","26287455":"The Dynamics of T-Cell Receptor Repertoire Diversity Following Thymus Transplantation for DiGeorge Anomaly","274635920":"Uncertainty Evaluation of Nuclear Reaction Model Parameters Using Integral and Microscopic Measurements with the CONRAD Code","225892792":"Applying Bayesian Networks for Intelligent Adaptable Printing Systems","289904009":"Raman Spectroscopy in Ionic Liquids Under Variable Thermodynamic and Environmental Conditions","283507766":"Iterative Ensemble Smoothers in the Annealed Importance Sampling Framework","228409675":"A simulation‐based approach to stochastic dynamic programming","224383367":"Bayesian Estimation of Altimeter Echo Parameters","51976133":"A length-based hierarchical model of brown trout (Salmo trutta fario) growth and production","4746390":"A History of the Metropolis-Hastings Algorithm","258630581":"Marine reserve spillover: Modelling from multiple data sources","257786754":"Online variational learning of finite Dirichlet mixture models","24016270":"Approximate Bayesian Inference in Spatial Generalized Linear Mixed Models","268350239":"Particle filter for joint estimation of multi-object dynamic state and multi-sensor bias","255982499":"Bayesian model updating and prognosis of fatigue crack growth","255982501":"Deterministic and probabilistic fatigue prognosis of cracked specimens using acoustic emissions","221112776":"MCMC Learning of Bayesian Network Models by Markov Blanket Decomposition","285402599":"Quantitative Risk Assessment: Tutorial H02 INCOSE International Symposium 17 June 2008","46581283":"Bayes Model Selection with Path Sampling: Factor Models and Other\nExamples","260406112":"A Brief Survey of Modern Optimization for Statisticians","227602808":"A new view of seasonal forecast skill: Bounding boxes from the DEMETER ensemble forecasts","225081728":"Modelling climate change impact on Septoria tritici blotch (STB) in France: Accounting for climate model and disease model uncertainty","282326073":"Roadway Traffic Crash Mapping: A Space-Time Modeling Approach","6114481":"Modeling Complex Systems: Gaining Valid Insights and Avoiding Mathematical Delusions","224364978":"Collision Probability Assessment for Speed Control","222018005":"Model-based structural health monitoring of naval ship hulls","227047800":"Analysis of the Covariance Structure of the GOCE Space-Wise Solution with Possible Applications","226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","281144371":"Rare Event Simulation","227584356":"Efficient simulated maximum likelihood estimation through explicitly parameter dependent importance sampling","274234542":"Regression analysis of proportional data using simplex distribution","224586133":"Object Tracking in Structured Environments for Video Surveillance Applications","226967920":"Randomized Algorithms for Semi-Infinite Programming Problems","247157315":"Fast inference in generalized linear models via expected log-likelihoods","237699792":"MONOGRAFIA DE FINAL DE CURSO","235981548":"Application of Bayesian geostatistics for evaluation of mass discharge uncertainty at contaminated sites","259555961":"Regional variation in relative survival—quantifying the effects of the competing risks of death by using a cure fraction model with random effects","281144777":"Simulated Tempering and Swapping on Mean-Field Models","44709792":"Changements climatiques passés reconstruits à partir du pollen : Vers une modélisation statistique basée sur les mécanismes","254212648":"Neutral-data comparisons for Bayesian testing","256483910":"On Parameters Estimation of Lomax Distribution under General Progressive Censoring","235358999":"On the convergence of the Metropolis-Hastings Markov chains","221126718":"Wavelet-based parallel MRI regularization using bivariate sparsity promoting priors","263023292":"Cross Layer Interference Management in Wireless Biomedical Networks. Entropy","228796593":"On performance measures for approximative parameter estimation","261880463":"Approximate Bayesian Computation by Subset Simulation","26545281":"Inference with the Median of a Prior","40834939":"A Survey of Statistical Models for Reverse Engineering Gene Regulatory Networks","266113736":"Tuned Forest Fire Prediction: Static Calibration of the Evolutionary Component of \u0027ESS\u0027","7947616":"Estimation of True Salmonella Prevalence Jointly in Cattle Herd and Animal Populations Using Bayesian Hierarchical Modeling","227635336":"A Bayesian Hierarchical Extreme Value Model for Lichenometry","264669919":"Linear regression","224131136":"Estimating the Number of Endmembers in Hyperspectral Images Using the Normal Compositional Model and a Hierarchical Bayesian Algorithm","228860089":"Myopic sparse image reconstruction with application to MRFM","43098032":"Dental caries analysis in 3–5 years old children: A spatial modelling","224245887":"P and T wave delineation andwaveform estimation in ECG signals using a block gibbs sampler","251292636":"Independent Monte Carlo","261083817":"Calibration of tracking systems using detections from non-cooperative targets","226066526":"A Bayesian Method for Infrared Face Recognition","225669211":"Graph problems arising from parameter identification of discrete dynamical systems","221886481":"Individual predictions based on nonlinear mixed modeling: Application to prenatal twin growth","228313266":"Statistical Prediction of the Outcome of a Noncooperative Game","224856140":"Low error discrimination using a correlated population code","261481146":"Partner coupling algorithm for mobile coded cooperation technique","220735513":"Marginalized population Monte Carlo","225146969":"A Linear Programming-based Evolutionary Algorithm for the Minimum Power Broadcast Problem in Wireless Sensor Networks","220676113":"Node density control for maximizing wireless sensor network lifetime","283272660":"A Bayesian framework for the validation of models for subsurface flows: synthetic experiments","280157576":"Framework for resource uncertainty prediction and data valuation: An application to diamond deposits","226064450":"Localized modeling of uncertainty in the Arlequin framework","227844264":"A Bayesian hierarchical method for multiple‐event seismic location","221878277":"Segmentation of Skin Lesions in 2-D and 3-D Ultrasound Images Using a Spatially Coherent Generalized Rayleigh Mixture Model","5582186":"Change Detection in Multisensor SAR Images Using Bivariate Gamma Distributions","228354268":"Continuous Contour Monte Carlo for Marginal Density Estimation With an Application to a Spatial Statistical Model","5139727":"Bayesian inference for the Mover-Stayer model in continuous time with an application to labour market transition data","251904577":"Executive Stock Option Pricing and Incentives: Evidence from Asian Option Based on Volatility Estimated by SV-GED Model","258247200":"Second-order Particle MCMC for Bayesian Parameter Inference","4222212":"Yield analysis for self-repairable MEMS devices","228344025":"Modeling Structural Changes: Bayesian Estimation of Multiple Changepoint Models and State Space Models","24052776":"Detecting stage-wise outliers in hierarchical Bayesian linear models of repeated measures data","227688661":"Probabilistic impedance of foundation: Impact of the seismic design on uncertain soils","270222674":"Multivariate-from-Univariate MCMC Sampler: R Package MfUSampler","2190701":"Baseband Detection of Bistatic Electron Spin Signals in Magnetic Resonance Force Microscopy (MRFM)","24116258":"Extracting the Cyclical Component in Hours Worked: a Bayesian Approach","45895665":"Adaptive Gibbs samplers","284900779":"An island particle algorithm for rare event analysis","227682499":"Accelerated testing of on‐board diagnostics","225959973":"Riemann sums for MCMC estimation and convergence monitoring","260367062":"Annealed Important Sampling for Models with Latent Variables","30858370":"Parametric Models for Optimal Treatment Schedule Finding in Adaptive Early-Phase Clinical Trials.","46542737":"Geographical mortality patterns in Italy: A Bayesian analysis","38278932":"Reconstruction bayésienne d\u0027images MRFM parcimonieuses","7869732":"Economic and Epidemiological Modelling of Full-Length Antihaemophilic Factor (Recombinant), Plasma/Albumin-Free Method, in Previously Treated Patients with Haemophilia A","3319151":"Wideband array signal processing using MCMC Methods","29973654":"La Boucle Locale Radio et la Démodulation directe de signaux larges bandes à 26GHz.","281185693":"Échantillonnage préférentiel et méta-modèles : méthodes bayésiennes optimale et défensive","224798727":"Accurate and Novel Modeling of the Land Mobile Satellite Channel using Reversible Jump Markov Chain Monte Carlo Technique","51947131":"Density Approximations for Multivariate Affine Jump-Diffusion Processes","282275248":"One-tailed or two-tailed P values in PLS-SEM?","284077453":"Natural thermodynamics","288496726":"A Flexible Uncertainty Propagation Framework for General Multiphysics Systems","8260886":"Estimating the demand for health care with panel data: A semiparametric Bayesian approach","225517593":"Stochastic mortality: experience-based modeling and application issues consistent with Solvency 2","4308264":"Protein folding simulation by all-atom CSAW method","259519005":"Performance assessment, diagnosis, and optimal selection of non-linear state filters","227651837":"Phase randomization: A convergence diagnostic test for MCMC","220809284":"Decomposition and Classification of Spectral Lines in Astronomical Radio Data Cubes","45377498":"Bayesian numerical inference for Markovian models -- Application to tropical forest dynamics","4920612":"An exact non-iterative sampling procedure for discrete missing data problems","286350433":"A Monte Carlo strategy for structured multiple-step-ahead time series prediction","228759760":"A note on variational approximate bayesian inference for latent variable models","228331755":"Design Constraints on a Synthetic Metabolism","283680144":"Subinterval perturbation methods for uncertain temperature field prediction with large fuzzy parameters","227127536":"Reference Bayesian methods for recapture models with heterogeneity","45903815":"Free Energy Methods for Bayesian Inference: Efficient Exploration of\nUnivariate Gaussian Mixture Posteriors","224247846":"Predictability of Music Descriptor Time Series and its Application to Cover Song Detection","228706527":"Estimation of time-varying autoregressive symmetric alpha stable processes by particle filters","43407336":"Finite mixture models and model-based clustering","228644898":"de Valpine, P. Better inferences from population-dynamics experiments using Monte Carlo state-space likelihood methods. Ecology","224868581":"On the Assessment of Monte Carlo Error in Simulation-Based Statistical Analyses","227733521":"Estimating soil properties in heterogeneous land-use patches: A Bayesian approach","6540772":"Sequential Monte Carlo without likelihoods. Proc Natl Acad Sci","264260171":"Numerical analysis","257489619":"Modeling ocean wave climate with a Bayesian hierarchical space-time model and a log-transform of the data. Ocean Dyn","220809380":"A Bayesian Approach for Affine Auto-calibration","50855562":"Game Theoretic Modeling of Pilot Behavior During Mid-Air Encounters","227377155":"Conditional and Restricted Pareto Sampling: Two New Methods for Unequal Probability Sampling","221249727":"Toward Effective Multi-Capacity Resource Allocation in Distributed Real-Time and Embedded Systems","235008912":"A stochastic algorithm for computing global minimizer of generalized\nconic functions","5408193":"A Bayesian population PK–PD model for ispinesib/docetaxel combination-induced myelosuppression","51871364":"A framework for joint modeling and joint assessment of efficacy and safety endpoints for probability of success evaluation and optimal dose selection","263408160":"A model for spatio-temporal clustering using multinomial probit regression: Application to avalanche counts","227000339":"Mapping unobserved factors on vine plant mortality","251575147":"Subset simulation for unconstrained global optimization","224057548":"An Automatic Building Reconstruction Method : A Structural Approach using High Resolution Satellite Images","38107090":"Bayesian Unsupervised Learning of DNA Regulatory Binding Regions","221653166":"Multiple domain user personalization","224209094":"A new population-based simulated annealing algorithm","49788759":"Multiple models to capture the variability in biological neurons and networks. Nat Neurosci","230750304":"A population Monte Carlo scheme with transformed weights and its\napplication to stochastic kinetic models","282860925":"A Cooperative Approach to Sensor Localisation in Distributed Fusion Networks","229447694":"Solving dynamic wildlife resource optimization problems using reinforcement learning","236135344":"Importance Sampling for Sums of Lognormal Distributions with Applications to Operational Risk","258757327":"Connectivity metrics for subsurface flow and transport","236135355":"Spatial Models for Flood Risk Assessment","40443841":"Analyzing Short-Term Noise Dependencies of Spike-Counts in Macaque Prefrontal Cortex Using Copulas and the Flashlight Transformation","228976652":"Monte Carlo Optimization Strategies for Air-Traffic Control","1955255":"Fast Pricing of European Asian Options with Provable Accuracy: Single-Stock and Basket Options","36409216":"A Gentle Introduction to Predictive Filters","242082781":"A derivative-free optimization algorithm based on conditional moments","220121260":"A Logic-Based Approach to Polymer Sequence Analysis","271668613":"Spatio-Temporal Trend Analysis of Spring Arrival Data for Migratory Birds","236860331":"Bayesian estimation with Gauss--Markov--Potts priors in optical diffraction tomography","271549849":"Agile Bayesian filtering","257465070":"Lessons Learned from Quantitative Dynamical Modeling in Systems Biology","4996596":"Using a Markov Chain to Construct a Tractable Approximation of an Intractable Probability Distribution","232634468":"Smooth Kernel Density Estimate for Multiple View Reconstruction","282903910":"Bayesian Essentials with R","249316198":"Partial Ordering of Inhomogeneous Markov Chains with Applications to Markov Chain Monte Carlo Methods","222699773":"Monte Carlo sampling of Wigner functions and surface hopping quantum dynamics","220385438":"Robust Optimization of an Airplane Component Taking into Account the Uncertainty of the Design Parameters","255249035":"Computationally efficient Bayesian inference for inverse problems","254401172":"Free Energy Methods for Efficient Exploration of Mixture Posterior Densities","283264351":"TGGE-S-15-00160f","46247807":"A Note on Perfect Slice Sampling","235662281":"Recognition memory models and binary-response ROCs: A comparison by minimum description length","29617158":"A Markov Point Process for Road Extraction in Remote Sensed Images","263127657":"Optimization in plate-fin safety structure of heat exchanger using genetic and Monte Carlo algorithm","5795231":"Generating confidence intervals on biological networks","45819772":"Incorporating Individual and Collective Ethics into Phase I Cancer Trial Designs","282217754":"Parallel Metropolis chains with cooperative adaptation","45877108":"Near-Optimal Detection in MIMO Systems using Gibbs Sampling","228575317":"Control variates as screening functions","10829166":"Bayesian Approach for the Calibration of Models: Application to an Urban Stormwater Pollution Model","222838919":"Model selection by MCMC computation","226580558":"A comparison study of extreme precipitation from six different regional climate models via spatial hierarchical modeling. Extremes","265515523":"Empirical Bayesian elastic net for multiple quantitative trait locus mapping","51965640":"Random construction of interpolating sets for high dimensional\nintegration","228888692":"Bayesian estimation of species richness","267473441":"A Stochastic Newton MCMC Method for Large-Scale Statistical Inverse Problems with Application to Seismic Inversion","271658464":"Training genetic programming classifiers by vicinal-risk minimization","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","224561328":"Distributed sampling of random fields with unknown covariance","51953356":"Issues in Designing Hybrid Algorithms","284898595":"Uncertainty and variability in models of the cardiac action potential: Can we build trustworthy models?","4281752":"Wireless Sensor Nodes Dimensioning under Network Lifetime Constraint","287968496":"Adjustable hybrid resampling approach to computationally efficient probabilistic inference of structural damage based on vibration measurements","220412152":"Accurate Uncertainty Quantification Using Inaccurate Computational Models","224131206":"Joint Model Selection and Parameter Estimation by Population Monte Carlo Simulation","4316572":"Interference analysis for wireless ad hoc networks","256291483":"Bayesian Modeling for Large Spatial Datasets","241167233":"Conservative data fusion for decentralized networks","224161980":"Spatial statistics and distributed estimation by robotic sensor networks","5508533":"Critical aspects of the Bayesian approach to phase I cancer trials. Stat Med","50837221":"Computación de altas prestaciones sobre entornos grid en aplicaciones biomédicas: simulación de la actividad eléctrica cardiaca y diseño de proteínas","51934971":"Multilevel coarse graining and nano-pattern discovery in many-particle stochastic systems","261255798":"Unsupervised Post-Nonlinear Unmixing of Hyperspectral Images Using a Hamiltonian Monte Carlo Algorithm","222689441":"Design of complex systems in the presence of large uncertainties: A statistical approach","228892738":"Coarse-grain Langevin algorithms for dynamic data integration","47327028":"Tuning Tempered Transitions","237175748":"State-space likelihoods for nonlinear fisheries time-series","228759630":"Examples comparing importance sampling and the Metropolis algorithm","258873986":"Bayesian inference for the Bivariate Pareto(type II) distribution under the hidden truncation paradigm (from above)","227606625":"MCMC-based estimation of Markov switching ARMA-GARCH models","222953662":"A spatial structural equation model for health outcomes","282354976":"Calibration of adhesion models based on Bayesian inference","241159081":"Compressed Sensing via Sparse Bayesian Learning and Gibbs Sampling","258683539":"Sequential State and Observation Noise Covariance Estimation Using Combined Ensemble Kalman and Particle Filters","276204942":"A Dirichlet Process Mixture Model for Spherical Data","239760307":"Backward Sampling in Metropois-Hastings Algorithm for Truncated Posterior Distributions","229886024":"Evaluation of Bayesian models for focused clustering in health data. Environmetrics, 18, 871-887","280759997":"Credit Scoring Modeling","224674662":"Adequacy, Accuracy, Scalability, and Uncertainty of Architecture-based Software Reliability: Lessons Learned from Large Empirical Case Studies","228549531":"STATISTICS AND THE SCIENTIFIC METHOD IN ECOLOGY","226579333":"Determination of key workpiece product characteristics in a machining fixture using uncertainty analysis and loss cost function implementation","23971688":"A Box-Cox normal model for response times","228115358":"Counter-Factual Reinforcement Learning: How to Model Decision-Makers\nThat Anticipate The Future","7147114":"Sampling variability and estimates of density dependence: A composite-likelihood approach","221608762":"Lecture Notes in Computer Science","4249171":"Overcoming the Vector Taylor Series Approximation in Speech Feature Enhancement - A Particle Filter Approach","232649673":"Unsupervised Motion Layer Segmentation by Random Sampling and Energy Minimization","260835738":"Bayesian Unconditional Quantile Regression: An Analysis of Recent Expansions in Wage Structure and Earnings Inequality in the US 1992–2009","220764976":"Joint Emotion-Topic Modeling for Social Affective Text Mining","260632976":"Accurate and efficient evaluation of failure probability for partial different equations with random input data","220799792":"A New Bounding Technique for Handling Arbitrary Correlations in Path-Based SSTA","289433433":"How to Create a Monte Carlo Simulation Study using R: with Applications on Econometric Models","251586780":"An approximation to cluster size distribution of two Gaussian random fields conjunction with application to FMRI data","233913298":"Extinction learning deficit in a rodent model of attention-deficit hyperactivity disorder","2864655":"Detection of Bistatic Electron Spin Signals in Magnetic Resonance Force Microscopy (MRFM)","215755512":"Non-linear Bayesian joint inversion of seismic reflection coefficients","255971684":"Adaptive Sticky Generalized Metropolis","7675472":"Efficient spike-sorting of multi-state neurons using inter-spike intervals information","43023541":"Development of a Multimarker Assay for Early Detection of Ovarian Cancer","228711302":"A Gibbs sampler for inequality-constrained geostatistical interpolation and inverse modeling","227376042":"A class of stochastic volatility models for environmental applications","224605003":"An NCM-based Bayesian algorithm for hyperspectral unmixing","42108075":"Parameter Identification, Experimental Design and Model Falsification for Biological Network Models Using Semidefinite Programming","233720772":"Random Input Sampling for Complex Models Using Markov Chain Monte Carlo","228920201":"Statistical Study of the Thin Metal-Oxide Varistor Ceramics","227343264":"Genetic Analysis of Rare Disorders: Bayesian Estimation of Twin Concordance Rates","221295389":"Variance Reduction in Monte Carlo Capacitance Extraction.","24008513":"The econometrics of DSGE models","261091775":"Convergence Analysis for Sequential Monte Carlo Receivers in Communications Applications","272610829":"Progressive Failure Analysis of Laminated Composite Plate by Using Higher Order Shear Deformation Theory","11902598":"Disease map reconstruction","8373835":"Bayesian Modeling of Multiple Lesion Onset and Growth from Interval-Censored Data","4908671":"Conditional Likelihood Inference in a Case-Cohort Design: An Application to Haplotype Analysis","227173309":"Computing the Cramer-Rao Bound of Markov Random Field Parameters: Application to the Ising and the Potts Models","221109012":"Signal Processing in a Nonlinear, NonGaussian, and Nonstationary World","277046970":"Bayesian Inference Applied to Dynamic Nelson-Siegel Model with Stochastic Volatility","239837300":"Representation and learning for sign language recognition","49814712":"Bayesian calibration of the Unified budburst model in six temperate tree species","281550473":"Adaptive Rejection Sampling with fixed number of nodes","200707508":"Simulation of the Annual Loss Distribution in Operational Risk via Panjer Recursions and Volterra Integral Equations for Value at Risk and Expected Shortfall Estimation.","26808285":"Gaussian predictive process models for large spatial data sets","251222205":"Advanced Topics in MCMC","262965736":"Robust level control of a dry‐surge ore pile","275836472":"The Coordinate Particle Filter - A novel Particle Filter for High Dimensional Systems","7296544":"Predicting case numbers during infectious disease outbreaks when some cases are undiagnosed","51522909":"Bayesian semi-supervised classification of bacterial samples using MLST databases. BMC Bioinformatics 12:302","51559750":"Brain Network Analysis: Separating Cost from Topology Using Cost-Integration","229458938":"Case studies in Bayesian segmentation applied to CD control","259864874":"MEMS Yield Simulation with Monte Carlo Method","220490611":"Bayesian unsupervised classification framework based on stochastic partitions of data and a parallel search strategy. Adv Data Analysis Classification, under review","280528608":"Robust Semiparametric Regression Models","5139991":"Multivariate partial adjustment of financial ratios: A Bayesian hierarchical approach","264272281":"An empirical pseudo-Bayes approach to determining a weighted-summation for use in generalized linear models","257337612":"Bayesian model selection approach to the one way analysis of variance under homoscedasticity","284251819":"A Bayesian peaks-over-threshold analysis of floods in the Itajaí-açu River under stationarity and nonstationarity","225164080":"A Bayesian analysis of market information linkages among NAFTA countries using a multivariate stochastic volatility model","5140013":"Learning, Forecasting and Structural Breaks","45901023":"On computational tools for Bayesian data analysis","225538836":"Review: Geometric and dimensional tolerance modeling for sheet metal forming and integration with CAPP","220965709":"Using Markov Chain Monte Carlo to play Trivia","5127721":"Metropolis Algorithm and equienergy sampling for two mean field spin systems","259571985":"Particle Gibbs with Ancestor Sampling","228115443":"Reduced chaos expansions with random coefficients in reduced-dimensional\nstochastic modeling of coupled problems","228885448":"Modeling Traffic Crash-Flow Relationships for Intersections: Dispersion Parameter, Functional Form, and Bayes Versus Empirical Bayes Methods","277178088":"Essays on the economics of racial segregation","261466619":"Nonparametric Bayesian supervised classification of functional data","224627475":"Two-level numerical procedure for optimal design of digital modal controllers","260295155":"Multilevel Markov Chain Monte Carlo Method for High-Contrast Single-Phase Flow Problems","222991160":"Line and point cluster models for spatial health data","288180063":"On Blocks, Tempering and Particle MCMC for Systems Identification","30513064":"INVERSION DES MODELES STOCHASTIQUES DE MILIEUX HETEROGENES","282476207":"The Mediterranean Basin and Southern Europe in a warmer world: What can we learn from the past?","264896951":"QoS Aware Optimal Base Station ON/OFF Policy and Frequency Planning","288175954":"Nonlinear State Space Smoothing Using the Conditional Particle Filter","282977881":"Multiple Marginalized Population Monte Carlo","227541781":"Robust estimation in the normal mixture model based on robust clustering","282000968":"Crossbred cow adoption and its correlates: Countable adoption specification search in Sri Lanka\u0027s small holder dairy sector","46404686":"Seppä K, Hakulinen T, Kim H-J, Läärä ECure fraction model with random effects for regional variation in cancer survival. Stat Med 29: 2781-2793","283897447":"Advanced Monte Carlo Method for model uncertainty propagation in risk assessment","26724103":"Identifying Currents in the Gene Pool for Bacterial Populations Using an Integrative Approach","247672915":"Introduction to Applied Bayesian Statistics and Estimation for Social Scientists by Lynch, S.M","2559669":"Stochastic Search for Optimal Linear Representations of Images on Spaces With Orthogonality Constraints","258187760":"Generalized Cross-entropy Methods with Applications to Rare-event Simulation and Optimization","5842634":"Uniformization for Sampling Realizations of Markov Processes: Applications to Bayesian Implementations of Codon Substitution Models","260268311":"Markov Switching Component ARCH Model: Stability and Forecasting","228918076":"Modelos de Fatores Latentes Generalizados para Curvas de Juros em Múltiplos Mercados","230873947":"Estimating Risk Determinants of HIV and TB in South Africa","220654524":"On Bayesian analysis of a finite generalized Dirichlet mixture via a Metropolis-within-Gibbs sampling","222575583":"Rigorous confidence bounds for MCMC under a geometric drift condition","48194627":"Bayesian Variable Selection for Probit Mixed Models Applied to Gene\nSelection","220640187":"Convergence of Markov-Chain Monte-Carlo Approaches to Multiuser and MIMO Detection.","224312256":"Bayesian peak detection for pro-TOF MS MALDI data","220363709":"Equilibrium dynamics of ice streams: a Bayesian statistical analysis","262209854":"Stochastic Composite Likelihood","257516024":"Influence of temporal aggregation on strategic forest management under risk of wind damage","227517228":"Continuous time modelling of dynamical spatial lattice data observed at sparsely distributed times","281058916":"Approximations of Markov Chains and High-Dimensional Bayesian Inference","3427985":"Monte Carlo Optimization for Conflict Resolution in Air Traffic Control","257665533":"Markov chain importance sampling with applications to rare event probability analysis","264081687":"On the nonlinear stochastic dynamics of a continuous system with discrete attached elements","38008046":"The rational child : theories and evidence in prediction, exploration, and explanation","44262414":"Sensitivity Analysis of Motor PWM Control","259441094":"Uniform Ergodicity of the Iterated Conditional SMC and Geometric Ergodicity of Particle Gibbs samplers","265017722":"Assessing uncertainty associated with the monitoring and evaluation of spatially managed areas Marine Policy","279309842":"Gaussian process hyper-parameter estimation using parallel asymptotically independent Markov sampling","285310904":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation","243773499":"A PARTICLE FILTER FOR MODEL BASED AUDIO SOURCE SEPARATION","51912101":"Geometric Allocation Approach for Transition Kernel of Markov Chain","48198752":"Adaptive Gibbs samplers and related MCMC methods","45933694":"Control Variates for Reversible MCMC Samplers","23502755":"Sparse combinatorial inference with an application in cancer biology","220451814":"Parallel interacting MCMC for learning of topologies of graphical models","41012409":"Strengths and weaknesses of Monte Carlo simulation models and Bayesian belief networks in microbial risk assessment","233532195":"Computational Aspects of Bayesian Spectral Density Estimation","226237365":"Gaussian Semiparametric Analysis Using Hierarchical Predictive Models","270704360":"Estimating the Pareto parameters under progressive censoring data for constant-partially accelerated life tests. J Stat Comput Simul (to appear)","281202190":"Issues in the Multiple Try Metropolis mixing","257157535":"A two-stage stochastic programming model for the optimal design of distributed energy systems","281185807":"Approche non supervisée par processus ponctuels marqués pour l\u0027extraction d\u0027objets à partir d\u0027images aériennes et satellitaires","277902942":"Dynamic Data Driven Sensor Network Selection and Tracking","227998553":"Markov Chains","229149560":"Probabilistic versus possibilistic risk assessment models for optimal service level agreements in grid computing","282052122":"Comparison of Inverse Wishart and Separation-Strategy Priors for Bayesian Estimation of Covariance Parameter Matrix in Growth Curve Analysis","230617961":"Joint modeling of success and treatment discontinuation in in vitro fertilization programs: a retrospective cohort study","258830775":"Avian Influenza Virus H3 Hemagglutinin May Enable High Fitness of Novel Human Virus Reassortants","220658685":"Generalised approach for performance analysis of SIR-based multiple selection diversity over constant correlated α - µ fading channels","51969475":"On the flexibility of the design of Multiple Try Metropolis schemes","228397889":"Ergodicity of Adaptive Monte Carlo","283762228":"Generalized Multiple Importance Sampling","236679365":"Modeling water availability for trees in tropical forests","224302014":"Chemical reaction rate parameter estimation by MAP particle filter algorithm","48178238":"Reuse, Recycle, Reweigh: Combating Influenza through Efficient Sequential Bayesian Computation for Massive Data","23463812":"Template-driven spatial-temporal outbreak simulation for outbreak detection evaluation.","276461208":"Computational Enhancements to Bayesian Design of Experiments Using Gaussian Processes","41911452":"Analysis of Extreme Drinking in Patients with Alcohol Dependence Using Pareto Regression","8636006":"Brownian models and coalescent structures","34417898":"Factor graphs and MCMC approaches to iterative equalization of nonlinear dispersive channels /","235305194":"Health status assessment using reverse supply chain data","233949981":"Balancing Precision and Risk: Should Multiple Detection Methods Be Analyzed Separately in N-Mixture Models?","6221491":"Dynamics of Porphyrin Electron-Transfer Reactions at the Electrode–Electrolyte Interface at the Molecular Level","245553234":"Verification of the conventional measuring uncertainty evaluation model with Monte Carlo simulation","255971761":"Sequential Markov Chain Monte Carlo","261536103":"Modeling the dynamics of social networks using Bayesian hierarchical blockmodels","225438620":"Markov Chain Monte Carlo methods","281089586":"Chronomodel User Manual","257550764":"Comparing the adaptive Gaussian mixture filter with the ensemble Kalman filter on synthetic reservoir models","281144887":"Synthesizing and tuning chemical reaction networks with specified behaviours","272029389":"Adding expert contributions to the spatiotemporal modelling of avalanche activity under different climatic influences","250187796":"Cost-Sensitive Learning for Confidential Access Control","221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","47934938":"Studies in Trend Detection of Scatter Plots with Visualization","220396067":"Evolution of Probability Distribution in Time for Solutions of Hyperbolic Equations","23307873":"Mechanical-Statistical Modeling in Ecology: From Outbreak Detections to Pest Dynamics","220308004":"Model Reduction Techniques for Characterization of Fractured Subsurfaces","234140402":"Herded Gibbs Sampling","220387882":"Comparison of distribution strategies in uncertainty-aware catchment delineation","8683405":"Applications of Bayesian Statistical Methods in Microarray Data Analysis","272754504":"Geostatistical Modelling Using Non-Gaussian Matérn Fields","258406508":"Adaptive Gaussian Particle Method for the Solution of the Fokker-Planck Equation","242295163":"Bed occupancy rate and throughput of patients in cardiac surgery departments using simulation models","227547804":"Estimation of regression parameters in missing data problems","225311328":"Bayesian Model Selection and Analysis for Cepheid Star Oscillations","48195025":"Parallel Tempering with Equi-Energy Moves","245582256":"Bayesian Methods for Frequent Terms in Text: Models of Contagion and the �2 Statistic","220598834":"Object Tracking in Structured Environments for Video Surveillance Applications.","282423235":"A Bayesian Method for Estimating Parameters in Stochastic Differential","220660272":"A Gibbs Point Process for Road Extraction from Remotely Sensed Images","26644097":"Using in-situ temperature measurements to estimate saturated soil thermal properties by solving a sequence of optimization problems","220674608":"Influence of input PDF parameters of a model on a failure probability estimation","262277310":"Modified Monte Carlo Method for Triple Integral","221545001":"Improvement of calculating triple integral based on Monte-Carlo algorithm","221336111":"Flow-Based Bayesian Estimation of Nonlinear Differential Equations for Modeling Biological Networks.","51692554":"Cutting Feedback in Bayesian Regression Adjustment for the Propensity Score","286199313":"Addressing the Uncertainty in Modeling Watershed Nonpoint Source Pollution","49391086":"Méthodes Bayésiennes pour le démélange d\u0027images hyperspectrales","220660231":"A Cumulant Expansion Technique for Simultaneous Markov Random Field Image Restoration and Hyperparameter Estimation","23668297":"Corander J, Marttinen P, Siren J, Tang J.. Enhanced Bayesian modelling in BAPS software for learning genetic structures of populations. BMC Bioinform 9: 539","257484920":"Fuzzy Spatial Constraints and Ranked Partitioned Sampling Approach for Multiple Object Tracking","246864279":"NHPP models for categorized software defects","38067557":"Hierarchical Bayesian Modeling and Markov Chain Monte Carlo Sampling for Tuning-Curve Analysis","224684609":"Performance Capability Modeling And Optimization Of RF/Millimeter Wave Integrated Functions And Modules Using A Hybrid Statistical/Electromagnetic Technique That Includes Process Variations","260022360":"Sequential Monte Carlo for Graphical Models","226542248":"An explicit quantum chemical solvent model for strongly coupled solute–solvent systems in ground or excited state","233802438":"A Bayesian measurement error model for two-channel cell-based RNAi data with replicates","267368646":"A Two-Step Soft Segmentation Procedure for MALDI Imaging Mass Spectrometry Data","239735136":"Probabilistic Star Discrepancy Bounds for Double Infinite Random Matrices","6293327":"Data cloning: Easy maximum likelihood estimation for complex ecological models using Bayesian Markov Chain Monte Carlo methods","51393569":"Fuel Use and Emissions Comparisons for Alternative Routes, Time of Day, Road Grade, and Vehicles Based on In-Use Measurements","51962921":"Measurement Error Models in Astronomy","224639569":"The marginalized particle filter in practice","230294152":"Asteroid orbital ranging using Markov‐Chain Monte Carlo","261531809":"Bayesian imputation of non-chosen attribute values in revealed preference surveys","276844475":"Least Squared Simulated Errors","224651871":"A novel grid computing approach for probabilistic small signal analysis","4360062":"Analysis of high frequency partials in Bayesian harmonic model","224109159":"A Set-based Framework for Coherent Model Invalidation and Parameter Estimation of Discrete Time Nonlinear Systems","43253166":"Characteristics of the Dynamic of Mobile Networks","228315814":"MCMC Estimation of Lvy Jump Models Using Stock and Option Prices","228971237":"A robust sequential Bayesian method for identification of differentially expressed genes","51928158":"Hierarchical Bayesian estimation of inequality measures with\nnonrectangular censored survey data with an application to wealth\ndistribution of French households","229075681":"Fast Spatiotemporal Smoothing of Calcium Measurements in Dendritic Trees","221346425":"Bayesian Learning via Stochastic Gradient Langevin Dynamics","257312797":"Bayesian estimation of the offspring mean in branching processes: Application to infectious disease data","265158784":"A Measure-Theoretic Variational Bayesian Algorithm for Large Dimensional Problems","47932820":"Bayesian analysis of community dynamics","226710220":"An effective 3D target recognition model imitating robust methods of the human visual system","233403046":"Bayesian three-dimensional reconstruction of toothed whale trajectories: Passive acoustics assisted with visual and tagging measurements","236081474":"Potential impacts of radon, terrestrial gamma and cosmic rays on childhood leukemia in France: A quantitative risk assessment","251859024":"Tracking ground based targets in aerial video with dual-tree wavelet polar matching and particle filtering","236132672":"A model for analyzing spatially correlated binary data clustered in uncorrelated lattices","4914975":"Reversible Jump Markov Chain Monte Carlo Strategies for Bayesian Model Selection in Autoregressive Processes","224246280":"Langevin and Hessian with Fisher approximation stochastic sampling for parameter estimation of structured covariance","227728074":"Bayesian Nonstationary Frequency Analysis of Hydrological Variables1","226587355":"Application of Minimum Distortion Filtering to Identification of Linear Systems Having Non-uniform Sampling Period","48209283":"Stochastic Approximation and Newton\u0027s Estimate of a Mixing Distribution","229905131":"Fine-scale environmental variation in species distribution modelling: Regression dilution, latent variables and neighbourly advice","224408064":"Scenario Generation for Price Forecasting in Restructured Wholesale Power Markets","259684376":"Bayesian estimation for target tracking, Part III: Monte Carlo filters","226069021":"Comparison of Different Measurement Spaces for Spatio–Temporal Recurrent Track–Before–Detect Algorithm","236054900":"Adaptive Markov chain Monte Carlo for auxiliary variable method and its application to parallel tempering","289267291":"Fundamentals of Emerging Techniques","247837101":"A General Choice Model for Bundles with Multiple-Category Products: Application to Market Segmentation and Optimal Pricing for Bundles","254212174":"A General Purpose Sampling Algorithm for Continuous Distributions (the t-walk)","265525433":"Bayesian Inverse Problems with Monte Carlo Forward Models","233816709":"DPMs for the Density Estimation in a Dynamic Nonlinear Modeling: Application to GPS Positioning in Urban Canyons","41465106":"The Development of Posterior Probability Models in Risk-Based Integrity Modeling","248398244":"An Integrative Framework for Bayesian Variable Selection with Informative Priors for Identifying Genes and Pathways","43535863":"On the Feasibility of Using the Intrinsic Fluorescence of Nucleotides for DNA Sequencing","224983559":"Dynamic Compressive Sensing of Time-Varying Signals Via Approximate Message Passing","272240469":"Household Finances and Social Interaction: Bayesian Analysis of Household Panel Data","222835256":"Identification of Bayesian posteriors for coefficients of chaos expansions","236106082":"Probabilistic Inference of Biochemical Reactions in Microbial Communities from Metagenomic Sequences","269305721":"Real-time optimisation-based planning and scheduling of vehicle trajectories","4915004":"Bayesian Model Uncertainty In Smooth Transition Autoregressions","10637272":"A statistical model of diurnal variation in human growth hormone","48190885":"Minimum Mean Square Distance Estimation of a Subspace","236980573":"Multipixel Retrieval of Structural and Optical Parameters in a 2-D Scene With a Path-Recycling Monte Carlo Forward Model and a New Bayesian Inference Engine","259440648":"A hierarchical Bayesian approach for the analysis of climate change impact on runoff extremes","262265054":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","47932762":"On probability-based inference under data missing by design","224152286":"Performance Evaluation of the Markov Chain Monte Carlo MIMO Detector based on Mutual Information","264599623":"HIV/AIDS and poverty in South Africa: A bayesian estimation of selection models with correlated fixed-effects","235334021":"The value of reducing eutrophication in European marine\nareas — A Bayesian meta-analysis","235393412":"Understanding the Potential Impact of a Combination HIV Prevention Intervention in a Hyper-Endemic Community","291012315":"A Stochastic Model Predictive Controller for Systems with Unreliable Communications","236857755":"Rejoinder on: Latent Markov models: A review of a general framework for the analysis of longitudinal data with covariates","258404576":"Credit Portfolios, Credibility Theory, and Dynamic Empirical Bayes","283514721":"Flexible Link Functions in Nonparametric Binary Regression with Gaussian Process Priors","229902910":"Measuring and optimizing systems\u0027 quality costs and project duration","271466405":"Modeling and simulation grand challenges: An OR/MS perspective","224602862":"Influence of Driver Behavior Patterns in Correcting Video Sensing Errors in Traffic Surveillance Applications","226519565":"Multiset of Agents in a Network for Simulation of Complex Systems","34954629":"Bayesian Treed Gaussian Process Models","249612659":"Population Influences on Tornado Reports in the United States","264466519":"Monte Carlo limit cycle characterization","228958768":"An approach to actuarial modeling with Quasi-Monte Carlo: simulation of random sums depending on stochastic factors","259336416":"Fully semiparametric Bayesian approach for modeling survival data with cure fraction","285153130":"Adjusted Priors for Bayes Factors Involving Reparameterized Order Constraints","43492609":"An algorithm for rare-event probability estimation using the product rule of probability theory","7321592":"Disease cluster detection: A critique and a Bayesian proposal","260151325":"Empirical Bayes MCMC Estimation for Modeling Treatment Processes, Mechanisms of Change, and Clinical Outcomes in Small Samples","225549036":"Cross-validation prior choice in Bayesian probit regression with many covariates","220058243":"Representation of 3D and 4D Objects Based on an Associated Curved Space and a General Coordinate Transformation Invariant Description","287405758":"Hamiltonian Monte Carlo and Borrowing Strength in Hierarchical Inverse Problems","229427725":"Experimental Design for Parameter Estimation of Gene Regulatory Networks","8525600":"Accounting for Multiplicities in Assessing Drug Safety: A Three-Level Hierarchical Mixture Model","6158335":"Modeling Unobserved Sources of Heterogeneity in Animal Abundance Using a Dirichlet Process Prior","227598900":"State space mixed models for longitudinal observations with binary and binomial responses","4347879":"Bayesian hierarchical models and inference for musical audio processing","7944159":"Gene tree distributions under the coalescent process","241568193":"A FUNCTIONAL BAYESIAN METHOD FOR THE SOLUTION OF INVERSE PROBLEMS WITH SPATIO-TEMPORAL PARAMETERS AUTHORS","228815364":"DUAL STATE-PARAMETER UPDATING SCHEME ON A CONCEPTUAL HYDROLOGIC MODEL USING SEQUENTIAL MONTE CARLO FILTERS","224561868":"MMSE decoding for analog joint source channel coding using monte carlo importance sampling","23977666":"Laplace Expansions in MCMC Algorithms for Latent Variable Models","232063589":"Adaptive MCMC with online relabeling (Extended version)","229536287":"Numerical Algorithms","232608366":"Cokriging-Based Sequential Design Strategies Using Fast Cross-Validation Techniques for Multi-Fidelity Computer Codes","5935087":"Baseline and treatment effect heterogeneity for survival times between centers using a random effects accelerated failure time model with flexible error distribution. To appear in Statistics in Medicine","49517893":"Non-parametric Bayesian Learning with Incomplete Data","226386631":"Mixtures of Factor Analysers. Bayesian Estimation and Inference by Stochastic Simulation","7942082":"Statistical shape analysis: Clustering, learning, and testing","221792899":"A Flexible Bayesian Model for Studying Gene–Environment Interaction","221336207":"Transcriptional Gene Regulatory Network Reconstruction Through Cross Platform Gene Network Fusion","48446813":"Probability Distributions from Riemannian Geometry, Generalized Hybrid Monte Carlo Sampling and Path Integrals","264556550":"A hierarchical sparsity-smoothness Bayesian model for L0-L1-L2 regularization (regular paper)","2125794":"Recursive Monte Carlo filters: Algorithms and theoretical analysis","228645474":"Searching for Rare Growth Factors Using Multicanonical Monte Carlo Methods","24233653":"Parameter estimation in selected populations with missing data","4771715":"Latent class logistic regression: Application to marijuana use and attitudes among high school seniors","259971250":"Bayesian Estimation of the Additive Main Effects and Multiplicative Interaction Model","230316662":"Distribution and Habitat Use of the Missouri River and Lower Yellowstone River Benthic Fishes from 1996 to 1998: a Baseline for Fish Community Recovery","236089822":"Berlin Heart EXCOR Pediatric Ventricular Assist Device for Bridge to Heart Transplantation in US Children","230996489":"A Bayesian Nonparametric Approach to Image Super-Resolution","224101013":"Bulk metamaterials: Design, fabrication and characterization","226894408":"A Renewal Approach to Markovian U-statistics","274036613":"Assessment of end-use electricity consumption and peak demand by Townsville\u0027s housing stock","262207600":"Infinite Dirichlet mixture models learning via expectation propagation","24172195":"Accelerated test system strength models based on Birnbaum-Saunders distribution: A complete Bayesian analysis and comparison","254056688":"Hyperspectral Image Unmixing Using a Multiresolution Sticky HDP","29621785":"A structural approach for 3D building reconstruction","226554459":"Solving genetic heterogeneity in extended families by identifying sub-types of complex diseases","51899595":"Noise can speed convergence in Markov chains","51066071":"Disentangling the Formation of Contrasting Tree-Line Physiognomies Combining Model Selection and Bayesian Parameterization for Simulation Models","24063667":"A Latent Transition Model With Logistic Regression","40482230":"A Hierarchical Bayesian Design for Phase I Trials of Novel Combinations of Cancer Therapeutic Agents","51399921":"An Emerging Infectious Disease Triggering Large-Scale Hyperpredation","220152574":"Free lunches on the discrete Lipschitz class","51168493":"Cai X, Huang A, Xu S.. Fast empirical Bayesian LASSO for multiple quantitative trait locus mapping. BMC Bioinformatics 12: 211","5224365":"Estimating Non-Linear Dynamic Equilibrium Economies: A Likelihood Approach","23420550":"The regularizing effects of resetting in a particle system for the\nBurgers equation","224109245":"Cooperative adaptive sampling via approximate entropy maximization","227674740":"Dynamic risk analysis using alarm databases to improve process safety and product quality: Part II—Bayesian analysis","264466468":"An adaptive population importance sampler","251345171":"Statistical data analysis of the 1995 Ebola outbreak in the Democratic Republic of Congo","258654339":"A novel Bayesian strategy for the identification of spatially varying material properties and model validation: An application to static elastography","227646075":"Modelling dependence using skew t copulas: Bayesian inference and applications","282570552":"A Bayesian approach to constrained single- and multi-objective optimization","228825682":"Bayesian interpolation in a dynamic sinusoidal model with application to packet-loss concealment","259729546":"Estimating Nest Density When Detectability Is Incomplete: Variation In Nest Attendance And Response To Disturbance By Western Meadowlarks","6690708":"A random-effects Markov transition model for Poisson-distributed repeated measures with non-ignorable missing values","262637653":"Romanian Journal of Mathematics and Computer Science","255959218":"Efficient discovery of overlapping communities in massive networks. Proc Natl Acad Sci","263606341":"Reliability‐based design of axially loaded drilled shafts using Monte Carlo method","48198951":"Sequential Monte Carlo on large binary sampling spaces","260028549":"Uncertainty quantification through Monte Carlo method in a cloud computing setting","236603873":"A Measure-Theoretic Computational Method for Inverse Sensitivity Problems I: Method and Analysis","235796982":"Biomarker Discovery for Heterogeneous Diseases","232618529":"Method to Employ Covariate Data in Risk Assessments","281145150":"Issues in the Multiple Try Metropolis mixing","228932186":"Tail Dependence for Multivariate t-Distributions and Its Monotonicity"},"index":628}