{"abs":"Combinatorial auctions, where buyers can bid on bundles of items rather than bidding them sequentially, often lead to more economically efficient allocations of financial resources. However, the problem of determining the winners once the bids are submitted, the so-called winner determination problem (WDP), is known to be NP hard. We present two randomized algorithms to solve this combinatorial optimization problem. The first is based on the cross-entropy (CE) method, a versatile adaptive algorithm that has been successfully applied to solve various well-known difficult combinatorial optimization problems. The other is a new adaptive simulation approach by Botev and Kroese, which evolved from the CE method and combines the adaptiveness and level-crossing ideas of CE with Markov Chain Monte Carlo techniques. The performance of the proposed algorithms are illustrated by various examples.","title":"Randomized methods for solving the Winner Determination Problem in combinatorial auctions","id":224366100,"url":"https://www.researchgate.net/publication/224366100_Randomized_methods_for_solving_the_Winner_Determination_Problem_in_combinatorial_auctions","names":["Joshua C. C. Chan","D.P. Kroese"],"references":{"225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","220669458":"Combinatorial Auctions: A Survey","225427881":"Combinatorial auctions for electronic business","24056488":"Decentralized Computation Procurement and Computational Robustness in a Smart Market","220534701":"CABOB: A Fast Optimal Algorithm for Winner Determination in Combinatorial Auctions","2396285":"Bidding and Allocation in Combinatorial Auctions","2605770":"The Efficiency of the FCC Spectrum Auctions","24048001":"A Combinatorial Auction Mechanism for Aiport Time Slot Allocation"},"citedIn":{"274480286":"Hybrid Genetic Algorithms for Solving Winner Determination Problem in Combinatorial Double Auction in Grid","274458462":"Review of Full Truckload Transportation Service Procurement","50996224":"Handbook of Monte Carlo Methods","261502090":"SmartCart: A consolidated shopping cart for pareto-optimal sourcing and fair discount distribution"},"index":635}