{"abs":"Genetic algorithms (GAs) used in complex optimization domains usually need to perform a large number of fitness function evaluations in order to get near-optimal solutions. In real world application domains such as the engineering design problems, such evaluations might be extremely expensive computationally. It is therefore common to estimate or approximate the fitness using certain methods. A popular method is to construct a so called surrogate or meta-model to approximate the original fitness function, which can simulate the behavior of the original fitness function but can be evaluated much faster. It is usually difficult to determine which approximate model should be used and/or what the frequency of usage should be. The answer also varies depending on the individual problem. To solve this problem, an adaptive fitness approximation GA (ASAGA) is presented. ASAGA adaptively chooses the appropriate model type; adaptively adjusts the model complexity and the frequency of model usage according to time spent and model accuracy. ASAGA also introduces a stochastic penalty function method to handle constraints. Experiments show that ASAGA outperforms non-adaptive surrogate-assisted GAs with statistical significance.","title":"ASAGA: An adaptive surrogate-assisted genetic algorithm","id":220741321,"url":"https://www.researchgate.net/publication/220741321_ASAGA_An_adaptive_surrogate-assisted_genetic_algorithm","names":["Liang Shi","Khaled Rasheed"],"references":{"3421621":"Accelerating Evolutionary Algorithms With Gaussian Process Fitness Function Models","220741295":"Fitness inheritance for noisy evolutionary multi-objective optimization","3421747":"Combining global and local surrogate models to accelerate evolutionary optimization. IEEE Trans Syst Man Cybern Part C Appl Rev","4074804":"Comparing neural networks and Kriging for fitness approximation in evolutionary optimization","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","262333164":"Making Large-Scale Support Vector Machine Learning Practical","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","220743088":"Combating user fatigue in iGAs: partial ordering, support vector machines, and synthetic fitness.","222091365":"Accelerating Evolutionary Algorithms with Gaussian Process Fitness Function Models","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","2317176":"Comparative Studies Of Metamodeling Techniques Under Multiple Modeling Criteria","2876151":"Hierarchical Surrogate-Assisted Evolutionary Optimization Framework","243776152":"The utility of nonlinear programming algorithms","3904026":"An efficient genetic algorithm with less fitness evaluation by clustering","2889038":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","200033867":"Numerical Recipies in C: The Art of Scientific Computing","247661673":"Structure optimization of neural networks for aero-dynamic optimization","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","2752581":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","215721451":"Neural Networks For Pattern Recognition","220176678":"Structure optimization of neural networks for evolutionary design optimization","221995776":"An Introduction to Support Vector Machines","2489625":"Don\u0027t Evaluate, Inherit"},"citedIn":{"254462346":"Surrogate-assisted evolutionary programming for high dimensional constrained black-box optimization","262605029":"Evolutionary Programming for High-Dimensional Constrained Expensive Black-Box Optimization Using Radial Basis Functions","222071209":"Stochastic radial basis function algorithms for large-scale optimization involving expensive black-box objective and constraint functions","263244902":"Constrained optimization by radial basis function interpolation for high-dimensional expensive black-box problems with infeasible initial points","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","220742255":"A surrogate-assisted linkage inference approach in genetic algorithms","263493475":"Surrogate-based optimisation of automotive structures under multiple crash and vibration design criteria","257405053":"DS-DPSO: A dual surrogate approach for intelligent watermarking of bi-tonal document image streams","223466655":"Self-Adaptive Surrogate-Assisted Covariance Matrix Adaptation Evolution\nStrategy","265614475":"ADAPTIVE SURROGATE-ASSISTED EVOLUTION"},"index":636}