{"abs":"This paper focusses on that form of learning which relates to exploration, rather than generalization. It uses the notion of exploration as the modification of state spaces within which search and decision making occur. It demonstrates that the genetic algorithm formalism provides a computational construct to carry out this learning. The process is exemplified using a shape grammar for a beam section. A new shape grammar is learned which produces a new state space for the problem. This new state space has improved characteristics. 1 Introduction Design can be considered a purposeful, constrained, decision making, exploration and learning activity. Decision making implies a set of variables, the values of which have to be decided. Search is the common process used in decision making. Exploration here is akin to changing the problem spaces within which decision making occurs. Learning implies a restructuring of knowledge as opposed to restructuring of facts. Searching in design ...","title":"Evolutionary Learning of Novel Grammars for Design Improvement","id":2595162,"url":"https://www.researchgate.net/publication/2595162_Evolutionary_Learning_of_Novel_Grammars_for_Design_Improvement","names":["John Gero","Sushil J. Louis","Artificial intelligence for engineering design analysis and manufacturing"],"references":{"247649681":"Design knowledge acquisition: task analysis and a partial implementation*1","220371793":"Learning design rules from decisions and performances","3281803":"A Knowledge-Based Equation Discovery System for Engineering Domains","222948277":"A methodology of design knowledge acquisition for use in learning expert systems","223123379":"Expanding design spaces through new design variables"},"citedIn":{"229520426":"A Growth Model for Form Generation Using a Hierarchical Evolutionary Approach","225419242":"Grammar-based Genetic Programming: a survey","254199072":"An Approach to Automate Concept Generation of Sheet Metal Parts Based on Manufacturing Operations","47870546":"The development of parametric shape grammars integrated with an interactive evolutionary system for supporting product design exploration","223711452":"Genetic algorithms for optimal feedback control design","221911601":"A Microstrip Antenna Shape Grammar","226621324":"COMBINING EVOLUTIONARY ALGORITHMS AND SHAPE GRAMMARS TO GENERATE BRANDED PRODUCT DESIGN","255170981":"Combining the Bees Algorithm and shape grammar to generate branded product concepts","231878085":"Towards the support of innovative conceptual design through interactive designer/evolutionary computing strategies","8116705":"Human-centric intelligent systems for exploration and knowledge discovery","254303923":"Investigating effects of oppositely related semantic stimuli on design concept creativity","2369976":"Evolvingbuildingblocksfordesignusinggeneticengineering: A Formal Approach.","2519098":"An Exploration-Based Evolutionary Model of a Generative Design Process","237775923":"Evolving a Logo Design using Grammatical Evolution","226254172":"User-Centric Evolutionary Computing: Melding Human and Machine Capability to Satisfy Multiple Criteria","228602502":"Improving problem definition through interactive evolutionary computation","220742031":"Shape grammars and grammatical evolution for evolutionary design","220306694":"Using language as related stimuli for concept generation. AI EDAM","227612216":"Modeling Design Exploration as Co‐Evolution","284716757":"String-rewriting grammars for evolutionary architectural design","245235760":"AI in Control System Design Using a New Paradigm for Design Representation","242427457":"Ph.D . Dissertation Pr oposal Using Lear ning to Impr o v e Multi-Agent Systems f or Design Dan L. Gr ecu","224330221":"Evolving a Logo Design using Lindenmayer Systems, Postscript \u0026 Grammatical Evolution","220306837":"Evolving Product Form Designs using Parametric Shape Grammars Integrated with Genetic Programming","227762469":"An Exploration‐Based Evolutionary Model of a Generative Design Process","222494842":"Creativity, emergence and evolution in design","222305276":"An exploration into evolutionary models for non-routine design","221006353":"www.cosc.brocku.ca Automatic Evolution of Conceptual Building Architectures","268475586":"Automated Synthesis of Sheet Metal Parts by Optimizing a Fabrication Based Graph Topology","2435814":"Using Learning to Improve Multi-Agent Systems for Design","30870162":"Creativity, emergence and evolution in design: concepts and framework","236028248":"A Review of Metaheuristic-Based Product Concept Generation Systems","2674018":"Formalising Design Exploration As Co-Evolution: A Combined Gene Approach","30876423":"Dynamic interface for axial spatial arrangements using soft computing","265742725":"The Effects of Language Stimuli on Design Creativity","2667504":"Evolved Representations and Their Use in Computational Creativity","291257989":"Variable-Complexity Evolution of Shape Grammars for Engineering Design","248132630":"Towards an Optimal Engineering Design Process Using Appropriate Adaptive Search Strategies","30870154":"Evolving Building Blocks For Design Using Genetic Engineering: A Formal Approach","3282031":"Grammatical design","30872585":"Modeling design exploration as co-evolution","220371905":"An exploration into evolutionary models for non-routine design.","222922797":"Knowledge-based design research at the key centre of design computing","2507330":"The Generation Of Form Using An Evolutionary Approach","245528775":"Evolutionary design using grammatical evolution and shape grammars: Designing a shelter","226165021":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","259360030":"Reflective practice, artificial intelligence, and engineering design: Common trends and interrelationships","232654133":"An Efficient Algorithm for the Control of Reconfigurable Pixel Microstrip Antennas","233638657":"Conceptual design of bicycle frames by multiobjective shape annealing","222505518":"Space layout planning using an evolutionary approach","30871224":"Representation and Use of Design Knowledge in Evolutionary Design","267224834":"Introducción a la Computación Evolutiva (Notas de Curso)","2598101":"Domain Knowledge for Genetic Algorithms","30870180":"Exploring Style Emergence in Architectural Designs","220306908":"Biomimetic design through natural language analysis to facilitate cross-domain information retrieval","257601701":"Design with shape grammars and reinforcement learning"},"index":637}