{"abs":"The AGDISP aerial spray simulation model is used to predict the deposition of spray material released from an aircraft. Determining the optimal input values to AGDISP in order to produce a desired spray material deposition is extremely difficult (NP hard). SAGA, an intelligent optimization method based on the simple genetic algorithm, was developed to solve this problem. Our project is the subsequent work of SAGA. We apply several nature inspired heuristics, mainly based on genetic algorithms, to this problem. The first method still uses the genetic algorithm, but changes genetic algorithm type, selection method, crossover and mutation operators. The second method applies a neural network to improve the initial population, crossover and mutation. The third method uses GADO, a general-purpose approach to solving the parametric design problem. The fourth method uses simulated annealing. Finally, we compare their performance in the aerial spray deposition problem.","title":"A COMPARISON OF NATURE INSPIRED INTELLIGENT OPTIMIZATION METHODS IN AERIAL SPRAY DEPOSITION MANAGEMENT","id":242190000,"url":"https://www.researchgate.net/publication/242190000_A_COMPARISON_OF_NATURE_INSPIRED_INTELLIGENT_OPTIMIZATION_METHODS_IN_AERIAL_SPRAY_DEPOSITION_MANAGEMENT","names":[],"references":{"201976488":"Uniform Crossover in Genetic Algorithms","243668613":"McClelland and the PDP Research Group","200105001":"Equation of State by Fast Computing Machines","201976655":"Real-Coded Genetic Algorithms and Interval-Schema","3031049":"Optimality and Non-Scalar-Valued Performance Criteria","3114631":"Grefenstette, J.J.: Optimization of control parameters for genetic algorithms. IEEE Trans. Syst. Man Cybern. 16(1), 122-128","243665386":"Genetic Algorithms in Searching","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","221049050":"Aerial Spray Deposition Management Using the Genetic Algorithm","220045412":"Adoption in Natural and Artificial System","30869230":"Handbook Of Genetic Algorithms","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization"},"citedIn":{},"index":638}