{"abs":"Enterprises often need to assess and manage the risk arising from uncertainty in their data. Such uncertainty is typically modeled as a probability distribution over the uncertain data values, specified by means of a complex (often predictive) stochastic model. The probability distribution over data values leads to a probability dis- tribution over database query results, and risk assessment amounts to exploration of the upper or lower tail of a query-result distribu- tion. In this paper, we extend the Monte Carlo Database System to efficiently obtain a set of samples from the tail of a query-result distribution by adapting recent \"Gibbs cloning\" ideas from the sim- ulation literature to a database setting.","title":"MCDB-R: Risk analysis in the database","id":220538627,"url":"https://www.researchgate.net/publication/220538627_MCDB-R_Risk_analysis_in_the_database","names":["Subi Arumugam","Ravi Jampani","Luis Leopoldo Perez","Fei Xu","Christopher M. Jermaine","Peter J. Haas"],"references":{"1915261":"Conditioning Probabilistic Databases","220538596":"MAD Skills: New Analysis Practices for Big Data.","221213454":"MCDB: a Monte Carlo approach to managing uncertain data","26406512":"Basic Properties of Strong Mixing Conditions. A Survey and Some Open Questions","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","221214249":"MauveDB: Supporting model-based user views in database systems","220420330":"Probabilistic Databases: Diamonds in the Dirt","29601545":"Rare event simulation for a static distribution","220988225":"Requirements for Science Data Bases and SciDB","226592753":"The Gibbs Cloner for Combinatorial Optimization, Counting and Sampling","220473488":"Representing uncertain data: Models, properties, and algorithms","221213654":"Querying continuous functions in a database system","221617998":"Map-Reduce for Machine Learning on Multicore.","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","220967028":"PIP: A Database System for Great and Small Expectations"},"citedIn":{"232617965":"Using Lower and Upper Bounds to Increase the Computing Accuracy of Monte Carlo Method","260499142":"Dealing with Uncertainty: A Survey of Theories and Practices","221214542":"Jigsaw: Efficient Optimization Over Uncertain Enterprise Data","266656630":"Knowledge expansion over probabilistic knowledge bases","221510736":"Database Foundations for Scalable RDF Processing","276347005":"Query Analytics over Probabilistic Databases with Unmerged Duplicates","254042861":"Correlation Support for Risk Evaluation in Databases","220225052":"The Monte Carlo Database System: Stochastic Analysis Close to the Data","269191925":"Model-data Ecosystems"},"index":639}