{"abs":"AGDISP (Aerial Spray Simulation Model) is used to predict the deposition of spray material released from an aircraft. Determining the optimal input values to AGDISP in order to produce a desired spray material deposition is extremely difficult (NP hard). SAGA, an intelligent optimization method based on the simple genetic algorithm, was developed to solve this problem. In this paper, we apply several nature inspired heuristics to this problem. The first method still uses the genetic algorithm, but changes its type, selection method, crossover and mutation operator. The second method applies a neural network to improve the initial population, crossover and mutation. The third method uses GADO, a general-purpose approach to solving the parametric design problem. The fourth method applies simulated annealing to this problem. Finally, we compare their performance with SAGA and discuss their applications to the aerial spray deposition problem.","title":"Nature Inspired Heuristics in Aerial Spray Deposition Management","id":249944474,"url":"https://www.researchgate.net/publication/249944474_Nature_Inspired_Heuristics_in_Aerial_Spray_Deposition_Management","names":["L. Wu","Walter D. Potter","K. Rasheed","J. Ghent","D. Twardus","H. Thistle"],"references":{"201976488":"Uniform Crossover in Genetic Algorithms","201976655":"Real-Coded Genetic Algorithms and Interval-Schema","3031049":"Optimality and Non-Scalar-Valued Performance Criteria","274519666":"AGDISP: The Aircraft Spray Dispersion Model, Code Development and Experimental Validation","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","242356870":"Adaptation In Natural And Artificial Systems","30873058":"Genetic + Data Structures \u003d Evolution Programs","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","221049050":"Aerial Spray Deposition Management Using the Genetic Algorithm","220045412":"Adoption in Natural and Artificial System","30869230":"Handbook Of Genetic Algorithms","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{},"index":642}