{"abs":"Oversimplified models and erroneous inputs play a significant role in impairing environmental predictions. To assess the contribution of these errors to model uncertainties is still challenging. Our objective is to understand the effect of model complexity on systematic modeling errors. Our method consists of formulating alternative models with increasing detail and flexibility and describing their systematic deviations by an autoregressive bias process. We test the approach in an urban catchment with five drainage models. Our results show that a single bias description produces reliable predictions for all models. The bias decreases with increasing model complexity and then stabilizes. The bias decline can be associated with reduced structural deficits, while the remaining bias is probably dominated by input errors. Combining a bias description with a multimodel comparison is an effective way to assess the influence of structural and rainfall errors on flow forecasts.","title":"Model bias and complexity - Understanding the effects of structural deficits and input errors on runoff predictions","id":269695393,"url":"https://www.researchgate.net/publication/269695393_Model_bias_and_complexity_-_Understanding_the_effects_of_structural_deficits_and_input_errors_on_runoff_predictions","names":["Dario Del Giudice","P. Reichert","V. Bares","Carlo Albert","Jörg Rieckermann","Environmental Modelling and Software"],"references":{"51967192":"A Mechanistic Dynamic Emulator","228618595":"Treatment of Uncertainty Using Ensemble Methods: Comparison of Sequential Data Assimilation and Bayesian Model Averaging","232608030":"Towards a comprehensive assessment of model structural adequacy","200105001":"Equation of State by Fast Computing Machines","4772045":"Bayesian Calibration of Computer Models","236583327":"Analyzing input and structural uncertainty of nonlinear dynamic models with stochastic, time-dependent parameters","251425403":"Disentangling uncertainties in distributed hydrological modeling using multiplicative error models and sequential data assimilation","239667584":"A Framework for Validation of Computer Models","222706252":"Uncertainty in the environmental modelling process - A framework and guidance. Environ Modell Softw","222667272":"Hydrological Modelling of the Chaohe Basin in China: Statistical Model Formulation and Bayesian Inference","215483479":"Performance and sensitivity analysis of stormwater models using a Bayesian approach and long-term high resolution data","223387072":"Urban runoff modelling uncertainty: comparison among Bayesian and pseudo-Bayesian methods. Environ Model Softw","227413790":"Mechanism-based emulation of dynamic simulation models: Concept and application in hydrology","258553083":"Using discharge data to reduce structural deficits in a hydrological model with Bayesian inference approach and the implications for the prediction of critical source areas","222679574":"Comparing Uncertainty Analysis Techniques for a SWAT Application to the Chaohe Basin in China","200806059":"An Analysis of Transformation","4744220":"Bayesian Forecasting for Complex Systems Using Computer Simulators","260700446":"Separately accounting for uncertainties in rainfall and runoff: Calibration of event-based conceptual hydrological models in small urban catchments using Bayesian method","226460648":"Parameter estimation in nonlinear environmental problems","233398704":"A formal statistical approach to representing uncertainty in rainfall–runoff modelling with focus on residual analysis and probabilistic output evaluation – Distinguishing simulation and prediction","47661262":"Real-time forecasting urban drainage models: Full or simplified networks?","2492669":"Bayesian measures of model complexity and fit. J R Stat Soc Ser B Stat Methodol","5263629":"Underestimation of Uncertainty in Statistical Regression of Environmental Models: Influence of Model Structure Uncertainty","256756435":"Parsimonious hydrological modeling of urban sewer and river catchments","236744508":"Bayesian uncertainty assessment of flood predictions in ungauged urban basins for conceptual rainfall-runoff models","47819641":"Robust adaptive Metropolis algorithm with coerced acceptance rate","260700456":"Integrated uncertainty assessment of discharge predictions with a statistical error model","254241286":"Structural uncertainty assessment in a discharge simulation model","236744511":"Scholten L, Scheidegger A, Reichert P, Maurer M. Combining expert knowledge and local data for improved service life modeling of water supply networks. Environmental Modelling \u0026 Software","258619022":"Towards optimal allocation of computer resources: Trade-offs between uncertainty quantification, discretization and model reduction","236270771":"Catchment properties, function, and conceptual model representation: Is there a correspondence?","251473307":"Rainfall Uncertainty in Hydrological Modelling: An Evaluation of Multiplicative Error Models","248809267":"Estimating the Uncertain Mathematical Structure of a Water Balance Model via Bayesian Data Assimilation","200472218":"River Flow Forecasting Through Conceptual Models, Part I, A Discussion of Principles","258332873":"Considering rating curve uncertainty in water level predictions","258788033":"Improving uncertainty estimation in urban hydrological modeling by statistically describing bias","43100223":"Structural and parameter uncertainty in Bayesian cost-effectiveness models","258552902":"Toward a reliable decomposition of predictive uncertainty in hydrological modeling: Characterizing rainfall errors using conditional simulation","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","251670703":"Accounting for structural error and uncertainty in a model: An approach based on model parameters as stochastic processes","257047421":"Resolving structural errors in a spatially distributed hydrologic model using ensemble Kalman filter state updates","223592483":"An Evaluation of the Impact of Model Structure on Hydrological Modelling Uncertainty for Streamflow Simulation","257549864":"Calibration of computationally demanding and structurally uncertain models with an application to a lake water quality model","256476666":"An Analysis Of Transformations","45834383":"Model complexity control for hydrologic prediction","230538501":"Mathematical Modelling of Chemical Processes—Obtaining the Best Model Predictions and Parameter Estimates Using Identifiability and Estimability Procedures","233415250":"Linking statistical bias description to multiobjective model calibration","38322292":"An Adaptive Metropolis Algorithm"},"citedIn":{"281735245":"Employing statistical model emulation as a surrogate for CFD","282421369":"The value of streamflow data in improving TSS predictions - Bayesian multi-objective calibration","282282543":"Assessing a fuzzy model and HSPF to supplement rainfall data for nonpoint source water quality in the Feitsui reservoir watershed"},"index":644}