{"abs":"Gradient-based numerical optimization of complex engineering designs offers the promise of rapidly producing better designs. However, such methods generally assume that the objective function and constraint functions are continuous, smooth, and defined everywhere. Unfortunately, realistic simulators tend to violate these assumptions, making optimization unreliable. Several decisions that need to be made in setting up an optimization, such as the choice of a starting prototype and the choice of a formulation of the search space, can make a difference in the reliability of the optimization. Machine learning can improve gradient-based methods by making these choices based on the results of previous optimizations. This paper demonstrates this idea by using machine learning for four parts of the optimization setup problem: selecting a starting prototype from a database of prototypes, synthesizing a new starting prototype, predicting which design goals are achievable, and selecting a formulation of the search space. We use standard tree-induction algorithms (C4.5 and CART). We present results in two realistic engineering domains: racing yachts and supersonic aircraft. Our experimental results show that using inductive learning to make setup decisions improves both the speed and the reliability of design optimization.","title":"Learning to set up numerical optimizations of engineering designs","id":231747680,"url":"https://www.researchgate.net/publication/231747680_Learning_to_set_up_numerical_optimizations_of_engineering_designs","names":["Thomas Ellman","HAYM  HIRSH ","Artificial intelligence for engineering design analysis and manufacturing"],"references":{"246668529":"Learning Logical De nitions from Relations","2847598":"The Rutgers CAP Project Design Associate","23864802":"The application of artificial intelligence technology to aeronautical system design","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","225092410":"First Leaves: A Tutorial Introduction to Maple V","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","226979797":"Initial Design Strategies for Iterative Design","2440307":"Dimensions of Learning in Agent-based Design","2745407":"Intelligent Model Selection for Hillclimbing Search in Computer-Aided Design","2312952":"Intelligent Gradient-Based Search of Incompletely Defined Design Spaces","225070513":"Case-Based Reasoning","260902993":"Stars \u0026 Stripes","2812341":"User\u0027s Guide for CFSQP Version 2.5: A C Code for Solving (Large Scale) Constrained Nonlinear (Minimax) Optimization Problems, Generating Iterates Satisfying All Inequality Constraints","243659610":"Retrieval strategies in a case-based design system","221492695":"Mathematical Elements for Computer Graphics.","221603280":"Dominic II: Meta-Level Control in Iterative Redesign.","2284615":"A System for Induction of Oblique Decision Trees","34819700":"Inter-GEN : a hybrid approach to engineering design optimization /","223530746":"Graphical representation of design optimization processes","2809347":"The Use Of Artificial Intelligence To Improve The Numerical Optimization Of Complex Engineering Designs","2680194":"Abstraction and Decomposition in Hillclimbing Design Optimization","226625577":"Advice to Machine Learning Authors.","2425544":"Model-Based Design Indexing and Index Learning in Engineering Design","222118611":"Coupling symbolic manipulation and numerical simulation for complex engineering designs","222947257":"A search space toolkit: SST","226988403":"Learning Logical Definitions from Relations","2734687":"Activity Analysis: The Qualitative Analysis of Stationary Points for Optimal Reasoning","44054233":"Using Qualitative Models to Guide Inductive Learning","223938660":"Using Modeling Knowledge to Guide Design Space Search","236526372":"Integration of artificial intelligence and numerical optimization techniques for the design of complex aerospace systems","220688794":"C4.5: Programs For Machine Learning","229703310":"Classification and Regression Trees"},"citedIn":{"225488112":"CBE-Conveyor: A Case-Based Reasoning System to Assist Engineers in Designing Conveyor Systems","242934906":"Ontologies for Supporting Engineering Design Optimization","257512794":"An introduction to swarming robotics: application development trends","262390891":"Artificial intelligence for design","237294509":"DESIGN OPTIMIZATION PROBLEM REFORMULATION USING SINGULAR VALUE DECOMPOSITION Somwrita Sarkar","226780749":"Learning Symbolic Formulations in Design Optimization","220306540":"Inductive machine learning of optimal modular structures: Estimating solutions using support vector machines","265424962":"An ontology of computer-aided design","30871236":"A Framework for Situated Design Optimization","269279775":"Learning symbolic formulations in design optimization","264816219":"Optimising Aspects of Rotor Blades in Forward Flight","225588070":"Engineering design optimization based on intelligent response surface methodology","260125143":"Engineering Design and Decision Making Models","246854445":"MODELLING SITUATED DESIGN OPTIMIZATION","225810027":"Challenges to Bayesian decision support using morphological matrices for design: Empirical evidence","255325480":"Adaptive evolutionary Monte Carlo algorithm for optimization with applications to sensor placement problems","224178051":"Automated discovery of vital knowledge from Pareto-optimal solutions: First results from engineering design","228374398":"Optimal sensor distribution in multi-station assembly processes for maximal variance detection capability","237787467":"Employment History","220306889":"Learning Symbolic Formulations in Design: Syntax, Semantics, Knowledge Reification","228364849":"Design Optimization Problem Reformulation Using Singular Value Decomposition","226858603":"Inductive machine learning in microstructures","12061335":"[First aid service in Germany].","26897321":"Near optimal design of fixture layouts in multi-station assembly processes","228571944":"Optimal Engineering System Design Guided by Data-Mining Methods","2421087":"Multi-Level Simulation and Numerical Optimization of Complex Engineering Designs","2615899":"A Formalism for Coupled Design/Learning Activities","225777737":"“An Inductive Approach to Learning and Reusing Design Strategies,”","267487373":"A Learning and Inference Mechanism for Design Optimization Problem (Re)-Formulation Using Singular Value Decomposition","242192338":"NEAR OPTIMAL DESIGN OF FIXTURE LAYOUTS IN MULTI","223938660":"Using Modeling Knowledge to Guide Design Space Search","225638863":"Feature-based classifiers for design optimization. Res Eng Des","226625853":"Data Mining of Design Products and Processes"},"index":646}