{"abs":"Making good predictions about a physical system using a computer model requires the inputs to be carefully specified. Some of these inputs called control variables have to reproduce physical conditions whereas other inputs, called parameters, are specific to the computer model and most often uncertain. The goal of statistical calibration consists in tuning these parameters to make the outputs of the computer model as close as possible to the field measures. Where prior information is available, Bayesian inference can be conducted using MCMC methods, which are unfortunately unfeasible when the simulations are too time-consuming. A way to circumvent this issue is to emulate the computer model with a Gaussian process emulator. Using such a cheap approximation in the calibration process causes a new source of uncertainty which strongly depends on the choice of a numerical design of experiments from which this emulator is fitted. This uncertainty can be reduced by building a proper sequential design which is adapted to the calibration goal using the Expected Improvement criterion. Numerical illustrations in several dimensions are provided to assess the efficiency of such sequential strategies.","title":"Adaptive numerical designs for the calibration of computer codes","id":272845206,"url":"https://www.researchgate.net/publication/272845206_Adaptive_numerical_designs_for_the_calibration_of_computer_codes","names":["Guillaume Damblin","Pierre Barbillon","Merlin Keller","Alberto Pasanisi","Eric Parent"],"references":{"228438173":"Simultaneous kriging-based estimation and optimization of mean response","50193599":"Mise en oeuvre et exploitation du métamodèle processus gaussien pour l\u0027analyse de modèles numériques—Application à un code de transport hydrogéologique","50402307":"Gaussian Processes for Machine Learning (GPML) toolbox","263121578":"Fast Sequential Computer Model Calibration of Large Nonstationary Spatial-Temporal Processes","239667584":"A Framework for Validation of Computer Models","260278602":"Design and Modeling for Computer Experiments","241077911":"A Complete Framework for Verification, Validation, and Uncertainty Quantification in Scientific Computing (Invited)","41781559":"Gaussian Process for Machine Learning","2828192":"A Statistical Method for Tuning a Computer Code to a Data Base","256548868":"Efficient uniform designs for multi-wave computer experiments","270365580":"Algorithm AS 106: The Distribution of Non-Negative Quadratic Forms in Normal Variables","228936502":"Computer model calibration or tuning in practice","235324242":"Sensitivity Analysis","41222435":"Monte Carlo Statistical Method","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","251876634":"Numerical studies of space-filling designs: Optimization of Latin Hypercube Samples and subprojection properties","245079104":"Statistical calibration of computer simulations","222679450":"Convergence properties of the expected improvement algorithm with fixed mean and covariance functions","222135261":"Exploratory Designs for Computational Experiments","216301381":"The Design and Analysis Computer Experiments","250754768":"9 Computer experiments","277072736":"MULTIPLES MÉTAMODÈLES POUR L\u0027APPROXIMATION ET L\u0027OPTIMISATION DE FONCTIONS NUMÉRIQUES MULTIVARIABLES","268209561":"M Carlo Statistical Methods","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","224773133":"Elements of Information Theory. Wiley","237225802":"Sequential Calibration of Computer Models","238342681":"Principles of geostatistics. Econ Geol (Lancaster)","243103187":"Multivariate Gaussian Simulation Outside Arbitrary Ellipsoids","280991697":"Réflexions sur l\u0027analyse d\u0027incertitudes dans un contexte industriel : informations disponibles et enjeux décisionnels","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","220056297":"Non linear methods for Inverse Statistical Problems","263047835":"Computation of Multivariate Normal and Probabilities","232405677":"Batch sequential design to achieve predictive maturity with calibrated computer models","234168781":"Asymptotic analysis of the role of spatial sampling for hyper-parameter estimation of Gaussian processes","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","285341564":"Elements of Information Theory, Second Edition","2358365":"Pressure Matching for Hydrocarbon Reservoirs: A Case Study in the Use of Bayes Linear Strategies for Large Computer Experiments","228339939":"Diagnostics for Gaussian Process Emulators"},"citedIn":{},"index":647}