{"abs":"Evolutionary Algorithms (EAs) used in complex optimization domains usually need to perform a large number of fitness function evaluations in order to find near-optimal solutions. In real world application domains such as engineering design problems, such evaluations can be extremely computationally expensive. It is therefore common to estimate or approximate the fitness. A popular method is to construct a so-called surrogate or meta-model, which can simulate the behavior of the original fitness function, but can be evaluated much faster. An up-to-date survey of fitness approximation applied to EA is presented in this dissertation. The main focuses are the methods of fitness approximation, the working styles of the fitness approximation, and management of the fitness approximation during the optimization process. Working with fitness approximations creates a problem in that it is difficult to determine which approximate model is appropriate for each domain and how often the model should be used. Even for one domain the answer is not usually fixed, but varies within the different stages of the optimization process. To solve this problem, an adaptive fitness approximation GA (ASAGA) is presented. ASAGA adaptively chooses the appropriate model type by adjusting the model complexity and the frequency of model usage according to time elapsed and model accuracy. ASAGA also introduces a stochastic penalty function method to handle constraints. Experiments show that ASAGA performs better than or comparable to several state-of-art surrogate-assisted EAs in benchmark domains and engineering design domains. Statistical analysis suggests that ASAGA outperforms a fixed surrogate-assisted GA in constrained function domains with statistical significance.","title":"ADAPTIVE SURROGATE-ASSISTED EVOLUTION","id":265614475,"url":"https://www.researchgate.net/publication/265614475_ADAPTIVE_SURROGATE-ASSISTED_EVOLUTION","names":["Liang Shi"],"references":{"220741295":"Fitness inheritance for noisy evolutionary multi-objective optimization","3421747":"Combining global and local surrogate models to accelerate evolutionary optimization. IEEE Trans Syst Man Cybern Part C Appl Rev","4074804":"Comparing neural networks and Kriging for fitness approximation in evolutionary optimization","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","220998589":"Fitness inheritance in genetic algorithms","2555186":"Guided Crossover: A New Operator for Genetic Algorithm Based Optimization","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","220381108":"Local Function Approximation in Evolutionary Algorithms for the Optimization of Costly Functions","220743088":"Combating user fatigue in iGAs: partial ordering, support vector machines, and synthetic fitness.","3421614":"Multiobjective GA Optimization Using Reduced Models","2379326":"Evolutionary Optimization for Computationally expensive problems using Gaussian Processes","227319575":"Comparative Studies of Metamodeling Techniques Under Multiple Modeling Criteria","243686554":"Optimization for Engineering Design: Algorithms and Examples","220176770":"Memetic algorithm using multi-surrogates for computationally expensive optimization problems. Soft Comput","4014626":"Surrogate-assisted coevolutionary search","243776152":"The utility of nonlinear programming algorithms","3904026":"An efficient genetic algorithm with less fitness evaluation by clustering","2342018":"GenJam: A Genetic Algorithm for Generating Jazz Solos","261288758":"GADO: A Genetic Algorithm for Continuous Design Optimization","247661673":"Structure optimization of neural networks for aero-dynamic optimization","2325390":"Amplitude Spectra of Fitness Landscapes","2799236":"Efficient Implementation of Gaussian Processes","233893599":"Optimization of Large-Scale 3-D Trusses Using Evolution Strategies and Neural Network","215721451":"Neural Networks For Pattern Recognition","2985886":"Interactive Evolutionary Computation: Fusion of the Capacities of EC Optimization and Human Evaluation. Proceedings of the IEEE 89:1275-1296","2922005":"Evolution Strategies assisted by Gaussian Processes with Improved Pre-Selection Criterion","220702109":"A Hierarchical Genetic Algorithm Using Multiple Models for Optimization","221995776":"An Introduction to Support Vector Machines","2489625":"Don\u0027t Evaluate, Inherit","220742251":"Evaluation Relaxation using Substructural Information and Linear Estimation","200033835":"The Nature of Statistical Learning Theory","216300590":"Metamodel—Assisted Evolution Strategies","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","220743160":"Model-Assisted Steady-State Evolution Strategies","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","246900838":"Mutiobjective Optimization Using Approximation Model-Based Genetic Algorithms","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","220450811":"Fourier and Taylor series on fitness landscapes","222091365":"Accelerating Evolutionary Algorithms with Gaussian Process Fitness Function Models","2876151":"Hierarchical Surrogate-Assisted Evolutionary Optimization Framework","245435132":"Response Surface and Neural Network Techniques for Rocket Engine Injector Optimization","236822466":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","233556491":"Acceleration of the convergence speed of evolutionary algorithms using multi-layer neural networks","220741321":"ASAGA: An adaptive surrogate-assisted genetic algorithm","2889038":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","223009704":"An optimization methodology of alkaline-surfactant-polymer flooding processes using field scale numerical simulation and multiple surrogates. J Pet Sci Eng","1956990":"Fitness Inheritance in the Bayesian Optimization Algorithm","220742862":"The influence of migration intervals on island models","261001961":"Numerical Recipes in C—The Art of Scientific Computing","12386133":"Neural networks are useful tools for drug design","220741955":"Validating a Model of Colon Colouration Using an Evolution Strategy with Adaptive Approximations","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","221996875":"Kernel Method for Pattern Analysis","239006410":"Making large-Scale SVM Learning Practical. Advances in Kernel Methods – Support Vector Learning","1957866":"Multiobjective hBOA, Clustering, and Scalability","220176614":"Faster convergence by means of fitness estimation","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","221165392":"Efficient evolutionary optimization using individual-based evolution control and neural networks: A comparative study"},"citedIn":{},"index":648}