{"abs":"This dissertation describes experiments conducted to explore the efficacy of using vector-valued feedback with a class of adaptive procedures called genetic algorithms. The software system developed was called VEGA for Vector Evaluated Genetic Algorithm and was first used on multiple objective optimization problems. The main conclusion of these experiments was that VEGA provided a powerful and robust search technique for complex multiobjective optimization problems of high order when little or no a priori knowledge was available to guide the search. These results were similar to those found by previous researchers using scalar genetic algorithms for scalar optimization problems. The VEGA technique was then applied to multiclass pattern discrimination tasks. The resulting software system was called LS-2 for Learning System-Two, since it followed closely the lead of a scalar-valued learning system called LS-1 developed by Stephen Smith. These experiments revealed that LS-2 was able to evolve high performance production system programs to perform the pattern discrimination tasks it was given. The VEGA approach demonstrates the efficacy of extending the previously demonstrated power of genetic algorithms to vector-valued problems and, thereby, provides a new approach to machine learning.","title":"Some Experiments in Machine Learning Using Vector Evaluated Genetic Algorithms","id":236443691,"url":"https://www.researchgate.net/publication/236443691_Some_Experiments_in_Machine_Learning_Using_Vector_Evaluated_Genetic_Algorithms","names":["J. David Schaffer"],"references":{},"citedIn":{"2827305":"Finding Multiple Solutions in Problems of Bounded Difficulty","245310617":"A novel evolutionary meta-heuristic for the multi-objective optimization of real-world water distribution networks","37394493":"Multiobjective Optimization — New Formulation\nand Application to Radar Signal Processing","3865137":"A non-generational genetic algorithm for multiobjective optimization","49399546":"Multi-task learning and transfer: The effect of algorithm representation.","220888358":"Elitist-Multi-objective Differential Evolution (E- MODE) Algorithm for Multi-objective Optimization","220449074":"Evolutionary Computation and Its Applications in Neural and Fuzzy Systems","2811965":"Guidance in Evolutionary Multi-Objective Optimization","257512782":"The review of multiple evolutionary searches and multi-objective evolutionary algorithms","3503661":"Robot programming with a genetic algorithm","227597705":"An improved genetic algorithm for robust design in multivariate systems","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","2312766":"Multiobjective Optimization by Iterative Genetic Algorithm","225999718":"Solution of multiobjective optimization problems: Coevolutionary algorithm based on evolutionary game theory","241154687":"Optimization of Regional Coverage Reconnaissance Satellite Constellation by NSGA-II Algorithm","48198911":"New Model for Multi-Objective Evolutionary Algorithms","5297268":"Improving Locality in Binary Representation via Redundancy","225223496":"A flexible three-level logistic network design considering cost and time criteria with a multi-objective evolutionary algorithm. J Intell Manuf","228812677":"Game theory based coevolutionary algorithm: A new computational coevolutionary approach","257790330":"Multi criteria genetic algorithm for optimal blending of coal","226743721":"Combinations of simulation and Evolutionary Algorithms in management science and economics","2417679":"A Survey of Constraint Handling Techniques in Evolutionary Computation Methods","28242307":"Optimización paralela multiobjetivo de conjuntos de perceptrones multicapa para clasificación de patrones","220701961":"An Experimental Perspective on Genetic Programming.","2534934":"Hybrid Multi-Objective Evolutionary Computation of Constrained Downside Risk-Return Efficient Sets for Credit Portfolios","2633240":"Multi-Objective Evolutionary Algorithms: Introducing Bias Among Pareto-Optimal Solutions","2367509":"On the Convergence and Diversity-Preservation Properties of Multi-Objective Evolutionary Algorithms","249430767":"Non-dominated Rank based Sorting Genetic Algorithms","220313874":"A real-coding jumping gene genetic algorithm (RJGGA) for multiobjective optimization","2513938":"Multidisciplinary Shape Optimization in Aerodynamics and Electromagnetics using Genetic Algorithms","6680145":"Independent Component Analysis-motivated Approach to Classificatory Decomposition of Cortical Evoked Potentials","4075017":"Multi-objective genetic algorithms for courses of action planning","225738038":"Approaches to optimal aquifer management and intelligent control in a multiresolutional decision support system","226070333":"Evolutionary Algorithms and Constrained Optimization","221226345":"Discovering Knowledge Rules with Multi-Objective Evolutionary Computing","2615407":"A Pareto Frontier for Full Stern Submarines via Genetic Algorithm","2249323":"Evolutionary Algorithms for Multi-Criterion Optimization in Engineering Design","238660725":"Multi-objective site selection and analysis for GSM cellular network planning","224346897":"A Survey and Future Trend of Study on Multi-Objective Scheduling","224606514":"A Favorable Weight-Based Evolutionary Algorithm for Multiple Criteria Problems","221411175":"A Hybrid Multi-Objective Evolutionary Algorithm Using an Inverse Neural Network.","222818065":"Multi-Objective Particle Swarm Optimization with time variant inertia and acceleration coefficients","227273181":"PID control of MIMO process based on rank niching genetic algorithm","255529312":"Supply Chain Optimization using Multi-Objective Evolutionary Algorithms","27522047":"Multiple Objective Evolutionary Algorithms for Independent, Computationally Expensive Objectives","2790518":"Learning Sequential Decision Rules Using Simulation Models and Competition","265844100":"A new multi-objective mixed-discrete particle swarm optimization algorithm","4089955":"Some discussions about MOGAs: individual relations, non-dominated set, and application on automatic negotiation","220199807":"Multiobjective invasive weed optimization: Application to analysis of Pareto improvement models in electricity markets","228663234":"One decade of multi-objective calibration approaches in hydrological modeling: A review","242526750":"Optimization and integration of ground vehicle systems","251972456":"Design optimisation for permanent magnet synchronous motors using genetic algorithm","221532492":"Computational Intelligence in Modeling of Biological Neurons: A Case Study of an Invertebrate Pacemaker Neuron","224076066":"Multiobjective Genetic Algorithms Applied to Solve Optimization Problems","220706652":"Eliminating Positional Dependency in Binary Representation via Redundancy","243666680":"F1.9 Multicriterion decision making","242619638":"No Optimisation Without Representation: A Knowledge Based Systems View of Evolutionary/Neighbourhood Search Optimisation","41903870":"EXPLORING THE RELATIONSHIP OF THE CLOSENESS OF A GENETIC ALGORITHM’S CHROMOSOME ENCODING TO ITS PROBLEM SPACE","224330205":"Multiobjective Evolutionary Algorithm with Constraint Handling for Aircraft Landing Scheduling","3010216":"Correction To scattering From A Cylindrically Conformal Slotted Waveguide Array Antenna","290852819":"Review of coevolutionary developments of evolutionary multi-objective and many-objective algorithms and test problems","2582188":"New Directions in Genetic Algorithm Theory","228992299":"RPSGAe — Reduced Pareto Set Genetic Algorithm: Application to Polymer Extrusion","271742115":"Pareto Frontier for the time–energy cost vector to an Earth–Moon transfer orbit using the patched-conic approximation","222402516":"Enhanced evolutionary algorithms for single and multiobjective optimization in the job shop scheduling problem","226725142":"An Adaptive Multi-Objective Particle Swarm Optimization Algorithm with Constraint Handling","12473896":"Efficient and Scalable Pareto Optimization by Evolutionary Local Selection Algorithms","3876514":"Evolutionary approach to multi-objective problems using adaptive genetic algorithms","35718843":"Uncertainty based multi-objective optimization of groundwater remediation design /","2770100":"Multi-objective Optimisation and Preliminary Airframe Design","4280031":"A Highly Efficient Multi-objective Optimization Evolutionary Algorithm","220344202":"Competition-Based Induction of Decision Models from Examples","221494171":"An Effective Dynamical Multi-objective Evolutionary Algorithm for Solving Optimization Problems with High Dimensional Objective Space","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","220316557":"A Multi-Objective Evolutionary Algorithm Using Neural Networks to Approximate Fitness Evaluations.","291198454":"Multi-Objective Evolutionary Optimization: Past, Present, and Future","245235760":"AI in Control System Design Using a New Paradigm for Design Representation","225191875":"Hierarchical Approach to Evolutionary Multi-Objective Optimization","223818727":"A tool for multiobjective evolutionary algorithms","248707682":"Feature subset selection using multi-objective genetic algorithms","229760256":"Multicriteria optimization of aircraft panels: Determining viable genetic algorithm configurations","238643336":"Jumping gene adaptations of NSGA-II and their use in the multi-objective optimal design of shell and tube heat exchangers","220199341":"A hybrid multi-objective approach based on the genetic algorithm and neural network to design an incremental cellular manufacturing system. Comput Ind Eng","220856735":"A Novel Multi-objective Evolutionary Algorithm.","220215190":"Optimization of an established multi-objective delivering problem by an improved hybrid algorithm","223456233":"Multi-Objective Optimisation of an Industrial Fluidized-Bed Catalytic Cracking Unit (FCCU) Using Genetic Algorithm (GA) With the Jumping Genes Operator","285449657":"Applications of Genetic Algorithms in Chemical Engineering I: Methodology","268435267":"Uma Abordagem Evolutiva Multi-Objectivo para o Problema de Compensação de Energia Reactiva em Redes de Distribuição de Energia Eléctrica","240921313":"RPSGAe - Reduced Pareto Set Genetic Algorithm: A Multiobjective Genetic Algorithm with Elitism","222496254":"Genetic algorithm approach on multi-criteria minimum spanning tree problem. European Journal of Operational Research, 114, 141-152","228735772":"Preliminary airframe design using co-evolutionary multiobjective genetic algorithms","283452453":"Multi-objective simulation optimization for selection and determination of order quantity in supplier selection problem under uncertainty and quality criteria","261435732":"Vector Evaluated Gravitational Search Algorithm (VEGSA) for Multi-objective Optimization Problems","265213196":"Multiobjective Memetic Estimation of Distribution Algorithm Based on an Incremental Tournament Local Searcher","234810168":"Parallel placement of parallel processes","250718263":"Genetic algorithms for assembly line balancing with various objectives","229574504":"Multi‐objective highway alignment optimization using a genetic algorithm","2262251":"Using a Genetic Algorithm to Learn Strategies for Collision Avoidance and Local Navigation","220199376":"Deriving operating policies for multi-objective reservoir systems: Application of Self-Learning Genetic Algorithm","242322080":"Appendix 1 An Indexed Bibliography of Genetic Algorithms","263428450":"Optimal allocation of water quantity and waste load in the Northwest Pearl River Delta, China","225456552":"Optimal Design of Water Distribution System by Multiobjective Evolutionary Methods","222237671":"A comparison of optimal control and stochastic programming from a formulation and computation perspective","220702206":"Evolutive Identification of Fuzzy Systems for Time-Series Prediction.","220341243":"Multi-objective optimization of an industrial fluidized-bed catalytic cracking unit (FCCU) using two jumping gene adaptations of simulated annealing","229883240":"Multiobjective optimization of the dynamic operation of an industrial steam reformer using the jumping gene adaptations of simulated annealing","226461087":"Computational Intelligence: An Introduction","225763733":"Parametric approach and genetic algorithm for multi objective linear programming with imprecise parameters","220196350":"An incident information management framework based on data integration, data mining, and multi-criteria decision making","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","2239687":"Genetic Algorithms for Composite Laminate Design and Optimization","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","245429831":"Nongradient Methods in Multidisciplinary Design OptimizationStatus and Potential","223069603":"Application of elitist multi-objective genetic algorithm for classification rule generation","257130425":"Adapting the operation of two cascaded reservoirs for ecological flow requirement of a de-watered river channel due to diversion-type hydropower stations. Ecol Modell, 252: 266-272","222681003":"Comparing state-of-the-art evolutionary multiobjective algorithms for long-term groundwater monitoring design. Advances in Water Resources, 29(6), 792-807","266545937":"Evolutionary Computation and Heuristics","282270240":"Multi-Objective Evolutionary Optimization of Sandwich Structures: An Evaluation by Elitist Non-dominated Sorting Evolution Strategy","252004336":"Nonlinear dynamic system identification using Volterra series: Multi-objective optimization approach","220534239":"Multiple Criteria Decision Making, Multiattribute Utility Theory: Recent Accomplishments and What Lies Ahead","238344911":"The Good of the Many Outweighs the Good of the One: Evolutionary Multi Objective Optimization","257404331":"Multiobjective Evolutionary Algorithms for Portfolio Management: A comprehensive literature review","220888533":"Improved Strategies of Multi-objective Differential Evolution (MODE) for Multi-objective Optimization.","233221858":"Parameter Settings and Representations in Pareto-Based Optimization for Job Shop Scheduling","261457042":"Cost optimization of supply chain network of departmental store","3114279":"Improving Learning of Genetic Rule-Based Classifier Systems","2771232":"Conditions for Implicit Parallelism","221163556":"A multi-objective evolutionary based on Hybrid Adaptive Grid Algorithm","228757164":"Lift maximization with uncertainties for the optimization of high-lift devices","221258303":"Multi-Objective Optimization of NARX Model for System Identification Using Genetic Algorithm","242585953":"NSGA-II","239938389":"A k, k-ε optimality selection based multi objective genetic algorithm with applications to vehicle engineering. Optim Eng","271454005":"Star tracker orientation optimization using Non-dominated Sorting Genetic Algorithm (NSGA)","250987499":"Um método evolucionário para sintonia de controladores PI/PID em processos multivariáveis","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107","251299301":"Evolutionary Analog IC Design Optimization","259903580":"Practical Multi-Objective Programming [rev. 4]","229026948":"Designing a new elitist nondominated sorted genetic algorithm for a multiobjective long term groundwater monitoring application","221093391":"Implementing eco-friendly reservoir operation by using genetic algorithm with dynamic mutation operator. LSMS/ICSEE LNBI","248880125":"Single-Objective versus Multiobjective Optimization of Water Distribution Systems Accounting for Greenhouse Gas Emissions by Carbon Pricing","221228544":"The Maximin Fitness Function; Multi-objective City and Regional Planning","241156976":"Optimization of Nutrition Prescription for Meals Based on Multiobjective Struggle GA","222542961":"A niched genetic algorithm to solve a pollutant emission reduction problem in the manufacturing industry: A case study","231374584":"Multi-Objective Optimization of Pressure Swing Adsorbers for Air Separation","221024792":"Introduction to Evolutionary Multiobjective Optimization","282538466":"A Novel Bioinspired Multiobjective Optimization Algorithm for Designing Wireless Sensor Networks in the Internet of Things","245416855":"Applications of the Non-Dominated Sorting Genetic Algorithm (NSGA) in Chemical Reaction Engineering","228795034":"An integrated framework for reducing precast fabrication inventory","226241094":"The Gantry-Tau parallel kinematic machine—kinematic and elastodynamic design optimisation","222078465":"Multi-objective algorithm for solving N-version program design problem","220380768":"Guest Editorial: Special Issue on Preference-Based Multiobjective Evolutionary Algorithms","5303060":"Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria","245231064":"Improved NSGA-II Multi-objective Genetic Algorithm Based on Hybridization-encouraged Mechanism","2243429":"A Non-generational Genetic Algorithm for Multiobjective Optimization","225107490":"Scope of stationary multi-objective evolutionary optimization: A case study on a hydro-thermal power dispatch problem","228404439":"Game model based co-evolutionary solution for multiobjective optimization problems","220882017":"Efficient Design of Pulse Compression Codes using Multiobjective Genetic Algorithm.","221442174":"A Multi-objective Genetic Algorithm Based on Quick Sort","287234632":"Evolution of genetic algorithms in classification rule mining","226202147":"Recent Developments in Evolutionary Multi-Objective Optimization","258988083":"Categorical Feature Reduction Using Multi Objective Genetic Algorithm in Cluster Analysis","242251027":"Uma Abordagem Multiobjetivo para o Problema de Corte de Estoque Unidimensional","224112702":"Generation of pulse compression codes using NSGA-II","237128516":"An interactive genetic algorithm with co-evolution of weights for multiobjective problems","257035316":"New cluster mapping tools for the graphical assessment of non-dominated solutions in multi-objective optimization","226587885":"Structure optimization of neural network for dynamic system modeling using multi-objective genetic algorithm","221953622":"A Modified Distance Method for Multicriteria Optimization, Using Genetic Algorithms","222206034":"GA-based decision support systems for precast production planning. Automation in Construction","2850630":"Genetic Algorithms and Their Applications to the Design of Neural Networks","220340300":"On Natural Based Optimization","221205087":"Incorporating Distance Domination in Multiobjective Evolutionary Algorithm.","226498801":"Constraint Handling in Genetic Algorithms: The Set Partitioning Problem","224673302":"Issues of Binary Representation in Evolutionary Algorithms","2420562":"General Cardinality Genetic Algorithms","282269604":"Methodology proposal for multicriteria optimization using NSGA-II in industrial applications","49400710":"Applying multi-criteria optimisation to develop cognitive models","2839889":"Finding Acceptable Pareto-Optimal Solutions using Multiobjective Genetic Algorithms","228916446":"A new multi-objective evolutionary algorithm: Neighbourhood exploring evolution strategy","230600900":"NSGA-II with local search for a multi-objective reactive power compensation problem","2238814":"Evolving a Sort: Lessons in Genetic Programming","46491456":"Interactive evolutionary multi-objective optimization for quasi-concave preference functions","272135600":"Evolving Non-Dominated Parameter Sets for Computational Models from Multiple Experiments","222481610":"Adaptive navigation of autonomous vehicles using evolutionary algorithms","223711452":"Genetic algorithms for optimal feedback control design","220392109":"Predictive and comprehensible rule discovery using a multi-objective genetic algorithm","2363819":"Genetic Algorithms Applied To Real Time Multiobjective Optimization Problems","220217519":"Multi-objective α-reliable path finding in stochastic networks with correlated link costs: A simulation-based multi-objective genetic algorithm approach (SMOGA)","46589271":"Modelos de recuperación de la información basados en información lingüística difusa y algoritmos evolutivos. Mejorando la representación de las necesidades de información","220218044":"Precast production scheduling using multi-objective genetic algorithms","3810215":"Multiplicity in genetic algorithms to face multicriteria optimization","220718776":"The 2003 Learning Classifier Systems Bibliography","239059359":"Finding Acceptable Solutions in the Pareto-Optimal Range using Multiobjective Genetic Algorithms","2296194":"Generality and Difficulty in Genetic Programming: Evolving a Sort","228385854":"NSGA-II with Local Search for a Multi-Objective VAR Planning Problem","228763649":"Multi-Objective Optimization of HEV Fuel Economy and Emissions using Evolutionary Computation","227260973":"Cooperative Coevolution of Neural Networks and Ensembles of Neural Networks","5970931":"A tuning algorithm for model predictive controllers based on genetic algorithms and fuzzy decision making","249793354":"C5.6 Other constraint-handling methods","221336216":"Hybridization of Independent Component Analysis, Rough Sets, and Multi-Objective Evolutionary Algorithms for Classificatory Decomposition of Cortical Evoked Potentials","227156515":"Interactive Multiple Objective Programming Methods","261233215":"Multi-objective cultural algorithms","225347776":"A Real-World Test Problem for EMO Algorithms","220384397":"Multi-objective genetic local search algorithm using Kohonen\u0027s neural map","2688390":"An Analysis of Multiobjective Optimization within Genetic Algorithms","36146583":"Traffic engineering in MPLS networks with multiple objectives : modeling and optimization /","243243470":"Using genetic search to exploit the emergent behavior of neural networks","2609045":"An Investigation of GA Performance Results for Different Cardinality Alphabets","234797642":"”A study of Automatic Rule Generation and Adaption”","288857216":"Multi-objective optimization for supply chain management problem: A literature review","250522967":"TOWARDS THE SYNTHESIS OF NEURAL AND EVOLUTIONARY LEARNING","226147009":"Fitting Hydrological Models on Multiple Responses Using the Multiobjective Evolutionary Annealing-Simplex Approach","229707789":"Pareto simulated annealing- A metaheuristic technique for multiple-objective combinatorial optimization","224472286":"Lift Maximization with Uncertainties for the Optimization of High Lift Devices using Multi-Criterion Evolutionary Algorithms","29626886":"How effective and efficient are multiobjective evolutionary algorithms at hydrologic model calibration? Hydrol Earth Syst Sci","220636389":"Hybrid approach for Pareto front expansion in heuristics","229901943":"Adaptive knowledge representation: A content sensitive recombination mechanism for genetic algorithms","234054199":"A non-dominated sorting hybrid algorithm for multi-objective optimization of engineering problems","2460640":"Financial Forecasting Using Genetic Algorithms","2637806":"Applying Genetic Algorithms To Extract Workload Classes","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","228706417":"A Multi-Objective Evolutionary Algorithm for Portfolio Optimisation","220856563":"Multi-objective Optimization Using Co-evolutionary Multi-agent System with Host-Parasite Mechanism.","222824085":"Evolutionary computation and structural design: A survey of the state-of-the-art","250028807":"Multi-Objective Optimization: Hybridization of an Evolutionary Algorithm with Artificial Neural Networks for fast Convergence","2426821":"A Genetic Algorithm for the Set Partitioning Problem","282302258":"An Improved Multi-objective Evolutionary Algorithm for Multi-Objective 0/1 Knapsack Problem","264966184":"Transactions on Computational Science XXI. Special issue on innovations in nature-inspired computing and applications","220618944":"Why DGAs work well on GA-hard functions?","220718784":"A Bigger Learning Classifier Systems Bibliography.","282878772":"A Multi-objective Mixed-discrete Particle Swarm Optimization Algorithm with Multi-domain Diversity Preservation","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","3056066":"Genetic algorithm design of Pareto optimal broadband microwave absorbers","228610125":"A Distance Function-Based Multi-Objective Evolutionary Algorithm","222221523":"The use of domain decomposition genetic algorithms exploiting model reduction for the design of frequency selective surfaces","227179111":"Multi-Objective Optimization Using Evolutionary Algorithms","235744739":"Hybrid Pareto archived dynamically dimensioned search for multi-objective combinatorial optimization: Application to water distribution network design","220856517":"Hierarchical Approach to Evolutionary Multi-Objective Optimization.","4074954":"Hybridization of the multi-objective evolutionary algorithms and the gradient-based algorithms","237233109":"MOMBES Multiobjective Modelbased Evolution Strategy","221008091":"Modified SBX and adaptive mutation for real world single objective optimization","11042143":"Multi-objective cooperative coevolution of artificial neural networks (multi-objective cooperative networks)","221787332":"Agent-Based Co-Evolutionary Techniques for Solving Multi-Objective Optimization Problems","226819707":"“Genetic Algorithms: Foundations and Applications,”"},"index":651}