{"abs":"Uncertainties from model parameters and model discrepancy from small-scale models impact the accuracy and reliability of predictions of large-scale systems. Inadequate representation of these uncertainties may result in inaccurate and overconfident predictions during scale-up to larger models. Hence multiscale modeling efforts must quantify the effect of the propagation of uncertainties during upscaling. Using a Bayesian approach, we calibrate a small-scale solid sorbent model to Thermogravimetric (TGA) data on a functional profile using chemistry-based priors. Crucial to this effort is the representation of model discrepancy, which uses a Bayesian Smoothing Splines (BSS-ANOVA) framework. We use an intrusive uncertainty quantification (UQ) approach by including the discrepancy function within the chemical rate expressions; resulting in a set of stochastic differential equations. Such an approach allows for easily propagating uncertainty by propagating the joint model parameter and discrepancy posterior into the larger-scale system of rate expressions. The broad UQ framework presented here may have far-reaching impact into virtually all areas of science where multiscale modeling is used.","title":"Upscaling Uncertainty with Dynamic Discrepancy for a Multi-scale Carbon Capture System","id":268155576,"url":"https://www.researchgate.net/publication/268155576_Upscaling_Uncertainty_with_Dynamic_Discrepancy_for_a_Multi-scale_Carbon_Capture_System","names":["K. Sham Bhat","David Mebane","Curtis B. Storlie","Priyadarshi Mahapatra"],"references":{"222517874":"Implementation and evaluation of nonparametric regression procedures for sensitivity analysis of computationally demanding models","26856507":"Variable Selection in Bayesian Smoothing Spline ANOVA Models: Application to Deterministic Computer Codes","227704298":"Model diagnostics for smoothing spline ANOVA models. Can J Stat 32:347-358","239667584":"A Framework for Validation of Computer Models","235648898":"Bayesian calibration of thermodynamic models for the uptake of CO2 in supported amine sorbents using ab initio priors","4742946":"Computer Model Calibration Using High-Dimensional Output","255812837":"A One-Dimensional (1-D) Three-Region Model for a Bubbling Fluidized-Bed Adsorber","269012883":"Reproducing Kernel Hilbert Space in Probability and Statistics","254212187":"Liu, F., M. J. Bayarri, and J. O. Berger. Modularization in Bayesian analysis, with emphasis on analysis of computer models. Bayesian Analysis","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction"},"citedIn":{},"index":653}