{"abs":"We discuss the use of turbo codes in fingerprinting schemes. More precisely, we present a family of turbo codes that are secure against attacking coalitions of size 2. This family is build upon a class of low-rate convolutional codes with maximum free distance. Low rate convolutional codes are commonly used in code-spread CDMA applications. Moreover, we show how efficient traitor tracing can be performed by means of the turbo decoding algorithm.","title":"Use of turbo codes with low-rate convolutional constituent codes in fingerprinting scenarios","id":241630817,"url":"https://www.researchgate.net/publication/241630817_Use_of_turbo_codes_with_low-rate_convolutional_constituent_codes_in_fingerprinting_scenarios","names":["Joan Tomàs-Buliart","Ana Gomez-Muro","Marcel Fernandez","Miguel Soriano"],"references":{"3455248":"Joint Coding and Embedding Techniques for Multimedia Fingerprinting","3604275":"“Near Shannon Limit Error-Correcting Coding and Decoding: Turbo Codes,”","221174888":"A Digital Fingerprint Coding Based on Turbo Codes","220722240":"An Improvement of Short 2-Secure Fingerprint Codes Strongly Avoiding False-Positive","3159063":"Near Optimum Error Correcting Coding and Decoding: Turbocodes","221632031":"New Considerations about the Correct Design of Turbo Fingerprinting Codes","224671439":"Decoding “Turbo”-Codes with the Soft Output Viterbi Algorithm (SOVA)","226205719":"Improvement of Collusion Secure Convolutional Fingerprinting Information Codes","220905508":"Fingerprinting Concatenated Codes with Efficient Identification","221609371":"Collusion secure convolutional fingerprinting information codes","2864441":"Optimal Probabilistic Fingerprint Codes","223360354":"Joint coding and embedding techniques for multimedia images","221630247":"Simple Collusion-Secure Fingerprinting Schemes for Images.","220779228":"Lower Bounds for Collusion-Secure Fingerprinting","3160068":"Code-spread CDMA using maximum free distance low-rate convolutional codes","224174409":"A Family of Asymptotically Good Binary Fingerprinting Codes","224602229":"High-Rate Random-Like Spherical Fingerprinting Codes With Linear Decoding Complexity","3079606":"Collusion-secure fingerprinting for digital data","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","3082386":"Optimal Decoding of Linear Codes for Minimizing Symbol Error Rate"},"citedIn":{},"index":658}