{"abs":"Motivated by the statistical evaluation of complex computer models, we deal with the issue of objective prior specification for the parameters of Gaussian processes. In particular, we derive the Jeffreys-rule, independence Jeffreys and reference priors for this situation, and prove that the resulting posterior distributions are proper under a quite general set of conditions. A proper flat prior strategy, based on maximum likelihood estimates, is also considered, and all priors are then compared on the grounds of the frequentist properties of the ensuing Bayesian procedures. Computational issues are also addressed in the paper, and we illustrate the proposed solutions by means of an example taken from the field of complex computer model validation.","title":"Default priors for Gaussian processes. Ann Stat","id":2120071,"url":"https://www.researchgate.net/publication/2120071_Default_priors_for_Gaussian_processes_Ann_Stat","names":["Rui Paulo","The Annals of Statistics"],"references":{"222547936":"Testing separability of spatial-temporal covariance functions","2426790":"Formal Rules for Selecting Prior Distributions: A Review and Annotated Bibliography","4772045":"Bayesian Calibration of Computer Models","239667584":"A Framework for Validation of Computer Models","2319535":"Objective Bayesian Analysis of Spatially Correlated Data","31303344":"Predicting the Output from a Complex Computer Code When Fast Approximations Are Available","228842668":"Bayesian Data Analysis","243778376":"Bayesian Inference for Variance Components Using Only Error Contrasts","236157539":"The Selection of Prior Distributions by Formal Rules","240110111":"Matrix Algebra From a Statistician’s Perspective","221932969":"Statistics For Spatial Data","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","261662178":"The Multivariate Normal Distribution"},"citedIn":{"222581573":"Bayesian emulation of complex multi-output and dynamic computer models","4742474":"Non-Gaussian Bayesian Geostatistical Modeling","233860851":"Bayesian Spatial Prediction and Sampling Design","245582244":"Bayesian Validation of a Computer Model for Vehicle Crashworthiness","220164368":"Bayesian spatial modeling and interpolation using copulas","259095294":"Objective Bayesian analysis for autoregressive models with nugget effects","225110648":"Why do we need and how should we implement Bayesian Kriging methods. Stoch. Environ","236900105":"Objective Bayesian Analysis of Geometrically Anisotropic Spatial Data","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","268458140":"Calibration of Computer Simulator with Non-Gaussian Prior using Dynamically Bi-orthogonal Field Equations","236900099":"Objective Bayesian Analysis for the Normal Compositional Model","260391448":"Automating Emulator Construction for Geophysical Hazard Maps","276175316":"Probabilistic quantification of hazards: A methodology using small ensembles of physics-based simulations and statistical surrogates","257742582":"Objective Bayesian analysis of SAR models","257199354":"Objective Bayesian analysis for a spatial model with nugget effects","239590120":"UNCERTAINTY ANALYSIS FOR COMPUTER SIMULATIONS THROUGH VALIDATION AND CALIBRATION","257512808":"Objective Bayesian analysis for CAR models","269727906":"Spatial Interpolation of Sulfate Concentration in Groundwater Including Covariates Using Bayesian Hierarchical Models","228660883":"Inferring Climate System Properties Using a Computer Model","266098159":"Uncertainty And Sensitivity Analysis For Long-Running Computer Codes: A Critical Review","265409508":"Parameter estimation for Gaussian process emulators","49672515":"Differential expression of three estrogen receptor subtype mRNAs in gonads and liver from embryos to adults of the medaka, Oryzias latipes","279309842":"Gaussian process hyper-parameter estimation using parallel asymptotically independent Markov sampling","265141493":"Parameter estimation and prediction using Gaussian Processes","4049153":"Analyzing and enhancing direct NDP designs using a control-theoretic approach","273067384":"Interpretable Priors for Hyperparameters for Gaussian Random Fields","256606091":"Monotone Function Estimation for Computer Experiments","230587643":"Functional Uniform Priors for Nonlinear Modeling","232743832":"A Generalized Polynomial Chaos-Based Method for Efficient Bayesian\nCalibration of Uncertain Computational Models","236620509":"Software Reliability Modeling with Software Metrics Data via Gaussian Processes","239667584":"A Framework for Validation of Computer Models","233747236":"Some Advances in Bayesian Spatial Prediction and Sampling Design","260428879":"Evaluation of image registration spatial accuracy using a Bayesian hierarchical model","279179240":"STATE-AWARE CALIBRATION FOR INFERRING SYSTEMATIC BIAS IN COMPUTER MODELS OF COMPLEX SYSTEMS","261539289":"Objective Bayesian analysis of spatial models with separable correlation functions","265987339":"Development and Implementation of Bayesian Computer Model Emulators","261686605":"A note of the approximation of likelihood function for a spatial model","255645675":"Gaussian random field models for spatial data","239580059":"BAYESIAN FUNCTIONAL DATA ANALYSIS FOR COMPUTER MODEL VALIDATION","251696476":"Fixed-domain asymptotics of the maximum likelihood estimator and the Gaussian process approach for deterministic models","46538904":"Statistical calibration of climate system properties","45235027":"Validating Gaussian Process Models in Computer Experiments","264994606":"Uncertainty in Gaussian Process Interpolation","228780489":"Predicting Vehicle Crashworthiness: Validation of Computer Models for Functional and Hierarchical Data","51914869":"Efficient emulators of computer experiments using compactly supported correlation functions, with application to cosmology","251624591":"9307 POSTER Oncogenic Mutation Dependent Response to Growth Factors in Melanoma Cells","233747228":"Objective Bayesian analysis of spatial data with uncertain nugget and range parameters","255604425":"Bayesian Dynamic Linear Modelling for Complex Computer Models","251717627":"A Comparison of Empirical Bayes and Reference Prior Methods for Spatio-Temporal Data Analysis"},"index":66}