{"abs":"Digital fingerprinting is a framework for marking media files, such as images, music, or movies, with user-specific signatures to deter illegal distribution. Multiple users can collude to produce a forgery that can potentially overcome a fingerprinting system. This paper proposes an equiangular tight frame fingerprint design which is robust to such collusion attacks. We motivate this design by considering digital fingerprinting in terms of compressed sensing. The attack is modeled as linear averaging of multiple marked copies before adding a Gaussian noise vector. The content owner can then determine guilt by exploiting correlation between each user\u0027s fingerprint and the forged copy. The worst-case error probability of this detection scheme is analyzed and bounded. Simulation results demonstrate the average-case performance is similar to the performance of orthogonal and simplex fingerprint designs, while accommodating several times as many users.","title":"Fingerprinting with Equiangular Tight Frames","id":51955885,"url":"https://www.researchgate.net/publication/51955885_Fingerprinting_with_Equiangular_Tight_Frames","names":["Dustin G. Mixon","Christopher J. Quinn","Negar Kiyavash","Matthew Fickus"],"references":{"46588039":"Steiner equiangular tight frames","238346806":"Robust fingerprinting codes: A near optimal construction","220235940":"A Digital Fingerprinting Code Based on a Projective Plane and Its Identifiability of All Malicious Users","261207959":"Frameproof codes and compressive sensing","220784815":"Collusion-Resistant Fingerprinting Scheme Based on the CDMA-Technique","224312468":"Collusion-aware traitor tracing in multimedia fingerprinting using sparse signal approximation","220694637":"Elements of Algebraic Topology","2985571":"Multimedia watermarking techniques","220695656":"A Course in Combinatorics","7771303":"Anti-collusion forensics of multimedia fingerprinting using orthogonal modulation","2864441":"Optimal Probabilistic Fingerprint Codes","3318566":"Anti-Collusion Fingerprinting for Multimedia","224176456":"A Detection Theoretic Approach to Digital Fingerprinting With Focused Receivers Under Uniform Linear Averaging Gaussian Attacks","2118196":"Stable Signal Recovery from Incomplete and Inaccurate Measurements","224602229":"High-Rate Random-Like Spherical Fingerprinting Codes With Linear Decoding Complexity","225461223":"A Note on the Limits of Collusion-Resistant","3079606":"Collusion-secure fingerprinting for digital data","224150277":"Compressive list-support recovery for colluder identification","255669863":"Sphere packing lower bound on fingerprinting error probability - art. no. 65050K","2550204":"Digital Watermarking","5567414":"Secure spread spectrum watermarking for multimedia","3085640":"Decoding by Linear Programming","253620085":"Capacity and optimal collusion attack channels for Gaussian fingerprinting games - art. no. 65050J","221523608":"A Novel Collusion Attack Strategy for Digital Fingerprinting","224242547":"On Anti-Collusion Codes and Detection Algorithms for Multimedia Fingerprinting","3085343":"On the Capacity Game of Private Fingerprinting Systems Under Collusion Attacks","3082399":"Lower bounds on the maximum cross correlation of signals (Corresp.)","224733012":"Theory of Spread-Spectrum Communications--A Tutorial","2611541":"Resistance of Digital Watermarks to Collusive Attacks","200524228":"Deterministic constructions of compressed sensing matrices","222565757":"Grassmannian frames with applications to coding and communication","4166916":"Collusion-resistant fingerprints from WBE sequence sets","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors"},"citedIn":{"258694090":"The First Determination of the Proton\u0027s Weak Charge Through Parity-Violating Asymmetry Measurements in Elastic e + p and e + Al Scattering","269031373":"A novel collusion attack on finite alphabet digital fingerprinting systems"},"index":660}