{"abs":"We show that equiangular tight frames (ETFs) are particularly well suited as additive fingerprint designs against Gaussian averaging collusion attacks when the number of users is less than the square of the signal dimension. The detector performs a binary hypothesis test in order to decide whether a user of interest is among the colluders. Given a maximum coalition size, we show that the geometric figure of merit of distance between the corresponding \"guilty\" and \"not guilty\" linear forgeries for each user is bounded away from zero. Moreover, we show that for a normalized correlation detector, reliable detection is guaranteed provided that the number of users is less than the square of the signal dimension. Moreover, we show that the coalition has the best chance of evading detection when it uses equal weights.","title":"Equiangular tight frame fingerprinting codes","id":220734380,"url":"https://www.researchgate.net/publication/220734380_Equiangular_tight_frame_fingerprinting_codes","names":["Dustin G. Mixon","Christopher J. Quinn","Negar Kiyavash","Matthew Fickus"],"references":{"3318566":"Anti-Collusion Fingerprinting for Multimedia","2118196":"Stable Signal Recovery from Incomplete and Inaccurate Measurements","3085640":"Decoding by Linear Programming","225348345":"Regular Simplex Fingerprints and Their Optimality Properties","3079606":"Collusion-secure fingerprinting for digital data","222565757":"Grassmannian frames with applications to coding and communication","224312468":"Collusion-aware traitor tracing in multimedia fingerprinting using sparse signal approximation","4166916":"Collusion-resistant fingerprints from WBE sequence sets","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","224513791":"A Simple Proof of the Restricted Isometry Property for Random Matrices"},"citedIn":{"51945994":"Full Spark Frames","261080285":"Frame Coherence and Sparse Signal Processing","224848933":"Sparse Signal Processing with Frame Theory","235221409":"Quasi-Equiangular Frame (QEF) : A New Flexible Configuration of Frame","50235594":"Two are better than one: Fundamental parameters of frame coherence"},"index":661}