{"abs":"The fastest known algorithm for calculating the hypervolume of a set of solutions to a multi-objective optimization problem is the HSO algorithm (hypervolume by slicing objectives). However, the performance of HSO for a given front varies a lot depending on the order in which it processes the objectives in that front. We present and evaluate two alternative heuristics that each attempt to identify a good order for processing the objectives of a given front. We show that both heuristics make a substantial difference to the performance of HSO for randomly-generated and benchmark data in 5-9 objectives, and that they both enable HSO to reliably avoid the worst-case performance for those fronts. The enhanced HSO enable the use of hypervolume with larger populations in more objectives.","title":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","id":4201672,"url":"https://www.researchgate.net/publication/4201672_Heuristics_for_optimizing_the_calculation_of_hypervolume_for_multi-objective_optimization_problems","names":["L. While","L. Bradstreet","L. Barone","Philip Hingston"],"references":{"216301189":"A Critical Survey of Performance Indices for Multi-Objective Optimisation","3949503":"Scalable multi-objective optimization test problems","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","246816017":"Metrics for Quality Assessment of a Multiobjective Design Optimization Solution Set","216457263":"Lecture Notes in Computer Science","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","221228450":"A New Analysis of the LebMeasure Algorithm for Calculating Hypervolume","216300394":"Handbook of Evolutionary Computation","2485866":"Multiobjective Genetic Algorithm Applied To Benchmark Problems - An Analysis","2241938":"M-PAES: A Memetic Algorithm for Multiobjective Optimization","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","3865129":"Unified model for multi-objective evolutionary algorithms with elitism","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","3418862":"A faster algorithm for calculating hypervolume","216301279":"On the Evolutionary Optimisation of Many Objectives","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"221006380":"Generalization of HSO algorithm for computing hypervolume for multiobjective optimization problems","235976338":"Multi-Objective Evolutionary Algorithm with Node-Depth Encoding and Strength Pareto for Service Restoration in Large-Scale Distribution Systems","222540032":"Lecture Notes in Computer Science","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","226145598":"Faster Hypervolume-Based Search Using Monte Carlo Sampling","24399858":"Objective Reduction in Evolutionary Multiobjective Optimization: Theory and Applications","216457248":"The maximum hypervolume set yields near-optimal approximation","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","47843222":"Don\u0027t be greedy when calculating hypervolume contributions","261311517":"Evolving constrained mean-VaR efficient frontiers","229329189":"Quick HyperVolume","1885715":"Novel Algorithm to Calculate Hypervolume Indicator of Pareto Approximation Set","261307906":"Applying the WFG algorithm to calculate incremental hypervolumes","268075048":"Multiobjective evolutionary algorithm with a discrete differential mutation operator developed for service restoration in distribution systems","221008825":"Improving hypervolume-based multiobjective evolutionary algorithms by using objective reduction methods","226254437":"On Handling a Large Number of Objectives A Posteriori and During Optimization","3418862":"A faster algorithm for calculating hypervolume","220381049":"A Fast Way of Calculating Exact Hypervolumes","237631926":"Chapter I An Introduction to Multi-Objective Optimization","263074225":"Speed Up Reliability Model Optimization With Hypervolume Contribution Calculating Algorithm","224594625":"Correction to “A Fast Incremental Hypervolume Algorithm” [Dec 08 714-723]","224309500":"A Fast Incremental Hypervolume Algorithm","224645825":"An Improved Dimension-Sweep Algorithm for the Hypervolume Indicator","227702263":"Evolutionary multiobjective optimization","224645892":"Maximising Hypervolume for Selection in Multi-objective Evolutionary Algorithms","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","46119384":"Stratégies de calcul pour l\u0027optimisation multiobjectif des structures composites","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","224579855":"On the Complexity of Computing the Hypervolume Indicator","237391958":"Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods","284004639":"Lecture Notes in Computer Science","256456253":"A Novel Slicing Based Algorithm to Calculate Hypervolume for Multi-Objective Optimization Problems","221025114":"Lecture Notes in Computer Science","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","220349787":"Multi-Objective Evolutionary Algorithms and Pattern Search Methods for Circuit Design Problems.","224177959":"A fast many-objective hypervolume algorithm using iterated incremental calculations","224301859":"Incrementally maximising hypervolume for selection in multi-objective evolutionary algorithms","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice"},"index":667}