{"abs":"We construct a deterministic fully polynomial time approximation scheme (FPTAS) for computing the total number of matchings in a bounded degree graph. Additionally, for an arbitrary graph, we construct a deterministic algorithm for computing approximately the number of matchings within running time exp(O( √ n log2 n)), where n is the number of vertices. Our approach is based on the correlation decay technique originating in statistical physics. Pre- viously this approach was successfully used for approximately counting the number of independent sets and colorings in some classes of graphs (BG06),(Wei06),(GK07).","title":"Simple deterministic approximation algorithms for counting matchings","id":221590699,"url":"https://www.researchgate.net/publication/221590699_Simple_deterministic_approximation_algorithms_for_counting_matchings","names":["Mohsen Bayati","David Gamarnik","Dimitriy A. Katz","Chandra Nair","Prasad Tetali"],"references":{"234054517":"Loopy Belief Propogation and Gibbs Measures","2553707":"Graph Colorings and Related Symmetric Functions: Ideas and Applications","2335085":"On the Absence of Phase Transition in the Monomer-Dimer Model","3832181":"Improved bounds for sampling colorings","2134895":"The correlation decay (CD) tree and strong spatial mixing in multi-spin systems","2874175":"A Deterministic Strongly Polynomial Algorithm for Matrix Scaling and Approximate Permanents","229762150":"Matchings and walks in graphs. J","222299737":"The roots of the independence polynomial of a clawfree graph","221591855":"Counting independent sets up to the tree treshold","1854656":"A rigorous proof of the cavity method for counting matchings","243782810":"Prescribing a System of Random Variables by Conditional Distributions","220616837":"Vadhan, S.P.: The complexity of counting in sparse, regular, and planar graphs. SIAM J. Comput. 31(2), 398-427","2123206":"Counting without sampling. New algorithms for enumeration problems using statistical physics","222596386":"On the numbers of independent k-sets in a claw free graph","220690637":"Algorithms for Random Generation and Counting: A Marko Chain Approath","38327972":"Theory of monomer-dimer systems","220430669":"A polynomial-time approximation algorithms for permanent of a matrix with non-negative entries","227516705":"Mixing in time and space for lattice spin systems: A combinatorial view","2835355":"Loopy Belief Propagation and Gibbs Measures","1850799":"Rigorous Inequalities Between Length and Time Scales in Glassy Systems","220441808":"Random Matchings in Regular Graphs","222808307":"The Complexity of Computing the Permanent","3921101":"Glauber Dynamics onTrees and Hyperbolic Graphs","220617375":"Strong Spatial Mixing with Fewer Colors for Lattice Graphs","228057773":"Random Generation of Combinatorial Structures from a Uniform Distribution","2128538":"Correlation decay and deterministic FPTAS for counting colorings of a graph","228339815":"Counting down the tree","2108379":"Glauber Dynamics on Trees and Hyperbolic Graphs"},"citedIn":{"51954970":"A generalization of the Birthday problem and the chromatic polynomial","262302756":"Matchings in Benjamini-Schramm convergent graph sequences","220224168":"On Counting 3-D Matchings of Size","45887669":"Correlation Decay in Random Decision Networks","220780577":"PTAS for Maximum Weight Independent Set Problem with Random Weights in Bounded Degree Graphs.","284234746":"An FPTAS for the Volume Computation of 0-1 Knapsack Polytopes Based on Approximate Convolution","220780582":"Sequential cavity method for computing limits of the log-partition function for lattice models","242388221":"Discrete Optimization Emphasis on problems in large systems (scheduling, load bal- ancing, etc. in the internet) using techniques from probability and statistical physics. Algorithms Design and analysis of iterative algorithms in wireless and computer networks, coding theory. Information Theory Multi-user communication; Applications to queuing theory, load balancing, and minimum energy scheduling; Network","264931397":"Simulation reduction of the Ising model to general matchings","228924848":"Optimization and NP_R-completeness of certain fewnomials","260367249":"Approximate Counting of Matchings in $(3,3)$-Hypergraphs","225146867":"Sequential Cavity Method for Computing Free Energy and Surface Pressure","220778929":"Fully Polynomial Time Approximation Schemes for Stochastic Dynamic Programs","45935525":"Polynomial-Time Approximation Schemes for Knapsack and Related Counting Problems using Branching Programs","263146934":"Weighted enumeration of spanning subgraphs in locally tree‐like graphs","51951491":"Approximate Counting via Correlation Decay in Spin Systems","273787853":"Counting hypergraph matchings up to uniqueness threshold","50401820":"The cavity method for counting spanning subgraphs subject to local\nconstraints","264760921":"TSTAugust2014","259804376":"Approximate Capacities of Two-Dimensional Codes by Spatial Mixing","260250918":"FPTAS for Weighted Fibonacci Gates and Its Applications","51960254":"Correlation Decay up to Uniqueness in Spin Systems","266748239":"Spatial mixing and the connective constant: Optimal bounds","242504283":"Computing and Combinatorics, 13th Annual International Conference, COCOON 2007, Banff, Canada, July 16-19, 2007, Proceedings","24374338":"Optimizing -variate -nomials for small","265687524":"Random Gaussian matrices and Hafnian estimators","1958442":"Tightness of LP via Max-product Belief Propagation","2128538":"Correlation decay and deterministic FPTAS for counting colorings of a graph","238605059":"Average-case complexity of Maximum Weight Independent Set with random weights in bounded degree graphs","258520916":"FPTAS for Counting Monotone CNF","51917988":"The Bethe Permanent of a Non-Negative Matrix","261398185":"Bypassing Correlation Decay for Matchings with an Application to XORSAT","220974868":"A distributed deterministic approximation algorithm for data association","222540032":"Lecture Notes in Computer Science","45860223":"Reducing the Ising model to matchings","221499259":"An FPTAS for #knapsack and related counting problems","230689546":"Sublinear-Time Algorithms for Monomer-Dimer Systems on Bounded Degree Graphs","45887088":"Strong Spatial Mixing for Binary Markov Random Fields","2134895":"The correlation decay (CD) tree and strong spatial mixing in multi-spin systems","222553228":"A deterministic approximation algorithm for computing a permanent of a 0, 1 matrix","256981632":"A simple FPTAS for counting edge covers","229156348":"Approximate Counting via Correlation Decay on Planar Graphs","267195829":"Correlation Decay and Decentralized Optimization in Graphical Models","45875173":"Deterministic counting of graph colourings using sequences of subgraphs","237299020":"Correlation Decay and Deterministic Algorithms for Counting. Lecture Notes","264387503":"Counting Problems in Parameterized Complexity","231183400":"Approximate Evaluation of Marginal Association Probabilities With Belief Propagation","272195286":"Finite Size Corrections to Disordered Systems : mean field results and applications to finite dimensional models","37675852":"Approximately Counting Perfect and General Matchings in Bipartite and General Graphs","228270056":"Bilateral and Community Enforcement in a Networked Market with Simple Strategies","280105153":"Counting matchings in irregular bipartite graphs","23561747":"Strong Spatial Mixing and Approximating Partition Functions of Two-State Spin Systems without Hard Constrains","45934026":"A Deterministic Polynomial-Time Approximation Scheme for Counting Knapsack Solutions","251712761":"Message-passing in stochastic processing networks","225205521":"A Randomized Approximation Algorithm for Parameterized 3-D Matching Counting Problem"},"index":668}