{"abs":"This paper presents a general framework for the construction of Monte-Carlo algorithms for the solution of enumeration problems. As an application of the general framework, a Monte-Carlo method is constructed for estimating the failure probability of a multiterminal planar network whose edges are subject to independent random failures. The method is guaranteed to be effective when the failure probabilities of the edges are sufficiently small.","title":"Monte-Carlo algorithms for the planar multiterminal network reliability problem","id":220172399,"url":"https://www.researchgate.net/publication/220172399_Monte-Carlo_algorithms_for_the_planar_multiterminal_network_reliability_problem","names":["Richard Manning Karp","Michael Luby","Journal of Complexity"],"references":{"224583171":"Efficient Evaluation of System Reliability by Monte Carlo Method","224583345":"Sequential Destruction Method for Monte Carlo Evaluation of System Reliability","4354999":"Monte-Carlo algorithms for enumeration and reliability problems","220618207":"Valiant, L.G.: The complexity of enumeration and reliability problems. SIAM J. Comput. 8, 410-421","50335513":"Probability Theory","34353697":"Monte-Carlo methods for estimating system reliability /","244960231":"A new Monte-Carlo Method for Estimating the Failure Probability of an N-Component System","220617721":"The Complexity of Counting Cuts and of Computing the Probability that a Graph is Connected","253889197":"Polygon-to-chain reductions and extensions for reliability evaluation of undirected networks"},"citedIn":{"256619979":"Average case optimality","2808490":"Polynomial time randomised approximation schemes for the Tutte polynomial of dense graphs","2290342":"The Computational Complexity of (XOR, AND)-Counting Problems","279926696":"Karger, D.R.: A randomized fully polynomial time approximation scheme for the all-terminal network reliability problem. SIAM J. Comput. 29(2), 492-514","265629650":"Combinatorial Aspects of Move-Up Crews for Spreading Processes on Networks","4353487":"Efficient availability evaluation for transport backbone networks","221543739":"From Balls and Bins to Points and Vertices","1960845":"FPRAS for computing a lower bound for weighted matching polynomial of graphs","220464180":"From Balls and Bins to Points and Vertices","229864096":"High-Confidence Estimation of Small s-t Reliabilities in Directed Acyclic Networks","3635360":"An optimal algorithm for Monte Carlo estimation","234796135":"Approximation algorithms for graph problems","3114293":"System Reliability Calculations Based on Incomplete Information","1756806":"Estimation of Small s-t Reliabilities in Acyclic Networks","237730743":"Computational Investigations of All-Terminal Network Reliability via BDDs","227708174":"Monte Carlo and Markov Chain techniques for network reliability and sampling","222470492":"An introduction to randomized algorithms","277292697":"Recursive Path Conditioning Monte Carlo Simulation of Communication . . .","220780598":"Implementing a Fully Polynomial Time Approximation Scheme for All Terminal Network Reliability.","264872937":"Parallel estimation of 2-terminal network reliability by a crude Monte Carlo technique","220429314":"Reliability in Layered Networks With Random Link Failures.","223637491":"Monte-Carlo approximation algorithms for enumeration problems","255582995":"Scalar Field Visualization: Level set topology","239542126":"The Complexity of Counting and Randomised Approximation","251463767":"Chapter 11 Network reliability","251463762":"Chapter 6 Probabilistic networks and network algorithms","273307386":"Balanced and Approximate Zero-Variance Recursive Estimators for the Network Reliability Problem","277338033":"An OpenCL implementation of a forward sampling algorithm for CP-logic","221242773":"Reliability in Layered Networks With Random Link Failures","2512539":"Pairwise Independence and Derandomization","221499021":"Polynomial time randomised approxmiation schemes for the Tutte polynomial of dense graphs","260880947":"Cation Deficiency in (Ba, Sr)Co 1- xO yHexagonal Perovskite Related Oxides: New Members of the An+2 B\u0027 BnO 3 n+3 Homologous Series","3593079":"Polynomial time randomised approximation schemes for the Tuttepolynomial of dense graphs","222540032":"Lecture Notes in Computer Science","221499259":"An FPTAS for #knapsack and related counting problems","257266973":"Optimal Monte Carlo integration with fixed relative precision","3152250":"Quick estimation of rare events in stochastic networks","263258618":"Generalized Loop-Erased Random Walks and Approximate Reachability","222878084":"Efficient traffic loss evaluation for transport backbone networks","220852084":"Monte Carlo Model Checking","220696901":"A Simulation Algorithm for Source Terminal Communication Network Reliability.","228057585":"A Randomized Fully Polynomial Time Approximation Scheme for the All-Terminal Network Reliability Problem","2860877":"Who\u0027s The Weakest Link?","220426315":"Undebuggability and Cognitive Science.","2490830":"Series-Parallel Reductions in Monte Carlo Network Reliability Evaluation","221220295":"On the complexity of enumerating possible dynamics of sparsely connected Boolean network automata with simple update rules","3152089":"A Recursive Variance-Reduction Algorithm For Estimating Communication-Network Reliability","45866320":"Approximating the Statistics of various Properties in Randomly Weighted Graphs","239902752":"Model Counting","225800984":"Computational complexity of impact size estimation for\nspreading processes on networks","228810834":"Introduction to Randomized Algorithms","226880113":"Who’sThe Weakest Link?","220345174":"Polynomial Time Randomized Approximation Schemes for Tutte-Gröthendieck Invariants: The Dense Case.","2893016":"Structural and Computational Properties of Certain Permanents","277723513":"Cross-Layer Network Survivability Under Multiple Cross-Layer Metrics","45934026":"A Deterministic Polynomial-Time Approximation Scheme for Counting Knapsack Solutions","268349059":"Multi-level Revenue Sharing for Viral Marketing"},"index":673}