{"abs":"This paper adopts an information-theoretic framework for the design of collusion-resistant coding/decoding schemes for digital fingerprinting. More specifically, the minimum distance decision rule is used to identify 1 out of t pirates. Achievable rates, under this detection rule, are characterized in two scenarios. First, we consider the averaging attack where a random coding argument is used to show that the rate 1/2 is achievable with t \u003d2 pirates. Our study is then extended to the general case of arbitrary t highlighting the underlying complexity-performance tradeoff. Overall, these results establish the significant performance gains offered by minimum distance decoding compared to other approaches based on orthogonal codes and correlation detectors which can support only a subexponential number of users (i.e., a zero rate). In the second scenario, we characterize the achievable rates, with minimum distance decoding, under any collusion attack that satisfies the marking assumption. For t \u003d2 pirates, we show that the rate 1- H (0.25) ap 0.188 is achievable using an ensemble of random linear codes. For t ges 3, the existence of a nonresolvable collusion attack, with minimum distance decoding, for any nonzero rate is established. Inspired by our theoretical analysis, we then construct coding/decoding schemes for fingerprinting based on the celebrated belief-propagation framework. Using an explicit repeat-accumulate code, we obtain a vanishingly small probability of misidentification at rate 1/3 under averaging attack with t \u003d2. For collusion attacks, which satisfy the marking assumption, we use a more sophisticated accumulate repeat accumulate code to obtain a vanishingly small misidentification probability at rate 1/9 with t \u003d2. These results represent a marked improvement over the best available designs in the literature.","title":"Fingerprinting With Minimum Distance Decoding","id":224379977,"url":"https://www.researchgate.net/publication/224379977_Fingerprinting_With_Minimum_Distance_Decoding","names":["Shih-Chun Lin","Mohammad Shahmohammadi","Hesham El Gamal","IEEE Transactions on Information Forensics and Security"],"references":{"261662232":"Elements of Information Theory","222669638":"Secure frameproof codes, key distribution patterns, group testing algorithms and related structures","3080362":"Combinatorial properties of frameproof and traceability codes","3085477":"Capacity-Achieving Ensembles for the Binary Erasure Channel With Bounded Complexity","1960396":"On the Fingerprinting Capacity Under the Marking Assumption","200524258":"Information Theory and Reliable Communication","26532294":"Group-Oriented Fingerprinting for Multimedia Forensics","3080699":"Finite-length analysis of low-density parity-check codes on the binary erasure channel","3318566":"Anti-Collusion Fingerprinting for Multimedia","3045240":"Universal Single Transition Time Asynchronous State Assignments","3079606":"Collusion-secure fingerprinting for digital data","3086350":"Accumulate–Repeat–Accumulate Codes: Capacity-Achieving Ensembles of Systematic Codes for the Erasure Channel With Bounded Complexity","224754055":"Good ternary 2-traceability codes exist","3080331":"Efficient erasure correcting codes. IEEE Trans Inf Theory","4106843":"Capacity-achieving ensembles for the binary erasure channel with bounded complexity","243768674":"Coding Theorems for \"Turbo-Like\" Codes","3080328":"The Capacity of Low-Density Parity Check Codes under Message-Passing Decoding","224773133":"Elements of Information Theory. Wiley","3084802":"On Decoding of Low-Density Parity-Check Codes Over the Binary Erasure Channel","3080798":"Random codes: Minimum distances and error exponents","224621653":"Low-rate LDPC codes with simple protograph structure","4182152":"Block Error Iterative Decoding Capacity for LDPC Codes","220681180":"Combinatorial properties of frameproof and traceability codes.","4166916":"Collusion-resistant fingerprints from WBE sequence sets","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","3047187":"On Universal Single Transition Time Asynchronous State Assignments","220679321":"On decoding of low-density parity-check codes over the binary erasure channel."},"citedIn":{"224392970":"Tree search for digital fingerprinting","220793583":"On the capacity of fingerprinting codes against unknown size of colluders","224578767":"Two-Level Fingerprinting Codes","260542312":"Fingerprinting With Equiangular Tight Frames"},"index":676}