{"abs":"The Hypervolume Indicator is one of the most widely used quality indicators in Evolutionary Multiobjective Optimization. Its computation is a special case of Klee\u0027s Measure Problem (KMP) where the upper end of all rectangular ranges coincides with a given reference point (assuming minimization, without loss of generality). Although the time complexity of the hypervolume indicator in two and three dimensions is known to be Θ(n log n), improving upon the O(nd/2 log n) complexity of Overmars and Yap\u0027s algorithm for the general KMP in higher dimensions has been a challenge. In this paper, a new dimension-sweep algorithm to compute the hypervolume indicator in four dimensions is proposed, and its complexity is shown to be O(n2).","title":"A fast dimension-sweep algorithm for the hypervolume indicator in four dimensions","id":229431286,"url":"https://www.researchgate.net/publication/229431286_A_fast_dimension-sweep_algorithm_for_the_hypervolume_indicator_in_four_dimensions","names":["Andreia P. Guerreiro","C. M. Fonseca","Michael Emmerich"],"references":{"3498772":"New upper bounds in Klee\u0027s measure problem","285009117":"Semi-online maintenance of geometric optima and measures","222540032":"Lecture Notes in Computer Science","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","28358328":"Lecture Notes in Computer Science","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","241623627":"On Klee\u0027s measure problem for grounded boxes","224579855":"On the Complexity of Computing the Hypervolume Indicator","220939835":"Faster S-Metric Calculation by Considering Dominated Hypervolume as Klee’s Measure Problem","220432338":"On Finding the Maxima of a Set of Vectors.","210205139":"Computing Hypervolume Contributions in Low Dimensions: Asymptotically Optimal Algorithm and Complexity Results","220556402":"A (slightly) faster algorithm for Klee\u0027s measure problem.","223855918":"A (Slightly) Faster Algorithm for Klee\u0027s Measure Problem","264855123":"Klee\u0027s Measure Problem on Fat Boxes in Time O(n (d+2)/3 )","3418862":"A faster algorithm for calculating hypervolume","220381049":"A Fast Way of Calculating Exact Hypervolumes","224177959":"A fast many-objective hypervolume algorithm using iterated incremental calculations","216457304":"Lecture Notes in Computer Science"},"citedIn":{"268630598":"PPSN poster for \"Empirical Performance of the Approximation of the Least Hypervolume Contributor\"","277890934":"Multicriteria Inventory Routing by Cooperative Swarms and Evolutionary Algorithms","268167251":"On Reference Point Free Weighted Hypervolume Indicators based on Desirability Functions and their Probabilistic Interpretation","290109763":"Approximation Model Guided Selection for Evolutionary Multiobjective Optimization","235357289":"Bringing Order to Special Cases of Klee\u0027s Measure Problem","229329189":"Quick HyperVolume","281777178":"A Bayesian Approach to Portfolio Selection in Multicriteria Group Decision Making","265330819":"EVOLVE – A bridge between probability, set oriented numerics, and evolutionary computation III. Selected papers based on the presentations at the international conference, Mexico City, Mexico, August 7–9, 2012","235960483":"Cone-Based Hypervolume Indicators: Construction, Properties, and Efficient Computation","282665709":"A Box Decomposition Algorithm to Compute the Hypervolume Indicator","267511239":"Empirical Performance of the Approximation of the Least Hypervolume Contributor","236173994":"Logarithmic-time Updates in SMS-EMOA and Hypervolume-based Archiving","237009117":"Time Complexity and Zeros of the Hypervolume Indicator Gradient Field"},"index":677}