{"abs":"We study the convergence behavior of (μ+λ)-archiving algorithms. A (μ+λ)-archiving algorithm defines how to choose in each generation μ children from μ parents and λ offspring together. Archiving algorithms have to choose individuals online without knowing future offspring. Previous studies assumed the offspring generation to be best-case. We assume the initial population and the offspring generation to be worst-case and use the competitive ratio to measure how much smaller hypervolumes an archiving algorithm finds due to not knowing the future in advance. We prove that all archiving algorithms which increase the hypervolume in each step (if they can) are only μ-competitive. We also present a new archiving algorithm which is (4+2/μ)-competitive. This algorithm not only achieves a constant competitive ratio, but is also efficiently computable. Both properties provably do not hold for the commonly used greedy archiving algorithms, for example those used in SIBEA, SMS-EMOA, or the generational MO-CMA-ES.","title":"Convergence of Hypervolume-Based Archiving Algorithms II: Competitiveness","id":241770161,"url":"https://www.researchgate.net/publication/241770161_Convergence_of_Hypervolume-Based_Archiving_Algorithms_II_Competitiveness","names":["Karl Bringmann","Tobias Friedrich"],"references":{"222540032":"Lecture Notes in Computer Science","221228538":"On Sequential Online Archiving of Objective Vectors","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","262405508":"On Set-Based Multiobjective Optimization","224645892":"Maximising Hypervolume for Selection in Multi-objective Evolutionary Algorithms","220689517":"Online Computation and Competitive Analyses","262357118":"Bounding the Effectiveness of Hypervolume-Based (μ + λ)-Archiving Algorithms","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","220741223":"Convergence of Hypervolume-Based Archiving Algorithms"},"citedIn":{"261460815":"A new selection mechanism based on hypervolume and its locality property","261054005":"MOMBI: A new metaheuristic for many-objective optimization based on the R2 indicator","220741223":"Convergence of Hypervolume-Based Archiving Algorithms"},"index":678}