{"abs":"Multi-objective optimization problems arise frequently in applications, but can often only be solved approximately by heuristic approaches. Evolutionary algorithms have been widely used to tackle multi-objective problems. These algorithms use different measures to ensure diversity in the objective space but are not guided by a formal notion of approximation. We present a framework for evolutionary multi-objective optimization that allows to work with a formal notion of approximation. This approximation-guided evolutionary algorithm (AGE) has a worst-case runtime linear in the number of objectives and works with an archive that is an approximation of the non-dominated objective vectors seen during the run of the algorithm. Our experimental results show that AGE finds competitive or better solutions not only regarding the achieved approximation, but also regarding the total hypervolume. For all considered test problems, even for many (i.e., more than ten) dimensions, AGE discovers a good approximation of the Pareto front. This is not the case for established algorithms such as NSGA-II, SPEA2, and SMS-EMOA. In this paper we compare AGE with two additional algorithms that use very fast hypervolume-approximations to guide their search. This significantly speeds up the runtime of the hypervolume-based algorithms, which now allows a comparison of the underlying selection schemes.","title":"Efficient optimization of many objectives by approximation-guided evolution","id":272846394,"url":"https://www.researchgate.net/publication/272846394_Efficient_optimization_of_many_objectives_by_approximation-guided_evolution","names":["Markus Wagner","Karl Bringmann","Tobias Friedrich","Frank Neumann","European Journal of Operational Research"],"references":{"216300582":"Multicriteria Optimization","222540032":"Lecture Notes in Computer Science","5303061":"Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection","216457248":"The maximum hypervolume set yields near-optimal approximation","220152023":"Efficiently computing succinct trade-off curves","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","2333106":"Simulated Binary Crossover for Continuous Search Space","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","259084900":"Speeding up many-objective optimization by Monte Carlo approximations","257142405":"How good is the Chord algorithm?","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","261054099":"Efficient parent selection for Approximation-Guided Evolutionary multi-objective optimization","280020908":"Shark","245587132":"Bicriterion Single Machine Scheduling with Resource Dependent Processing Times","226752738":"A Scalable Multi-objective Test Problem Toolkit","220617796":"Small Approximate Pareto Sets for Biobjective Shortest Paths and Other Problems","3880857":"On the approximability of trade-offs and optimal access of Web sources","266653824":"A fast approximation-guided evolutionary multi-objective algorithm","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","220812487":"Approximation-Guided Evolutionary Multi-Objective Optimization.","216457303":"Indicator-Based Selection in Multiobjective Search","224177966":"The jMetal framework for multi-objective optimization: Design and architecture","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","221559427":"Multiobjective Query Optimization.","220701597":"Tight Bounds for the Approximation Ratio of the Hypervolume Indicator","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice"},"citedIn":{"269040767":"Seeding the Initial Population of Multi-Objective Evolutionary Algorithms: A Computational Study","282410136":"Evolutionary many-objective optimization: A quick-start guide"},"index":683}