{"abs":"Over the past few years, the research on evolutionary algorithms has demonstrated their niche in solving multi-objective optimization problems, where the goal is to find a number of Pareto-optimal solutions in a single simulation run. Many studies have depicted di#erent ways evolutionary algorithms can progress towards the true Paretooptimal solutions with a widely spread distribution of solutions. However, none of the multi-objective evolutionary algorithms (MOEAs) has a proof of convergence to the true Pareto-optimal solutions with a wide diversity among the solutions. In this paper, we discuss why a number of earlier MOEAs do not have such properties and then suggest a class of archive-based MOEAs which can have both properties of converging to the true Pareto-optimal front and maintain a spread among obtained solutions. A number of modifications to the baseline algorithm are also suggested. The concept of #-dominance introduced in this paper is practical and should make the proposed algorithms useful to researchers and practitioners alike. Keywords: Convergence, multi-objective optimization, preservation of diversity, evolutionary algorithms 1","title":"On the Convergence and Diversity-Preservation Properties of Multi-Objective Evolutionary Algorithms","id":2367509,"url":"https://www.researchgate.net/publication/2367509_On_the_Convergence_and_Diversity-Preservation_Properties_of_Multi-Objective_Evolutionary_Algorithms","names":["Marco Laumanns","Lothar Thiele","Kalyanmoy Deb","Eckart Zitzler"],"references":{"221220222":"Approximating Multi-objective Knapsack Problems","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","2454246":"Evolutionary Search under Partially Ordered Fitness Sets","239023800":"Multi-Objective function optimization using non-dominated sorting genetic algorithms, Evolutionary Computation, 2(3):221-248","3865293":"Convergence Properties of Some Multi-Objective Evolutionary Algorithms","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","236443691":"Some Experiments in Machine Learning Using Vector Evaluated Genetic Algorithms","2581803":"Approximating the non-dominated front using the Pareto Archived Evolution Strategy","5583931":"Convergence analysis of canonical genetic algorithm. IEEE Trans Neural Netw","216457304":"Lecture Notes in Computer Science","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"3949564":"Selecting informative genes using a multiobjective evolutionaryalgorithm","4249728":"The Extended Concept-based Multi-objective Path Planning and its A-life implications","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","277298436":"Multi-Objective Particle Swarm Optimisation Methods.","228788582":"A NEW EVOLUTIONARY ALGORITHM FOR MULTIOBJECTIVE OPTIMIZATION BASED ON ENDOCRINE PARADIGM","30010561":"Set oriented methods for global optimization","220080151":"Robotic path planning using evolutionary momentum-based exploration","2377646":"Evolutionary Algorithms for Multiobjective Optimization","24373629":"Evaluation of Genetic Algorithm Concepts Using Model Problems","232628371":"A Performance Analysis of Mono and Multi-objective Evolutionary Algorithms Assisted by Meta-modeling","220654825":"Hybrid genetic algorithm for dual selection","265289924":"Low Complexity PSO-Based Multi-objective Algorithm for Delay-Constraint Applications","278716234":"Many-Objective Evolutionary Optimisation and Visual Analytics for Product Family Design","250735657":"How to Maintain at Most N Well-Distributed, Non-dominated Solutions to a Pareto Optimization Problem","35718843":"Uncertainty based multi-objective optimization of groundwater remediation design /","224133895":"A Multi-Objective Endocrine PSO Algorithm","2865846":"Hybrid Methods for Multi-Objective Evolutionary Algorithms","224472316":"Evolutionary Search of Optimal Concepts Using a Relaxed-Pareto-optimality Approach","221008371":"The sequential optimization-constraint multi-objective problem and its applications for robust planning of robot paths","245310848":"Hybridizing evolutionary strategies with continuation methods for solving multi-objective problems","220200128":"A multi-objective endocrine PSO algorithm and application","225199245":"Evolutionary multi-objective optimization: Some current research trends and topics that remain to be explored","44260546":"Self-Adaptive Mechanism for Multi-objective Evolutionary Algorithms","251407953":"Bounded Pareto Archiving: Theory and Practice","226934059":"Why Is Optimization Difficult?","241039923":"Parallel and Hierarchical Evolutionary Algorithms","266982214":"On the Performance of Local Search for the Biobjective Traveling Salesman Problem","267698331":"A Trade Space Model for Robotic Lunar Exploration","2534934":"Hybrid Multi-Objective Evolutionary Computation of Constrained Downside Risk-Return Efficient Sets for Credit Portfolios","4269041":"Diversity Metrics in Multi-objective Optimization: Review and Perspective","251156554":"Diversity-Driven Self-adaptation in Evolutionary Algorithms","29973498":"Méthodologie de conception système à base de plateformes reconfigurables et programmables","220381014":"Using unconstrained elite archives for multiobjective optimization","220696018":"Towards Hybrid and Adaptive Computing - A Perspective","245439959":"Genetic Algorithms Applied to Multi-Objective Aerospace Shape Optimization","220743199":"An Evolutionary Technique for Multicriterial Optimization Based on Endocrine Paradigm","228967261":"Quality assessment of multiobjective optimisation algorithms in component deployment","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","46888688":"Advances in Multi-Objective Nature Inspired Computing","4074752":"Bounded archiving using the Lebesgue measure"},"index":684}