{"abs":"d-Erik Skouby and the people at the Center of Tele-Information for providing shelter in a pleasant atmosphere during most of the course of the Ph.D. and to Vagn Lauersen and his colleagues at the Ministry of Education for the opportunity to work on interesting practical problems. For my year of studies in Portugal, thanks go to Professor Jos Soeiro Ferreira and his group of pleasant people at Instituto de Engenharia de Sistemas e Computadores, Porto, Portugal. Also thanks to Maria Teresa Ponce de Leo, ngela Pereira and Ana Viana. I would like also to thank Professor Fred Glover, Professor Jacques Teghem, Professor Ralph Steuer and Professor Jrgen Tind for their help and useful comments and for being an inspiration to me by their own work. Also thanks to my two most important scientific friends and colleagues, Pedro Borges and Andrzej Jaszkiewicz. Finally, to my family and to my friends for their support and for just being the way they are. iv Metaheuristics for multiple objective c","title":"Metaheuristics for Multiple Objective Combinatorial Optimization","id":2817543,"url":"https://www.researchgate.net/publication/2817543_Metaheuristics_for_Multiple_Objective_Combinatorial_Optimization","names":["Michael Pilegaard Hansen"],"references":{"243093181":"Optimization of Globally Convex Functions","220472422":"On bicriterion minimal spanning trees: An approximation","243633287":"The steepest ascent mildest descent heuristic for combinatorial programming","220668897":"Tabu Thresholding: Improved Search by Nonmonotonic Trajectories","222472778":"General Local Search Methods","242515197":"A new adaptive multi-start technique for combinatorial global optimizations. Operations Research Letters, 16, 101-113","245280407":"Exploring a Multicriteria Approach to Production Scheduling","222072246":"The multi objective equilibrium network design problem revisited: a Simulated Annealing approach","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","242931956":"OR Practice--A Survey of Practical Applications of Examination Timetabling Algorithms","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","225237245":"Greedy Randomized Adaptive Search Procedures","237131761":"Lecture Notes in Economics and Mathematical Systems","266308299":"A multiobjective metaheuristic approach to the location of petrol stations by the capital budgeting model","226549911":"Scatter Search and Star-Paths: Beyond the Genetic Metaphor,” OR Spektrum, 17: 125-137","222469785":"Scheuer, T.: Threshold accepting: A general purpose optimization algorithm appearing superior to simulated annealing. IBM Technical report 88.10.011, J. Comput. Phys. 90, 161-175","2726198":"Nationwide Scheduling of Examinations: Lessons From Experience","222474461":"Variable Neighborhood Search","220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","247251996":"Principles of Multiobjective Optimization","223039530":"Multiobjective Design of Transportation Networks: Taxonomy and Annotation","223867892":"A multiple criteria model for new telecommunication service planning","45533394":"Iterative deepening multiobjective A*","220693571":"Tabu search I","245102847":"A tabu search procedure to solve multiobjective combinatorial optimization problems","223040878":"A Probabilistic Heuristic for a Computationally Difficult Set Coving Problem","227444843":"Bicriteria Transportation Problem","223354808":"A comparison of neighborhood search techniques for multi-objective combinatorial problems","243518696":"Neural computation of decisions in optimisation problems","243762793":"Multiobjective Programming and Planning","222780136":"Multiple and bicriteria scheduling: A literature survey","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","3411845":"Multi-Objective Optimization and Multiple Constraint Handling with Evolutionary Algorithms – Part II: A Unified Formulation","239329143":"A Multicriteria Tabu Search Approach to Cell Formation Problems in Group Technology with Multiple Ob","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","245512922":"Electric Distribution Systems Planning with Fuzzy Loads","234898362":"Tabu search part II","222721339":"Future Paths for Integer Programming and Links to Artificial Intelligence.” Computers \u0026 Operations Research 13, 533-549","2799127":"Heuristics From Nature For Hard Combinatorial Optimization Problems"},"citedIn":{"3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","220867555":"The Office-Space-Allocation Problem in Strongly Hierarchized Organizations","227224385":"Scheduling in Software Development Using Multiobjective Evolutionary Algorithms","226211700":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","4879003":"A multiobjective evolutionary algorithm for scheduling and inspection planning in software development projects","46491409":"Evolutionary, constructive and hybrid procedures for the bi-objective set packing problem","233400380":"Modelling and monitoring in injection molding","227061917":"Evolutionary Algorithms and Multiple Objective Optimization","46888670":"Multi-Objective Combinatorial Optimization: Problematic and Context","221228538":"On Sequential Online Archiving of Objective Vectors","224246859":"A performance comparison of multi-objective optimization evolutionary algorithms for all-optical networks design","257432206":"Multi-objective ant colony optimization based on decomposition for bi-objective traveling salesman problems","4939475":"On operators and search space topology in multi-objective flowshop scheduling. Eur J Oper Res","249970684":"A Multiobjective Memetic Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","227003420":"Multiobjective Combinatorial Optimization — Theory, Methodology, and Applications","222311710":"Multiobjective service restoration in electric distribution networks using a local search based heuristic","266222332":"Multidisciplinary scheduling: theory and applications. 1st international conference, MISTA ’03, Nottingham, UK, 13–15 August 2003. Selected papers","220689987":"Multicriteria Optimization (2. ed.).","277291554":"This document was prepared with L ATEX and printed by Jespersen Offset. Preface","222405031":"Jaszkiewicz, A.: Genetic Local Search for Multi-Objective Combinatorial Optimization. European Journal of Operational Research 137, 50-71","2883659":"Parallelization of the Vehicle Routing Problem with Time Windows","226222236":"Hybrid Metaheuristics for Multi-objective Combinatorial Optimization","222070484":"A dynamic neighborhood based tabu search algorithm for real-world flight instructor scheduling problems","223696253":"Multi-objectives Tabu Search based algorithm for progressive resource allocation","282059174":"A survey and annotated bibliography of multiobjective combinatorial optimization","2376653":"Stochastic Methods for Multi-Objective Optimization","233400322":"Stochastic Modelling of Energy Systems","24065436":"Approximate solution methods for multiobjective combinatorial optimization","221228636":"1984-2004 – 20 Years of Multiobjective Metaheuristics. But What About the Solution of Combinatorial Problems with Multiple Objectives?","261054005":"MOMBI: A new metaheuristic for many-objective optimization based on the R2 indicator","228821592":"An object-oriented framework for multiobjective local search","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","46888688":"Advances in Multi-Objective Nature Inspired Computing"},"index":689}