{"abs":"This paper first describes optimal design of elastic flywheels using an Injection Island Genetic Algorithm (iiGA). An iiGA in combination with a finite element code is used to search for shape variations to optimize the Specific Energy Density of flywheels (SED is the rotational energy stored per unit mass). iiGA\u0027s seek solutions simultaneously at different levels of refinement of the problem representation (and correspondingly different definitions of the fitness function) in separate subpopulations (islands). Solutions are sought first at low levels of refinement with an axisymmetric plane stress finite element code for high-speed exploration of the coarse design space. Next, individuals are injected into populations with a higher level of resolution that uses an axisymmetric three-dimensional finite element model to \" fine-tune\" the flywheel designs. Solutions found for these various \" coarse\" fitness functions on various nodes are injected into nodes that evaluate the ultimate fitness to be optimized. Allowing subpopulations to explore different regions of the fitness space simultaneously allows relatively robust and efficient exploration in problems for which fitness evaluations are costly. First the paper treats a greatly simplified case – one for which all two million possible solutions were enumerated, yielding a known global optimum. Then the success and speed of many methods, including several variations of an iiGA, in finding this known global optimum are compared. The iiGA methods always found the global optimum, and the other methods never did. Hybridizing the iiGA with a local search operator and a Threshold Accepting (TA) search at the end of each generation provided the fastest solutions, without sacrificing robustness. Finally, a problem with a large design space is presented and results are compared for a hybrid iiGA to a parallel GA that uses a topological \" ring\" structure. The hybrid iiGA greatly outperforms the topological \" ring\" GA in terms of fitness and search efficiency for this given problem.","title":"Evaluation of Injection Island GA Performance on Flywheel Design Optimisation","id":228453399,"url":"https://www.researchgate.net/publication/228453399_Evaluation_of_Injection_Island_GA_Performance_on_Flywheel_Design_Optimisation","names":["David Eby","Ron Averill","William F. Punch","Erik D. Goodman"],"references":{"245304091":"Closure to “Sizing, Shape, and Topology Design Optimization of Trusses Using Genetic Algorithm” by S. D. Rajan","245365912":"Genetic Algorithm-Based Structural Topology Design With Compliance and Topology Simplification Considerations","4695808":"Haftka, R.: Optimization of laminate stacking sequence for buckling load maximization by genetic algorithm. AIAA J 31, 951-956","222967619":"Topological optimization of rotorcraft subfloor structures for crashworthiness considerations","222463817":"A Homogenization method for shape and topology optimization","23860256":"Optimization of laminate stacking sequence for buckling load maximization by genetic algorithm. Personal Communication","2644221":"Design Using Genetic Algorithms - Some Results for Laminated Composite Structures.","226261353":"Use of genetic algorithms for the design of rotors","289659542":"Optimum Layout and Shape of Plate Structures Using Homogenization","2609278":"Dynamic Parameter Encoding for Genetic Algorithms","227135571":"Genetic Algorithms with Local Improvement for Composite Laminate Design","3345005":"Simulated Annealing Algorithms: An Overview","270642947":"Application of Generic Algorithms to Stiffness Optimization of Laminated Composite Plates with Stress Concentrated Open Holes.","243363938":"Passive Vibration Control Via Unusual Geometries: The Application of Genetic Algorithm Optimization to Structural Design","287905613":"Optimization of Frame Topology Using Boundary Cycle and Genetic Algorithm.","226164639":"Placing actuators on space structures by genetic algorithms and effectiveness indices","229333760":"Application of genetic algorithms to identify damage in elastic structures","226093970":"Genetic algorithms and fictitious domain based approaches in shape optimization","256635040":"Optimal design of laminated composite structures using coarse-grain parallel genetic algorithms","220628363":"Using Genetic Algorithms to Design Laminated Composite Structures.","229760256":"Multicriteria optimization of aircraft panels: Determining viable genetic algorithm configurations","238189763":"Three-Dimensional Aerodynamic Shape Optimization Using Genetic and Gradient Search Algorithms","245346283":"An Introduction to GALOPPS-the \"Genetic Algorithm Optimized for Portability and Parallelism\" System","245361641":"Shape Optimization of Cooling Channels Using Genetic Algorithms","223404844":"Genetic algorithms for thermosciences research: application to the optimized cooling of electronic components","228797919":"Parallel genetic algorithms in the optimization of composite structures","223185584":"A genetic algorithm for fin profile optimization","220885525":"Co-operative Evolutionary Strategies for Single Component Design."},"citedIn":{"220741224":"Comparison Of Methods For Using Reduced Models To Speed Up Design Optimization.","226289469":"Multi-Level Decomposition for Tractability in Structural Design Optimization","267669302":"Success in evolutionary computation","225989818":"An Evolutionary Multi-objective Adaptive Meta-modeling Procedure Using Artificial Neural Networks","225951346":"Opportunities for Expensive Optimization with Estimation of Distribution Algorithms","257430110":"Generation of a cokriging metamodel using a multiparametric strategy","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","229363488":"Extracting optimal datasets for metamodelling and perspectives for incremental samplings","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","224570930":"A systems approach to evolutionary multiobjective structural optimization and beyond","255599852":"Control of Nonlinear Systems via Temporal Difference Learning Based Intelligent Controller and Context Reasoning","245310926":"Distributed Evolutionary Algorithms with Hierarchical Evaluation","224572019":"An effective intelligent algorithm for stochastic optimization problem","229659299":"Hierarchical distributed metamodel‐assisted evolutionary algorithms in shape optimization","222662737":"Thermal buckling optimization of composite laminates by evolution strategies","280043557":"A Unified Taxonomy of Hybrid Metaheuristics with Mathematical Programming, Constraint Programming and Machine Learning","264149547":"A Study on Reliability of Kriging Based Approximation Model and Aerodynamic Optimization for Turbofan Engine High Pressure Turbine Nozzle","225513703":"Sequential kriging optimization using multiple-fidelity evaluations","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","225736364":"A framework for memetic optimization using variable global and local surrogate models","257492800":"Combining metaheuristics with mathematical programming, constraint programming and machine learning","228649596":"How effective are multiple populations in genetic programming","221047729":"Using Self Organizing Maps and Genetic Algorithms for Model Selection in Multilevel Optimization","267189810":"A Stochastic Collocation Algorithm with Multifidelity Models","235903469":"Evolutionary Approaches to Expensive Optimisation","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","225648080":"A Model-Assisted Memetic Algorithm for Expensive Optimization Problems","281108962":"Design and Optimization of a Flywheel Based Kinetic Energy Recover System","251163678":"Genetic Fuzzy Modeling of Supervisory Scheduling of Freight Rail Systems","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","251581782":"Flywheel rotor manufacture for rural energy storage in sub-Saharan Africa","216300879":"Aerodynamic Design of Compressor Airfoils using Hierarchical, Distributed, Metamodel-Assisted Evolutionary Algorithms","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","3810187":"Topographical mapping assisted evolutionary search for multilevel optimization","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","232362088":"Successive approximate model based multi-objective optimization for an industrial straight grate iron ore induration process using evolutionary algorithm","4074955":"Computationally effective search and optimization procedure using coarse to fine approximations","221787341":"A Memetic Algorithm Assisted by an Adaptive Topology RBF Network and Variable Local Models for Expensive Optimization Problems","222496628":"A comparison of various optimization algorithms on a multilevel problem","261412387":"Fuzzy Clustering in Fitness Estimation Models for Genetic Algorithms and Applications","220777425":"Evolutionary Optimization with Dynamic Fidelity Computational Models","220702109":"A Hierarchical Genetic Algorithm Using Multiple Models for Optimization","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","2493149":"Efficient Genetic Algorithms using Discretization Scheduling","226738239":"Multilevel Optimization Algorithms Based on Metamodel- and Fitness Inheritance-Assisted Evolutionary Algorithms","263066450":"Evolutionary Surrogate Optimization of an Industrial Sintering Process"},"index":690}