{"abs":"In many problems in science and engineering, it is often the case that there exist a number of computational models to simulate the problem at hand. These models are usually trade-offs between accuracy and computational expense. Given a limited computation budget, there is need to develop a framework for selecting between different models in a sensible fashion during the search. The method proposed here is based on the construction of a heteroassociative mapping to estimate the differences between models, and using this information to guide the search. The proposed framework is tested on the problem of minimizing the transmitted vibration energy in a satellite boom","title":"Topographical mapping assisted evolutionary search for multilevel optimization","id":3810187,"url":"https://www.researchgate.net/publication/3810187_Topographical_mapping_assisted_evolutionary_search_for_multilevel_optimization","names":["Mohammed El-Beltagy","Andy J. Keane"],"references":{"243363938":"Passive Vibration Control Via Unusual Geometries: The Application of Genetic Algorithm Optimization to Structural Design","239744777":"A Case for Multilevel Optimization in Aeronautical Design","226464504":"Design by natural selection","2782754":"Combining Approximation Concepts With Genetic Algorithm-Based Structural Optimization Procedures","228453399":"Evaluation of Injection Island GA Performance on Flywheel Design Optimisation","245888045":"Design Optimization of Space Structures With Nonperiodic Geometries for Vibration Suppression","243364010":"Energy flow predictions in a structure of rigidly joined beams using receptance theory","2380905":"Optimization For Multilevel Problems: A Comparison Of Various Algorithms","30873058":"Genetic + Data Structures \u003d Evolution Programs","2838878":"Adaptive and Self-adaptive Evolutionary Computations","224881745":"GTM: The Generative Topographic Mapping","246447751":"Self-Organising Maps","228797919":"Parallel genetic algorithms in the optimization of composite structures","220885525":"Co-operative Evolutionary Strategies for Single Component Design."},"citedIn":{"2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models"},"index":691}