{"abs":"Currently, an alternative framework using the hypervolume indicator to guide the search for elite solutions of a multi-objective problem is studied in the evolutionary multi-objective optimization community very actively, comparing to the traditional Pareto dominance based approach. In this paper, we present a dynamic neighborhood multi-objective evolutionary algorithm based on hypervolume indicator (DNMOEA/HI), which benefits from both Pareto dominance and hypervolume indicator based frameworks. DNMOEA/HI is featured by the employment of hypervolume indicator as a truncation operator to prune the exceeded population, while a well-designed density estimator (i.e., tree neighborhood density) is combined with the Pareto strength value to perform fitness assignment. Moreover, a novel algorithm is proposed to directly evaluate the hypervolume contribution of a single individual. The performance of DNMOEA/HI is verified on a comprehensive benchmark suite, in comparison with six other multi-objective evolutionary algorithms. Experimental results demonstrate the efficiency of our proposed algorithm. Solutions obtained by DNMOEA/HI well approach the Pareto optimal front and are evenly distributed over the front, simultaneously.","title":"Achieving balance between proximity and diversity in multi-objective evolutionary algorithm","id":220310732,"url":"https://www.researchgate.net/publication/220310732_Achieving_balance_between_proximity_and_diversity_in_multi-objective_evolutionary_algorithm","names":["Ke Li","Sam Kwong","Jingjing Cao","Miqing Li","Jinhua Zheng","Ruimin Shen","Information Sciences"],"references":{"3418802":"Dynamic Multiobjective Optimization Problems: Test Cases, Approximations, and Applications","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","220265511":"Improving NSGA-II Algorithm Based on Minimum Spanning Tree","3419059":"AbYSS: Adapting Scatter Search to Multiobjective Optimization","28358328":"Lecture Notes in Computer Science","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","1885715":"Novel Algorithm to Calculate Hypervolume Indicator of Pareto Approximation Set","2333106":"Simulated Binary Crossover for Continuous Search Space","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2335418":"A Combined Genetic Adaptive Search (GeneAS) for Engineering Design","239062948":"PESA-II: Region-based selection in evolutionary multiobjective optimization","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","223542351":"Qu, B.Y.: Multi-Objective Evolutionary Algorithms on the Summation of Normalized Objectives and Diversified Selection. Information Sciences 180(17), 3170-3181","220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","263025164":"Two-lbests based multi-objective particle swarm optimizer","224309500":"A Fast Incremental Hypervolume Algorithm","224645825":"An Improved Dimension-Sweep Algorithm for the Hypervolume Indicator","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2615425":"Evolutionary Computation and Convergence to a Pareto Front","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","216457303":"Indicator-Based Selection in Multiobjective Search","220741273":"Scaling up indicator-based MOEAs by approximating the least hypervolume contributor: A preliminary study","220313874":"A real-coding jumping gene genetic algorithm (RJGGA) for multiobjective optimization","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","265432807":"Multiobjective optimization Test Instances for the CEC 2009 Special Session and Competition","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","3419017":"A Jumping Gene Paradigm for Evolutionary Multiobjective Optimization","4074752":"Bounded archiving using the Lebesgue measure","222540032":"Lecture Notes in Computer Science","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","220313954":"Multi-objective evolutionary algorithms based on the summation of normalized objectives and diversified selection.","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","4375942":"Uniformity Assessment for Evolutionary Multi-Objective Optimization","4375943":"An Efficient Multi-objective Evolutionary Algorithm Based on Minimum Spanning Tree","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","224319385":"A Competitive-Cooperative Coevolutionary Paradigm for Dynamic Multiobjective Optimization","216457263":"Lecture Notes in Computer Science","47843222":"Don\u0027t be greedy when calculating hypervolume contributions","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","221228415":"Lecture Notes in Computer Science","223454721":"A dominance tree and its application in evolutionary multi-objective optimization","216457268":"Indicator-based evolutionary algorithm with hypervolume approximation by achievement scalarizing functions","220514416":"A practical tutorial on the use of nonprametric statistical tests as a methodology for comparing evolutionary and swarm intelligence algorithm","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","3625443":"Multi-objective genetic algorithms made easy: Selection, sharing and mating restriction","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","3418862":"A faster algorithm for calculating hypervolume","3949543":"Diversity assessment of Pareto optimal solution sets: an entropy approach","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","223925552":"Yang, Y.: Particle swarm optimization with preference order ranking for multi-objective optimization. Information Sciences 179(12), 1944-1959","4074711":"Multiple single objective Pareto sampling","227179111":"Multi-Objective Optimization Using Evolutionary Algorithms","224177966":"The jMetal framework for multi-objective optimization: Design and architecture","228828251":"Improving the Efficiency of ϵ-dominance Based Grids","213878721":"Shortest Connection Networks And Some Generalizations","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"237075617":"A Nondominated Sorting Genetic Algorithm for Bi-objective Network Coding Based Multicast Routing Problems","270960934":"A Multiobjective Evolutionary Algorithm Using Gaussian Process-Based Inverse Modeling","259179376":"Stable Matching Based Selection in Evolutionary Multiobjective Optimization","289825861":"A Reference Vector Guided Evolutionary Algorithm for Many-Objective Optimization","256991061":"Fast Approximate Minimum Spanning Tree Algorithm Based on K-means","280879993":"Decomposing the user-preference in multiobjective optimization","273296140":"An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition","277517826":"Competitive and cooperative particle swarm optimization with information sharing mechanism for global optimization problems","273910879":"A dual-population paradigm for evolutionary multiobjective optimization","256456198":"Multi-objective differential evolution with self-navigation","268163956":"A novel preference articulation operator for the Evolutionary Multi-Objective Optimisation of classifiers in concealed weapons detection","276419625":"An Improved Fireworks Algorithm with Landscape Information for Balancing Exploration and Exploitation","285673109":"Multi-objective optimisation for regression testing","256464412":"Learning Paradigm Based on Jumping Genes: A General Framework for Enhancing Exploration in Evolutionary Multiobjective Optimization","262374265":"A general framework for evolutionary multiobjective optimization via manifold learning","277561680":"Self-adaptive multi-objective teaching-learning-based optimization and its application in ethylene cracking furnace operation optimization","256456340":"Adaptive Operator Selection With Bandits for a Multiobjective Evolutionary Algorithm Based on Decomposition","256721235":"A Coevolutionary Multi-Objective Optimization Algorithm Based on Direction Vectors","256721133":"Multi-level hierarchic genetic-based scheduling of independent jobs in dynamic heterogeneous grid environment","272018967":"A fast minimum spanning tree algorithm based on K-means","266967755":"Interrelationship-Based Selection for Decomposition Multiobjective Optimization","264966184":"Transactions on Computational Science XXI. Special issue on innovations in nature-inspired computing and applications","256721000":"Comparison of design concepts in multi-criteria decision-making using level diagrams","267982364":"An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition","262406210":"Multi-objective portfolio selection model with fuzzy random returns and a compromise approach-based genetic algorithm","277348719":"Game-theoretic differential evolution for multiobjective optimization of green sand mould system","288285447":"Multiobjective optimization of bioethanol production via hydrolysis using hopfield- enhanced differential evolution","257118975":"Normal-boundary intersection based parametric multi-objective optimization of green sand mould system","261043963":"Multiobjective optimization of green sand mould system using DE and GSA","259170631":"Population-based metaheuristics for continuous boundary-constrained dynamic multi-objective optimisation problems","272174351":"A multi-objective improved teaching–learning based optimization algorithm (MO-ITLBO)","288932175":"Adaptive Composite Operator Selection and Parameter Control for Multiobjective Evolutionary Algorithm","271750792":"Time-response-based evolutionary optimization","261054005":"MOMBI: A new metaheuristic for many-objective optimization based on the R2 indicator","261430382":"Issues with performance measures for dynamic multi-objective optimisation"},"index":694}