{"abs":"The problems presented and analyzed in this paper are interesting test- problems for multi-objective optimization. The aim is to flnd the distance to two points in a d-dimensional space. Closed analytical expressions of all pareto-optimal fronts and pareto-optimal sets will be derived in this paper. Moreover, a discussion of the characteristics of the properties of these sets is given. Depending on the formulation of the distance function, difierent structures of the pareto front and pareto optimal set can be obtained. Both are characterized by strong symmetries. Furthermore, the curvature of the pareto fronts can be scaled by means of a continuous parameter, ranging from extremely concave functions to extremely concave functions. Instead of giving a detailed introduction to multi-objective optimization in general, and pareto optimization in particular, we refer the interested reader to the text books by Deb (1) and Zitzler (2). The book by Deb also contains standard benchmarks for bi-criteria optimization. The ZDT test-suite contains problems that are scalable in dimension. In addition, both concave and convex pareto fronts are included in the ZDT benchmark. However, neither the degree of curvature can be scaled for these functions, nor do these function provide an intuitive understanding of the objectives. Moreover, the functions are highly asymmetric. Thus, it would be interesting to derive some new test functions. We demand for families of test functions with: † Scalable degree of curvature of the pareto fronts † Simplicity, i.e. to allow for an intuitive understanding of the geometry of the function and solution sets † Scalability, i.e. it should be possible to formulate the functions for arbi- trary search space dimensions With the EBN family of problems and the Generalized Schafier problem we propose familes of test functions that meet the aforementioned conditions. The problems and their rigorous analysis will be presented next. We start with the discussion of the generalized Schafier problem. Then we introduce the EBN family of functions and discuss it.","title":"A rigorous analysis of two bi-criteria problem families with scalable curvature of the pareto fronts","id":240851631,"url":"https://www.researchgate.net/publication/240851631_A_rigorous_analysis_of_two_bi-criteria_problem_families_with_scalable_curvature_of_the_pareto_fronts","names":["Michael Emmerich"],"references":{"3418721":"Multi-objective optimization using evolutionary algorithms [Book Review]","2377646":"Evolutionary Algorithms for Multiobjective Optimization","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion"},"citedIn":{"3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","216457261":"Test Problems Based on Lamé Superspheres"},"index":696}