{"abs":"This work proposes a quantitative, non-parametric interpre- tation of statistical performance of stochastic multiobjective optimizers, including, but not limited to, genetic algorithms. It is shown that, accord- ing to this interpretation, typical performance can be defined in terms analogous to the notion of median for ordinal data, as can other measures analogous to other quantiles. Non-parametric statistical test procedures are then shown to be useful in deciding the relative performance of different multiobjective optimizers on a given problem. Illustrative experimental results are provided to support the discussion.","title":"Lecture Notes in Computer Science","id":235709741,"url":"https://www.researchgate.net/publication/235709741_Lecture_Notes_in_Computer_Science","names":[],"references":{"2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","3625443":"Multi-objective genetic algorithms made easy: Selection, sharing and mating restriction","277296897":"Multiobjective Genetic Algorithms with Application to Control Engineering Problems","3578177":"Multiobjective optimal controller design with genetic algorithms"},"citedIn":{"220754216":"Choosing extreme parents for diversity improvement in evolutionary multiobjective optimization algorithms","268821509":"Feedback-control operators for improved Pareto-set description: Application to a polymer extrusion process","226837382":"Multiobjective optimization using differential evolution for real-world portfolio optimization","3418674":"Evolutionary algorithms with dynamic population size and local exploration for multiobjective optimization","265909715":"Multiobjective evolutionary optimization in antibody purification process design","216300271":"Systematic analyses of multi-objective evolutionary algorithms applied to real-world problems using statistical design of experiments","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","243464841":"Optimising anti-spam filters with evolutionary algorithms","2673189":"Sphere Operators and Their Applicability for Constrained Parameter Optimization Problems","24295805":"Multiobjective Optimization of Rocket Engine Pumps Using Evolutionary Algorithm","250615039":"Migration study on a pareto-based island model for MOACOs","46888670":"Multi-Objective Combinatorial Optimization: Problematic and Context","23249269":"Automatic detection of exonic splicing enhancers (ESEs) using SVMs","228644280":"A Hybrid Evolutionary Approach to Solve Multi-objective Optimization Problems based on Particle Swarm Optimizer and Genetic Algorithm","241720947":"An alternative method for global and partial comparison of two diagnostic systems based on ROC curves","220742965":"HEMO: A Sustainable Multi-objective Evolutionary Optimization Framework","224301951":"Iterative approach to indicator-based multiobjective optimization","4075036":"Particle Swarm Optimizers for Pareto Optimization with Enhanced Archiving Techniques","230596505":"Towards a Deeper Understanding of Trade-offs Using Multi-objective Evolutionary Algorithms","42622112":"Asynchronous Multi-Objective Optimisation in Unreliable Distributed Environments","5607038":"A Multi-Objective Evolutionary Algorithm Toolbox for Computer-Aided Multi-Objective Optimization","222541171":"On finding multiple Pareto-optimal solutions using classical and evolutionary generating methods","257512297":"Fuzzy preference-based multi-objective optimization method","221890312":"De Novo Design of Potential RecA Inhibitors Using MultiObjective Optimization","249430767":"Non-dominated Rank based Sorting Genetic Algorithms","257581419":"Hybrid sampling strategy-based multiobjective evolutionary algorithm for process planning and scheduling problem","226832822":"A Comparative Study of Microarray Data Classification Methods Based on Ensemble Biological Relevant Gene Sets","2369041":"A Short Tutorial on Evolutionary Multiobjective Optimization","239590513":"for Building Design Optimization","284004567":"Lecture Notes in Computer Science","46888688":"Advances in Multi-Objective Nature Inspired Computing","221007121":"Tackling the 1/3 variant of the time and space assembly line balancing problem by means of a multiobjective genetic algorithm","220166493":"Preliminary Numerical Experiments in Multiobjective Optimization of a Metallurgical Production Process.","225878834":"Differential Evolution versus Genetic Algorithms in Multiobjective Optimization","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","228691433":"Cross Entropy multiobjective optimization for water distribution systems design","221228387":"Exploring the Performance of Stochastic Multiobjective Optimisers with the Second-Order Attainment Function","238660725":"Multi-objective site selection and analysis for GSM cellular network planning","253755763":"An Ant Colony Optmisation (ACO) based deployment optimisation strategy","8997597":"An Adaptive Sharing Elitist Evolution Strategy for Multiobjective Optimization","2805884":"Mechanical Inclusions Identification by Evolutionary Computation.","234814888":"An unorthodox introduction to Memetic Algorithms","220739967":"Incorporation of decision maker\u0027s preference into evolutionary multiobjective optimization algorithms","2441340":"On the Assessment of Multiobjective Approaches to the Adaptive Distributed Database Management Problem","221228406":"Multiobjective Optimization on a Budget of 250 Evaluations","215666311":"Multi-Objective Evolutionary Algorithm for University Class Timetabling Problem","4219430":"Spatial implementation of evolutionary multiobjective algorithms with partial Lamarckian repair for multiobjective knapsack problems","270222962":"A Tsallis entropy-based redundancy measure for water distribution networks","238455900":"Optimal Design of Integrated Systems Health Management (ISHM) for Improving the Safety of NASA\u0027s Exploration Missions: A Multidisciplinary Design Approach","235051624":"Adaptive Pareto Set Estimation for Stochastic Mixed Variable Design Problems","4251700":"Crowding Population-based Ant Colony Optimisation for the Multi-objective Travelling Salesman Problem","5178427":"Differential Evolution for Multiobjective Portfolio Optimization","216300179":"Model Optimization with Evolutionary Algorithms","220741972":"Comparison of evolutionary multiobjective optimization with rference solution-based single-objective approach.","233045916":"On Maximizing Solution Diversity in a Multiobjective Multidisciplinary Genetic Algorithm for Design Optimization","262317021":"Advances in Evolutionary Multi-objective Optimization","216301164":"Evaluating Multi-criteria Evolutionary Algorithms for Airfoil Optimisation","235836544":"MO-TRIBES, an adaptive multiobjective particle swarm optimization algorithm","235694748":"Evolutionary Multi-Objective Optimization in Water Distribution Network Design","225665506":"A fast steady-state ε-dominance multi-objective evolutionary algorithm","271649440":"Harmony search-based multi-objective optimization model for multi-site order planning with multiple uncertainties and learning effects","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","234795878":"From theory to practice: an evolutionary algorithm for the antenna placement problem","215661127":"Graph partitioning by multi-objective real-valued metaheuristics: A comparative study","5751497":"Evolutionary Optimization of Sequence Kernels for Detection of Bacterial Gene Starts","224170493":"Diversity Improvement by Non-Geometric Binary Crossover in Evolutionary Multiobjective Optimization","2363014":"Benchmark Problem Generators and Results for the Multiobjective Degree-Constrained Minimum Spanning Tree Problem","215665790":"Multi-objective evolutionary algorithms for resource allocation problems","232615289":"A Survey of Performance Assessment for Multiobjective Optimizers","4870883":"A genetic-based framework for solving (multi-criteria) weighted matching problems","37245588":"Metaheuristic and Multiobjective Approaches for Space Allocation","221002113":"A comparison of randomized and evolutionary approaches for optimizing base station site selection","257391098":"Empirical evaluation of search based requirements interaction management","262952707":"Quantitative Comparison of Approximate Solution Sets for Bi-criteria Optimization Problems","266982214":"On the Performance of Local Search for the Biobjective Traveling Salesman Problem","3418757":"Rank-density-based multiobjective genetic algorithm and benchmark test function study","273131766":"APPLICATION OF OPTIMIZATION ALGORITHMS IN SOFTWARE SYSTEM FOR SENSOR SIMULATIONS","221228442":"Lecture Notes in Computer Science","2318489":"Advanced Multi-objective Evolutionary Algorithms Applied to two Problems in Telecommunications","240921313":"RPSGAe - Reduced Pareto Set Genetic Algorithm: A Multiobjective Genetic Algorithm with Elitism","43188782":"Algoritmos evolutivos y preferencia del decisor aplicados a problemas de optimización multiobjetivos discretos","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","225109460":"Land Combat Scenario Planning: A Multiobjective Approach","238682874":"Title of Dissertation ENTROPY APPROACH TO METAMODELING, MULTI-OBJECTIVE GENETIC ALGORITHM, AND QUALITY ASSESSMENT OF SOLUTION SETS FOR","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","220955118":"Two Results on Distances for Phylogenetic Networks","221228519":"On Gradient Based Local Search Methods in Unconstrained Evolutionary Multi-objective Optimization","220955107":"Cramer Coefficient in Genome Evolution","4201610":"Designing comminution circuits with a multi-objective evolutionary algorithm","226610511":"Assessment Methodologies for Multiobjective Evolutionary Algorithms","228858731":"Exploratory Analysis of Stochastic Local Search Algorithms in Biobjective Optimization","220955129":"Pharmacophore-Based Screening as a Clue for the Discovery of New P-Glycoprotein Inhibitors","257888652":"Evolutionary Algorithms With Segment-Based Search for Multiobjective Optimization Problems","220955128":"Improving Cross Mapping in Biomedical Databases","220176332":"Performance evaluation of evolutionary multiobjective optimization algorithms for multiobjective fuzzy genetics-based machine learning","2861821":"Multi-Objective Benchmark Studies for Evolutionary Computation","49282102":"Multi-level Ranking for Constrained Multi-objective Evolutionary Optimisation","220955120":"Feature Selection Using Multi-Objective Evolutionary Algorithms: Application to Cardiac SPECT Diagnosis","220955124":"Agent-Based Model of the Endocrine Pancreas and Interaction with Innate Immune System.","259804063":"General Subpopulation Framework and Taming the Conflict Inside Populations","221900766":"Multiple objective ant colony optimisation. Swarm Intell","201977070":"On the Assessment of Multiobjective Approaches to the Adaptive Distributed Database Management Problem","2832577":"An Evolution Strategy for Multiobjective Optimization","221228484":"On the Computation of the Empirical Attainment Function","2439369":"Approximating the Pareto Set: Concepts, Diversity Issues, and Performance Assessment","220739526":"Generalization of Dominance Relation-Based Replacement Rules for Memetic EMO Algorithms","263525189":"Comparison and Evaluation of Multiple Objective Genetic Algorithms for the Antenna Placement Problem: Algorithmic Solutions for Wireless, Mobile, Ad Hoc and Sensor Networks (Guest Editors: Amotz Bar-Noy, Alan A. Bertossi, Cristina M. Pinotti and Cauligi S. Raghavendra)","227189114":"Parallel Multi-objective Optimization Using Self-organized Heterogeneous Resources","259216770":"A novel multiobjective optimization algorithm, MO-HAS. Application on a water resources management problem","272891058":"Multiobjective optimization: When objectives exhibit non-uniform latencies","4201653":"Techniques for the evolution of pipelined linear transforms","272391371":"Facilitating an ant colony algorithm for multi-objective data-intensive service provision","220740560":"Effects of the Use of Non-Geometric Binary Crossover on Evolutionary Multiobjective Optimization","220701662":"Use of Heuristic Local Search for Single-Objective Optimization in Multiobjective Memetic Algorithms","220955089":"An Experimental Evaluation of a Novel Stochastic Method for Iterative Class Discovery on Real Microarray Datasets","221228501":"Effects of the Existence of Highly Correlated Objectives on the Behavior of MOEA/D","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation","6357345":"Gradient-Based Optimization of Kernel-Target Alignment for Sequence Kernels Applied to Bacterial Gene Start Detection","2328866":"Multiobjective Approaches to the Adaptive Distributed Database Management Problem","220955178":"Rbbt: A Framework for Fast Bioinformatics Development with Ruby","220955180":"Genome Visualization in Space","220955171":"Structure Based Design of Potential Inhibitors of Steroid Sulfatase.","264058039":"Attributed multi-objective comprehensive learning particle swarm optimization for optimal security of networks","220381225":"A review of multiobjective test problems and a scalable test problem toolkit.","257196127":"The Development of a Multi-Objective Tabu Search Algorithm for Continous Optimisation Problems","261273758":"Reference point-based search scheme for multiobjective evolutionary algorithm","2642725":"Evaluating the Quality of Approximations to the Non-Dominated Set","3418917":"An evolutionary approach to multiobjective clustering. IEEE Trans Evol Comput","225244285":"The Effect of Initial Population Sampling on the Convergence of Multi-Objective Genetic Algorithms","228567692":"Visualization Technique for Analyzing Non-Dominated Set Comparison","221228600":"Robust Design of Noise Attenuation Barriers with Evolutionary Multiobjective Algorithms and the Boundary Element Method","249970684":"A Multiobjective Memetic Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","263930528":"Hybrid algorithms for the twin–screw extrusion configuration problem","226550943":"Pareto Local Optimum Sets in the Biobjective Traveling Salesman Problem: An Experimental Study","3418902":"Efficient search for robust solutions by means of evolutionary algorithms and fitness approximation","261723325":"Engineering an efficient two-phase local search algorithm for the co-rotating twin-screw extruder configuration problem","239564640":"the Pareto Set: Concepts, Diversity Issues, and Performance Assessment","260498593":"A Survey on Multiobjective Evolutionary Algorithms for the Solution of the Portfolio Optimization Problem and Other Finance and Economics Applications","220773890":"Exploiting Second Order Information in Computational Multi-objective Evolutionary Optimization.","220701704":"Lecture Notes in Computer Science","220955161":"An Application for Studying Tandem Repeats in Orthologous Genes","221228572":"Quantifying the Effects of Objective Space Dimension in Evolutionary Multiobjective Optimization","221024792":"Introduction to Evolutionary Multiobjective Optimization","220955165":"Enhancing Elementary Flux Modes Analysis Using Filtering Techniques in an Integrated Environment","222827635":"A new multiobjective evolutionary algorithm","38092670":"On the Use of Problem-Specific Candidate Generators for the Hybrid Optimization of Multi-Objective Production Engineering Problems","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","221228563":"Lecture Notes in Computer Science","220826644":"Self-organized Parallel Cooperation for Solving Optimization Problems","220119075":"Multiobjective memetic algorithms for time and space assembly line balancing","220265503":"Multi-Objective Evolutionary Algorithms for Feature Selection: Application in Bankruptcy Prediction","237278052":"Sommersemester 2006 Planung und Analyse von Computerexperimenten","252576846":"On Applications of Extreme Value Theory in Optimization","282638750":"Um algoritmo baseado em evolução diferencial para problemas de otimização estrutural multiobjetivo com restrições","270723437":"Visualization of Pareto Front Approximations in Evolutionary Multiobjective Optimization: A Critical Review and the Prosection Method","267250365":"A Study of Local Optima in the Biobjective Travelling Salesman Problem","227153626":"Using Experimental Design to Analyze Stochastic Local Search Algorithms for Multiobjective Problems","226681552":"An Adaptive Divide-and-Conquer Methodology for Evolutionary Multi-criterion Optimisation","222400530":"Design of an adaptive mutation operator in an electrical load management case study","222312468":"Suman, B.: Study of self-stopping PDMOSA and performance measure in multiobjective optimization. Comput. Chem. Eng. 29(5), 1131-1147","228959986":"Performance of demo on new test problems: A comparison study","226202147":"Recent Developments in Evolutionary Multi-Objective Optimization","220801140":"Sphere Operators and Their Applicability for Constrained Parameter Optimization Problems","220702279":"A Framework for Incorporating Trade-Off Information Using Multi-Objective Evolutionary Algorithms","4055900":"Nondominated sorting genetic algorithm for optimal phasor measurement placement","4151132":"Fuzzy Logic Controlled Multi-Objective Differential Evolution","4940076":"An empirical study on similarity-based mating for evolutionary multiobjective combinatorial optimization. Eur J Oper Res","261038820":"Parallelization of the multi-objective container loading problem","284121474":"On one-step worst-case optimal trisection in univariate bi-objective Lipschitz optimization","222415920":"Stützle, T.: Design and analysis of stochastic local search for the multiobjective traveling salesman problem. Computers \u0026 Operations Research 36(9), 2619-2631","271936836":"Multi-objective optimization of cellular fenestration by an evolutionary algorithm","261342950":"Diagnostic assessment of the borg MOEA for many-objective product family design problems","264789694":"Massively Parallel Evolutionary Computation on GPGPUs","220883625":"Let the Ants Deploy Your Software - An ACO Based Deployment Optimisation Strategy","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","262272552":"Recombination of Similar Parents in SMS-EMOA on Many-Objective 0/1 Knapsack Problems","259505405":"General framework for localised multi-objective evolutionary algorithms","223074500":"Orthogonal simulated annealing for multiobjective optimization","221008061":"Parallel Multi-objective Optimization using Master-Slave Model on Heterogeneous Resources","281717598":"A double-module immune algorithm for multi-objective optimization problems","220341431":"MOO for chemical processes and controller design: Approximating and classifying the Pareto domain","3810221":"Assessing the performance of multiobjective genetic algorithms for optimization of a batch process scheduling problem","3810214":"“An updated survey of evolutionary multiobjective optimization techniques: State of the art and future trends,” in: Congress on evolutionary computation","239543782":"A Scalable Multi-objective Test Problem Toolkit (corrected version: 22 June 2005)","2830223":"Inferential Performance Assessment of Stochastic Optimisers and the Attainment Function","234802779":"Coello, C.A.C.: An updated survey of GA-based multi-objective optimization techniques. ACM Computing Surveys 32(2), 109-143","223087337":"A study of local search algorithms for the biobjective QAP with correlated flow matrices","261482544":"Group Counseling Optimization for multi-objective functions","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","271003019":"A multi-population cooperative coevolutionary algorithm for multi-objective capacitated arc routing problem","264090642":"Towards a vector agent modelling approach for remote sensing image classification","226839092":"Evaluation of Multiple Objective Metaheuristics","220176037":"Use of biased neighborhood structures in multiobjective memetic algorithms","257697510":"On the worst-case optimal multi-objective global optimization","224177888":"Reducing energy use and operational cost of air conditioning systems with multi-objective evolutionary algorithms","3419017":"A Jumping Gene Paradigm for Evolutionary Multiobjective Optimization","2473370":"An Evolutionary Algorithm With A Multilevel Pairing Strategy For Single And Multiobjective Optimization","221008109":"Hyperheuristic codification for the multi-objective 2D Guillotine Strip Packing Problem","225989818":"An Evolutionary Multi-objective Adaptive Meta-modeling Procedure Using Artificial Neural Networks","261520468":"Diversity Comparison of Pareto Front Approximations in Many-Objective Optimization","220341478":"Computing Pareto fronts using distributed agents","224645799":"Stochastic Evolutionary Multiobjective Environmental/Economic Dispatch","252018382":"A Multiobjective Memetic Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","260621912":"Preference-Inspired Coevolutionary Algorithms for Many-Objective Optimization","7826340":"BIOINFORMATICS Computational cluster validation in post-genomic data analysis","220740848":"Multi-objective test problems, linkages, and evolutionary methodologies","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","221019895":"A Multi-Objective Evolutionary Approach for the Antenna Positioning Problem","224645823":"Comparison between Single-Objective and Multi-Objective Genetic Algorithms: Performance Comparison and Performance Measures","259216559":"Medley multiobjective harmony search algorithm. Application on a water resources management problem","3455466":"Evolutionary multi-objective optimization: A historical view of the field","275583885":"P3GA: An Algorithm for Technology Characterization","237334983":"Analysis and Design of Stochastic Local Search Algorithms for the Multiobjective Traveling Salesman Problem","226118302":"MO-TRIBES, an adaptive multiobjective particle swarm optimization algorithm","257588927":"Multi-objective optimization by learning automata","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","220443348":"Revisiting the Memory of Evolution","4074951":"Pareto-based multi-objective differential evolution","271445970":"Multiobjective optimisation on a budget: Exploring surrogate modelling for robust multi-reservoir rules generation under hydrological uncertainty"},"index":699}