{"abs":": This paper deals with work done to solve a practical problem occurring at the Danish Ministry of Education. Here the decision makers require the computation of several solutions to the same problem, each solution is to be optimized considering a single aggregated criteria function. The solutions must be mutual different considering two measures of difference. The paper presents a method for combining the aim for optimization with the aim for diversity using the idea of fitness sharing known from genetic algorithms, eventually yielding a single objective function for a set of solutions. The resulting problems are solved by simulated annealing and, for comparison reasons, also by some ascent heuristics. The software is now on the third year being used by the ministry on a national scale. Keywords: Decision Support; Vector Optimization; Simulated Annealing 1. Introduction At the Danish Ministry of Education, a yearly recurring problem prior to the High School examination period in May-J...","title":"Generating a Diversity of Good Solutions to a Practical Combinatorial Problem using Vectorized Simulated Annealing","id":2713564,"url":"https://www.researchgate.net/publication/2713564_Generating_a_Diversity_of_Good_Solutions_to_a_Practical_Combinatorial_Problem_using_Vectorized_Simulated_Annealing","names":["Michael Pilegaard Hansen"],"references":{"220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","242372494":"Genetic algorithm in search"},"citedIn":{"216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","2581803":"Approximating the non-dominated front using the Pareto Archived Evolution Strategy"},"index":703}