{"abs":"The application of evolutionary algorithms in multiobjective optimization, proposed relatively early in their history, is currently receiving growing interest from researchers with various backgrounds. The paper reviews and discusses current multiobjective evolutionary approaches, identifying some of the issues raised by how they handle multiple objectives, such as how they affect the fitness landscape. Directions for future research are identified from the discussion. Keywords: evolutionary algorithms, multiobjective optimization, fitness assignment, search strategies, bibliography.","title":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","id":2465269,"url":"https://www.researchgate.net/publication/2465269_An_Overview_of_Evolutionary_Algorithms_in_Multiobjective_Optimization","names":["Carlos M. Fonseca","Peter J. Fleming","Evolutionary Computation"],"references":{"224132443":"Incorporating the Notion of Relative Importance of Objectives in Evolutionary Multiobjective Optimization","220812584":"Multi-Objective Learning via Genetic Algorithms.","225740150":"Immunity-based evolutionary algorithm for optimal global container repositioning in liner shipping","220199704":"A multi-objective genetic algorithm applied to autonomous underwater vehicles for sewage outfall plume dispersion observations","220171028":"Robust decision and optimisation for collaborative parameter design","229927353":"Multi-objective optimal FLC driven hybrid mass damper for torsionally coupled, seismically excited structures","239406664":"A method of multiobjective optimization using a genetic algorithm and an artificial immune system","243566730":"The Realization of a Fast and Effective Optimization Method on Atomic Structure","220381997":"“Optimisation of Weld Deposition Effciency in Pulsed MIG Welding Using Hybrid Neuro-Based Techniques,”","223866692":"A class of multi-objective expected value decision-making model with birandom coefficients and its application to flow shop scheduling problem","225780067":"Cell formation in the presence of reconfigurable machines","222427478":"Multi-objective tabu search using a multinomial probability mass function","227890060":"Optimal positioning of wind turbines on Gökçeada using multi‐objective genetic algorithm","222701916":"Reheat optimization of the variable-air-volume box","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","236136968":"Efficient thinning regimes for Eucalyptus fastigata: multi-objective stand-level optimisation using the island model genetic algorithm. Ecol Model","12563619":"Variable Length Representation in Evolutionary Electronics","2453048":"Design of Single Electron Systems through Artificial Evolution","228856761":"Effective and Efficient Algorithm for Multiobjective Optimization of Hydrologic Models","220435773":"Application of Evolutionary Algorithms for Humanoid Robot Motion Planning","225379663":"On Polydispersity of Plant Biomass Recalcitrance and Its Effects on Pretreatment Optimization for Sugar Production","220204803":"Parallel clustering of high dimensional data by integrating multi-objective genetic algorithm with divide and conquer","245330618":"Hybrid assembly line design and user\u0027s preferences","239386722":"KB-GA-Based Hybrid System for Layout Planning of Multistory Buildings","225699669":"Multi-objectives optimal model of heavy equipment using improved Strength Pareto Evolutionary Algorithm","3418653":"Parameter optimization of an on-chip voltage reference circuit using evolutionary programming","49660127":"Note: Multivariate system spectroscopic model using Lorentz oscillators and partial least squares regression analysis","233083342":"Multiobjective Optimization of Reactor–Regenerator System Using Ant Algorithm","5607038":"A Multi-Objective Evolutionary Algorithm Toolbox for Computer-Aided Multi-Objective Optimization","241101936":"Optimization of waste stabilization pond design for developing nations using computational fluid dynamics","226169163":"Parameter optimization of laser die-surface hardening using the particle swarm optimization technique","256968545":"Optimal design of actively controlled adjacent structures for balancing the mutually conflicting objectives in design preference aspects","256128886":"Evolution of genetic algorithms in classification rule mining","222857595":"Coello, A.C.: Theoretical and Numerical Constraint-Handling Techniques Used with Evolutionary Algorithms: A Survey of the State of the Art. Comput. Methods Appl. Mech. Engrg. 191(11-12), 1245-1287","220381969":"A new multiobjective genetic algorithm with heterogeneous population for solving flowshop scheduling problems","201976381":"Finite Markov Chain Analysis of Genetic Algorithms","3323398":"Genetic optimization of interval arithmetic-based worst case circuit tolerance analysis","235297842":"Intelligent Multi-Objective Nonlinear Model Predictive Control (iMO-NMPC): Towards the ‘on-line’ optimization of highly complex control problems","220200234":"Feature-based classifier ensembles for diagnosing multiple faults in rotating machinery","201976383":"Reducing Bias and Inefficiency in the Selection Algorithm","220665104":"Internal combustion engine control for series hybrid electric vehicles by parallel and distributed genetic programming/multiobjective genetic algorithms","223672682":"A multi-objective decision-making model with fuzzy rough coefficients and its application to the inventory problem","222997259":"Multi-objective simulation-based evolutionary algorithm for an aircraft spare parts allocation problem","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","268894787":"Parallel Evolutionary Computation for Solving Complex CFD Optimization Problems : A Review and Some Nozzle Applications","228693476":"Delineation of Irregularly Shaped Disease Clusters Through Multiobjective Optimization","245512933":"An Evolutionary Approach of Multicriteria Manufacturing Cell Formation","228691433":"Cross Entropy multiobjective optimization for water distribution systems design","220140374":"An adaptive navigation support system for conducting context-aware ubiquitous learning in museums","223356697":"Prediction and simulation errors in parameter estimation for nonlinear systems","245390058":"Integrated optimization of system design and spare parts allocation by means of multiobjective genetic algorithms and Monte Carlo simulation","3418750":"Dynamic multiobjective evolutionary algorithm: Adaptive cell-based rank and density estimation","201976389":"Nonstationary Function Optimization Using Genetic Algorithms with Dominance and Diploidy","220384622":"Bi-objective scheduling for reentrant hybrid flow shop using Pareto genetic algorithm","229545955":"Multi‐objective optimal design of FLC driven hybrid mass damper for seismically excited structures","225137444":"Cell Evolutionary Algorithm: A new optimization method on ground-state energy of the atomic","3421819":"Computational Intelligence in Product Design Engineering: Review and Trends","224606514":"A Favorable Weight-Based Evolutionary Algorithm for Multiple Criteria Problems","260489685":"Interactive Multiobjective Optimization Procedure","243776722":"Characterization of Pareto and Lexicographic Optimal Solutions","235955781":"Interactive enhanced particle swarm optimization: A multi-objective reliability application","223584006":"Genetic algorithm for the personnel assignment problem with multiple objectives","257726218":"Fuzzy Genetic Versus PSO Algorithms for the Synthesis of Linear Antenna Array","260942289":"In Vivo Nondestructive Measurement of Blood Glucose by Near-Infrared Diffuse-Reflectance Spectroscopy","235832912":"An efficient Differential Evolution based algorithm for solving multi-objective optimization problems","225156875":"Identification of multibody vehicle models for crash analysis using an optimization methodology","3418709":"A weighted sum genetic algorithm to support multiple-party multi-objective negotiations","220199291":"A fast multi-objective evolutionary algorithm based on a tree structure","223025452":"The Pareto fitness genetic algorithm: Test function study","245315831":"Genetic-algorithm-based optimal apportionment of reliability and redundancy under multiple objectives","200734623":"A decade of Kasabov\u0027s Evolving Connectionist Systems: A Review","220606287":"A Port System Simulation Facility With An Optimization Capability.","220813123":"Representation and Hidden Bias II: Eliminating Defining Length Bias in Genetic Search via Shuffle Crossover.","225517339":"Robust and stable scheduling of a single machine with random machine breakdowns","220386633":"Dynamic Techniques for Genetic Algorithm–Based Music Systems","257774385":"Optimal Performance Design of Bi-Tuned Mass Damper Systems Using Multi-Objective Optimization","220200299":"An oriented spanning tree based genetic algorithm for multi-criteria shortest path problems","220381014":"Using unconstrained elite archives for multiobjective optimization","241554973":"Multi-Objective Hybrid Evolutionary Optimization with Automatic Switching Among Constituent Algorithms","51960673":"Digital Ecosystems: Ecosystem-Oriented Architectures","221765453":"Multi-Objective Optimization with Estimation of Distribution Algorithm in a Noisy Environment","3418697":"Jaszkiewicz, A.: On the Performance of Multiple-Objective Genetic Local Search on the 0/1 Knapsack Problem - A Comparative Experiment. IEEE Trans. on Evolutionary Computation 6, 402-412","220176795":"Multi-objective self-adaptive differential evolution with elitist archive and crowding entropy-based diversity measure. Soft Comput Fusion Found Method Appl","257636319":"Differential evolution based soft optimization to attenuate vane–rotor shock interaction in high-pressure turbines","3421873":"Optimal Advertising Campaign Generation for Multiple Brands Using MOGA","224490470":"Design optimization of electric machines based on the estimation of permeability distribution","285066352":"Partie II. Une approche multicritère","216301684":"Low implementation cost IIR digital filter design using genetic algorithms","3421349":"Multiobjective programming using uniform design and genetic algorithm","269140120":"A Multi-Objective Optimization Model and a Decision-Making Method for Traffic Signal Control","12473896":"Efficient and Scalable Pareto Optimization by Evolutionary Local Selection Algorithms","258227698":"Multi-objective model for regional wastewater systems planning","220373432":"Design and Management Strategies for Mixed Public Private Transportation Networks: A Meta‐Heuristic Approach","12473892":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","201976488":"Uniform Crossover in Genetic Algorithms","220555140":"A probability maximization model based on rough approximation and its application to the inventory problem","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","245426181":"Statistical Improvement Criteria for Use in Multiobjective Design Optimization","220170682":"An interactive particle swarm optimisation for selecting a product family and designing its supply chain","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","222080407":"Immune optimization algorithm for constrained nonlinear multiobjective optimization problems","220204940":"Evolving dynamic Bayesian networks with multi-objective genetic algorithms. Appl Intell","220284816":"An adaptive multisite mapping for computationally intensive grid applications","225686466":"Multi-objective dynamic optimal trajectory planning of robot manipulators in the presence of obstacles","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","245310505":"VIS: An artificial immune network for multi-objective optimization","3275401":"Electric Distribution Network Multiobjective Design Using a Problem-Specific Genetic Algorithm","260816177":"Using Genetic Algorithms to Solve Multiple Objective Groundwater Pollution Containment Problem","216300639":"Compaction of Symbolic Layout using Genetic Algorithms","49641550":"An integrative and practical evolutionary optimization for a complex, dynamic model of biological networks","223284724":"Multicriteria Target Vector Optimization of Analytical Procedures Using a Genetic Algorithm .1. Theory, Numerical Simulations and Application to Atomic Emission-Spectroscopy.","227312432":"Scheduling flexible manufacturing systems using parallelization of multi-objective evolutionary algorithms","220176803":"A Pareto-based multi-objective evolutionary approach to the identification of Mamdani fuzzy systems","258663383":"On the need for automated multiobjective optimization and uncertainty estimation of glacier mass balance models","220160417":"Metco: a Parallel Plugin-Based Framework for Multi-Objective Optimization.","229507345":"Discovery of New Green Phosphors and Minimization of Experimental Inconsistency Using a Multi‐Objective Genetic Algorithm‐Assisted Combinatorial Method","245435934":"Comparison of Several Optimization Strategies for Robust Turbine Blade Design","220664807":"Structure detection for nonlinear rational models using genetic algorithms","235770575":"Algorithm for Increasing the Speed of Evolutionary Optimization and its Accuracy in Multi-objective Problems","227987794":"Advances in Chemical Physics, Volume 148","223741842":"Designing a risk-informed balanced system by genetic algorithms: Comparison of different balancing criteria","229582186":"Simultaneous Optimization of Luminance and Color Chromaticity of Phosphors Using a Nondominated Sorting Genetic Algorithm","220650464":"Seeking the Pareto front for multiobjective spatial optimization problems","220701664":"Application of Genetic Algorithms to Task Planning and Learning.","229574504":"Multi‐objective highway alignment optimization using a genetic algorithm","227535175":"Cognitive engine implementation for wireless multicarrier transceivers","201976512":"Some Guidelines for Genetic Algorithms with Penalty Functions","220199893":"Evolutionary-based techniques for real-life optimisation: Development and testing","227785567":"Optimization of structural dynamic behaviour based on effective modal parameters","220371436":"Phi-array: A novel method for fitness visualization and decision making in evolutionary design optimization","251620913":"Optimization of the inspection intervals of a safety system in a nuclear power plant by Multi-Objective Differential Evolution (MODE)","24392635":"Exploring the capabilities of quantum optimal dynamic discrimination","224561585":"Interleaved Ultrawideband Antenna Arrays Based on Optimized Polyfractal Tree Structures","229673828":"Multiobjective Optimization for Drug Discovery","220584945":"The Faster Higher-Order Cellular Automaton for Hyper-Parallel Undistorted Data Compression.","225820579":"Adaptive weighted sum method for multiobjective optimization: A new method for Pareto front generation","245079117":"Optimal unit grouping in weighted voting systems","222569370":"Manipulator trajectory planning using a MOEA","241060481":"Multiobjective Particle Swarm Optimization for Parameter Estimation in Hydrology","44620360":"Multiobjective Optimization Approach: Thermal Food Processing","226135954":"Disassembly planning of mechanical systems for service and recovery: A genetic algorithms based approach","2782915":"A Variant of Evolution Strategies for Vector Optimization","223711672":"Optimal power system generation scheduling by multi-objective genetic algorithms with preferences","222681003":"Comparing state-of-the-art evolutionary multiobjective algorithms for long-term groundwater monitoring design. Advances in Water Resources, 29(6), 792-807","263387485":"MOIA: Multi-objective immune algorithm","44002412":"Computational Evolutionary Embryogeny","220306903":"A constraint-based approach to feasibility assessment in preliminary design","236610797":"Hybrid organization of functional departments and manufacturing cells in the presence of imprecise data","235431665":"Taguchi\u0027s method for multi-objective optimization problems","224177573":"An Interactive Territory Defining Evolutionary Algorithm: iTDEA","243773566":"On the potential of genetic algorithms in urban drainage modelling","257580966":"Hub network design problem in the presence of disruptions","268606716":"Multicriteria decision models with specified goal levels","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","2611416":"A Survey of Evolution Strategies","245425060":"Using the Two-Branch Tournament Genetic Algorithm for Multiobjective Design","257055318":"Optimization of drinking water distribution networks: Computer-based methods and constructal design","201976076":"The Application of Genetic Algorithms to Resource Scheduling","245353369":"A Pareto-Based Genetic Algorithm Search Approach to Handle Damped Natural Frequency Constraints in Turbo Generator Rotor System Design","257633363":"Optimal feeding profile for a fuzzy logic controller in a bioreactors using genetic algorithm","270753578":"Optimal Dimensioning for Parallel Manipulators: Workspace, Dexterity, and Energy","41713014":"Combining Evolutionary Algorithms and exact approaches for multi-objective knowledge discovery","245391277":"Parameter optimization of a hydraulic engine mount based on a genetic neural network","232992497":"Preference-based maintenance planning for deteriorating bridges under multi-objective optimisation framework","233238772":"A comprehensive preference-based optimization framework with application to high-lift aerodynamic design","26308228":"Optimal Solutions of Multiproduct Batch Chemical Process Using Multiobjective Genetic Algorithm with Expert Decision System","3240743":"Design, optimization, and fabrication of side-illuminated p-i-nphotodetectors with high responsivity and high alignment tolerance for1.3and 1.55-μm wavelength use","224309321":"A Multiobjective Evolutionary-Simplex Hybrid Approach for the Optimization of Differential Equation Models of Gene Networks","220462651":"Setup coordination between two stages of a production system: A multi-objective evolutionary approach","3317032":"Automatic design of frequency sampling filters by hybrid genetic algorithm techniques. IEEE Transactions on Signal Processing 46: 3304-3314","237079868":"Structuration d\u0027ateliers hybrides","220585019":"A new parallel-by-cell approach to undistorted data compression based on cellular automaton and genetic algorithm","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107","227953334":"Wagner, G. P. The influence of variation and developmental constraints on the rate of multivariate phenotypic evolution. J. Evol. Biol. 1, 45-66","231575277":"Throughput Maximization of Queueing Networks with Simultaneous Minimization of Service Rates and Buffers","261625017":"Density Estimation for Statistics and Data Analysis","233022146":"Optimal selection of suspension parameters in large scale vehicle models","225037898":"Optimisation of a Multi-Objective Two-Dimensional Strip Packing Problem based on Evolutionary Algorithms","233214661":"Optimal feeding profile in fed-batch bioreactors using a genetic algorithm","12794343":"Anatomy-based three-dimensional dose optimization in brachytherapy using multiobjective genetic algorithms","12766693":"Multiobjective genetic optimization of diagnostic classifiers with implications for generating receiver operating characteristic curves","257635955":"Multi-objective GA with fuzzy decision making for security enhancement in power system","220885507":"Searching Databases of Two-Dimensional and Three-Dimensional Chemical Structures Using Genetic Algorithms.","239376744":"Structural crack detection without updated baseline model by single and multiobjective optimization","220199475":"Multiobjective optimization using variable complexity modelling for control system design","226652847":"Identification of validated multibody vehicle models for crash analysis using a hybrid optimization procedure","220885508":"A Naturally Occurring Niche and Species Phenomenon: The Model and First Results.","245357489":"Shape Optimization of a MultiElement Foil Using an Evolutionary Algorithm","233893598":"Multi-objective optimization of skeletal structures under static and seismic loading conditions","224330345":"Order of Nonlinearity as a Complexity Measure for Models Generated by Symbolic Regression via Pareto Genetic Programming","220045354":"Fuzzy scheduling control of a gas turbine aero-engine: a multi-objective approach","243775423":"Computer aided control system design using a multiobjective optimization approach","220080165":"A model for the dynamic coordination of multiple competing goals","222827635":"A new multiobjective evolutionary algorithm","3113235":"Multiobjective Memetic Algorithms With Quadratic Approximation-Based Local Search for Expensive Optimization in Electromagnetics","223162992":"Importance measures and genetic algorithms for designing a risk-informed optimally balanced system","220290079":"Searching for multi-objective preventive maintenance schedules: combining preferences with evolutionary algorithms. Eur J Oper Res","270392098":"Prediction of nonlinear production performance in waterflooding project using a multi-objective evolutionary algorithm","263452914":"Optimum Design and Analysis of Axial Hybrid Magnetic Bearings Using Multi-Objective Genetic Algorithms","220375137":"Predictive Models for the Breeder Genetic Algorithm I. Continuous Parameter Optimization","5303060":"Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria","5303061":"Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection","220380772":"Preferences and their Application in Evolutionary Multiobjective Optimisation","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","235985757":"Distribution of threatened–unprotected vertebrates as a basis for conservation planning","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","201976155":"Genetic Algorithms and Simulated Annealing: An Overview","220885628":"Reducing Bias and Inefficienry in the Selection Algorithm.","33680214":"Constructing strategies in strategic planning: a decision support evaluation model","228656889":"Multi-objective analysis of a component-based representation within an interactive evolutionary design system","33680221":"A Decision Support Tool Coupling a Causal Model and a Multi-objective Genetic Algorithm","2252671":"Pareto Optimality, GA-easiness and Deception","28600555":"Optimal Reservoir Operation Using Multi-Objective Evolutionary Algorithm","257035316":"New cluster mapping tools for the graphical assessment of non-dominated solutions in multi-objective optimization","4940076":"An empirical study on similarity-based mating for evolutionary multiobjective combinatorial optimization. Eur J Oper Res","238176601":"Agent-based Synthesis of ElectroMechanical Design Configurations","222198355":"Design of mixed H2/H∞ control systems using algorithms inspired by the immune system","263245022":"Multi-objective aerodynamic shape optimization of small livestock trailers","225124356":"Optimal disc cutters plane layout design of the full-face rock tunnel boring machine (tbm) based on a multi-objective genetic algorithm","46282157":"Ensembles of uncertain mathematical models can identify network response to therapeutic interventions","251468172":"Chapter D4 Multi-objective integrated design and control using stochastic global optimization methods","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","220470352":"WBMOAIS: A novel artificial immune system for multiobjective optimization","224306216":"Multiobjective Particle Swarm Algorithm With Fuzzy Clustering for Electrical Power Dispatch","3351364":"Evolutionary approach to hardware/software partitioning","220375131":"Adding Learning to the Cellular Development of Neural Networks: Evolution and the Baldwin Effect","220279387":"Multiobjective genetic algorithm partitioning for hierarchical learning of high-dimensional pattern spaces: A learning-follows-decomposition strategy","220176480":"Multi-Objective Optimization using Grid Computing","221936197":"Multiobjective Contaminant Sensor Network Design for Water Distribution Systems","228085784":"Multiobjective Metaheuristics for the Bus Driver Scheduling Problem","49402226":"Determining heat transfer coefficients using evolutionary algorithms","233011815":"Maximum weight matching and genetic algorithm for fixed-shape facility layout problem","27812396":"Multiobjective optimization for multiproduct batch plant design under economic and environmental considerations","237075897":"Hybrid Algorithm for Constrained Portfolio Selection Problem","220218044":"Precast production scheduling using multi-objective genetic algorithms","220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","237066625":"A multi objective genetic algorithm for the facility layout problem based upon slicing structure encoding","2250624":"Genetic Algorithms for Changing Environments","224516803":"On the Effects of Adding Objectives to Plateau Functions","233343563":"Optimal choice of wastewater treatment train by multi-objective optimization","220403335":"Pareto memetic algorithm for multiple objective optimization with an industrial application","3418513":"Evolutionary Computation: Comments on the History and Current State","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","255649430":"Multiobjective Optimal Waste Load Allocation Models for Rivers Using Nondominated Sorting Genetic Algorithm-II","220199605":"Multi-sensor based prediction of metal deposition in pulsed gas metal arc welding using various soft computing models","13241185":"Optimization and FROG analysis of rule-based detection schemes using a multiobjective approach","3418522":"Hybrid genetic algorithms for constrained placement problems","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","220361874":"Multiobjective optimization using an immunodominance and clonal selection inspired algorithm","257336039":"Secondary population implementation in multi-objective evolutionary algorithm for scheduling of FMS","36240795":"Solving multi-objective optimization problems with fuzzy relation equation constraints /","257697513":"Multiobjective vehicle routing problem with fixed delivery and optional collections","4913650":"A bi-objective genetic algorithm approach to risk mitigation in project scheduling","258757335":"Evolutionary multiobjective optimization in water resources: The past, present, and future","263221773":"Improving the calibration strategy of the physically-based model WaSiM-ETH using critical events","222048386":"A multiobjective immune algorithm based on a multiple-affinity model","3418507":"A parallel genetic algorithm for performance-driven VLSI routing","239392251":"Pareto optimization using the struggle genetic crowding algorithm","220311198":"Fanelli, A.M.: Interpretability constraints for fuzzy information granulation. Inf. Sci. 178(24), 4585-4618","222546050":"Problem solving environments in aerospace design","257605791":"An Element-Free Galerkin-Based Multi-objective Optimization of Laminated Composite Plates","232831527":"A Study on Multiobjective Optimization Technique for Inverse and Crack Identification Problems","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","6313904":"Design search and optimization in aerospace engineering","220141260":"Quasi-PSO Algorithm for Modeling Foraging Dynamics in Social Mammals","245346122":"An Introduction to Creative Evolutionary Systems","245095244":"Review of Utilization of Genetic Algorithms in Heat Transfer Problems","222675612":"A Diversified Multiobjective GA for Optimizing Reservoir Rule Curves","229881453":"MOSA Method: A Tool for Solving Multiobjective Combinatorial Optimization Problems, ” Journal of Multi Criteria Decision Analysis 8, pp. 221-236","223307951":"A class of expected value multi-objective programming problems with random rough coefficients","237089216":"Evolutionary Hinfin; design of an electromagnetic suspension control system for a maglev vehicle","3418581":"Interval-valued GA-P algorithms","224309436":"Contrast Enhancement and Intensity Preservation for Gray-Level Images Using Multiobjective Particle Swarm Optimization","234544668":"Genetic algorithms and their applications","220176120":"Qian, S.: Artificial immune system in dynamic environments solving time-varying non-linear constrained multi-objective problems. Soft Comput. 15(7), 1333-1349","222287061":"A multi-objective selection procedure of determining a Pareto set","46491433":"A hybrid immune multiobjective optimization algorithm","26850934":"Eccentricity Optimization of NGB System by using Multi-Objective Genetic Algorithm","220340437":"A fuzzy multiobjective algorithm for multiproduct batch plant: Application to protein production","251312899":"A macro-evolutionary multi-objective immune algorithm with application to optimal allocation of water resources in Dongjiang River basins, South China","3418574":"Explorations in design space: unconventional electronics design through artificial evolution. IEEE Trans Evolut Comput","256905899":"Data Classification through an Evolutionary Approach Based on Multiple Criteria","242372494":"Genetic algorithm in search","222870196":"A multiobjective evolutionary algorithm for approximating the efficient set","234001421":"Coordinating strategic outsourcing decisions for semiconductor assembly using a bi-objective genetic algorithm"},"citedIn":{"228730274":"Estimation and propagation of parametric uncertainty in environmental models","223274318":"Optimal design of hysteretic dampers connecting adjacent structures using multi-objective genetic algorithm and stochastic linearization method","224132443":"Incorporating the Notion of Relative Importance of Objectives in Evolutionary Multiobjective Optimization","257126227":"The ranking of negative-cost emissions reduction measures","220204321":"Mixed-Model U-Shaped Assembly Line Balancing Problems with Coincidence Memetic Algorithm","261353362":"Bearing-only tracking with a mixture of von Mises distributions","225740150":"Immunity-based evolutionary algorithm for optimal global container repositioning in liner shipping","224595296":"Efficiency Analysis in Communication Networks Topology Design","2480161":"Finding robust Texas Hold\u0027em poker strategies using Pareto coevolution and deterministic crowding","251105010":"Analysing Multiobjective Fitness Function with Finite State Automata","225213802":"Co-ordinated Design of AVR-PSS Using Multi Objective Genetic Algorithm","220470562":"GISMOO: A new hybrid genetic/immune strategy for multiple-objective optimization","251389682":"Pareto Evolutionary Algorithm Hybridized with Local Search for Biobjective TSP","11161760":"Improved Sampling of the Pareto-Front in Multiobjective Genetic Optimizations by Steady-State Evolution: A Pareto Converging Genetic Algorithm","239406664":"A method of multiobjective optimization using a genetic algorithm and an artificial immune system","288827687":"Multiobjective evolutionary algorithm based on multimethod with dynamic resources allocation","258176883":"A novel genetic programming approach to the design of engine control systems for the voltage stabilization of hybrid electric vehicle generator outputs","26558855":"Genetic Algorithms in Optimization and Computer Aided Design","4259925":"A comparative study of smooth path planning for a mobile robot by evolutionary multi-objective optimization","221007160":"Variable interactions and exploring parameter space in an expensive optimisation problem: Optimising Short Term Conflict Alert","37413423":"Scalable intelligent electronic catalogs","228644280":"A Hybrid Evolutionary Approach to Solve Multi-objective Optimization Problems based on Particle Swarm Optimizer and Genetic Algorithm","285368601":"Engineering Optimization","221148467":"An Evolutionary Approach for Pareto-optimal Configurations in SOC Platforms","216771829":"Multicriteria optimization with a multiobjective golden section line search","220601657":"Sorzano, C.O.S., Marabini, R., Herman, G.T. \u0026 Carazo, J.M. Multiobjective algorithm parameter optimization using multivariate statistics in three-dimensional electron microscopy reconstruction. Pattern Recognit. 38, 2587-2601","220742920":"A Specialized Island Model and Its Application in Multiobjective Optimization","225379663":"On Polydispersity of Plant Biomass Recalcitrance and Its Effects on Pretreatment Optimization for Sugar Production","262641541":"Multi-Objective Genetic Algorithm for voltage stability enhancement using rescheduling and FACTS devices","46615266":"Multi-objective optimization with iterated density estimation evolutionary algorithms using mixture models","216300737":"On the convergence of multiobjective evolutionary algorithms","220894479":"Quantum-Inspired Immune Clonal Multiobjective Optimization Algorithm","224396613":"A Decade of Kasabov\u0027s Evolving Connectionist Systems: A Review","226102621":"Multi-objective Optimization with the Naive \n\nID\nA","222414185":"A Survey on Search-Based Software Design","256968545":"Optimal design of actively controlled adjacent structures for balancing the mutually conflicting objectives in design preference aspects","36174354":"Weapon release scheduling from multiple-bay aircraft using multi-objective evolutionary algorithms /","220200234":"Feature-based classifier ensembles for diagnosing multiple faults in rotating machinery","277551294":"DYNA Issue 190 - April of 2015","2846748":"Using Genetic Algorithms in Industry -- Art or Science?","220665104":"Internal combustion engine control for series hybrid electric vehicles by parallel and distributed genetic programming/multiobjective genetic algorithms","267804620":"Hybrid Multiobjective Evolutionary Algorithm Based Technique for Economic Emission Load Dispatch Optimization Problem","222956918":"A multiobjective genetic algorithm approach to the optimization of the technical specifications of a nuclear safety system","223886617":"Development of optimal design formula for bi-tuned mass dampers using multi-objective optimization","253665116":"Optimum design of an automotive inner door panel with a tailor-welded blank structure","272640002":"Application of Polynomial Chaos Expansion to Tolerance Analysis and Synthesis in Compliant Assemblies Subject to Loading","245366488":"Applying Multiobjective Cost and Weight Optimization to the Initial Design of Turbine Disks","221228392":"A New Memory Based Variable-Length Encoding Genetic Algorithm for Multiobjective Optimization.","2615407":"A Pareto Frontier for Full Stern Submarines via Genetic Algorithm","228691433":"Cross Entropy multiobjective optimization for water distribution systems design","278716628":"Sustainable performance oriented operational decision-making of single machine systems with deterministic product arrival time","220310891":"Design of mixed H","237897317":"Multi-objective optimisation of systems architectures for distributed aero-engine control systems","220384622":"Bi-objective scheduling for reentrant hybrid flow shop using Pareto genetic algorithm","237573735":"Metaheur¶‡sticas: una revision actualizada","220951909":"Scalable space/time-shared stream-processing on the run-time reconfigurable PCA architecture.","242382369":"STATE-OF-THE-ART MULTIOBJECTIVE EVOLUTIONARY ALGORITHMS—PARETO PANKING, DENSITY ESTIMATION AND DYNAMIC POPULATION","251823958":"Multiobjective Evolutionary Algorithm Based on Dynamic Encoding and Population Isolating","235955781":"Interactive enhanced particle swarm optimization: A multi-objective reliability application","257726218":"Fuzzy Genetic Versus PSO Algorithms for the Synthesis of Linear Antenna Array","2248820":"Use of Substitute Scalarizing Functions to Guide a Local Search Based Heuristic: The Case of moTSP","261316549":"Searching a multicellular model to tame tumor-induced angiogenesis","222094692":"Multiobjective optimization using evolutionary algorithms","222262627":"Environmental/Economic power dispatch problem using multi-objective differential evolution algorithm","221228402":"Fuzzy-Pareto-Dominance and its Application in Evolutionary Multi-objective Optimization","223431951":"Multiobjective genetic optimization of Earth–Moon trajectories in the restricted four-body problem","235832912":"An efficient Differential Evolution based algorithm for solving multi-objective optimization problems","225310002":"PSO (Particle Swarm Optimization): One Method, Many Possible Applications","237137475":"Diesel Engine Design using Multi-Objective Genetic Algorithm","3303504":"Pareto Evolutionary Neural Networks","3864668":"Multiobjective optimization techniques: a study of the energy minimization method and its application to the synthesis of ota amplifiers","2539598":"Multiobjective Optimization Using Dynamic Neighborhood Particle Swarm Optimization","262066166":"Multi-objective optimization of a rectangular air bearing by means of Genetic Algorithms","222094679":"Evolution Strategies for the Optimization of Microdevices","220386633":"Dynamic Techniques for Genetic Algorithm–Based Music Systems","220540244":"Multidimensional Exploration of Software Implementations for DSP Algorithms","280873166":"A direct verification argument for the Hamilton-Jacobi equation continuum limit of nondominated sorting","225172760":"Multi-criteria Manipulator Trajectory Optimization Based on Evolutionary Algorithms","230342094":"A human‐like numerical technique for design of engineering systems","220200299":"An oriented spanning tree based genetic algorithm for multi-criteria shortest path problems","261154788":"Tactical task allocation and resource management in non-stationary swarm dynamics","3930190":"Evolutionary path planning for autonomous air vehicles using multi-resolution path representation","265965484":"Urban Greening Using an Intelligent Multi-Objective Location Modelling with Real Barriers: Towards a Sustainable City Planning","277295345":"Evolutionary Algorithms: Overview, Methods and Operators.” Documentation for: Genetic Evolutionary Algorithm Toolbox for Use with Matlab version: toolbox 1.92 documentation 1.92","220742992":"Monotonic solution concepts in coevolution","223870254":"Effect of nonlinearities in the identification and fault detection of gear-pair systems. Int J Non Lin Mech","229914061":"Development of new concepts for the control of polymerization processes: Multiobjective optimization and decision engineering. I. Application to emulsion homopolymerization of styrene","51960673":"Digital Ecosystems: Ecosystem-Oriented Architectures","271464528":"Solving multi-objective problems using SPEA2 and Tabu search","222561594":"Multi-objective optimization problems with fuzzy relation equation constraints","220702040":"On the Performance Assessment and Comparison of Stochastic Multiobjective Optimizers.","7815415":"Yazdi M, Gingras L, Beaulieu L. An adaptive approach to metal artifact reduction in helical computed tomography for radiation therapy treatment planning: experimental and clinical studies","221228461":"MOLeCS: Using Multiobjective Evolutionary Algorithms for Learning","216300646":"Multi-Objective Artificial Immune System for Optimization in Electrical Engineering","225617398":"Multiobjective Search Algorithm with Subdivision Technique","257636319":"Differential evolution based soft optimization to attenuate vane–rotor shock interaction in high-pressure turbines","221228453":"A Multiobjective Evolutionary Algorithm for Deriving Final Ranking from a Fuzzy Outranking Relation","263976753":"Optimal assembly of support vector regressors with application to system monitoring","276060415":"Simultaneous Evolution of Neural Controllers for Multi Robot Formation Control","242104037":"Interval-valued GAP algorithms","29444431":"Multiple Objective Fitness Functions for Cognitive Radio Adaptation","36418212":"Extended Evolutionary Algorithms for Multiobjective and Discrete Design Optimization of Structures","2660538":"Two New Approaches to Multiobjective Optimization Using Genetic Algorithms","262373169":"A Multi-objective, Active Fuzzy Force Controller in control of Flexible Wiper System","270454925":"Effective multiobjective EDA for bi-criteria stochastic job-shop scheduling problem","2635966":"A Multi-Objective Optimisation Methodology Applied to the Synthesis of Low-Power Operational Amplifiers","228980029":"Distributed Cooperation Model of Multi Objective Genetic Algorithms","36410034":"Web Service Composition Systems for the Web Service Challenge - A Detailed Review","4223194":"Optimal Placement for Opportunistic Cameras Using Genetic Algorithm","221228468":"Constraint Method-Based Evolutionary Algorithm (CMEA) for Multiobjective Optimization.","222823892":"Multiobjective design of Work-In-Process buffer for scheduling repetitive building projects","221230512":"GA-Based Solutions Comparison for Storage Strategies Optimization for an Automated Warehouse","231712109":"Design of a High Fragment Efficiency Library by Molecular Graph Theory","290623990":"A bi-objective approach for scheduling ground-handling vehicles in airports","283334726":"Systems poised to criticality through Pareto selective forces","200047434":"Financial Services Advisory - Individualisation and the role of Customer Data","222143898":"Combining game theory and genetic algorithms with application to DDM-nozzle optimization problems","277751845":"Using Multiobjective Genetic Programming to Infer Logistic Polynomial Regression Models [and] Experimental Supplement","222574063":"Abido, M.A.: A Novel Multiobjective Evolutionary Algorithm for Environmental / Economic Power Dispatch. Electric Power Systems Research 65(1), 71-81","221228420":"Combining Linear Programming and Multiobjective Evolutionary Computation for Solving a Type of Stochastic Knapsack Problem.","222080407":"Immune optimization algorithm for constrained nonlinear multiobjective optimization problems","37245588":"Metaheuristic and Multiobjective Approaches for Space Allocation","228427058":"The practitioner\u0027s role in competent search and optimization using genetic algorithms","265985909":"A Hybrid Optimization Technique Coupling an Evolutionary and a Local Search Algorithm for Economic Emission Load Dispatch Problem","228932881":"Use of dominance-based tournament selection to handle constraints in genetic algorithms","225783245":"Selective breeding in a multiobjective genetic algorithm","221228438":"Dynamic Archive Evolution Strategy for Multiobjective Optimization.","268435267":"Uma Abordagem Evolutiva Multi-Objectivo para o Problema de Compensação de Energia Reactiva em Redes de Distribuição de Energia Eléctrica","284887111":"Solving Highly-Dimensional Multi-Objective Optimization Problems by Means of Genetic Gender","43188782":"Algoritmos evolutivos y preferencia del decisor aplicados a problemas de optimización multiobjetivos discretos","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","237276826":"Applying Multiobjective Evolutionary Algorithms in Industrial Projects","259137484":"Particle swarm optimization with increasing topology connectivity","2570392":"A Mathematical Framework for the Study of Coevolution","245435934":"Comparison of Several Optimization Strategies for Robust Turbine Blade Design","228953445":"Semantic Repositories for Service Provision: An Approach to Enhance the Business Perspective","220204512":"Supply Estimation Using Coevolutionary Genetic Algorithms in the Spanish Electrical Market","37243640":"Etude énergétique des instabilités thermo-acoustiques et optimisation génétique des cinétiques réduites.","42107458":"Optimization as an alternative in search of sustainable technological processes","4090111":"A multi-objective GA-Simplex hybrid approach for gene regulatory network models","220696037":"Advances in Evolutionary Algorithms: Theory, Design and Practice.","221228523":"Multiobjective Evolutionary Algorithms Applied to the Rehabilitation of a Water Distribution System: A Comparative Study","220462567":"A unified framework for population-based metaheuristics","28127592":"Multiobjective evolutionary algorithms: Pareto rankings","229045603":"Optimal decision making in ventilation control","229582186":"Simultaneous Optimization of Luminance and Color Chromaticity of Phosphors Using a Nondominated Sorting Genetic Algorithm","274139295":"Multi-objective optimization for plant germplasm collection conservation of genetic resources based on molecular variability","242382523":"Multi-Objective Evolutionary Optimization of Gas Turbine Components","239742598":"1 Evolutionary and Neural Synthesis of Intelligent Agents","233045294":"Engineering design optimization using swarm with an intelligent information sharing among individuals","226610511":"Assessment Methodologies for Multiobjective Evolutionary Algorithms","251620913":"Optimization of the inspection intervals of a safety system in a nuclear power plant by Multi-Objective Differential Evolution (MODE)","261261122":"A MIMO RADAR design procedure from an antenna perspective","274364554":"A genetic algorithm for the one-dimensional cutting stock problem with setups","2242801":"A New Approach for the Solution of Multiple Objective Optimization Problems Based on Reinforcement Learning","228838774":"A multi-objective evolutionary algorithm with a separate archive","220698096":"A Multiobjective Evolutionary Approach for Multisite Mapping on Grids","45863523":"A multiobjective Tabu framework for the optimization and evaluation of wireless systems","221228534":"Recombination of Similar Parents in EMO Algorithms","220384760":"Multi-objective two-sided mixed-model assembly line balancing using particle swarm optimisation with negative knowledge","282845185":"Optimal sensor placement under uncertainties using a nondirective movement glowworm swarm optimization algorithm","239560346":"Optimal VAR Dispatch Using Strength Pareto Evolutionary Algorithm","228658556":"Boosting of fuzzy models for high-dimensional imprecise datasets","2894065":"Infused Evolutionary Learning","4090083":"Interactive multi-participant tour allocation","276060331":"Multiple Robots Formation – A Multiobjctive Evolution Approach","44620360":"Multiobjective Optimization Approach: Thermal Food Processing","6975624":"Multi-Objective Genetic Algorithm-Based Sample Selection for Partial Least Squares Model Building with Applications to Near-Infrared Spectroscopic Data","224705927":"Cognitive Radio Formulation and Implementation","220741068":"On identifying global optima in cooperative coevolution","10809411":"A computational model of symbiotic composition in evolutionary transitions","2599118":"Tabu Search for Multiobjective Optimization: MOTS","221144519":"Fuzzy Multi-objective Evaluating Method for Hybrid Assembly Line Design","276498583":"Three-Objective Programming with Continuous Variable Genetic Algorithm","2439369":"Approximating the Pareto Set: Concepts, Diversity Issues, and Performance Assessment","228484466":"Evolutionary Computation in Ada95: A Genetic Algorithm approach","269134054":"Using Electimize to Solve the Time-Cost-Tradeoff Problem in Construction Engineering","221228511":"Pareto-Front Exploration with Uncertain Objectives","237610712":"Alinguisticdecisionmodelforpersonnelmanagementsolved withalinguisticbiobjectivegeneticalgorithm","273481916":"Preventive maintenance and replacement optimization on CNC machine using multiobjective evolutionary algorithms","266176302":"A Robust Approach for Optimization – NS-NR I Part II: Algorithm and Applications","220743133":"Approaches Based on Genetic Algorithms for Multiobjective Optimization Problems.","3868878":"Evolvable hardware: on the automatic synthesis of analog control systems","226622839":"Performance Scaling of Multi-objective Evolutionary Algorithms","220306903":"A constraint-based approach to feasibility assessment in preliminary design","220204505":"Towards Combinatorial Analysis, Adaptation, and Planning of Human-Computer Systems","224177573":"An Interactive Territory Defining Evolutionary Algorithm: iTDEA","235431665":"Taguchi\u0027s method for multi-objective optimization problems","2474206":"A Genetic Algorithm Approach to Focused Software Usage Testing","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","221228500":"Global Multiobjective Optimization with Evolutionary Algorithms: Selection Mechanisms and Mutation Control","221523407":"Evaluation and Comparison of Inferred Regular Grammars","257580966":"Hub network design problem in the presence of disruptions","222662075":"Multiobjective optimization by genetic algorithms: Application to safety systems","282316845":"Multi-objective Optimization of Welding Parameters in Submerged Arc Welding of API X65 Steel Plates","228363619":"An adaptive hyperplane approach for multiple objective optimization problems with complex constraints","256919471":"Multiobjective Optimization of Trusses Using Genetic Algorithms","225256850":"On The Effects of Archiving, Elitism, and Density Based Selection in Evolutionary Multi-objective Optimization","221008940":"Evolutionary Multi-objective Optimization of Particle Swarm Optimizers","222393408":"Method to improve multiobjective genetic algorithm optimization of a self-fuel-providing LMFBR by niche induction among nondominated solutions","225688695":"Decentralized Cooperative Optimization for Multi-criteria Decision Making","225772657":"Elastohydrodynamic analysis and Pareto optimization of intact, worn and misaligned journal bearings","228979872":"Optimal Combined Economic and Emission Load Dispatch using Modified NSGA-II with Adaptive Crowding Distance","220265511":"Improving NSGA-II Algorithm Based on Minimum Spanning Tree","222415944":"Combining deliberative and computer-based methods for multi-objective land-use planning","245391277":"Parameter optimization of a hydraulic engine mount based on a genetic neural network","224156749":"Fast genetic algorithm for bits allocation in OFDM based cognitive radio systems","29974747":"Apprentissage de fonctions visuelles pour un robot mobile par programmation génétique","225174648":"Multiobjective Optimization by a Modified Artificial Immune System Algorithm","237596476":"多目的最適化と情報可視化データマイニング Multiobjective Optimization and Data Mining by Information Visualization","266874608":"Precision Evolutionary Optimization Part II: Implementation and Applications","288954402":"Handling Constraints in Genetic Algorithms Using Dominance-based Tournaments","229678252":"Genetic Algorithms","220585019":"A new parallel-by-cell approach to undistorted data compression based on cellular automaton and genetic algorithm","2584888":"An Evolutionary Algorithm for Multiobjective Optimization: The Strength Pareto Approach","221137934":"Class-Based OSPF Traffic Engineering Inspired on Evolutionary Computation.","229026948":"Designing a new elitist nondominated sorted genetic algorithm for a multiobjective long term groundwater monitoring application","12794343":"Anatomy-based three-dimensional dose optimization in brachytherapy using multiobjective genetic algorithms","239564640":"the Pareto Set: Concepts, Diversity Issues, and Performance Assessment","257635955":"Multi-objective GA with fuzzy decision making for security enhancement in power system","250890204":"Mealy finite state machines: An evolutionary approach","224056435":"Multi-Objective Models for Scheduling Jobs on Parallel Computer Systems","2519305":"Extensions to the Strength Pareto Evolutionary Algorithm.","245088171":"A Study of Global Convexity for a Multiple Objective Travelling Salesman Problem","251815475":"Applications of laser-plasma electron accelerators:point-scanning radiotherapy and high resolution radiography of dense objects","242501445":"Evolutionary Computation in Combinatorial Optimization, 10th European Conference, EvoCOP 2010, Istanbul, Turkey, April 7-9, 2010. Proceedings","216301015":"Self Adaptation and Convergence of Multiobjective Evolutionary Algorithms in Continuous Search Spaces","282538466":"A Novel Bioinspired Multiobjective Optimization Algorithm for Designing Wireless Sensor Networks in the Internet of Things","238720780":"Multi-Objective Swarm Intelligent Systems - Theory \u0026 Experiences","228697239":"Data mining and decision making","221352966":"Creating personalized documents: An optimization approach","222827635":"A new multiobjective evolutionary algorithm","262774418":"Standardization of Potting Mix and Pot Volume for the Production of Vegetable Seedlings in Paper Pot","3113235":"Multiobjective Memetic Algorithms With Quadratic Approximation-Based Local Search for Expensive Optimization in Electromagnetics","220290079":"Searching for multi-objective preventive maintenance schedules: combining preferences with evolutionary algorithms. Eur J Oper Res","2601319":"Artificial Evolution of Active Filters: A Case Study","225256493":"Optimizing Resource Usage in Component-Based Real-Time Systems","277590475":"Optimal stabilization of a flow past a partially hydrophobic circular cylinder","220742761":"Fuzzy Dominance Based Multi-objective GA-Simplex Hybrid Algorithms Applied to Gene Network Models","2376039":"A Multiobjective Evolutionary Setting for Feature Selection and a Commonality-Based Crossover Operator","224644128":"A new method of system reliability multi-objective optimization using genetic algorithms","10840545":"Optimizing the Size and Configuration of Combinatorial Libraries","226151486":"Regression Error Characteristic Optimisation of Non-Linear Models","4309252":"Optimal Combined Non-convex Economic and Emission Load Dispatch Using NSDE","286765138":"Multidisciplinary design and optimization of the twin-web turbine disk","4301063":"Deriving Quantitative Structure-Activity Relationship Models Using Genetic Programming for Drug Discovery","226589894":"Multiobjective Particle Swarm Optimization for Optimal Power Flow Problem","273504516":"Memetic algorithm with Preferential Local Search using adaptive weights for multi-objective optimization problems","285929539":"Solving water resources allocation problems using heuristic-based methods","228404439":"Game model based co-evolutionary solution for multiobjective optimization problems","225573946":"Accurate, Transparent, and Compact Fuzzy Models for Function Approximation and Dynamic Modeling through Multi-objective Evolutionary Optimization","220701802":"Preference-Based Multi-Objective Particle Swarm Optimization Using Desirabilities","4303121":"Robot task switching in complex environments","267204287":"A Genetic Algorithm Approach to Exploring Simulation Parameters","3864942":"Handling preferences in evolutionary multiobjective optimization: A survey","221006969":"A new performance metric for multiobjective optimization: The integrated sphere counting","3807597":"Multi-objective design strategy for high-level low power design of DSP systems","33680214":"Constructing strategies in strategic planning: a decision support evaluation model","44608496":"A Multi-Objective Optimization Based-Approach for Discovering Novel Cancer Therapies.","222866449":"Basu, M.: Dynamic economic emission dispatch using nondominated sorting genetic algorithm-II. Int. J. Electr. Power Energy Syst. 30(2), 140-149","273111325":"The bi-objective Pollution-Routing Problem","3903841":"Evolution strategies for the optimization of microdevices","277334493":"Phase transitions in Pareto optimal complex networks","33680221":"A Decision Support Tool Coupling a Causal Model and a Multi-objective Genetic Algorithm","257635846":"Repeated weighted boosting search for discrete or mixed search space and multiple-objective optimisation","28600555":"Optimal Reservoir Operation Using Multi-Objective Evolutionary Algorithm","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","33680224":"Two Complexities and a Few Models","283271553":"Disassembly Sequencing Using Tabu Search","32897169":"A Logical Framework for Template Creation and Information Extraction","4940076":"An empirical study on similarity-based mating for evolutionary multiobjective combinatorial optimization. Eur J Oper Res","273754422":"An effective modified binary particle swarm optimization (mBPSO) algorithm for multi-objective resource allocation problem (MORAP)","33680233":"Creating future scenarios for strategic territorial\nplanning: methodologies, tools, examples","256970301":"The active–reactive – Complete dispatch of an electrical network","220398669":"Humanoid Robot Motion Planning - a Multiple Constrains Approach.","260671225":"Postoptimality Pareto-Robustness Analysis of an Earth-Observation Satellite Mission","282532263":"Constrained Reactive Power Control (CRPC) Based Multi-Objective Optimization under Multi-Contingencies ( N-m )","220470352":"WBMOAIS: A novel artificial immune system for multiobjective optimization","3139930":"Selecting features for nuclear transients classification by means of genetic algorithms","228582633":"Evolutionary algorithms in control systems engineering: a survey. Control Eng Pract","224306216":"Multiobjective Particle Swarm Algorithm With Fuzzy Clustering for Electrical Power Dispatch","254230097":"Adaptive multi-objective archive-based hybrid scatter search for segmentation in lung computed tomography imaging","216300947":"Capacitated Network Design Considering Survivability: An Evolutionary Approach","226202636":"Mutiobjective Programming","230606016":"Comfort and energy consumption of hydronic heating radiant ceilings and walls based on CFD analysis","228584672":"A Survey of Multiobjective Optimization in Engineering Design","4309310":"A Novel Approach for the Analysis of Epileptic Spikes in EEG","280031695":"Multi-objective optimization in systematic conservation planning and the representation of genetic variability among populations","2513316":"A Prescriptive Formalism for Constructing Domain-specific Evolutionary Algorithms","220048542":"Evolutionary Computation in Combinatorial Optimization","3770814":"Synthesis of CMOS operational amplifiers through genetic algorithms","222080176":"IT-CEMOP: An iterative co-evolutionary algorithm for multiobjective optimization problem with nonlinear constraints","216300905":"Multi-Objective Optimization by Means of the Thermodynamical Genetic Algorithm","280705334":"A Clustering Based Archive Multi Objective Gravitational Search Algorithm","220869796":"Enhance Neural Networks Training Using GA with Chaos Theory","228858934":"Multiobjective Optimization Using Clustering Based Two Phase PSO","258162423":"Multi-objective optimization for actuator and sensor layouts of actively controlled 3D buildings","2646461":"Multiobjective Evolutionary Algorithm Research: A History and Analysis","228858930":"A New, Clustering Evolutionary Multi-Objective Optimisation","280176939":"Modeling and Genetic Solution for Scheduling Problems with Regular and Non-Regular Objective Functions","2566591":"A Thorough Documentation of Obtained Results on Real-Valued Continuous And Combinatorial Multi-Objective Optimization Problems Using Diversity Preserving Mixture-Based Iterated Density Estimation Evolutionary Algorithms","227003420":"Multiobjective Combinatorial Optimization — Theory, Methodology, and Applications","228846653":"Modified predator-prey algorithm for constrained and unconstrained multi-objective optimisation","3903909":"A swarm with an effective information sharing mechanism for unconstrained and constrained single objective optimisation problems","245077765":"Multiobjective optimal absorber system for torsionally coupled seismically excited structures. Eng Struct","3418513":"Evolutionary Computation: Comments on the History and Current State","265600636":"Simulation-based optimization of sampling plans to reduce inspections while mastering the risk exposure in semiconductor manufacturing","240685041":"Genetic Optimization of Multidimensional Technological Process Reliability","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","255649430":"Multiobjective Optimal Waste Load Allocation Models for Rivers Using Nondominated Sorting Genetic Algorithm-II","264453742":"Multi-objective framework for structural model identification","282575226":"From Ecological Modeling to Decentralized Optimization of Smart Power Grids","3418522":"Hybrid genetic algorithms for constrained placement problems","220361874":"Multiobjective optimization using an immunodominance and clonal selection inspired algorithm","220306576":"Self-regulatory hierarchical coevolution","4059534":"A multi-fault minimum cost spare capacity assignment of communication networks: a comparison between traditional genetic and niching algorithms","220462230":"A Simulated Annealing Genetic Algorithm for the Electrical Power Districting Problem","257697513":"Multiobjective vehicle routing problem with fixed delivery and optional collections","268183115":"Precision Evolutionary Optimization Part I: Nonlinear Ranking Approach","37762039":"The Crew-Scheduling Module in the GIST System","4913650":"A bi-objective genetic algorithm approach to risk mitigation in project scheduling","269576617":"A combinatorial algorithm for the cardinality constrained portfolio optimization problem","2918805":"Feature Selection and Classifier Ensembles: A Study on Hyperspectral Remote Sensing Data","226497594":"Recent Trends in Evolutionary Multiobjective Optimization","260939312":"Analysis and optimization of hybrid electric vehicle thermal management systems","3418507":"A parallel genetic algorithm for performance-driven VLSI routing","216300837":"Mating Scheme for Controlling the Diversity-Convergence Balance for Multiobjective Optimization","233600046":"A Genetic Algorithm for the Generalised Assignment Problem","271880689":"Memetic algorithms and memetic computing optimization: A literature review","228447322":"Efficient Optimization of Reliable Two-Node Connected Networks: A Biobjective Approach","264154745":"Information entropy based algorithm of sensor placement optimization for structural damage detection","241170326":"Registration of unorganized points data under different viewpoints based on improved evolutional algorithm","237129710":"Cost-Based Filtering for Determining the Pareto Frontier","220413167":"Optimizing the Door Assignment in LTL-Terminals","2410986":"Genetic Algorithms In Computer-Aided Design Of Robotic Manufacturing Cells","2243052":"A Resource Planner for Hybrid Assembly Lines","47633177":"Penalized likelihood and multi-objective spatial scans for the detection and inference of irregular clusters","267402815":"A Multi-Objective Approach for Buffer Allocation in General Queueing Networks","225422496":"The Relation Between Complete and Incomplete Search","227177541":"Evolutionary Approaches for Optimisation Problems","230605932":"Topological Optimum Design with Evolutionary Algorithms","220200140":"Multi-objective nature-inspired clustering and classification techniques for image segmentation","11055484":"Multiobjective Optimization in Quantitative Structure−Activity Relationships: Deriving Accurate and Interpretable QSARs","228916339":"Cellular genetic algorithm for multi-objective optimization","250029887":"Adaptive Weighted Sum Method for Bi-objective Optimization","223609996":"An ɛ-dominance-based multiobjective genetic algorithm for economic emission load dispatch optimization problem","3455466":"Evolutionary multi-objective optimization: A historical view of the field","245286721":"Multiobjective Optimal Fuzzy Logic Control System for Response Control of Wind-Excited Tall Buildings","3418581":"Interval-valued GA-P algorithms","2918861":"An Empirical Study on the Effect of Mating Restriction on the Search Ability of EMO Algorithms","252532462":"Three-Objective Genetic Algorithms for Designing Compact Fuzzy Rule-Based Systems for Pattern Classification Problems","2390467":"Evolutionary Computation and Data Mining","4035029":"Process-variability aware delay fault testing of ΔVT and weak-open defects","220095734":"A class of multiobjective linear programming models with random rough coefficients","4049364":"Dynamic population strategy assisted Particle Swarm Optimization","222287061":"A multi-objective selection procedure of determining a Pareto set","222600366":"On the potential of genetic algorithms in urban drainage modeling","4035031":"Modeling Feedback Bridging Faults with Non-Zero Resistance","287930565":"Comparative study on multi-objective genetic algorithms for seismic response controls of structures","226436240":"Ontologies in Bioinformatics and Systems Biology","223794340":"Solution of constrained optimization problems by multi-objective genetic algorithm. Comp","3903951":"Study of population diversity of multiobjective evolutionary algorithm based on immune and entropy principles","46101318":"Supervised image segmentation using watershed transform, fuzzy classification and evolutionary computation","221275338":"Evolutionary Computation: An Overview.","3418574":"Explorations in design space: unconventional electronics design through artificial evolution. IEEE Trans Evolut Comput","228621403":"A generalized multiobjective particle swarm optimization solver for spreadsheet models: application to water quality","234001421":"Coordinating strategic outsourcing decisions for semiconductor assembly using a bi-objective genetic algorithm","221531339":"Symbiotic Composition and Evolvability.","220558554":"An adaptive decision maker for constrained evolutionary optimization","253629724":"DESIGN OF FUZZY CLASSIFICATION SYSTEMS BY CELLULAR MULTI-OBJECTIVE GENETIC ALGORITHMS","236166161":"Genetic algorithm in locating the optimum mid-connection of Off-Centre braced system","224610150":"Evolutionary Schemes for Cognitive Radio Adaptation","228421530":"Using Evolutionary Algorithms to Improve Tactics, Techniques and Procedures in Peace Support Operations","227170189":"Stochastic Method for the Solution of Unconstrained Vector Optimization Problems","275257952":"A novel Hybrid multi-objective immune algorithm with adaptive differential evolution","3217977":"Fuzzy scheduling control of a gas turbine aero-engine: A multiobjective approach","216301293":"Liew, K.: A Swarm Metaphor for Multiobjective Design Optimization. Engineering Optimization 34, 141-153","3865137":"A non-generational genetic algorithm for multiobjective optimization","220507951":"Unsatisfying functions and multiobjective fuzzy satisfaction design using genetic algorithms.","237745191":"Thai Sentence Parsing using Genetic Programming","2478633":"Pareto Evolutionary Neural Networks","2241068":"Evolutionary Algorithm Based Exploration of Software Schedules for Digital Signal Processors","264386000":"Characterization of the gas–magmatic outflow at a volcanic vent through integral-equation based inverse acoustics","277656222":"Globally convergent evolution strategies for constrained optimization","222211885":"A novel evolution strategy for multiobjective optimization problem","223866692":"A class of multi-objective expected value decision-making model with birandom coefficients and its application to flow shop scheduling problem","265401796":"MULTIOBJECTIVE PARTICLE SWARM OPTIMIZATION: INTEGRATION OF DYNAMIC POPULATION AND MULTIPLE-SWARM CONCEPTS AND CONSTRAINT HANDLING","3865133":"MOEA Toolbox for Computer Aided Multi-Objective Optimization","221521709":"The Forecasting of China Natural Gas Consumption Based on Genetic Algorithm","220204803":"Parallel clustering of high dimensional data by integrating multi-objective genetic algorithm with divide and conquer","228812677":"Game theory based coevolutionary algorithm: A new computational coevolutionary approach","225699669":"Multi-objectives optimal model of heavy equipment using improved Strength Pareto Evolutionary Algorithm","224503625":"A Novel Clonal Algorithm for Multiobjective Optimization","3418653":"Parameter optimization of an on-chip voltage reference circuit using evolutionary programming","49660127":"Note: Multivariate system spectroscopic model using Lorentz oscillators and partial least squares regression analysis","3865105":"A multiobjective evolutionary setting for feature selection and a commonality-based crossover operator","269048357":"Integration of Monte Carlo Simulation and Genetic Algorithms for Sustainable Designs Analysis","3418649":"Planning multiple paths with evolutionary speciation","241101936":"Optimization of waste stabilization pond design for developing nations using computational fluid dynamics","277850784":"Optimización multiobjetivo usando un micro algoritmo genético","268266959":"Improved Genetic Operators for the Multiobjective Generalized Assignment Problem","222697333":"Constraint-handling in genetic algorithms through the use of dominance-based tournament selection","264183180":"Combined Economic and Emission Dispatch with Valve-point loading of Thermal Generators using Modified NSGA-II","265786851":"PID-type Fuzzy Logic Controller for Active Magnetic Bearing System","247926003":"An innovative perspective on mapping in grids","236031013":"Predictive data-driven modeling approaches in environmental management decision-making","235297842":"Intelligent Multi-Objective Nonlinear Model Predictive Control (iMO-NMPC): Towards the ‘on-line’ optimization of highly complex control problems","267816384":"Multi-objective test prioritization via a genetic algorithm","249785563":"A-Design: Theory and Implementation of an Adaptive, Agent-Based Method of Conceptual Design","3865091":"A multiobjective genetic algorithm for radio network optimization","223176566":"Two‐phase sub population genetic algorithm for parallel machine-scheduling problem","233988047":"A novel hybrid mechanistic-data-driven model identification framework using NSGA-II","221148944":"Multiobjective Differential Evolution for Mapping in a Grid Environment","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","268894787":"Parallel Evolutionary Computation for Solving Complex CFD Optimization Problems : A Review and Some Nozzle Applications","239541250":"MULTIOBJECTIVE VISIBLE SPECTRUM OPTIMIZATION: A GENETIC ALGORITHM APPROACH","222981900":"Pareto-based evolutionary computational approach for wireless sensor placement","228990958":"Robustness Analysis in Evolutionary Multi-Objective Optimization","2249323":"Evolutionary Algorithms for Multi-Criterion Optimization in Engineering Design","223356697":"Prediction and simulation errors in parameter estimation for nonlinear systems","3418750":"Dynamic multiobjective evolutionary algorithm: Adaptive cell-based rank and density estimation","229545955":"Multi‐objective optimal design of FLC driven hybrid mass damper for seismically excited structures","4219405":"Evolutionary multi-objective optimization: current state and future challenges","48353452":"Optimised configuration of sensing elements for control and fault tolerance applied to an electro-magnetic suspension system","224442158":"Multi-Objective Optimal Power Flow Using Differential Evolution","286692185":"The Maximin Fitness Function for Multiobjective Evolutionary Optimization","255571305":"Buffer Allocation and Throughput Trade-off in General Queueing Networks","221007743":"A Genetic Algorithm for Multiobjective Training of ANFIS Fuzzy Networks","223584006":"Genetic algorithm for the personnel assignment problem with multiple objectives","221161337":"Selection Strategies of Evolutionary Algorithms in Multiobjective Optimization","2423421":"Representing Space: A Hybrid Genetic Algorithm for Aesthetic Graph Layout","240919559":"A model for spatio-temporal network planning","3842662":"Bandwidth Allocation for Virtual Paths (BAVP): Investigation of performance of classical constrained and genetic algorithm based optimization techniques","224075526":"Multiobjective optimization design via genetic algorithm","228851709":"An implementation of Pareto optimality in CLP (FD)","3930715":"Evolutionary algorithms for navigation of underwater vehicle","225156875":"Identification of multibody vehicle models for crash analysis using an optimization methodology","3418709":"A weighted sum genetic algorithm to support multiple-party multi-objective negotiations","263626196":"NSGA-II Technique for Multi-objective Generation Dispatch of Thermal Generators with Nonsmooth Fuel Cost Functions","220380993":"Multiobjective Optimization of Safety Related Systems: An Application to Short-Term Conflict Alert.","3865182":"A new constraint tournament selection method for multicriteria optimization using genetic algorithm","242387990":"OPTIMAL PERMUTATION CORRECTION BY MULTIOBJECTIVE GENETIC ALGORITHMS","255790427":"Improved optimization of the Fourier transform ion cyclotron resonance mass spectrometry phase correction function using a genetic algorithm","284013192":"New version of a multi-algorithm genetically adaptive for multiobjective optimization","227065838":"Entropy-based multi-objective genetic algorithm for design optimization","269705851":"Gross parameters prediction of a granular attached biomass reactor through evolutionary polynomial regression","220606287":"A Port System Simulation Facility With An Optimization Capability.","225517339":"Robust and stable scheduling of a single machine with random machine breakdowns","3699283":"Multiobjective robust control using evolutionary algorithms","226723821":"A multiple objective grouping genetic algorithm for assembly line design","3865173":"Nash Genetic Algorithms: Examples and applications","2239056":"On Interactive Neighbourhood Search Schedulers","257402149":"Contrast optimization of two-photon processes after a microstructured hollow-core fiber demonstrated for dye molecules","220381009":"Cluster Guide Particle Swarm Optimization (CGPSO) for Underdetermined Blind Source Separation With Advanced Conditions","220381014":"Using unconstrained elite archives for multiobjective optimization","240792622":"Multiobjective contaminant response modeling for water distribution systems security","3453516":"Improving the Real-Time Behavior of Ethernet Networks Using Traffic Smoothing","242383882":"TCHEBYCHEFF METHOD-BASED EVOLUTIONARY ALGORITHM FOR MULTIOBJECTIVE OPTIMIZATION","221765453":"Multi-Objective Optimization with Estimation of Distribution Algorithm in a Noisy Environment","3418697":"Jaszkiewicz, A.: On the Performance of Multiple-Objective Genetic Local Search on the 0/1 Knapsack Problem - A Comparative Experiment. IEEE Trans. on Evolutionary Computation 6, 402-412","245134561":"Using genetic algorithms for calibrating simplified models of nuclear reactor dynamics","229349334":"Performance assessment of multicriteria damage identification genetic algorithms","233236376":"MOSES: A multiobjective tool for engineering design","233045916":"On Maximizing Solution Diversity in a Multiobjective Multidisciplinary Genetic Algorithm for Design Optimization","223719210":"Designing cellular networks using a parallel hybrid metaheuristic on the computational grid. Comput Commun","277478134":"Heat utilisation technologies: A critical review of heat pipes","242619638":"No Optimisation Without Representation: A Knowledge Based Systems View of Evolutionary/Neighbourhood Search Optimisation","4127422":"The multi-objective optimization of beam pattern in the nonuniform array antenna using the evolutionary algorithm","2632362":"A New Distributed Reinforcement Learning Algorithm for Multiple Objective Optimization Problems","255667646":"An Introduction and Companion to the Third Workshop on Multiobjective Problem Solving from Nature","227309327":"Multi-Objective Genetic Algorithms for Vehicle Routing Problem with Time Windows","227716881":"An Adaptative Multi-GPU based Branch-and-Bound. A Case Study: the\nFlow-Shop Scheduling Problem","216301164":"Evaluating Multi-criteria Evolutionary Algorithms for Airfoil Optimisation","4076212":"A novel multiobjective evolutionary algorithm for optimal reactive power dispatch problem","222562248":"Inexact graph matching using a genetic algorithm for image recognition","225693692":"Scheduling of Flow-Shop, Job-Shop, and Combined Scheduling Problems using MOEAs with Fixed and Variable Length Chromosomes","228763437":"A logical framework for template creation and information extraction: A technical report","4147884":"PC-based off-line programming using VRML for welding robots in shipbuilding","258797055":"A niched Pareto tabu search for multi-objective optimal design of groundwater remediation systems","258227698":"Multi-objective model for regional wastewater systems planning","257672653":"Multi-objective optimization to predict muscle tensions in a pinch function using genetic algorithm","232875897":"Multiobjective design optimization by an evolutionary algorithm","254014906":"A complete methodology for determining memory BIST optimization under wrappers sharing constraints","3418798":"A GA-Based Design Space Exploration Framework for Parameterized System-On-A-Chip Platforms","232650561":"Improved Multiobjective Maintenance Optimization of Aircraft Equipment Using Strength Pareto Genetic Algorithms with Immunity","279958067":"Some Single- and Multiobjective Optimization Techniques","220176258":"An intelligent information sharing strategy within a swarm for unconstrained and constrained optimization problems","220743605":"A Similarity-Based Mating Scheme for Evolutionary Multiobjective Optimization","226185189":"Computational Neuroscience for Cognitive Brain Functions","220555140":"A probability maximization model based on rough approximation and its application to the inventory problem","255034769":"Multicriteria Genetic Tuning for the Optimization and Control of HVAC Systems","2646668":"Genetic Algorithm with a Pareto Partitioning Method for Multiobjective Flowshop Scheduling","224118783":"Multi-objective Pareto Genetic Algorithms Using Fast Elite Updating","234024791":"Revealing spectral field features and mechanistic insights by control pulse cleaning","237741187":"The maxi-min fitness function for multi-objective evolutionary computation: Application to city planning","4870883":"A genetic-based framework for solving (multi-criteria) weighted matching problems","220204940":"Evolving dynamic Bayesian networks with multi-objective genetic algorithms. Appl Intell","2364041":"Multi-Objective Optimisation Based on Relation Favour","4233967":"Multi-objective Adaptive Scheme for Analog Circuit Design Based on Two-layer Genetic Programming","258237899":"Unwanted Noise and Vibration Control Using Finite Element Analysis and Artificial Intelligence","267640156":"Decomposition-based evolutionary algorithm for large scale constrained problems","220741528":"Automated Extraction of Problem Structure","3418757":"Rank-density-based multiobjective genetic algorithm and benchmark test function study","220284816":"An adaptive multisite mapping for computationally intensive grid applications","221144987":"Coordination Optimization-based Variable Structure Control for Main Steam Pressure of Power Plant.","245310505":"VIS: An artificial immune network for multi-objective optimization","3275401":"Electric Distribution Network Multiobjective Design Using a Problem-Specific Genetic Algorithm","3826307":"Effective design exploration through multi-objective high-level DSP synthesis","228609818":"Optimisation with hillclimbing on steroids: an overview of neighbourhood search techniques","49641550":"An integrative and practical evolutionary optimization for a complex, dynamic model of biological networks","243350589":"Optimising flat-walled multi-layered anechoic linings using evolutionary algorithms","7654089":"Neuronal Nicotinic Acetylcholine Receptor Agonists: Pharmacophores, Evolutionary QSAR and 3D-QSAR models","216301146":"Lecture Notes in Computer Science","279519849":"Backtracking search optimization based economic environmental power dispatch problems","265213196":"Multiobjective Memetic Estimation of Distribution Algorithm Based on an Incremental Tournament Local Searcher","220381153":"On the performance of multiple-objective genetic local search on the 0/1 knapsack problem—a comparative experiment","223741842":"Designing a risk-informed balanced system by genetic algorithms: Comparison of different balancing criteria","283505184":"Reducing the wasted transportation capacity of Personal Rapid Transit systems: An integrated model and multi-objective optimization approach","241177766":"Optimization of System-of-Systems architectures for maritime border control using Genetic Algorithms","254152161":"A Globus-Based Distributed Enumerative Search Algorithm for Multi-objective Optimization","229574504":"Multi‐objective highway alignment optimization using a genetic algorithm","228714345":"Multiobjective Simulated Annealing: A Comparative Study to Evolutionary Algorithms","222318472":"Online planning of multiaxial loading path for elastic material identification","220739553":"A Comparison of Evaluation Methods in Coevolution ABSTRACT","223041410":"Modeling and optimization of parameters of flow rate of paddy rice grains through the horizontal rotating cylindrical drum of drum seeder","254864890":"Rotordynamic Optimization of Large Turbo Systems using Genetic Algorithms","228085588":"Geração de Serviços de Motoristas através de Metaheuristicas - Sistema GIST ( The Gist system for public transportation: the bus-driver scheduling module)","222164977":"Multiobjective spare part allocation by means of genetic algorithms and Monte Carlo simulation","265506078":"Multiobjective Scheduling by Genetic Algorithms","2460395":"Evolving a Task Specific Image Operator","245306449":"Multiobjective Optimization for Pavement Maintenance Programming","24392635":"Exploring the capabilities of quantum optimal dynamic discrimination","4879003":"A multiobjective evolutionary algorithm for scheduling and inspection planning in software development projects","221024254":"Niching in Monte Carlo Filtering Algorithms","2861821":"Multi-Objective Benchmark Studies for Evolutionary Computation","245079117":"Optimal unit grouping in weighted voting systems","225820579":"Adaptive weighted sum method for multiobjective optimization: A new method for Pareto front generation","3019512":"The Pareto Optimization of Ultra-Wideband Polyfractal Arrays","220116934":"Knowledge Network Driven Coordination and Robust Optimization to Support Concurrent and Collaborative Parameter Design","258162105":"Wavelet-neuro-fuzzy control of hybrid building-active tuned mass damper system under seismic excitations","282665475":"Influence of demographics and service provision, accessibility and adequacy in hot and cold spots of depression in Catalonia","2480894":"Pareto Optimality in Coevolutionary Learning","229330806":"Performance of genetic programming to extract the trend in noisy data series","237296838":"A MULTIOBJECTIVE GENETIC ALGORITHM APPLIED TO MULTIVARIABLE CONTROL OPTIMIZATION","220741579":"An Evolutionary Algorithm for Constrained Optimization","236635385":"Logarithmic Quasi-distance Proximal Point Scalarization Method for Multi-Objective Programming","266863886":"APPLICATION OF EVOLUTIONARY COMPUTATION TO OPEN CHANNEL FLOW MODELLING","225380233":"Focusing versus Intransitivity Geometrical Aspects of Co-evolution","220176375":"Chaos-based multi-objective immune algorithm with a fine-grained selection mechanism","226135954":"Disassembly planning of mechanical systems for service and recovery: A genetic algorithms based approach","2616014":"Multicriteria Optimization with Export Rules for Mechanical Design","222681003":"Comparing state-of-the-art evolutionary multiobjective algorithms for long-term groundwater monitoring design. Advances in Water Resources, 29(6), 792-807","2681561":"Evolutionary Design and Multi-objective Optimisation","288629701":"Multi-Objective Optimization of Large Scale Vehicle Models Subjected to Road Excitation","275901056":"An Optimal Cellular Automata Algorithm for Simulating Wildfire Spread","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","245331052":"A multi-objective genetic algorithm approach to the design of cellular manufacturing systems","226017163":"The Pareto\n-Box Problem for the Modelling of Evolutionary Multiobjective Optimization Algorithms","224178088":"Nature-Inspired Design Techniques for Ultra-Wideband Aperiodic Antenna Arrays","265254203":"امکان سنجی توسعه منابع تولید پراکنده در شبکه توزیع با استفاده از الگوریتم NSGA-II","228409195":"Parallelism Support in SIMD/VLIW Image Processing Architectures","3865293":"Convergence Properties of Some Multi-Objective Evolutionary Algorithms","4164294":"Multiobjective optimal power flow using strength Pareto evolutionary algorithm","222414776":"A genetic algorithm approach to multiobjective land use planning","2945750":"Pareto Multi-Objective Non-Linear Regression Modelling to Aid CAPM Analogous Forecasting","228601695":"A novel multi-objective optimization methodology applied to the synthesis of cmos operational amplifiers","232623834":"Cognitive Radio Parameter Adaptation in Multicarrier Environment","3433276":"An evolutionary approach to designing complex spreading codes for DS-CDMA","257633363":"Optimal feeding profile for a fuzzy logic controller in a bioreactors using genetic algorithm","3812146":"Artificial evolution of active filters: a case study","223565403":"Optimal narrowband dispersionless fiber Bragg grating filters with short grating length and smooth dispersion profile","260248715":"Nurbs-iga-based modelling: Analysis and optimization of laminated plates","242257273":"CHAPTER 21 SENSITIVITY ANALYSIS IN MULTI-OBJECTIVE EVOLUTIONARY DESIGN","229039791":"COMPARATIVE STUDY OF SEVERAL MULTI-OBJECTIVE GENETIC ALGORITHMS","264058039":"Attributed multi-objective comprehensive learning particle swarm optimization for optimal security of networks","221228580":"Application of Multiobjective Evolutionary Algorithms for Dose Optimization Problems in Brachytherapy","2642725":"Evaluating the Quality of Approximations to the Non-Dominated Set","237122860":"Neuroevolution Based Artificial Bandwidth Expansion of Telephone Band Speech","234014434":"Metaheuristics: A Bibliography","238679336":"Agent-based Evolutionary Multiobjective","220063247":"Application of a niched Pareto genetic algorithm for selecting features for nuclear transients classification. Int J Intell Syst","232992497":"Preference-based maintenance planning for deteriorating bridges under multi-objective optimisation framework","285956633":"A Taxonomy of Evolutionary Inspired Solutions for Energy Management in Green Computing: Problems and Resolution Methods","30513858":"Définition conceptuelle d\u0027avions : vers une optimisation multiobjectif, robuste et incertaine","282532803":"Chaotic initialized multiple objective differential evolution with adaptive mutation strategy (CA-MODE) for construction project time-cost-quality trade-off","3949353":"Multiobjective optimization using a Pareto differential evolution approach","3240743":"Design, optimization, and fabrication of side-illuminated p-i-nphotodetectors with high responsivity and high alignment tolerance for1.3and 1.55-μm wavelength use","228753076":"A framework for school timetabling problem","220542514":"Blind Stenanography Detection Using a Computational Immune System: A Work in Progress.","276257632":"Fuzzy Goal Programming to Optimization the Multi-Objective Problem","270979902":"Electrical Power Grid Network Optimisation by Evolutionary Computing","220462651":"Setup coordination between two stages of a production system: A multi-objective evolutionary approach","224171588":"Multi-objective optimization of wideband Spiral Arrays","237094200":"ETEA: A Euclidean Minimum Spanning Tree-Based Evolutionary Algorithm for Multi-Objective Optimization","221031991":"An Evolutionary Approach for Path Following Optimal Control of Multibody Systems.","3822369":"Object oriented toolkit for multiobjective genetic optimisation","221228596":"Multi-objective MaxiMin Sorting Scheme","237079868":"Structuration d\u0027ateliers hybrides","231575277":"Throughput Maximization of Queueing Networks with Simultaneous Minimization of Service Rates and Buffers","254379016":"METAMODEL-ASSISTED MULTI-OBJECTIVE EVOLUTIONARY OPTIMIZATION","235709741":"Lecture Notes in Computer Science","3267344":"Impact of Energy Storage Costs on Economical Performance in a Distribution Substation","2274048":"A Survey of Constraint Handling Techniques used with Evolutionary Algorithms","225037898":"Optimisation of a Multi-Objective Two-Dimensional Strip Packing Problem based on Evolutionary Algorithms","273660780":"Mathematical Analysis for the Optimization of a Design in a Facultative Pond: Indicator Organism and Organic Matter","224210552":"Solution Space Characterization and a Fast Algorithm for the Channel Assignment Problem in Wireless Mesh Networks","226588329":"A Data-Driven, Flexible Machine Learning Strategy for the Classification of Biomedical Data","273578855":"Multi-objective optimization of the HVAC (heating, ventilation, and air conditioning) system performance","3949334":"Preliminary statement on the current progress of multi-objective evolutionary algorithm performance measurement","261244088":"Optimization of Nutrition Prescription for Meals Based on Multi-Objective GA","3568410":"Design of the parallel resonant converter as a low harmonic rectifier","258835521":"Performance evaluation of optimal PI controller for ALSTOM gasifier during coal quality variations","282610677":"Many-Objective Problems: Challenges and Methods","233893598":"Multi-objective optimization of skeletal structures under static and seismic loading conditions","4055827":"Environmental/economic power dispatch using multiobjective evolutionary algorithms: A comparative study","3418884":"Abido, M.A.: Multiobjective evolutionary algorithms for electric power dispatch problem. IEEE Trans. Evol. Comput. 10(3), 315-329","2472725":"Blind Steganography Detection Using a Computational Immune System Approach: A Proposal","221228574":"Multicriteria Evolutionary Algorithm with Tabu Search for Task Assignment","274142052":"MaCACH: An Adaptive Cache-Aware Hybrid FTL Mapping Scheme Using Feedback Control for Efficient Page-Mapped Space Management","221228571":"Multiple Criteria Lot-Sizing in a Foundry Using Evolutionary Algorithms","220724754":"Applying a New Grid-Based Elitist-Reserving Strategy to EMO Archive Algorithms","221228569":"Comparison of Evolutionary and Deterministic Multiobjective Algorithms for Dose Optimization in Brachytherapy","3898113":"Parameterised system design based on genetic algorithms","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","228939422":"Solving the biobjective minimum spanning tree problem using a k-best algorithm","264672509":"Exploration of the Trade-Offs between Water Quality and Pumping Costs in Optimal Operation of Regional Multiquality Water Distribution Systems","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","264006784":"Two-Phase Differential Evolution for the Multiobjective Optimization of Time–Cost Tradeoffs in Resource-Constrained Construction Projects","228757148":"Multi-objective sequencing problems of mixed-model assembly systems using memetic algorithms","3885829":"EcoStudio: a computer tool to support carotid ultrasound images analysis","221228561":"Feedback-Control Operators for Evolutionary Multiobjective Optimization","221535860":"OM: A Tunable Framework for Optimizing Continuous Queries over Data Streams.","241771816":"Robust 2DOF PID Controller Design of Time-delay Sysytems Based on Evolutionary Computation","226856646":"Systems Level Modeling of Gene Regulatory Networks","5303060":"Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria","5303061":"Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection","262304999":"Including preferences into a multiobjective evolutionary algorithm to deal with many-objective engineering optimization problems","3642225":"Design space exploration using the genetic algorithm","2366306":"Halftone Image Generation with Improved Multiobjective Genetic Algorithm","220380772":"Preferences and their Application in Evolutionary Multiobjective Optimisation","2243429":"A Non-generational Genetic Algorithm for Multiobjective Optimization","231390861":"Optimization of Adiabatic Styrene Reactor: A Hybrid Multiobjective Differential Evolution (H-MODE) Approach","235050318":"Explicit Building Block Multiobjective Evolutionary Computation: Methods and Applications","223454721":"A dominance tree and its application in evolutionary multi-objective optimization","273900291":"Evolutionary multi-objective optimisation: A survey","281283476":"Applying an Evolutionary Algorithm for the Analysis of Mental Disorders in Macro-urban Areas: The Case of Barcelona","275204919":"Toward High Performance Solution Retrieval in Multiobjective Clustering","222570005":"Design of robust fuzzy-logic control systems by multi-objective evolutionary methods with hardware in the loop","224570931":"Closed-loop evolutionary multiobjective optimization","228656889":"Multi-objective analysis of a component-based representation within an interactive evolutionary design system","221032054":"Multi-Objective Genetic Local Search Algorithm.","239582493":"Evolutionary Indirect Approach to Solving Trajectory Planning Problem for Industrial Robots Operating in Workspaces with Obstacles","30814902":"Application Issues for Multiobjective Evolutionary Algorithms","28209866":"Using Pareto Optimality for Defining the Mutation Operator Step Size","226506468":"Introduction: Problem Solving, EC and EMO","257035316":"New cluster mapping tools for the graphical assessment of non-dominated solutions in multi-objective optimization","220309062":"Thesis: ClusDM: a Multiple Criteria Decision Method for heterogeneous data sets.","4229927":"Early stage software reliability and design assessment","51474553":"Himmelstein DS, Greene CS, Moore JH.. Evolving hard problems: generating human genetics datasets with a complex etiology. Bio Data Mining 4: 21","248778172":"Dynamic Population Strategy Assisted Particle Swarm Optimization in Multiobjective Evolutionary Algorithm design","278711286":"Decision-Maker Preference Modeling in Interactive Multiobjective Optimization","263245022":"Multi-objective aerodynamic shape optimization of small livestock trailers","34466173":"Approaching sustainability in engineering design with multiple criteria decision analysis [electronic resource] /","2493270":"A New Evolutionary Approach for Multiobjective Optimization","216301460":"Using Genetic Programming for Feature Creation with a Genetic Algorithm Feature Selector","3152706":"Optimal Reliability/Availability of Uncertain Systems via Multi-Objective Genetic Algorithms","220857945":"ICT Environment for Multi-disciplinary Design and Multi-objective Optimisation: A Case Study.","276921333":"AIM Capi","3949386":"Dynamic population size in multiobjective evolutionary algorithms","226686708":"Evolutionary Computation","223792672":"A decision support system for the electrical power districting problem","3351364":"Evolutionary approach to hardware/software partitioning","266663068":"Automatic Isotherm Derivation From Field Data for Oilfield Scale-Inhibitor Squeeze Treatments","46432703":"Model-Based Problem Solving through Symbolic Regression via Pareto Genetic Programming","245196256":"Optimization of ship’s subdivision arrangement for offshore sequential ballast water exchange using a non-dominated sorting genetic algorithm","4152129":"A pareto based multi-objective genetic algorithm for scheduling of FMS","220743336":"Estimating the spectral sensitivity of a digital sensor using calibration targets","220403362":"Global Multiobjective Optimization Using Evolutionary Algorithms","259603704":"A modified marriage in honey-bee optimization for multiobjective optimization problems","49402226":"Determining heat transfer coefficients using evolutionary algorithms","27812396":"Multiobjective optimization for multiproduct batch plant design under economic and environmental considerations","37413310":"Multi-objective optimisation applied to industrial energy problems","37421500":"A New Clustering Evolutionary Multi-Objective Optimisation Technique","260625408":"Multiobjective clustering with metaheuristic: Current trends and methods in image segmentation","257719508":"Evaluation of Feedback among Multiple Scheduler Profiles in Fuzzy Genetic Scheduling","274732008":"Mapping of Time–consuming Multitask Applications on a Cloud System by Multiobjective Differential Evolution","3949494":"Topological design of communication networks using multiobjective genetic optimization","3810225":"Genetic algorithm-based multi-objective optimisation and conceptual engineering design","227059225":"Using Multi-Objective Particle Swarm Optimization for Designing Novel Classifiers","3810222":"A genetic algorithm approach to multi-objective scheduling problems with earliness and tardiness penalties","289506004":"Cardenas-Rodriguez 11","220759742":"A Codesign Tool for High Level Systhesis of Vision Models on FPL","222553812":"A linguistic decision model for personnel management solved with a linguistic biobjective genetic algorithm","237075897":"Hybrid Algorithm for Constrained Portfolio Selection Problem","2634673":"Multiobjective Optimization Using Evolutionary Algorithms --- A Comparative Case Study","27812403":"Strategies for multiobjective genetic algorithm development: Application to optimal batch plant design in process systems engineering","237280696":"WAST ECOLLECTIO NVEHICL EROUTIN GPROBLE MWITH TIME WINDOW SUSIN GMULTI-OBJECTIV EGENETIC ALGORITHMS","3810214":"“An updated survey of evolutionary multiobjective optimization techniques: State of the art and future trends,” in: Congress on evolutionary computation","243412252":"DEALING WITH USERS\u0027S PREFERENCES IN HYBRID ASSEMBLY LINES DESIGN","225189619":"A multi-objective approach to constrained optimisation of gas supply networks: The COMOGA method","251581793":"Modified shuffled frog leaping algorithm for multi-objective optimal power flow with FACTS devices","220403335":"Pareto memetic algorithm for multiple objective optimization with an industrial application","241161723":"Research on Multi-objective Parameter Optimization Based on the Experimental Design and ANN-GA in the Digital Environment","234802779":"Coello, C.A.C.: An updated survey of GA-based multi-objective optimization techniques. ACM Computing Surveys 32(2), 109-143","2519936":"Models and Search Strategies for Applied Molecular Evolution","220913293":"Geographic Delineation of Disease Clusters through Multi-Objective Optimization","241126904":"Late Miocene Microstonyx remains (Suidae, Mammalia) from Northern China","223026915":"Optimal configuration of a thermally cycled gas sensor array with neural network pattern recognition","220341898":"Multi-objective optimization of operational variables in a waste incineration plant","273916923":"Objective reduction based on nonlinear correlation information entropy","254839962":"Optimizing Initial Guesses to Improve Global Minimization","13241185":"Optimization and FROG analysis of rule-based detection schemes using a multiobjective approach","3810193":"A case study of a multiobjective recombinative genetic algorithm with coevolutionary sharing","4230123":"Guided architecture-based design optimisation of CBSs","2610059":"Multiobjective Optimization with Messy Genetic Algorithms","222648040":"Aggregated bandwidth allocation: Investigation of performance of classical constrained and genetic algorithm based optimisation techniques","4234221":"A Fast Nondominated Sorting Algorithm","225787608":"An Evolutionary Approach for Assessing the Degree of Robustness of Solutions to Multi-Objective Models","23628485":"Systematic Control of Experimental Inconsistency in Combinatorial Materials Science","261196860":"Inverse induction motor modelling of a submarine propulsion system","223266529":"Introducing prototype interactive evolutionary systems for ill-defined, multi-objective design environments","226195156":"Multiobjective GP for Human-Understandable Models: A Practical Application","224231154":"Introduction of a New Optimization Mechanism for Electimize","4269041":"Diversity Metrics in Multi-objective Optimization: Review and Perspective","233193046":"Infill sampling criteria for surrogate-based optimization with constraint handling","42242353":"An evolutionary algorithm approach to the design of finite word-length controller structures","3152775":"Optimal Design of Reliable Network Systems in Presence of Uncertainty","43307299":"Estudios sobre sistemas adaptativos con aplicaciones en la robótica autónoma y los agentes inteligentes","3910531":"A multiobjective genetic algorithm for feature selection and granularity learning in fuzzy-rule based classification systems","227700265":"Parameter identification with weightless regularization","285485759":"Introduction to Multi-objective Evolutionary Algorithms","2894737":"Evolutionary Methods for Musical Composition","251946170":"Lean production and transportation scheduling for dynamic supply chain management","239392251":"Pareto optimization using the struggle genetic crowding algorithm","277291832":"Evolutionary Computation Group","220311198":"Fanelli, A.M.: Interpretability constraints for fuzzy information granulation. Inf. Sci. 178(24), 4585-4618","3949564":"Selecting informative genes using a multiobjective evolutionaryalgorithm","2374631":"Combining Hybrid Metaheuristics and Populations for the Multiobjective Optimisation of Space Allocation Problems","222860939":"Availability allocation to repairable systems with genetic algorithms: A multi-objective formulation","2460640":"Financial Forecasting Using Genetic Algorithms","236596691":"Some potential contributions of sociobiology to moral psychology and moral education","216301358":"Evolutionary Search for Minimal Elements in Partially Ordered Finite Sets","241479087":"A Hybrid Algorithm for Dynamic Location Problems","257404060":"Tuning of PID controller based on a multiobjective genetic algorithm applied to a robotic manipulator","267766840":"A Robust Approach for Optimization – NS-NR I Part I: Theory","2575338":"The Revolution of Evolution in Design: From Coffee Tables to Hospitals","262333551":"Multiple Evolutionary Agents For Decision Support","268694477":"Hybrid multiple objective artificial bee colony with differential evolution for the time-cost-quality tradeoff problem","223510173":"Evolutionary approaches to the design and organization of manufacturing systems","224222862":"Pareto Optimization of Thinned Planar Arrays With Elliptical Mainbeams and Low Sidelobe Levels","222512791":"Multi-objective rule mining using genetic algorithms","229881446":"Approximating nondominated sets in continuous multiobjective optimization problems","2493424":"Evolutionary Algorithms for the Physical Design of VLSI Circuits","35928573":"Asset replacement considering environmental and economic objectives.","3929057":"Enhancing the performance of a multivariable fuzzy controller by means of multiobjective genetic programming and statistical analysis","224177799":"Building low CO2 solutions to the vehicle routing problem with Time Windows using an evolutionary algorithm","228705916":"ON-LINE DESIGN OF ROBUST FUZZY-LOGIC CONTROL SYSTEMS BY MULTI-OBJECTIVE EVOLUTIONARY METHODS.","229881453":"MOSA Method: A Tool for Solving Multiobjective Combinatorial Optimization Problems, ” Journal of Multi Criteria Decision Analysis 8, pp. 221-236","227022423":"Intelligent Computational Optimization in Engineering: Techniques and Applications","224333502":"Optimizing the Configuration of a Broadcast Protocol through Parallel Cooperation of Multi-objective Evolutionary Algorithms","245310845":"Suman, B.: Simulated annealing based multiobjective algorithm and their application for system reliability. Eng. Optim. 35(4), 391-416","220176120":"Qian, S.: Artificial immune system in dynamic environments solving time-varying non-linear constrained multi-objective problems. Soft Comput. 15(7), 1333-1349","2376653":"Stochastic Methods for Multi-Objective Optimization","215617334":"Adaptation and Self-Organization in Evolutionary Algorithms","220837572":"Using Multiobjective Genetic Programming to Infer Logistic Polynomial Regression Models.","258655367":"Constrained Pareto Optimization of Wide Band and Steerable Concentric Ring Arrays","222910119":"Examination of genetic programming paradigm for high-throughput experimentation and heterogeneous catalysis","264240202":"Integrating a multi-objective optimization framework into a structural design software","265186358":"Multi-Objective Optimisation of Safety Related Systems","2364381":"Multiobjective Optimization using a Micro-Genetic Algorithm","262179931":"Integrated multifidelity, multidisciplinary evolutionary design optimization of counterrotating compressors","226918010":"Design and control of MEMS for microfluidic applications","268821509":"Feedback-control operators for improved Pareto-set description: Application to a polymer extrusion process","271547438":"Non-dominated sorting environmental adaptation method (NS-EAM)","220449056":"Dividing Genetic Computation Method for Robust Receding Horizon Control Design.","233937397":"Gene selection in microarray data from multi-objective perspective","228694440":"A multiobjective approach to cost effective long-term groundwater monitoring using an elitist nondominated sorted genetic algorithm with historical data","226218354":"Inverse Problems and Genetic Algorithms","3949622":"Hierarchical Rank Density Genetic Algorithm for Radial-Basis Function Neural Network Design","275352675":"Optimising the Scheduling and Planning of Urban Milk Deliveries","229927353":"Multi-objective optimal FLC driven hybrid mass damper for torsionally coupled, seismically excited structures","3421242":"A Multi-objective Genetic Local Search Algorithm and Its Application to Flowshop Scheduling","220414258":"Application of the Genetic Algorithm to Real-Time Active Noise Control.","260410263":"Multiobjectives Bihistogram Equalization for Image Contrast Enhancement","221196603":"Reference Set Metrics for Multi-Objective Algorithms","225780067":"Cell formation in the presence of reconfigurable machines","222427478":"Multi-objective tabu search using a multinomial probability mass function","222701916":"Reheat optimization of the variable-air-volume box","236136968":"Efficient thinning regimes for Eucalyptus fastigata: multi-objective stand-level optimisation using the island model genetic algorithm. Ecol Model","43466379":"Evolutionary design of robust flight control for a hypersonic aircraft","12563619":"Variable Length Representation in Evolutionary Electronics","268817432":"Robust Design of Multiple Trailing Edge Flaps for Helicopter Vibration Reduction: A Multi-Objective Bat Algorithm Approach","4201566":"The harmonic decision matrix: A subtle model of the natural neuron","258667380":"TESIS DIEGO MENDEZ","281081054":"A multi-objective optimization method based on simplex search method","222646618":"A niched Pareto genetic algorithm for multiobjective environmental/economic dispatch","3949596":"Agent-based evolutionary multiobjective optimisation","267486160":"Multi-Objective Optimisation of Quarter-Car Models With Linear or Piecewise Linear Suspension Dampers","3949597":"Optimising multiple aspects of network survivability","258820940":"Mistuning Identification of Integrally Bladed Disks With Cascaded Optimization and Neural Networks","269997110":"Multi Objective Optimization of Trajectory Planning of Non-holonomic Mobile Robot in Dynamic Environment Using Enhanced GA by Fuzzy Motion Control and A*","34471471":"Explicit building block multiobjective evolutionary computation : methods and applications /","2370567":"Pareto coevolution: Using performance against coevolved opponents in a game as dimensions for Pareto selection","220866830":"Robustness Analysis in Evolutionary Multi-Objective Optimization Applied to VAR Planning in Electrical Distribution Networks","245330618":"Hybrid assembly line design and user\u0027s preferences","263193493":"Robustness considerations in multi-objective optimal design","233083342":"Multiobjective Optimization of Reactor–Regenerator System Using Ant Algorithm","228817288":"Diagnosis of Dementing Diseases through the Distribution of Cerebral Atrophy: Development of a Multi-Objective Evolutionary Algorithm Optimiser","280104094":"Human Behavior Algorithms for Highly Efficient Global Optimization","6532179":"Diffusion tensor imaging: techniques and clinical applications.","226169163":"Parameter optimization of laser die-surface hardening using the particle swarm optimization technique","257512297":"Fuzzy preference-based multi-objective optimization method","265155581":"امکان سنجی توسعه منابع تولید پراکنده در شبکه توزیع با استفاده از الگوریتم NSGA-II","249430767":"Non-dominated Rank based Sorting Genetic Algorithms","2425878":"Constrained Multiobjective Optimization by Evolutionary Algorithms","222857595":"Coello, A.C.: Theoretical and Numerical Constraint-Handling Techniques Used with Evolutionary Algorithms: A Survey of the State of the Art. Comput. Methods Appl. Mech. Engrg. 191(11-12), 1245-1287","2364433":"Constraint Method-Based Evolutionary Algorithm (CMEA) for Multiobjective Optimization","251857717":"Research on Bi-Objective Scheduling Problems Subjected to Special Process Constraint on Parallel Machines","251945778":"Multi-Objective Robust Optimization Based on NSGA-II and Degree of Robustness","220231959":"Genetic Algorithms for Decisional Dna: Solving Sets of Experience Knowledge Structure.","4275318":"Assembly Process Planning Using a Multi-objective Optimization Method","220866834":"2-Objective Optimization of Cells Overlap and Geometry with Evolutionary Algorithms","220291353":"A multiobjective optimization solver using rank-niche evolution strategy","220381464":"An approach to the design of a hybrid organization of workshops into functional layout and group technology cells","46888688":"Advances in Multi-Objective Nature Inspired Computing","7801930":"On the use of multi-objective evolutionary algorithms for the induction of fuzzy classification rule systems. Biosystems","290112887":"TOPASE: Tools for Operability Assessment and Support Enhancement for life cycle system performance optimisation","2542616":"Crowding Factor In Evolutionary Multi-Agent System For Multiobjective Optimization","223672682":"A multi-objective decision-making model with fuzzy rough coefficients and its application to the inventory problem","2296930":"3D Exploration of Uniprocessor Schedules for DSP Algorithms","262312931":"A Comparative Evaluation of Multi-Objective Exploration Algorithms for High-Level Design","267791283":"Identification of optimal multibody vehicle models for crash analysis","245512933":"An Evolutionary Approach of Multicriteria Manufacturing Cell Formation","221143401":"GENE_ARCH: An Evolution-Based Generative Design System for Sustainable Architecture","224182548":"On the Influence of the Number of Objectives on the Hardness of a Multiobjective Optimization Problem","2528366":"Optimal Location of Web Servers","245390058":"Integrated optimization of system design and spare parts allocation by means of multiobjective genetic algorithms and Monte Carlo simulation","267197345":"EVOLUTIONARY MULTI-AGENT SYSTEM FOR MULTIOBJECTIVE BALANCING OF PRODUCTION LINES","4201485":"Complementary selection and variation for an efficient multiobjective optimization of complex systems","2780263":"GA-MINER: Parallel Data Mining with Hierarchical Genetic Algorithms - Final Report","285549896":"A Novel Multiple Objective Symbiotic Organisms Search (MOSOS) for Time-Cost-Labor Utilization Tradeoff Problem","220666217":"Multi-objective location modeling of urban parks and open spaces: Continuous optimization","242438716":"A Thorough Do cumen tation of Obtained Results on Real{V alued Con tin uous and Com binatorial Multi{Ob jectiv e Optimization Problems Using Div ersit y Preserving Mixture{Based Iterated Densit y Estimation Ev olutionary Algorithms","220201327":"DesertFD: A finite-domain constraint based tool for design space exploration","3740777":"Genetic Algorithms for Control and Signal Processing","220240241":"A Multiobjective Evolutionary Neuro-Controller for Nonminimum Phase Systems.","224606514":"A Favorable Weight-Based Evolutionary Algorithm for Multiple Criteria Problems","2804856":"Genetic Programming with User-Driven Selection: Experiments on the Evolution of Algorithms for Image Enhancement","273531935":"A fuzzy clustering-based genetic algorithm approach for time–cost–quality trade-off problems: A case study of highway construction project","2565235":"Order-theoretic Analysis of Coevolution Problems: Coevolutionary Statics","235080279":"Optimization of Heterogeneous UAV Communications Using the Multiobjective Quadratic Assignment Problem","272016482":"Mathematical modeling and modification of an activated sludge benchmark process evaluated by multiple performance criteria","260508626":"An Optimal Relaying Scheme for Delay-Tolerant Networks With Heterogeneous Mobile Nodes","242663969":"Structured and Collaborative Search: An integrated approach to share documents among users","244343497":"Evolutionary Fabrication: The Co-Evolution of Form and Formation","222927123":"Economic emission load dispatch through fuzzy based bacterial foraging algorithm. Electrical Power and Energy Systems, 32, 794-803","258083640":"A multiobjective optimization approach to statistical mechanics","242405929":"Vitri - A Generic Framework for Engineering Decision Support Systems on Heterogeneous Computer Networks","2448504":"Multiobjective Genetic Programming: A Nonlinear System Identification Application","228749821":"Briefing: Method for electronics optimisation using a suite of fast specialist optimisation scenarios produced via an evolutionary algorithm","2239554":"Evolutionary Search for Minimal Elements in Partially Ordered Finite Sets","2503749":"Multiobjective Optimization by Nessy Algorithm","251095699":"Hybrid Genetic Algorithms for Telecommunications Network Back-Up Routeing","220199291":"A fast multi-objective evolutionary algorithm based on a tree structure","238697055":"Learning Classifier Systems for Multi-objective Robot Control","237228614":"Multi-Objective Optimization of Diesel Engine Emissions using Genetic Algorithms and Phenomenological Model","223025452":"The Pareto fitness genetic algorithm: Test function study","235694692":"A DSS generator for multiobjective optimisation of spreadsheet-based models","221645150":"Dynamic goal coordination in physical agents","200734623":"A decade of Kasabov\u0027s Evolving Connectionist Systems: A Review","223801661":"Optimal lens design by real-coded genetic algorithms using UNDX","257774385":"Optimal Performance Design of Bi-Tuned Mass Damper Systems Using Multi-Objective Optimization","6501395":"Evolutionary algorithms for the selection of single nucleotide polymorphisms","221559109":"A Multiobjective Genetic Algorithm for the Class/Teacher Timetabling Problem","277298422":"Evolutionary framework for the creation of diverse hybrid ensembles for better generalisation [DIVACE: diverse and accurate ensemble learning algorithm . . .","224340270":"Multi-objective vector evaluated PSO with time variant coefficients for outlier identification in power systems","221262150":"Efficient OSPF Weight Allocation for Intra-domain QoS Optimization","271275100":"Novel frameworks for creating robust multi-objective benchmark problems","2405470":"Partially Ordered Constraint Optimization Problems","265337772":"A learning-guided multi-objective evolutionary algorithm for constrained portfolio optimization","260518904":"Dealing with numerical noise in CFD-based design optimization","224330205":"Multiobjective Evolutionary Algorithm with Constraint Handling for Aircraft Landing Scheduling","221053359":"A Hybrid Cellular Genetic Algorithm for Multi-objective Crew Scheduling Problem","220176795":"Multi-objective self-adaptive differential evolution with elitist archive and crowding entropy-based diversity measure. Soft Comput Fusion Found Method Appl","262398762":"Enhanced multi-objective optimization algorithm for renewable energy sources: Optimal spatial development of wind farms","239065781":"Solution Concepts in Coevolutionary Algorithms","280534066":"Bi-goal evolution for many-objective optimization problems","239936192":"Uma Nova Medida de Performance para Otimizac ¸˜ ao MultiObjetivo: Integral da Contagem de Esferas","285066352":"Partie II. Une approche multicritère","30010695":"Shape optimization for piezoceramics","229708094":"Ant algorithm for single and multiobjective reliability optimization problems","2557111":"Swarm Based Distributed Search in the AMIGOS Environment","3421349":"Multiobjective programming using uniform design and genetic algorithm","220289456":"Representation and management of MOEA populations based on graphs","225665506":"A fast steady-state ε-dominance multi-objective evolutionary algorithm","46487120":"Buffer and throughput trade-offs in M/G/1/K queueing networks","242303719":"Using a Genetic Algorithm to Generate Alternatives for Multiobjective Corridor Location Problems","225432057":"Approximating Pareto-Optimal Sets Using Diversity Strategies in Evolutionary Multi-Objective Optimization","235872919":"Designing Distributed Multi-Criteria Decision Support Systems for Complex and Uncertain Situations","228890941":"Evolving agent-based team tactics for combative computer games","279202877":"Heuristic Approaches to Solving Multiobjective Scheduling Optimisation Problems – A Review","30387541":"Ultra-Wideband MB-OFDM Channel Estimation with Complementary Codes","220373432":"Design and Management Strategies for Mixed Public Private Transportation Networks: A Meta‐Heuristic Approach","2770100":"Multi-objective Optimisation and Preliminary Airframe Design","237310598":"RESUME DE MEMOIRE EN MAGISTER en GENIE MECANIQUE - PRODUCTIQUE OPTION : SYSTEMES DE PRODUCTION","220754316":"An Spanning Tree Based Method For Pruning Non-Dominated Solutions in Multi-Objective Optimization Problems.","220170682":"An interactive particle swarm optimisation for selecting a product family and designing its supply chain","242506450":"Computational Intelligence in Reliability Engineering: Evolutionary Techniques in Reliability Analysis and Optimization","259161044":"Supporting the design process with hypergraph genetic operators","255564690":"Elasticity, Lattice Dynamics and Parameterisation Techniques for the Tersoff Potential Applied to Elemental and Type III-V Semiconductors","287505803":"Design and Optimization of Pulsed Chemical Exchange Saturation Transfer MRI Using a Multiobjective Genetic Algorithm","269997245":"Multi Objective Optimization of Path and Trajectory Planning for Non-holonomic Mobile Robot Using Enhanced Genetic Algorithm","259515352":"Multi-objective economic emission load dispatch problem with trust-region strategy","3810442":"Resolution of the left ventricle 3D reconstruction problem using approaches based on genetic algorithm for multiobjective problems","233341272":"Theory of Fuzzy Information Granulation: Contributions to Interpretability Issues","273120500":"TSK Fuzzy Model with minimal parameters","2440337":"Métaheuristiques pour l\u0027optimisation combinatoire multi-objectif: Etat de l\u0027art","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","277769272":"Weapon Release Scheduling from Multiple-Bay Aircraft using Multi-Objective Evolutionary Algorithms","224649685":"Fuzzy-Rule based Load Pattern Classifier for Short-Tern Electrical Load Forecasting","257725419":"Multiple Robots Formation–A Multiobjctive Evolution Approach","23539167":"Using Evolutionary Algorithms to Generate Alternatives for Multiobjective Site-Search Problems","2569374":"Modular Variable-length Representations from Pareto-Coevolution","223410665":"Multi-objective optimization with diversity preserving mixture-based iterated density estimation evolutionary algorithms","257391598":"Multi-objective optimization of linear multi-state multiple sliding window system","256502771":"Evolutionary multi-objective optimization of hybrid laminates","2385048":"The Major Evolutionary Transitions, Symbiotic Composition, and Implications for Evolvability","2569371":"An Evolutionary Approach to Hardware/Software Partitioning","4125826":"Design of low output voltage DC-DC converters through artificial evolution","220176803":"A Pareto-based multi-objective evolutionary approach to the identification of Mamdani fuzzy systems","261458729":"The multiobjective optimization problem with fuzzy goal programming","258663383":"On the need for automated multiobjective optimization and uncertainty estimation of glacier mass balance models","216457304":"Lecture Notes in Computer Science","220160417":"Metco: a Parallel Plugin-Based Framework for Multi-Objective Optimization.","229507345":"Discovery of New Green Phosphors and Minimization of Experimental Inconsistency Using a Multi‐Objective Genetic Algorithm‐Assisted Combinatorial Method","238682874":"Title of Dissertation ENTROPY APPROACH TO METAMODELING, MULTI-OBJECTIVE GENETIC ALGORITHM, AND QUALITY ASSESSMENT OF SOLUTION SETS FOR","235770575":"Algorithm for Increasing the Speed of Evolutionary Optimization and its Accuracy in Multi-objective Problems","265988894":"The Harmonic Decision Matrix: a group of operators for the fuzzy-logic, multi-objective decisions and optimizations","227987794":"Advances in Chemical Physics, Volume 148","222321030":"Multiobjective and constrained optimization for DS-CDMA code design on the clonal selection principle","238680830":"A MULTIOBJECTIVE OPTIMIZATION FOR THE EWMA AND MEWMA QUALITY CONTROL CHARTS","227535175":"Cognitive engine implementation for wireless multicarrier transceivers","269997278":"A Hybrid Approach Based on ACO and Ga for Multi Objective Mobile Robot Path Planning","220371436":"Phi-array: A novel method for fitness visualization and decision making in evolutionary design optimization","223549852":"A novel elitist multiobjective optimization algorithm: multiobjective extremal optimization. Eur J Oper Res","284234785":"Multi-Objective Optimization of IT Service Availability and Costs","221006334":"Using convex quadratic approximation as a local search operator in evolutionary multiobjective algorithms","260115283":"Multi-Objective Self-Organizing Migrating Algorithm: Sensitivity on Controlling Parameters","220371441":"Interactive visualisation for decision support and evaluation of robustness - In theory and in practice","222333331":"Efficiency speed-up strategies for evolutionary computation: Fundamentals and fast-GAs","224561585":"Interleaved Ultrawideband Antenna Arrays Based on Optimized Polyfractal Tree Structures","220383735":"Automatic Provisioning of QoS Aware OSPF Configurations.","2608382":"Afit/ds/eng/97-03","4201626":"Handling diversity in evolutionary multiobjective optimization","221528558":"Integration of Statistical Selection with Search Mechanism for Solving Multi-Objective Simulation-Optimization Problems","37529312":"Multiple Objective Sensor Management and Optimisation","241060481":"Multiobjective Particle Swarm Optimization for Parameter Estimation in Hydrology","235264741":"Pareto-Based Continuous Evolutionary Algorithms for Multiobjective Optimization","1772795":"Genetic Algorithms for multiple objective vehicle routing","37988001":"A design framework and genetic algorithm for digital design optimisation on FPGAs","3859673":"Study on multi-objective genetic algorithm","236671736":"Multiobjective Optimization for the Asset Allocation of European Nonlife Insurance Companies","220867022":"Multi-objective Genetic Manipulator Trajectory Planner","291190207":"Evolving Explanatory Novel Patterns for Semantically-Based Text Mining","220742092":"Evolving policies for multi-reward partially observable Markov decision processes (MR-POMDPs)","222405031":"Jaszkiewicz, A.: Genetic Local Search for Multi-Objective Combinatorial Optimization. European Journal of Operational Research 137, 50-71","259539856":"A Clustering-based Methodology for Discontinuous Pareto Frontier Representation","27559245":"Evolutionäre Verfahren zur Optimierung von Produktionsplänen mittels impliziter Kooperation","2270411":"Assessing the Performance of the Pareto Archived Evolution Strategy","228733259":"Coello Coello, C.A.: Constraint-handling using an evolutionary multiobjective optimization technique. Civ. Eng. Environ. Syst. 17, 319-346","24001922":"An effective docking strategy for virtual screening based on multi-objective optimization algorithm","229038410":"A multiobjective particle swarm optimization model for reservoir operations and planning","223711672":"Optimal power system generation scheduling by multi-objective genetic algorithms with preferences","226724205":"Multiobjective Optimization of Space Structures under Static and Seismic Loading Conditions","2647239":"Multiobjective Genetic Algorithms with Application to Control Engineering Problems","24065436":"Approximate solution methods for multiobjective combinatorial optimization","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","222544310":"Suman, B.: Study of simulated annealing based multiobjective algorithm for multiobjective optimization of a constrained problem. Comput. Chem. Eng. 28(9), 1849-1871","11304027":"Designing focused libraries using MoSELECT","263420740":"Global Pairwise Sequence Alignment using Ant Colony Optimization","224651674":"A multi-objective genetic algorithm approach to optimal allocation of multi-type FACTS devices for power system security","284068885":"Improving the quality of finite volume meshes through genetic optimisation","221008336":"On the locality of dominance and recombination in multiobjective evolutionary algorithms","3906873":"Utilizing bias to evolve recurrent neural networks","220205090":"Fuzzy Control of HVAC Systems Optimized by Genetic Algorithms","3829049":"Local search procedures in a multi-objective genetic local search algorithm for scheduling problems","222220349":"Hierarchical parallel approach for GSM mobile network design","257055318":"Optimization of drinking water distribution networks: Computer-based methods and constructal design","220045337":"Directed multi-objective optimization","251859463":"Research on Immune Genetic Algorithm for Solving Bi-Objective Scheduling Problems Subjected to Special Process Constraint","245353369":"A Pareto-Based Genetic Algorithm Search Approach to Handle Damped Natural Frequency Constraints in Turbo Generator Rotor System Design","233904374":"Proportional-integral-plus (PIP) design for delta (δ) operator systems: Part 2, MIMO systems","50315254":"MULTI-OBJECTIVE GENETIC ALGORITHM FOR REACTIVE POWER OPTIMIZATION INCLUSING VOLTAGE STABILITY","220381225":"A review of multiobjective test problems and a scalable test problem toolkit.","2936096":"ROC Optimisation of Safety Related Systems","2581803":"Approximating the non-dominated front using the Pareto Archived Evolution Strategy","233238772":"A comprehensive preference-based optimization framework with application to high-lift aerodynamic design","228853943":"Optimal Beaconing Control for Epidemic Routing in Delay-Tolerant Networks","236849933":"Assigning Proctors to Exams with Scatter Search","4060462":"A new genetic algorithm for Web-based negotiation support system","229023922":"Evolutionary Computation","2637117":"Divided Range Genetic Algorithms in Multiobjective Optimization Problems","227061917":"Evolutionary Algorithms and Multiple Objective Optimization","224309321":"A Multiobjective Evolutionary-Simplex Hybrid Approach for the Optimization of Differential Equation Models of Gene Networks","3317032":"Automatic design of frequency sampling filters by hybrid genetic algorithm techniques. IEEE Transactions on Signal Processing 46: 3304-3314","225751150":"Systems and control engineering","2239800":"On Measuring Multiobjective Evolutionary Algorithm Performance","220704828":"Using Genetic Algorithm for Parameter Tuning ON ILC Controller Design.","233859310":"Mistuning Identification of Bladed Disks Utilizing Neural Networks","4375901":"Single and Multiobjective Optimization of the Train Staff Planning Problem Using Genetic Algorithms","266222332":"Multidisciplinary scheduling: theory and applications. 1st international conference, MISTA ’03, Nottingham, UK, 13–15 August 2003. Selected papers","237531919":"Feature Selection and Classifier Ensembles: A Study on Hyperspectral Remote Sensing Data Kenmerk Selectie en Classificatie Ensembles: Een Studie op Hyperspectrale Afstandswaarnemingsdata","12766693":"Multiobjective genetic optimization of diagnostic classifiers with implications for generating receiver operating characteristic curves","266867395":"Constant Power -Continuously Variable Transmission (CP-CVT): Optimisation and Simulation","245357489":"Shape Optimization of a MultiElement Foil Using an Evolutionary Algorithm","229036182":"A fuzzy vehicle routing assignment model with connection network based on priority-based genetic algorithm","224639059":"A parallel and hybrid Multi-Objective Evolutionary Algorithm applied to the design of cellular networks","222814327":"Recent advances in surrogate-based optimization","251951668":"Multiobjective optimization with competitive coevolutionary genetic algorithms","47435746":"Application of computational intelligence in modeling and optimization of HVAC systems","228966551":"Multistage Human Resource Allocation for Software Development by Multiobjective Genetic Algorithm","220551197":"An efficient multi-objective learning algorithm for RBF neural network","220381210":"Ensemble of Constraint Handling Techniques","224761951":"Application of multi-objective algorithm based on particle swarm optimization in electrical short-term load forecasting","220080165":"A model for the dynamic coordination of multiple competing goals","224346211":"A Multi-objective Learning Algorithm for RBF Neural Network","257153646":"A novel micro-population immune multiobjective optimization algorithm","226496707":"Enhancing neural control systems by Fuzzy logic and evolutionary reinforcement","4201733":"Evolutionary multiobjective optimization with a segment based external memory support for the multiobjective quadratic assignment problem","275060003":"Opposition-based Multiple Objective Differential Evolution (OMODE) for optimizing work shift schedules","2370915":"Multi-Objective Design Space Exploration of Road Trains with Evolutionary Algorithms","259668529":"Optimization of multilayered panels with poroelastic components for an acoustical transmission objective","235985757":"Distribution of threatened–unprotected vertebrates as a basis for conservation planning","224133138":"A Territory Defining Multiobjective Evolutionary Algorithms and Preference Incorporation","226803915":"Hybrids of Constructive Metaheuristics and Constraint Programming: A Case Study with ACO","242438946":"Genetic Programming with User-Driven Selection: Experiments on the Evolution of Algorithms for Image Enhancement","264495760":"Robust Design of Trailing Edge Flap with Orthogonal Array Inspired Response Surface for Helicopter Vibration Reduction","222312468":"Suman, B.: Study of self-stopping PDMOSA and performance measure in multiobjective optimization. Comput. Chem. Eng. 29(5), 1131-1147","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","225413175":"Improving the computational efficiency in a global formulation (GLIDE) for interactive multiobjective optimization","269071699":"Data mining and decision making","261122762":"Optimization of distributed generation penetration based on particle filtering","258454019":"Digital Ecosystems","237128516":"An interactive genetic algorithm with co-evolution of weights for multiobjective problems","221522002":"Preference Based Genetic Algorithm for the Optimum Design of Integrated Structural Control System.","220741699":"Automated red teaming: a proposed framework for military application.","260795111":"Reference Point Based TR-PSO for Multi-Objective Environmental/Economic Dispatch","2768198":"F1.12: Multicriteria Decision Making and Evolutionary Computation","225611804":"Hybridizations of Metaheuristics With Branch \u0026 Bound Derivates","261028576":"INSPM: An interactive evolutionary multi-objective algorithm with preference model","225124356":"Optimal disc cutters plane layout design of the full-face rock tunnel boring machine (tbm) based on a multi-objective genetic algorithm","220160112":"ANCHOR - A Connectionist Architecture for Partitioning Feature Spaces and Hierarchical Nesting of Neural Nets.","220260438":"Coordination based Multiple Criteria Decision Making.","227332341":"The A-Design approach to managing automated design synthesis","2839889":"Finding Acceptable Pareto-Optimal Solutions using Multiobjective Genetic Algorithms","279274974":"Evolutionary Computation: An overview","220176480":"Multi-Objective Optimization using Grid Computing","228085784":"Multiobjective Metaheuristics for the Bus Driver Scheduling Problem","277298436":"Multi-Objective Particle Swarm Optimisation Methods.","265200203":"Multi-Mission Radar Waveform Design via a Distributed SPEA2 Genetic Algorithm","237736877":"Study of Fuzzy Sliding-Mode Control for Magnetic Ball Levitation Systems","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","255716023":"Pareto Optimal Pairwise Sequence Alignment","242072545":"PARETO-BASED COST SIMULATED ANNEALING FOR MULTIOBJECTIVE OPTIMIZATION","2540968":"Agent-based Evolutionary Multiobjective Optimisation","273948122":"The Generalized Consistent Vehicle Routing Problem","222025908":"Condition-based maintenance optimization by means of genetic algorithms and Monte Carlo simulation. Reliab Eng Syst Saf","220788903":"Extended Tabu Search on Fuzzy Traveling Salesman Problem in Multi-criteria Analysis","223074500":"Orthogonal simulated annealing for multiobjective optimization","233117812":"Coello Coello, C.A.: Treating Constraints as Objective for Single-Objective Evolutionary Optimization. Engineering Optimization 32(3), 275-308","220618932":"Secure Evolvable Hardware for Public-key Cryptosystems.","220260531":"Hybrid Genetic Algorithm for the Generalised Assignment Problem.","4074923":"A simplified artificial life model for multiobjective optimisation: A preliminary report","4111784":"Optimal computing budget allocation for multi-objective simulation models","257153732":"BSTBGA: a hybrid genetic algorithm for constrained multi-objective optimization problems. Comput Oper Res","239537118":"GENETIC ALGORITHM BASED OPTIMISATION FOR BANDWIDTH ALLOCATION FOR VIRTUAL PATHS (GA-BAVP)1","220559551":"Hybrid methods in multi-criteria dynamic programming","234799200":"Multi-criterion optimization for the EWMA and MEWMA quality control charts employing genetic algorithms","2426244":"A Basis for Future Successes in Multiobjective Combinatorial Optimization","238654360":"Genetic Programming as a Model Induction Engine","283665739":"Multi-objective control chart design optimization using NSGA-III and MOPSO enhanced with DEA and TOPSIS","225738963":"ISDM at ImageCLEF 2010 Fusion Task","222163095":"Optimal control of isotope selective fragmentation","268670376":"Accurate, transparent and compact fuzzy models by multi-objective evolutionary algorithms","28351516":"Design und Analyse integrierter Schaltungen mit evolutionären Algorithmen","2622853":"An Investigation of Sexual Selection as a Mechanism for Obtaining Multiple Distinct Solutions","2688390":"An Analysis of Multiobjective Optimization within Genetic Algorithms","257336039":"Secondary population implementation in multi-objective evolutionary algorithm for scheduling of FMS","220119213":"Evolutionary multi-criteria trajectory modeling of industrial robots in the presence of obstacles","222091401":"Microchannel optimization using multiobjective evolution strategies","278392098":"Nonlinear multivariable modeling of locomotive proton exchange membrane fuel cell system","220741790":"A co-evolutionary hybrid algorithm for multi-objective optimization of gene regulatory network models","220741776":"Adaptive variance scaling in continuous multi-objective estimation-of-distribution algorithms","223578346":"Multi-objective optimization of pumping rates and well placement in coastal aquifers. J Hydrol 290(1-2):80-99","223246583":"A tool for risk-based management of surface water quality","258757335":"Evolutionary multiobjective optimization in water resources: The past, present, and future","229707789":"Pareto simulated annealing- A metaheuristic technique for multiple-objective combinatorial optimization","263221773":"Improving the calibration strategy of the physically-based model WaSiM-ETH using critical events","222048386":"A multiobjective immune algorithm based on a multiple-affinity model","2473370":"An Evolutionary Algorithm With A Multilevel Pairing Strategy For Single And Multiobjective Optimization","221352177":"Expression Inference — Genetic Symbolic Classification Integrated with Non-linear Coefficient Optimisation","228851812":"Dynamic Lane Reversal in Traffic Management","222546050":"Problem solving environments in aerospace design","221008109":"Hyperheuristic codification for the multi-objective 2D Guillotine Strip Packing Problem","220119258":"Multi-objective genetic algorithms: A way to improve the convergence rate","225128608":"A-Design: An Agent-Based Approach to Conceptual Design in a Dynamic Environment","226044085":"Multiobjective Evolutionary Algorithms for Electric Power Dispatch Problem","251904719":"Multi-Objective Optimization of Cutting Parameters with Improved NSGA-II","239555466":"Analysis of Uncertainty in River Water Quality Modelling","220850425":"Design of Hybrid Learning Control for Flexible Manipulators: a Multi-objective Optimisation Approach.","264452627":"Energy efficient genetic-based schedulers in computational grids","225239231":"Integrating Gene Expression Data, Protein Interaction Data, and Ontology-Based Literature Searches","227264607":"Evolutionary and Immune Computations in Optimal Design and Inverse Problems","245095244":"Review of Utilization of Genetic Algorithms in Heat Transfer Problems","257528448":"A PDE-based Approach to Nondominated Sorting","268380710":"Probabilistic Sorting for Effective Elitism in Multi-objective Evolutionary Algorithms","237212664":"航空機の多目的最適設計 Multiobjective Design Optimization of Aircraft Configuration","224651453":"Effects of multi-objective genetic rule selection on short-term load forecasting for anomalous days","4181472":"Research on A New Multiobjective Combinatorial Optimization Algorithm","245308287":"Optimising a Car Chassis","223307951":"A class of expected value multi-objective programming problems with random rough coefficients","260594280":"A Peer-to-Peer Particle Swarm Optimizer for Multi-objective Functions","224309436":"Contrast Enhancement and Intensity Preservation for Gray-Level Images Using Multiobjective Particle Swarm Optimization","2495941":"AUV Mission Preparation as a Multi-criteria Optimization Problem Using Statistical Performance Prediction","220119293":"A hybrid genetic algorithm for the design of water distribution networks","226222236":"Hybrid Metaheuristics for Multi-objective Combinatorial Optimization","220870850":"An Evolutionary Multi-objective Neural Network Optimizer with Bias-Based Pruning Heuristic","238291933":"Optimizing an In Situ Bioremediation Technology to Manage Perchlorate-Contaminated Groundwater","220618959":"Procedural Texture Evolution Using Multi-objective Optimization.","224723086":"Rank-density based multiobjective genetic algorithm","46491433":"A hybrid immune multiobjective optimization algorithm","228610125":"A Distance Function-Based Multi-Objective Evolutionary Algorithm","265163296":"امکان سنجی توسعه منابع تولید پراکنده در شبکه توزیع با استفاده از الگوریتم NSGA-II","283835674":"Preference-Based Multiobjective Particle Swarm Optimization for Airfoil Design","8549751":"Ideal Evaluation from Coevolution","237233109":"MOMBES Multiobjective Modelbased Evolution Strategy","11042143":"Multi-objective cooperative coevolution of artificial neural networks (multi-objective cooperative networks)","220340437":"A fuzzy multiobjective algorithm for multiproduct batch plant: Application to protein production","251312899":"A macro-evolutionary multi-objective immune algorithm with application to optimal allocation of water resources in Dongjiang River basins, South China","255599303":"Multiobjective Optimal Structural Vibration Control Using Fuzzy Logic Control System","256905899":"Data Classification through an Evolutionary Approach Based on Multiple Criteria","43294570":"Multi-objective Optimisation of Cancer Chemotherapy Using Evolutionary Algorithms","228918182":"Evolutionary Computation in Design and Manufacturing","220199704":"A multi-objective genetic algorithm applied to autonomous underwater vehicles for sewage outfall plume dispersion observations","2543151":"Applying Mechanism of Crowd in Evolutionary MAS for Multiobjective Optimisation","261480856":"Evolution of neural controllers for robot formation","243566730":"The Realization of a Fast and Effective Optimization Method on Atomic Structure","220381997":"“Optimisation of Weld Deposition Effciency in Pulsed MIG Welding Using Hybrid Neuro-Based Techniques,”","224646003":"QoS Constrained Internet Routing with Evolutionary Algorithms","236003330":"CROSS TALK AWARE MULTI-OBJECTIVE OPTIMAL ROUTING FOR ISLAND-STYLE FPGAs","40742009":"Multi-objective calibration of a distributed hydrological model (wetspa) using a genetic algorithm. Hydrol Earth Syst Sci Discussions","228998067":"Pareto optimal sensor locations for structural identification","228707254":"Interval Robust Multi-objective Algorithm","221532963":"LMI formulation for multiobjective learning in Radial Basis Function neural networks.","225387382":"Microchannel Optimization Using Multiobjective Evolution Strategies","227890060":"Optimal positioning of wind turbines on Gökçeada using multi‐objective genetic algorithm","249766143":"Towards Agent Device Ontology as Genotype","44590260":"Glioma Cell Populations Grouped by Different Cell Type Markers Drive Brain Tumor Growth","2453048":"Design of Single Electron Systems through Artificial Evolution","228856761":"Effective and Efficient Algorithm for Multiobjective Optimization of Hydrologic Models","228590526":"Uncertainty and risk in water quality modelling and management","225999718":"Solution of multiobjective optimization problems: Coevolutionary algorithm based on evolutionary game theory","220742454":"Thoughts on solution concepts.","235683859":"Metaheuristic Optimization Backgrounds: A Literature Review","222767974":"Biological analogies in manufacturing","220637959":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons.","239386722":"KB-GA-Based Hybrid System for Layout Planning of Multistory Buildings","267823582":"ESTUDO COMPARATIVO DOS MÉTODOS DE APTIDÃO PARA PROBLEMAS COM MÚLTIPLOS OBJETIVOS","267870687":"Refined Ranking Relations for Selection of Solutions in Multi Objective Metaheuristics","5607038":"A Multi-Objective Evolutionary Algorithm Toolbox for Computer-Aided Multi-Objective Optimization","2817543":"Metaheuristics for Multiple Objective Combinatorial Optimization","264856038":"Multiobjective optimization of heat radiators using evolutionary algorithms","2633240":"Multi-Objective Evolutionary Algorithms: Introducing Bias Among Pareto-Optimal Solutions","227652514":"Semi‐deterministic and genetic algorithms for global optimization of microfluidic protein‐folding devices","3323398":"Genetic optimization of interval arithmetic-based worst case circuit tolerance analysis","2369041":"A Short Tutorial on Evolutionary Multiobjective Optimization","254320926":"A statistical model-based algorithm for ‘black-box’ multi-objective optimisation","42804410":"An Improved Clonal Algorithm in Multiobjective Optimization","223191925":"Norm-Based Approximation in Multicriteria Programming","35001388":"Compositional evolution : interdisciplinary investigations in evolvability, modularity, and symbiosis /","3950086":"Pareto multiobjective nonlinear regression modelling to aid CAPM analogous forecasting","259170632":"A simulated annealing for multi-criteria optimization problem: DBMOSA","245586072":"Optimisation Combinatoire Multi-Objectif : Apport des Methodes cooperatives et contribution a l\u0027optimisation multi-objectif","222997259":"Multi-objective simulation-based evolutionary algorithm for an aircraft spare parts allocation problem","242436145":"Mechanism of Crowd in Evolutionary MAS for Multiobjecti ve Optimisation","3335793":"SLAVE: A genetic learning system based on an iterative approach","2354789":"The Advantages of Generative Grammatical Encodings for Physical Design","226790338":"Multiobjective structural optimization using a microgenetic algorithm","224301849":"A primal-dual multiobjective evolutionary algorithm for approximating the efficient set","220140374":"An adaptive navigation support system for conducting context-aware ubiquitous learning in museums","2516586":"An Updated Survey of Evolutionary Multiobjective Optimization Techniques :","3421819":"Computational Intelligence in Product Design Engineering: Review and Trends","225137444":"Cell Evolutionary Algorithm: A new optimization method on ground-state energy of the atomic","261693899":"Algorithms for minimal model structure detection in nonlinear dynamic system identification. Int J Control","253755763":"An Ant Colony Optmisation (ACO) based deployment optimisation strategy","260489685":"Interactive Multiobjective Optimization Procedure","2571891":"A GA Based Configuration Design Optimization Method","237344881":"Enhancing the Awareness of Decentralized Cooperative Mobile Robots through Active Perceptual Anchoring","220171080":"Innovation science: A primer","220670845":"PC-based off-line programming in the shipbuilding industry: Open architecture","226943964":"Analysis of Large-Scale mRNA Expression Data Sets by Genetic Algorithms","281206424":"PlanGridEV: D1.4 State-of-the-Art Methods Report A Report on Existing Tools and Methods Including Latest Innovations","271263344":"Genetic Algorithm and Rough Sets Based Hybrid Approach for Economic Environmental Dispatch of Power Systems","222800668":"Optimal VAR dispatch using a multiobjective evolutionary algorithm","48268477":"Gestion adaptative des ressources dans les réseaux maillés sans fil à multiples-radios multiples-canaux","2918001":"M.: Parallel Evolutionary MultiCriterion Optimization for Block Layout Problems","24035120":"A Neural Network Model for Constructing Endophenotypes of Common Complex Diseases: -An Application to Male Young-onset Hypertension Microarray Data","221494125":"A Multi-objective Differential Evolutionary Algorithm Based on Spacial Distance","289601314":"SCA: A Sine Cosine Algorithm for Solving Optimization Problems","268358045":"Effects of Airline Strategies on Airline Operations and Infrastructure Utilization","220953423":"A Novel Multiobjective Evolution Strategy: Design for Adaptive Balance Between Proximity and Diversity.","267954576":"Reduction of Heavy Duty Diesel Engine Emission and Fuel Economy with Multi-Objective Genetic Algorithm and Phenomenological Model","245315831":"Genetic-algorithm-based optimal apportionment of reliability and redundancy under multiple objectives","242153474":"Eects of Airline Strategies on Airline Operations and Infrastructure Utilization","281433770":"A new hybrid PSO algorithm based on a stochastic Markov chain model","244508898":"Using real-valued multi-objective genetic algorithms to model molecular absorption spectra and Raman excitation profiles in solutionElectronic supplementary information (ESI) available: Animations showing the effects of parameters ?, ?e/?g, ?, ?0?0 and M on absorption and Raman profiles. See http://www.rsc.org/suppdata/cp/b3/b315893d","3763787":"Fault tolerant control of active magnetic bearings","221451079":"The Positioning of Base Station in Wireless Communication with Genetic Approach","271851073":"Genetic Programming for Workload Balancing in the Comcute Grid System","224645909":"Robustness Analysis in Multi-Objective Optimization Using a Degree of Robustness Concept","3563073":"Demonstration Of A Phase-noise-canceled Coherent Subcarrier Fiber-optic Communication System","220742481":"A pareto archive evolutionary strategy based radial basis function neural network training algorithm for failure rate prediction in overhead feeders","226398980":"Improving the Performance of Multiobjective Evolutionary Optimization Algorithms Using Coevolutionary Learning","259920133":"Optimization of Landscape Services under Uncoordinated Management by Multiple Landowners","242090002":"Optimizacion Multi-Objetivo y Computacion Grid","220740436":"Using genetic algorithms for naval subsystem damage assessment and design improvements","287479645":"AI techniques for hydrological modeling and management. II: Optimization","228961061":"Numerical optimisation using genetic algorithms","266707300":"A Multiobjective Genetic Learning Process for joint Feature Selection and Granularity and Contexts Learning in Fuzzy Rule-Based Classification Systems","44262438":"Genetic Algorithms for the Optimization of Catalysts in Chemical Engineering","3421873":"Optimal Advertising Campaign Generation for Multiple Brands Using MOGA","24399858":"Objective Reduction in Evolutionary Multiobjective Optimization: Theory and Applications","224490470":"Design optimization of electric machines based on the estimation of permeability distribution","47842387":"Do Additional Objectives Make a Problem Harder?","268889743":"Multiple Objective Combinatorial Optimization — A Tutorial","2811557":"Computing Visibility Areas for Sensor Planning by Means of Genetic Programming","280057376":"Multiobjective Programming With Continuous Genetic Algorithm","227535643":"Exploring the Geographic Consequences of Public Policies Using Evolutionary Algorithms","3958440":"Synthesis of broadband microstrip uncouplers for multiport complex loads","2250423":"Solving multiobjective knapsack problems using MOTS","12473896":"Efficient and Scalable Pareto Optimization by Evolutionary Local Selection Algorithms","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","222843856":"ENCON: An evolutionary algorithm for the antenna placement problem","30519113":"Optimisation Combinatoire Multi-Objectif : Apport des méthodes coopératives et contribution à l\u0027extraction de connaissances","277902856":"Towards a Design Support System for Urban Walkability","12473895":"Multiobjective Satisfaction within an Interactive Evolutionary Design Environment","12473892":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","261107978":"Evolutionary multiobjective optimization for medical classification","224224198":"Simulating the RRS James Clark Ross as part of a multiobjective design process","221162382":"An Evolutionary Mining Model in Incremental Data Mining.","222135196":"A Pareto-optimal genetic algorithm for warehouse multi-objective optimization","228866822":"The Revolution of Evolution for Real-World Applications","221049742":"Generating Lookup Tables Using Evolutionary Algorithms.","220701571":"A Spatial Predator-Prey Approach to Multi-objective Optimization: A Preliminary Study.","2477697":"Handling Constraints in Genetic Algorithms using Dominance-Based Tournaments","245426181":"Statistical Improvement Criteria for Use in Multiobjective Design Optimization","23695311":"Assigning Proctors to Exams with Scatter Search","224472006":"Finding Exact Solutions for Multi-Objective Optimisation Problems using a Symbolic Algorithm","273831678":"Context-aware multi-objective resource allocation in mobile cloud","233009996":"Assembly planning with an ordering genetic algorithm","271634048":"Multi-objective rule mining using genetic algorithms","223818727":"A tool for multiobjective evolutionary algorithms","228655888":"Waste collection vehicle routing problem with time windows using multi-objective genetic algorithms","250662977":"Humanlike Optimization - A Novel Technique for Computational Design","225686466":"Multi-objective dynamic optimal trajectory planning of robot manipulators in the presence of obstacles","229630749":"Multi-criteria optimization of multiproduct batch chemical process using genetic algorithm","4210420":"Robust adaptive control and parameter estimation using multi objective evolutionary algorithm","2367123":"Gunter Rudolph","3450508":"Multiobjective Evolution of Neural Controllers and Task Complexity","3829377":"A meta-heuristic satisfying tradeoff method for solving multiobjective combinatorial optimization problems-with application to flowshop scheduling","227312432":"Scheduling flexible manufacturing systems using parallelization of multi-objective evolutionary algorithms","256238073":"A Multi-Objective Evolutionary Algorithm for enhancing Bayesian Networks hybrid-based modeling","228735772":"Preliminary airframe design using co-evolutionary multiobjective genetic algorithms","3817093":"Design of a neural controller using multiobjective optimization for nonminimum phase systems","220664807":"Structure detection for nonlinear rational models using genetic algorithms","238680312":"Noninferior Surface Tracing Evolutionary Algorithm (NSTEA) for Multi Objective Optimization","277286469":"Procedural Texture Evolution Using Multiobjective","220785642":"Designing Area and Performance Constrained SIMD/VLIW Image Processing Architectures","261394775":"Sliding surface in 1-sliding boosts multi-objective optimization program of shielded metal arc welding process","220285924":"Multi-Objective Methods for Tree Size Control.","220650464":"Seeking the Pareto front for multiobjective spatial optimization problems","220199893":"Evolutionary-based techniques for real-life optimisation: Development and testing","227224385":"Scheduling in Software Development Using Multiobjective Evolutionary Algorithms","227785567":"Optimization of structural dynamic behaviour based on effective modal parameters","223046554":"Scalable multi-objective optimization of industrial purified terephthalic acid (PTA) oxidation process","254353915":"Identification of optimum combination of proportion of vermicompost in the soil-based potting mix and pot volume for the production of paper pot seedlings of vegetables","220584945":"The Faster Higher-Order Cellular Automaton for Hyper-Parallel Undistorted Data Compression.","229673828":"Multiobjective Optimization for Drug Discovery","251621419":"Optimal control of distillation column using Non-Dominated Sorting Genetic Algorithm-II","260024746":"Multidisciplinary design optimization of a compact highly-loaded fan","224453558":"An optimized variable structure control for hydraulic AGC of cold rolling mill","222237671":"A comparison of optimal control and stochastic programming from a formulation and computation perspective","249700409":"ACTIVE CONTOURS MULTIOBJECTIVE OPTIMISATION BY HYBRIDS ALGORITHM - APPLICATION TO LIPS CONTOUR EXTRACTION","220484607":"Creating a Digital Ecosystem: Service Orientated Architectures with Distributed Evolutionary Computing","23541690":"Multiobjective decision support for land-use planning","34686156":"Evolutionäre Verfahren zur Optimierung von Produktionsplänen mittels impliziter Kooperation /","265408780":"Techniques to Deal with Many-objective Optimization Problems Using Evolutionary Algorithms","222569370":"Manipulator trajectory planning using a MOEA","224301953":"Ranking-Dominance and Many-Objective Optimization","272121575":"Fitness-oriented multi-objective optimisation for infrastructures rehabilitations","251238425":"Incorporating User Preferences in Many-Objective Optimization using Relation Epsilon-Preferred","238727391":"Multicriterion Genetic Programming for Trajectory Planning of Underwater Vehicle","262781263":"Evolutionary Computation with Spatial Receding Horizon Control to Minimize Network Coding Resources","228997953":"Motor units based hierarchical genetic algorithm for prediction of muscle force activation patterns","2268869":"An Updated Survey of Evolutionary Multiobjective Optimization Techniques: State of the Art and Future Trends","2361039":"Implications of Interdomain Traffic Characteristics on Traffic Engineering","263387485":"MOIA: Multi-objective immune algorithm","283649543":"Applying Operations Research to Design for Test Insertion Problems","3751624":"Optimising object recognition parameters using a parallel multiobjective genetic algorithm","225710983":"Non-Uniform Flow Effect on Optimal Waste Load Allocation in Rivers","228866903":"Coincidence Algorithm for Combinatorial Optimisation and Its Applications","44002412":"Computational Evolutionary Embryogeny","267690242":"Multi-objective Machine Learning Application: Fuzzy Tuning for the Docking Maneuver Controller of an Automated Guided Vehicle","282134056":"Review sobre el diseño y la optimización de los Intercambiadores de Calor de Tubo y Coraza. Autores","263329968":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons","221522482":"A Cluster-Based Evolutionary Algorithm for Multi-objective Optimization.","258392160":"A Class of Expected Value Bilevel Programming Problems with Random Coefficients Based on Rough Approximation and Its Application to a Production-Inventory System","229350060":"Single Versus Multiple Objective Genetic Algorithms for Solving the Even-Flow Forest Management Problem","41713014":"Combining Evolutionary Algorithms and exact approaches for multi-objective knowledge discovery","2309934":"Comparison of Multiobjective Evolutionary Algorithms on Test Functions of Different Difficulty","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","26308228":"Optimal Solutions of Multiproduct Batch Chemical Process Using Multiobjective Genetic Algorithm with Expert Decision System","220637744":"Cooperative Metaheuristics for Exploring Proteomic Data.","236237068":"Predicting Execution-Time for Variable Behaviour Embedded Real-Time Components","257749060":"Exploring adiabatic quantum trajectories via optimal control","260497567":"The Exact Solution of the Environmental/Economic Dispatch Problem","263989414":"Multiobjective particle swarm optimization based on dimensional update","271933231":"A multi-objective approach for a project scheduling problem with due dates and temporal constraints infeasibilities","220742197":"Robot Trajectory Planning Using Multi-objective Genetic Algorithm Optimization","45860262":"Adaptation and Self-Organization in Evolutionary Algorithms","3217198":"Genetic algorithms: Concepts and applications","233022146":"Optimal selection of suspension parameters in large scale vehicle models","221522455":"Pareto-optimality in Scheduling Problems.","233214661":"Optimal feeding profile in fed-batch bioreactors using a genetic algorithm","271732500":"Multi-objective genetic algorithms based structural optimization and experimental investigation of the planet carrier in wind turbine gearbox","273637222":"Application of Pareto-based multiobjectives genetic algorithm in minimum time motion planning","220199475":"Multiobjective optimization using variable complexity modelling for control system design","239376744":"Structural crack detection without updated baseline model by single and multiobjective optimization","226652847":"Identification of validated multibody vehicle models for crash analysis using a hybrid optimization procedure","3776278":"Evolutionary design of gas turbine aero-engine controllers","262236305":"The naive MIDEA: a baseline multi-objective EA","258226262":"A nonparametric approach using artificial intelligence in vibration and noise reduction of flexible systems","26445479":"Multi-objective Genetic Algorithm for Association Rule Mining Using a Homogeneous Dedicated Cluster of Workstations","224330345":"Order of Nonlinearity as a Complexity Measure for Models Generated by Symbolic Regression via Pareto Genetic Programming","29650675":"DGA and Pareto Elitism : Improving Pareto Optimization","272408331":"Generic Constraints Handling Techniques in Constrained Multi-criteria Optimization and its Application","267665612":"Unsupervised classification. Similarity measures, classical and metaheuristic approaches, and applications","224055904":"Application of multiobjective genetic algorithms in anatomy based dose optimization in brachytherapy and its comparation with deterministic algorithms","223162992":"Importance measures and genetic algorithms for designing a risk-informed optimally balanced system","221006353":"www.cosc.brocku.ca Automatic Evolution of Conceptual Building Architectures","3567368":"Reliability analysis of a mine production system-a case study","40535381":"Evolution und Lernen zur Optimierung neuronaler Strukturen","258021409":"An FPGA-based Approach to Multi-Objective Evolutionary Algorithm for Multi-Disciplinary Design Optimisation","224059934":"Research On Dynamics in Group Decision Support Systems Based On Multi-Objective Genetic Algorithms","224578084":"WBMOIGA: Weight-based multiobjective immune genetic algorithm and its application","273538827":"Production planning of multi-stage multi-option seru production systems with sustainable measures","225217067":"A Domain Decomposition/Nash Equilibrium Methodology for the Solution of Direct and Inverse Problems in Fluid Dynamics with Evolutionary Algorithms","221080170":"A Pareto Self-Organizing Map","2555758":"A Spotlight Search Method For Multi-Criteria Optimization Problems","225391142":"Adaptive weighted-sum method for bi-objective optimization: Pareto front generation","4292363":"Outlier Identification and Justification Using Multi-Objective PSO based Clustering Algorithm in Power System","257673232":"Intelligent Systems in Optimizing Reservoir Operation Policy: A Review","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","226333233":"Direct Load Control in the Perspective of an Electricity Retailer – A Multi-Objective Evolutionary Approach","216300470":"Two New GA-based methods for multiobjective optimization","260913375":"Solution of Economic Emission Load Dispatch problems of power systems by Real Coded Chemical Reaction algorithm","223248925":"An effective ant colony optimization algorithm (ACO) for multi-objective resource allocation problem (MORAP)","234867364":"Photonics East \u002799","225876523":"An Introduction to Multiobjective Metaheuristics for Scheduling and Timetabling","268408992":"A Multi-Objective Genetic Algorithm for the Vehicle Routing with Time Windows and Loading Problem","234125972":"A New Dimensionality Reduction Algorithm for Hyperspectral Image Using Evolutionary Strategy","273749809":"Opposition-Based Multiple-Objective Differential Evolution to Solve the Time–Cost–Environment Impact Trade-Off Problem in Construction Projects","2438983":"Design of Combinational Logic Circuits through an Evolutionary Multiobjective Optimization Approach","263874783":"An Evolutionary Algorithm for Finding Efficient Solutions in Multi-Attribute Auctions","2637634":"Evolutionary Multiobjective Design of Combinational Logic Circuits","221952593":"Immunity-based hybrid evolutionary algorithm for multi-objective optimization in global container repositioning","220742213":"Linguistic Rule Extraction by Genetics-Based Machine Learning.","222198355":"Design of mixed H2/H∞ control systems using algorithms inspired by the immune system","224254515":"A multi-objective optimization for memory BIST sharing using a genetic algorithm","28358367":"Additive approximations of Pareto-optimal sets by evolutionary multi-objective algorithms","46282157":"Ensembles of uncertain mathematical models can identify network response to therapeutic interventions","226620145":"Genetic algorithms in integrated process planning and scheduling","221205087":"Incorporating Distance Domination in Multiobjective Evolutionary Algorithm.","224387631":"Dynamic scheduler - a pervasive healthcare system in smart hospitals using RFID","220742234":"Evolutionary Multiobjective Optimization","264167629":"Seismic design of steel frames using multi-objective optimization","47666592":"Adaptive low-complexity MB-OFDM for ultra-wideband wireless communication","220279387":"Multiobjective genetic algorithm partitioning for hierarchical learning of high-dimensional pattern spaces: A learning-follows-decomposition strategy","2735954":"Experiments on the Usage of Hashing Vectors in Multiobjective Tabu Search","4939568":"Local dominance and local recombination in MOEAs on 0/1 multiobjective knapsack problems. Eur J Oper Res","242360590":"Multi-Objective Optimisation for Information Access Tasks","242376975":"Cost-effective Evolutionary Strategies for Pareto Optimal Front Approximation in Multiobjective Shape Design Optimization of Electromagnetic Devices","265169072":"Cross entropy for multiobjective combinatorial optimization problems with linear relaxations","221936197":"Multiobjective Contaminant Sensor Network Design for Water Distribution Systems","220883625":"Let the Ants Deploy Your Software - An ACO Based Deployment Optimisation Strategy","233011815":"Maximum weight matching and genetic algorithm for fixed-shape facility layout problem","228551193":"Using soft-systems methods to evaluate the outputs from multi-objective land use planning tools","4331461":"Multiobjective genetic estimation to induction motor parameters","235702663":"A Hamilton--Jacobi Equation for the Continuum Limit of Nondominated Sorting","2731940":"Evolution of Pseudo-colouring Algorithms for Image Enhancement with Interactive Genetic Programming","226482930":"On Improving Multiobjective Genetic Algorithms for Design Optimization","220392109":"Predictive and comprehensible rule discovery using a multi-objective genetic algorithm","286600837":"An Integrated Approach to Robust Multi-echelon Inventory Policy Decision","3755949":"On a Multi-Objective Evolutionary Algorithm and Its Convergence to the Pareto Set","220742335":"Discovering a domain alphabet","279060281":"Multiobjective Differential Evolution based Fuzzy Clustering for MR Brain Image Segmentation","220218044":"Precast production scheduling using multi-objective genetic algorithms","220508859":"Computational Intelligence in Product Design Engineering: Review and Trends.","237066625":"A multi objective genetic algorithm for the facility layout problem based upon slicing structure encoding","243788071":"Analysis and applications of evolutionary multiobjective optimization algorithms","224516803":"On the Effects of Adding Objectives to Plateau Functions","233343563":"Optimal choice of wastewater treatment train by multi-objective optimization","2830223":"Inferential Performance Assessment of Stochastic Optimisers and the Attainment Function","251171164":"OPTIMIZATION OF WELL LOCATIONS AND PUMPING RATES IN COASTAL AQUIFERS","257581311":"Multiobjective evolutionary algorithm for manufacturing scheduling problems: State-of-the-art survey","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","4116374":"Design of optimal complex spreading codes for DS-CDMA using an evolutionary approach","251904171":"The Influence of Expected Demands Difference on Slotting Allowances: A Simulation Research Based on NSGA-II Algorithm","220836480":"An Algorithm for Multi-Criteria Optimization in CSPs.","227322405":"Fuzzy Tuning for the Docking Maneuver Controller of an Automated Guided Vehicle","223673086":"Reliability-driven deployment optimization for embedded systems","220199605":"Multi-sensor based prediction of metal deposition in pulsed gas metal arc welding using various soft computing models","263671833":"Función objetivo en el diseño de la laguna facultativa (estudio de caso)","224142067":"The Research on the Matching Design of the Ship-Engine-Propeller Based on Multi-Objective Particle Swarm Optimization","220740249":"A multi-objective algorithm for DS-CDMA code design based on the clonal selection principle","267638849":"Fuzzy random variables-based modeling with GA-P","11452185":"Combinatorial Library Design Using a Multiobjective Genetic Algorithm","223472362":"An empirical study of dynamic customer relationship management","274837409":"Distributed Query Plan generation using Aggregation based Multi-Objective Genetic Algorithm","275349417":"Adaptive division of labor particle swarm optimization","258390183":"Single- versus Multiobjective Optimization for Evolution of Neural Controllers in Ms. Pac-Man","2594789":"Genetic Algorithms, Building Blocks, and Multiobjective Optimization","282879774":"Cárdenas-Rodríguez, J., Yoshimaru, E., \u0026 Randtke, E. (2015, October 12). Design and Optimization of Pulsed Chemical Exchange Saturation Transfer MRI Using a Multiobjective Genetic Algorithm: A Matlab Code","279060326":"Multiobjective Differential Evolution: A Comparative Study on Benchmark Problems","224645798":"A Quadratic Approximation-Based Local Search Procedure for Multiobjective Genetic Algorithms","49837373":"Development of a new spatial analysis tool in mental health: Identification of highly autocorrelated areas (hot-spots) of schizophrenia using a Multiobjective Evolutionary Algorithm model (MOEA/HS)","257605791":"An Element-Free Galerkin-Based Multi-objective Optimization of Laminated Composite Plates","232831527":"A Study on Multiobjective Optimization Technique for Inverse and Crack Identification Problems","226134707":"Multidimensional Optimization with a Fuzzy Genetic Algorithm","231371265":"Multi-objective Decisions on Capacity Planning and Production−Inventory Control under Uncertainty","251353396":"A Multiobjective Extremal Optimization Algorithm for Efficient Mapping in Grids","4001773":"Genetic programming for finding trajectories of underwater vehicle","245561714":"Using the Ant Algorithm to Derive Pareto Fronts for Multiobjective Siting of Emergency Service Facilities","6313904":"Design search and optimization in aerospace engineering","268296236":"COORDINATED RESCHEDULING OF PRECAST PRODUCTION","224211599":"Optimal Location and Size Determination of FACTS Devices by using Multiobjective Optimal Power Flow","260251728":"Performance evaluation and multi-objective optimization of hybrid photovoltaic–thermal collectors","263561312":"Cycle Network Planning: Towards a Holistic Approach Using Temporal Topology","252016850":"Intelligent apparel production planning for optimizing manual operations using fuzzy set theory and evolutionary algorithms","221008628":"Using an enhanced integer NSGA-II for solving the multiobjective Generalized Assignment Problem","222675612":"A Diversified Multiobjective GA for Optimizing Reservoir Rule Curves","260360285":"A survey on multi-objective evolutionary algorithms for many-objective problems","220943095":"Using the Min-Max Method to Solve Multiobjective Optimization Problems with Genetic Algorithms","45538666":"A Model Free Method to Generate Human Genetics Datasets with Complex Gene-Disease Relationships","232634882":"A New Model Solving Multi-Objective Optimization Problems Based on the Evolutionary Algorithm","237089217":"Evolutionary Algorithms and Simulated Annealing for MCDM","237089216":"Evolutionary Hinfin; design of an electromagnetic suspension control system for a maglev vehicle","224125630":"A Generalized Capacitor Voltage Balancing Scheme for Flying Capacitor Multilevel Converters","223886014":"An evolutionary multiobjective framework for structural damage localization and quantification","35732936":"Non-linear PLS using genetic programming /","251926766":"Multi-Objective optimum design of controller for PFC rectifier using NSGA-II algorithm","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","26850934":"Eccentricity Optimization of NGB System by using Multi-Objective Genetic Algorithm","275068821":"Optimal Operation of Klang Gate Dam Using Genetic Algorithm","224645776":"Multiobjective Optimal VAR Dispatch Using Strength Pareto Evolutionary Algorithm","224453271":"Ensemble Member Selection Using Multi-Objective Optimization","222558907":"Behavior generation for a mobile robot based on the adaptive fitness function","273366962":"The discrete time, cost and quality trade-off problem in project scheduling: An efficient solution method based on cellde algorithm","2707410":"Evolutionary Computation: An Overview","228821592":"An object-oriented framework for multiobjective local search","222870196":"A multiobjective evolutionary algorithm for approximating the efficient set","225579663":"Performance-based multiobjective optimum design of steel structures considering life-cycle cost"},"index":705}