{"abs":": This paper presents the multiobjective tabu search method, MOTS. Being an adaptation of the well known tabu search, it is used heuristically to generate non-dominated alternatives to multiobjective combinatorial optimization problems. MOTS works with a set of current solutions which, through manipulation of weights, are optimized towards the nondominated frontier while at the same time seek to disperse over the frontier. The general procedure and some extensions to it are given, as well as suggestions of usage in interactive procedures. A computational experiment is also presented. Keywords: Multiobjective combinatorial optimization (MOCO); Tabu search; Metaheuristics Introduction The general multiobjective combinatorial optimization (MOCO) problem can be stated as follows: \"maximize\" f(x) subject to x S where S is a discrete, finite set of feasible solutions to the problem (the decision space) and f is the n-dimensional objective function to be \"maximized\", f(x) \u003d {f 1 (x),...","title":"Tabu Search for Multiobjective Optimization: MOTS","id":2599118,"url":"https://www.researchgate.net/publication/2599118_Tabu_Search_for_Multiobjective_Optimization_MOTS","names":["Michael Pilegaard Hansen"],"references":{"225500336":"An Interactive Weighted Tchebycheff Procedure for Multiple Objective Programming","220197855":"Quad Trees: A Data Structure for Retrieval on Composite Keys.","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","228057735":"Computers and Intractability: A Guide to NP-Completeness","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","266345330":"The LBS-Discrete Interactive Procedure for Multiple-Criteria Analysis of Decision Problems","237131761":"Lecture Notes in Economics and Mathematical Systems","226178849":"A Users Guide to Tabu Search","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","221984871":"InterQuad: An interactive quad tree based procedure for solving the discrete alternative multiple criteria problem","247251996":"Principles of Multiobjective Optimization","220693571":"Tabu search I","247526500":"Simulated annealing for multiobjective optimization problems","223421047":"Unified interactive multiple objective programming","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","220470740":"The Pros and Cons of Goal Programming","227446462":"A Combined Tchebycheff/Aspiration Criterion Vector Interactive Multiobjective Programming Procedure","4942714":"Planning of high school examinations in Denmark","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","227947168":"Multi‐objective combinatorial optimization problems: A survey","222000194":"A visual reference direction approach to solving discrete multiple criteria problems","234898362":"Tabu search part II","243767421":"Handbook of Critical Issues in Goal Programming"},"citedIn":{"224904046":"A Multiobjective Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","220981282":"Towards Landscape Analyses to Inform the Design of Hybrid Local Search for the Multiobjective Quadratic Assignment Problem.","257196127":"The Development of a Multi-Objective Tabu Search Algorithm for Continous Optimisation Problems","2642725":"Evaluating the Quality of Approximations to the Non-Dominated Set","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","223575390":"Bi-objective resource-constrained project scheduling with robustness and makespan criteria","220403501":"An Interactive Method for 0-1 Multiobjective Problems Using Simulated Annealing and Tabu Search.","44450472":"Diseño de un sistema de recogida de residuos urbanos : enfoque multiobjetivo y uso de metaheurísticos","221008418":"A hybrid Genetic Algorithm for multiobjective structural optimization","226211700":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","228572559":"Multi-case multi-objective simulated annealing (MC-MOSA): New approach for adapt simulated annealing to multi-objective optimization","223656260":"A hybrid multi-objective shuffled frog-leaping algorithm for a mixed-model assembly line sequencing problem","289013803":"Metaheuristics","236849933":"Assigning Proctors to Exams with Scatter Search","228572555":"Optimum Design of Sensor Arrays via Simulation-Based Multivariate Calibration","37413423":"Scalable intelligent electronic catalogs","242655331":"An integrated model for the frequency and timetabling problem","224152394":"Multi-Objective WSN Deployment: Quality of Monitoring, Connectivity and Lifetime","222427478":"Multi-objective tabu search using a multinomial probability mass function","215634115":"A Species-Conserving Genetic Algorithm for Multimodal Optimization","249970684":"A Multiobjective Memetic Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","221228595":"A Multi-objective Tabu Search Algorithm for Constrained Optimisation Problems","224904057":"Multiobjective memetic algorithms for time and space assembly line balancing","226550943":"Pareto Local Optimum Sets in the Biobjective Traveling Salesman Problem: An Experimental Study","221024269":"The Importance of Scalability When Comparing Dynamic Weighted Aggregation and Pareto Front Techniques","220121403":"A hybrid meta-heuristic for multi-objective optimization: MOSATS","32169932":"Multiobjective heuristic approaches to seismic design of steel frames with standard sections. Earthq Eng Struct Dyn","239207268":"Time-Predefined and Trajectory-Based Search: Single and Multiobjective Approaches to Exam Timetabling","5607038":"A Multi-Objective Evolutionary Algorithm Toolbox for Computer-Aided Multi-Objective Optimization","220403464":"Pruned Pareto-optimal sets for the system redundancy allocation problem based on prioritized objectives","221432066":"Parallel Tabu Search and the Multiobjective Capacitated Vehicle Routing Problem with Soft Time Windows","282538466":"A Novel Bioinspired Multiobjective Optimization Algorithm for Designing Wireless Sensor Networks in the Internet of Things","280751757":"A Multiobjective Memetic Algorithm for Solving the Carsharing Problem","220371477":"A multi-objective scatter search for a mixed-model assembly line sequencing problem","272239875":"Bi-criteria appointment scheduling of patients with heterogeneous service sequences","267723726":"ALGORITMO GENÉTICO PARA O PROBLEMA DE ESCALONAMENTO DE TAREFAS EM MÁQUINAS PARALELAS COM MÚLTIPLOS OBJETIVOS","220742420":"Multiprocessor systems-on-chip synthesis using multi-objective evolutionary computation","220291356":"Solving a bi-objective flowshop scheduling problem by a Multi-objective Immune System and comparing with SPEA2+and SPGA","220119075":"Multiobjective memetic algorithms for time and space assembly line balancing","245331104":"Workload simulation and optimisation in multi-criteria hybrid flowshop scheduling: A case study","226069553":"Solving a multi-objective no-wait flow shop scheduling problem with an immune algorithm","224301847":"Indicator-based multi-objective local search","267569339":"A MEMORY-BASED GRASP HEURISTIC FOR THE MULTIOBJECTIVE MULTIDIMENSIONAL KNAPSACK PROBLEM","242441016":"Using Soft CSPs f or A ppr oximating P ar eto-Optimal Solution Sets Mar c T orr ens and Boi F altings","3418745":"Balance between genetic search and local search in memetic algorithms for multiobjective permutation flowshop scheduling. IEEE Trans Evol Comput","263285758":"New scheduling algorithm for Uplink LTE System","256721437":"Improving collaborative filtering-based recommender systems results using Pareto dominance","224606514":"A Favorable Weight-Based Evolutionary Algorithm for Multiple Criteria Problems","222944794":"A solution procedure for the discrete time, cost and quality tradeoff problem using electromagnetic scatter search","220669042":"SSPMO: A Scatter Tabu Search Procedure for Non-Linear Multiobjective Optimization","2248820":"Use of Substitute Scalarizing Functions to Guide a Local Search Based Heuristic: The Case of moTSP","8337702":"MAGMA: A Multiagent Architecture for Metaheuristics","261040086":"The multi-objective controller adjustment using Ants system metaheuristic for non linear systems described by TS fuzzy models","2545020":"A Bi-objective Model for Maximizing the Quality in Project Scheduling","4204828":"Resource placement in content delivery networks using hybrid genetic algorithm","225876523":"An Introduction to Multiobjective Metaheuristics for Scheduling and Timetabling","228851709":"An implementation of Pareto optimality in CLP (FD)","221091186":"A GRASP Algorithm for the Multi-Objective Knapsack Problem.","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","284032911":"Downlink Packet Scheduling Algorithm using Tabu Method in LTE Systems","225549336":"On dominance-based multiobjective local search: Design, implementation and experimental analysis on scheduling and traveling salesman problems","221228614":"Multi-objective Go with the Winners Algorithm: A Preliminary Study","1920886":"Metaheuristics and Their Hybridization to Solve the Bi-objective Ring Star Problem: a Comparative Study","46590893":"Optimización de tensión en redes de distribución utilizando técnicas evolutivas [Power network voltage optimization using evolutive algorithms]","228735698":"Selection of road project portfolios","228987605":"Improved taboo search algorithm for designing DNA sequences","220260438":"Coordination based Multiple Criteria Decision Making.","239537712":"An Immune Algorithm for Engineering Optimization","2405470":"Partially Ordered Constraint Optimization Problems","2735954":"Experiments on the Usage of Hashing Vectors in Multiobjective Tabu Search","228871640":"Guided Pareto Local Search and its Application to the 0/1 Multi-objective Knapsack Problems","228085784":"Multiobjective Metaheuristics for the Bus Driver Scheduling Problem","221335216":"Adapting Multi-Objective Meta-Heuristics for Graph Partitioning.","263369777":"Multi-objective optimization using metaheuristics: Non-standard algorithms","220176793":"Solving a bi-criteria permutation flow-shop problem using shuffled frog-leaping algorithm","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","243941122":"On the Computational Effectiveness of Multiple Objective Metaheuristics","254341537":"RECHERCHE DE SOLUTIONS DE COMPROMIS EN ORDONNANCEMENT A L\u0027AIDE DE METAHEURISTIQUES","228467980":"An interactive heuristic method for multi-objective combinatorial optimization","2250423":"Solving multiobjective knapsack problems using MOTS","220089220":"A multi-objective particle swarm for a flowshop scheduling problem. J Comb Optim","221633454":"Partially Ordered Constraint Optimization Problems.","221335210":"A Multiobjective Metaheuristic for Spatial-based Redistricting","227003420":"Multiobjective Combinatorial Optimization — Theory, Methodology, and Applications","278689282":"A Fast Local Search Approach for Multiobjective Problems","223087337":"A study of local search algorithms for the biobjective QAP with correlated flow matrices","23695311":"Assigning Proctors to Exams with Scatter Search","220836480":"An Algorithm for Multi-Criteria Optimization in CSPs.","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","291402741":"Multi-objective combinatorial optimization Multi-objective Combinatorial Optimization","258207432":"Metaheurísticas Multi-Objetivo para Equilibrado de Líneas de Montaje en Automoción: Optimización Conjunta de Tiempo y Espacio","37245588":"Metaheuristic and Multiobjective Approaches for Space Allocation","220828036":"A Tabu Search Approach to Fuzzy Optimization of","221008257":"On Universal Search Strategies for Multi-Criteria Optimization","2241938":"M-PAES: A Memetic Algorithm for Multiobjective Optimization","36146583":"Traffic engineering in MPLS networks with multiple objectives : modeling and optimization /","226333897":"Performance of the MOSA Method for the Bicriteria Assignment Problem","257697513":"Multiobjective vehicle routing problem with fixed delivery and optional collections","37762039":"The Crew-Scheduling Module in the GIST System","2318489":"Advanced Multi-objective Evolutionary Algorithms Applied to two Problems in Telecommunications","244684585":"Parallel Tabu Search and the Multiobjective Vehicle Routing Problem with Time Windows","2518682":"Using Soft CSPs for Approximating Pareto-Optimal Solution Sets","220701921":"Multi-objective Parallel Tabu Search","223245705":"A hybrid multi-objective immune algorithm for a flow shop scheduling problem with bi-objectives: weighted mean completion time and weighted mean tardiness. Info Sci","261024070":"Research on the method to coordinate the aircraft echelon use of aviation fleets","252018382":"A Multiobjective Memetic Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","237129710":"Cost-Based Filtering for Determining the Pareto Frontier","228085588":"Geração de Serviços de Motoristas através de Metaheuristicas - Sistema GIST ( The Gist system for public transportation: the bus-driver scheduling module)","225563839":"The efficiency of indicator-based local search for multi-objective combinatorial optimisation problems","220403436":"CHESS—Changing Horizon Efficient Set Search: A Simple Principle for Multiobjective Optimization","220403444":"Target aiming Pareto search and its application to the vehicle routing problem with route balancing","35928573":"Asset replacement considering environmental and economic objectives.","2626292":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","235072994":"Search Techniques for Multi-Objective Optimization of Mixed-Variable Systems Having Stochastic Responses","278704766":"Combining Two Search Paradigms for Multi-objective Optimization: Two-Phase and Pareto Local Search","220121333":"A Multiobjective Hybrid Metaheuristic Approach for GIS-based Spatial Zoning Model","4817058":"\"MOSS\" multiobjective scatter search applied to non-linear multiple criteria optimization","226000279":"An Intelligent GIS-Based Spatial Zoning System with Multiobjective Hybrid Metaheuristic Method","216300052":"An Interactive Method for 0-1 Multiobjective Problems Using Simulated Annealing and Tabu Search","232274985":"Annealing-tabu PAES: a Multi-objective Hybrid Meta-heuristic","223794340":"Solution of constrained optimization problems by multi-objective genetic algorithm. Comp","237233109":"MOMBES Multiobjective Modelbased Evolution Strategy","224211882":"An algebraic approach to mechanical tabu search algorithm generation","225216146":"Tabu Search Based Procedure for Solving the 0-1 MultiObjective Knapsack Problem: The Two Objectives Case","230794814":"MOCSA: multiobjective optimization by conformational space annealing"},"index":706}