{"abs":"This paper reports simulation experiments, applying the cross entropy method such as the importance sampling algorithm for efficient estimation of rare event probabilities in Markovian reliability systems. The method is compared to various failure biasing schemes that have been proved to give estimators with bounded relative errors. The results from the experiments indicate a considerable improvement of the performance of the importance sampling estimators, where performance is mea- sured by the relative error of the estimate, by the relative error of the estimator, and by the gain of the importance sampling simulation to the normal simulation.","title":"Importance Sampling Simulations of Markovian Reliability Systems Using Cross-Entropy","id":4785522,"url":"https://www.researchgate.net/publication/4785522_Importance_Sampling_Simulations_of_Markovian_Reliability_Systems_Using_Cross-Entropy","names":["Ad Ridder","Annals of Operations Research"],"references":{"224103803":"Modeling and analysis of computer system availability","37616893":"Application of the Cross-Entropy Method to the Buffer Allocation Problem in a Simulation-Based Environment","227447407":"Fast Simulation of Markov Chains with Small Transition Probabilities","225210701":"Fast simulation of rare events in queueing and reliability models","225656913":"Probabilistic modeling of computer system availability","227446636":"Importance Sampling for the Simulation of Highly Reliable Markovian Systems","2837897":"Rare Event Estimation for Static Models via Cross-Entropy and Importance Sampling","3885977":"Adaptive importance sampling simulation of queueing networks","222461568":"Optimization of computer simulation models with rare events. Eur J Oper Res","220641806":"Adaptive Importance Sampling.","223793629":"Fast transient simulation of Markovian models of highly dependable systems","236231098":"The System Availability Estimator","2484042":"The Cross-Entropy Method for Combinatorial and Continuous Optimization","37616845":"A Fast Cross-Entropy Method for Estimating Buffer Overflows in Queueing Networks","3152389":"A Fast Monte Carlo Method for Evaluating Reliability Indexes","226494839":"The Cross-Entropy Method for Network Reliability Estimation","220331546":"A Unified Framework for Simulating Markovian Models of Highly Dependable Systems.","221596457":"Fast simulation of rare events in queueing and reliability models. ACM TOMACS 6:43-85","2400282":"Steady State Rare Events Simulation in Queueing Models and its Complexity Properties","3152495":"Splitting-based importance-sampling algorithm for fast simulation of Markov reliability models with general repair-policies"},"citedIn":{"262417444":"Efficient Statistical Model Checking of Hardware Circuits With Multiple Failure Regions","261059790":"Software reliability estimation method based on Markov usage models using Importance Sampling","261857754":"Runtime Verification of Biological Systems","251043444":"Cross-Entropy Method Based on Markov Decision Process for Optimal Software Testing: Cross-Entropy Method Based on Markov Decision Process for Optimal Software Testing","228940071":"Cross-Entropy Method","45905337":"Asymptotic optimality of the cross-entropy method for Markov chain problems","262764972":"Entropy based redundancy allocation in serial-parallel systems with choices of redundancy strategy and component type: A multi objective model","261986197":"Entropy based region reducing genetic algorithm for reliability redundancy allocation in interval environment","50996224":"Handbook of Monte Carlo Methods","262215532":"Importance Splitting for Statistical Model Checking Rare Properties","226218344":"A Tutorial on the Cross-Entropy Method","288932267":"Unavailability estimation of shutdown system of a fast reactor by Monte Carlo simulation","257740362":"Damage Tolerance and Reliability Assessment under Random Markovian Loads","228020876":"Markovian Models for Dependability Analysis","278747139":"On statistical model checking with PLASMA","222400478":"The cross-entropy method with patching for rare-event simulation of large Markov chains","276019116":"Application of Entropy-weight Fuzzy Comprehensive Evaluation Method in Post Safety Competency Appraisal of Special Operation Staff in Coal Enterprises","290767921":"Automated Rare Event Simulation for Stochastic Petri Nets","260651375":"Simulation method for reliability of TT\u0026C mission with high redundancy and small time horizon","228989452":"The Cross-Entropy Method for Estimation","262329352":"A Platform for High Performance Statistical Model Checking – PLASMA","259518744":"The cross-entropy method for reliability assessment of cracked structures subjected to random Markovian loads","221659716":"Cross-Entropy Optimisation of Importance Sampling Parameters for Statistical Model Checking","273369852":"Cross-Entropy as an Optimization Method for Bridge Condition Transition Probability Determination","257516261":"Reliability measures for two-part partition of states for aggregated Markov repairable systems","46401273":"Improved Cross-Entropy Method for Estimation"},"index":708}