{"abs":"We present a new analysis of the LebMeasure algorithm for calculating hypervolume. We prove that although it is polynomial in the number of points, LebMeasure is exponential in the number of objectives in the worst case, not polynomial as has been claimed previously. This result has important implications for anyone planning to use hypervolume, either as a metric to compare optimisation algorithms, or as part of a diversity mechanism in an evolutionary algorithm.","title":"A New Analysis of the LebMeasure Algorithm for Calculating Hypervolume","id":221228450,"url":"https://www.researchgate.net/publication/221228450_A_New_Analysis_of_the_LebMeasure_Algorithm_for_Calculating_Hypervolume","names":["R. Lyndon While"],"references":{"216301189":"A Critical Survey of Performance Indices for Multi-Objective Optimisation","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","246816017":"Metrics for Quality Assessment of a Multiobjective Design Optimization Solution Set","216457263":"Lecture Notes in Computer Science","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","2241938":"M-PAES: A Memetic Algorithm for Multiobjective Optimization","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","277291920":"The Measure of Pareto Optima. Applications to Multi-objective Metaheuristics","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","216301279":"On the Evolutionary Optimisation of Many Objectives","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","4074752":"Bounded archiving using the Lebesgue measure","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"228572187":"On objective conflicts and objective reduction in multiple criteria optimization","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","226145598":"Faster Hypervolume-Based Search Using Monte Carlo Sampling","24399858":"Objective Reduction in Evolutionary Multiobjective Optimization: Theory and Applications","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","4201672":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","228451794":"Dimensionality reduction in multiobjective optimization with (partial) dominance structure preservation: Generalized minimum objective subset problems","3419046":"Dominance-Based Multiobjective Simulated Annealing","216300272":"Hypervolumen-basierte Selektion in einem evolutionären Algorithmus zur Mehrzieloptimierung","221008825":"Improving hypervolume-based multiobjective evolutionary algorithms by using objective reduction methods","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","237009142":"Bi-objective optimization of the intermodal terminal location problem as a policy-support tool","202255127":"The Multi-objective Variable Metric Evolution Strategy, Part I","226254437":"On Handling a Large Number of Objectives A Posteriori and During Optimization","225836716":"A Hypervolume-Based Optimizer for High-Dimensional Objective Spaces","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","4201499":"Multi-objective optimisation using S-metric selection: application to three-dimensional solution spaces","220381049":"A Fast Way of Calculating Exact Hypervolumes","220742772":"An Analysis of the Effects of Population Structure on Scalable Multiobjective Optimization Problems","266376639":"On the Performance of Multiobjective Evolutionary Algorithms in Automatic Parameter Extraction of Power Diodes","224645825":"An Improved Dimension-Sweep Algorithm for the Hypervolume Indicator","266404420":"Conversion of a Multi-Objective Evolutionary Algorithm to a Single-Objective Evolutionary Algorithm","227702263":"Evolutionary multiobjective optimization","278619582":"A Correlation Analysis of Set Quality Indicator Values in Multiobjective Optimization","224645892":"Maximising Hypervolume for Selection in Multi-objective Evolutionary Algorithms","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","224579855":"On the Complexity of Computing the Hypervolume Indicator","237391958":"Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods","259982925":"Pareto archived dynamically dimensioned search with hypervolume-based selection for multi-objective optimization","256456253":"A Novel Slicing Based Algorithm to Calculate Hypervolume for Multi-Objective Optimization Problems","224580118":"Convergence Acceleration Operator for Multiobjective Optimization","221025114":"Lecture Notes in Computer Science","220701968":"Are All Objectives Necessary? On Dimensionality Reduction in Evolutionary Multiobjective Optimization","261054005":"MOMBI: A new metaheuristic for many-objective optimization based on the R2 indicator","45229385":"Improved step size adaptation for the MO-CMA-ES","49282386":"Heuristics for Optimising the Calculation of Hypervolume for Multi-objective Optimisation Problems","224301859":"Incrementally maximising hypervolume for selection in multi-objective evolutionary algorithms"},"index":709}