{"abs":"The buffer allocation problem (BAP) is a well-known difficult problem in the design of production lines. We present a stochastic algorithm for solving the BAP, based on the cross-entropy method, a new paradigm for stochastic optimization. The algorithm involves the following iterative steps: (a) the generation of buffer allocations according to a certain random mechanism, followed by (b) the modification of this mechanism on the basis of cross-entropy minimization. Through various numerical experiments we demonstrate the efficiency of the proposed algorithm and show that the method can quickly generate (near)-optimal buffer allocations for large production lines.","title":"Application of the Cross-Entropy Method to the Buffer Allocation Problem in a Simulation-Based Environment","id":37616893,"url":"https://www.researchgate.net/publication/37616893_Application_of_the_Cross-Entropy_Method_to_the_Buffer_Allocation_Problem_in_a_Simulation-Based_Environment","names":["Gad Allon","Dirk P. Kroese","Tal Raviv","Reuven Y. Rubinstein","Annals of Operations Research"],"references":{"222461568":"Optimization of computer simulation models with rare events. Eur J Oper Res","237249638":"PRODUCTION LINE BUFFER ALLOCATION: Genetic Algorithms Versus Simulated Annealing 1 2","268611841":"Concavity of the Throughput of Tandem Queueing Systems with Finite Buffer Storage Space","221525436":"Rare event simulation and combinatorial optimization using cross entropy: sequence alignment by rare event simulation.","220118677":"Optimization by Simulated Annealing","233437218":"A model management system (MMS) for the design and operation of production lines","222080368":"The Throughput Rate of Multistation Unreliable Production Lines","243638346":"Tabu Search-Modern Heuristic Techniques for Combinatorial Problems","239280588":"Stochastic Models of Manufacturing Systems","226737100":"Efficient algorithms for buffer space allocation","222061612":"Buffer allocation in unreliable production lines using a knowledge based system","2460725":"A Simulated Annealing Approach for Buffer Allocation in Reliable Production Lines","220285680":"A Graph-based Ant System and its convergence","2600432":"A Simulated Annealing Approach for Buffer Allocation in Reliable Production Lines","2396030":"Cross-Entropy and Rare Events for Maximal Cut and Partition Problems","226642271":"Structured buffer-allocation problems","3418512":"Gambardella, L.M.: Ant Colony System: A cooperative learning approach to the Traveling Salesman Problem. IEEE Tr. Evol. Comp. 1, 53-66","2786764":"AntNet: Distributed Stigmergetic Control for Communications Networks","5589170":"Ant System: Optimization by a colony of cooperating agents. IEEE Trans Syst Man Cybernetics - Part B","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","283996103":"Genetic Algorithms In Search, Optimization, and Machine Learning","37617233":"SABRES: Sequence Alignment By Rare Event Simulation","2484042":"The Cross-Entropy Method for Combinatorial and Continuous Optimization","201975931":"Simulated Annealing and Boltzmann Machines: A Stochastic Approach to Combinatorial Optimization and Neural Computing","254759067":"Monotonicity of the throughput in single server production and assembly networks with respect to the buffer sizes","231982565":"A GENERALIZED CONVERGENCE RESULT FOR THE GRAPH-BASED ANT SYSTEM METAHEURISTIC","2485906":"Using the Cross-Entropy Method to Guide/Govern Mobile Agent\u0027s Path Finding in Networks","220469523":"New Parallel Randomized Algorithms for the Traveling Salesman Problem","268007374":"Combinatorial optimization, cross-entropy, ants and rare events","262209050":"Nested Partitions Method for Global Optimization","201977138":"Ant Colony System: A Cooperative Learning Approach to the Traveling Salesman Problem","220430942":"Equivalence, Reversibility, Symmetry and Concavity Properties in Fork-Join Queueing Networks with Blocking.","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"228940071":"Cross-Entropy Method","20552250":"Analysis of alkyl sulfates in protein solutions by isocratic and gradient ion chromatography","26405905":"A dynamic programming algorithm for the buffer allocation problem in homogeneous asymptotically reliable serial production lines","225194729":"Solving the Vehicle Routing Problem with Stochastic Demands using the Cross-Entropy Method","50996224":"Handbook of Monte Carlo Methods","51639583":"Fixed-point algorithms for constrained ICA and their applications in fMRI data analysis","221115452":"Cross-Entropy-Based Replay of Concurrent Programs","220166413":"The Cross-Entropy Method for Policy Search in Decentralized POMDPs.","226218344":"A Tutorial on the Cross-Entropy Method","260769304":"Apron layout design and flight-to-gate assignment at Lanseria International Airport","269723014":"Multispectral image unsupervised segmentation using watershed transformation and cross-entropy minimization in different land use","263492012":"A methodology for the design and operation of pull-based supply chains","2833584":"A Tutorial on the Cross-Entropy Method","264007841":"Optimisation combinatoire par entropie croisée : application à des problèmes de grandes tailles dans les entrepôts logistiques","239392218":"The pull evolution: from Kanban to customised token-based systems","225719510":"Setting gates for activities in the stochastic project scheduling problem through the cross entropy methodology","224239615":"A Stochastic Approximation Framework for a Class of Randomized Optimization Algorithms","226375514":"An Early Warning System for Loan Risk Assessment Based on Rare Event Simulation","3152916":"Network Reliability Optimization via the Cross-Entropy Method","224084734":"Cross-Entropy optimization for sensor selection problems","250159564":"A Model Reference Adaptive Search Method for Stochastic Global Optimization","239767522":"SETTING GATES IN THE STOCHASTIC PROJECT SCHEDULING PROBLEM USING CROSS ENTROPY","220403595":"A cross entropy based algorithm for reliability problems","260392109":"Production rate of synchronous transfer lines using Monte Carlo simulation","253945099":"The Accelerated Cross Entropy Method: An Application to the Max-Cut Problem","4111758":"Global likelihood optimization via the cross-entropy method with an application to mixture models","256030320":"A Comparison of Cross Entropy Approaches for the Classical Vehicle Routing Problem","257337444":"A cross-entropy-based approach for the optimization of flexible process planning","275720669":"Simulation Optimization: A Review and Exploration in the New Era of Cloud Computing and Big Data","279242256":"Chapter 3. The Cross-Entropy Method for Optimization","4139018":"MaTCH : Mapping Data-Parallel Tasks on a Heterogeneous Computing Platform Using the Cross-Entropy Heuristic","257153765":"Two approaches for solving the buffer allocation problem in unreliable production lines","224123884":"On the performance of the Cross-Entropy method","235172019":"Planning for an Adaptive Evader with Application to Drug Interdiction Operations","224305255":"An importance sampling method with applications to rare event probability","20552448":"[Frequency and etiology in peranesthetic cardiac arrest: in 102,468 anesthesias].","278686502":"A parallel tabu search for solving the primal buffer allocation problem in serial production systems","4785522":"Importance Sampling Simulations of Markovian Reliability Systems Using Cross-Entropy","234812096":"Rare event simulation and combinatorial optimization using cross entropy: estimating buffer overflows in three stages using cross-entropy","220470042":"An adaptive tabu search approach for buffer allocation problem in unreliable non-homogenous production lines","220136543":"Simulation optimization using the cross-entropy method with optimal computing budget allocation.","222407301":"Hybridizing the cross-entropy method: An application to the max-cut problem","281255686":"A review of optimal computing budget allocation algorithms for simulation optimization problem","235908810":"Bitner M. A. \u0026 Cahuzac B. — The genus Cryptopora (Brachiopoda) from the Miocene of France and its history and biogeography. Geobios","4206599":"On the design of multi-type networks via the cross-entropy method","272180862":"A Tradeoff Model for Green Supply Chain Planning: A Leanness-versus-Greenness Analysis","255602420":"ON THE SERVER ALLOCATION IN LARGE RELIABLE PRODUCTION LINES WITH EXPONENTIAL PROCESSING TIMES","267375271":"Network Reliability Estimation","4348810":"Application of the Cross Entropy Method to the Credit Risk Assessment in an Early Warning System","257580946":"The state of the art on buffer allocation problem: A comprehensive survey","220437226":"Effective and Diverse Adaptive Game AI","271753851":"The cross-entropy method for solving bi-criteria network flow problems in discrete-time dynamic networks","263371896":"A DSS for the buffer allocation of production lines based on a comparative evaluation of a set of search algorithms","221528824":"Rare event simulation and combinatorial optimization using cross entropy: estimating buffer overflows in three stages using cross-entropy.","269556444":"Multi-Objective Buffer Space Allocation with the Cross-Entropy Method","221525754":"Stochastic optimization using model reference adaptive search","251509420":"Enhanced cross-entropy method for dynamic economic dispatch with valve-point effects","2836860":"Basis Function Adaptation in Temporal Difference Reinforcement Learning","274462860":"Improved Cross Entropy Algorithm for the Optimum of Charge Planning Problem","220543359":"Learning to Play Using Low-Complexity Rule-Based Policies: Illustrations through Ms. Pac-Man.","3997920":"Estimating buffer overflows in three stages using Cross-Entropy","266560573":"Research reactor in-core fuel management optimisation using the multiobjective cross-entropy method","232062731":"A Stochastic Optimization Method for Partially Decomposable Problems, with Applications to Analysis of NMR Spectra","233449099":"A tabu search approach for buffer allocation in production lines with unreliable machines","220461888":"Predetermined intervals for start times of activities in the stochastic project scheduling problem","282380087":"Sensor selection-based fusion considering cross-correlation of local estimation errors","252006754":"Comparative analysis of two fuzzy rule base optimization methods","283337738":"Performance comparison of three meta-heuristic algorithms for solving a green supply chain planning problem","4298155":"Cross-Entropy Based Testing","226892139":"Optimization Customized Token-Based Production Control Systems Using Cross-Entropy","272239703":"A Tradeoff Model for Greesn Supply Chain Planning: A Leanness-versus-Greenness Analysis","277909758":"Adaptive probabilistic harmony search for binary optimization problems","279211083":"A Hybrid Algorithm for Parameter Tuning in Fuzzy Model Identification","37616845":"A Fast Cross-Entropy Method for Estimating Buffer Overflows in Queueing Networks","43459303":"Designing an Optimal Network Using the Cross-Entropy Method","251951349":"An importance sampling method based on variance minimization with applications to credit risk","224324397":"An Importance Sampling Method Based on Martingale with Applications to Rare Event Probability","222952511":"A cross entropy approach to design of reliable networks","226494839":"The Cross-Entropy Method for Network Reliability Estimation","220550610":"Sparse and silent coding in neural circuits.","220244184":"A Model Reference Adaptive Search Method for Global Optimization","48907793":"Techniques d\u0027optimisation déterministe et stochastique pour la résolution de problèmes difficiles en cryptologie","220481498":"Sparse and silent coding in neural circuits","269724141":"Tactical supply chain planning under a carbon tax policy scheme: A case study"},"index":710}