{"abs":"In this paper, we study the problem features that may cause a multi-objective genetic algorithm (GA) difficulty to converge to the true Pareto-optimal front. Identification of such features helps us develop difficult test problems for multi-objective optimization. Multi-objective test problems are constructed from single-objective optimization problems, thereby allowing known difficult features of single-objective problems (such as multi-modality or deception) to be directly transferred to the corresponding multi-objective problem. In addition, test problems having features specific to multi-objective optimization are also constructed. The construction methodology allows a simpler way to develop test problems having other difficult and interesting problem features. More importantly, these difficult test problems will enable researchers to test their algorithms for specific aspects of multi-objective optimization in the coming years.","title":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","id":28352092,"url":"https://www.researchgate.net/publication/28352092_Multi-objective_Genetic_Algorithms_Problem_Difficulties_and_Construction_of_Test_Problems","names":["Kalyanmoy Deb","Evolutionary Computation"],"references":{"2710889":"Learning Gene Linkage to Efficiently Solve Problems of Bounded Difficulty Using Genetic Algorithms","220885675":"A Simulated Annealing Like Convergence Theory for the Simple Genetic Algorithm.","243657415":"Convergence properties of canonical genetic algorithms","239023800":"Multi-Objective function optimization using non-dominated sorting genetic algorithms, Evolutionary Computation, 2(3):221-248","2526190":"Fundamental Principles of Deception in Genetic Search","237415855":"Multiobjective Dynamic Optimization of an Industrial Nylon 6 Semibatch Reactor Using Genetic Algorithm","220701613":"A Decoder-Based Evolutionary Algorithm for Constrained Parameter Optimization Problems.","220885536":"Use of Genetic Algorithms in Multicriteria Optimization to Solve Industrial Problems.","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","2799608":"Massive Multimodality, Deception, and Genetic Algorithms","3755949":"On a Multi-Objective Evolutionary Algorithm and Its Convergence to the Pareto Set","201976350":"Messy Genetic Algorithms: Motivation, Analysis, and First Results","3642863":"The Gene Expression Messy Genetic Algorithm","243686111":"Messy genetic algorithms: Motivation","243686559":"Real-coded Genetic Algorithms with Simulated Binary Crossover: Studies on Multi-modal and Multi-objective Problems. Complex Systems 9(6), 431-454","2527551":"The GENITOR Algorithm and Selection Pressure: Why Rank-Based Allocation of Reproductive Trials is Best","243686554":"Optimization for Engineering Design: Algorithms and Examples","2584888":"An Evolutionary Algorithm for Multiobjective Optimization: The Strength Pareto Approach","222838551":"Hybridization of a multi-objective genetic algorithm, a neural network and a classical optimizer for complex design problem in fluid dynamics","220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","2239554":"Evolutionary Search for Minimal Elements in Partially Ordered Finite Sets","201976488":"Uniform Crossover in Genetic Algorithms","235709741":"Lecture Notes in Computer Science","220701571":"A Spatial Predator-Prey Approach to Multi-objective Optimization: A Preliminary Study.","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","2250117":"Deception Considered Harmful","220642765":"A Probabilistic Matching Algorithm for Computer Vision.","243665386":"Genetic Algorithms in Searching","3056066":"Genetic algorithm design of Pareto optimal broadband microwave absorbers","243686570":"Genetic-algorithm-based design of ground-water quality monitoring system","201976807":"The CHC Adaptive Search Algorithm: How to Have Safe Search When Engaging in Nontraditional Genetic Recombination","3411845":"Multi-Objective Optimization and Multiple Constraint Handling with Evolutionary Algorithms – Part II: A Unified Formulation","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","48485654":"Engineering Optimization: Methods and Applications: Second Edition","2525200":"Serial and Parallel Genetic Algorithms as Function Optimizers","225783245":"Selective breeding in a multiobjective genetic algorithm","201976242":"A Markov Chain Analysis on A Genetic Algorithm","236443691":"Some Experiments in Machine Learning Using Vector Evaluated Genetic Algorithms","216457304":"Lecture Notes in Computer Science","243666680":"F1.9 Multicriterion decision making","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"223080779":"G-dominance: Reference point based dominance for multiobjective metaheuristics","280067249":"Multi-Objective Optimization of the Hydroforming Process Considering Different Plastic Yield Criteria","220797224":"Adaptive Methods to Improve Self-localization in Robot Soccer","221252921":"A Novel Multiobjective Evolutionary Algorithm Based on Min-Max Strategy","11161760":"Improved Sampling of the Pareto-Front in Multiobjective Genetic Optimizations by Steady-State Evolution: A Pareto Converging Genetic Algorithm","288827687":"Multiobjective evolutionary algorithm based on multimethod with dynamic resources allocation","223656260":"A hybrid multi-objective shuffled frog-leaping algorithm for a mixed-model assembly line sequencing problem","220870968":"Transmission Network Planning Based on Multi-objective Evolutionary Algorithm of Transportation Theory.","4089896":"Vector Evaluated Differential Evolution for Multiobjective Optimization","228644280":"A Hybrid Evolutionary Approach to Solve Multi-objective Optimization Problems based on Particle Swarm Optimizer and Genetic Algorithm","264098721":"A Multiobjective Process Planning of Flexible Assembly Systems with Evolutionary Algorithms","1957889":"Decomposable Problems, Niching, and Scalability of Multiobjective Estimation of Distribution Algorithms","220742920":"A Specialized Island Model and Its Application in Multiobjective Optimization","269062187":"Hybrid Game Strategies for MO Problems in Aerospace Design","225484116":"A new particle swarm algorithm for a multi-objective mixed-model assembly line sequencing problem","242382422":"An Algorithm Based on Differential Evolution for Multi-Objective Problems","2885641":"Searching for a Practical Evidence of the No Free Lunch Theorems","46424802":"Abandoning Objectives: Evolution Through the Search for Novelty Alone","220895501":"Intelligent Particle Swarm Optimization in Multi-objective Problems","220739843":"Two-level of nondominated solutions approach to multiobjective particle swarm optimization","226134356":"A study on evolutionary multi-objective optimization for flow geometry design","245282480":"Operational Response Model for Physically Attacked Water Networks Using NSGA-II","46656247":"Multiple-Objective Optimization of Drinking Water Production Strategies Using a Genetic Algorithm","43453093":"A general-purpose tunable landscape generator","257725285":"Enhanced Weighted Kernel Regression with Prior Knowledge Using Robot Manipulator Problem as a Case Study","243333820":"Immune secondary response and clonal selection inspired optimizers","221008233":"GA with a new multi-parent crossover for solving IEEE-CEC2011 competition problems","252056398":"A Hybrid Genetic Algorithm for Structural Optimization with Discrete Variables","242259513":"Un Algoritmo Basado en Evolución Diferencial para Resolver Problemas Multiobjetivo","242438716":"A Thorough Do cumen tation of Obtained Results on Real{V alued Con tin uous and Com binatorial Multi{Ob jectiv e Optimization Problems Using Div ersit y Preserving Mixture{Based Iterated Densit y Estimation Ev olutionary Algorithms","226737612":"An ALife-Inspired Evolutionary Algorithm for Dynamic Multiobjective Optimization Problems","251924308":"Two-Human CardiffGA: a new multiple population genetic algorithm","224606514":"A Favorable Weight-Based Evolutionary Algorithm for Multiple Criteria Problems","242382369":"STATE-OF-THE-ART MULTIOBJECTIVE EVOLUTIONARY ALGORITHMS—PARETO PANKING, DENSITY ESTIMATION AND DYNAMIC POPULATION","220702076":"A Multiobjective Differential Evolution Based on Decomposition for Multiobjective Optimization with Variable Linkages","238789215":"\"Equipo de Algoritmos Evolutivos Multiobjetivo Paralelos\" (Team Algorithm of pMOEAs)","4251694":"Use of the WFG toolkit and PISA for comparison of MOEAs","224596237":"Shunt compensation","4201519":"Particle swarm optimization and fitness sharing to solve multi-objective optimization problems","4285489":"Solving Multi-Objective Optimization Problems by a Bi-Objective Evolutionary Algorithm","226804214":"A Spectral Approach to Solve Box-constrained Multi-objective Optimization Problems","216301719":"A Tutorial on Evolutionary Multiobjective Optimization","224387372":"Multi-Objective Optimization Applied to the Matching of a Specified Torque-Speed Curve for an Internal Permanent Magnet Motor","230342094":"A human‐like numerical technique for design of engineering systems","3664961":"On an attitude stabilizing condition for a launch vehicle","239537712":"An Immune Algorithm for Engineering Optimization","264810416":"A Multiobjective Optimization Algorithm Based on Discrete Bacterial Colony Chemotaxis","226719225":"Pareto Cone ε-Dominance: Improving Convergence and Diversity in Multiobjective Evolutionary Algorithms","242087446":"AIMS AND FUNCTIONS OF THE NOFDP IDSS","224249123":"Convergence and Diversity Measurement for Vector Evaluated Particle Swarm Optimization Based on ZDT Test Problems","4283454":"A Competitive-Cooperation Coevolutionary Paradigm for Multi-objective Optimization","239929039":"Profiles and springs optimization in a VVA distribution system for internal combustion engines","222818756":"A language-independent software renovation framework. J Syst Software","2530466":"A New Evolutionary Adaptive Representation Paradigm","220176793":"Solving a bi-criteria permutation flow-shop problem using shuffled frog-leaping algorithm","283704417":"Review: population methods of Pareto set approximation in multi-objective optimization problem","242551550":"A MULTIOBJECTIVE GENETIC ALGORITHM FOR PORTFOLIO SELECTION WITH INTEGER CONSTRAINTS","285066352":"Partie II. Une approche multicritère","221228449":"MOPED: A Multi-objective Parzen-Based Estimation of Distribution Algorithm for Continuous Problems","221228448":"Multiobjective Capacitated Arc Routing Problem","4201684":"Limits of scalability of multiobjective estimation of distribution algorithms","4036777":"Library Miniaturization Using Static and Dynamic Information","221174203":"One MOEA Uniformity Measurement Based on Generalized Spherical Transformation.","242303719":"Using a Genetic Algorithm to Generate Alternatives for Multiobjective Corridor Location Problems","221175221":"Game Model Based Co-evolutionary Algorithm and Its Application for Multiobjective Nutrition Decision Making Optimization Problems","221228464":"Multi-objective Phylogenetic Algorithm: Solving Multi-objective Decomposable Deceptive Problems","225158601":"On local optima in multiobjective combinatorial optimization problems","220742027":"Exploiting gradient information in numerical multi--objective evolutionary optimization","37245588":"Metaheuristic and Multiobjective Approaches for Space Allocation","45435397":"Interactive multi-objective particle swarm optimization with heatmap-visualization-based user interface","2440337":"Métaheuristiques pour l\u0027optimisation combinatoire multi-objectif: Etat de l\u0027art","221228441":"Instance Generators and Test Suites for the Multiobjective Quadratic Assignment Problem","23539167":"Using Evolutionary Algorithms to Generate Alternatives for Multiobjective Site-Search Problems","221228436":"The Micro Genetic Algorithm 2: Towards Online Adaptation in Evolutionary Multiobjective Optimization","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","225601999":"The value of online adaptive search: A performance comparison of NSGAII, ε-NSGAII and εMOEA","221228432":"Multiobjective Design Optimization of Real-Life Devices in Electrical Engineering: A Cost-Effective Evolutionary Approach","238682874":"Title of Dissertation ENTROPY APPROACH TO METAMODELING, MULTI-OBJECTIVE GENETIC ALGORITHM, AND QUALITY ASSESSMENT OF SOLUTION SETS FOR","4074750":"Enhanced distribution and exploration for multiobjective evolutionary algorithms","227027273":"A Tabu-Based Exploratory Evolutionary Algorithm for Multiobjective Optimization","223245705":"A hybrid multi-objective immune algorithm for a flow shop scheduling problem with bi-objectives: weighted mean completion time and weighted mean tardiness. Info Sci","242382523":"Multi-Objective Evolutionary Optimization of Gas Turbine Components","257439633":"Multi-objective Optimization Design of Wing Structure with the Model Management Framework","216457261":"Test Problems Based on Lamé Superspheres","222333331":"Efficiency speed-up strategies for evolutionary computation: Fundamentals and fast-GAs","279748729":"Multi-Objective Optimization of Pumping Station Operation in Water Distribution Network Using ACO","221008372":"A clustering multi-objective evolutionary algorithm based on orthogonal and uniform design","2445564":"A Multiple Objective Ant-Q Algorithm for the Design of Water Distribution Irrigation Networks","282278925":"Video Anomaly Detection in Real-Time on a Power-Aware Heterogeneous Platform","235264741":"Pareto-Based Continuous Evolutionary Algorithms for Multiobjective Optimization","3859673":"Study on multi-objective genetic algorithm","224105919":"An efficient multi-objective pulse radar compression technique using RBF and NSGA-II","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","27342150":"Improved genetic algorithm inspired by biological evolution","278103160":"Optimum Design of Turbo-Alternator Using Modified NSGA-II Algorithm","4817058":"\"MOSS\" multiobjective scatter search applied to non-linear multiple criteria optimization","226622839":"Performance Scaling of Multi-objective Evolutionary Algorithms","255571906":"Component-based application development using a Mixed-Language Programming (MLP) approach","2474206":"A Genetic Algorithm Approach to Focused Software Usage Testing","4035782":"International Space Station - A unique place for research","220855767":"Techniques for Maintaining Population Diversity in Classical and Agent-Based Multi-objective Evolutionary Algorithms.","225304684":"An evolutionary algorithm for multi-objective optimization of combustion processes","271293736":"Virtual Machine Placement Based on Ant Colony Optimization for Minimizing Resource Wastage","225109103":"Finding Knees in Multi-objective Optimization","220080151":"Robotic path planning using evolutionary momentum-based exploration","228781224":"Preprint: Multi-objective Evolutionary Algorithm for the Optimization of Noisy Combustion Processes","220381224":"An Investigation on Noisy Environments in Evolutionary Multiobjective Optimization","252815873":"Flood control planning and evaluation with an information and decision support system","225244285":"The Effect of Initial Population Sampling on the Convergence of Multi-Objective Genetic Algorithms","3868975":"Multi-spacecraft trajectory optimization and control using genetic algorithm techniques","222720082":"Aerodynamic optimization via multi-objective micro-genetic algorithm with range adaptation, knowledge-based reinitialization, crowding and ε-dominance","224309321":"A Multiobjective Evolutionary-Simplex Hybrid Approach for the Optimization of Differential Equation Models of Gene Networks","221908002":"A New Non-dominated Sorting Genetic Algorithm for Multi-Objective Optimization","220825648":"Population-Based Ant Colony Optimisation for Multi-objective Function Optimisation.","238391084":"Development of a Multiobjective Optimization Tool for the Selection and Placement of BMPs for Nonpoint Source Pollution Control","257513026":"The crowd framework for multiobjective particle swarm optimization","239550309":"The use of Robust Design and Game Theory in PSO","221093899":"Negative Correlation Learning and the Ambiguity Family of Ensemble Methods","220080182":"Using traceless genetic programming for solving multi-objective optimization problems","3421470":"Multiobjective evolutionary algorithm for the optimization of noisy combustion processes","2519305":"Extensions to the Strength Pareto Evolutionary Algorithm.","221760519":"Using Evolutionary Algorithms for Fitting High-Dimensional Models to Neuronal Data","221086748":"Research on Overlapping Individuals in MOEAs: Causation, Probability for Quantity and Influence on Assessment","221494277":"Combine LHS with MOEA to Optimize Complex Pareto Set MOPs.","222827635":"A new multiobjective evolutionary algorithm","257334802":"Chow, T.S.: A local multiobjective optimization algorithm using neighborhood field. Struct. Multi. Optim. 46, 853-870","221955199":"Interactive Evolutionary Approaches to Multiobjective Spatial Decision Making: A Synthetic Review","226069553":"Solving a multi-objective no-wait flow shop scheduling problem with an immune algorithm","228404439":"Game model based co-evolutionary solution for multiobjective optimization problems","242441016":"Using Soft CSPs f or A ppr oximating P ar eto-Optimal Solution Sets Mar c T orr ens and Boi F altings","274576658":"Availability Approach to Optimizing Railway Track Renewal Operations","279169516":"Multiobjective Particle Swarm Optimization Based on PAM and Uniform Design","220956794":"An Hybrid Neural/Genetic Approach to Continuous Multi-objective Optimization Problems.","220741756":"Global multiobjective optimization via estimation of distribution algorithm with biased initialization and crossover","220669042":"SSPMO: A Scatter Tabu Search Procedure for Non-Linear Multiobjective Optimization","3878247":"Development of an intelligent system for the solder paste printing process","221185101":"Coupling of Immune Algorithms and Game Theory in Multiobjective Optimization.","3565906":"Pitch-tracked CELP speech coding with transparent DTMF signaling","228689094":"An Estimation of Nadir Objective Vector Using a Hybrid Evolutionary-cum-Local-Search Procedure","251860585":"Solving multi-objective optimization problems by RasID-GA","220741699":"Automated red teaming: a proposed framework for military application.","257628726":"A preference multi-objective optimization based on adaptive rank clone and differential evolution","3113281":"Multiobjective Tabu Search Algorithms for Optimal Design of Electromagnetic Devices","220288078":"A competitive and cooperative co-evolutionary approach to multi-objective particle swarm optimization algorithm design","220470352":"WBMOAIS: A novel artificial immune system for multiobjective optimization","221431879":"Parallel Distributed Genetic Algorithm for Expensive Multi-Objective Optimization Problems","251991664":"A Novel Particle Swarm Optimization Algorithm Based on Fuzzy Velocity Updating for Multi-objective Optimization","223589414":"Assessing solution quality of biobjective 0-1 knapsack problem using evolutionary and heuristic algorithms","225141790":"Framework for Many-Objective Test Problems with Both Simple and Complicated Pareto-Set Shapes","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","254187175":"Multi-population Genetic Algorithms with Space Partition for Multi-objective Optimization Problems","220286112":"Solving Multiobjective Optimization Problems Using an Artificial Immune System","224246999":"An adaptive approach for solving dynamic scheduling with time-varying number of tasks — Part II","251350890":"Transonic Wing Shape Optimization Using a Genetic Algorithm","257588939":"Synchronous and asynchronous Pareto-based multi-objective Artificial Bee Colony algorithms","228858934":"Multiobjective Optimization Using Clustering Based Two Phase PSO","5628358":"Fox, R.J. \u0026 Huisman, G.W. Enzyme optimization: moving from blind evolution to statistical exploration of sequence-function space. Trends Biotechnol. 26, 132-138","224225486":"Efficient Hybrid-Game Strategies Coupled to Evolutionary Algorithms for Robust Multidisciplinary Design Optimization in Aerospace Engineering","2566591":"A Thorough Documentation of Obtained Results on Real-Valued Continuous And Combinatorial Multi-Objective Optimization Problems Using Diversity Preserving Mixture-Based Iterated Density Estimation Evolutionary Algorithms","220793008":"A Game Model Based Co-evolutionary Algorithms for Multiobjective Optimization Problems.","216300868":"Scalable Test Problems for Evolutionary Multi-Objective Optimization","241732554":"A data mining approach to evolutionary optimisation of noisy multi-objective problems","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","225827033":"Distributed Multidisciplinary Design Optimisation in Aeronautics using Evolutionary Algorithms, Game Theory and Hierarchy","225347776":"A Real-World Test Problem for EMO Algorithms","220361874":"Multiobjective optimization using an immunodominance and clonal selection inspired algorithm","257336039":"Secondary population implementation in multi-objective evolutionary algorithm for scheduling of FMS","220701840":"Generalised Regression GA for Handling Inseparable Function Interaction: Algorithm and Applications.","26620974":"Non-dominated Sorting Genetic Algorithms for Heterogeneous Embedded System Design","220741776":"Adaptive variance scaling in continuous multi-objective estimation-of-distribution algorithms","226497594":"Recent Trends in Evolutionary Multiobjective Optimization","222048386":"A multiobjective immune algorithm based on a multiple-affinity model","26560597":"Time-Cost Trade-off Problem in Construction Project Management, Based on Fuzzy Logic","6525346":"A Multiobjective Memetic Algorithm Based on Particle Swarm Optimization","228634723":"Hybrid enhanced genetic algorithm to select optimal machining parameters in turning operation","228447322":"Efficient Optimization of Reliable Two-Node Connected Networks: A Biobjective Approach","220308712":"A Trust-Region Algorithm for Bi-Objective Stochastic Optimization","227264607":"Evolutionary and Immune Computations in Optimal Design and Inverse Problems","220740848":"Multi-objective test problems, linkages, and evolutionary methodologies","220856563":"Multi-objective Optimization Using Co-evolutionary Multi-agent System with Host-Parasite Mechanism.","226702431":"A method for simulation based optimization using radial basis functions","225741995":"Multi-objective Flow-Shop: Preliminary Results","2852299":"GAs for aerodynamic shape design II:","242073485":"Game Theory and Co-Evolutive Algorithms for Space Missions Preliminary Design","40906644":"Strength Pareto Particle Swarm Optimization and Hybrid EA-PSO for Multi-Objective Optimization","4049364":"Dynamic population strategy assisted Particle Swarm Optimization","220121331":"Multi-objective Bayesian Artificial Immune System: Empirical Evaluation and Comparative Analyses","228587632":"Multiobjective optimization using parallel vector evaluated particle swarm optimization","228671570":"Newton\u0027s Method for Multiobjective Optimization","226373770":"A method for evaluating functional content in mechatronic systems using optimisation","237233109":"MOMBES Multiobjective Modelbased Evolution Strategy","228828251":"Improving the Efficiency of ϵ-dominance Based Grids","237437915":"Potential Role of Multiobjective Optimisation Methods in Water Resource Planning in Kenya","221787332":"Agent-Based Co-Evolutionary Techniques for Solving Multi-Objective Optimization Problems","242763898":"Equipo de Algoritmos Evolutivos Multiobjetivo Paralelos","220561191":"A particle gradient evolutionary algorithm for solving multi-obective problems","37394493":"Multiobjective Optimization — New Formulation\nand Application to Radar Signal Processing","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","220742438":"Combining gradient techniques for numerical multi-objective evolutionary optimization","3865129":"Unified model for multi-objective evolutionary algorithms with elitism","261094809":"Optimal FACTS location to enhance voltage stability using multi-objective harmony search","242749550":"Equipo Probabilístico de Algoritmos Evolutivos Multiobjetivo en Computación Paralela","46165209":"Interactive optimization strategies for layout problems","225999718":"Solution of multiobjective optimization problems: Coevolutionary algorithm based on evolutionary game theory","228778941":"A lightweight approach for QOS aware service composition","224145219":"Differential evolution for multi-objective optimization with self adaptation","220637959":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons.","228812677":"Game theory based coevolutionary algorithm: A new computational coevolutionary approach","51213604":"Application of a Multi-Objective Optimization Method to Provide Least Cost Alternatives for NPS Pollution Control","5607038":"A Multi-Objective Evolutionary Algorithm Toolbox for Computer-Aided Multi-Objective Optimization","220980992":"Solving Multi-Objective Optimization Problems by RasID-GA: Using an External Population in Genetic Operators","237820928":"Computational Intelligence in Multi Disciplinary Optimisation at Feasibility Design Stage","251860271":"A Tunable Constrained Test Problems Generator for Multi-objective Optimization","2885121":"Library Miniaturization Using Static and Dynamic Information","226550702":"Use of Multiobjective Evolutionary Algorithms in Water Resources Engineering","226099030":"Research of Optimized Agricultural Information Collaborative Filtering Recommendation Systems","221161217":"Improving Multiobjective Evolutionary Algorithm by Adaptive Fitness and Space Division","2633240":"Multi-Objective Evolutionary Algorithms: Introducing Bias Among Pareto-Optimal Solutions","221570816":"Applying Multi-objective Evolutionary Algorithms to QoS-Aware Web Service Composition","2369041":"A Short Tutorial on Evolutionary Multiobjective Optimization","251937074":"Disco planner flexible DG allocation in MV distribution networks using multi-objective optimization procedures","245491862":"Computational system for multi disciplinary optimization at conceptual design stage","233607131":"Comparing Heuristic and Deterministic Approaches to Optimise Mechanical Parameters of Biopolymer Composite Materials","233686996":"Optimisation of process parameters in friction stir welding based on residual stress analysis: A feasibility study","260744628":"CRDEMO: Combined regionalization and dual entropy-multiobjective optimization for hydrometric network design","3904004":"Failure of Pareto-based MOEAs: Does non-dominated really mean near to optimal?","220116769":"Neuro-Genetic Design Optimization Framework to Support the Integrated Robust Design Optimization Process in CE","256937327":"MOICA: A novel multi-objective approach based on imperialist competitive algorithm","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","239541250":"MULTIOBJECTIVE VISIBLE SPECTRUM OPTIMIZATION: A GENETIC ALGORITHM APPROACH","224166676":"Strategy of resource brokering for efficient parallelization of MLP training","51474776":"Hearing Loss and Cochlear Implantation in Children","3418750":"Dynamic multiobjective evolutionary algorithm: Adaptive cell-based rank and density estimation","2516586":"An Updated Survey of Evolutionary Multiobjective Optimization Techniques :","220741476":"An effective use of crowding distance in multiobjective particle swarm optimization","2485866":"Multiobjective Genetic Algorithm Applied To Benchmark Problems - An Analysis","221392742":"PSFGA: A Parallel Genetic Algorithm for Multiobjective Optimization.","237344881":"Enhancing the Awareness of Decentralized Cooperative Mobile Robots through Active Perceptual Anchoring","252050768":"A Multi-objective Adaptive Immune Algorithm for NoC mapping","224075526":"Multiobjective optimization design via genetic algorithm","220216189":"An integrated MOGA approach to determine the Pareto-optimal kanban number and size for a JIT system","221494125":"A Multi-objective Differential Evolutionary Algorithm Based on Spacial Distance","3418709":"A weighted sum genetic algorithm to support multiple-party multi-objective negotiations","242434064":"APPLICATION OF GAME STRATEGY IN MULTI-OBJECTIVE ROBUST DESIGN OPTIMISATION IMPLEMENTING SELF ADAPTIVE SEARCH SPACE DECOMPOSITION BY STATISTICAL ANALYSIS","225419020":"Optimal ballast water exchange sequence design using symmetrical multitank strategy","220777282":"Multiobjective Constriction Particle Swarm Optimization and Its Performance Evaluation","227222496":"Multi-objective optimization of multi-pass face milling using particle swarm intelligence","245193969":"Neural network and genetic algorithms for optimizing the plate element of Egyptian research reactor problems","242153474":"Eects of Airline Strategies on Airline Operations and Infrastructure Utilization","263986642":"ROTATED PROBLEMS AND ROTATIONALLY INVARIANT CROSSOVER IN EVOLUTIONARY MULTI-OBJECTIVE OPTIMIZATION","242200576":"Preliminary Results of Applying Probability Collectives to Multi-Objective Optimisation Problems","3865173":"Nash Genetic Algorithms: Examples and applications","257402149":"Contrast optimization of two-photon processes after a microstructured hollow-core fiber demonstrated for dye molecules","220381014":"Using unconstrained elite archives for multiobjective optimization","224177960":"A hybrid multiobjective immune algorithm with region preference for decision makers","239560754":"Multiobjective Nonlinear Pareto-Optimization","3865154":"Distributed reinforcement learning for multiple objective optimization problems","281373369":"Multi-objective assessment of biological models","233045916":"On Maximizing Solution Diversity in a Multiobjective Multidisciplinary Genetic Algorithm for Design Optimization","5826087":"Pareto-adaptive ε-dominance","287479645":"AI techniques for hydrological modeling and management. II: Optimization","2632362":"A New Distributed Reinforcement Learning Algorithm for Multiple Objective Optimization Problems","238186673":"Design under Uncertainties of Wings in Transonic Field","243462149":"Tolerance and multiobjective optimization in electromagnetic devices","225855473":"Optimization of the head shape of the CRH3 high speed train","242445561":"Evolution Based on Decomposition for Multiobjective Optimization with Variable Linkages","254400930":"Optimization of the Structure of a Neural Networks by Multi-Objective Genetic Algorithms","3418808":"Intelligent Evolutionary Algorithms for Large Parameter Optimization Problems","235836544":"MO-TRIBES, an adaptive multiobjective particle swarm optimization algorithm","4208337":"A game model based co-evolutionary for constrained multiobjective optimization problems","3418784":"Handling multiple objectives with particle swarm optimization. IEEE Trans Evol Comp","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","12473892":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","220089220":"A multi-objective particle swarm for a flowshop scheduling problem. J Comb Optim","224169926":"Toward an Estimation of Nadir Objective Vector Using a Hybrid of Evolutionary and Local Search Approaches","220606393":"Evolutionary Optimization (Evopt): A Brief Review And Analysis.","3418769":"A semantically guided and domain-independent evolutionary model for knowledge discovery from texts","283621966":"Barzilai and Borwein’s method for multiobjective optimization problems","220742531":"Rotated test problems for assessing the performance of multi-objective optimization algorithms","225132485":"A novel heuristic for multi-objective optimization of analog circuit performances","281320043":"Conceptual Design and Optimisation of an Advanced Rotorcraft Powerplant Architecture","3418757":"Rank-density-based multiobjective genetic algorithm and benchmark test function study","220118956":"Recognizing signal trends on-line by a fuzzy-logic-based methodology optimized via genetic algorithms","245310505":"VIS: An artificial immune network for multi-objective optimization","220215190":"Optimization of an established multi-objective delivering problem by an improved hybrid algorithm","2518682":"Using Soft CSPs for Approximating Pareto-Optimal Solution Sets","254222817":"An Enhanced MOGWW for the bi-objective Quadratic Assignment Problem","224319385":"A Competitive-Cooperative Coevolutionary Paradigm for Dynamic Multiobjective Optimization","220199893":"Evolutionary-based techniques for real-life optimisation: Development and testing","248880159":"Novel Multiobjective Shuffled Frog Leaping Algorithm with Application to Reservoir Flood Control Operation","239552649":"ROBUST MULTICRITERIA OPTIMIZATION OF SURFACE LOCATION ERROR AND MATERIAL REMOVAL RATE IN HIGH-SPEED MILLING UNDER UNCERTAINTY","228879220":"Combining Reliability and Pareto Optimality—An Approach Using Stochastic Multi-Objective Genetic Algorithms","2861821":"Multi-Objective Benchmark Studies for Evolutionary Computation","220654591":"Optimal resampling and classifier prototype selection in classifier ensembles using genetic algorithms","2616014":"Multicriteria Optimization with Export Rules for Mechanical Design","281451055":"Real-time Video Scene Analysis with Heterogeneous Processors","242093188":"A new Algorithm based on Game Theory for Robust and Fast Multi-Objective Optimisation","220704714":"A Multi-Objective Binary Harmony Search Algorithm","238184644":"Robust Design of Compressor Fan Blades Against Erosion","228926291":"Evolutionary optimization of dynamic multi-objective test functions","237554896":"Chapter II Multi-Objective Particles Swarm Optimization Approaches","221006804":"GA with a new multi-parent crossover for constrained optimization","238854342":"Improving the identification of general Pareto fronts by global optimization","226762616":"Lecture Notes in Computer Science","220741162":"A Novel Multi-objective Orthogonal Simulated Annealing Algorithm for Solving Multi-objective Optimization Problems with a Large Number of Parameters","221228584":"A Real-World Test Problem for EMO Algorithms.","2309934":"Comparison of Multiobjective Evolutionary Algorithms on Test Functions of Different Difficulty","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","29868759":"A multi-objective GP-PSO hybrid algorithm for gene regulatory network modeling","26850953":"Multi-Objective Differential Evolution Algorithm for Solving Engineering Problems","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","245531009":"Asynchronous migration of island parallel GA for multi-objective optimization problems","221024792":"Introduction to Evolutionary Multiobjective Optimization","220724754":"Applying a New Grid-Based Elitist-Reserving Strategy to EMO Archive Algorithms","221228569":"Comparison of Evolutionary and Deterministic Multiobjective Algorithms for Dose Optimization in Brachytherapy","220743199":"An Evolutionary Technique for Multicriterial Optimization Based on Endocrine Paradigm","220371477":"A multi-objective scatter search for a mixed-model assembly line sequencing problem","224565845":"An Improved Differential Evolution for Multi-objective Optimization","255638532":"Algoritmos Culturales Aplicados a Optimización con Restricciones y Optimización Multiobjetivo","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","3567368":"Reliability analysis of a mine production system-a case study","2446107":"A Multiobjective Evolutionary Algorithm The Study Cases","5303061":"Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection","220380772":"Preferences and their Application in Evolutionary Multiobjective Optimisation","2243429":"A Non-generational Genetic Algorithm for Multiobjective Optimization","2555758":"A Spotlight Search Method For Multi-Criteria Optimization Problems","221228644":"Experimental Genetic Operators Analysis for the Multi-objective Permutation Flowshop","237148524":"Application of Swarm Intelligence Techniques to the Design of Analog Circuits: Evaluation and Comparison","273900291":"Evolutionary multi-objective optimisation: A survey","240505092":"Multiobjective Genetic Algorithms for Design of Water Distribution Networks","245326285":"A multi-objective design optimization strategy as applied to pre-mixed pre-vaporized injection systems for low emission combustors","245310922":"A parallel particle swarm optimization algorithm for multi-objective optimization problems","233313983":"A weight-based multiobjective immune algorithm: WBMOIA","225537579":"A path following method for box-constrained multiobjective optimization with applications to goal programming problems","221786725":"Solving a Multi-Objective No-Wait Flow Shop Problem by a Hybrid Multi-Objective Immune Algorithm","240505099":"Decision Support for Watershed Management Using Evolutionary Algorithms","238066031":"OTTIMIZZAZIONE DI UN GIUNTO DI DILATAZIONE TERMICA ASSIALE OTTENUTO PER IDROFORMATURA","28209866":"Using Pareto Optimality for Defining the Mutation Operator Step Size","221007434":"Multi-ant colony system for evacuation routing problem with mixed traffic flow","248778172":"Dynamic Population Strategy Assisted Particle Swarm Optimization in Multiobjective Evolutionary Algorithm design","251812971":"A MODIFIED PAES ALGORITHM USING ADAPTIVE REPRESENTATION OF SOLUTIONS","221608537":"Novel Objective-Space-Dividing Multi-objectives evolutionary algorithm and its convergence property","272374601":"Multi objective optimization of computationally expensive multi-modal functions with RBF surrogates and multi-rule selection","3949386":"Dynamic population size in multiobjective evolutionary algorithms","221007444":"Virtual reality high dimensional objective spaces for multi-objective optimization: An improved representation","276099853":"Multiobjective Optimization for Maintenance Decision Making in Infrastructure Asset Management","222570046":"A heuristic-based framework to solve a complex aircraft sizing problem","242376975":"Cost-effective Evolutionary Strategies for Pareto Optimal Front Approximation in Multiobjective Shape Design Optimization of Electromagnetic Devices","3949503":"Scalable multi-objective optimization test problems","37413310":"Multi-objective optimisation applied to industrial energy problems","37421500":"A New Clustering Evolutionary Multi-Objective Optimisation Technique","256236747":"excerpt-ecj","220742328":"Interactive MOEA/D for multi-objective decision making","220742329":"Incorporating directional information within a differential evolution algorithm for multiobjective optimization","3810214":"“An updated survey of evolutionary multiobjective optimization techniques: State of the art and future trends,” in: Congress on evolutionary computation","2830262":"No Free Lunch and Free Leftovers Theorems for Multiobjective Optimisation Problems","3419050":"A Simulated Annealing-Based Multiobjective Optimization Algorithm: AMOSA","239543782":"A Scalable Multi-objective Test Problem Toolkit (corrected version: 22 June 2005)","266652748":"Aerodynamic shape design using hybrid evolutionary computation and fitness approximation","257760503":"Optimized design for the plow of a submarine plowing trencher","225957594":"Novelty Search and the Problem with Objectives","253585581":"Multiobjective Genetic Algorithm for Product Design","226719280":"Reliability based design of water distribution networks using multi-objective genetic algorithms","221008536":"Fuzzy Clustering Based Gaussian Process Model for Large Training Set and Its Application in Expensive Evolutionary Optimization","4017035":"Evolutionary multiobjective optimization using a cultural algorithm","2462623":"Local Search, Multiobjective Optimization and the Pareto Archived Evolution Strategy","239392251":"Pareto optimization using the struggle genetic crowding algorithm","226331330":"High-Fidelity Multi-criteria Aero-structural Optimisation using Hierarchical Parallel Evolutionary Algorithms","2374631":"Combining Hybrid Metaheuristics and Populations for the Multiobjective Optimisation of Space Allocation Problems","291528361":"Joint Inversion of Atmospheric Refractivity Profile Based on Ground-Based GPS Phase Delay and Propagation Loss","241479087":"A Hybrid Algorithm for Dynamic Location Problems","223510173":"Evolutionary approaches to the design and organization of manufacturing systems","4010994":"Moving to smaller libraries via clustering and genetic algorithms","222670484":"The influence of the fitness evaluation method on the performance of multiobjective search algorithms","237148662":"Optimal Sizing of Analog Integrated Circuits by Applying Genetic Algorithms","285629139":"Towards green automated production line with rotary transfer and turrets: a multi-objective approach using a binary scatter tabu search procedure","242749870":"Equipo Elitista de Algoritmos Evolutivos Multiobjetivo","280491885":"Design Space Exploration and Optimization of Conceptual Rotorcraft Powerplants","3949543":"Diversity assessment of Pareto optimal solution sets: an entropy approach","232634882":"A New Model Solving Multi-Objective Optimization Problems Based on the Evolutionary Algorithm","226118302":"MO-TRIBES, an adaptive multiobjective particle swarm optimization algorithm","252026082":"A improved genetic algorithm based on multiple population","221528798":"Pareto Front Approximation with Adaptive Weighted Sum Method in Multiobjective Simulation Optimization.","37421520":"A Fast Multi-Objective Evolutionary Algorithm applied to Industrial Problems","225649287":"Hybrid multi-objective shape design optimization using Taguchi’s method and genetic algorithm. Structural and Multidisciplinary Optimization, 34(4), 317-332","228344426":"Not all classes are created equal: toward a recommendation system for focusing testing","224645780":"Co-Evolutionary Multi-Agent System with Sexual Selection Mechanism for Multi-Objective Optimization","220380890":"A distributed Cooperative coevolutionary algorithm for multiobjective optimization.","224294567":"Who\u0027s better? PESA or NSGA II?","2941911":"Data Mining using Learning Classifier Systems"},"index":711}