{"abs":"To improve performances of multi-objective optimization algorithms, such as convergence and diversity, a hybridization- encouraged mechanism is proposed and realized in elitist nondominated sorting genetic algorithm (NSGA-II). This mechanism uses the normalized distance to evaluate the difference among genes in a population. Three possible modes of crossover operators—“Max Distance”, “Min-Max Distance”, and “Neighboring-Max”—are suggested and analyzed. The mode of “Neighboring-Max”, which not only takes advantage of hybridization but also improves the distribution of the population near Pareto optimal front, is chosen and used in NSGA-II on the basis of hybridization-encouraged mechanism (short for HEM-based NSGA-II). To prove the HEM-based algorithm, several problems are studied by using standard NSGA-II and the presented method. Different evaluation criteria are also used to judge these algorithms in terms of distribution of solutions, convergence, diversity, and quality of solutions. The numerical results indicate that the application of hybridization-encouraged mechanism could effectively improve the performances of genetic algorithm. Finally, as an example in engineering practices, the presented method is used to design a longitudinal flight control system, which demonstrates the obtainability of a reasonable and correct Pareto front.","title":"Improved NSGA-II Multi-objective Genetic Algorithm Based on Hybridization-encouraged Mechanism","id":245231064,"url":"https://www.researchgate.net/publication/245231064_Improved_NSGA-II_Multi-objective_Genetic_Algorithm_Based_on_Hybridization-encouraged_Mechanism","names":["Sun Yijie","Shen Gongzhang","Chinese Journal of Aeronautics"],"references":{"243775590":"Multi-Objective Genetic Algorithms: Problem Di±culties and Construction of Test Functions","226165021":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","239023800":"Multi-Objective function optimization using non-dominated sorting genetic algorithms, Evolutionary Computation, 2(3):221-248","2782915":"A Variant of Evolution Strategies for Vector Optimization","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","24320636":"Applications of fuzzy theories to multi-objective system optimization","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","12809680":"Deb, K.: Multi-Objective Genetic Algorithms: Problem Difficulties and Construction of Test Problems. Evolutionary Computation 7, 205-230","2523573":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimization: NSGA-II","3625443":"Multi-objective genetic algorithms made easy: Selection, sharing and mating restriction","226622839":"Performance Scaling of Multi-objective Evolutionary Algorithms","229706504":"Multicriteria optimization: A general characterization of efficient solutions","216300989":"A variant of evolution strategies for vector optimization","236443691":"Some Experiments in Machine Learning Using Vector Evaluated Genetic Algorithms","3810214":"“An updated survey of evolutionary multiobjective optimization techniques: State of the art and future trends,” in: Congress on evolutionary computation","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm"},"citedIn":{"259513332":"Solving a tri-objective supply chain problem with modified NSGA-II algorithm","234054199":"A non-dominated sorting hybrid algorithm for multi-objective optimization of engineering problems","271750854":"Multi-objective optimization in spatial planning: Improving the effectiveness of multi-objective evolutionary algorithms (non-dominated sorting genetic algorithm II)","267665613":"On some aspects of nature-based algorithms to solve multi-objective problems"},"index":714}