{"abs":"Subjectivism has become the dominant philosophical foundation for Bayesian inference. Yet in practice, most Bayesian analyses are performed with so-called “noninformative” priors, that is, priors constructed by some formal rule. We review the plethora of techniques for constructing such priors and discuss some of the practical and philosophical issues that arise when they are used. We give special emphasis to Jeffreys\u0027s rules and discuss the evolution of his viewpoint about the interpretation of priors, away from unique representation of ignorance toward the notion that they should be chosen by convention. We conclude that the problems raised by the research on priors chosen by formal rules are serious and may not be dismissed lightly: When sample sizes are small (relative to the number of parameters being estimated), it is dangerous to put faith in any “default” solution; but when asymptotics take over, Jeffreys\u0027s rules and their variants remain reasonable choices. We also provide an annotated bibliography.","title":"The Selection of Prior Distributions by Formal Rules","id":236157539,"url":"https://www.researchgate.net/publication/236157539_The_Selection_of_Prior_Distributions_by_Formal_Rules","names":["Robert Kass","Larry Wasserman","Journal of the American Statistical Association"],"references":{"31354847":"On the Choice of Prior Distribution for the Box-Cox Transformed Linear Model","247045304":"On the relationship between Bayesian and non-Bayesian interval estimates","242996857":"Robust Bayesian Analysis: Sensitivity to the Prior","225070185":"A Mathematical Theory of Evidence","3020584":"Least-Informative Bayesian Prior Distributions for Finite Samples Based on Information Theory","247643844":"Statistical implications of finitely additive probability","42635916":"Mathematical Theory of Communication","267006445":"A note on the prior distributions of Weibull parameters","222477640":"Jeffreys\u0027 prior is asymptotically least favorable under entropy risk","246998186":"On comparisons between confidence point procedures in the case of a single parameter","38367066":"On the Measure of Information Provided by an Experiment","240252740":"Some observations on inverse probability including a new difference rule","248413396":"Weight of Evidence, Corroboration, Explanatory Power, Information and the Utility of Experiments","247005346":"On formulae for con dence points based on intervals of weighted likelihoods","268248547":"Reference Priors When the Stopping Rule Depends on the Parameter of Interest","260161183":"Approximate Bayes Factors and Orthogonal Parameters, with Application to Testing Equality of Two Binomial Proportions","285851176":"On the expected amount of information from a non-linear model","239064861":"On the Reconciliation of Probability Assessments","238288400":"On priors that maximize expected information","246367371":"Hierarchical Bayes estimators of the error variance in one-way ANOVA models","38363246":"R. A. Fisher and Fiducial Argument","243763375":"Un-Bayesian Implications of Improper Bayes Inference in Routine Statistical Problems","254330369":"A Comment on “Is Jeffreys a ‘Necessarist’?”","229770909":"Likelihood Principle","266164210":"Conglomerability and countable additivity","38359417":"The Unfathomable Influence of Kolmogorov","246997643":"On Bayesian Analysis of Generalized Linear Models Using Jeffreys\u0027s Prior","235418941":"An Essay Towards Solving A Problem in the Doctrine of Chances","38359164":"Deriving Posterior Distributions for a Location Parameter: A Decision Theoretic Approach","243082048":"A Paradox Involving Quasi Prior Distributions","224839719":"An Analysis of Transformations (with Discussion)","260574411":"Space, Time, and Spacetime","225153582":"On some statistical paradoxes and non-conglomerability","240140567":"Noninformative Priors for One Parameter of Many","38365966":"Invariant Prior Distributions","243649481":"Statistical Reasoning With Imprecise Probabilities","260406228":"The robust Bayesian viewpoint (with discussion)","223143710":"Jeffreys\u0027 prior for logit models","222734101":"A note on noninformative priors for Weibull distributions","38358303":"‘Estimating the Dimension of A Model,’","245581819":"Bayes Factors and Model Uncertainty","243082276":"Expectation Consistency of Inverse Probability Distributions","31186050":"A Note on the Existence of the Posterior Distribution for a Class of Mixed Models for Binomial Responses","232821180":"Some Remarks on Estimating a Noncentrality Parameter","247000038":"On con炉dence sets and Bayesian probability points in the case of several parameters","38358295":"On Finitely Additive Priors, Coherence, and Extended Admissibility","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","24065295":"Noninformative priors for maximal invariant in group models","31102904":"Noninformative Priors for Inferences in Exponential Regression Models","229503694":"On a theorem of Stein relating Bayesian and classical inferences in group models","234814104":"A mathematical theory of communication. AT\u0026T Tech J","30529725":"Scientific Reasoning: The Bayesian Approach, 3rd Edn","3479364":"Prior Probabilities","266755220":"A Bayesian Indifference Procedure","261642731":"Foundations of Statistics","247014346":"On obtaining invariant prior distributions","38364474":"Necessary and Sufficient Condition for Convergence in Probability to Invariant Posterior Distributions","30987692":"The present position in probability theory","245970655":"Doing What Comes Naturally: Interpreting a Tail Area as a Posterior Probability or as a Likelihood Ratio","47583918":"An Invariant Form for the Prior Probability in Estimation Problems","38357553":"Some Diagnostics of Maximum Likelihood and Posterior Nonnormality","243687932":"Reference Posterior Distributions for Bayesian Inference","248441781":"[Why Isn\u0027t Everyone a Bayesian?]: Reply","243646974":"Inadmissibility of the Usual Estimator for the Mean of a Multivariate Normal Distribution","288529993":"Similarity and probability","288470860":"Right Haar measures for convergence in probability to invariant posterior distributions","254284886":"Approximate Posterior Distributions","225106197":"Posterior Odds Ratios for Selected Regression Hypotheses","3081901":"Prior Probability and Uncertainty","38359498":"Coherent Statistical Inference and Bayes Theorem","236853398":"Consistent Estimates Based On Partially Consistent Observations","246498362":"Interactive Elicitation of Opinion of a Normal Linear Model","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","264957253":"Bayes Factors and Choice Criteria for Linear Models","38358726":"Inner Statistical Inference II","38358233":"A Conditional Confidence Principle","248423260":"What is the use of a distribution","31002187":"On the Necessity of Bayesian Inference and the Construction of Measures of Nearness to Bayesian Form","243765011":"Bhattacharyya, A.: On a Measure of Divergence Between two Statistical Populations Defined by Their Probability Distribution. Bull. Calcutta. Math. Soc","31002188":"A New Look at the Bayes Procedure","268844179":"An Alternative to the Standard Bayesian Procedure for Discrimination Between Normal Linear Models","223236568":"Bayesian reference prior analysis on the ratio of variances for the balanced one-way random effect model","38363857":"Bayesian Inference in Linear Relations","222216357":"The conflict between improper priors and robustness","30958915":"On Bayesian Nonlinear Regression with an Enzyme Example","38366165":"The Posterior $t$ Distribution","235226521":"A Treatise on Probability","244954171":"A Comparison of Some Bayesian and Frequentist Inferences","246244874":"Frequentist Validity of Posterior Quantiles in the Presence of a Nuisance Parameter: Higher Order Asymptotics","38359521":"Fully Coherent Inference","246782492":"Maximal data information prior distributions","232380784":"On the Uniform Approximation of Laplace′s Prior by t-Priors in Location Problems","265366397":"Bayes\u0027 Method for Bookies","239655397":"Bayes Factors for Linear and Log-linear Models with Vague Prior Information","46544745":"Noninformative Priors and Bayesian Testing for the AR(1) Model","239799288":"On Prior Distributions for Binary Trials","246094110":"Estimating a Product of Means: Bayesian Analysis with Reference Priors","38365692":"The Asymptotically Unbiased Prior Distribution","247373832":"Reference Prior Bayesian Analysis for Normal Mean Products","38348785":"On the invariance of noninformative priors","38359285":"Coherent Inference from Improper Priors and from Finitely Additive Priors","261682012":"The Structure of Inference","38358669":"Bayesian Inference Using Intervals of Measures","240166806":"Parameter orthogonality and approximate conditional inference. J Roy Stat Soc Ser B","246765170":"Marginalization Paradoxes in Bayesian and Structural Inference","275383969":"Is Jeffreys a “Necessarist”?","236177887":"The Foundations of Theoretical Statistics","266307859":"Uniform approximation of Bayes solutions and posteriors: Frequentistly valid Bayes inference","45130365":"Robust Statistics","238301177":"Priors for Exponential Families Which Maximize the Association between Past and Future Observations","8753224":"[Cybernetics].","226516301":"The Extent of Non-Conglomerability of Finitely Additive Probabilities","38357636":"On Some Difficulties in a Frequency Theory of Inference","38359684":"A Statistical Diptych: Admissible Inferences--Recurrence of Symmetric Markov Chains","238281725":"Noninformative Priors and Nuisance Parameters","286294751":"Marginalization and prior probabilities","271805152":"Data-Translated Likelihood and Jeffrey\u0027s Rules","38359453":"Reference Priors for the Orbit in a Group Model","227149660":"The formal posterior of a standard flat prior in MANOVA is incoherent","230872596":"Confidence Regions in Non-Linear Estimation","38359185":"Bayesianly Justifiable and Relevant Frequency Calculations for the Applied Statistician.” Annals of Statistics 12, 1151-1172","23631025":"Bayesian Analysis for Random Coefficient Regression Models Using Noninformative Priors","243762782":"The interpretation of improper prior distributions as limits of data dependent proper prior distributions","240265608":"Strong Inconsistency from Uniform Priors","226445732":"Comment on the interpretation of inductive probabilities","284573736":"Relationships between Bayesian and confidence limits for prediction","291761341":"What is the use of a distribution?","38358934":"Coherent and Continuous Inference","243783012":"Bayesian and frequentist Bartlett corrections for likelihood ratio and conditional likelihood ratio tests","232481854":"Bayesian Statistical Inference in Psychological Research","4860847":"To Criticize the Critics: An Objective Bayesian Analysis of Stochastic Trends","243082907":"Conditional Inference and Cauchy Models","226266516":"‘Jaynes’ Maximum Entropy Prescription and Probability Theory.’","266410505":"On Some Bayesian Solutions of the Neyman-Scott Problem","31223605":"A Bayesian Approach to Transformations to Normality","38357664":"Expectation Consistency and Generalized Bayes Inference","243783019":"Rational selection of decision functions","247214673":"“Posterior Distributions for Multivariate Normal Parameters,”","271605954":"Multiparameter Bayesian indifference procedures","245582161":"Bayesian interval estimates which are also con炉dence intervals","38358970":"A Universal Prior for Integers and Estimation by Minimum Description Length","38366653":"Some Validity Criteria for Statistical Inferences","288441287":"On maximizing missing information about a hypothesis","38366654":"Conditional Confidence Level Properties","266835472":"On a fiducial example of C. Stein","245582164":"Bayesian intervals with good frequency behaviour in the presence of nuisance parameters","31145507":"The precision of observed values of small frequencies","50335996":"Bayesian inference in statistical analysis.","38348724":"Choice of hierarchical priors: Admissibility in estimation of normal means","38358455":"Conditional Properties of Statistical Procedures for Location and Scale Parameters","268733947":"Relationships between Bayesian and con炉dence limits for predictions","38366134":"Note on a Conditional Property of Student\u0027s $t^1$","38358454":"Conditional Properties of Statistical Procedures"},"citedIn":{"12582078":"The Importance of Complexity in Model Selection","225234286":"Priors for Neural Networks","222434625":"Effects of Low Sample Mean Values and Small Sample Size on the Estimation of the Fixed Dispersion Parameter of Poisson-gamma Models for Modeling Motor Vehicle Crashes: A Bayesian Perspective","36444712":"Ignorance and Indifference","272392248":"Varying dimensional Bayesian acoustic waveform inversion for 1D semi-infinite heterogeneous media","2501664":"Bayesian Methods For Simulation","247503560":"The Multigroup Multilevel Categorical Latent Growth Curve Models","251542262":"Monte Carlo evaluation of the uncertainty associated with the construction and use of a fitted curve","261324699":"Form of prior for constrained thermodynamic processes with uncertainty","230623670":"Using priors to formalize theory: Optimal attention and the generalized context model","227681691":"Likelihood inference","230633909":"Preliminary analysis of key comparison CCM.M.P-K12 by Bayesian model averaging using a fixed effects model with linear drift","24083812":"Diagnostics of prior-data agreement in applied Bayesian analysis","263545790":"Inverse Gaussian process models for degradation analysis: A Bayesian perspective","263452604":"Coherent Frequentism: A Decision Theory Based on Confidence Sets","45904557":"Asymptotic admissibility of priors and elliptic differential equations","45932206":"Reference priors of nuisance parameters in Bayesian sequential population analysis","249865969":"Expanded uncertainty quantification in inverse problems: Hierarchical Bayes and Empirical Bayes","260564880":"Improving parameter priors for data-scarce estimation problems","228724152":"Geographically Assisted Elicitation of Expert Opinion for Regression Models","243042918":"An efficient MCEM algorithm for fitting generalized linear mixed models for correlated binary data","258247545":"Optimal designs for nonlinear regression models with respect to non-informative priors","250291956":"A Weakly Informative Default Prior Distribution for Logistic and Other Regression Models.","257575749":"An objective Bayesian estimation of parameters in a log-binomial model","2468871":"Propriety of Posteriors With Improper Priors in Hierarchical Linear Mixed Models","272260120":"An Entropy Based Methodology for Valuation of Demand Uncertainty Reduction","266205176":"How stable is the core discussion network?","260841386":"Replicating the Violence Risk Appraisal Guide: A Total Forensic Cohort Study","227706299":"An Introduction to Bayesian Reference Analysis: Inference on the Ratio of Multinomial Parameters","276308049":"Bayesian Estimation of Inequality and Poverty Indices in Case of Pareto Distribution Using Different Priors under LINEX Loss Function","45867665":"Bayesian variable selection using cost-adjusted BIC, with application to cost-effective measurement of quality of health care","1773613":"Predictive Hypothesis Identification","227688868":"Bayesian analysis for a stress‐strength system under noninformative priors","249861843":"Stochastic rock-physics inversion for thickness, lithology, porosity, and saturation","1919018":"On Probabilistic Parametric Inference","33935932":"Incorporating model selection and decision analysis into population dynamics modeling /","226175297":"Bayesian Estimation for Inequality Constrained Analysis of Variance","23133532":"Site-Specific Evolutionary Rates in Proteins Are Better Modeled as Non-Independent and Strictly Relative","12360832":"Identifiability and Convergence Issues for Markov Chain Monte Carlo Fitting of Spatial Models","265939943":"A Good P –value is Hard to Find: Why I\u0027m a Bayesian When Time Allows","273758319":"Objective Bayesian Estimation of the Probability of Default","227944873":"Improved Bayesian analysis of metapopulation data (with an application to a tree frog metapopulation)","244953817":"A Comparison of Bayesian and Likelihood-Based Methods for Fitting Multilevel Models","277608651":"Stochastic Collocation Algorithms Using $l_1$-Minimization for Bayesian Solution of Inverse Problems","251776835":"An Introduction to Bayesian Methods with Clinical Applications","247837322":"The Value of Informative Priors in Bayesian Inference with Sparse Data","220055890":"A Data Cloning Algorithm for Computing Maximum Likelihood Estimates in Spatial Generalized Linear Mixed Models","260742106":"Bayesian random effects meta-analysis of trials with binary outcomes: methods for the absolute risk difference and relative risk scales by D. E. Warn, S. G. Thompson and D. J. Spiegelhalter, Statistics in Medicine 2002; 21: 1601–1623","222663956":"Bayesian prediction of low count time series","24065341":"Reference priors for non-Normal two-sample problems","4724763":"Intrinsic Bayesian Estimation of Vector Autoregression Impulse Responses","266258315":"An Introduction to Generalized Linear Mixed Models","267426730":"Modeling glucose-insulin kinetics and development of type 2 diabetes in offspring of diabetic parents","228698623":"On model selection criteria in multimodel analysis","283334844":"There is Individualized Treatment. Why Not Individualized Inference?","263352274":"Being an informed Bayesian: Assessing prior informativeness and prior likelihood conflict","5139503":"Alternative Functional Forms for Production, Cost and Returns to Scale","271458380":"The Index of the Financial Safety of a Country: Estimation and Forecast","283481222":"Recent Developments in Bayesian Estimation of Climate Sensitivity","45868765":"Bayesian frequentist hybrid inference","229627335":"A new approach to default priors and robust Bayes methodology","271944799":"Model selection with misspecified spatial covariance structure","287249777":"Covariant priors and model uncertainty","26630630":"Open Problems in Universal Induction \u0026 Intelligence","237141587":"Model Uncertainty, Robust Optimization and Learning","226450701":"A multilevel Bayesian model for contextual effect of material deprivation","232710570":"Conceptual model uncertainty in groundwater modeling: Combining generalized likelihood uncertainty estimation and Bayesian model averaging","232609189":"The Bayesian Evaluation of Categorization Models: Comment on Wills and Pothos (2012)","228383201":"Bayesian computational methods in biomedical research","258232089":"Hierarchical Bayes, maximum a posteriori estimators, and minimax concave penalized likelihood estimation","2020448":"Bayesian Statistics at Work: the Troublesome Extraction of the CKM Phase alpha","226733564":"Eliciting vague but proper maximal entropy priors in Bayesian experiments","271920309":"Application of Bayesian model averaging using a fixed effects model with linear drift for the analysis of key comparison CCM.P-K12","6622439":"On the association between statin and fracture: A Bayesian consideration","232887650":"Average Most Powerful Tests for a Segmented Regression","253580185":"A threshold model for time varying copulas","220607905":"Objective Bayesianism with predicate languages. Synthese","267132772":"Steps Towards a Unified Basis for Scientific Models and Methods","1920149":"Analysis of Comparative Data with Hierarchical Autocorrelation","265404248":"ABSTRACT Bayesian Approaches to Parameter Estimation and Variable Selection for Misclassified Binary Data","255656884":"A framework to model shrimp (Pandalus borealis) stock dynamics and to quantify the risk associated with alternative management options, using Bayesian methods","2319535":"Objective Bayesian Analysis of Spatially Correlated Data","265207644":"An objective Bayesian approach to multistage hypothesis testing","227988738":"Prior Distribution","252389279":"MCMC algorithm, integrated four-dimensional seismic reservoir characterization and uncertainty analysis in a Bayesian framework","285549970":"Production uncertainties modelling by bayesian inference using gibbs sampling","7728354":"“How Vague is Vague? Simulations Study of the Impact of the Use of Vague Prior Distributions in MCMC Using WinBUGS,”","260112152":"Conservativeness of estimates given by probability density functions: Formulation and aspects","8149221":"Strange Bayes indeed: uniform topological priors","48168512":"Topics in statistical data analysis for high-energy physics","241445572":"Inferring Bayesian Priors with Limited Direct Data: Applications to Risk Analysis","258646987":"Credible occurrence probabilities for extreme geophysical events: Earthquakes, volcanic eruptions, magnetic storms","238687899":"Demographic Forecasting1","286481841":"Bayesian Estimation with Combined Empirical Prior Distribution for a Multinomial Logit Model","266577728":"Topics in Statistical Data Analysis for HEP","2471040":"Steps To Implement Bayesian Input Distribution Selection","2125958":"A frequentist framework of inductive reasoning. Technical Report","279721988":"The Elimination of Nuisance Parameters","2644099":"Statistical Inference For A Computational Model Of Cognition","4742372":"Multivariate t Distributions and Their Applications. Samuel Kotz and Saralees Nadarajah","237175447":"Reference Priors for Bayesian Fisheries Models","228011296":"Discussion of \"Objective priors: An Introduction for frequentists\"","4742385":"Probability Matching Priors: Higher Order Asymptotics. Gauri Sankar Datta and Rahul Mukerjee.","4742386":"Constrained Statistical Inference: Inequality, Order, and Shape Restrictions. Mervyn J. Silvapulle and Pranab K. Sen","12151810":"On the Complexity of Additive Clustering Models","12936313":"A comparison of mixed effects logistic models for binary response data with two nested levels of clustering","222422524":"Bayesian graphical model determination using decision theory","4741256":"Power Priors and Their Use in Clinical Trials","257101715":"Maximum relative entropy-based probabilistic inference in fatigue crack damage prognostics","7686324":"Bayesian statistical inference in psychology: Comment on Trafimow (2003)","4991119":"A Bayesian Multiple Comparison Procedure for Order-Restricted Mixed Models","254287851":"Default Bayes Factors for Nonnested Hypothesis Testing","257907610":"Prior probabilities and thermal characteristics of heat engines","258180005":"Bayesian Assessment of Null Values Via Parameter Estimation and Model Comparison","231601419":"A Bayesian perspective on input uncertainty in model calibration: Application to hydrological model \u0027\u0027abc\u0027\u0027","242735793":"New statistical methods in risk assessment by probability bounds","257642397":"Is there life after P\u003c0.05? Statistical significance and quantitative sociology","4771983":"Asymptotic inference for mixture models using data-dependent priors","278174814":"A Bayesian optimal design for degradation tests based on the inverse Gaussian process","46714374":"Bayesian data analysis","239550103":"Philosophies of Probability","252233689":"Preprint of the Book Chapter: \"Bayesian Versus Frequentist Inference","4993181":"Re-examining informative prior elicitation through the lens of Markov chain Monte Carlo methods","8205487":"Bayesian tests of extra-Binomial variability","264708883":"DIAMONDS: a new Bayesian Nested Sampling tool. Application to Peak Bagging of solar-like oscillations","27537777":"A fault diagnosis technique for complex systems using Bayesian data analysis","2121974":"Bayesian-motivated tests of function fit and their asymptotic frequentist properties","256088981":"Statistical Signal Processing for Data Fusion - Ph.D. thesis","33515816":"Incorporating model selection and decision analysis into population dynamics modeling","243042980":"Comparison of testing procedures utilizing P-values and Bayes factors in some common situations","246966883":"Noninformative Priors Do Not Exist: A Discussion with Jos","232817979":"Non-informative priors in the generalized gamma stress–strength systems","240167565":"Partial information reference priors: Derivation and interpretations","227667276":"The Current Position of Statistics: A Personal View","256036771":"Can Probability Theory Deal with Entrepreneurship?","277226596":"Statistical methods for fMRI data analysis","233756938":"Modeling individual differences with Dirichlet processes","256333730":"A Tutorial on Adaptive Design Optimization","255665114":"DISTRIBUIÇÕES EM SÉRIE DE POTÊNCIAS MODIFICADAS: ABORDAGEM CLÁSSICA E BAYESIANA","228388213":"Bayesian Methodology in Statistics","243042966":"Bayesian equivalence testing for binomial random variables","260003731":"Technical Note: Approximate Bayesian parameterization of a complex tropical forest model","222558637":"Noninformative Priors and Frequentist Risks of Bayesian Estimators of Vector-Autoregressive Models","223877558":"Some aspects of the history of Bayesian information processing","277141610":"Model tuning in engineering: Uncovering the logic","230574407":"Comparison of two views of maximum entropy in biodiversity: Frank (2011) and Pueyo et al. (2007)","266499870":"La valutazione dell\u0027eecacia dei corsi di formazione professionale mediante modelli multilivello in presenza di possibile selezione non casuale","221526472":"Bayesian Ideas and Discrete Event Simulation: Why, What and How","28376398":"Statistical models: Conventional, penalized and hierarchical likelihood","23528551":"Prior Distributions for Variance Parameters in Hierarchical Models","2133280":"Group invariant inferred distributions via noncommutative probability","268820739":"Bayesian gamma processes for optimizing condition-based maintenance under uncertainty","5207366":"On the implementation of local probability priors for interest parameters","229014701":"Minimally Informative Prior Distributions for PSA","253376022":"Dose Finding Using Bayesian Decision Theory in EarlyPhase Clinical Pharmacology Trials","223396958":"Bayesian copula selection","45915058":"Bayesian estimation of regularization and PSF parameters for Wiener-Hunt deconvolution","275062123":"Monte Carlo sampling from the quantum state space. I","228996279":"Reference Analysis","12151211":"Turner RM, Omar RZ, Thompson SGBayesian methods of analysis for cluster randomized trials with binary outcome data. Stat Med 20:453-472","12151210":"Bayesian methods for cluster randomized trials with continuous responses","236900105":"Objective Bayesian Analysis of Geometrically Anisotropic Spatial Data","12288417":"Statistical Issues in Toxicokinetic Modeling: A Bayesian Perspective","265339596":"Frequentist accuracy of Bayesian estimates","236900099":"Objective Bayesian Analysis for the Normal Compositional Model","238865186":"Structural Equation Modeling: A Bayesian Approach. Sik-Yum Lee. New York: Wiley, 2007, 432 pages, $130.00 (Hardcover)","237977357":"Bayesian analysis of data and model uncertainty in 3D seismic travel-time tomography","228387002":"Lecture Notes on Bayesian Estimation and Classification","47811571":"Heat Waves in the United States: Mortality Risk during Heat Waves and Effect Modification by Heat Wave Characteristics in 43 U.S. Communities","1741105":"Comment on \"Bayesian Analysis of Pentaquark Signals from CLAS Data\", with Response to the Reply by Ireland and Protopopsecu","270218544":"Bayesian approach to the inverse problem in a light scattering application","228372657":"Model distortions in Bayesian MAP reconstruction","263135901":"Discussion: Bayesian Methods: Applied? Yes. Philosophical Defense? In Flux","3864844":"Default prior for robust Bayesian model selection of sinusoids in Gaussian noise","267012816":"Probability and social science. Methodological relationships between the two approaches","285355065":"Subjective and Objective Bayesian Statistics: Principles, Models, and Applications, Second Edition","280032651":"Bayesian Estimation of the Active Concentration and Affinity Constants Using Surface Plasmon Resonance Technology","227677356":"Interactive use of default and robust Bayes testing methods in the presence of vague prior information","2135327":"Evaluation of Formal Posterior Distributions via Markov Chain Arguments","237735786":"Bayesian Regression Methodology for Estimating a Receiver Operating Characteristic Curve with Two Radiologic Applications","230587643":"Functional Uniform Priors for Nonlinear Modeling","230642937":"Climate Sensitivity Distributions Depend on the Possibility that Models Share Biases","233045156":"Bayesian Estimation of the Size of a Closed Population Using Photo-ID Data with Part of the Population Uncatchable","222821390":"Model selection for the rate problem: A comparison of significance testing, Bayesian, and minimum description length statistical inference","228707560":"On the Bayesian estimation of species richness and related quantities: the homogeneous case.","233742498":"The Index of the Financial Safety (IFS) of South Africa and Bayesian Estimates for IFS Vector-Autoregressive Model","12725651":"A novel Bayesian decision procedure for early-phase dose finding studies","268254888":"On thinking probabilistically","229351678":"Bayesian analysis of repairable systems showing a bounded failure intensity","260636382":"Examining the Predictive Validity of the SORAG in Switzerland","228775157":"Piecing together the past: Statistical insights into paleoclimatic reconstructions","5132569":"Bayesian Econometrics","228765946":"Neural networks and default priors","226671834":"A Bayesian approach to evaluating site impairment","30003344":"Model-Based Bayesian Reinforcement Learning in Complex Domains","272382309":"Unsupervised joint decomposition of a spectroscopic signal sequence","263857889":"Bayesian uncertainty analysis compared with the application of the GUM and its supplements","247345120":"Bayes factors: Prior sensitivity and model generalizability","227907786":"A new MCMC algorithm for seismic waveform inversion and corresponding uncertainty analysis","259522067":"Modeling land use decisions with Bayesian networks: Spatially explicit analysis of driving forces on land use change","222580771":"On universal prediction and Bayesian confirmation","266474126":"Intrinsic Bayesian estimation of VAR impulse responses","228970697":"The Dynamics of Multinationals Expansion in the European Pharmaceutical Industry (DRAFT)","238699351":"ACCOUNTING FOR INPUT UNCERTAINTY IN DISCRETE-EVENT SIMULATION","226256914":"Resurrecting Logical Probability","279394783":"An Introduction to Monte Carlo Methods for Bayesian Data Analysis","23230491":"Comment on \"Bayesian Analysis of Pentaquark Signals from CLAS Data\"","232284321":"A solution to separation for clustered binary data","267200150":"Variational Inference for Crowdsourcing","51978852":"A Thermodynamical Approach for Probability Estimation","2501030":"A comparison of Bayesian and likelihood-based methods for fitting multilevel models","260946444":"Penalising model component complexity: A principled, practical approach to constructing priors","222538944":"Strong matching of frequentist and Bayesian inference","259127026":"Copula Models for Frequency Analysis What can be learned from a Bayesian perspective?","5207499":"Variable selection in clustering via Dirichlet process mixture models","249866082":"Probabilistic seismic inversion based on rock-physics models","268328569":"Estimation and Inference for Set-identi…ed Parameters Using Posterior Lower Probability","28359740":"Modern reserving techniques for the insurance business","4724166":"Bayesian Estimates for Vector Autoregressive Models","261156352":"Generating adaptive learning paths in e-learning environments","267743847":"Chapter Seven. Identifying and Reducing Potentially Wrong Immunoassay Results Even When Plausible and “Not-Unreasonable”","277857563":"Incorporation of meta-analyses of diagnostic test accuracy studies into a clinical/economic decision analytic framework","242317284":"Incorporating expert knowledge into frequentist inference by combining generalized confidence distributions","225027324":"Bayesian evidence for non-zero θ 13 and CP-violation in neutrino oscillations","220010635":"Monte Carlo Bayesian look-Ahead of walkaway vertical seismic profiles","228903987":"Integrated objective Bayesian estimation and hypothesis testing","221819040":"Estimating Brownian motion dispersal rate, longevity and population density from spatially explicit mark-recapture data on tropical butterflies","257528512":"Is it a power law distribution? The case of economic contractions","226509851":"A First Look at the Minimum Description Length Principle","228664378":"A Bayesian approach for data assimilation and conditional simulation of spatial random fields","222571743":"Constructing informative model priors using hierarchical methods","267682390":"OBJECTIVE BAYESIANISM","51958460":"On Principles of Inductive Inference","225107150":"Default Priors for Neural Network Classification","227761205":"On probability matching priors","281427297":"Intrinsic Bayesian Analysis for Occupancy Models","241103865":"151 O - Association between helicobacter pylori infection and pancreatic cancer","2120071":"Default priors for Gaussian processes. Ann Stat","4725216":"Bayesian and Non-Bayesian Approaches to Scientific Modeling and Inference in Economics and Econometrics","237175690":"Automatic calculation of the sensitivity of Bayesian fisheries models to informative priors","243050454":"Bayesian P-Values for Testing Independence in 2 × 2 Contingency Tables","2469257":"Bayesian Analysis: A Look at Today and Thoughts of Tomorrow","228963349":"Reference analysis for the p-dimensional linear calibration problem","242042845":"That Wretched Prior: Online Appendix to \\A Practical Solution to the Pervasive Problems of p{Values\", to appear in Psychonomic Bulletin \u0026 Review","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","51733153":"Developing Appropriate Methods for Cost-Effectiveness Analysis of Cluster Randomized Trials","40867802":"Random Effects Modeling of Categorical Response Data","235891642":"Likelihood and objective Bayesian modeling of acidity and major ions in rainfall using a bivariate pseudo-Gamma distribution","247373577":"Reference Bayesian Methods for Generalized Linear Mixed Models","243026884":"Noninformative priors for the common mean in the bivariate normal distribution","1959332":"On the Foundations of Universal Sequence Prediction","243103684":"Comment: The Importance of Jeffreys’s Legacy","227369012":"Improper Priors Are Not Improper","228584485":"Testing Democratic Peace Theory: A New Approach with Application to The Israeli-Palestinian Conflict","225080528":"A Comparison of three methods for integrating historical information for Bayesian model averaged benchmark dose estimation","235248575":"Current Obstacles in Replicating Risk Assessment\nFindings: A Systematic Review of Commonly\nUsed Actuarial Instruments","261742114":"The Bootstrap and Modern Statistics","287810716":"MODEL UNCERTAINTY","271227285":"Looking for a Needle in a Haystack: Revisiting the Cross-country Causes of the 2008–9 Crisis by Bayesian Model Averaging","263656054":"Model Development and Comparative Study of Bayesian and ANFIS Inferences for Uncertain Variables of Production Line in Tile Industry","227917911":"Bayesian methods for cluster randomized trials with continuous response","228625508":"Ambiguity and the Bayesian paradigm","229038177":"Invariant HPD credible sets and MAP estimators","2434530":"The Behrens-Fisher problem revisited: A Bayes-frequentist synthesis","254206689":"Some aspects of matching priors","258161316":"A new bivariate exponential distribution for modeling moderately negative dependence","273338765":"High seed dispersal ability of Pinus canariensis in stands of contrasting density inferred from genotypic data","222725260":"Jeffreys priors for survival models with censored data","3952118":"Die attach delamination characterization modeling for SOIC package","7072166":"Assessing model mimicry using the parametric bootstrap","2132462":"On likelihood ratio tests","30516254":"Développement de méthodes de traitement de signaux spectroscopiques : estimation de la ligne de base et du spectre de raies","222182639":"Modeling pairwise convergence: A Bayesian approach with an application to Greek inflation","5338500":"Classifying individuals as physiological responders using hierarchical modeling","259441327":"Objective Bayesian Variable Selection in Well-Formulated Models","7969184":"Model Parameterization, Prior Distributions, and the General Time-Reversible Model in Bayesian Phylogenetics","237628400":"Bayesian Estimator of Vector-Autoregressive Model Under the","12337510":"Nonconjugate Bayesian Analysis of Variance Component Models","227489876":"Statistical Science and Philosophy of Science: Whrer Do / Should They Meet in 2011 (and Beyond)?","249866047":"Two ways to quantify uncertainty in geophysical inverse problems","232095753":"Bayesian Estimation of Categorical Dynamic Factor Models","51561167":"Bayesian Approaches in Medical Device Clinical Trials: A Discussion with Examples in the Regulatory Setting","23406727":"Use of Bayesian Methods to Improve Prediction of Panicle and Shoot Blight Severity of Pistachio in California","228527229":"Objective Priors from Maximum Entropy in Data Classification","2108867":"The marginalization paradox does not imply inconsistency for improper priors","27515978":"Bayesian Model Assessment and Selection Using Expected Utilities","263552606":"I Got More Data, My Model is More Refined, but My Estimator is Getting Worse! Am I Just Dumb?","228275319":"Dynamic Spatial Bayesian Models for Radioactivity Deposition","51520255":"Bayesian Estimation for Optimized Structured Illumination Microscopy","282931504":"Design of a robust fusion of probability densities","257758899":"On-line outlier and change point detection for time series","10960213":"Bayesian methods for design and analysis of cost-effectiveness trials in the evaluation of health care technologies","254212816":"Kinds of Bayesians (Comment on articles by Berger and by Goldstein)","3834305":"Steps to implement Bayesian input distribution selection","230749243":"The Choice of a Noninformative Prior on Between-Study Variance Strongly Affects Predictions of Future Treatment Effect","277690742":"Bayesian Analysis of Dynamic Network Regression with Joint Edge/Vertex Dynamics","265295405":"Conditional maximum-entropy method for selecting prior distributions in Bayesian statistics","4111808":"Bayesian methods for discrete event simulation","41896833":"Power for studies with random group sizes","221666100":"A simple minimax estimator for quantum states","267010555":"Recent developments in applied probability and statistics. Dedicated to the memory of Jürgen Lehn","257199431":"Reference priors for linear models with general covariance structures","265584064":"Standard Errors of Prediction in Generalized Linear Mixed Models","5112411":"Decision Bounds for Data-Admissible Seasonal Models","267490796":"Degradation Analysis Using Inverse Gaussian Process Model With Random Effects: A Bayesian Perspective","29828057":"Multilevel models for survival analysis in dental research","220555066":"An introduction to the imprecise Dirichlet model","227687346":"Methods for Default and Robust Bayesian Model Comparison: The Fractional Bayes Factor Approach","45895836":"Bayes, Jeffreys, Prior Distributions and the Philosophy of Statistics","23635785":"Posterior distribution for negative binomial parameter using a group invariant prior","265271789":"Eliciting Univariate Probability Distributions","10601091":"Empirical Bayes Gibbs sampling","233326539":"Formulation and Application of the Hierarchical Generalized Random-Situation Random-Weight MIRID","222157589":"Power prior distributions for generalized linear models","281690851":"Bayesian estimation for Gini index and a poverty measure in case of Pareto distribution using Jeffreys\u0027 prior","259288415":"Idiosyncrasy as an explanation for power laws in nature","251668781":"578 Induction of acute apoptosis by cisplatin is not associated with damage to nuclear DNA and is likely to be an “off-target effect”","2594313":"Bayesian Computational Approaches to Model Selection","11902597":"On determining sample sizes in hierarchical binomial models","226714545":"Hierarchical Bayes estimation of hunting success rates","2168338":"Statistical Analysis of Composite Spectra","45352071":"A Bayesian framework for the ratio of two Poisson rates in the context of vaccine efficacy trials","8430260":"Veillonella montpellierensis sp nov., a novel, anaerobic, Gram-negative coccus isolated from human clinical samples","238879755":"The Boxer, the Wrestler, and the Coin Flip","51224890":"Statistical inference for stochastic simulation models? Theory and application","37808250":"Estimación Bayesiana en modelos de producción con frontera determinista","265770474":"A 250-year argument: Belief, behavior, and the bootstrap","23633751":"Reference priors for the general location-scale model","224861990":"Connecting dynamic vegetation models to data - an inverse perspective","3319409":"On Posterior Distributions for Signals in Gaussian Noise With Unknown Covariance Matrix","266879403":"A Prior and Data Validation and Adjustment Scheme for Bayesian Reliability Analysis in Engineering Design","51966299":"Estimating meteor rates using Bayesian inference","282836627":"Bayesian Approach to Utilize Historical Control Data in Clinical Trials","1924694":"Probability matching priors for some parameters of the bivariate normal distribution","243026995":"Non-informative priors for the common mean in the one-way random effects model with heterogeneous error variances","3318368":"A Bayesian sampling approach to decision fusion using hierarchical models","222734101":"A note on noninformative priors for Weibull distributions","257651982":"Parameter and uncertainty estimation for process-oriented population and distribution models: Data, statistics and the niche","275836454":"On the Flatland Paradox","291294986":"Bayesian Statistics in Quantitative Risk Assessment","1735232":"Asymptotics of posteriors for binary branching processes","227368919":"[Review] Bayesian Methods: A Social and Behavioral Sciences Approach","44902640":"Bayesian estimation of regularization and point spread function parameters for Wiener-Hunt deconvolution","251668830":"617 HER2 cytoplasmic staining as an independent risk factor for death in penile cancer","1924732":"Remarks on consistency of posterior distributions","24422166":"Properties and Implementation of Jeffreys\u0027s Prior in Binomial Regression Models","38348843":"Single Observation Unbiased Priors","46538914":"Population-based reversible jump Markov chain Monte Carlo methods for Bayesian variable selection and evaluation under cost limit restrictions","11994835":"Bayesian approach for neural networks - Review and case studies","238738515":"Noninformative Prior Bayesian Analysis for Statistical Calibration Problems","46536874":"Probability matching priors: a review","266026422":"The approach of power priors for ability estimation in IRT models","237128781":"A Bayesian Approach to some Cryptic Issues on the Nature of Statistical Inference","2547286":"Testing For Cointegration Rank Using Bayes Factors","251624591":"9307 POSTER Oncogenic Mutation Dependent Response to Growth Factors in Melanoma Cells","24410887":"Bayesian methods in cost-effectiveness studies: Objectivity, computation and other relevant aspects","254423388":"Inference and decision for set identified parameters using posterior lower and upper probabilities","1924709":"Objective Bayes testing of Poisson versus inflated Poisson models","225260308":"A Noninformative Prior for Neural Networks","46452920":"Market Freedom and the Global Recession","265513390":"Bayesian Hierarchical Models for aerospace gas turbine engine prognostics","251528319":"Bayesian variable selection using a cost-penalised approach, with application to cost-eective measurement of quality of health care","51917209":"Blending Bayesian and frequentist methods according to the precision of prior information with applications to hypothesis testing","43201559":"Bounded uncertainty and climate change economics. Proc Natl Acad Sci USA","221089706":"Counter-Examples for Bayesian MAP Restoration","5760735":"A Practical Solution to the Pervasive Problems of p Values","238853301":"Non-informative priors do not exist A dialogue with José M. Bernardo","228167443":"Bias Reduction for Bayesian and Frequentist Estimators","26533662":"A Bayesian model for binary Markov chains","24052708":"Bayesian estimation of system reliability in Brownian stress-strength models","235217033":"Hierarchical Bayesian Analysis of Arrest Rates","233062249":"A Hybrid Approximation Bayesian Test of Variance Components for Longitudinal Data","229329701":"Bayesian and likelihood-based inference for the bivariate normal correlation coefficient","221860790":"‘Philosophy and the Practice of Bayesian Statistics.’","271753889":"The Impact of Inaccurate “Informative” Priors for Growth Parameters in Bayesian Growth Mixture Modeling","2922169":"Re-examining informative prior elicitation through the lens of MCMC","262678845":"Evaluating the uncertainty of input quantities in measurement models","227544838":"Sensitivity analysis of prior model probabilities and the value of prior knowledge in the assessment of conceptual model uncertainty in groundwater modeling","221623202":"Estimation of uncertainty in respiratory-gated PET images.","227548936":"The conflation of ignorance and knowledge in the inference of clade posteriors","277296669":"NISS A Model for Relating Browser Behavior to Site Design on the World Wide Web","225810415":"Estimating exceedance frequencies of extreme river discharges using statistical methods and physically based approach","240020718":"Gibbs Sampling with Diffuse Proper Priors: A Valid Approach to Data-Driven Inference?","251463775":"Chapter 9 Subjective Probability and Bayesian Methodology","228690693":"Least-Squares and Bayesian Inferences for Johnson\u0027s SL and SB Distributions","2608771":"Prospects of Nonparametric Modeling","265194859":"Model Selection and Model Complexity: Identifying Truth Within A Space Saturated with Random Models","222425060":"Bayesian Methods for Control Loop Monitoring and Diagnosis","4743918":"Objective Bayesian Analysis of Spatially Correlated Data","2717339":"Asymptotic Properties of Nonparametric Bayesian Procedures","244211772":"A Bayesian, Sequential Look at u-Control Charts","2321044":"Default Analysis of Mixture Models using Expected Posterior Priors","281262715":"The choice of prior distribution for a covariance matrix in multivariate meta-analysis: A simulation study","2195102":"Extended statistical modeling under symmetry; The link toward quantum mechanics","5894808":"Variational Bayesian inversion of the equivalent current dipole model in EEG/MEG","222821252":"Modeling individual differences using Dirichlet processes","242021551":"Bayesian econometrics: Past, present and future","262489443":"Bayesian inference of Gaussian mixture models with noninformative priors","266400039":"Inference From Intrinsic Bayes’ Procedures Under Model Selection and Uncertainty","229364577":"Intrinsic Bayes factor approach to a test for the power law process","251423799":"Sensitivity analysis and assessment of prior model probabilities in MLBMA with application to unsaturated fractured tuff","273276550":"Bayesian Estimation and Inference: A User\u0027s Guide","227850054":"Case study in the Bayesian analysis of a cost‐effectiveness trial in the evaluation of health care technologies: Depression","233173814":"An alternative approach to test process capability for unilateral specification with subsamples","277932611":"Prior near ignorance for inferences in the k -parameter exponential family","4772511":"Non-linear state space mode of fisheries biomass dynamics by using Metropolis-Hastings within Gibbs sampling","7449254":"Bayesian implementation of a ‘model-free’ approach to the meta-analysis of genetic association studies","258327986":"Statistical models, likelihood, penalized likelihood and hierarchical likelihood","2821874":"Strong matching of frequentist and Bayesian parametric inference","277023322":"Bayesian Estimation of the Kumaraswamy Inverse Weibull Distribution","2429695":"Nonconjugate Bayesian Estimation of Covariance Matrices and Its Use in Hierarchical Models","262875505":"conting: An R Package for Bayesian Analysis of Complete and Incomplete Contingency Tables","227373907":"Steps Towards a Unified Basis for Scientific Models and Methods by Inge S. Helland","265425165":"Reference priors with partial information","267239693":"Objective Bayesian Upper Limits for Poisson Processes","254057924":"Application of Stochastic Inversion to Casing Effect Correction in Through Casing Induction Logging","48178238":"Reuse, Recycle, Reweigh: Combating Influenza through Efficient Sequential Bayesian Computation for Massive Data","4286116":"Mixture of nonlinear models: a Bayesian fit for Principal Curves","4741805":"A Generalized WangLandau Algorithm for Monte Carlo Computation","238853339":"On estimating the current intensity of failure for the power-law process","6412936":"Symmetrical event-related EEG/fMRI information fusion in a variational Bayesian framework","241220750":"Maximum Entropy and Bayesian inference: Where do we stand and where do we go?","234014467":"Probability and Statistical Inference","233747228":"Objective Bayesian analysis of spatial data with uncertain nugget and range parameters","228393838":"What is Bayesian statistics an why everything else is wrong","6204077":"Lung Nodule Detection Via Bayesian Voxel Labeling","262947156":"Can Bayesian models play a role in dental caries epidemiology? Evidence from an application to the BELCAP data set","26902369":"Bayesian variable selection in clustering via dirichlet process mixture models","230783802":"On becoming a Bayesian: Early correspondences between J. Cornfield and L. J. Savage","228556642":"Commentary on \u0027The Prior Probabilities of Phylogenetic Trees\u0027 by Joel Velasco","38322508":"Consistency and Strong Inconsistency of Group-Invariant Predictive Inferences","225117804":"Process capability assessment for index Cpk based on Bayesian approach","223885919":"A review and comparison of four commonly used Bayesian and maximum likelihood model selection tools. Ecol Model","35198225":"A Modified Bayesian Power Prior Approach with Applications in Water Quality Evaluation","220680751":"Asymptotic Redundancies for Universal Quantum Coding","247728588":"Bayesian Factor Analysis When Only a Sample Covariance Matrix Is Available","254212143":"Checking for prior-data conflict","254449699":"Solution to the paradox of climate sensitivity","242997621":"Bayesian analysis of vector-autoregressive models with noninformative priors","288121405":"VES and global optimisation methods: A different perspective to analyze equivalent models in applied geophysics","276884371":"On the Bayesianity of minimum risk equivariant estimator for location or scale parameters under a general convex and invariant loss function","220489271":"A Tutorial Introduction to the Minimum Description Length Principle","279435188":"Probability Matching Priors","2351926":"BUGS in Bayesian stock assessment","51571719":"Statistical Inference: The Big Picture","266096842":"Alternative Bayesian Estimators for Vector-Autoregressive Models","242371947":"Tutorial Prior information and uncertainty in inverse problems","264302810":"S.E.V and Optimización Global: una visión diferente de los modelos equivalentes en geofísica aplicada","258438269":"Hidden Skewness: On the Difficulty of Multiplicative Compounding under Random Shocks","224013892":"On the association between statin and fracture: a Bayesian consideration","251753502":"Posterior distributions on certain parameter spaces obtained by using group theoretic methods adopted from quantum physics","226026076":"Invariance of posterior distributions under reparametrization","227350184":"Internet-Based Virtual Stock Markets for Business Forecasting","254393356":"Bayesian Priors from Loss Matching","44608903":"Insights into the Influence of Priors in Posterior Mapping of Discrete Morphological Characters: A Case Study in Annonaceae","233312984":"Non-informative invariant priors yield peculiar marginals","258229328":"Invariant Bayesian estimation on manifolds","258275410":"Reduced-order model tracking and interpolation to solve PDE-based Bayesian inverse problems","223850095":"Assessing process capability based on Bayesian approach with subsamples","2371358":"Prior Information and Uncertainty in Inverse Problems","220441117":"Bayesian Model Learning Based on Predictive Entropy","257650788":"Bayesian Ying Yang Learning (II): A New Mechanism for Model Selection and Regularization","3080046":"Asymptotic redundancies for universal quantum coding","281261954":"Beyond subjective and objective in statistics","260303042":"On the Performance Limits of Map-Aware Localization","223148558":"Bayesian Model Selection and Model Averaging","2286432":"Bayesian Modelling of Outstanding Liabilities Incorporating Claim Count Uncertainty","222825995":"Frequentist evaluation of intervals estimated for a binomial parameter and for the ratio of Poisson means","220056158":"Objective Bayesian analysis of accelerated competing failure models under Type-I censoring","266908844":"Comprehensive review of association estimators for the inference of gene networks","2763618":"Nonparametric Goodness-of-Fit","278607826":"Some statistical heresies - Discussion","260015158":"Analytical derivation of the reference prior by sequential maximization of Shannon\u0027s mutual information in the multi-group parameter case","41452850":"Joint Models for the Association of Longitudinal Binary and Continuous Processes With Application to a Smoking Cessation Trial","8513485":"Assessing the distinguishability of models and the informativeness of data","267843769":"Applications of Bayesian Neural Networks in Prostate Cancer Study","242551072":"Benchmark Abundance and Assessment of the Torres Strait Lobster Stock","267410598":"Uncertainty Propagation through Dependability Models","220060234":"Solving operational statistics via a Bayesian analysis","233301693":"Contagion determination via copula and volatility threshold models","250160566":"Bayes Estimates of Flood Quantiles using the Generalised Gamma Distribution","2407238":"Bayesian Analysis For Simulation Input And Output","4742957":"Bayesian copula selection","2128710":"Exact Bayesian Regression of Piecewise Constant Functions","24374805":"Limits of Learning about a Categorical Latent Variable under Prior Near-Ignorance","4986667":"The Boxer, the Wrestler, and the Coin Flip: A Paradox of Robust Bayesian Inference and Belief Functions","46494121":"Finite-sample investigation of likelihood and Bayes inference for the symmetric von Mises-Fisher distribution","259514395":"On the measured lifetime of light hypernuclei 3ΛH and 4ΛH","3885909":"Bayesian methods for simulation","215754666":"Introductory Geophysical Inverse Theory","29654706":"Statistical Inference under Symmetry","278661094":"Bayesian Statistics","223489580":"A Note on Reference Priors for the Scalar Skew-normal Distribution","259881986":"A framework for parameter estimation and model selection from experimental data in systems biology using approximate Bayesian computation","275588077":"Comment on Article by Berger, Bernardo, and Sun","227375628":"Reliability and Risk-a Bayesian Perspective","247503182":"Bayesian Interval Estimation of Multiple Correlations with Missing Data: A Gibbs Sampling Approach","2469813":"Interval Estimation in Exponential Families","227253787":"Bayesian Versus Frequentist Inference","45226279":"Estimating Species Richness from Quadrat Sampling Data : a general approach","24020728":"Inferring recent migration rates from individual genotypes","229503540":"Objective priors for hypothesis testing in one‐way random effects models","5460938":"Complete treatment of uncertainties in a model for dengue R-0 estimation","230734425":"Bayesian assessment of the expected data impact on prediction confidence in optimal sampling design","266538105":"Bayesian Robustness","4914135":"Maximizing generalized linear mixed models with an automated Monte Carlo EM algorithm","45917474":"Objective Probabilistic Forecasts of Future Climate Based on Jeffreys\u0027 Prior: the Case of Correlated Observables","2308995":"Coverage Probability Bias, Objective Bayes and the Likelihood Principle","246406415":"Hypothesis Testing: From p Values to Bayes Factors","223682291":"Beta-MPT: Multinomial processing tree models for addressing individual differences","264793198":"Using Bayes to get the most out of non-significant results","223375095":"Prediction markets, Bayesian priors, and clinical trials","267971664":"Predictive inference: From Bayesian inference to Imprecise Probability","222239380":"A Bayesian approach to testing decision making axioms","227452453":"Estimación Bayesiana en modelos de producción con frontera determinista/Bayesian Estimation in Deterministic Frontier Production Models","259111130":"Incomplete contingency tables with censored cells with application to estimating the number of people who inject drugs in Scotland","8525615":"Sensitivity of Bayes Estimators to Hyper-Parameters with an Application to Maximum Yield from Fisheries","51464380":"Bayesian analysis of an international ELISA comparability study","231111286":"Bayesian assessment of uncertainty in metrology: A tutorial","7269340":"Are Unequal Clade Priors Problematic for Bayesian Phylogenetics?","2191250":"Quantum theory as a statistical theory under symmetry and\ncomplementarity","225482436":"A general divergence criterion for prior selection","220699281":"Ranking the Uniformity of Interval Pairs","23980763":"Weather-Related Mortality: How Heat, Cold, and Heat Waves Affect Mortality in the United States","223457938":"Reconstruction of a distribution from a finite number of moments with an adaptive spline-based algorithm","4741007":"Bayesian Randomized Response as a Class Project","282945306":"A Geometric Principle of Indifference","239065590":"Input Distribution Selection for Simulation Experiments: Accounting for Input Uncertainty","239068654":"Identification of the Effective Distribution Function for Determination of the Distributed Activation Energy Models Using Bayesian Statistics: Application of Isothermal Thermogravimetric Data","228611698":"EXTENDED STATISTICAL MODELLING UNDER SYMMETRY; THE LINK TOWARDS QUANTUM MECHANICS. Abbreviated: Statistics and quantum mechanics …","38958464":"Inversion bayésienne myope et non-supervisée pour l\u0027imagerie sur-résolue. Application à l\u0027instrument SPIRE de l\u0027observatoire spatial Herschel.","251267375":"AUTOMATIC QUALITY ASSESSMENT OF GIS ROAD DATA USING AERIAL IMAGERY - A COMPARISON BETWEEN BAYESIAN AND EVIDENTIAL REASONING","10887025":"Incorporation of genuine prior beliefs in cost-effectiveness analysis of clinical trials data","240737664":"Porosity inference and classification of siliciclastic rocks from multiple data sets","251495716":"M - 4 Transmettre l’information sur le caractère héréditaire de la maladie de Huntingon","41662887":"A Bayesian approach to peptide identification by accurate mass and time tags in proteomics experiments","268616670":"Stochastic reliability and maintenance modeling. Essays in honor of Professor Shunji Osaki on his 70th birthday","6741944":"Multiple imputation for the comparison of two screening tests in two-phase Alzheimer studies","275669902":"Cross-validatory extreme value threshold selection and uncertainty with application to ocean storm severity","2843593":"Model Selection and Accounting for Model","228930118":"A Constructivist View of the Statistical Quantification of Evidence","240925112":"Bayesian Survival Analysis for Discrete Data with Left-Truncation and Interval Censoring","267254792":"BAYESIAN MODELING OF ANOMALIES DUE TO KNOWN AND UNKNOWN CAUSES","233928215":"Combining and comparing neutrinoless double beta decay experiments using\ndifferent nuclei","230258257":"Bayesian Statistics in Quantitative Risk Assessment","2607052":"Practical Bayesian Data Analysis from a Former Frequentist","241086898":"Non-informative priors in GUM Supplement 1","226236049":"A decision-theoretical view of default priors","8637293":"Model Comparison Methods","50991356":"Modeling Gaussian Random Fields by Anchored Inversion and Monte Carlo\nSampling","7338904":"Multiple imputation for correcting verification bias","45416770":"Common before-after accident study on a road site: A low-informative Bayesian method","220301014":"Asymptotics of Bayesian median loss estimation","7617421":"Multilevel modelling of clustered grouped survival data using Cox regression model: An application to ART dental restorations","271023069":"Deflating Trees: Improving Bayesian Branch-Length Estimates using Informed Priors","51077360":"An extension of the single threshold design for monitoring efficacy and safety in phase II clinical trials","228887129":"An evaluation of common distributional models for a Bayesian prior of the scale transformation","239918515":"Bayes for Beginners? Some Reasons to Hesitate","46511418":"Should Legal Empiricists Go Bayesian?","251301125":"On the choice of a noninformative prior for Bayesian inference of discretized normal observations"},"index":722}