{"abs":"Most applications in spatial statistics involve modeling of complex spatial–temporal dependency structures, and many of the problems of space and time modeling can be overcome by using separable processes. This subclass of spatial–temporal processes has several advantages, including rapid fitting and simple extensions of many techniques developed and successfully used in time series and classical geostatistics. In particular, a major advantage of these processes is that the covariance matrix for a realization can be expressed as the Kronecker product of two smaller matrices that arise separately from the temporal and purely spatial processes, and hence its determinant and inverse are easily determinable. However, these separable models are not always realistic, and there are no formal tests for separability of general spatial–temporal processes. We present here a formal method to test for separability. Our approach can be also used to test for lack of stationarity of the process. The beauty of our approach is that by using spectral methods the mechanics of the test can be reduced to a simple two-factor analysis of variance (ANOVA) procedure. The approach we propose is based on only one realization of the spatial–temporal process.We apply the statistical methods proposed here to test for separability and stationarity of spatial–temporal ozone fields using data provided by the US Environmental Protection Agency (EPA).","title":"Testing separability of spatial-temporal covariance functions","id":222547936,"url":"https://www.researchgate.net/publication/222547936_Testing_separability_of_spatial-temporal_covariance_functions","names":["Montserrat Fuentes","Journal of Statistical Planning and Inference"],"references":{"222831497":"Testing for directional symmetry in spatial dependence using the periodogram","234216660":"The Advanced Theory of Statistics. Vol 3. Design and Analysis, and Time-Series","227604754":"A new high frequency Kriging approach for nonstationary environmental processes","12030324":"Underwater source detection using a spatial stationarity test","23644843":"A likelihood ratio test for separability of covariances","247720870":"Testing separability of covariances for space-time processes","2841006":"A New High Frequency Kriging Approach for Nonstationary Environmental","229674710":"Some Inference Results for Causal Autoregressive Processes on a Plane","2315626":"Spectral Methods for Nonstationary Spatial Processes","222446158":"Statistical assessment of spatio-temporal pollutant trends and meteorological transport models","3682645":"Invariant Tests For Spatial Stationarity Using Covariance Structure","257273639":"Testing axial symmetry and separability of lattice processes","2444887":"Classes of Nonseparable, Spatio-Temporal Stationary Covariance Functions","229193594":"Linear Statistical Inference and Its Applications, Second Edition","265369029":"“A Test for Non-stationarity of Time-series,”","38368092":"On Stochastic Limit and Order Relationships","222415894":"A formal test for nonstationary of spatial stochastic processes","4752595":"Blur-generated non-separable space-time models","245309057":"An asymptotic test for separability of a spatial autoregressive model"},"citedIn":{"254653615":"Using Transforms to Analyze Space-Time Processes","47501526":"Kronecker product linear exponent AR(1) correlation structures and\nseparability tests for multivariate repeated measures","242612208":"Spatiotemporal modeling of environmental processes: nitrogen oxides concentrations in the Tuscany region","266452583":"Some Recent Contributions to Spatio-Temporal Modelling","261222681":"A frequency domain approach for the estimation of parameters of spatio-temporal stationary random processes","268812685":"A Frequency Domain Empirical Likelihood Method for Irregularly Spaced Spatial Data","266021584":"Asymptotic Properties of Discrete Fourier Transforms for Spatial Data.","4742724":"A Nonparametric Assessment of Properties of SpaceTime Covariance Functions","256475847":"Characteristics of some classes of space-time covariance functions","24195297":"Spatiotemporal analysis of the PM10 concentration over the Taranto area","225621856":"Nonseparable stationary anisotropic space–time covariance functions","227598979":"Comments on: A general science-based framework for nonlinear spatio-temporal dynamical models","227792522":"Mixture‐based modeling for space–time data","229561527":"Nonparametric test for separability of spatio-temporal processes. Environmetrics","268722845":"Spatial Statistics and Spatio-Temporal Data: Covariance Functions and Directional Properties","277707924":"Kronecker ProductBased in part on the article “Kronecker product” by A. O\u0027Hagan, which appeared in the Encyclopedia of Environmetrics .","47702605":"Comparing air quality statistical models","258229118":"Parameter tuning for a multi-fidelity dynamical model of the magnetosphere","254409906":"Testing the covariance function of stationary Gaussian random fields","281673042":"Temporal aggregation and spatio-temporal traffic modeling","24249326":"Testing Lack of Symmetry in Spatial-Temporal Processes.","265995463":"Modern Space/Time Geostatistics Using River Distances: Theory and Applications for Water Quality Mapping","242471889":"Non-separability in space-time covariance functions","29626720":"Catchment as Space-time Filters - A Joint Spatio-temporal Geostatistical Analysis of Runoff and Precipitation","260447650":"Kronecker Product Linear Exponent AR(1) Correlation Structures for Multivariate Repeated Measures","281312865":"A Review of Nonparametric Hypothesis Tests of Isotropy Properties in Spatial Data","2120071":"Default priors for Gaussian processes. Ann Stat","267744594":"Separability tests for high-dimensional, low-sample size multivariate repeated measures data","220286473":"Weighted composite likelihood-based tests for space-time separability of covariance functions","275974362":"Coherence for Random Fields","236855735":"Spatio-temporal modeling and prediction of solar radiation","233430978":"Strict Positive Definiteness of a Product of Covariance Functions","236869298":"Model Comparison and Selection for Stationary Space-Time Models","228944265":"Two approaches to imputation and adjustment of air quality data from a composite monitoring network","229710237":"Spatio‐temporal processes","228534065":"A result on the spatio-temporal correlation function under temporal aggregation","254281735":"Time Series: Modeling, Computation, and Inference","234154820":"Sviluppi della Geostatistica Multivariata per l’Analisi dei Dati Ambientali nello Spazio e nello Spazio-Tempo","228972695":"Estimation of the distribution of change-points with appliction to fMRI data","48188653":"An Adjusted Likelihood Ratio Test for Separability in Unbalanced\nMultivariate Repeated Measures Data","265729892":"Estimation and Testing for Covariance-Spectral Spatial-Temporal Models","282181474":"Testing separability of space--time functional processes","235208886":"A New Class of Nonseparable and Nonstationary Covariance Models for Wind Fields","234113984":"Evaluating stationarity via change-point alternatives with applications\nto fMRI data","23509714":"Spatial Modelling of Water Availablity and Choice of Crop Production in a River Basin","227763366":"An evaluation of European air pollution regulations for particulate matter monitored from a heterogeneous network","37677835":"Composite likelihood inference for space-time covariance models","30858349":"True Spatio-Temporal Detection and Estimation for Functional Magnetic Resonance Imaging.","220358371":"Parallel spatiotemporal autocorrelation and visualization system for large-scale remotely sensed images","23644843":"A likelihood ratio test for separability of covariances","251668421":"134 Biological characterization of ETP-46321 a potent and selective phosphoinositide-3-kinase inhibitor with antitumor activity","266607650":"NONPARAMETRIC COVARIANCE ESTIMATION IN FUNCTIONAL MAPPING OF COMPLEX DYNAMIC TRAITS","276107320":"Surface estimation under local stationarity","38012171":"A Class of Nonseparable and Nonstationary Spatial Temporal Covariance Functions","227733698":"Separable approximations of space-time covariance matrices. Environmetrics","238450020":"Geostatistical Space-Time Models, Stationarity, Separability and Full Symmetry","273439134":"Exploring Space-Time Tradeoffs in Autonomous Sampling for Marine Robotics,","257014786":"Model-based tests for simplification of lattice processes","228775157":"Piecing together the past: Statistical insights into paleoclimatic reconstructions","267711523":"The ABC of Spatial Statistics","48191876":"A tuning parameter free test for properties of space-time covariance functions","261504842":"Characterization and parameterization of a class of multivariable non-summable stochastic processes with bounded stochastic trends","232297276":"Advances in Spatio-Temporal Modeling and Prediction for Environmental Risk Assessment","23536002":"Testing the covariance structure of multivariate random fields","249315514":"Air pollution: A comprehensive perspective","255704410":"Limiting spectral distribution of renormalized separable sample covariance matrices when","236256382":"A Large-Scale Space-Time Stochastic Simulation Tool of Rain Attenuation for the Design and Optimization of Adaptive Satellite Communication Systems Operating between 10 and 50 GHz","264498216":"Equivariant minimax dominators of the MLE in the array normal model","227641852":"Testing for separability of space–time covariances","256121258":"Efficient Gaussian Process Inference for Short-Scale Spatio-Temporal Modeling","257431208":"New classes of spectral densities for lattice processes and random fields built from simple univariate margins","254212823":"Multivariate Spatiotemporal CDFs with Random Effects and Measurement Error","257769391":"Stationarity conditions for the spatial first-order and serial second-order model","257273639":"Testing axial symmetry and separability of lattice processes","229960390":"Modeling and predicting complex space–time structures and patterns of coastal wind fields","228562669":"A test for stationarity of spatio-temporal random fields on planar and spherical domains","24199941":"Using river distance in the space/time estimation of dissolved oxygen along two impaired river networks in New Jersey","225933967":"A simple non-separable, non-stationary spatiotemporal model for ozone","257199404":"Positive and negative non-separability for space–time covariance models","277604209":"Characterization and parameterization of dynamic wireless channels over long duration using evolutionary channel parameters: Parameterization of Dynamic Channels using Evolutionary Parameters","49787532":"Functional mapping of reaction norms to multiple environmental signals through nonparametric covariance estimation","260439419":"Spatio-temporal statistical identification methodology applied to wide-area monitoring schemes in power systems","251542145":"Boosted human re-identification using Riemannian manifolds"},"index":727}