{"abs":"In this paper, an interactive fuzzy satisficing method for multiobjective multidimensional 0-1 knapsack problems is proposed by incorporating the desirable features of both the interactive fuzzy programming methods and genetic algorithms. By considering the vague nature of human judgements, fuzzy goals of the decision maker (DM) for objective functions are quantified by eliciting linear membership functions. If the DM specifies a reference membership level for each of the membership functions, the corresponding (local) Pareto optimal solution can be obtained by solving the formulated minimax problem through a genetic algorithm with double strings. For obtaining an optimal solution not dominated by the solutions before interaction, the algorithm is revised by introducing some new mechanism for forming an initial population. Illustrative numerical examples demonstrate both feasibility and effectiveness of the proposed method","title":"An interactive fuzzy satisficing method for multiobjective multidimensional 0-1 knapsack problems through genetic algorithms","id":3642940,"url":"https://www.researchgate.net/publication/3642940_An_interactive_fuzzy_satisficing_method_for_multiobjective_multidimensional_0-1_knapsack_problems_through_genetic_algorithms","names":["M. Sakawa","Kosuke Kato","T. Shibano"],"references":{},"citedIn":{"223525971":"Single- and multi-objective defensive location problems on a network","263329968":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons","3708283":"Interactive decision making for fuzzy multiobjective 0-1 programs through genetic algorithms with double strings","3775858":"Fuzzy multiobjective 0-1 programming through revised genetic algorithms","224330126":"Design and Validation of a Hybrid Interactive Reference Point Method for Multi-Objective Optimization","223533696":"An interactive fuzzy satisficing method for large scale multiobjective 0–1 programming problems with fuzzy parameters through genetic algorithms","240919178":"Operation planning of district heating and cooling plants through genetic algorithms for nonlinear 0–1 programming","222142307":"An interactive fuzzy satisficing method for multiobjective 0–1 programming problems with fuzzy numbers through genetic algorithms with double strings","2584888":"An Evolutionary Algorithm for Multiobjective Optimization: The Strength Pareto Approach","220637959":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons.","4869928":"Operation planning of district heating and cooling plants through genetic algorithms for nonlinear 0–1 programming","5614198":"Genetic algorithms with decomposition procedures for multidimensional 0-1 knapsack problems with block angular structures","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","222913315":"Interactive fuzzy programming for multi-level 0–1 programming problems through genetic algorithms","221204613":"Lecture Notes in Computer Science","289129238":"Fuzzy Combinatorial Optimization Problems","222674411":"Interactive fuzzy programming for multi-level 0–1 programming problems with fuzzy parameters through genetic algorithms","4074705":"Explicit building-block multiobjective evolutionary algorithms for NPC problems","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","228827540":"Satisficing, Optimization, and Adaptive Systems","226315781":"Fuzzy Multiobjective and Multilevel Optimization","222336378":"Genetic algorithms with double strings for 0–1 programming problems","221995072":"An Interactive Fuzzy Satisficing Method for General Multiobjective 0–1 Programming Problems Through Genetic Algorithms With Double Strings Based on a Reference Solution","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","220199907":"Operation planning of district heating and cooling plants using genetic algorithms for mixed integer programming","200622155":"Metaheuristics: The state of the art. Lecture Nodes in Computer Science, 2148"},"index":732}