{"abs":"this paper, we use multiple objective genetic local search (MOGLS) algorithm proposed by us in [11]. The algorithm wastested on multiple objective Travelling Salesperson Problem and outperformed MOGLS algorithm of Ishibuchi and Murata [10],3MOGLS based on the idea of MOSA method proposed by Ulungu et al. [19] and Pareto ranking-based evolutionary algorithm[3] proposed by Fonseca and Fleming. Below we describe main ideas of the method.The goal of multiple objective metaheuristics is to...","title":"On the performance of multiple-objective genetic local search on the 0/1 knapsack problem—a comparative experiment","id":220381153,"url":"https://www.researchgate.net/publication/220381153_On_the_performance_of_multiple-objective_genetic_local_search_on_the_01_knapsack_problem-a_comparative_experiment","names":["Andrzej Jaszkiewicz"],"references":{"225811765":"Genetic algorithms for the 0/1 knapsack problem","2426244":"A Basis for Future Successes in Multiobjective Combinatorial Optimization","220693571":"Tabu search I","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","3479292":"An Experimental Investigation of Process Identification by Competitive Evolution","201975941":"A Connectionist Machine for Genetic Hill-Climbing","2642725":"Evaluating the Quality of Approximations to the Non-Dominated Set","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","216301002":"Simulated Annealing: Theory and Application","3421242":"A Multi-objective Genetic Local Search Algorithm and Its Application to Flowshop Scheduling","2241938":"M-PAES: A Memetic Algorithm for Multiobjective Optimization","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","225214687":"Hybrid Evolutionary Algorithms for Graph Coloring","2248820":"Use of Substitute Scalarizing Functions to Guide a Local Search Based Heuristic: The Case of moTSP","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","225216146":"Tabu Search Based Procedure for Solving the 0-1 MultiObjective Knapsack Problem: The Two Objectives Case","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107"},"citedIn":{"220754216":"Choosing extreme parents for diversity improvement in evolutionary multiobjective optimization algorithms","220981282":"Towards Landscape Analyses to Inform the Design of Hybrid Local Search for the Multiobjective Quadratic Assignment Problem.","228979375":"Genetic Local Search for Resource-Constrained Project Scheduling under Uncertainty","41713015":"MEMOTS: A memetic algorithm integrating tabu search for combinatorial multiobjective optimization","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","223029573":"Multicriteria decisions on interdependent infrastructure transportation projects using an evolutionary-based framework","227061917":"Evolutionary Algorithms and Multiple Objective Optimization","3949355":"Design of Multi-Objective Evolutionary Algorithms: Application to the Flow-Shop Scheduling Problem","224246858":"Multi-objective optimisation of cancer chemotherapy using smart PSO with decomposition","224177733":"Guided Pareto Local Search based frameworks for biobjective optimization","4871760":"Jaszkiewicz, A.: On the Computational Efficiency of Multiple Objective Metaheuristics: The Knapsack Problem Case Study. European Journal of Operational Research 158, 418-433","225148791":"How to Choose Solutions for Local Search in Multiobjective Combinatorial Memetic Algorithms","224211267":"Decomposition-Based Memetic Algorithm for Multiobjective Capacitated Arc Routing Problem","240985212":"Simulation of hybrid genetic tabu algorithm for quasi-bus rapid transit scheduling optimization with multi-line: Simulation of hybrid genetic tabu algorithm for quasi-bus rapid transit scheduling optimization with multi-line","225313610":"Improving the Performance of Evolutionary Algorithms for the Multiobjective 0/1 Knapsack Problem Using ε-Dominance","221228551":"Comparison Between Lamarckian and Baldwinian Repair on Multiobjective 0/1 Knapsack Problems","221228550":"A Two-Phase Local Search for the Biobjective Traveling Salesman Problem","4090133":"Improving the performance of evolutionary algorithms for the multiobjective 0/1 knapsack problem using ε -dominance","220701704":"Lecture Notes in Computer Science","6532179":"Diffusion tensor imaging: techniques and clinical applications.","257337191":"Reduction method based on fuzzy principal component analysis in multi-objective possibilistic programming","222214415":"The development of a sub-population genetic algorithm II (SPGA II) for multi-objective combinatorial problems","280553866":"A MULTI-OBJECTIVE EVOLUTIONARY ALGORITHM USING DECOMPOSITION (MOEA/D) AND ITS APPLICATION IN MULTIPURPOSE MULTI-RESERVOIR OPERATIONS","3304193":"Hybrid Multiobjective Evolutionary Design for Artificial Neural Networks","46491377":"Solving multiobjective, multiconstraint knapsack problems using mathematical programming and evolutionary algorithms","2369041":"A Short Tutorial on Evolutionary Multiobjective Optimization","225382229":"The Multiobjective Traveling Salesman Problem: A Survey and a New Approach","220132898":"Running time analysis of evolutionary algorithms on a simplified multiobjective knapsack problem","45930881":"The multiobjective multidimensional knapsack problem: A survey and a new approach","4086142":"Hardware implementation of genetic algorithm on FPGA","222831625":"An efficient, adaptive parameter variation scheme for metaheuristics based on the Epsilon-constraint method","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","220867182":"Hybrid Estimation of Distribution Algorithm for Multiobjective Knapsack Problem","220914543":"Genetic Programming with Local Improvement for Visual Learning from Examples","224190995":"Binary-SDMOPSO and its application in channel selection for Brain-Computer Interfaces","224477233":"A differential absorption spectrometer for bremsstrahlung diode voltage measurement","222647829":"Comparative analysis of multiobjective evolutionary algorithms for random and correlated instances of multiobjective d-dimensional knapsack problems","223584006":"Genetic algorithm for the personnel assignment problem with multiple objectives","242823982":"Decomposition-Based Memetic Algorithm for Multi-Objective Capacitated Arc Routing Problem","224329991":"MOEA/D for flowshop scheduling problems","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","3418735":"Jaszkiewicz, A.: Do multiple-objective metaheuristics deliver on their promises? A computational experiment on the set-covering problem. IEEE Transactions on Evolutionary Computation 7(2), 133-143","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","220743499":"Simultaneous Use of Different Scalarizing Functions in MOEA/D","221228619":"Very Large-Scale Neighborhood Search for Solving Multiobjective Combinatorial Optimization Problems","4219430":"Spatial implementation of evolutionary multiobjective algorithms with partial Lamarckian repair for multiobjective knapsack problems","4940076":"An empirical study on similarity-based mating for evolutionary multiobjective combinatorial optimization. Eur J Oper Res","221228379":"Adaptation of Scalarizing Functions in MOEA/D: An Adaptive Scalarizing Function-Based Multiobjective Evolutionary Algorithm","4939568":"Local dominance and local recombination in MOEAs on 0/1 multiobjective knapsack problems. Eur J Oper Res","228871640":"Guided Pareto Local Search and its Application to the 0/1 Multi-objective Knapsack Problems","220741972":"Comparison of evolutionary multiobjective optimization with rference solution-based single-objective approach.","265169072":"Cross entropy for multiobjective combinatorial optimization problems with linear relaxations","258387481":"A Hybrid Multiobjective Genetic Algorithm for Robust Resource-Constrained Project Scheduling with Stochastic Durations","282530911":"Many-Objective Evolutionary Algorithms","242506237":"Speedup techniques for solving large-scale biobjective TSP","282188123":"A Genetic-Based Solution to the Task-Based Sailor Assignment Problem","256937182":"An improved version of the augmented ε-constraint method (AUGMECON2) for finding the exact pareto set in multi-objective integer programming problems","4074671":"Effects of repair procedures on the performance of EMO algorithms for multiobjective 0/1 knapsack problems","253036941":"A Scatter Search Method for the Bi-Criteria Multidimensional {0, 1}Knapsack Problem using Surrogate Relaxation","239549926":"La de cision de groupe : lèapplication de me thodes de surclassement de synthse","224599490":"Search Ability of Evolutionary Multiobjective Optimization Algorithms for Multiobjective Fuzzy Genetics-Based Machine Learning","224170493":"Diversity Improvement by Non-Geometric Binary Crossover in Evolutionary Multiobjective Optimization","261500723":"A hybrid adaptive evolutionary algorithm in the domination-based and decomposition-based frameworks of multi-objective optimization","241126904":"Late Miocene Microstonyx remains (Suidae, Mammalia) from Northern China","250107971":"Differential Evolution for Solving Multi-objective Optimization Problems","252475297":"FPGA Implementation of a Parallel Pipelined Hardware Genetic Algorithm (PPHGA) and its Applications in Function Approximation","228617743":"Lamarckian Repair and Darwinian Repair in EMO Algorithms for Multiobjective 0/1 Knapsack Problems","284898891":"A Hybrid Method based on Dominance-Core Concept for 0-1 Bi-Objective Knapsack Problems","221228442":"Lecture Notes in Computer Science","221335175":"Multiobjective 0/1 Knapsack Problem using Adaptive epsilon-Dominance.","220176037":"Use of biased neighborhood structures in multiobjective memetic algorithms","224472028":"The performance of a new version of MOEA/D on CEC09 unconstrained MOP test instances","2473370":"An Evolutionary Algorithm With A Multilevel Pairing Strategy For Single And Multiobjective Optimization","41578938":"Evolving cell models for systems and synthetic biology","221228526":"Effects of Removing Overlapping Solutions on the Performance of the NSGA-II Algorithm","220739567":"An empirical study on the handling of overlapping solutions in evolutionary multlobjectlve optimization","2377443":"Pairwise Comparison of Hypotheses Coverings as a Natural Mean Against Undesirable Niching in Evolutionary Inductive Learning","220742885":"Evolutionary Symbolic Discovery for Bioinformatics, Systems and Synthetic Biology","2518517":"A Comparative Study of Multiple-Objective Metaheuristics on the Bi-Objective Set Covering Problem and the Pareto Memetic Algorithm","220176332":"Performance evaluation of evolutionary multiobjective optimization algorithms for multiobjective fuzzy genetics-based machine learning","228887666":"An empirical study of tabu search for the MOKP","237411824":"CHAPTER 1 AN INTRODUCTION TO MULTI-OBJECTIVE EVOLUTIONARY ALGORITHMS AND THEIR APPLICATIONS","257432206":"Multi-objective ant colony optimization based on decomposition for bi-objective traveling salesman problems","221228534":"Recombination of Similar Parents in EMO Algorithms","260360285":"A survey on multi-objective evolutionary algorithms for many-objective problems","224453311":"On the use of informed initialization and extreme solutions sub-population in multi-objective evolutionary algorithms","261079888":"A guided local search based algorithm for the multiobjective empowerment-based field workforce scheduling","251988449":"Multi-Objective Quantum Evolutionary Algorithm for Discrete Multi-Objective Combinational Problem","220472257":"MOTGA: A multiobjective Tchebycheff based genetic algorithm for the multidimensional knapsack problem","222405031":"Jaszkiewicz, A.: Genetic Local Search for Multi-Objective Combinatorial Optimization. European Journal of Operational Research 137, 50-71","242388380":"Implementation of Simple Multiobjective Memetic Algorithms and Its Application to Knapsack Problems","220288719":"A scatter search method for bi-criteria {0, 1}-knapsack problems","2412747":"Evolutionary Computation Framework for Learning from Visual Examples","226789238":"Implementation of Multiobjective Memetic Algorithms for Combinatorial Optimization Problems: A Knapsack Problem Case Study","220403665":"Teghem, J.: Two-phase Pareto local search for the biobjective traveling salesman problem. Journal of Heuristics 16(3), 475-510","222544310":"Suman, B.: Study of simulated annealing based multiobjective algorithm for multiobjective optimization of a constrained problem. Comput. Chem. Eng. 28(9), 1849-1871","225668486":"Evolutionary and Heuristic Algorithms for Multiobjective 0–1 Knapsack Problem","220105960":"A predictive gradient strategy for multiobjective evolutionary algorithms in a fast changing environment","221007067":"IPGA based multi-objective compatible control algorithm and its application in oversaturated adjacent intersection control","221007579":"An Investigation on Evolutionary Gradient Search for Multi-objective Optimization","220740560":"Effects of the Use of Non-Geometric Binary Crossover on Evolutionary Multiobjective Optimization","4133318":"Comparison of local search implementation schemes in hybrid evolutionary multiobjective optimization algorithms","220741841":"Evolution of hyperheuristics for the biobjective 0/1 knapsack problem by multiobjective genetic programming","220701662":"Use of Heuristic Local Search for Single-Objective Optimization in Multiobjective Memetic Algorithms","225663369":"A multiobjective metaheuristic for a mean-risk static stochastic knapsack problem","4253887":"Evolutionary Multiobjective Design of Fuzzy Rule-Based Systems","221196752":"Multi-objective Evolutionary Algorithms to Solve Coverage and Lifetime Optimization Problem in Wireless Sensor Networks"},"index":736}