{"abs":"This paper investigates a new technique for the solving of multimodal problems using genetic algorithms (GAs). The proposed technique, Restricted Tournament Selection, is based on the paradigm of local competition. The paper begins by discussing some of the drawbacks of using current multimodal techniques. The paper then presents the new technique along with an analysis of a class of sets of solutions it preserves and locates. This presentation researches the new technique\u0027s restriction on competition from the viewpoint of calculating probability distributions for its tournaments as well as its various niche takeover times. Empirical observations are then presented as evidence of the technique\u0027s abilities in a wide variety of settings. Finally, this paper explores the future trajectory of multimodal GA research. Finding Multimodal Solutions Using Restricted Tournament Selection Abstract This paper investigates a new technique for the solving of multimodal problems using genetic algor...","title":"Finding Multimodal Solutions Using Restricted Tournament Selection","id":2754984,"url":"https://www.researchgate.net/publication/2754984_Finding_Multimodal_Solutions_Using_Restricted_Tournament_Selection","names":["Georges R. Harik"],"references":{"2827305":"Finding Multiple Solutions in Problems of Bounded Difficulty","2763951":"Crowding and Preselection Revisited","48485654":"Engineering Optimization: Methods and Applications: Second Edition","201976351":"An Analysis of a Reordering Operator on a GA-Hard Problem","201976352":"Messy Genetic Algorithms Revisited: Studies in Mixed Size and Scale","243686111":"Messy genetic algorithms: Motivation","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","243779034":"Adaptation in Natural and Arti cial Systems","35578608":"An Analysis of the Behavior of a Class of Genetic Adaptive Systems"},"citedIn":{"220201252":"System-Level Synthesis Using Evolutionary Algorithms","3418674":"Evolutionary algorithms with dynamic population size and local exploration for multiobjective optimization","273699926":"Ensemble and Arithmetic Recombination-Based Speciation Differential Evolution for Multimodal Optimization","221008677":"Avoiding premature convergence in Estimation of Distribution Algorithms","220741921":"Adaptively choosing niching parameters in a PSO","48908000":"Optimisation multicritère d\u0027une chaîne éolienne passive","278637713":"A Multi-Modal Coevolutionary Algorithm for Finding All Nash Equilibria of a Multi-Player Normal Form Game","30512064":"Approches évolutionnaires pour la reconstruction de réseaux de régulation génétique par apprentissage de réseaux bayésiens.","220743482":"NK landscapes, problem difficulty, and hybrid evolutionary algorithms","254230325":"A simulated weed colony system with subregional differential evolution for multimodal optimization","231090640":"Superconductivity and magnetic short-range order in the system with a Pd sheet sandwiched between graphene sheets","264811984":"A Comparative Review of Approaches to Prevent Premature Convergence in GA","1957889":"Decomposable Problems, Niching, and Scalability of Multiobjective Estimation of Distribution Algorithms","226847653":"Multimodal Function Optimization of Varied-Line-Spacing Holographic Grating","221008652":"A two-phase evolutionary algorithm for multiobjective mining of classification rules","224678208":"Niching for Population-Based Ant Colony Optimization","241712717":"Signal synthesis by means of evolutionary algorithms","220516105":"Edge histogram based sampling with local search for solving permutation problems.","224202608":"Niche Artificial Fish Swarm Algorithm based on quantum theory","220741401":"An analysis of multi-sampled issue and no-replacement tournament selection","220777244":"A Sequential Niching Technique for Particle Swarm Optimization","222998397":"Genetic Algorithm with adaptive elitist-population strategies for multimodal function optimization. Appl Soft Comput","29529080":"Optimales Gatewaydesign mit genetischem Algorithmus und ganzzahliger linearer Programmierung","2518556":"Co-Evolutionary Learning by Automatic Modularisation with Speciation","2365983":"Pairwise Comparison of Hypotheses in Evolutionary Learning","26768804":"Performance and Efficiency of Memetic Pittsburgh Learning Classifier Systems","262425497":"A niching scheme for EDAs to reduce spurious dependencies","220462877":"The Niching Method for Obtaining Global Optima and Local Optima in Multimodal Functions","226521023":"A fine-grained parallel evolutionary program for concept induction","224177945":"Comparing lbest PSO niching algorithms using different position update rules","262251495":"Effects of discrete hill climbing on model building forestimation of distribution algorithms","220743535":"Spurious dependencies and EDA scalability","225133856":"On the Use of Pairwise Comparison of Hypotheses in Evolutionary Learning Applied to Learning from Visual Examples","226186026":"Finding multiple solutions in job shop scheduling by niching genetic algorithm","225222461":"Linkage Learning Accuracy in the Bayesian Optimization Algorithm","220739962":"Analysis of epistasis correlation on NK landscapes with nearest-neighbor interactions","222836508":"Force-imitated Particle Swarm Optimization Using the Near-Neighbor Effect for Locating Multiple Optima","221547374":"Population Climbing Evolutionary Algorithm for Multimodal Function Global Optimization","262176251":"Deriving a robust policy for container stacking using a noise-tolerant genetic algorithm","221196659":"Dynamic Grouping Crowding Differential Evolution with Ensemble of Parameters for Multi-modal Optimization","220691833":"Introduction to Genetic Algorithms","220176704":"Evaluating a local genetic algorithm as context-independent local search operator for metaheuristics","225565457":"Real-Coded Extended Compact Genetic Algorithm Based on Mixtures of Models","1956989":"Parameter-Less Hierarchical BOA","225695506":"Analysis of new niching genetic algorithms for finding multiple solutions in the job shop scheduling. J Intell Manuf","221941083":"Transfer Learning, Soft Distance-Based Bias, and the Hierarchical BOA","1956988":"Computational Complexity and Simulation of Rare Events of Ising Spin Glasses","224645890":"moPGA: Towards a New Generation of Multi-objective Genetic Algorithms","3418710":"NOW G-Net: Learning classification programs on networks of workstations","2950735":"Evolving Heterogeneous Neural Agents by Local Selection","283115657":"Redesigning product lines in a period of economic crisis: a hybrid simulated annealing algorithm with crossover","253300082":"Optimization of mask absorber stacks and illumination settings for contact hole imaging","267896198":"Improving Multi-Objective Test Case Selection by Injecting Diversity in Genetic Algorithms","232656810":"Advancing Artificial Intelligence Through Biological Process Applications","220176742":"Model accuracy in the Bayesian optimization algorithm","222930738":"Multimodal genetic algorithms-based algorithm for automatic point correspondence","262328798":"A Rigorous Runtime Analysis for Quasi-Random Restarts and Decreasing Stepsize","2407002":"On Extended Compact Genetic Algorithm","220176224":"An investigation on niching multiple species based on population replacement strategies for multimodal functions optimization","228961061":"Numerical optimisation using genetic algorithms","221196719":"Modified Local Neighborhood Based Niching Particle Swarm Optimization for Multimodal Function Optimization.","277297670":"HIERARCHICAL SYNTHESIS OF EMBEDDED SYSTEMS USING EVOLUTIONARY ALGORITHMS -- A Multi-Objective Approach","245430820":"Simultaneous Airframe and Propulsion Cycle Optimization for Supersonic Aircraft Design","220742061":"Efficient differential evolution using speciation for multimodal function optimization","262354726":"Solving system-level synthesis problem by a multi-objective estimation of distribution algorithm","275588330":"When Hillclimbers Beat Genetic Algorithms in Multimodal Optimization","242188517":"Hybrid Real-Coded Genetic Algorithms withFemaleandMale Differentiation","226252786":"Developing Niching Algorithms in Particle Swarm Optimization","277848605":"Frequency Modulation tone matching using a fuzzy clustering evolution strategy","220702132":"A Local Genetic Algorithm for Binary-Coded Problems","262194483":"Novel dynamic diversity controlling EAs for coevolving optimal negotiation strategies","4201684":"Limits of scalability of multiobjective estimation of distribution algorithms","33799319":"Stormwater quality management : evaluation, optimization, and maintenance /","270723255":"Inducing Niching Behavior in Differential Evolution Through Local Information Sharing","12473896":"Efficient and Scalable Pareto Optimization by Evolutionary Local Selection Algorithms","264241494":"An improved teaching–learning-based optimization with neighborhood search for applications of ANN","232251712":"Clever Algorithms","220381116":"Niching Without Niching Parameters: Particle Swarm Optimization Using a Ring Topology","220740535":"Investigating restricted tournament replacement in ECGA for non-stationary environments.","228707134":"Single and Multiobjective Genetic Algorithm Toolbox in C++","255821723":"Niche-Clearing-based Variable Mesh Optimization for Multimodal Problems","224647111":"Improved Genetic and Ant Colony Optimization Algorithm for Regional Air Defense WTA Problem","220315012":"Replacement strategies to preserve useful diversity in steady-state genetic algorithms","225478614":"Multiobjective Estimation of Distribution Algorithms","34970290":"Improving predictability of simulation models using evolutionary computation-based methods for model error correction [electronic resource] /","249342075":"Multimodal Function Optimisation with Cuckoo Search Algorithm","225222597":"Parameter-less Hierarchical Bayesian Optimization Algorithm","2646148":"Genetic Algorithms, Clustering, and the Breaking of Symmetry","220743045":"Maximizing population diversity in single-objective optimization","234005855":"Advances in Intelligent and Soft Computing","220743576":"Sporadic model building for efficiency enhancement of hierarchical BOA","225595843":"Sporadic model building for efficiency enhancement of the hierarchical BOA","260320566":"Multimodal optimization using niching differential evolution with index-based neighborhoods","215510635":"An Analysis of the “Universal Suffrage” Selection Operator","260622140":"Differential Evolution With Neighborhood Mutation for Multimodal Optimization","266515287":"Machine learning and data mining in pattern recognition. 2nd international workshop, MLDM 2001, Leipzig, Germany, July 25–27, 2001. Proceedings","220740509":"Hierarchical BOA on random decomposable problems","257793003":"Route selection for mobile sensor nodes on public transport networks","267979087":"Application of Genetic Algorithm to Structural Optimization of High Speed Craft","220106149":"Fine-grained Tournament Selection Operator in Genetic Algorithms","224330212":"Is the Not-Sampled Issue in Tournament Selection Critical?","2748564":"An Indexed Bibliography of Genetic Algorithms Theory and Comparisons","221162991":"Compound Particle Optimization Using Speciation for Multimodal Function Optimization","283080221":"Divergence of character and premature convergence: A survey of methodologies for promoting diversity in evolutionary optimization","263345015":"A Review of Niching Genetic Algorithms for Multimodal Function Optimization","256720779":"Niching particle swarm optimization with local search for multi-modal optimization. Inform Sci","2377443":"Pairwise Comparison of Hypotheses Coverings as a Natural Mean Against Undesirable Niching in Evolutionary Inductive Learning","266967841":"Multithreaded Parallel Dual Population Genetic Algorithm (MPDPGA) for unconstrained function optimizations on multi-core system","238720755":"Parameter Setting in Evolutionary Algorithms","37243638":"Conception de systèmes hétérogènes en Génie Électrique par optimisation évolutionnaire multicritère","252054486":"An improved crowding-based differential evolution for multimodal optimization","2650874":"Adaptive Niching via Coevolutionary Sharing","241179316":"Modified species-based differential evolution with self-adaptive radius for multi-modal optimization","221174267":"Steady-State Evolutionary Algorithm for Multimodal Function Global Optimization","220741616":"A crossover for complex building blocks overlapping","224600507":"Analytical input filter design in DC distributed power systems approach taking stability and quality criteria into account","220657663":"A hierarchy machine: Learning to optimize from nature and humans","220862453":"EVADING: An Evolutionary Algorithm with Dynamic Niching for Data Classification.","251309082":"Memetic Algorithms Parametric Optimization for Microlithography","260498790":"A Distance-Based Locally Informed Particle Swarm Model for Multimodal Optimization","220701638":"Evolutionary Continuous Optimization by Distribution Estimation with Variational Bayesian Independent Component Analyzers Mixture Model","220740553":"A multimodal particle swarm optimizer based on fitness Euclidean-distance ratio","220199932":"A simulated annealing method based on a specialised evolutionary algorithm","263159111":"REPAMO: Recursive Perturbation Approach for Multimodal Optimization","224384949":"Analyzing Probabilistic Models in Hierarchical BOA","220702155":"Performance of Network Crossover on NK Landscapes and Spin Glasses","225810329":"Design of Parallel Estimation of Distribution Algorithms","272368336":"A novel hybrid evolutionary approach for capturing decision maker knowledge into the unequal area facility layout problem","239546550":"Designing Genetic Algorithm Based on Exploration and Exploitation of Gene Linkage","220740570":"Co-evolution of cooperative strategies under egoism","225228191":"Adaptive Restricted Tournament Selection for the identification of multiple sub-optima in a multi-modal function","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","221007834":"Influence of selection and replacement strategies on linkage learning in BOA","263420740":"Global Pairwise Sequence Alignment using Ant Colony Optimization","23949204":"Analysis of Evolutionary Algorithms on the One-Dimensional Spin Glass with Power-Law Interactions","220106213":"Co-Evolutionary Multi-Agent System with Speciation and Resource Sharing Mechanisms.","2533595":"Time Continuation in Genetic Algorithms","220881962":"Qu, B.Y.: Current Based Fitness Euclidean-distance Ratio Particle Swarm Optimizer for Multi-modal Optimization. In: NaBIC","1907486":"Finding Ground States of Sherrington-Kirkpatrick Spin Glasses with Hierarchical BOA and Genetic Algorithms","221007403":"Towards scalability in niching methods","260655233":"A Systemic Approach Integrating Driving Cycles for the Design of Hybrid Locomotives","242257273":"CHAPTER 21 SENSITIVITY ANALYSIS IN MULTI-OBJECTIVE EVOLUTIONARY DESIGN","221008421":"Simulated Annealing Based on Local Genetic Search","224459882":"Optimisation of electrical system for offshore wind farms via genetic algorithm","221161535":"A Novel Clustering Fitness Sharing Genetic Algorithm.","236854538":"Maintaining genetic diversity in bacterial evolutionary algorithm","225154173":"Hierarchical Bayesian Optimization Algorithm","220265526":"A Generator for Multimodal Test Functions with Multiple Global Optima","220825648":"Population-Based Ant Colony Optimisation for Multi-objective Function Optimisation.","220741173":"Using previous models to bias structural learning in the hierarchical BOA","220801076":"Local Selection.","220740149":"Co-evolvability of games in coevolutionary genetic algorithms.","45860262":"Adaptation and Self-Organization in Evolutionary Algorithms","257635397":"Diversity Guided Evolutionary Programming: A novel approach for continuous optimization","260803732":"A novel class of niche hybrid Cultural Algorithms for continuous engineering optimization","2584888":"An Evolutionary Algorithm for Multiobjective Optimization: The Strength Pareto Approach","220739639":"Dependency trees, permutations, and quadratic assignment problem","266205890":"Multilocal Search and Adaptive Niching Based Memetic Algorithm With a Consensus Criterion for Data Clustering","224148095":"A Dual-Population Genetic Algorithm for Adaptive Diversity Control","250968529":"Glowworm Swarm Optimisation: A New Method for Optimising Multi-Modal Functions","2790669":"ADAPTIVE SEARCH MANAGER: An Engineering Design Decision Support Approach","220867085":"Multi-stage Evolutionary Algorithms for Efficient Identification of Gene Regulatory Networks","220740096":"Analyzing probabilistic models in hierarchical BOA on traps and spin glasses","220176950":"A framework for generating tunable test functions for multimodal optimization","228723339":"A review on the methods of Shop Floor Capacity Planning and Scheduling for Semiconductor Industry","229356162":"Chapter 3 Introduction to using genetic algorithms","221494298":"A Review of Tournament Selection in Genetic Programming","243055445":"Exploration and Exploitation in Evolutionary Algorithms: A Survey","249840073":"Extended Compact Genetic Algorithm in Matlab","221006850":"A GA-based multiple simulated annealing.","239554935":"IMPROVING PREDICTABILITY OF SIMULATION MODELS USING EVOLUTIONARY COMPUTATION-BASED METHODS FOR MODEL ERROR CORRECTION","261846697":"Improving Differential Evolution Accuracy for Flexible Ligand Docking Using a Multi-solution Strategy","222008840":"Concurrent assembly planning with genetic algorithms","225122904":"Searching for Ground States of Ising Spin Glasses with Hierarchical BOA and Cluster Exact Approximation","261075642":"Dynamic Access Network Reorganization for the Depopulation Age","220741662":"Real-Parameter Genetic Algorithms for Finding Multiple Optimal Solutions in Multi-modal Optimization","242403653":"Not-Sampled Issue and Round-Replacement Tournament Selection","220777488":"The Explicit Exploration Information Exchange Mechanism for Niche Technique","251320259":"An Efficient Nearest Neighbor Classifier","224246887":"Autonomous rule creation for intrusion detection","261095093":"Ensemble crowding differential evolution with neighborhood mutation for multimodal optimization","2710889":"Learning Gene Linkage to Efficiently Solve Problems of Bounded Difficulty Using Genetic Algorithms","257352212":"Effective search for genetic-based machine learning systems via estimation of distribution algorithms and embedded feature reduction techniques","264644228":"MOMMOP: Multiobjective Optimization for Locating Multiple Optimal Solutions of Multimodal Optimization Problems","228744929":"Genetic algorithms and genetic programming for multiscale modeling: Applications in materials science and chemistry and advances in scalability","220702308":"Evaluation and Diversity in Co-evolution.","4201733":"Evolutionary multiobjective optimization with a segment based external memory support for the multiobjective quadratic assignment problem","248674200":"Sporadic Model Building for Efficiency Enhancement of hBOA","220741221":"Intelligent bias of network structures in the hierarchical BOA","220739686":"Generalized crowding for genetic algorithms","220514420":"Real-parameter evolutionary multimodal optimization: a survey of the state-of-the-art. Swarm Evol Comput 1:71-88","257739789":"An introduction and survey of estimation of distribution algorithms","220740217":"Robust and Efficient Genetic Algorithms with Hierarchical Niching and a Sustainable Evolutionary Computation Model","245324237":"Life-like agents: Internalizing local cues for reinforcement learning and evolution","201976668":"Object-based Design Modeling and Optimization with Genetic Algorithms","261038298":"A dynamic archive niching differential evolution algorithm for multimodal optimization","220740722":"Critical factors in the performance of novelty search","228904190":"Practical, Robust, and Scalable Black-Box Optimization with BOA and hBOA","255979037":"Niching Imperialistic Competitive Algorithm","262402303":"Design of test problems for discrete estimation of distribution algorithms","261423306":"Achieving desirable gameplay objectives by niched evolution of game parameters","265645751":"An Improved Parent-Centric Mutation With Normalized Neighborhoods for Inducing Niching Behavior in Differential Evolution","224922636":"Finding multiple global optima exploiting differential evolution\u0027s niching capability","225585691":"Replacement Strategies to Maintain Useful Diversity in Steady-State Genetic Algorithms","249978251":"Niching for Ant Colony Optimization","2466133":"A Classification Tree for Speciation","220290129":"Global and local real-coded genetic algorithms based on parent-centric crossover operators","242391811":"PARALLEL NICHING GENETIC ALGORITHMS: A CROWDING PERSPECTIVE","220741727":"Sub-structural niching in estimation of distribution algorithms","220741712":"Another investigation on tournament selection: Modelling and visualisation","220742743":"Performance of evolutionary algorithms on NK landscapes with nearest neighbor interactions and tunable overlap","228584672":"A Survey of Multiobjective Optimization in Engineering Design","251965563":"Reliability-inspired species conservation for multimodal functions","268130427":"An Adaptive Clustering and Re-clustering Based Crowding Differential Evolution for Continuous Multi-modal Optimization","2948013":"Efficient and Scalable Pareto Optimization by","220148382":"Analysis of Speciation and Niching in the Multi-Niche Crowding GA.","224696551":"Analysis of the Behaviour of Genetic Algorithm Applied in Optimization of Electrical System Design for Offshore Wind Farms","37413310":"Multi-objective optimisation applied to industrial energy problems","236962201":"Taking advantage of a diverse set of efficient production schedules: A two-step approach for scheduling with side concerns","230735433":"Estimating the Evolution Direction of Populations to Improve Genetic Algorithms","280897843":"Fitness sharing and niching methods revisited","7195106":"Identification of Biochemical Networks by S-tree Based Genetic Programming","220740281":"Order or not: Does parallelization of model building in hBOA affect its scalability?","221007550":"Species based evolutionary algorithms for multimodal optimization: A brief review","3418541":"Fitness sharing and niching methods revisited. IEEE Trans Evol Comput","1907588":"Analysis of Estimation of Distribution Algorithms and Genetic Algorithms on NK Landscapes","23276281":"The Crowding Approach to Niching in Genetic Algorithms","257636033":"Multimodal optimization by artificial weed colonies enhanced with localized group search optimizers","220740275":"Do not match, inherit: fitness surrogates for genetics-based machine learning techniques.","220741301":"Empirical investigations on parallel competent genetic algorithms","2468280":"Object-based Design Modeling and Optimization with Genetic Algorithms","268748185":"An Evolutionary Approach for Optimizing Hierarchical Multi-Agent System Organization","220740791":"Hybrid Evolutionary Algorithms on Minimum Vertex Cover for Random Graphs","237066625":"A multi objective genetic algorithm for the facility layout problem based upon slicing structure encoding","36008324":"The multi-niche crowding genetic algorithm : analysis and applications /","222968555":"Linkage learning through probabilistic expression","220777097":"Memetic Fitness Euclidean-Distance Particle Swarm Optimization for Multi Modal Optimization","261109810":"Hybrid niche Cultural Algorithm for numerical global optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","243788064":"Hierarchical Synthesis of Embedded Systems Using Evolutionary Algorithms","262280709":"Clustered parent centric normal cross-over for multimodal optimization","35459509":"Sustainable evolutionary algorithms and scalable evolutionary synthesis of dynamic systems /","220742787":"Network crossover performance on NK landscapes and deceptive problems","4307949":"A Simple Real-Coded Extended Compact Genetic Algorithm","2587529":"A Performance Assessment of Modern Niching Methods for Parameter Optimization Problems","220740248":"Improved EDNA (Estimation of Dependency Networks Algorithm) using combining function with bivariate probability distributions","285784760":"Strategies for the Integration of Evolutionary/Adaptive Search with the Engineering Design Process","221211805":"Linkage Learning, Rule Representation, and the X-Ary Extended Compact Classifier System.","261202467":"Strategy Adaptative Memetic Crowding differential evolution for multimodal optimization","226425546":"Linkage Analysis in Genetic Algorithms","222546166":"A fuzzy clustering-based niching approach to multimodal function optimization","46590331":"Algoritmos meméticos con aplicación adaptativa de la búsqueda local para optimización continua","239392251":"Pareto optimization using the struggle genetic crowding algorithm","256721037":"Effective search for Pittsburgh learning classifier systems via estimation of distribution algorithms","226648644":"Adaptive Retrieval Agents: Internalizing Local Context and Scaling up to the Web","254032099":"Route selection for mobile sensors with checkpointing constraints","228579416":"Crowding under Diverse Distance Criteria for Niche Formation in Multimodal Optimization","4368271":"K-NichePSO clustering","224182930":"A distance measure comparison to improve crowding in multi-modal optimization problems","220654825":"Hybrid genetic algorithm for dual selection","265554971":"A dynamic niching genetic algorithm strategy for docking highly flexible ligands","225139896":"Mining Classification Rules Using Evolutionary Multi-objective Algorithms","221456103":"Genetic algorithm aided optimization of hierarchical multiagent system organization","220403446":"Crowding with nearest neighbors replacement for multiple species niching and building blocks preservation in binary multimodal functions optimization","261060694":"Diversity allocation for Dynamic Optimization using the Extended Compact Genetic Algorithm","47332105":"Niching for Ant Colony Optimisation","224301698":"LisBON: A framework for parallelisation and hybridisation of optimisation algorithms","225169590":"Enhancing Efficiency of Hierarchical BOA Via Distance-Based Model Restrictions","220739830":"Selection-Insertion Schemes in Genetic Algorithms for the Flexible Ligand Docking Problem","290369681":"Evolution of Contours for Topology Optimization","2486215":"Explicit Speciation with few a priori Parameters for Dynamic Optimization Problems","252039905":"Study on a novel crowding niche genetic algorithm","220301514":"To explore or to exploit: An entropy-driven approach for evolutionary algorithms","215617334":"Adaptation and Self-Organization in Evolutionary Algorithms","244963188":"A niching particle swarm optimizer","236116479":"An asynchronous parallel genetic algorithm for the maximum likelihood phylogenetic tree search","51797222":"Using Previous Models to Bias Structural Learning in the Hierarchical BOA","220742360":"Effects of a Deterministic Hill climber on hBOA","220741336":"Obtaining ground states of ising spin glasses via optimizing bonds instead of spins.","46590773":"Algoritmos genéticos locales","2398160":"An Experimental Evaluation of Coevolutive Concept Learning","222687408":"Composite laminate design optimization by genetic algorithm with generalized elitist selection","1957866":"Multiobjective hBOA, Clustering, and Scalability","51988704":"Distance-Based Bias in Model-Directed Optimization of Additively\nDecomposable Problems","220701915":"Hierarchical BOA, Cluster Exact Approximation, and Ising Spin Glasses","250419987":"A genetic algorithm for the ligand-protein docking problem","224645788":"Enhancing the robustness of a speciation-based PSO"},"index":740}