{"abs":"A method is presented to estimate the probability distributions of climate system properties based on a hierarchical Bayesian model. At the base of the model, we use simulations of a climate model in which the outputs depend on the climate system properties and can also be compared with observations. The degree to which the model outputs are \"consistent\" with the observations is used to obtain the likelihood for the climate system properties. We define the climate system properties as those properties of the climate model that control the large-scale response of the climate system to external forcings. In this paper, we use the MIT 2D climate model (MIT2DCM) to provide simulations of ocean, surface and upper atmospheric temperature behavior over zones defined by lati-tude bands. In the MIT2DCM, the climate system properties can be set via three parameters: Climate sensitivity (the equilibrium surface temperature change in response to a doubling of CO2 concentrations), the rate of deep-ocean heat uptake (as set by the diffusion of temperature anomalies into the deep-ocean below the climatological mixed layer), and net strength of the anthropogenic aerosol forcings. In this work, we use output from MIT2DCM coupled with historical temperature records to make inference about these climate system properties. Even though the MIT2DCM is far less computationally demanding than a full 3D climate model, the task of running the model for each combination of the climate parameters and processing its output is computationally demanding. Thus, a statistical model is required to approximate the model output. We obtain results that are critical for understanding uncertainty in future climate change and provide an indepen-dent check that the information contained in recent climate change is robust to statistical treatment.","title":"Inferring Climate System Properties Using a Computer Model","id":228660883,"url":"https://www.researchgate.net/publication/228660883_Inferring_Climate_System_Properties_Using_a_Computer_Model","names":["Bruno Sansó","Chris Eliot Forest","Daniel Zantedeschi","Bayesian Analysis"],"references":{"200033420":"Estimating Historical Changes in Global Land Cover: Croplands from 1700 to 1992","247654663":"Stratospheric aerosol optical depths","4772045":"Bayesian Calibration of Computer Models","2120071":"Default priors for Gaussian processes. Ann Stat","230268702":"Statistical inference for atmospheric transport models using process convolutions","227308229":"Constraining climate model properties using optimal fingerprint detection methods. Clim Dyn","4709162":"Development of a Two-Dimensional Zonally Averaged Statistical-Dynamical Model.Part II: The Role of Eddy Momentum Fluxes in the General Circulation and their Parameterization","201169746":"Surface air temperature and its changes over the past 150 years. Rev Geophys","200032798":"Earth System Models of Intermediate Complexity: Closing the Gap in the Spectrum of Climate System Models","23593594":"Efficient Three-Dimensional Global Models for Climate Studies: Models I and II","239811609":"Comparing Oceanic Heat Uptake in AOGCM Transient Climate Change Experiments","43155526":"Constraining climate forecasts: the role of prior assumptions. Geophys Res Lett 32:L09702","231275614":"Subjective Judgments by Climate Experts","37991771":"Estimated PDFs of Climate System Properties Including Natural and Anthropogenic Forcings","241197753":"A new gridded radiosonde temperature data base and recent temperature trends","11405236":"Knutti, R., Stocker, T. F., Joos, F. \u0026 Plattner, G. K. Constraints on radiative forcing and future climate change from observations and climate model ensembles. Nature 416, 719−723"},"citedIn":{"220273121":"Testing a Particle Filter to Reconstruct Climate Changes over the Past Centuries.","257800926":"Verifying Reification With Application to a Rainfall–Runoff Computer Simulator","257800920":"Modeling Space–Time Dynamics of Aerosols Using Satellite Data and Atmospheric Transport Model Output","280538160":"Coherent Frameworks for Statistical Inference serving Integrating Decision Support Systems","283762016":"ABC for climate: dealing with expensive simulators","260631043":"An Objective Bayesian Improved Approach for Applying Optimal Fingerprint Techniques to Estimate Climate Sensitivity*","280062138":"An Evolutionary Spectrum Approach to Incorporate Large-scale Geographical Descriptors on Global Processes","216756603":"A comparison of Latin hypercube and grid ensemble designs for the multivariate emulation of an Earth system model","233450235":"Advances in the Sequential Design of Computer Experiments Based on Active Learning","231007766":"Fast inference for statistical inverse problems","263225506":"A Bayesian Cluster Analysis of Election Results","257411908":"The role of forcing and internal dynamics in explaining the “Medieval Climate Anomaly”","51964300":"How can a glacial inception be predicted?","227598981":"Comments on: A general science-based framework for dynamical spatio-temporal models","263891759":"A Bayesian Approach for Parameter Estimation and Prediction using a Computationally Intensive Model","237753533":"Inferring likelihoods and climate system characteristics from climate models and multiple tracers","232402115":"The medieval climate anomaly in Europe: Comparison of the summer and annual mean signals in two reconstructions and in simulations with data assimilation","253050572":"Notes on statistical modelling for complex systems","46538904":"Statistical calibration of climate system properties","225779243":"Comments on: A general science-based framework for dynamical spatio-temporal models","275070855":"Climate Simulators and Climate Projections","254212165":"Computational methods for parameter estimation in climate models","33026260":"Monte Carlo strategies for calibration in climate models","228986305":"Expert Knowledge and Multivariate Emulation: The Thermosphere–Ionosphere Electrodynamics General Circulation Model (TIE-GCM)","23935882":"Parameter estimation for computationally intensive nonlinear regression with an application to climate modeling","228443509":"Second-Order Exchangeability Analysis for Multimodel Ensembles","273477474":"Towards a typology for constrained climate model forecasts","262981980":"Statistical Emulation of Climate Model Projections Based on Precomputed GCM Runs*","251796150":"Fast Bayesian Inference for Computer Simulation Inverse Problems","51930412":"Bayesian Models and Methods in Public Policy and Government Settings","258659485":"On the Use of Emulators with Extreme and Highly Nonlinear Geophysical Simulators","266497050":"SEQUENTIAL–ADAPTIVE DESIGN OF COMPUTER EXPERIMENTS FOR THE ESTIMATION OF PERCENTILES","226487366":"Estimating Overlap of Daily Activity Patterns From Camera Trap Data","278661094":"Bayesian Statistics","257412204":"Uncertainty in modeled upper ocean heat content change"},"index":745}