{"abs":"The computation of multivariate integrals is an important mathematical problem in reliability theory. Various approximation methods have been developed for this task. In the so-called FORM and SORM methods, it is assumed that all variables have been transformed into independent standard normal ones. Only then can the methods be applied. Here, it is shown that such transformations are not necessary. It is sufficient to maximize the log likelihood function of the probability distribution in the original space, then to approximate the function and limit-state function near the maximum points by second-order Taylor expansions to obtain asymptotic approximations. In the same way, asymptotic sensitivity factors for the parameter dependence of the failure probability can be found. The advantages of this method are that the often-complicated numerical transformation into the normal space is avoided and that the results have a natural interpretation in terms of the parameters of the original random variables and limit-state function.","title":"Probability Approximations by Log Likelihood Maximization","id":239387028,"url":"https://www.researchgate.net/publication/239387028_Probability_Approximations_by_Log_Likelihood_Maximization","names":["Karl Breitung","Journal of Engineering Mechanics"],"references":{"245301372":"Basic Analysis of Structural Safety","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","256421646":"First-order second-moment approximation in reliability of structural systems: Critical review and alternative approach","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","238750452":"Functions of Several Variables","273800355":"Probability Integration by Directional Simulation","247440364":"Safety and the Probability of Structural Failure","222035533":"Asymptotic Approximations for Probability Integrals","23630449":"Asymptotic approximations for multivariate integrals with an application to multinormal probabilities","222588317":"New light on first- and second-order reliability methods","232477921":"The advanced theory of statistics. Vols. II and III.","243758427":"An Exact and Invariant First Order Reliability Format","245284449":"New Algorithm for Structural Reliability"},"citedIn":{"223207565":"Structural reliability methods for seismic safety assessment: A review","226116794":"On the structural synthesis of uncertain systems subjected to environmental loads","233922289":"Reliability Based Optimal Design of Structures Using Competitive Genetic Algorithms","242426160":"Design Reliability Analysis","3273780":"Estimating the probability of failure of equipment as a result of direct lightning strikes on transmission lines","3593521":"Computational procedures in structural reliability","279357997":"Probabilistic Structural Mechanics: Advances in Structural Reliability Methods","245211537":"Direct computation of the design point of a stochastic structure using a finite element code","222515596":"Reliability analysis of randomly vibrating structures with parameter uncertainties","245286219":"New Approximations for Reliability Integrals","239373138":"Evaluation of risk-type integrals by system reliability methods","229913442":"Probabilistic control for the Active Mass Driver benchmark structural model","245425207":"Reliability-Based Optimization of Uncertain Systems in Structural Dynamics","245285374":"Ignorance Factors Using Model Expansion","245424578":"Optimal Design of Uncertain Systems Under Stochastic Excitation","228519485":"Lifetime reliability based design of an offshore vessel mooring","250696919":"Reliability as a measure of active control effectiveness","264439396":"Application of first-order reliability method to modelling the fate and transport of benzene in groundwater","226569195":"Log-likelihood maximization and response surface in reliability assessment","242411231":"Investigation and benchmark of algorithms for reliability analysis","255672338":"Reliability Analysis Using Parabolic Failure Surface Approximation","245285867":"Asymptotic Expansions for Reliability and Moments of Uncertain Systems","245210410":"Structural reliability analysis using a standard deterministic finite element code","245299618":"Probabilistic Screening Tool for Ground-Water Contamination Assessment","223574191":"An FRF bounding method for randomly uncertain structures with or without coupling to an acoustic cavity","23631063":"A Geometric Approach to an Asymptotic Expansion for Large Deviation Probabilities of Gaussian Random Vectors"},"index":746}