{"abs":"The failure probability of a system can be expressed as an integral of the joint probability density function within the failure domain defined by the limit state functions of the system. Generally, it is very difficult to solve this integral directly. The evaluation of system reliability has been the active research area. Some methods were developed to solve system reliability analysis, such as Monte Carlo method, importance sampling method, bounding techniques and probability network evaluation technique (PNET). This paper presents the implementation of several optimization algorithms, modified method of feasible direction (MFD), sequential linear programming (SLP) and sequential quadratic programming (SQP), in order to demonstrate the convergence abilities and robust nature of the optimization technique when applied to series system reliability analysis. Examples taken from the published references were calculated and the results were compared with the answers of various other methods and the exact solution. Results indicate the optimization technique has a wide range of application with good convergence ability and robustness, and handle problems under generalized conditions or cases.","title":"Research on reliability evaluation of series systems with optimization algorithm","id":4184664,"url":"https://www.researchgate.net/publication/4184664_Research_on_reliability_evaluation_of_series_systems_with_optimization_algorithm","names":["Yu-Hui Xu","Wei-Jin Jiang","Yu-Sheng Xu"],"references":{"225853684":"Research on optimize prediction model and algorithm about chaotic time series","245210410":"Structural reliability analysis using a standard deterministic finite element code","4094231":"Hybrid genetic algorithm research and its application in problem optimization","256379905":"Structural Reliability Under Combined Random Load Sequences","245304228":"System Reliability Evaluation of Ductile Frame Structures","243758427":"An Exact and Invariant First Order Reliability Format"},"citedIn":{},"index":754}