{"abs":"In this paper an adaptive radial-based importance sampling (ARBIS) method is presented. The radial-based importance sampling (RBIS) method, excluding a β-sphere from the sampling domain, is extended with an efficient adaptive scheme to determine the optimal radius β of the sphere. The adaptive scheme is based on directional simulation. The underlying basic methods are presented briefly. Several numerical examples demonstrate the efficiency, accuracy and robustness of the scheme. As such, the ARBIS method can be applied as a black-box and is of particular interest in applications with a low probability of failure, for example in structural reliability, in combination with a small number of stochastic variables.","title":"Adaptive radial-based importance sampling method for structural reliability","id":223711623,"url":"https://www.researchgate.net/publication/223711623_Adaptive_radial-based_importance_sampling_method_for_structural_reliability","names":["Frank Grooteman","Structural Safety"],"references":{"245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","222266142":"Computational stochastic mechanics - Recent advances","38367467":"Remarks on a multivariate transformation. Ann Math Stat","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","223239917":"An efficient sampling method for probability of failure calculations. Structural Safety 3:109-115","273800443":"Second‐Order Reliability Approximations","23593795":"Probabilistic methods for structural response analysis","245284594":"Radial Importance Sampling for Structural Reliability","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","273800355":"Probability Integration by Directional Simulation","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","245210410":"Structural reliability analysis using a standard deterministic finite element code","223106779":"Important sampling in high dimensions","222780925":"A new adaptive importance sampling scheme","221994624":"Higher-Order Fa ilure Probability Calculation Using Nonlinear Approximations","248560911":"Importance sampling in structural system"},"citedIn":{"291421918":"Reliability analysis with Metamodel Line Sampling","257774300":"A new adaptive importance sampling Monte Carlo Method for structural reliability","47383573":"Glycine glycinium picrate - reinvestigation of the structure and vibrational spectra. Spectrochim Acta A","251544504":"Application of inverse first-order reliability method for probabilistic fatigue life prediction","272610233":"Research on the Application of Radial Basis Function Neural Network to Structural Reliability Analysis of Gravity Dam","251544505":"An adaptive directional importance sampling method for structural reliability","260231365":"The Research on Failure Analysis of Fluid Cylinder and Fatigue Life Prediction","271608250":"Dimensionality reduction and visualization of structural reliability problems using polar features","47383576":"Vibrational spectra of bis(maltolato)oxovanadium(IV): A potent insulin mimetic agent","275536353":"Comprehensive Analysis of Structural Safety and Durability for Aero-Engine","228581643":"A Simulation-Based RBDO Method Using Probabilistic Re-Analysis and a Trust Region Approach","262983864":"Strength reliability analysis of stiffened cylindrical shells considering failure correlation","268475221":"Inverse FORM Method for Probabilistic Fatigue Prognosis","259118123":"The estimation of failure probabilities as a false optimization problem","265338186":"Fatigue life prediction for aging RC beams considering corrosive environments","267599400":"An Efficient Methodology for the Reliability Analysis of Corroding Pipelines","274587069":"A mean extrapolation technique for high reliability analysis","256919346":"Regional importance effect analysis of the input variables on failure probability","274405246":"HLRF–BFGS optimization algorithm for structural reliability","263738526":"Reliability Analysis Using Chaotic Particle Swarm Optimization","276296479":"Subset Simulation Method for Rare Event Estimation: An Introduction","258176778":"Reliability sensitivity based on first-order reliability method","283997508":"New optimization algorithms for structural reliability","245185836":"An optimization method for learning statistical classifiers in structural reliability","271601858":"On the Pareto optimality of variance reduction simulation techniques in structural reliability","256688564":"Efficient sampling methods for global reliability sensitivity analysis","256919084":"A method for enhancing computational efficiency in Monte Carlo calculation of failure probabilities by exploiting FORM results","273456689":"Structural reliability assessment utilizing four metaheuristic algorithms"},"index":755}