{"abs":"Reliability analysis of structural systems often requires finite element (FE)-based simulation to estimate failure probabilities. Common simulation methods, even those incorporating variation reduction techniques, usually involve a very large number of FE analyses to achieve acceptable accuracy. A recently developed directional approach significantly improves the efficiency of directional simulation by utilizing deterministic point sets to preserve the underlying joint probability distribution of the random vector describing the structure and by employing neural networks to focus the simulation effort in the significant regions. This paper investigates the application of this method to structural system reliability analysis. The method is illustrated using deformation-based system limit states, proposed for performance-based engineering, for two plane steel frames.","title":"Finite Element-Based Structural Reliability Assessment Using Efficient Directional Simulation","id":245286596,"url":"https://www.researchgate.net/publication/245286596_Finite_Element-Based_Structural_Reliability_Assessment_Using_Efficient_Directional_Simulation","names":["Jinsuo Nie","Bruce Ellingwood","Journal of Engineering Mechanics"],"references":{"222691493":"Earthquake risk assessment of building structures","223008521":"General multi-dimensional probability integration by directional simulation","246909972":"Multivariate distribution models with prescribed marginals and covariances","245285179":"Load-Space Formulation for Time-Dependent Structural Reliability","245210394":"Directional importance sampling for ill-proportioned spaces","39066974":"Response Surface Method for Time-Variant Reliability Analysis","245285557":"Hyperspace Division Method for Structural Reliability","245211537":"Direct computation of the design point of a stochastic structure using a finite element code","245284594":"Radial Importance Sampling for Structural Reliability","245210387":"Structural system reliability assessment using directional simulation","223592988":"A new look at the response surface approach for reliability analysis","226532145":"Distributing Many Points on a Sphere","222279244":"Probability-based codified design: Past accomplishments and future challenges","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","223416196":"“Response surface method using vector projeted sampling points”","245210410":"Structural reliability analysis using a standard deterministic finite element code","245303302":"Inelastic Limit States Design. Part I: Planar Frame Studies","245304358":"Seismic Reliability of Special Moment Steel Frames with Welded Connections: II","222255813":"A new directional simulation method for system reliability. Part I: Application of deterministic point sets","15029818":"Controlled study of fluconazole in the prevention of fungal infections in neutropenic patients with haematologic malignancies and bone marrow transplant recipients"},"citedIn":{"265911736":"A Multiwavelet Neural Network-Based Response Surface Method for Structural Reliability Analysis","257271862":"Structural reliability analysis on the basis of small samples: An interval quasi-Monte Carlo method","222238011":"A comparative study of boundary-based intelligent sampling approaches for nonlinear optimization","237453504":"Review of Metamodeling Techniques in Support of Engineering Design Optimization","262259593":"Limit and shakedown analysis under uncertainty","245366742":"Failure Surface Frontier for Reliability Assessment on Expensive Performance Function","260081737":"Integration of reliability methods into a commercial finite element software package","264700044":"Structural Reliability Assessment by Local Approximation of Limit State Functions Using Adaptive Markov Chain Simulation and Support Vector Regression","285311023":"DESIGN POINTS IN DIRECTIONAL SIMULATION","259872690":"Limit and shakedown analysis under uncertainty","257392066":"A support vector density-based importance sampling for reliability assessment","259126477":"An efficient third-moment saddlepoint approximation for probabilistic uncertainty analysis and reliability evaluation of structures","267842731":"Interval quasi-Monte Carlo method for reliability assessment with imprecise probability","222206944":"Response surface augmented moment method for efficient reliability analysis","257007023":"Interval importance sampling method for finite element-based structural reliability assessment under parameter uncertainties"},"index":757}