{"abs":"Graduation date: 2010 Probability-based reliability methods have placed an increased emphasis on realistic simulation of structural behavior in bridge engineering. Uncertainty is present in every aspect of structural analysis. Aleatory uncertainties in the loading and load-carrying capacities, and epistemic uncertainties in mathematical idealization of bridge systems are the major contributors to uncertain structural response. However, the range of possible response and resistance of bridge components can be predicted in probabilistic means. The objective of this study is to develop efficient reliability analysis methods for bridge components using existing concepts of probability, structural reliability and finite element analysis. A finite element reliability procedure is proposed to evaluate the probability of failure while accounting for both aleatory and epistemic uncertainties in bridge girders subjected to live loads as well as columns to extreme seismic loadings. OpenSees, the Open System for Earthquake Engineering Simulation, an object-oriented open source framework for finite element analysis, is used to implement in the proposed methodology. For this probabilistic analysis approach, a gradient based first order reliability method (FORM) that provides importance measures of uncertain parameters is used instead of approximate integral solutions such as Monte-Carlo simulations. The uncertain parameters are treated as random variables with continuous probability density functions. The random variables are ranked to determine which parameters have the most influence on the structural response to applied loadings. Force-based elements whose integration points coincide with critical locations are ideal for moving load simulations of bridge girders. Moving vehicle loads are taken into account as the part of the element, rather than nodal, equilibrium equations and it is straightforward to link section forces to a constitutive model rather than relying on rigid body equilibrium. However, FORM requires explicit formulations for the derivative of the structural response to be obtained with respect to each uncertain parameter. For sensitivity formulations in force-based finite elements, the direct differentiation method (DDM) is adopted in the framework for evaluating the function and its gradient at the same precision. The numerical examples verify DDM response sensitivity equations are correct and reliability analysis setup is prepared for continuous reinforced concrete bridge girders. As a unique contribution to the reliability assessments of bridge girders, the interaction of moment and shear is considered on both the demand and resisting sides of the limit state function. A new material model based on Modified Compression Field Theory (MCFT) is implemented in OpenSees to represent moment-shear interaction. For performance limits placed on girder members, the moment-shear capacity is defined using a multi-line closed curve adapted from the AASHTO design code implementation of MCFT. To contribute safety measurements of bridge girders, the framework runs fully probabilistic reliability analyses while treating aleatory and epistemic uncertainties simultaneously. Sensitivity formulations for new implementations in the proposed methodology is another important contribution to reliability analysis of bridge components with force-based elements. The numerical examples indicate the moment-shear interaction is significantly high in most probable failure modes of bridge girders. The limit state definitions in the proposed methodology is recommended to use instead of uncoupled shear and moment capacity that can lead to non-conservative estimates of reliability. The importance measures highlights the axle loads and distribution factors have significant influence on the most probable failure mode. Another important source of uncertainty in bridge systems is due to modeling approaches of column members subjected to extreme load cases such as seismic. The methodology provides an approach for the reliability analysis of bridge columns using the formulated response sensitivity of force-based elements. One force-based element represents bridge columns under lateral loading to avoid discretization uncertainty of meshing displacement-based elements. However, the choice of an integration method in the state determination of force- based finite elements has a significant influence on the computed element response. Recent advances in the literature regularize the strain-softening response of force-based frame elements by either modifying the constitutive parameters or scaling selected integration weights. While the former case maintains numerical accuracy for strain-hardening behavior, the regularization requires a tight coupling of the element constitutive properties and the numerical integration method. In the latter case, objectivity is maintained for strain-softening problems; however, there is a lack of convergence for strain-hardening response. To resolve the dichotomy between strain-hardening and strain-softening solutions, a numerically consistent regularization technique is developed for force-based frame elements using interpolatory quadrature with two integration points of prescribed characteristic lengths at the element ends. To assess the modeling uncertainty associated with integration methods in force-based elements, analytical sensitivity of one-dimensional interpolatory quadrature is developed via direct differentiation of the locations and weights of integration points. Using the analytical sensitivity formulations, the additional integration parameters in the new regularization technique are considered as epistemic uncertainty in reliability analysis of bridge columns. The numerical examples quantify the epistemic uncertainty of selecting a force-based integration method as well as permitting integration points and weights to be treated as random variables in a probabilistic structural analysis.","title":"Parametric uncertainties in reliability analysis of bridge structures","id":44029587,"url":"https://www.researchgate.net/publication/44029587_Parametric_uncertainties_in_reliability_analysis_of_bridge_structures","names":["Osman Murat Hamutcuoglu"],"references":{"263440306":"Implementation of the modified compression field theory in a tangent stiffness-based finite element formulation","245285788":"Variational Basis of Nonlinear Flexibility Methods for Structural Analysis of Frames","247109813":"Parameter Sensitivity in Nonlinear Mechanics","228630197":"Structural Finite Element Model Updating Using Ambient Vibration Test Results","245305223":"Displacement, Flexibility, and Mixed Beam–Column Finite Element Formulations for Distributed Plasticity Analysis","225101427":"A mixed element method for beam and frame problems","35975485":"Seismic evaluation of existing reinforced concrete building columns /","227786378":"Seismic fragility methodology for highway bridges using a component level approach","250697195":"Numerical modeling of softening hinges in thin Euler–Bernoulli beams","265333965":"The Finite Element Method, vol. 1: The Basis","223092306":"Numerical approach to complete stress–strain curve of concrete","242920804":"On the Construction of Gaussian Quadrature Rules from Modified Moments","35222279":"Finite element reliability and sensitivity methods for performance-based engineering /","222223646":"Reliability-based condition assessment of deteriorating concrete bridges considering load redistribution","248069353":"Theoretical Stress-Strain Model for Confined Concrete","222572917":"Reliability-based bridge assessment using risk-ranking decision analysis","239391091":"Software Patterns for Nonlinear Beam-Column Models","245286566":"Parameter Sensitivity and Importance Measures in Nonlinear Finite Element Reliability Analysis","223947361":"Shape sensitivities in the reliability analysis of nonlinear frame structures","245306591":"Effect of Weigh-in-Motion System Measurement Errors on Load-Pavement Impact Estimation","245282014":"Statistical Modeling of Coupled Shear-Moment Resistance for RC Bridge Girders","228628197":"Sensitivity of Seismic Response and Fragility to Parameter Uncertainty","227930323":"A regularized force‐based beam element with a damage–plastic section constitutive law","256379905":"Structural Reliability Under Combined Random Load Sequences","245282519":"Methods and Object-Oriented Software for FE Reliability and Sensitivity Analysis with Application to a Bridge Structure","239023987":"Optimization Algorithms and Consistent Approximations","237404279":"Localization Issues in Force-Based Frame Elements","223795215":"Analysis of localization in frame members with plastic hinges","222182247":"Structural reliability software at the University of California, Berkeley","245305029":"System Identification and Damage Detection of a Prestressed Concrete Beam","220560511":"On selection of the best coefficients in interpolatory quadrature rules","247474085":"Seismic Design of RC and Masonry Building","245528260":"Uncertain reliability index in finite element reliability analysis","223581498":"Strategies for finding the design point in non-linear finite element reliability analysis","242698525":"Calculation of Gauss Quadrature Rules","245304563":"Second-Order Third-Moment Reliability Method","238365018":"Uncertainty Analysis of Transport-Transformation Models","247219918":"Practical Programming in Tcl and Tk","259572492":"Introduction to Numerical Analysis","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","238179662":"Stress-Resultant Plasticity for Frame Structures","245305057":"Plastic Hinge Integration Methods for Force-Based Beam–Column Elements","250072678":"Seismic performance assessment of reinforced concrete bridge columns under variable axial load","245284895":"Efficient Algorithm for Second-Order Reliability Analysis","222714823":"Handbook of Mathematical Function: With Formulas, Graphs, and Mathematical Tables","229494057":"The Patch Test. A condition for assessing FEM convergence","239335622":"A Probability-based structural code","245303064":"Probabilistic FEM for Nonlinear Concrete Structures. I: Theory","245210394":"Directional importance sampling for ill-proportioned spaces","245286167":"Fiber Element for Cyclic Bending and Shear of RC Structures. I: Theory","245304083":"Evaluation of Nonlinear Frame Finite-Element Models","222485197":"Mixed formulation of nonlinear beam finite element. Comput Struct","238178986":"Field Testing and Analysis of CRC Deck Girder Bridges","239386589":"Rating and Reliability of Existing Bridges in a Network","275188222":"Simulation of Dynamic Load for Bridges","245561405":"Assessment and Risk Ranking of Conventionally Reinforced Concrete Bridges for Shear","222316002":"The stochastic finite element method in structural reliability","38367467":"Remarks on a multivariate transformation. Ann Math Stat","246909972":"Multivariate distribution models with prescribed marginals and covariances","239390951":"Load Rating versus Reliability Analysis","243768099":"Reliability-Based Service-Life Assessment of Aging Concrete Structures","223313897":"Reliability evaluation in nonlinear analysis of reinforced concrete structures","239386595":"New AASHTO Guide Manual for Load and Resistance Factor Rating of Highway Bridges","242770387":"American Association of State Highway and Transportation Officials. Highway Drainage Guidelines American Association of State Highway and Transportation Officials. LRFD Bridge Design Specifications","229734686":"Simulating the propagation of displacement discontinuities in a regularized strain‐softening medium","242623680":"The Unified Modelling Language User Guide","245210410":"Structural reliability analysis using a standard deterministic finite element code","245211941":"Finite element reliability analysis of bridge girders considering moment–shear interaction","228077089":"The C++ Programming Language","245284386":"Markov Renewal Model for Maximum Bridge Loading","220688539":"An Introduction to Linear and Nonlinear Programming","222989963":"Analysis of moving loads using force-based finite elements","245304413":"Disturbed Stress Field Model for Reinforced Concrete: Formulation","225833394":"On the emergence of probability","239386509":"Load Distribution and Impact Factors for I-Girder Bridges","238180347":"Reliability of Highway Girder Bridges","33947598":"Seismic behavior and modeling of reinforced concrete building columns /","227705695":"Gradient‐dependent plasticity: Formulation and algorithmic aspects","225111716":"Crack Band Theory for Fracture of Concrete","245286480":"Seismic Fragility Analysis of Structural Systems","239794308":"Fiber finite beam elements with section shear modeling for seismic analysis of RC structures","247473425":"Seismic Analysis of Older Reinforced Concrete Columns","228575565":"Fourth-Moment Standardization for Structural Reliability Assessment","30833156":"Live load model for highway bridges","244962893":"Equilibrium based iterative solutions for the non-linear beam problem","223352197":"A New Look at Reliability of Reinforced Concrete Columns","238325731":"Structural reliability estimation by adaptive importance directional sampling","222495641":"Simulation of a class of non-normal random processes","243758427":"An Exact and Invariant First Order Reliability Format","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","248560911":"Importance sampling in structural system","2812149":"Tcl and the Tk Toolkit","2407620":"FEAP - A Finite Element Analysis Program - Version 7.4 User Manual","28784981":"The response of nonlinear multi-story structures subjected to earthquake excitation","30870069":"Design Patterns: Elements of Reusable Object-Oriented Software","239390887":"Response Sensitivity for Nonlinear Beam–Column Elements","245303675":"Calibration of LRFD bridge code","245302138":"Softening in Reinforced Concrete Beams and Frames","245304186":"Reinforced Concrete Frame Element with Bond Interfaces. II: State Determinations and Numerical Validation","245381957":"Model Correlation and System Health Monitoring using Frequency Domain Measurements","228800324":"Consistent Finite-Element Response Sensitivity Analysis","239387051":"3D Beam-Column Element with Generalized Plastic Hinges","253252585":"Sectional analysis of reinforced concrete members","273800355":"Probability Integration by Directional Simulation","245281645":"Sensitivity of Live Load Distribution Factors to Vehicle Spacing","227514492":"Hysteretic Models that Incorporate Strength and Stiffness Deterioration","222484150":"System reliability models for bridges","222945716":"Optimization algorithms for structural reliability"},"citedIn":{},"index":758}