{"abs":"The FTIR and FT-Raman spectra of the oxovanadium(IV) complex of 3-hydroxy-2-methyl-4-pyrone (maltol) bis(maltolato)oxovanadium(IV) were recorded and briefly discussed by comparison with the spectra of uncoordinated maltol and with some related species.","title":"Vibrational spectra of bis(maltolato)oxovanadium(IV): A potent insulin mimetic agent","id":47383576,"url":"https://www.researchgate.net/publication/47383576_Vibrational_spectra_of_bismaltolatooxovanadiumIV_A_potent_insulin_mimetic_agent","names":["Beatriz S Parajón-Costa","Enrique Baran","Spectrochimica Acta Part A Molecular and Biomolecular Spectroscopy"],"references":{"245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","23931497":"Vanadium treatment of type 2 diabetes: A view to the future","11834620":"Insulin-Enhancing Vanadium(III) Complexes","232380560":"Component metamodel synthesis for the construction of master response surfaces","19312044":"Antitumor activity and toxicity of peroxo heteroligand vanadates(V) in relation to biochemistry of vanadium","11606778":"Vanadium Compounds as Insulin Mimics","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","279378923":"Metal Compounds in Cancer Therapy","14635346":"Antitumor activity of vanadium compounds","223711623":"Adaptive radial-based importance sampling method for structural reliability","223416196":"“Response surface method using vector projeted sampling points”","32141309":"Bis(allixinato)oxovanadium(IV) Complex Is a Potent Antidiabetic Agent: Studies on Structure−Activity Relationship for a Series of Hydroxypyrone−Vanadium Complexes","291986736":"The new inorganic pharmacotherapy. XVII. Vanadium compounds","248560911":"Importance sampling in structural system","38367467":"Remarks on a multivariate transformation. Ann Math Stat","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","223239917":"An efficient sampling method for probability of failure calculations. Structural Safety 3:109-115","244286122":"Vibrational spectroscopy and ab initio MO study of the molecular structure and vibrational spectra of α- And γ-pyrones","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","239142630":"Molecular structures of oxovanadium(IV) complexes with maltol and kojic acid: A quantum mechanical study","8570795":"Comparison of anti-hyperglycemic effect amongst vanadium, molybdenum \u0026 other metal maltol complexes","222855457":"Biological, medicinal aspects of vanadium","245284594":"Radial Importance Sampling for Structural Reliability","231246884":"The Chemistry of Oxovanadium(IV)","239217711":"Biospeciation of antidiabetic VO(IV) complexes","7053830":"Thompson KH, Barta CA, Orvig CMetal complexes of maltol and close analogues in medicinal inorganic chemistry. Chem Soc Rev 35: 545-556","8779499":"The Chemistry and Biochemistry of Vanadium and the Biological Activities Exerted by Vanadium Compounds","239202545":"Spectroscopic characterization of α- and γ-pyrones and their substituted 4-hydroxy and 4-methoxy derivatives: An integrated infrared, photophysical and theoretical study","239372982":"Structure modification of maltol (3-hydroxy-2-methyl-4 H-pyran-4-one) upon cation and anion formation studied by vibrational spectroscopy and quantum-mechanical calculations","222884986":"Historic perspective and recent developments on the insulin-like actions of vanadium; toward developing vanadium-based drug for diabetes","5427942":"Synthesis, Solution and Solid State Structure of Titanium-Maltol Complex.","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","21581372":"Bis(maltolato)oxovanadium(IV) is a potent insulin mimic","245210410":"Structural reliability analysis using a standard deterministic finite element code","222780925":"A new adaptive importance sampling scheme","221994624":"Higher-Order Fa ilure Probability Calculation Using Nonlinear Approximations","6740954":"Vanadium in diabetes: 100 years from Phase 0 to Phase I","244586922":"Review: Spectroscopic studies of oxovanadium coordination compounds","231440948":"Reaction chemistry of BMOV, bis(maltolato)oxovanadium(IV) - A potent insulin mimetic agent"},"citedIn":{"251718033":"Oxoperoxomolybdenum(VI) complexes of catalytic and biomedical relevance: Synthesis, characterization, antibacterial activity and 3D-molecular modeling of some oxoperoxomolybdenum(VI) chelates in mixed (O,O) coordination environment involving maltol and β-diketoenolates","257615682":"New vanadyl complexes with metformin derivatives as potential insulin mimetic agents","237069369":"Vibrational spectra of bis(maltolato)zinc(II), an interesting insulin mimetic agent","265134293":"Synthesis and characterisation of zirconium complexes for cell tracking with Zr-89 by positron emission tomography","267745339":"Coordinative interaction of microcrystalline chitosan with oxovanadium (IV) ions in aqueous solution"},"index":759}