{"abs":"We present details of a stochastic generalization of the multigrid method, called multigrid Monte Carlo (MGMC), that reduces critical slowing down in Monte Carlo computations of lattice field theories. For Gaussian (free) fields, critical slowing down is completely eliminated. For a φ4 model, numerical experiments show a factor of ≈ 10 reduction, over a standard heat-bath algorithm, in the CPU time needed to achieve a given accuracy. For the two-dimensional XY model, experiments show a factor of ≈ 10 reduction on the high-temperature side of criticality, growing to an unbounded reduction in the low-temperature regime. The algorithm is also applicable to nonlinear σ models, and to lattice gauge theories with or without bosonic matter fields.","title":"Multigrid Monte Carlo method. Conceptual foundations","id":13277506,"url":"https://www.researchgate.net/publication/13277506_Multigrid_Monte_Carlo_method_Conceptual_foundations","names":["Jonathan Goodman","AD Sokal","Physical review D: Particles and fields"],"references":{"225871734":"Existence of compatible families of proper regular conditional probabilities","256576847":"Continuum behavior in the lattice O(3) sigma model","13345357":"Monte Carlo study of the Coulomb-gas representation of frustrated XY models","258092266":"Embedded dynamics for 4 theory","226024944":"New Monte Carlo method for the self-avoiding walk. J. Stat. Physics 40, 483-531","222440651":"The Monte Carlo method for the study of phase transitions: A review of some recent progress","13351104":"Critical behavior of pure and diluted XY models with uniform frustrations","13250886":"General Cluster Updating Method for Monte Carlo Simulations","224530670":"Recent advances in simulation of magnetic systems (invited)","243207411":"Accelerating hybrid stochastic algorithm for spin models","13353669":"Phase transitions in uniformly frustrated XY models","13254596":"Numerical analysis of accelerated stochastic algorithms near a critical temperature","200104803":"Renormalization, vortices, and symmetry-breaking perturbations in 2-dimensional planar model. Phys. Rev. B 16, 1217","243194350":"Massless lattice ? 4 4 theory: Rigorous control of a renormalizable asymptotically free model","223637312":"Fluids, discontinuities and renormalization group methods","235546783":"Vortices and the low-temperature structure of the xy model","243370006":"Block spin renormalization group for dipole gas and (∇φ)4","24387811":"Fourier Analysis of the SOR Iteration","222055717":"Acceleration of gauge field dynamics","232352962":"Monte Carlo evaluation of the continuum limit of (φ4)4 and (φ4)3","268773662":"On the linear iteration procedures for symmetric matrices","222592090":"Solving φ1,24 field theory with Monte Carlo","13328980":"Overrelaxation and mode coupling in σ models","13250154":"Collective Monte Carlo Updating for Spin Systems","252314538":"Bounds on the decay of correlations for λ(∇φ)4 models","226197594":"Langevin simulations of lattice field theories using Fourier acceleration","241612615":"Brownian dynamics as smart Monte Carlo simulation","13333352":"Langevin simulation of lattice field theories. Phys. Rev. D 32, 2736","13251951":"Lattice field theory as a percolation process","226068831":"Perturbation about the mean field critical point","227212973":"Proposal of a new upgrading procedure for Monte Carlo experiments","13330658":"Generalization of the Fortuin-Kasteleyn-Swendsen-Wang representation and Monte Carlo algorithm. Phys. Rev. D 38: 2009-2012","222269718":"Gauge-invariant coarse-to-fine transformations for multigrid Monte Carlo algorithms in pure lattice gauge theories","13330145":"Fourier acceleration in lattice gauge theories. I. Landau gauge fixing","38328932":"Ultraviolet stability in Euclidean scalar field theories","235600804":"Numerical evaluations of the critical properties of the two-dimensional Ising model","245976475":"Duality in field theory and statistical systems","13352184":"Josephson arrays in an incommensurate magnetic field","242362699":"Nested Dissection of a Regular Finite Element Mesh","225946318":"On the ultraviolet stability in statistical mechanics and field theory","253403296":"Combining Renormalization Group and Multigrid Methods","254285715":"Random Sampling from the Exponential Power Distribution","13249526":"Embedded dynamics for phi4 theory.","242921540":"On the l 2 Convergence of an Algorithm for Solving Finite Element Equations","241429596":"Complexity Bounds for Regular Finite Difference and Finite Element Grids","229278059":"Overrelaxation by reversible mode coupling","225873719":"Inequalities for continuous-spin Ising ferromagnets. J. Stat. Phys. 15, 327","13330569":"Tuning the hybrid Monte Carlo algorithm","222018937":"Hybrid Monte Carlo","200104872":"The Critical Properties of the Two-Dimensional XY Model","13256204":"Multigrid Monte Carlo Method for Lattice Field Theories","38328718":"Some probabilistic techniques in field theory","13255042":"Adler’s overrelaxation algorithm for Goldstone bosons","226041523":"Exponential convergence to equilibrium for a class of random-walk models","35888744":"The renormalization group and the E expansion.","200104742":"Theory of Dynamic Critical Phenomena","13330566":"Global Monte Carlo algorithms for many-fermion systems","235539143":"Over-relaxation method for the Monte Carlo evaluation of the partition function for multiquadratic actions","13330565":"Tests of globally corrected hybrid updating","256230794":"Elliptic equations and Gaussian processes","13330584":"Metropolis overrelaxation for lattice gauge theory for general relaxation parameter","200104507":"Universality in the two-dimensional continuous spin model","222854942":"On multiple grid and related techniques for solving discrete elliptic systems","241298998":"Generalized Nested Dissection","243769168":"Unigrid for Multigrid Simulation","226797020":"Sokal, A.D.: The pivot algorithm: A highly efficient Monte Carlo method for the self-avoiding walk. J. Stat. Phys.50, 109-186","236973253":"Monte Carlo Computations in Lattice Gauge Theories","252842441":"A new proof of the existence and nontriviality of the continuum ? 2 4 and ? 3 4 quantum field theories","13348759":"New algorithm for the numerical simulation of fermions","222590105":"Renormalization and stochastic quantization","13251989":"Simulations without critical slowing down","13254442":"Overrelaxed heat-bath and Metropolis algorithms for accelerating pure gauge Monte Carlo calculations","13331498":"Overrelaxation and Monte Carlo simulation","239633707":"Finite-size scaling analysis of the Φ4 field theory on the square lattice","243207576":"Testing accelerated stochastic algorithms in two dimensions The SU(3) × SU(3) spin model","224509449":"Dynamical critical exponent of the 3D Ising model","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","235502311":"Dynamic critical exponent z in some two-dimensional models","13250875":"Phase Transition in the 2 D XY Model","243207693":"Monte Carlo simulation of a lattice field theory as correlated percolation","241365521":"Using Renormalization-Group Ideas in Monte Carlo Sampling","13353662":"Dynamic correlations in the three-dimensional Ising model","222438458":"A statistical approach to quantum mechanics. Ann. Phys. 132, 427","226950138":"The Kosterlitz-Thouless transition in two-dimensional Abelian spin systems and the Coulomb gas","256594358":"Hierarchical Monte Carlo simulation of the Ising model","13251892":"Stochastic algorithm corresponding to a general linear iterative process"},"citedIn":{"249285849":"Modeling Heterogeneity and Serial Correlation in Binary Time-Series Cross-sectional Data: A Bayesian Multilevel Model with AR(p) Errors","220183837":"Blue-Noise Point Sampling using Kernel Density Model","222538820":"A different construction of Gaussian fields from Markov chains: Dirichlet covariances","2911269":"Approximation Algorithms for Probabilistic Reasoning:","225239143":"On directional Metropolis–Hastings algorithms","241317481":"Anisotropic seismic inversion using a multigrid Monte Carlo approach","222486606":"Wolff-type embedding algorithms for general nonlinear σ-models","31123925":"Generalised Gibbs sampler and multigrid Monte Carlo for Bayesian computation","7294304":"Multiscale Spatial Monte Carlo Simulations: Multigriding, Computational Singular Perturbation, and Hierarchical Stochastic Closures","228218005":"A Multilevel Approach to Control Variates","222483795":"Improved algorithms for simulating crystalline membranes","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","265077470":"Infinite-Dimensional Exponential Families in Cluster Analysis of Structured Data","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","1990666":"Critical exponents of the three-dimensional classical plane rotator model on the sc lattice from a high temperature series analysis","34073873":"Finite size scaling and the universality class of SU(2) lattice gauge theory /","243447706":"Erratum: Monte Carlo simulation of O(2) φ 4 field theory in three dimensions [Phys. Rev. E 64 , 066113 (2001)]","222900329":"Projective block spin transformations in lattice gauge theories","247280030":"Projective multigrid for Wilson fermions","234973220":"Variational upper and lower bounds on quantum free energy and energy differences via path integral Monte Carlo","228928643":"Generalizing Swendsen–Wang for Image Analysis","2759693":"Monte Carlo Methods in Statistical Mechanics: Foundations and New Algorithms","227176354":"New multiple histogram method for studying phase transitions","238731280":"Exact and Approximate Recursive Calculations for Binary Markov Random Fields Defined on Graphs","1990453":"Neural multigrid for gauge theories and other disordered systems","220411400":"Computing $f(A)b$ via Least Squares Polynomial Approximations","251425239":"Bayesian calibration of a large-scale geothermal reservoir model by a new adaptive delayed acceptance Metropolis Hastings algorithm","222114832":"Acceleration methods for Monte Carlo computer simulations","266843082":"Ensemble samplers with affine invariance","45906067":"Spatially Adaptive Stochastic Multigrid Methods for Fluid-Structure Systems with Thermal Fluctuations","7294303":"Acceleration of Markov chain Monte Carlo simulations through sequential updating","256600698":"Multi-grid Monte Carlo (II). Two-dimensional XY model","2732319":"Dynamical Analysis Of Low Temperature Monte Carlo Cluster Algorithms","2834451":"Alternating Subspace-Spanning Resampling to Accelerate Markov Chain Monte Carlo Simulation","1990438":"High Precision Simulation Techniques for Lattice Field Theory","221591049":"What Do We Know about the Metropolis Algorithm ?","270906136":"Efficiency and computability of MCMC with Langevin, Hamiltonian, and other matrix-splitting proposals","253846300":"Directional Metropolis-Hastings algorithms on hyperplanes","7525965":"Monte Carlo studies of three-dimensional O(1) and O(4) φ 4 theory related to Bose-Einstein condensation phase transition temperatures","255994370":"Implicit sampling for an elliptic inverse problem in underground hydrodynamics","243352517":"Multigrid inversion of the staggered fermion matrix","1950297":"High temperature study of the Kosterlitz-Thouless phase transition in the XY model on the triangular lattice","1868890":"Correlated percolation and the correlated resistor network","222430981":"Using wavelet transforms for multiresolution materials modeling","222462474":"Percolation mechanism for colossal magnetoresistance","6197527":"Efficient Monte Carlo sampling by parallel marginalization.","260161226":"Convergence Rates of the Gibbs Sampler, the Metropolis Algorithm and Other Single-Site Updating Dynamics","1990483":"Theoretical Analysis of Acceptance Rates in Multigrid Monte Carlo","258886435":"A Lanczos Procedure for Approximating Eigenvalues of Large Stochastic Matrices","222585611":"Cluster Monte Carlo Algorithms","265540252":"Monte Carlo Simulations of Spin Systems","1772116":"Rejoinder: Gibbs Sampling, Exponential Families and Orthogonal Polynomials","234201253":"Physics Goals of the QCD Teraflop Project","243103533":"Une nouvelle construction de champs Gaussiens à partir de chaînes de Markov","249866167":"Stochastic inversion of prestack seismic data using fractal-based initial models","2738813":"Statistically Optimal Multigrid Algorithms for the Anharmonic Crystal Model","1772108":"Comment: Gibbs Sampling, Exponential Families and Orthogonal Polynomials","47524239":"SU(3) Landau gauge gluon and ghost propagators using the logarithmiclattice gluon field definition","258606391":"Bayesian reconstruction of binary media with unresolved fine-scale spatial structures","220574331":"What Do We Know about the Metropolis Algorithm?","274234630":"Joint stochastic inversion of 3D prestack seismic-amplitude data and well logs for high-resolution reservoir characterization of deepwater hydrocarbon reservoirs","47461044":"A patch that imparts unconditional stability to certain explicit integrators for SDEs","13283242":"Dynamical critical behavior of the three-dimensional Heisenberg model","223921466":"Critical slowing-down in SU(2) Landau gauge-fixing algorithms","222470694":"Multi-grid Monte Carlo (III). Two-dimensional O(4)-symmetric non-linear σ-model","13275820":"Acceptance rates in multigrid Monte Carlo simulations","13275821":"Testing accelerated algorithms in the lattice CP 3 model","238968918":"Quantitative study of the Kosterlitz-Thouless phase transition in an XY model of two-dimensional plane rotators: High-temperature expansions to order β 20","1764464":"Parallel marginalization Monte Carlo with applications to conditional path sampling","227030245":"Kinematics of multigrid Monte Carlo","13275045":"Projective multigrid method for propagators in lattice gauge theory","262381260":"Using multiscale preconditioning to accelerate the convergence of iterative molecular calculations","4746041":"Dynamically Weighted Importance Sampling in Monte Carlo Computation","230990262":"Binder, K. Applications of Monte Carlo methods to statistical physics. Rep. Prog. Phys. 60, 487-559","223558949":"The Local Hybrid Monte Carlo algorithm for free field theory: Reexamining overrelaxation","223402535":"Defeating critical slowing down for abelian gauge dynamics","4772144":"Bayesian inversion of geoelectrical resistivity data","251463301":"Course 16 Simulation of statistical mechanics models","13243977":"Multigrid acceleration for asymptotically free theories","222479809":"Global optimization methods for multimodal inverse problems","2468774":"A Theory for Dynamic Weighting in Monte Carlo Computation","2432418":"Multiscale Annealing for Real--Time Unsupervised Texture Segmentation","13281090":"Universal Low Temperature AC Conductivity of Macroscopically Disordered Nonmetals","6076629":"Acceleration of Monte Carlo simulations through spatial updating in the grand canonical ensemble","43048474":"An efficient algorithm for classical density functional theory in three dimensions: Ionic solutions","258840039":"Spatially Adaptive Stochastic Methods for Fluid-Structure Interactions Subject to Thermal Fluctuations in Domains with Complex Geometries","241235948":"Multigrid updating of compact U(1) gauge fields in four dimensions","13326919":"Multicanonical multigrid Monte Carlo method","265295453":"Efficient Gaussian Sampling for Solving Large-Scale Inverse Problems using MCMC","223034821":"Multiscale Annealing for Grouping and Unsupervised Texture Segmentation","1992593":"The LHMC Algorithm for Free Field Theory: Reexamining Overrelaxation","1941645":"A Multigrid Algorithm for Sampling Imaginary-Time Paths in Quantum Monte Carlo Simulations","225980396":"Hierarchical Annealing for Synthesis of Binary Images","223119833":"How to beat critical slowing-down: 1990 update","45856557":"On the Accuracy of Finite-Volume Schemes for Fluctuating Hydrodynamics","11620647":"UW/PT-01-07 Monte Carlo simulation of O(2) φ 4 field theory in three dimensions","13247325":"Accelerating Abelian gauge dynamics","235593875":"Multigrid Monte Carlo simulation via XY embedding. II. Two-dimensional SU(3) principal chiral model","1829761":"Relieving the Fermionic and the Dynamical Sign Problem:Multilevel Blocking Monte Carlo Simulations","243353114":"Dynamic critical behavior of multi-grid Monte Carlo for two-dimensional nonlinear σ-models","1990530":"Multigrid meets Neural Nets","228550146":"Approximation Algorithms for Probabilistic Reasoning: Sampling and Iterative Inference","239155422":"Cluster Sampling and its Applications to Segmentation, Stereo and Motion","226319074":"Accelerated Monte Carlo for Optimal Estimation of Time Series","5915386":"Conjugate gradient heat bath for ill-conditioned actions","256594410":"Droplets in Ising models","1990586":"Multigrid Methods for the Computation of Propagators in Gauge Fields","38348782":"On the convergence of the Markov chain simulation method. Ann. Statist., 24: 69-100","13276770":"Real-space renormalization-group approach to the multigrid method","222467818":"Some Comments on Multigrid Methods for Computing Propagators","224926912":"Implicit Particle Methods and Their Connection with Variational Data Assimilation","1948593":"Multilevel Blocking Approach to the Fermion Sign Problem in Path-Integral Monte Carlo Simulations","7737048":"Topological coarse graining of polymer chains using wavelet-accelerated Monte Carlo. I. Freely jointed chains","267437407":"Convergence in Variance of Chebyshev Accelerated Gibbs Samplers","222294927":"Noncritical multigrid Monte Carlo: O(3) non-linear σ model","1990830":"Multigrid Monte Carlo in the Sine Gordon model","1868972":"Percolation mechanism for Colossal Magnetoresistance","227703075":"Mode jumping proposals in MCMC","222020490":"Multigrid inversion of lattice fermion operators","13273465":"Multigrid Monte Carlo algorithm with higher cycles in the sine-Gordon model","228611091":"Model-based analysis to improve the performance of iterative simulations","268425802":"Hidden Hierarchical Markov Fields for Image Modeling","1910187":"Monte Carlo without Chains","222614259":"Inverting the Dirac matrix for SU(2) lattice gauge theory by means of parallel transported multigrid","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","13271152":"Multigrid Monte Carlo algorithms for SU(2) lattice gauge theory: Two versus four dimensions","2256286":"Simulated Sintering: Markov Chain Monte Carlo With Spaces of Varying Dimensions","239289853":"Multicanonical multigrid Monte Carlo method and effective autocorrelation time","244509996":"The Multiple-Try Method and Local Optimization in Metropolis Sampling","276081354":"Source Localization by Entropic Inference and Backward Renormalization Group Priors","243352385":"Multigrid method for the 2-d XY model","259964606":"Multigrid Monte Carlo Simulations","222504837":"Multicanonical Monte Carlo simulations","1872603":"Optimal Energy Estimation in Path-Integral Monte Carlo Simulations","11767156":"BEC Transition Temperature of a Dilute Homogeneous Imperfect Bose Gas","234256959":"The effective action from multigrid Monte Carlo","222503561":"Nonlocal Monte Carlo algorithms for statistical physics applications","266357035":"Gluon-und Ghostpropagatoren in der SU (3)-Yang-Mills-Theorie Diplomarbeit","256600704":"Multigrid simulation of the XY model","1991381":"Application of Multicanonical Multigrid Monte Carlo Method to the Two-Dimensional $\\phi^4$-Model: Autocorrelations and Interface Tension","282432024":"Parameter estimation by implicit sampling","236625364":"Block-Relaxation Approaches for Fitting the INDCLUS Model","2368759":"A Different Construction Of Gaussian Fields From Markov Chains: Dirichlet Covariances","1992900":"Multigrid implementation of the Fourier acceleration method for Landau gauge fixing","265623304":"Sampling Gaussian Distributions in Krylov Spaces with Conjugate Gradients","222447779":"Multigrid methods for propagators in lattice gauge theories","257235892":"Pathologies of the large-N limit for RPN−1, CPN−1, QPN−1 and mixed isovector/isotensor σ-models","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","13269806":"Multigrid Monte Carlo method. IV. One-dimensional O(4)-symmetric nonlinear σ model","257313203":"MOMCMC: An efficient Monte Carlo method for multi-objective sampling over real parameter space","2704064":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","45412447":"On Conditional Wiener Integrals and a Novel Approach to the Fermion Sign Problem","247714856":"Test of variational approximation for φ 4 quantum chain by Monte Carlo simulation","222913444":"Monopoles, quark confinement, and screening in four-dimensional U(1) lattice gauge theory","6545038":"BOLD response analysis by iterated local multigrid priors","256684220":"Multigrid Method versus Staging Algorithm for PIMC Simulations","228932692":"GPU-accelerated differential evolutionary Markov Chain Monte Carlo method for multi-objective optimization over continuous space. In: BADS’10 Proceedings of the 2nd workshop on Bio-inspired algorithms for distributed systems","229226331":"Does the topological charge scale in the lattice CP3-model?","234841099":"sampling krylov spaces","222788530":"Multigrid updating of U (1) gauge fields","222442679":"Overrelaxation algorithm for coupled gauge-Higgs systems","225499525":"Monte Carlo Methods in Statistical Physics","2606289":"Markov Random Fields and Images","222584508":"Path integral Monte Carlo using multigrid techniques","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","243583359":"Monte Carlo studies of phase transitions and critical phenomena","13286454":"High-Temperature series for the $RP^{n-1}$ lattice spin model (generalized Maier-Saupe model of nematic liquid crystals) in two space dimensions and with general spin dimensionality n","45858374":"Rates of convergence of some multivariate Markov chains with polynomial eigenfunctions","266188576":"Preconditioned Krylov Subspace Methods for Sampling Multivariate Gaussian Distributions"},"index":76}