{"abs":"Gaussian processes are often used as statistical representations (emulators) of computer models, due to their flexibility in capturing the shape of smooth functions. They do have however, a number of parameters, the estimation of which is a fundamental step towards building an emulator. The estimation of these parameters is the problem considered in this work. An analytical marginalisation of the parameters is advocated, when this is tractable, and when it is not, the effect of a numerical marginalisation is investigated and compared to the use of a single parameter estimate, a method also known as plug-in. A major contribution of this work is the proposal of a correlation length prior, which yields a proper posterior by imposing limits on the acceptable values of the correlation lengths. We argue that such limits can be defined a priori, and not only they do not deteriorate the inferences made with the emulator, but on the contrary, they reduce the risk of numerical instabilities, facilitate the convergence of MCMC algorithms and generally help the validation process. The considered parameter estimation methods and the proposed prior are tested on emulators built for two climate models.","title":"Parameter estimation for Gaussian process emulators","id":265409508,"url":"https://www.researchgate.net/publication/265409508_Parameter_estimation_for_Gaussian_process_emulators","names":["Y Andrianakis","Peter Challenor"],"references":{"4772045":"Bayesian Calibration of Computer Models","241724397":"Risks of Using Improper Priors with Gibbs Sampling and Autocorrelated Errors","246094110":"Estimating a Product of Means: Bayesian Analysis with Reference Priors","4743918":"Objective Bayesian Analysis of Spatially Correlated Data","2120071":"Default priors for Gaussian processes. Ann Stat","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","243687932":"Reference Posterior Distributions for Bayesian Inference","224840043":"Recovery of Inter-Block Information When Block Sizes are Unequal","42792259":"Uncertainties due to transport-parameter sensitivity in an efficient 3-D ocean-climate model","228339939":"Diagnostics for Gaussian Process Emulators","243778376":"Bayesian Inference for Variance Components Using Only Error Contrasts"},"citedIn":{"279309842":"Gaussian process hyper-parameter estimation using parallel asymptotically independent Markov sampling"},"index":762}