{"abs":"This paper covers the evaluation and fine-tuning of different values of genetic operator\u0027s parameters in the process of optimizing the designs of the integrated circuits. We investigated the interdependence of various values of these parameters in the use over the set of test-bench circuits, as well as their influence on the quality of the final solution and the convergence speed. Due to the increasing usage of the evolutionary optimization in the area of the integrated circuit design, there is a need to find a proper combination of genetic operators parameters\u0027 value to make optimal solutions. Therefore, it is important to perform this kind of evaluation for each new problem to be solved.","title":"The parameters tuning for evolutionary synthesis algorithm","id":228894014,"url":"https://www.researchgate.net/publication/228894014_The_parameters_tuning_for_evolutionary_synthesis_algorithm","names":["Gregor Papa","Jurij Silc","Informatica"],"references":{"6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","31708114":"Evolutionary Algorithms in Theory and Practice : Evolution Strategies, Evolutionary Programming, Genetic Algorithms / T. Bäck.","220606372":"An Enhanced Genetic Algorithm for Solving the High-Level Synthesis Problems of Scheduling, Allocation, and Binding.","236628200":"Concurrent operation scheduling and unit allocation with an evolutionary technique in the process of integrated-circuit design","3314714":"A Fast Exact Least Mean Square Adaptive Algorithm","4218714":"HAL: A Multi-Paradigm Approach to Automatic Data Path Synthesis","220055334":"Automatic large-scale integrated circuit synthesis using allocation-based scheduling algorithm","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","220199089":"Tuning EPR spectral parameters with a genetic algorithm","3218143":"Universal motor efficiency improvement using evolutionary optimization"},"citedIn":{"242286565":"EDITORIAL BOARDS, PUBLISHING COUNCIL"},"index":764}