{"abs":"Thesis (M.S.)--Massachusetts Institute of Technology, Dept. of Aeronautics and Astronautics, 1995. Includes bibliographical references (p. 199-200).","title":"Fault tolerant design using single and multicriteria genetic algorithm optimization /","id":35290207,"url":"https://www.researchgate.net/publication/35290207_Fault_tolerant_design_using_single_and_multicriteria_genetic_algorithm_optimization","names":["Jason R. (Jason Ramon) Schott"],"references":{},"citedIn":{"220740130":"Multiobjective Optimization Using Ideas from the Clonal Selection Principle","2522154":"Why Quality Assessment of Multiobjective Optimizers Is Difficult","238520633":"A real-coded quantum clone multi-objective evolutionary algorithm","251909907":"A Modified Differential Evolution Algorithm for Multi-Objective Optimization Problems","224324428":"Improved PSO-based Multi-Objective Optimization using Inertia Weight and Acceleration Coefficients Dynamic Changing, Crowding and Mutation","225174648":"Multiobjective Optimization by a Modified Artificial Immune System Algorithm","220105995":"Hybrid immune algorithm with Lamarckian local search for multi-objective optimization","224246859":"A performance comparison of multi-objective optimization evolutionary algorithms for all-optical networks design","228644280":"A Hybrid Evolutionary Approach to Solve Multi-objective Optimization Problems based on Particle Swarm Optimizer and Genetic Algorithm","221228599":"Minimal Sets of Quality Metrics","2239800":"On Measuring Multiobjective Evolutionary Algorithm Performance","221228596":"Multi-objective MaxiMin Sorting Scheme","237510155":"Designing ART-based Classifiers through Multi-Objective Memetic Evolution","242382422":"An Algorithm Based on Differential Evolution for Multi-Objective Problems","251949344":"The constrained multi-objective evolutionary algorithm based on the exchange of pairs of groups","220742159":"A novel diversification strategy for multi-objective evolutionary algorithms","224503625":"A Novel Clonal Algorithm for Multiobjective Optimization","221006597":"A novel hybrid evolutionary strategy and its periodization with multi-objective genetic optimizers","221093382":"Cooperative Versus Competitive Coevolution for Pareto Multiobjective Optimization","4201583":"Multi-objective mobile agent routing in wireless sensor networks","221086748":"Research on Overlapping Individuals in MOEAs: Causation, Probability for Quantity and Influence on Assessment","220724754":"Applying a New Grid-Based Elitist-Reserving Strategy to EMO Archive Algorithms","220058920":"Metaheuristics for the bi-objective orienteering problem. Swarm Intell","227228605":"Risk and Cost Tradeoff in Economic Dispatch Including Wind Power Penetration Based on Multi-Objective Memetic Particle Swarm Optimization","224178027":"An archiving strategy based on the Convex Hull of Individual Minima for MOEAs","227065032":"Multi-Objective Wavelet-Based Pixel-Level Image Fusion Using Multi-Objective Constriction Particle Swarm Optimization","220739944":"A new memetic strategy for the numerical treatment of multi-objective optimization problems","224212508":"An Experimental Comparison of Multiobjective Algorithms: NSGA-II and OMOPSO","220469862":"Three new metrics to measure the convergence of metaheuristics towards the Pareto frontier and the aesthetic of a set of solutions in biobjective optimization.","5303061":"Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection","236960858":"Ophiuroid remains from the Toarcian of Sainte-Verge (Deux-Sèvres, France): Paleobiological perspectives","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","226790338":"Multiobjective structural optimization using a microgenetic algorithm","2615407":"A Pareto Frontier for Full Stern Submarines via Genetic Algorithm","220741476":"An effective use of crowding distance in multiobjective particle swarm optimization","220702065":"Solving Multiobjective Optimization Problem by Constraint Optimization","224645891":"Dynamic Population Size in PSO-based Multiobjective Optimization","216300934":"On metrics for comparing non-dominated sets","221185101":"Coupling of Immune Algorithms and Game Theory in Multiobjective Optimization.","220777282":"Multiobjective Constriction Particle Swarm Optimization and Its Performance Evaluation","220740165":"Analysis of Multi-Objective Evolutionary Algorithms to Optimize Dynamic Data Types in Embedded Systems","257628726":"A preference multi-objective optimization based on adaptive rank clone and differential evolution","4201519":"Particle swarm optimization and fitness sharing to solve multi-objective optimization problems","224301873":"Task allocation using inherited area density multiobjective Particle Swarm Optimization","2831963":"An Approach to Solve Multiobjective Optimization Problems Based on an Artificial Immune System","220702288":"A Proposal to Hybridize Multi-Objective Evolutionary Algorithms with Non-gradient Mathematical Programming Techniques","226398980":"Improving the Performance of Multiobjective Evolutionary Optimization Algorithms Using Coevolutionary Learning","232632995":"A New Hybrid Particle Swarm Optimization Algorithm for Handling Multiobjective Problem Using Fuzzy Clustering Technique","221506637":"Artificial Immune System Based on Clonal Selection and Game Theory Principles for Multiobjective Optimization","220286112":"Solving Multiobjective Optimization Problems Using an Artificial Immune System","224302549":"Cooperative coevolution for Pareto multiobjective optimization: An empirical study using SPEA2","224645874":"Distributed Multi-objective GA for Generating Comprehensive Pareto Front in Deceptive Optimization Problems","37464746":"Optimization of Dynamic Data Types in Embedded Systems using DEVS/SOA-based Modeling and Simulation","226143464":"Multi-criteria location planning for public facilities in tsunami-prone coastal areas","3418784":"Handling multiple objectives with particle swarm optimization. IEEE Trans Evol Comp","224198088":"Evolutionary algorithms for multi-objective optimization problems with interval parameters","241176827":"A novel strategy to preserve diversity in solving MOEAs based on artificial emphasis on uniformity","242576366":"Multiobjective Evolutionary Algorithms for Financial Portfolio Design","225141238":"Local models—an approach to distributed multi-objective optimization","220714169":"Design metrics and visualization techniques for analyzing the performance of MOEAs in DSE","237631926":"Chapter I An Introduction to Multi-Objective Optimization","243788071":"Analysis and applications of evolutionary multiobjective optimization algorithms","225158601":"On local optima in multiobjective combinatorial optimization problems","220828554":"Multiple Criteria Performance Analysis of Non-dominated Sets Obtained by Multi-objective Evolutionary Algorithms for Optimisation","220754316":"An Spanning Tree Based Method For Pruning Non-Dominated Solutions in Multi-Objective Optimization Problems.","246816017":"Metrics for Quality Assessment of a Multiobjective Design Optimization Solution Set","226825259":"A simulaton-based multi-objective genetic algorithm (SMOGA) for BOT network design problem","36146583":"Traffic engineering in MPLS networks with multiple objectives : modeling and optimization /","4017035":"Evolutionary multiobjective optimization using a cultural algorithm","245310505":"VIS: An artificial immune network for multi-objective optimization","222704880":"Nature-inspired metaheuristics for multiobjective activity crashing","221008539":"A nonlinear simplex search approach for multi-objective optimization","4279800":"Competitive Coevolution with K-Random Opponents for Pareto Multiobjective Optimization","226497594":"Recent Trends in Evolutionary Multiobjective Optimization","221228436":"The Micro Genetic Algorithm 2: Towards Online Adaptation in Evolutionary Multiobjective Optimization","4201470":"Intelligent particle swarm optimization in multiobjective optimization","238682874":"Title of Dissertation ENTROPY APPROACH TO METAMODELING, MULTI-OBJECTIVE GENETIC ALGORITHM, AND QUALITY ASSESSMENT OF SOLUTION SETS FOR","220935662":"A Co-evolutionary Particle Swarm Optimization-Based Method for Multiobjective Optimization.","221163238":"New Quality Measures for Multiobjective Programming","220887523":"Coevolutionary Multi-objective Optimization Using Clustering Techniques.","226610511":"Assessment Methodologies for Multiobjective Evolutionary Algorithms","232626706":"Dynamic Crowding Distance?A New Diversity Maintenance Strategy for MOEAs","221228542":"Clonal Selection with Immune Dominance and Anergy Based Multiobjective Optimization","225315514":"G–Indicator: An M–Ary Quality Indicator for the Evaluation of Non–dominated Sets","224877489":"Design of Distributed Optical-Fiber Raman Amplifiers using Multi-objective Particle Swarm Optimization","237411824":"CHAPTER 1 AN INTRODUCTION TO MULTI-OBJECTIVE EVOLUTIONARY ALGORITHMS AND THEIR APPLICATIONS","4201626":"Handling diversity in evolutionary multiobjective optimization","220773875":"Intelligent Multiobjective Particle Swarm Optimization Based on AER Model","220777460":"Handling Multiobjective Problems with a Novel Interactive Multi-Swarm PSO.","225914026":"A Memetic Algorithm with Non Gradient-Based Local Search Assisted by a Meta-model","241060481":"Multiobjective Particle Swarm Optimization for Parameter Estimation in Hydrology","221008590":"Multi-objective Evolutionary Algorithm Based on Adaptive Discrete Differential Evolution","225266315":"Solving the Aircraft Engine Maintenance Scheduling Problem Using a Multi-objective Evolutionary Algorithm","27342150":"Improved genetic algorithm inspired by biological evolution","237665475":"OPTIMIZATION USING AN EVOLUTIONARY HYPERPLANE GUIDED APPROACH","4376491":"Augmenting SPEA2 with K-Random competitive coevolution for enhanced evolutionary multi-objective optimization","220887232":"A Set of Test Cases for Performance Measures in Multiobjective Optimization","220741315":"Performance assessment of an artificial immune system multiobjective optimizer by two improved metrics.","221008834":"An ensemble method for performance metrics in multiobjective evolutionary algorithms.","215693864":"Start-Up Optimisation of a Combined Cycle Power Plant with Multiobjective Evolutionary Algorithms","224175780":"A multi-objective Artificial Bee Colony for optimizing multi-objective problems","224347553":"Design Flow of Dynamically-Allocated Data Types in Embedded Applications Based on Elitist Evolutionary Computation Optimization"},"index":767}