{"abs":"A group signature scheme allows a group member to sign a message anonymously on behalf of the group. In case of a dispute, the group manager can reveal the actual identity of signer. We propose a novel group signature satisfying the regular requirements. Furthermore, it also achieves the following advantages: (1) the size of signature is independent of the number of group members; (2) the group public key is constant; (3) Addition and Revocation of group members are convenient; (4) it enjoys forward security; (5) The total computation cost of signature and verification requires only 8 modular exponentiations. Hence, our scheme is very practical in many applications, especially for the dynamic large group applications.","title":"A New Efficient Group Signature With Forward Security.","id":220166234,"url":"https://www.researchgate.net/publication/220166234_A_New_Efficient_Group_Signature_With_Forward_Security","names":["Jianhong Zhang","Qianhong Wu","Yumin Wang","Informatica"],"references":{"220313955":"A Novel ID-based Group Signature.","2554976":"Efficient Revocation in Group Signatures","2456942":"Publicly Verifiable Secret Sharing","3351358":"Efficient group signature scheme based on the discrete logarithm","2572744":"How To Prove Yourself: Practical Solutions to Identification and Signature Problems","2485111":"Identity Escrow","2376624":"Practical Forward Secure Group Signature Schemes","220797085":"Some Open Issues and New Directions in Group Signatures","33550122":"Group Signatures","223452039":"A novel ID-based group signature","220796881":"Group Blind Digital Signatures: A Scalable Solution to Electronic Cash","220617149":"A Digital Signature Scheme Secure Against Adaptive Chosen-Message Attacks","221354922":"A Practical and Provably Secure Coalition-Resistant Group Signature Scheme","2417951":"RSA-Based Undeniable Signatures","4255549":"A New Forward-Secure Digital Signature Scheme","220334748":"Efficient Group Signatures without Trapdoors.","221326798":"A Group Signature Scheme with Improved Efficiency"},"citedIn":{"220166252":"On the Security of Two Group Signature Schemes with Forward Security.","242286565":"EDITORIAL BOARDS, PUBLISHING COUNCIL","245463021":"An efficient forward secure group signature scheme with revocation","257296248":"A secure electronic cash based on a certificateless group signcryption scheme","3156607":"GSIS: A Secure and Privacy-Preserving Protocol for Vehicular Communications"},"index":768}