{"abs":"There is an ever increasing need to use optimization methods for thermal design of data centers and the hardware populating them. Airflow simulations of cabinets and data centers are computationally intensive and this problem is exacerbated when the simulation model is integrated with a design optimization method. Generally speaking, thermal design of data center hardware can be posed as a constrained multi-objective optimization problem. A popular approach for solving this kind of problem is to use Multi-Objective Genetic Algorithms (MOGAs). However, the large number of simulation evaluations needed for MOGAs has been preventing their applications to realistic engineering design problems. In this paper, details of a substantially more efficient MOGA are formulated and demonstrated through a thermal analysis simulation model of a data center cabinet. First, a reduced-order model of the cabinet problem is constructed using the Proper Orthogonal Decomposition (POD). The POD model is then used to form the objective and constraint functions of an optimization model. Next, this optimization model is integrated with the new MOGA. The new MOGA uses a “kriging” guided operation in addition to conventional genetic algorithm operations to search the design space for global optimal design solutions. This approach for optimal design is essential to handle complex multi-objective situations, where the optimal solutions may be non-obvious from simple analyses or intuition. It is shown that in optimizing the data center cabinet problem, the new MOGA outperforms a conventional MOGA by estimating the Pareto front using 50% fewer simulation calls, which makes its use very promising for complex thermal design problems.","title":"Optimizing thermal design of data center cabinets with a new multi-objective genetic algorithm","id":226700488,"url":"https://www.researchgate.net/publication/226700488_Optimizing_thermal_design_of_data_center_cabinets_with_a_new_multi-objective_genetic_algorithm","names":["G. Li","M. Li","S. Azarm","J. Rambo","Y. Joshi","Distributed and Parallel Databases"],"references":{"216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","228858082":"A Kriging Metamodel Assisted Multi-Objective Genetic Algorithm for Design Optimization","221024234":"Surrogate Deterministic Mutation: Preliminary Results","238184565":"An Efficient Pareto Set Identification Approach for Multi-Objective Optimization on Black-Box Functions","221529267":"The Spatial Correlation Function Approach to Response Surface Estimation.","51992529":"Computational Methods in Fluid Dynamics","229563172":"Response surface approximations for structural optimization","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","226482930":"On Improving Multiobjective Genetic Algorithms for Design Optimization","242360316":"Genetic Algorithms in Search","3810165":"Genetic crossover strategy using an approximation concept","257334727":"Approximation methods in multidisciplinary analysis and optimization: A panel discussion","201976347":"Genetic Algorithms in Search, Optimization","220692275":"Non-Linear Programming, Theory and Algorithms","267016446":"Principles of Optimal Design: Modeling and Computation","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","227085212":"Approximation Concepts for Optimum Structural Design -A Review","38363487":"The Design and Analysis of Computer Experiments","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","216300861":"A Taxonomy of Global Optimization Methods Based on Response Surfaces","27530424":"Reduced-Order Modeling of Multiscale Turbulent Convection: Application to Data Center Thermal Management","243625370":"Introduction to Optimal Design","226664743":"Approximation Methods in Multiobjective Programming","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","244476021":"Optimization Concepts and Applications in Engineering","221669727":"Nonlinear Programming. Theory and Algorithms","226736744":"Approximation of multiresponse deterministic engineering simulations: A dependent metamodeling approach","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","238121887":"Computational Fluid Dynamics Modeling of High Compute Density Data Centers to Assure System Inlet Air Specifications","230873325":"Control of flow separation over a forward-facing step by model reduction","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","271644099":"Introduction To Optimum Design","242356870":"Adaptation In Natural And Artificial Systems","245350889":"Thermal Performance Metrics for Arranging Forced Air Cooled Servers in a Data Processing Cabinet","227109822":"Constraint handling improvements for multiobjective genetic algorithms","31679323":"Introduction to optimum design / J.S. Arora.","220045412":"Adoption in Natural and Artificial System","245373210":"Boundary Optimal Control of Natural Convection by Means of Mode Reduction","2446494":"Adaptive Penalty Methods For Genetic Optimization Of Constrained Combinatorial Problems","264959862":"Computational Methods for Fluid Dynamics","3954114":"Thermal considerations in cooling large scale high compute density data centers. In: ITHERM, San Diego, CA, USA","229131607":"Reduction of modes for the control of viscous flows"},"citedIn":{"225386830":"A nonlinear interval-based optimization method with local-densifying approximation technique","280296983":"Energy efficient thermal management of data centers via open multi-scale design: A review of research questions and approaches","228858082":"A Kriging Metamodel Assisted Multi-Objective Genetic Algorithm for Design Optimization","267489015":"An Improved Kriging Assisted Multi-Objective Genetic Algorithm","282532383":"Derivative-Free Techniques for Multiobjective Structural Optimization: A Review","257423101":"Data Mining of Pareto-Optimal Transonic Airfoil Shapes Using Proper Orthogonal Decomposition","270794249":"Airflow and temperature distribution optimization in data centers using artificial neural networks","245426413":"Geometric Filtration Using Proper Orthogonal Decomposition for Aerodynamic Design Optimization","224123606":"Uncovering energy-efficiency opportunities in data centers","245367022":"Multiobjective Collaborative Robust Optimization With Interval Uncertainty and Interdisciplinary Uncertainty Propagation","270308044":"Optimization via FENSAP-ICE of aircraft hot-air anti-icing systems","262363218":"EnergIT: A Methodology for the Incremental Green Design of Data Centers","283025167":"Coordinated real-time management of return-air-temperature-controlled cooling units in data centers","225691072":"Improving multi-objective genetic algorithms with adaptive design of experiments and online metamodeling","237771288":"Geometric Filtration Using POD for Aerodynamic Design Optimization","261417473":"Multi-objective optimization of temperature distributions using Artificial Neural Networks","260165268":"A review of data center cooling technology, operating conditions and the corresponding low-grade waste heat recovery opportunities","50252998":"Energy efficient thermal management of data centers via open multi-scale design","4342362":"Optimization of cluster cooling performance for data centers","267582346":"Thermal Performance of an Air-Cooled Micro-Grooved Heat Sink","254045213":"Kriging assisted on-line torque calculation for brushless DC motors used in electric vehicles","269050868":"Design optimization of hot-air anti-icing systems by FENSAP-ICE","221163664":"A kriging assisted direct torque control of brushless DC motor for electric vehicles","266658107":"A survey on sustainability in ICT: a computing perspective"},"index":771}