{"abs":"Most surrogate approaches to multi-objective optimization build a surrogate model for each objective. These surrogates can be used inside a classical Evolutionary Multiobjective Optimization Algorithm (EMOA) in lieu of the actual objectives, without modifying the underlying EMOA; or to filter out points that the models predict to be uninteresting. In contrast, the proposed approach aims at building a global surrogate model defined on the decision space and tightly characterizing the current Pareto set and the dominated region, in order to speed up the evolution progress toward the true Pareto set. This surrogate model is specified by combining a One-class Support Vector Machine (SVMs) to characterize the dominated points, and a Regression SVM to clamp the Pareto front on a single value. The resulting surrogate model is then used within state-of-the-art EMOAs to pre-screen the individuals generated by application of standard variation operators. Empirical validation on classical MOO benchmark problems shows a significant reduction of the number of evaluations of the actual objective functions.","title":"A Mono Surrogate for Multiobjective Optimization","id":43797802,"url":"https://www.researchgate.net/publication/43797802_A_Mono_Surrogate_for_Multiobjective_Optimization","names":["Ilya Loshchilov","Marc Schoenauer","Michèle Sebag"],"references":{"220499623":"Estimating Support of a High-Dimensional Distribution","5303060":"Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","221024596":"Meta-Modeling in Multiobjective Optimization","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","209436387":"A Tutorial on Support Vector Regression","45622657":"Statistical Learning Theory","239062948":"PESA-II: Region-based selection in evolutionary multiobjective optimization","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II"},"citedIn":{"277023714":"Necessary and Sufficient Conditions for Surrogate Functions of Pareto Frontiers and Their Synthesis Using Gaussian Processes","220776522":"Local Meta-models for ASM-MOMA","262174212":"Meta-learning and Model Selection in Multi-objective Evolutionary Algorithms","277278208":"On the Performance of Classification Algorithms for Learning Pareto-Dominance Relations","254462092":"Surrogate Modeling in the Evolutionary Optimization of Catalytic Materials","257352368":"Aggregate meta-models for evolutionary multiobjective and many-objective optimization","262323269":"A Surrogate Based Multiobjective Evolution Strategy with Different Models for Local Search and Pre-Selection","287207350":"A Novel Constraint Handling Strategy for Expensive Optimization Problems","261202557":"An Evolutionary Strategy for Surrogate-Based Multiobjective Optimization","259170620":"How can surrogates influence the convergence of evolutionary algorithms?","287207342":"Selective evaluation in multiobjective optimization: A less explored avenue","282322659":"On the Performance of Classification Algorithms for Learning Pareto-Dominance Relations","266656309":"Hypervolume-based local search in multi-objective evolutionary optimization","43797807":"A Pareto-Compliant Surrogate Approach for Multiobjective Optimization","220981336":"Improving many-objective optimizers with aggregate meta-models","259874798":"Reducing the Computational Cost in Multi-objective Evolutionary Algorithms by Filtering Worthless Individuals","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","261054008":"Surrogate model selection for evolutionary multiobjective optimization","281327709":"Dominance-Based Pareto-Surrogate for Multi-Objective Optimization","283685586":"A fuzzy based approach for fitness approximation in multi-objective evolutionary algorithms","281675312":"Surrogate model-based optimization for the headform design of an axisymmetric body","46888631":"Lecture Notes in Computer Science","262354718":"Multiobjectivization for classifier parameter tuning","224246979":"ASM-MOMA: Multiobjective memetic algorithm with aggregate surrogate model"},"index":773}