{"abs":"This paper presents a system for visualization of large amounts of new stories. In the first phase, the new stories are preprocessed for the purpose of name -entity extraction. Next, a graph of relationships between the extracted name entities is created, where each name entity represents one vertex in the graph and two name entities are connected if they appear in the same document. The graph of entities is presented as a local neighborhood enriched with additional contextual information in the form of characteristic keywords and related name entities connected to the entity in the focus. Operations for browsing a graph are implemented to be efficient enabling quick capturing of large amounts of information present in the original text.","title":"Visualization of news articles","id":228780474,"url":"https://www.researchgate.net/publication/228780474_Visualization_of_news_articles","names":["Marko Grobelnik","Dunja Mladenić","Informatica"],"references":{"200111340":"Speech and Natural Language Processing: An Introduction to Natural Language Processing, Computational Linguistics, and Speech Recognition","3410951":"Themeriver: Visualizing Thematic Changes in Large Document Collections","246035693":"Efficient Visualization of Large Text Corpora","200111050":"Mining the Web: Analysis of Hypertext and Semi Structured Data","2479311":"Semantic Visualization","200045863":"Foundations of Statistical Natural Language Processing","202921157":"Information Visualization in Data Mining and Knowledge Discovery","4261036":"Visualization of Knowledge Structures"},"citedIn":{"229669747":"Semantic Web Technologies: Trends and Research in Ontology-based Systems","220434656":"Exploiting Corpus-Related Ontologies for Conceptualizing Document Corpora","220854061":"IVEA: An Information Visualization Tool for Personalized Exploratory Document Collection Analysis","239552513":"On Two Web IR Boosting Tools: Clustering and Ranking","221101227":"Exploiting Gene Ontology to Conceptualize Biomedical Document Collections","228659910":"Knowledge Discovery for Semantic Web","222244344":"Semantically enhanced Information Retrieval: An ontology-based approach","43049464":"A knowledge-driven approach to biomedical document conceptualization","237527170":"This document is part of a research project partially funded by the IST Programme of the Commission of the European Communities as project number IST2004-026460","224651241":"Using DMoz for constructing ontology from data stream","4266667":"Context-Aware Informative Display","265227650":"SEMI-AUTOMATIC ONTOLOGY CONSTRUCTION","282248031":"Multidimensional Visualization of News Articles","220166448":"Visualization of Text Document Corpus.","220363565":"Automated knowledge discovery in advanced knowledge management","262390899":"Visualizing sentiment: do you see what i mean?","220320691":"Visualisation of Online Discussion Forums","251913520":"Network Modeling and Visualization System Based on Chinese Text","242286565":"EDITORIAL BOARDS, PUBLISHING COUNCIL","224042159":"Extending Ontologies for Annotating Business News","242231145":"WP 2: Requirements Analysis D3 State-of-the-art analysis, and report on the outcome of the state-of-the-art workshop","221653293":"Visual analysis of documents with semantic graphs","221157909":"Revealing Hidden Community Structures and Identifying Bridges in Complex Networks: An Application to Analyzing Contents of Web Pages for Browsing","221158709":"A Concept-Driven Automatic Ontology Generation Approach for Conceptualization of Document Corpora"},"index":775}