{"abs":"Multi-objective optimization of any complex industrial process using first principle computationally expensive models often demands a substantially higher computation time for evolutionary algorithms making it less amenable for real time implementation. A combination of the above-mentioned first principle model and approximate models based on artificial neural network (ANN) successively learnt in due course of optimization using the data obtained from first principle models can be intelligently used for function evaluation and thereby reduce the aforementioned computational burden to a large extent. In this work, a multi-objective optimization task (simultaneous maximization of throughput and Tumble index) of an industrial iron ore induration process has been studied to improve the operation of the process using the above-mentioned metamodeling approach. Different pressure and temperature values at different points of the furnace bed, grate speed and bed height have been used as decision variables whereas the bounds on cold compression strength, abrasion index, maximum pellet temperature and burn-through point temperature have been treated as constraints. A popular evolutionary multi-objective algorithm, NSGA II, amalgamated with the first principle model of the induration process and its successively improving approximation model based on ANN, has been adopted to carry out the task. The optimization results show that as compared to the PO solutions obtained using only the first principle model, (i) similar or better quality PO solutions can be achieved by this metamodeling procedure with a close to 50% savings in function evaluation and thereby computation time and (ii) by keeping the total number of function evaluations same, better quality PO solutions can be obtained.","title":"Successive approximate model based multi-objective optimization for an industrial straight grate iron ore induration process using evolutionary algorithm","id":232362088,"url":"https://www.researchgate.net/publication/232362088_Successive_approximate_model_based_multi-objective_optimization_for_an_industrial_straight_grate_iron_ore_induration_process_using_evolutionary_algorithm","names":["Kishalay Mitra","Sushanta Majumder","Chemical Engineering Science"],"references":{"233629676":"Genetic Algorithms in Materials Design and Processing","220340771":"Virtual indurator: A tool for simulation of induration of wet iron ore pellets on a moving grate","230069044":"Model and Simulation of a Ported Kiln for Iron Oxide Pellet Induration","279622574":"DYNAMIC MATHEMATICAL MODEL OF SINTERING PROCESS.","249072094":"A Paradigm for the Scheduling of a Continuous Walking Beam Reheat Furnace Using a Modified Genetic Algorithm","249072095":"Multiobjective Pareto Optimization of an Industrial Straight Grate Iron Ore Induration Process Using an Evolutionary Algorithm","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","223844318":"Multi-objective optimization in dynamics of the structures with nonlinear behavior: Contributions of the metamodels","228453399":"Evaluation of Injection Island GA Performance on Flywheel Design Optimisation","223540185":"A procedure for the design and evaluation of decentralised and model-based predictive multivariable controllers for a pellet cooling process","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","2748217":"Managing Approximation Models in Optimization","233710207":"Genetic algorithms in these changing steel times","2333106":"Simulated Binary Crossover for Continuous Search Space","220998589":"Fitness inheritance in genetic algorithms","248688065":"Multidisciplinary Design Optimization: State of the Art","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","228767803":"A minimal cost hybrid strategy for pareto optimal front approximation","233588086":"Modelling of a Pilot Scale Iron Ore Pellet Induration Furnace","220694713":"Statistical Learning Theory","3419050":"A Simulated Annealing-Based Multiobjective Optimization Algorithm: AMOSA","2342018":"GenJam: A Genetic Algorithm for Generating Jazz Solos","3904026":"An efficient genetic algorithm with less fitness evaluation by clustering","3949464":"The self-adaptive Pareto differential evolution algorithm","233229763":"Control of Meniscus-Level Fluctuation by Optimization of Spray Cooling in an Industrial Thin Slab Casting Machine Using a Genetic Algorithm","226106204":"On Model-Based Evolutionary Computation","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","220230663":"Iterative radial basis functions neural networks as metamodels of stochastic simulations of the quality of search engines in the World Wide Web","222415210":"Multiobjective robust optimization method for drawbead design in sheet metal forming","221277596":"A Multiobjective Ant Colony System for Vehicle Routing Problem with Time Windows.","222510958":"Towards a better understanding of the epoxy-polymerization process using multi-objective evolutionary computation","238643336":"Jumping gene adaptations of NSGA-II and their use in the multi-objective optimal design of shell and tube heat exchangers","3904009":"PDE: A Pareto-frontier differential evolution approach for multi-objective optimization problems","223893099":"Multiobjective optimization of multi-cell sections for the crashworthiness design","222071562":"Design and multi-objective optimization of heat exchangers for refrigerators. Appl Therm Eng","229707789":"Pareto simulated annealing- A metaheuristic technique for multiple-objective combinatorial optimization","2489625":"Don\u0027t Evaluate, Inherit","280019214":"“Mathematical Model of Grate-Kiln-Cooler Process Used for Induration of Iron Ore Pellets”","229760368":"Selection of Catalyst for the Esterification Step of the PPT Polymerization Process","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","220199385":"A systematic comparison of metamodeling techniques for simulation optimization in Decision Support Systems","221024234":"Surrogate Deterministic Mutation: Preliminary Results","268314804":"Genetic algorithms in ferrous production metallurgy","220701677":"Accelerating the Convergence of Evolutionary Algorithms by Fitness Landscape Approximation.","234493232":"Calculation of compressible turbulent boundary layers on straight-tapered swept wings","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","222682121":"Towards resilient supply chains: Uncertainty analysis using fuzzy mathematical programming","225687230":"A computationally efficient metamodeling approach for expensive multiobjective optimization. Optim Eng 9:37-67","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","273125513":"Fluid Flow Through Packed Columns","228591342":"A neural network based generalized response surface multiobjective evolutionary algorithm","3810165":"Genetic crossover strategy using an approximation concept","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","289954844":"Genetic algorithm based heat transfer analysis of a bloom re-heating furnace","245281993":"Common Misconceptions about Neural Networks as Approximators","222653468":"A comparative study of metamodeling methods for multiobjective crashworthiness optimization","233606583":"Genetic algorithms in polymeric material production, design, processing and other applications: A review","234797221":"Radial Basis Functions for Multivariable Interpolation","222658585":"Optimized species growth in epoxy polymerization with real-coded NSGA-II","233870892":"A Framework for Evolutionary Optimization with Approximate Fitness Functions","245435132":"Response Surface and Neural Network Techniques for Rocket Engine Injector Optimization","236822466":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","229380813":"Development and validation of a mathematical model for the moving grate induration of iron ore pellets","245366398":"Analysis of Support Vector Regression for Approximation of Complex Engineering Analyses","226236696":"Simulation-Based Optimization Using Computational Intelligence","230354655":"Kinetic Analysis and Optimization for the Catalytic Esterification Step of PPT Polymerization","220743247":"Multi-objective Optimisation Of Rolling Rod Product Design Using Meta-modelling Approach.","223031724":"Multiobjective Optimization of an Industrial Grinding Operation Using Elitist Nondominated Sorting Genetic Algorithm","233324419":"Mathematical Modeling and Optimization of Two-Layer Sintering Process for Sinter Quality and Fuel Efficiency Using Genetic Algorithm","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","2532946":"Fitness Inheritance in Multi-Objective Optimization","223885357":"Robust tools for prediction of variability and optimization in structural dynamics","243767164":"Regularization Networks and Support Vector Machines","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","250161042":"Prediction of Iron Ore Pellet Strength Using Artificial Neural Network Model","220391260":"Regularization Networks and Support Vector Machines"},"citedIn":{"283255314":"Comparative study of surrogate approaches while optimizing computationally expensive reaction networks","291389359":"Optimization of iron ore sintering process based on ELM model and multi-criteria evaluation","278320754":"Robust Multi-Objective Genetic Algorithm (RMOGA) with Online Approximation under Interval Uncertainty","263679522":"Multi-Objective Optimization of Bulk Vinyl Acetate Polymerization with Branching","258048879":"Multi-Objective Optimization Applications in Chemical Engineering"},"index":779}