{"abs":"The aim of this work is to predict the failure probability of a locking system. This failure probability is assessed using complementary methods: the First-Order Reliability Method (FORM) and Second-Order Reliability Method (SORM) as approximated methods, and Monte Carlo simulations as the reference method. Both types are implemented in a specific software [Phimeca software. Software for reliability analysis developed by Phimeca Engineering S.A.] used in this study. For the Monte Carlo simulations, a response surface, based on experimental design and finite element calculations [Abaqus/Standard User’s Manuel vol. I.], is elaborated so that the relation between the random input variables and structural responses could be established. Investigations of previous reliable methods on two configurations of the locking system show the large sturdiness of the first one and enable design improvements for the second one.","title":"Reliability assessment of locking systems","id":229389026,"url":"https://www.researchgate.net/publication/229389026_Reliability_assessment_of_locking_systems","names":["N. Mealier","F. Dau","L. Guillaumat","P. Arnoux","Probabilistic Engineering Mechanics"],"references":{"221669750":"A Rapidly Convergent Descent Method for Minimization","223326063":"Structural reliability assessment based on particle swarm optimization","223066058":"Efficient parallel genetic algorithms: Theory and practice","220136378":"Matsumoto M, Nishimura T.. Mersenne twister: a 623-dimensionally equidistributed uniform pseudo-random number generator. ACM Trans Model Comp Simul (TOMACS) 8: 3-30","229378080":"Linearized mechanical model to evaluate reliability of offshore structures","222423661":"An improved response surface method for the determination of failure probability and importance measures","223521821":"The effect of corrosion on the structural reliability of steel offshore structures","229348132":"Probabilistic assessment of thermal fatigue in nuclear components","245194575":"Failure probability assessment of wall-thinned nuclear pipes using probabilistic fracture mechanics","225805894":"Asymptotic approximations for multinormal domain and surface integrals","223416196":"“Response surface method using vector projeted sampling points”","245210410":"Structural reliability analysis using a standard deterministic finite element code","223829472":"Seismic fragility analysis of 3D structures","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","222182247":"Structural reliability software at the University of California, Berkeley","236660930":"Fiabilité des Structures. Couplage Mécano-Fiabiliste Statique","266518872":"A New Beta-Point Algorithm for Large Time-Invariant and Time-Variant Reliability Problems","265682441":"Probabilistic Reliability — An Engineering Approach","275188793":"Asymptotic Approximations for Multinormal Integrals","215877153":"Mersenne Twister: A 623-dimensionally equidistributed uniform pseudorandom number generator","37614402":"Fuzzy Adaptive Search Method for Parallel Genetic Algorithm with Island Combination Process"},"citedIn":{"47619486":"Study on interlock 3X damage mechanisms under impact loading using a deformable impactor","272264930":"An Evidence Theory-based Algorithm for System Reliability Evaluation under Mixed Aleatory and Epistemic Uncertainties"},"index":781}