{"abs":"Hybridizing metaheuristic approaches becomes a common way to improve the efficiency of optimization methods. Many hybridizations deal with the combination of several optimization methods. In this paper we are interested in another type of hybridization, where datamining approaches are combined within an optimization process. Hence, we propose to study the interest of combining metaheuristics and datamining through a short survey that enumerates the different opportunities of such combinations based on literature examples.","title":"Using Datamining Techniques to Help Metaheuristics: A Short Survey","id":29637721,"url":"https://www.researchgate.net/publication/29637721_Using_Datamining_Techniques_to_Help_Metaheuristics_A_Short_Survey","names":["Laetitia Jourdan","Clarisse Dhaenens","El-Ghazali Talbi","Lecture Notes in Computer Science"],"references":{"225810423":"Lecture Notes in Computer Science","268200953":"On Improving Evolutionary Algorithms by Using Data Mining for the Oil Collector Vehicle Routing Problem","221411188":"Hybridization of GRASP Metaheuristics with Data Mining Techniques.","235948313":"Speeding Up Evolution through Learning: LEM","2307817":"Toward Civilized Evolution: Developing Inhibitions","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","220701931":"From Recombination of Genes to the Estimation of Distributions I. Binary Parameters.","221345340":"An Advanced Evolution Should Not Repeat its Past Errors.","4201678":"Improvements to the scalability of multiobjective clustering","220375153":"A New Representation and Operators for Genetic Algorithms Applied to Grouping Problems","221411175":"A Hybrid Multi-Objective Evolutionary Algorithm Using an Inverse Neural Network.","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","221605731":"The Multi-Purpose Incremental Learning System AQ15 and Its Testing Application to Three Medical Domains.","228393290":"Extraction de Connaissances pertinentes sur le comportement des systèmes de production: une approche conjointe par Optimisation Évolutionniste via …","221228472":"Preliminary Investigation of the `Learnable Evolution Model\u0027 for Faster/Better Multiobjective Water Systems Design","4026346":"Learning for evolutionary design","220553082":"Combining an evolutionary algorithm with data mining to solve a single-vehicle routing problem","220403587":"Simultaneously Applying Multiple Mutation Operators in Genetic Algorithms.","3904026":"An efficient genetic algorithm with less fitness evaluation by clustering","2361862":"BOA: The Bayesian Optimization Algorithm","220381121":"Clustering with a Genetically Optimized Approach","221900765":"Fast Algorithms for Mining Association Rules in Large Databases","220885647":"Toward Civilized Evolution: Developing Inhibitions.","2498560":"Case-Based Initialization of Genetic Algorithms","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","221411221":"A Hybrid GRASP with Data Mining for the Maximum Diversity Problem","225127875":"Partially Evaluated Genetic Algorithm Based on Fuzzy c-Means Algorithm","4074964":"Genetic learning from experience","2460430":"Fast Algorithms for Mining Association Rules","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","220801031":"Controlling Evolution by Means of Machine Learning.","220231695":"Cultural algorithms: Computational modeling of how cultures learn to solve problems: An engineering example","225364702":"A Taxonomy of Hybrid Metaheuristics","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","225182237":"Controlling Crossover through Inductive Learning","243764278":"Selection of most representative training examples and incremental generation of VL1 hypotheses: The underlying methodology and the description of programs ESEL and AQ11","4116940":"Gene trajectory clustering with a hybrid genetic algorithm and expectation maximization method","220867544":"Clustering Nominal and Numerical Data: A New Distance Concept for a Hybrid Genetic Algorithm","220121258":"Hybridization of GRASP Metaheuristic with Data Mining Techniques","216301009":"Estimation Distribution Algorithms: A New Tool for Evolutionary Computation","220606416":"A Novel Hybrid Framework of Coevolutionary GA and Machine Learning.","4133319":"Hybridising rule induction and multi-objective evolutionary search for optimising water distribution systems","2333082":"Using Case-Based Learning to Improve Genetic-Algorithm-Based Design Optimization","220801107":"Using cultural algorithms for constraint handling in GENOCOP","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","220343454":"Learnable Evolution Model: Evolutionary Processes Guided by Machine Learning."},"citedIn":{"257200119":"Evolutionary Computation Meets Machine Learning: A Survey","256720793":"Investigating Smart Sampling as a population initialization method for Differential Evolution in continuous problems","253884068":"METAHEURISTIC HYBRIDIZATION WITH GRASP","262217815":"Evolutionary approach for automated component-based decision tree algorithm design","262233705":"Data-Mining-Driven Neighborhood Search","225122562":"Hybrid GRASP heuristics","257492800":"Combining metaheuristics with mathematical programming, constraint programming and machine learning","47329560":"Métaheuristiques Coopératives : du déterministe au stochastique","257196079":"Synergies between operations research and data mining: The emerging use of multi-objective approaches","280105966":"Guiding Evolutionary Search with Association Rules for Solving Weighted CSPs","232414310":"Facing dynamic optimization using a cooperative metaheuristic configured via fuzzy logic and SVMs","225106996":"Evolutionary multi objective optimization for rule mining: A review"},"index":785}