{"abs":"This paper uncovers and explores the close relationship between Monte Carlo Optimization of a parametrized integral (MCO), Parametric machine-Learning (PL), and `blackbox\u0027 or `oracle\u0027-based optimization (BO). We make four contributions. First, we prove that MCO is mathematically identical to a broad class of PL problems. This identity potentially provides a new application domain for all broadly applicable PL techniques: MCO. Second, we introduce immediate sampling, a new version of the Probability Collectives (PC) algorithm for blackbox optimization. Immediate sampling transforms the original BO problem into an MCO problem. Accordingly, by combining these first two contributions, we can apply all PL techniques to BO. In our third contribution we validate this way of improving BO by demonstrating that cross-validation and bagging improve immediate sampling. Finally, conventional MC and MCO procedures ignore the relationship between the sample point locations and the associated values of the integrand; only the values of the integrand at those locations are considered. We demonstrate that one can exploit the sample location information using PL techniques, for example by forming a fit of the sample locations to the associated values of the integrand. This provides an additional way to apply PL techniques to improve MCO.","title":"Parametric Learning and Monte Carlo Optimization","id":1885790,"url":"https://www.researchgate.net/publication/1885790_Parametric_Learning_and_Monte_Carlo_Optimization","names":["David H. Wolpert","Dev G. Rajnarayan"],"references":{"228940071":"Cross-Entropy Method","220343904":"Stacked Regressions","222645697":"Optimization with Randomized Search Heuristics -- The (A)NFL Theorem, Realistic Scenarios, and Difficult Functions","220691042":"Practical Optimization","263903730":"ADVANCES IN DISTRIBUTED OPTIMIZATION USING PROBABILITY COLLECTIVES","230675255":"Bayesian Theory","230675253":"Statistical Decision Theory and Bayesian Analysis. Springer, New York","228752873":"TCS \u0026 DISTRIBUTED OPTIMIZATION","220118677":"Optimization by Simulated Annealing","2793063":"Monte Carlo Optimization and Path Dependent Nonstationary Laws of Large Numbers","221620027":"MIMIC: Finding Optima by Estimating Probability Densities.","2458795":"Improved Boosting Using Confidence-rated Predictions","5595969":"The Nature Of Statistical Learning Theory","222449622":"A New Algorithm for Adaptive Multidimensional Integration","3464097":"Practical Optimization","2810172":"Reconciling Bayesian And Non-Bayesian Analysis","2944442":"Product Distribution Theory for Control of Multi-Agent Systems","220499965":"On Bias Plus Variance","3418856":"Coevolutionary Free Lunches","2830262":"No Free Lunch and Free Leftovers Theorems for Multiobjective Optimisation Problems","248818761":"The application of Bayesian methods for seeking the extremum","2576903":"Selective Sampling Using the Query by Committee Algorithm","245942984":"Discrete, Continuous, and Constrained Optimization Using Collectives","4143196":"Distributed control by Lagrangian steepest descent","256231841":"Numerical optimization","1941944":"Information Theory - The Bridge Connecting Bounded Rational Game Theory and Statistical Physics","2564354":"The No Free Lunch and Problem Description Length","222467943":"Stacked Generalization","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","1937588":"Product Distribution Field Theory","221617820":"Bayesian Monte Carlo","220121396":"A No-Free-Lunch Theorem for Non-Uniform Distributions of Target Functions","248820474":"VEGAS – An Adaptive Multi-Dimensional Integration Program","4674216":"Fleet Assignment Using Collective Intelligence","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","37992055":"Analysis of Perceptron-Based Active Learning","245955677":"Distributed Constrained Optimization with Semicoordinate Transformations","220695762":"InformationTheory, Inference, and Learning Algorithms","45622656":"Monte Carlo Statistical Methods","3418509":"Macready, W.G.: No Free Lunch Theorems for Optimization. IEEE Transactions on Evolutionary Computation 1(1), 67-82","236736807":"Estimation of Dependences Based on Empirical Data","2944400":"Adaptive, Distributed Control of Constrained Multi-Agent Systems","24059987":"Extremes and related properties of random sequences and processes"},"citedIn":{"224108862":"Sequentially updated Probability Collectives","2209222":"Bias-Variance Techniques for Monte Carlo Optimization: Cross-validation for the CE Method","241780142":"Exploiting Parametric Learning to Improve BlackBox Optimization","241871971":"Probability Collectives for Optimization of Computer Simulations","228313266":"Statistical Prediction of the Outcome of a Noncooperative Game","2209224":"Bias-Variance Tradeoffs: Novel Applications","228712812":"Statistical prediction of the outcome of a game","220701930":"Fitness Expectation Maximization","251931210":"A Multifidelity Gradient-Free Optimization Method and Application to Aerodynamic Design","220149377":"On clonal selection","242200576":"Preliminary Results of Applying Probability Collectives to Multi-Objective Optimisation Problems","254846719":"Optimization Under Uncertainty Using Probability Collectives"},"index":787}