{"abs":"A generalization of the group screening technique for finding the non-negligible factors in a first order model is presented. In conventional screening designs, each factor is assigned to a single factor group, and the sum of effects associated with each group is estimated in the first stage. The new designs assign a factor to multiple groups in the first stage. An individual effect is estimated in the second stage only if each group to which the corresponding factor is assigned is “active” in the first stage. The performance of these designs is compared to conventional group screening designs for cases in which the direction of each factor, if active, is assumed known a priori and measurement error is negligible.","title":"Two-stage factor screening procedures using multiple grouping assignments","id":243049167,"url":"https://www.researchgate.net/publication/243049167_Two-stage_factor_screening_procedures_using_multiple_grouping_assignments","names":["Max D. Morris","Communication in Statistics- Theory and Methods"],"references":{"216301388":"Random Balance Experimentation","242611503":"A Study of the Group Screening Method","254332450":"The Performance of Two-Stage Group Screening in Factor Screening Experiments","239557980":"Group-Screening with More Than Two Stages","233119806":"Two-stage group-screening designs with equal prior probabilities and no errors in decisions","38368084":"The Detection of Defective Members of Large Population"},"citedIn":{"221529877":"Searching For Important Factors: Sequential Bifurcation Under Uncertainty","277726092":"Array-based schemes for group screening with test errors which incorporate a concentration effect","267080969":"Screening. Methods for experimentation in industry, drug dicovery, and genetics","282442098":"Screening for important factors in large-scale simulation models: some industrial experiments","221524958":"Using Morris Randomized Oat Design as a Factor Screening Method for Developing Simulation Metamodels.","222479470":"Searching for important factors in simulation models with many factors: Sequential bifurcation","243042867":"Sensitivity Analysis and Related Analyses: A Review of Some Statistical Techniques","228570286":"k -Circulant Supersaturated Designs","216301661":"Screening, Predicting, and Computer Experiments","233138271":"Multi-stage step-wise group screening","4772052":"Detection of interactions in experiments on large numbers of factors","4111714":"Using Morris\u0027 randomized OAT design as a factor screening method for developing simulation metamodels","4785428":"Sensitivity analysis and related analysis : a survey of statistical techniques"},"index":789}