{"abs":"In this project a stochastic method for general purpose optimization and machine learning is described. The method is derived from basic information-theoretic principles and generalizes the popular Cross Entropy method. The effectiveness of the method as a tool for statistical modeling and Monte Carlo simulation is demonstrated with an application to the problems of density estimation and data modeling.","title":"Stochastic Methods for Optimization and Machine Learning","id":37618619,"url":"https://www.researchgate.net/publication/37618619_Stochastic_Methods_for_Optimization_and_Machine_Learning","names":["Zdravko I. Botev"],"references":{"228940071":"Cross-Entropy Method","3649973":"Information theory and statistics","50336131":"Information Theory And Statistics","42635916":"Mathematical Theory of Communication","261586064":"A Comparative Study of Kernel-Based Density Estimates for Categorical Data","226538122":"A Stochastic Minimum Cross-Entropy Method for Combinatorial Optimization and Rare-event Estimation*","232128602":"Quantification method of classification processes. Concept of structural a -entropy","2753700":"A Reflective Newton Method for Minimizing a Quadratic Function Subject to Bounds on Some of the Variables","224817256":"An Alternative Method of Cross-Validation for the Smoothing of Density Estimate","245976499":"Duality Relationships for Entropy-Like Minimization Problems","242380015":"Practical methoff~ of optimization","220694713":"Statistical Learning Theory","216300613":"Practical Methods of Optimization","261625017":"Density Estimation for Statistics and Data Analysis","268778147":"Four families of measures of entropy","3113608":"Generalized maximum entropy principle","228989452":"The Cross-Entropy Method for Estimation","200744518":"Sequential Monte-Carlo Methods in Practice","242997065":"Asymptotically optimal bandwidth selection rules for the kernel density estimator with dependent observations","246972427":"Nonparametric Density Estimation: The L1 View","38358909":"On Bandwidth Variation in Kernel Estimates-A Square Root Law","23631185":"A Study on Bandwidth Selection in Density Estimation under Dependence","38359408":"Data-Driven Bandwidth Choice for Density Estimation Based on Dependent Data","45622657":"Statistical Learning Theory","265873121":"New non-additive measures of entropy for discrete probability distributions","227424308":"Integrated consistency of smoothed probability density estimators for stationary sequences","3193611":"Probability density estimation from optimally condensed data samples","38359925":"An Asymptotically Efficient Solution to the Bandwidth Problem of Kernel Density Estimation","220022177":"On measures of information and entropy","268242881":"An Introduction to the Calculus of Variations","232953122":"A comparative study of some kernel-based nonparametric density estimators","38359688":"Variable Kernel Density Estimation","261655387":"Smoothing Methods in Statistics","38367114":"Remarks on Some Non-Parametric Estimates of a Density Function","31448216":"Multivariate Binary Discrimination by the Kernel Method","246471678":"Information Measures-Information and its Description in Science and Engineering","257842193":"On a New Quantitative – Qualitative Measure of Information","222302352":"Novelty detection employing an L2 optimal non-parametric density estimator","38359192":"An Asymptotically Optimal Window Selection Rule for Kernel Density Estimates","38357528":"Bias Reduction in Kernel Density Estimation by Smoothed Empirical Transformations","243096494":"Dual Methods in Entropy Maximization. Application to Some Problems in Crystallography","237127798":"Entropy Optimization Principles With Applications","236736832":"Convex Analysis and Nonlinear Optimization: Theory and Examples","243769062":"In All Likelihood: Statistical Modelling and Inference Using Likelihood","224817413":"A Reliable Data-Based Bandwidth Selection Method for Kernel Density Estimation","224839810":"An Introduction to the Boot-Strap","234814104":"A mathematical theory of communication. AT\u0026T Tech J","38348462":"Loader, C.: Bandwidth selection: Classical or plug-in? Ann. Stat. 27, 415-438","224817409":"Multivariate Density Estimation: Theory, Practice, and Visualization, Second Edition","200524441":"On Measures of Entropy and Information, Proc","38359586":"Bandwidth Selection for Kernel Density Estimation","38348837":"On bandwidth choice for density estimation with dependent data. The Annals of Statistics, 23(6), 2241-2263","38359588":"A Simple Root $n$ Bandwidth Selector","224839945":"On Information and Sufficiency","256463546":"The Calculus of Variations and Optimal Control: An Introduction","4893758":"Reducing bias in curve estimation by use of weights","243763440":"Maximum Entropy Models In Science and Engineering","223117499":"On smoothed probability density estimation for stationary processes","239041607":"Measures of Information and Their Applications","233365904":"ON THE FAMILIES OF SOLUTIONS TO GENERALIZED MAXIMUM ENTROPY AND MINIMUM CROSS-ENTROPY PROBLEMS","224817311":"On Optimal Data-Based Bandwidth Selection in Kernel Density Estimation","238863559":"A class of measure of informativity of observation channels"},"citedIn":{"43525896":"The Generalized Cross Entropy Method, with Applications to Probability Density Estimation","258187760":"Generalized Cross-entropy Methods with Applications to Rare-event Simulation and Optimization","37618701":"A Non-Asymptotic Bandwidth Selection Method for Kernel Density Estimation of Discrete Data","225344326":"Non-asymptotic Bandwidth Selection for Density Estimation of Discrete Data","37620292":"A Novel Nonparametric Density Estimator"},"index":792}