{"abs":"This paper focuses on evolutionary algorithms based on probability models (EAPM), which statistically estimate the distribution of promising solutions from obtained samples and draw new samples from the estimated distribution, and pro-poses a novel method for EAPM to improve the accuracy of the statistical estimations by maintaining the previously generated samples more precisely than the conventional methods such as estimation of distribution algorithms. The key idea of the pro-posed method is to update the population (i.e., the maintained historical samples) to follow the target distribution by weight-ing the maintained samples and resampling from the popula-tion. The weighting and resampling operations are performed according to importance sampling. Experimental comparisons between the proposed method and conventional methods have revealed the following two advantages of the proposed method: (1) the proposed method affords better solutions than the con-ventional methods; and (2) the proposed method can monoton-ically control the convergence speed by the parameter.","title":"Resampling-based population mechanism for evolutionary algorithms based on probability models","id":228939340,"url":"https://www.researchgate.net/publication/228939340_Resampling-based_population_mechanism_for_evolutionary_algorithms_based_on_probability_models","names":["Takayuki Higo","Keiki Takadama"],"references":{"245550787":"Maintaining Multiple Populations with Different Diversities for Evolutionary Optimization Based on Probability Models","228940071":"Cross-Entropy Method","230710850":"Shimodaira, H.: Improving predictive inference under covariate shift by weighting the log-likelihood function. J. Stat. Plan. Infer. 90, 227-244","225810423":"Lecture Notes in Computer Science","3903897":"A New Adaptive Boltzmann Selection Schedule SDS","226993348":"Estimation of Distribution Algorithms","246868562":"Monte Carlo filter using the genetic algorithm operators","46621292":"Continuous iterated density estimation evolutionary algorithms within the IDEA framework","200744518":"Sequential Monte-Carlo Methods in Practice","221007834":"Influence of selection and replacement strategies on linkage learning in BOA","3084564":"Pattern recognition and machine learning","226320449":"Bayesian Optimization Algorithm","242372494":"Genetic algorithm in search","2489528":"Escaping Hierarchical Traps with Competent Genetic Algorithms","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{},"index":794}