{"abs":"This paper discusses the problem of group screening methods wherein f factors are sub-divided into groups of k factors each, forming g “group-factors”. The group factors are then studied using a Plackett and Burman design in Q + 1 runs. The two versions of the group factors are formed by maintaining all component factors at their upper and lonrer levels respectively. All factors in groups found to have a large effects are then studied in a second stage of experiments. The author discusses the problems of detection and false detection of factors, optimum group size, size of program, and the role of costs in this sequential form of experimentation.","title":"A Study of the Group Screening Method","id":242611503,"url":"https://www.researchgate.net/publication/242611503_A_Study_of_the_Group_Screening_Method","names":["G. S. Watson","Technometrics"],"references":{"230693874":"The Design of Optimum Multifactorial Experiments","235008616":"Group Testing To Eliminate Efficiently All Defectives in a Binomial Sample","38368084":"The Detection of Defective Members of Large Population"},"citedIn":{"277726092":"Array-based schemes for group screening with test errors which incorporate a concentration effect","202190094":"Two-Level Supersaturated Designs: A Review","243049081":"The performance of multistage group screening designs","254332450":"The Performance of Two-Stage Group Screening in Factor Screening Experiments","243048055":"Three-Stage Group Screening with Errors in Observations","256570180":"Simulation analysis with group screening","280707253":"An overview of group factor screening","224840055":"Composite Sampling","251729936":"Building Surrogate Models Based on Detailed and Approximate Simulations","227763840":"Economics of Sample Compositing as a Screening Tool in Ground Water Quality Monitoring","221525281":"Comparison of a two-stage group-screening design to a standard 2k-P design for a whole-line semiconductor manufacturing simulation model, Proc 1999 Winter SimulationConf","238831657":"Some Realizability Theorems in Group Testing","263503267":"Screening Strategies in the Presence of Interactions","260654225":"STATISTICAL PROPERTIES OF THE DORFMAN-STERRETT GROUP SCREENING PROCEDURE WITH ERRORS IN DECISION","252090399":"Risk-Based Adaptive Group Testing of Web Services","239557980":"Group-Screening with More Than Two Stages","221528104":"Statistical tools for simulation design and analysis I: finding important independent variables through screening designs: a comparison of methods.","221529877":"Searching For Important Factors: Sequential Bifurcation Under Uncertainty","226923694":"Survey of modeling and optimization strategies to solve high-dimensional design problems with computationally-expensive black-box functions","242912342":"A Note on Hypergeometric Group Testing Procedures","222479470":"Searching for important factors in simulation models with many factors: Sequential bifurcation","270814740":"Sequential designs for sensitivity analysis of functional inputs in computer experiments","228570286":"k -Circulant Supersaturated Designs","227649186":"A method for constructing supersaturated designs and its Es2 optimality","242426951":"Optimum Two Stage Group-Screening Designs","243575475":"On the Performance of Two-Stage Group Screening Experiments","29605375":"Comparaison de méthode criblage pour la simulation numérique","259717444":"SENSITIVITY ANALYSIS FOR COMPLEX ECOSYSTEM MODELS","229473260":"Requirements of an ‘Optimizer’ For Computer Simulation","18475352":"The analysis of incomplete blocks designs as used in the group screening of drugs.","243047999":"Step-wise group screening with equal prior probabilities and no errors in observations","243050043":"Supersaturated Latin Hypercube Designs","243082548":"A Screening Design for Factorial Experiments with Interactions","222197111":"Optimization of multivariate simulation output models using a group screening method","260552394":"A Case Study Examining the Impact of Factor Screening for Neural Network Metamodels","243042867":"Sensitivity Analysis and Related Analyses: A Review of Some Statistical Techniques","229588704":"Statistically meaningful standards for contaminated sites using composite sampling","247455471":"Screening Designs for Poly-Factor Experimentation","227614656":"Supersaturated design including an orthogonal base","268027564":"A Method for Detecting All Defective Members in a Population by Group Testing","250753700":"Ch. 8. Quality improvement and robustness via design of experiments","239847452":"Sensitivity analysis to evaluate the impact of uncertain factors in a scenario tree model for classical swine fever virus introduction into The Netherlands","243048996":"On multistage group screening designs","228763385":"Experimental Designs for High-Dimensional Complex Models","4785428":"Sensitivity analysis and related analysis : a survey of statistical techniques","256590357":"Some new factor screening designs using the search linear model","228904388":"Validation of a building thermal model in CLIM2000 simulation software using full-scale experimental data, sensitivity analysis and uncertainty analysis","242095118":"COMPARAÇÕES DE MÉTODOS DE TRIAGEM POR GRUPOS","246302670":"Generating Systematic Supersaturated Designs","235008617":"A Method for Detecting all Defective Members in a Population by Group Testing","268572520":"Survey of Modeling and Optimization Strategies for High-Dimensional Design Problems","239799591":"The Exact Solution to the Two-Stage Group-Testing Problem","241735686":"Note on Watson\u0027s Paper","241424402":"Optimality analysis of facility location problems using response surface methodology","43495905":"SENSITIVITY ANALYSIS FOR COMPLEX ECOSYSTEM MODELS","245495768":"Experimental Designs in the High Added Value Products Industry","233209757":"Step-wise group screening designs with errors in observations","242389519":"Factorial Sampling Plans for Preliminary Computational Experiments","287319390":"Large screening experiments: An overview of supersaturated designs for practitioners","239328060":"A Clinical Paper On Efficient Search Strategies in High-Dimensional Complex Models","224592924":"Risk-Based Adaptive Group Testing of Semantic Web Services","6740454":"Sensitivity Analysis to Evaluate the Impact of Uncertain Factors in a Scenario Tree Model for Classical Swine Fever Introduction","254331309":"Binomial Group-Testing With an Unknown Proportion of Defectives","4111798":"An efficient screening methodology for a priori assessed non-influential factors","254287780":"A Review of Composite Sampling Methods","277692672":"Quality by Design for the Pharmaceutical Industry","262087949":"Two-Stage Sensitivity-Based Group Screening in Computer Experiments","222155176":"Group screening and Taguchi design in the optimization of multi-echelon maintenance float simulation metamodels","235179409":"Robustness of Multiple Objective Decision Analysis Preference Functions","271674795":"Pooling and Other Designs for Analysing Laboratory Samples More Efficiently","234810466":"Efficient identification of important factors in large scale simulations","4772052":"Detection of interactions in experiments on large numbers of factors","40963280":"A Paradigm for sequential experimentation","240924159":"Group screening method for the statistical analysis of E ( f N O D ) -optimal mixed-level supersaturated designs","260675118":"Statistical properties of the Dorfman-Sterrett group-screening procedure with errors in decision","282442098":"Screening for important factors in large-scale simulation models: some industrial experiments","285222571":"Screening Strategies","3885975":"Finding important independent variables through screening designs:a comparison of methods","243048908":"A Comparison of Random Balance and Two-Stage Group Screening Designs: A Case Study","235014835":"Methods for Factor Screening in Computer Simulation Experiments","243049167":"Two-stage factor screening procedures using multiple grouping assignments","233347679":"An optimal design of cumulative sum control chart based on median run length","266952784":"Composite Sampling","243049157":"Three-stage group screening with unequal group sizes and with errors in observations","216301661":"Screening, Predicting, and Computer Experiments","233138271":"Multi-stage step-wise group screening","250956104":"Some Completeness Results on Decision Trees and Group Testing","229678095":"Some notes on the construction and evaluation of supersaturated designs","254363286":"Screening Experiments with Many Factors","228048981":"Supersaturated Designs","266271514":"Group-screening with more than two stages","243049145":"Nonorthogonal designs for measuring dispersion effects in sequential factor screening experiments using search linear models","241736099":"Adaptive Procedures for the Two-Stage Group-Testing Problem Based on Prior Distributions and Costs","238047230":"A Note on G. S. Watson\u0027s Paper ‘A Study of the Group Screening Method”","243049139":"Optimum two stage group-screening with unequal group sizes and with errors in decisions","232890928":"The Use of Supersaturated Experiments in Turbine Engine Development","221525222":"Application of a 2-Stage Group-Screening Design to a Whole-Line Semiconductor Manufacturing Simulation Model.","263874925":"RISK ASSESSMENT AND ADAPTIVE GROUP TESTING OF SEMANTIC WEB SERVICES","283378238":"Screening","233119806":"Two-stage group-screening designs with equal prior probabilities and no errors in decisions","233148676":"Step-wise screening of defective factors","283504903":"A Criterion for Constructing Powerful Supersaturated Designs when Effect Directions are Known","267080969":"Screening. Methods for experimentation in industry, drug dicovery, and genetics","228469373":"Application of group screening to dynamic building energy simulation models","243132313":"COMPARISON OF A TWO-STAGE GROUP-SCREENING DESIGN TO A STANDARD 2","235069159":"Two-Level Multifactor Designs for Detecting the Presence of Interactions","12921376":"Group testing in presence of classification errors","244388729":"Isomerization of n-butene to isobutene *1I. Selection of catalyst by group screening","282494008":"A Comprehensive Guide to Factorial Two-Level Experimentation","277992318":"Screening strategies in the presence of interactions","243049100":"On the performance of three-stage group screening experiments","257227430":"Practical application of uncertainty analysis and sensitivity analysis on an experimental house","240925103":"Ch. 2. Industrial experimentation for screening","220084457":"Statistical Group Testing with Queueing Involved.","3886019":"Evaluation of the effectiveness of group screening methods ascompared to no group screening","277697904":"Design and Analysis of Experiments: Special Designs and Applications, Volume 3"},"index":796}