{"abs":"We compare Genetic Algorithms (GA\u0027s) with Probability Collectives (PC), a new framework for distributed optimization and control. In contrast to GA\u0027s, PC-based methods do not update populations of solutions. Instead they update an explicitly parameterized probability distribution p over the space of solutions. That updating of p arises as the optimization of a functional of p. The functional is chosen so that any p that optimizes it should be p peaked about good solutions. The PC approach has deep connections with both game theory and statistical physics. We review the PC approach using its motivation as the information theoretic formulation of bounded rationality for multi-agent systems (MAS). It is then compared with GA\u0027s on a diverse set of problems. To handle high dimensional surfaces, in the PC method investigated here p is restricted to a product distribution. Each distribution in that product is controlled by a separate agent. The test functions were selected for their difficulty using either traditional gradient descent or genetic algorithms. On those functions the PC-based approach significantly outperforms traditional GA\u0027s in both rate of descent, trapping in false minima, and long term optimization.","title":"A comparative study of probability collectives based multi-agent systems and genetic algorithms","id":220741604,"url":"https://www.researchgate.net/publication/220741604_A_comparative_study_of_probability_collectives_based_multi-agent_systems_and_genetic_algorithms","names":["Chien-Feng Huang","Stefan Bieniawski","David H. Wolpert","Charlie E. M. Strauss"],"references":{"228940071":"Cross-Entropy Method","2831330":"Optimal Payoff Functions for Members of Collectives","226538122":"A Stochastic Minimum Cross-Entropy Method for Combinatorial Optimization and Rare-event Estimation*","201975941":"A Connectionist Machine for Genetic Hill-Climbing","8680584":"Improving search algorithms by using intelligent coordinates","221620027":"MIMIC: Finding Optima by Estimating Probability Densities.","242360316":"Genetic Algorithms in Search","248072070":"Theory of Collective Intelligence","2593460":"Collective Intelligence and Braess\u0027 Paradox","2385968":"Using Collective Intelligence To Route Internet Traffic","252252572":"Rationality Assumptions of Game Theory and the Backward Induction Paradox","2944442":"Product Distribution Theory for Control of Multi-Agent Systems","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","260400542":"Instructor\u0027s Manual: Exercise Solutions for Artificial Intelligence A Modern Approach Second Edition","245942984":"Discrete, Continuous, and Constrained Optimization Using Collectives","4143196":"Distributed control by Lagrangian steepest descent","231140204":"Collective intelligence for control of distributed dynamical systems","2587659":"Combining Multiple Optimization Runs with Optimal Dependency Trees","238686665":"Artificial intelligence: a modem approach","238735054":"Pattern Classiflcation (2nd ed.)","242356870":"Adaptation In Natural And Artificial Systems","30873058":"Genetic + Data Structures \u003d Evolution Programs","220695762":"InformationTheory, Inference, and Learning Algorithms","216301009":"Estimation Distribution Algorithms: A New Tool for Evolutionary Computation","220045412":"Adoption in Natural and Artificial System","242372494":"Genetic algorithm in search","2320797":"Reinforcement Learning by Probability Matching","220885653":"A Study of Control Parameters Affecting Online Performance of Genetic Algorithms for Function Optimization.","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"261096785":"Genetic algorithms in repeated matrix games: the effects of algorithmic modifications and human input with various associates","220449057":"A Probability Collectives Approach with a Feasibility-Based Rule for Constrained Optimization","223742035":"Probability Collectives: A multi-agent approach for solving combinatorial optimization problems","221414458":"Adaptive Probabilistic Learning by Collectives in Dynamic Environments.","220740064":"Multiple objective optimisation applied to route planning","257537108":"Genetic Algorithms in Repeated Matrix Games: The Effects of Algorithmic Modiﬁcations and Human Input with Various Associates","220215598":"Combinatorial optimization in Biology using Probability Collectives Multi-agent Systems","261281245":"A modified feasibility-based rule for solving constrained optimization problems using Probability Collectives","257440343":"Robust optimization of aircraft weapon delivery trajectory using probability collectives and meta-modeling","267646626":"Enhanced Multi-Agent Normal Sampling Technique for Global Optimization","220964607":"A probability collectives approach to weighted clustering algorithms for ad hoc networks","291709047":"Collectives formation and specialization in biosystems","283481916":"10th World Congress on Structural and Multidisciplinary Optimization","242545581":"Occupancy Based Map Searching Using Heterogeneous Teams of Autonomous Vehicles","278656581":"A Probability Collectives Approach for Multi-Agent Distributed and Cooperative Optimization with Tolerance for Agent Failure","232640898":"Probability Collectives in Dynamic Environments: A Study of Controlling the Balance between Exploration and Exploitation of the Search","228816771":"Cooperative decentralised data fusion using probability collectives","220867595":"Multi-Objective Probability Collectives.","224121405":"Distributed Faulty Sensor Detection","220906243":"Probability Collectives Multi-Agent Systems: A Study of Robustness in Search","283481800":"Probability Collectives for Solving Truss Structure Problems","221008769":"Probability Collectives: A distributed optimization approach for constrained problems","220458829":"A Framework for Cooperative Control Applied to a Distributed Sensor Network","242200576":"Preliminary Results of Applying Probability Collectives to Multi-Objective Optimisation Problems","228903828":"A Single Agent Search of a Two Dimensional Space Using Probability Collectives and Convex Optimization","271499742":"Agent-based optimization of biological response networks","277975008":"Probability Collectives for Solving Truss Structure Problems","261021631":"MOPC/D: A new probability collectives algorithm for multiobjective optimisation","242435777":"Cooperative Searching and Geomagnetic Surveying Using Teams of Autonomous Agents","221544578":"Tracking extrema in dynamic environments using Probability Collectives Multi-agent Systems","220494936":"A Study of Probability Collectives Multi-agent Systems on Optimization and Robustness","288213905":"A novel atmosphere clouds model optimization algorithm","235174970":"University Course Timetabling with Probability Collectives"},"index":798}