{"abs":"In this paper, we examine how adding objectives to a given optimization problem affects the computation effort required to generate the set of Pareto-optimal solutions. Experimental studies show that additional objectives may change the runtime behavior of an algorithm drastically. Often it is assumed that more objectives make a problem harder as the number of different trade-offs may increase with the problem dimension. We show that additional objectives, however, may be both beneficial and obstructive depending on the chosen objective. Our results are obtained by rigorous runtime analyses that show the different effects of adding objectives to a well-known plateau-function.","title":"Do Additional Objectives Make a Problem Harder?","id":47842387,"url":"https://www.researchgate.net/publication/47842387_Do_Additional_Objectives_Make_a_Problem_Harder","names":["Dimo Brockhoff","Tobias Friedrich","Nils Hebbinghaus","Christian Klein","Frank Neumann","Eckart Zitzler"],"references":{"47841947":"Speeding Up Evolutionary Algorithms Through Restricted Mutation Operators","242382129":"Randomized Algorithms A short course on randomized algorithms and the probabilistic method","222553607":"On the analysis of the (1+1) evolutionary algorithm. Theor. Comput. Sci. 276, 51-81","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","28358328":"Lecture Notes in Computer Science","2546601":"Evolutionary Algorithms and the Maximum Matching Problem","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","263453856":"The Analysis of Evolutionary Algorithms on Sorting and Shortest Paths Problems: Evolutionary Computation Combinatorial Optimization (Editors: Jens Gottlieb, Emma Hart, Martin Middendorf, Günter Raidl and Colin Reeves)","2316980":"Reducing Local Optima in Single-Objective Problems by Multi-objectivization","221563438":"Dimensionality Reduction in Multiobjective Optimization: The Minimum Objective Subset Problem","265702220":"The Analysis of Evolutionary Algorithms on Sorting and Shortest Paths Problems","220139076":"Speeding up Evolutionary Algorithms by Restricted Mutation Operators.","216300612":"Many-Objective Optimization: An Engineering Design Perspective","216300806":"Multicriterion decision making","220994889":"Worst-Case and Average-Case Approximations by Simple Randomized Search Heuristics","220739840":"Randomized Local Search, Evolutionary Algorithms, and the Minimum Spanning Tree Problem","2857536":"Running Time Analysis of Multi-objective Evolutionary Algorithms on a Simple Discrete Optimization Problem Marco Laumanns","263453855":"Helper-Objectives: Using Multi-Objective Evolutionary Algorithms for Single-Objective Optimisation: Evolutionary Computation Combinatorial Optimization (Editors: Jens Gottlieb, Emma Hart, Martin Middendorf, Günter Raidl and Colin Reeves)","222624872":"Expected runtimes of evolutionary algorithms for the Eulerian cycle problem","4201388":"Design and Analysis of an Asymmetric Mutation Operator","267432540":"Helper-Objectives: Using Multi-Objective Evolutionary Algorithms for Single-Objective Optimisation","28355907":"Minimum Spanning Trees Made Easier Via Multi-Objective Optimization","220701968":"Are All Objectives Necessary? On Dimensionality Reduction in Evolutionary Multiobjective Optimization","2936276":"Expected Runtimes of a Simple Evolutionary Algorithm for the Multi-objective Minimum Spanning Tree Problem","2643538":"Evolutionary Algorithms - How to Cope With Plateaus of Constant Fitness and When to Reject Strings of The Same Fitness","226139781":"Random orders","220701912":"Running Time Analysis of Multi-objective Evolutionary Algorithms on a Simple Discrete Optimization Problem"},"citedIn":{"260675586":"Multi-Objectivization of Reinforcement Learning Problems by Reward Shaping","228758572":"Ein Evolutionsverfahren zur Approximation äquivalenter Urbilder von Pareto-optimalen Zielvektoren","28358178":"Computational complexity of evolutionary algorithms, hybridizations, and swarm intelligence","261124866":"Analysing the robustness of multiobjectivisation parameters with large scale optimisation problems","283818611":"Solving Phase Equilibrium Problems by Means of Avoidance-Based Multiobjectivization","220739890":"Evolutionary algorithms and multi-objectivization for the travelling salesman problem","272665180":"Single and Multi-objective in Silico Evolution of Tunable Genetic Oscillators","51692937":"Diagnostic Assessment of Search Controls and Failure Modes in Many-Objective Evolutionary Optimization","47842500":"Benefits and Drawbacks for the Use of epsilon-Dominance in Evolutionary Multi-Objective Optimization","220702008":"SPAM: Set Preference Algorithm for Multiobjective Optimization","224453313":"A multiobjective approach for finding equivalent inverse images of Pareto-optimal objective vectors","224516803":"On the Effects of Adding Objectives to Plateau Functions","221008911":"Multiobjective Optimization: Redundant and Informative Objectives","222679009":"Plateaus can be harder in multi-objective optimization","224472005":"Using Gradient-Based Information to Deal with Scalability in Multi-Objective Evolutionary Algorithms","258246464":"Multiobjectivizing the HP Model for Protein Structure Prediction","224111742":"Software Module Clustering as a Multi-Objective Search Problem","220741262":"Multiobjectivization for parameter estimation: A case-study on the segment polarity network of Drosophila","46424802":"Abandoning Objectives: Evolution Through the Search for Novelty Alone","262405508":"On Set-Based Multiobjective Optimization","225957594":"Novelty Search and the Problem with Objectives","221006722":"Biplots in offline multiobjective reduction.","257432567":"Scalability and robustness of parallel hyperheuristics applied to a multiobjectivised frequency assignment problem","257335161":"Many objective visual analytics: Rethinking the design of complex engineered systems","282407398":"On multiobjective selection for multimodal optimization","261490479":"Improving the diversity preservation of multi-objective approaches used for single-objective optimization","224301796":"Plateaus can be harder in multi-objective optimization","46888688":"Advances in Multi-Objective Nature Inspired Computing","283943383":"Using multi-objective evolutionary algorithms for single-objective constrained and unconstrained optimization","256276346":"An overview of population-based algorithms for multi-objective optimisation","220741909":"Deterministic helper-objective sequences applied to job-shop scheduling","272846206":"Multi-objectivization Via Decomposition: An analysis of helper-objectives and complete decomposition","220702233":"Multiobjectivization by Decomposition of Scalar Cost Functions","261165905":"Solving multi-objective optimization problems using differential evolution and a maximin selection criterion","221611252":"Multiobjectivisation of the Antenna Positioning Problem","261038411":"A scalability study of multi-objective particle swarm optimizers","221008356":"A multiobjectivised memetic algorithm for the Frequency Assignment Problem","220199253":"Helper-objective optimization strategies for the Job-Shop Scheduling Problem","261095108":"Multi objective functions for software module clustering with module properties","263372158":"Multi-objectivization, fitness landscape transformation and search performance: A case of study on the hp model for protein structure prediction","220287855":"Approximating the Pareto optimal set using a reduced set of objective functions","220314486":"Convergence of multi-objective evolutionary algorithms to a uniformly distributed representation of the Pareto front","260360285":"A survey on multi-objective evolutionary algorithms for many-objective problems","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","226834270":"Applications of Parallel Platforms and Models in Evolutionary Multi-Objective Optimization","220702022":"Investigations into the Effect of Multiobjectivization in Protein Structure Prediction","40906641":"Analysis of an Asymmetric Mutation Operator","237223750":"TECHNISCHE UNIVERSIT¨ AT DORTMUND REIHE COMPUTATIONAL INTELLIGENCE COLLABORATIVE RESEARCH CENTER 531 Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods Benefits and Drawbacks for the Use of \"Dominance in Evolutionary Multi-Objective Optimization","258246402":"An Improved Multiobjectivization Strategy for HP Model-Based Protein Structure Prediction","28358359":"Approximating Minimum Multicuts by Evolutionary Multi-objective Algorithms","221020747":"On the Comparison of Parallel Island-Based Models for the Multiobjectivised Antenna Positioning Problem.","46305962":"A hierarchical approach to model parameter optimization for developmental systems","254462275":"Locality-based Multiobjectivization for the HP Model of Protein Structure Prediction","254021839":"Analysing the Adaptation Level of Parallel Hyperheuristics Applied to Multiobjectivised Benchmark Problems","266198963":"Analysing the Robustness of Multiobjectivisation Approaches Applied to Large Scale Optimisation Problems","28358367":"Additive approximations of Pareto-optimal sets by evolutionary multi-objective algorithms","226152842":"Automated Aggregation and Omission of Objectives for Tackling Many-Objective Problems","220742234":"Evolutionary Multiobjective Optimization"},"index":801}