{"abs":": The growing interest in hard multiple objective combinatorial and non-linear problems resulted in a significant number of heuristic methods aiming at generating sets of feasible solutions as approximations to the set of non-dominated solutions. The issue of evaluating these approximations is addressed. Such evaluations are useful when performing experimental comparisons of different multiple objective heuristic algorithms, when defining stopping rules of multiple objective heuristic algorithms, and when adjusting parameters of heuristic algorithms to a given problem. A family of outperformance relations that can be used to compare approximations under very weak assumptions about a decision-maker\u0027s preferences is introduced. These outperformance relations define incomplete orders in the set of all approximations. It is shown that in order to compare approximations, which are incomparable according to the outperformance relations, much stronger assumptions about the decision-maker\u0027s pr...","title":"Evaluating the Quality of Approximations to the Non-Dominated Set","id":2642725,"url":"https://www.researchgate.net/publication/2642725_Evaluating_the_Quality_of_Approximations_to_the_Non-Dominated_Set","names":["Michael Pilegaard Hansen","Andrzej Jaszkiewicz"],"references":{"244957273":"A Heuristic for Estimating Nadir Criterion Values in Multiple Objective Linear Programming","220472422":"On bicriterion minimal spanning trees: An approximation","222374850":"A tutorial on Heuristic methods","200621936":"“Thermodynamical Approach to the Traveling Salesman Problem: An Efficient Simulation Algorithm,”","220118677":"Optimization by Simulated Annealing","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","242360316":"Genetic Algorithms in Search","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","237131761":"Lecture Notes in Economics and Mathematical Systems","266308299":"A multiobjective metaheuristic approach to the location of petrol stations by the capital budgeting model","242813996":"Careful Usage of Pessimistic Values is Needed in Multiple Objectives Optimization","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","221984871":"InterQuad: An interactive quad tree based procedure for solving the discrete alternative multiple criteria problem","247251996":"Principles of Multiobjective Optimization","235709741":"Lecture Notes in Computer Science","225912468":"Thermodynamical Approach to the Traveling Salesman Problem: An Efficient Simulation Algorithm","245102847":"A tabu search procedure to solve multiobjective combinatorial optimization problems","220693571":"Tabu search I","243664802":"Multiobjective project scheduling under multiple-category resource constraint","2599118":"Tabu Search for Multiobjective Optimization: MOTS","243665386":"Genetic Algorithms in Searching","216301002":"Simulated Annealing: Theory and Application","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","220381075":"Evolutionary Algorithms In Engineering Applications.","31945814":"A Bibliography on the Applications of Mathematical Programming Multiple Objective Methods","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","227947168":"Multi‐objective combinatorial optimization problems: A survey","234898362":"Tabu search part II","229707789":"Pareto simulated annealing- A metaheuristic technique for multiple-objective combinatorial optimization","227446387":"Analytical Evaluation of Multi-Criteria Heuristics","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"269724950":"Novel performance metrics for robust multi-objective optimization algorithms","3418674":"Evolutionary algorithms with dynamic population size and local exploration for multiobjective optimization","220981282":"Towards Landscape Analyses to Inform the Design of Hybrid Local Search for the Multiobjective Quadratic Assignment Problem.","251389682":"Pareto Evolutionary Algorithm Hybridized with Local Search for Biobjective TSP","222768972":"Finding representative systems for discrete bicriterion optimization problems","2522154":"Why Quality Assessment of Multiobjective Optimizers Is Difficult","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","259868531":"A new performance metric for user-preference based multi-objective evolutionary algorithms","228567692":"Visualization Technique for Analyzing Non-Dominated Set Comparison","221006911":"Online convergence detection for evolutionary multi-objective algorithms revisited","224177733":"Guided Pareto Local Search based frameworks for biobjective optimization","226550943":"Pareto Local Optimum Sets in the Biobjective Traveling Salesman Problem: An Experimental Study","260062370":"Comparison of Multiobjective Evolutionary Algorithms for Operations Scheduling under Machine Availability Constraints","4075036":"Particle Swarm Optimizers for Pareto Optimization with Enhanced Archiving Techniques","261053613":"A ranking method based on the R2 indicator for many-objective optimization","237510155":"Designing ART-based Classifiers through Multi-Objective Memetic Evolution","5297268":"Improving Locality in Binary Representation via Redundancy","239207268":"Time-Predefined and Trajectory-Based Search: Single and Multiobjective Approaches to Exam Timetabling","262405508":"On Set-Based Multiobjective Optimization","221228550":"A Two-Phase Local Search for the Biobjective Traveling Salesman Problem","3949334":"Preliminary statement on the current progress of multi-objective evolutionary algorithm performance measurement","226252109":"A problem space genetic algorithm in multiobjective optimization","225382229":"The Multiobjective Traveling Salesman Problem: A Survey and a New Approach","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","4074752":"Bounded archiving using the Lebesgue measure","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","242261558":"Decremental Multi-Objective Optimization Problems","222431240":"Scheduling parallel CNC machines with time/cost trade-off considerations","4089972":"Effects of elitism and population climbing on multiobjective MNK-landscapes","271555941":"Two-Phase Pareto Local Search to Solve the Biobjective Set Covering Problem","228959986":"Performance of demo on new test problems: A comparison study","221228406":"Multiobjective Optimization on a Budget of 250 Evaluations","3418735":"Jaszkiewicz, A.: Do multiple-objective metaheuristics deliver on their promises? A computational experiment on the set-covering problem. IEEE Transactions on Evolutionary Computation 7(2), 133-143","222311710":"Multiobjective service restoration in electric distribution networks using a local search based heuristic","221026163":"Interactive Multiobjective Evolutionary Algorithms","216301189":"A Critical Survey of Performance Indices for Multi-Objective Optimisation","236341365":"On the Performance Comparison of Multiobjective Evolutionary UAV Path Planners","221007432":"An effective explicit building block MOEA, the MOMGA-IIa","237391958":"Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods","222415920":"Stützle, T.: Design and analysis of stochastic local search for the multiobjective traveling salesman problem. Computers \u0026 Operations Research 36(9), 2619-2631","223589414":"Assessing solution quality of biobjective 0-1 knapsack problem using evolutionary and heuristic algorithms","277128445":"Comparación multiobjetivo de las reglas de prioridad en un sistema de control de la producción tipo drum-buffer-rope.","216300191":"KEA---A Software Package for Development, Analysis, and Application of Multiple Objective Evolutionary Algorithms","242376975":"Cost-effective Evolutionary Strategies for Pareto Optimal Front Approximation in Multiobjective Shape Design Optimization of Electromagnetic Devices","221633611":"Solving a Bi-objective Vehicle Routing Problem by Pareto-Ant Colony Optimization","220867157":"Microarray Biclustering: A Novel Memetic Approach Based on the PISA Platform","235976338":"Multi-Objective Evolutionary Algorithm with Node-Depth Encoding and Strength Pareto for Service Restoration in Large-Scale Distribution Systems","268889743":"Multiple Objective Combinatorial Optimization — A Tutorial","255968973":"R2-IBEA: R2 Indicator Based Evolutionary Algorithm for Multiobjective Optimization","220741031":"On the possibility to create a compatible--complete unary comparison method for evolutionary multiobjective algorithms.","228735282":"LEMMO: Hybridising rule induction and NSGA II for multi-objective water systems design, paper presented at CCWI","221228472":"Preliminary Investigation of the `Learnable Evolution Model\u0027 for Faster/Better Multiobjective Water Systems Design","277237265":"Product Configuration from a Mathematical Optimization Perspective","30519113":"Optimisation Combinatoire Multi-Objectif : Apport des méthodes coopératives et contribution à l\u0027extraction de connaissances","2830262":"No Free Lunch and Free Leftovers Theorems for Multiobjective Optimisation Problems","223709172":"Bound sets for biobjective combinatorial optimization problems","225158601":"On local optima in multiobjective combinatorial optimization problems","224408005":"The distributed generator placement and sizing test suite and analysis tool","254503309":"Performance Indices for Multiobjective Distinct Candidates Optimization (MODCO)","220637580":"Evolving Dynamic Multi-Objective Optimization Problems with Objective Replacement","221581982":"Bus Network Scheduling Problem: GRASP + EAs with PISA * Simulation","216457303":"Indicator-Based Selection in Multiobjective Search","229042706":"A problem space genetic algorithm to solve bicriteria tool management and scheduling problems","2440337":"Métaheuristiques pour l\u0027optimisation combinatoire multi-objectif: Etat de l\u0027art","271366292":"Efficient multi-criteria optimization on noisy machine learning problems","2462623":"Local Search, Multiobjective Optimization and the Pareto Archived Evolution Strategy","222572287":"Considering manufacturing cost and scheduling performance on a CNC turning machine","2473370":"An Evolutionary Algorithm With A Multilevel Pairing Strategy For Single And Multiobjective Optimization","220063452":"An evolutionary strategy for decremental multiobjective optimization problems","220381153":"On the performance of multiple-objective genetic local search on the 0/1 knapsack problem—a comparative experiment","4074747":"Some multiobjective optimizers are better than others","271659257":"On balance and dynamism in procedural content generation with self-adaptive evolutionary algorithms","224178070":"Sequential parameter optimization for multi-objective problems","241479087":"A Hybrid Algorithm for Dynamic Location Problems","261131073":"Neighbor-distance based diversity assessment for multi-objective optimizations","268075048":"Multiobjective evolutionary algorithm with a discrete differential mutation operator developed for service restoration in distribution systems","2518517":"A Comparative Study of Multiple-Objective Metaheuristics on the Bi-Objective Set Covering Problem and the Pareto Memetic Algorithm","215867150":"Some convergence-based M-ary cardinal metrics for comparing performances of multi-objective optimizers","266153481":"Comparing Evolutionary Strategies on a Biobjective Cultural Algorithm","225315514":"G–Indicator: An M–Ary Quality Indicator for the Evaluation of Non–dominated Sets","240620419":"Veÿ ckriterijska optimizacija: primerjava algoritmov MOjDE in DEMO","264932380":"Multiobjective programming and goal programming. Theoretical results and practical applications. Selected papers based on the presentations at the international conference on multiobjective programming and goal programming (MOP/GP 2006), Tours, France, June 12–14, 2006","2861821":"Multi-Objective Benchmark Studies for Evolutionary Computation","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","2626292":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","226824805":"A Constraint Method in Nonlinear Multi-Objective Optimization","220403649":"Solving the musical orchestration problem using multiobjective constrained optimization with a genetic local search approach","290435757":"Multi-objective Evolutionary Algorithm with Discrete Differential Mutation Operator for Service Restoration in Large-Scale Distribution Systems","220403398":"An Application of a Multi-Objective Tabu Search Algorithm to a Bicriteria Flowshop Problem","201977070":"On the Assessment of Multiobjective Approaches to the Adaptive Distributed Database Management Problem","236658679":"On the Use of Sharpe´s index in evolutionary portfolio optimization under Markowitz´s model","221008834":"An ensemble method for performance metrics in multiobjective evolutionary algorithms.","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","4133319":"Hybridising rule induction and multi-objective evolutionary search for optimising water distribution systems","263370575":"Multiobjective Communication Optimization for Cloud-Integrated Body Sensor Networks","261054322":"R2-IBEA: R2 indicator based evolutionary algorithm for multiobjective optimization"},"index":802}