{"abs":"In order to successfully estimate parameters of a numerical model, multiple criteria should be considered. Multi-objective Differential Evolution (MODE) and Multi-objective Genetic Algorithm (MOGA) have proved effective in numerous such applications, where most of the techniques relying on the condition of Pareto efficiency to compare different solutions. We describe the performance of two population based search algorithms (Nondominated Sorting Differential Evolution (NSDE) and Nondominated Sorting Genetic Algorithm (NGAII)) when applied to parameter estimation of a pressure swing adsorption (PSA) model. Full PSA mode is a complicated dynamic processing involving all transfer phenomena (mass, heat and momentum transfer) and has proven to be successful in a wide of applications. The limitation of using full PSA models is their expensive computational requirement. The parameter estimation analysis usually needs to run the numerical model and evaluate the performance thousands of times. However, in real world applications, there is simply not enough time and resources to perform such a huge number of model runs. In this study, a computational framework, known as v-support vector regression (v-SVR) PSA model, is presented for solving computationally expensive simulation problems. Formulation of an automatic parameter estimation strategy for the PSA model is outline. The simulations show that the NSDE is able to find better spread of solutions and better convergence near the true Pareto-optimal front compared to NSGAII-one elitist MOGA that pays special attention to creating a diverse Pareto-optimal front.","title":"Parameter estimation of a pressure swing adsorption model for air separation using multi-objective optimisation and support vector regression model","id":257405117,"url":"https://www.researchgate.net/publication/257405117_Parameter_estimation_of_a_pressure_swing_adsorption_model_for_air_separation_using_multi-objective_optimisation_and_support_vector_regression_model","names":["Yang L","Fan Sun","Expert Systems with Applications"],"references":{"229351978":"Evaluation of Global Optimization Methods for Conceptual Rainfall-Runoff Model Calibration","223496784":"Modeling and simulation of fixed bed adsorbers (FBAs) for multi-component gaseous separations","263984251":"Development of a Robust Multiobjective Simulated Annealing Algorithm for Solving Multiobjective Optimization Problems","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","225089382":"Gentic Algorithm in Search,Optimisation and Machine Learning.","3865142":"Comparing inertial weights and Constriction factor in particle swarm optimization","238128316":"Principles of Adsorption \u0026 Adsorption Processes","238654442":"Genetic Algorithms for Function Optimisation","3418784":"Handling multiple objectives with particle swarm optimization. IEEE Trans Evol Comp","220935678":"Solving Rotated Multi-objective Optimization Problems Using Differential Evolution","255104300":"Pressure swing adsorption system","222460696":"Multi-Objective Global Optimization for Hydrologic Models","216300536":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimisation: NSGA-II.","238652069":"Adaptation in Natural and Artificial Systems: An Introductory Analysis with Applications to Biology, Control and AI","3623274":"Particle swarm Optimization","216300934":"On metrics for comparing non-dominated sets","224292605":"Automatic Calibration of Numerical Models using Fast Optimisation by Fitness Approximation","244114408":"Pressure Swing Air Separation on a Carbon Molecular Sieve: II. Investigation of a Modified Cycle with Pressure Equalization and No Purge","222639456":"Calibration of Process-Oriented Models","223640178":"Pressure Swing Adsorption Air Separation on a Carbon Molecular Sieve","32898651":"A multi-objective genetic algorithm for the design of\npressure swing adsorption","246648860":"Differential Evolution: A Simple and Efficient Adaptive Scheme for Global Optimization Over Continuous Spaces","215721451":"Neural Networks For Pattern Recognition","220214865":"Automatic calibration of a rainfall-runoff model using a fast and elitist multi-objective particle swarm algorithm","231374584":"Multi-Objective Optimization of Pressure Swing Adsorbers for Air Separation","12413257":"New Support Vector Algorithms","215459436":"Adaptation in Natural and Artificial Systems: An Introductory Analysis With Applications to Biology, Control, and Artificial Intelligence","222679929":"Automatic Calibration of a Conceptual Rainfall-Runoff Model Using Multiple Objectives","220220317":"A fast differential evolution algorithm using k-Nearest Neighbour predictor"},"citedIn":{"262816843":"Artificial neural network and particle swarm optimization for removal of methyl orange by gold nanoparticles loaded on activated carbon and Tamarisk","277306054":"Final Version Two Tuned MOMHA for Solving a Fuzzy MSRAP under Discount","258518861":"Parameter Estimation of Nonlinear Systems Using Lèvy Flight Cuckoo Search","260693248":"Evaluation of Cuckoo Search Usage for Model Parameters Estimation.","273003790":"Two tuned multi-objective meta-heuristic algorithms for solving a fuzzy multi-state redundancy allocation problem under discount strategies","279212617":"Multi-objective optimization of material model parameters of an adhesive layer by using SPEA2","276164581":"Predictive control with multiobjective optimization: Application to a sludge drying operation","272137321":"Simulation and Optimization of a Dual-Adsorbent, Two-Bed Vacuum Swing Adsorption Process for CO 2 Capture from Wet Flue Gas","260015659":"An integrated SRM-multi-gene genetic programming approach for prediction of factor of safety of 3-D soil nailed slopes","262202870":"Performance evaluation of microbial fuel cell by artificial intelligence methods","267096214":"Random forest model for removal of bromophenol blue using activated carbon obtained from Astragalus bisulcatus tree","279854003":"Random forest model for the ultrasonic assisted removal of chrysoidine G by copper sulfide nanoparticles loaded on activated carbon : Optimization by experimental design based response surface methodology approach","282074446":"Multi-Objective Optimisation using Surrogate Models for the Design of VPSA Systems"},"index":803}