{"abs":"This work presents theoretical results on the development of a statistical convergence criterion for evolutionary algorithms. An analytical formula is derived for the probability of success in isotropic Gaussian mutation operators over spherical functions, and statistical criteria are proposed for evaluating, with predefined confidence levels, the convergence of (1+1) and (1+λ) Evolution Strategies. The results presented are intended as a first approach to the development of statistically based stop criteria for evolutionary optimizers, and as a contribution for the broader application of statistical modeling to the development and study of population-based algorithms.","title":"Towards Statistical Convergence Criteria for Mutation-Based Evolutionary Algorithms","id":284454299,"url":"https://www.researchgate.net/publication/284454299_Towards_Statistical_Convergence_Criteria_for_Mutation-Based_Evolutionary_Algorithms","names":["Felipe Campelo"],"references":{"216300294":"Toward a Theory of Evolution Strategies: Self-Adaptation","229778225":"A NEW SHORT EXACT GEOMETRIC CONFIDENCE INTERVAL","243768804":"Arti cial Immune Systems: A New Computational Intelligence Approach","38092672":"Statistical Methods for Convergence Detection of Multi-Objective Evolutionary Algorithms","258237345":"Interval Estimation for a Binomial Proportion","220223975":"Log-Linear Convergence and Divergence of the Scale-Invariant (1+1)-ES in Noisy Environments","266507658":"Numerical Integration over the n-Dimensional Spherical Shell Author(s): D Numerical Integration over the n-Dimensional Spherical Shell","272581782":"Approximate Is Better than \"Exact\" for Interval Estimation of Binomial Proportions","221007975":"Introducing a robust and efficient stopping criterion for MOEAs","220375150":"Toward a Theory of Evolution Strategies: Some Asymptotical Results from the (1, + λ)-Theory","260642695":"On the Behaviour of the (1, λ)-ES for Conically Constrained Linear Problems","220132816":"Evolution strategies - a comprehensive introduction. Nat Comput","220150829":"Theory of Evolutionary Algorithms: A Birds Eye View","2463953":"Numerical Computation Of Multivariate Normal Probabilities","220740669":"Evolutionary Computation: A Unified Approach","11824033":"Form Invariance and Implicit Parallelism","266355000":"Using statistical inference for designing termination conditions ensuring convergence of Evolutionary Algorithms","238246314":"Industrial Applications of Genetic Algorithms"},"citedIn":{},"index":806}