{"abs":"In optimization, multiple objectives and constraints cannot be handled independently of the underlying optimizer. Requirements such as continuity and differentiability of the cost surface add yet another conflicting element to the decision process. While “better” solutions should be rated higher than “worse” ones, the resulting cost landscape must also comply with such requirements. Evolutionary algorithms (EAs), which have found application in many areas not amenable to optimization by other methods, possess many characteristics desirable in a multiobjective optimizer, most notably the concerted handling of multiple candidate solutions. However, EAs are essentially unconstrained search techniques which require the assignment of a scalar measure of quality, or fitness, to such candidate solutions. After reviewing current revolutionary approaches to multiobjective and constrained optimization, the paper proposes that fitness assignment be interpreted as, or at least related to, a multicriterion decision process. A suitable decision making framework based on goals and priorities is subsequently formulated in terms of a relational operator, characterized, and shown to encompass a number of simpler decision strategies. Finally, the ranking of an arbitrary number of candidates is considered. The effect of preference changes on the cost surface seen by an EA is illustrated graphically for a simple problem. The paper concludes with the formulation of a multiobjective genetic algorithm based on the proposed decision strategy. Niche formation techniques are used to promote diversity among preferable candidates, and progressive articulation of preferences is shown to be possible as long as the genetic algorithm can recover from abrupt changes in the cost landscape","title":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","id":3411839,"url":"https://www.researchgate.net/publication/3411839_Fleming_PJ_Multiobjective_optimization_and_multiple_constraint_handling_with_evolutionary_algorithms_-_part_I_A_unified_formulation_IEEE_Transactions_on_Systems_Man_and_Cybernetics_Part_A_Systems_and_","names":["C.M. Fonseca","P.J. Fleming","IEEE Transactions on Systems Man and Cybernetics - Part A Systems and Humans"],"references":{"2853422":"An Empirical Comparison of Selection Methods in Evolutionary Algorithms","220701664":"Application of Genetic Algorithms to Task Planning and Learning.","246961073":"Non-Linear System Identification with Multiobjective Genetic Algorithms","201976512":"Some Guidelines for Genetic Algorithms with Penalty Functions","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","243780745":"Non-linear Model Term Selection with Genetic Algorithms","216301684":"Low implementation cost IIR digital filter design using genetic algorithms","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","201976024":"Handling Constraints in Genetic Algorithms","220045519":"Design of Dynamical and Control Systems by the Method of Inequalities","3217189":"Multi-Objective Gas Turbine Engine Controller Design Using Genetic Algorithms","234828136":"System Identification through Simulated Evolution: A Machine Learning Approach to Modeling","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107","220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","2771203":"Genetic Programming as a Means for Programming Computers by Natural Selection","2782915":"A Variant of Evolution Strategies for Vector Optimization","243665386":"Genetic Algorithms in Searching","248392930":"Multiple Objective Decision Making—Methods and Applications: A State-of-the-Art Survey","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","3411845":"Multi-Objective Optimization and Multiple Constraint Handling with Evolutionary Algorithms – Part II: A Unified Formulation","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","3578177":"Multiobjective optimal controller design with genetic algorithms","220885522":"Optimising an Arbitrary Function is Hard for the Genetic Algorithm.","216300639":"Compaction of Symbolic Layout using Genetic Algorithms","220375001":"An Overview of Evolutionary Algorithms for Parameter Optimization","223284724":"Multicriteria Target Vector Optimization of Analytical Procedures Using a Genetic Algorithm .1. Theory, Numerical Simulations and Application to Atomic Emission-Spectroscopy.","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","2611416":"A Survey of Evolution Strategies"},"citedIn":{"224132443":"Incorporating the Notion of Relative Importance of Objectives in Evolutionary Multiobjective Optimization","242151023":"Multidisciplinary design optimization of a reentry vehicle using genetic algorithm","265792470":"A Portfolio Optimization Approach to Selection in Multiobjective Evolutionary Algorithms","6829164":"Neural Network-Based Diagnostic and Prognostic Estimations in Breast Cancer Microscopic Instances","224178523":"Towards real-time microgrid power management using computational intelligence methods","38958682":"Méthodes hiérarchiques pour l\u0027optimisation géométrique de structures rayonnantes","50435849":"Agent Negotiation of Target Distribution Enhancing System Survivability","221252921":"A Novel Multiobjective Evolutionary Algorithm Based on Min-Max Strategy","11161760":"Improved Sampling of the Pareto-Front in Multiobjective Genetic Optimizations by Steady-State Evolution: A Pareto Converging Genetic Algorithm","224333141":"A Jumping Genes Paradigm: Theory, Verification and Applications","224331091":"Application of Computational Intelligence Methods to Greenhouse Environmental Modelling","258176883":"A novel genetic programming approach to the design of engine control systems for the voltage stabilization of hybrid electric vehicle generator outputs","221613350":"Characterizing and predicting community members from evolutionary and heterogeneous networks.","37413423":"Scalable intelligent electronic catalogs","220953904":"Research advances in Automated Red Teaming","220116226":"Ordered Incremental Multi-Objective Problem Solving Based on Genetic Algorithms","224686459":"Multiobjective Load Dispatch Based on Genetic-Fuzzy Technique","220702008":"SPAM: Set Preference Algorithm for Multiobjective Optimization","47157999":"Multi-objective optimal chemotherapy control model for cancer treatment","238523926":"Multi-objective optimization using genetic algorithm: Applications to imperfect preventive maintenance model","242745949":"UNIVERSIDAD NACIONAL DE ASUNCIÓN","227161517":"Single and Multi-objective Evolutionary Algorithms for the Coordination of Serial Manufacturing Operations","257636220":"Giri B. K., Hakanen J., Miettinen K. and Chakraborti N.: ‘Genetic programming through bi-objective genetic algorithms with a study of a simulated moving bed process involving multiple objectives’, Appl. Soft Comput.","251976494":"A multi-objective genetic algorithm for mixed-model assembly line rebalancing","257335161":"Many objective visual analytics: Rethinking the design of complex engineered systems","2425878":"Constrained Multiobjective Optimization by Evolutionary Algorithms","222865788":"Multi-objective meta-heuristics: An overview of the current state-of-the-art","276985014":"1-s2.0-S209012321500034X-main (1)","220291353":"A multiobjective optimization solver using rank-niche evolution strategy","26501550":"A New Jumping Genes Paradigm for an E-Shaped Folded Patch Feed Antenna Design","220381464":"An approach to the design of a hybrid organization of workshops into functional layout and group technology cells","224330083":"Evolutionary Many-Objective Optimization: A Short Review","228358561":"Intelligent Washing Machine: A Bioinspired and Multi-objective Approach","252663600":"Improved MOGA-tuning and visualization for a hybrid control system","221951355":"Hard handoff minimization using genetic algorithms","231370120":"Multiobjective Optimization of Simulated Countercurrent Moving Bed Chromatographic Reactor (SCMCR) for MTBE Synthesis","242261558":"Decremental Multi-Objective Optimization Problems","221009259":"An Evolutionary Algorithm for the Input-Output Block Assignment Problem.","224090396":"Design Optimization of a Delta-Like Parallel Robot through Global Stiffness Performance Evaluation","237897317":"Multi-objective optimisation of systems architectures for distributed aero-engine control systems","2478190":"MERBIS - A Multi-Objective Evolutionary Rule Base Induction System","223070469":"An object-oriented framework for simulation-based green building design optimization with genetic algorithms","221228415":"Lecture Notes in Computer Science","238194273":"Genetic-fuzzy-based power scheduling technique for multiobjective load dispatch problem","235080279":"Optimization of Heterogeneous UAV Communications Using the Multiobjective Quadratic Assignment Problem","7861283":"Multiobjective optimization and multivariable control of the beer fermentation process with the use of evolutionary algorithms","220739966":"A novel probabilistic encoding for EAS applied to biclustering of microarray data","222703889":"A hybrid genetic algorithm and bacterial foraging approach for global optimization. Inf Sci","251965277":"A genetic-based optimization for multi-depot vehicle routing problems","235978315":"A Jumping Gene Evolutionary Approach for Multiobjective Optimization","4251681":"Solving the Molecular Sequence Alignment Problem with Generalized Differential Evolution 3 (GDE3)","237249094":"SEEA FOR MULTI-OBJECTIVE OPTIMIZATION: REINFORCING ELITIST MOEA THROUGH MULTI-PARENT CROSSOVER, STEADY ELIMINATION AND SWARM HILL CLIMBING","221007182":"A hybrid constraint handling mechanism with differential evolution for constrained multiobjective optimization","220199291":"A fast multi-objective evolutionary algorithm based on a tree structure","221025610":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","224398599":"An Improved Multi-Objective Adaptive Niche Genetic Algorithm Based On Pareto Front","257130299":"Cu―Zn separation by supported liquid membrane analyzed through Multi-objective Genetic Algorithms","269301861":"Adaptive Decision-Making Scheme for Cognitive Radio Networks","233302414":"An orthogonal design based constrained evolutionary optimization algorithm","220741954":"Biobjective evolutionary and heuristic algorithms for intersection of geometric graphs.","224168247":"Non-dominated sorting genetic algorithm-II for robust multi-objective optimal reactive power dispatch","221559129":"A Hybrid Multi-objective Evolutionary Algorithm for the Uncapacitated Exam Proximity Problem","241078830":"Economic and environmental strategies for process design","269791332":"Two-dimension phase-retardation distribution inspections for flexible displays by using full-field liquid-crystal modulating common-path interferometry","225385758":"A parallel global-local mixed evolutionary algorithm for multimodal function optimization based on domain decomposition","225792262":"Design of Poiseuille flow controllers using the method of inequalities","251705203":"F208 ANTI-TNFα THERAPY AND CONTROL OF CHRONIC PAIN IN ANKYLOSING SPONDYLITIS (AS) AND RHEUMATOID ARTHRITIS (RA)","257909547":"Optimizing Coverage Performance of Multiple Random Path-planning Robots","260522994":"Varying-Domain Optimal Management Strategy for Parallel Hybrid Electric Vehicles","277295345":"Evolutionary Algorithms: Overview, Methods and Operators.” Documentation for: Genetic Evolutionary Algorithm Toolbox for Use with Matlab version: toolbox 1.92 documentation 1.92","234024324":"Genetic programming and bacterial algorithm for neural networks and fuzzy systems design","235343487":"Enhancing the electrical performance of a solid oxide fuel cell using multiobjective genetic algorithms","279737557":"Multi-objective energy-noise wind farm layout optimization under land use constraints","283193499":"Solving a multi-objective dynamic stochastic districting and routing problem with a co-evolutionary algorithm","255564608":"Application of Multi-Objective Optimization in the Design of SMB in Chemical Process Industry","224253217":"Design and implementation of utility-based radio resource optimization using CAPRI","4253756":"Multi-Objective Design Optimisation of Submarine Electric Drive Systems","256276282":"Increasing the Density of Multi-Objective Multi-Modal Solutions using Clustering and Pareto Estimation Techniques","226637309":"Allocation of multi-type FACTS devices using multi-objective genetic algorithm approach for power system reinforcement","224330205":"Multiobjective Evolutionary Algorithm with Constraint Handling for Aircraft Landing Scheduling","222663110":"Multi-objective optimal design of groundwater remediation systems: application of the Niched Pareto Genetic Algorithm (NPGA)","267774838":"Self-Adaptive Fitness Formulation: Theory and Application","225630705":"Evolutionary Multiobjective Neural Network Models Identification: Evolving Task-Optimised Models","282530911":"Many-Objective Evolutionary Algorithms","262398762":"Enhanced multi-objective optimization algorithm for renewable energy sources: Optimal spatial development of wind farms","3217595":"A Study on the Discovery of Relevant Fuzzy Rules Using Pseudobacterial Genetic Algorithm","227290369":"Coordinating optimization-based sliding mode variable structure control for electro-hydraulic servo system","245158419":"Application of system identification techniques to aircraft gas turbine engines","268163956":"A novel preference articulation operator for the Evolutionary Multi-Objective Optimisation of classifiers in concealed weapons detection","3421349":"Multiobjective programming using uniform design and genetic algorithm","221007295":"Preference incorporation to solve many-objective airfoil design problems","264050473":"Shape optimization and material gradient design of the sharp hot structure","36410034":"Web Service Composition Systems for the Web Service Challenge - A Detailed Review","4223194":"Optimal Placement for Opportunistic Cameras Using Genetic Algorithm","227314960":"Constrained optimization based on hybrid evolutionary algorithm and adaptive constraint-handling technique","221228466":"Applications of a Multi-objective Genetic Algorithm to Engineering Design Problems","2770100":"Multi-objective Optimisation and Preliminary Airframe Design","216300612":"Many-Objective Optimization: An Engineering Design Perspective","221228426":"An Infeasibility Objective for Use in Constrained Pareto Optimization","200047434":"Financial Services Advisory - Individualisation and the role of Customer Data","223294952":"Exploring multi-scale trade-offs between nature conservation, agricultural profits and landscape quality—A methodology to support discussions on land-use perspectives","224363000":"Improving the Performance of the Pareto Fitness Genetic Algorithm for Multi-Objective Discrete Optimization","234024282":"Prediction of the solar radiation evolution using computational intelligence techniques and cloudiness indices","220637580":"Evolving Dynamic Multi-Objective Optimization Problems with Objective Replacement","255653776":"Programação genética Uni e multiobjectivo para treino de redes neurais B-spline","228906249":"A genetic algorithm approach for solving the routing and wavelength assignment problem in WDM networks","228427058":"The practitioner\u0027s role in competent search and optimization using genetic algorithms","3810442":"Resolution of the left ventricle 3D reconstruction problem using approaches based on genetic algorithm for multiobjective problems","234024256":"Implementation of an intelligent sensor for measurement and prediction of solar radiation and atmospheric temperature","254238612":"A VERSATILE TOOLBOX FOR SOLVING INDUSTRIAL PROBLEMS WITH SEVERAL EVOLUTIONARY TECHNIQUES","228911383":"Cognitive radios with genetic algorithms: Intelligent control of software defined radios","261333792":"Improved version of a multiobjective quantum-inspired evolutionary algorithm with preference-based selection","234024262":"Improving the Identification of RBF Predictive Models to Forecast the Portuguese Electricity Consumption","251874231":"A Biologically Inspired Intelligent PID Controller Tuning for AVR Systems","234024260":"Towards Online Operation of a RBF Neural Network Model to Forecast the Portuguese Electricity Consumption","221228440":"An efficient multi-objective evolutionary algorithm: OMOEA-II","226755891":"An Adaptive Penalty Function for Handling Constraint in Multi-objective Evolutionary Optimization","43188782":"Algoritmos evolutivos y preferencia del decisor aplicados a problemas de optimización multiobjetivos discretos","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","227027273":"A Tabu-Based Exploratory Evolutionary Algorithm for Multiobjective Optimization","220665318":"Nonlinear channel equalizer design using directional evolutionary multi-objective optimization","224384413":"An Adaptive Penalty Formulation for Constrained Evolutionary Optimization","220702180":"Lecture Notes in Computer Science","257580959":"Optimizing bi-objective imperfect preventive maintenance model for series-parallel system using established hybrid genetic algorithm","228788582":"A NEW EVOLUTIONARY ALGORITHM FOR MULTIOBJECTIVE OPTIMIZATION BASED ON ENDOCRINE PARADIGM","250888754":"Multi-criteria design methodology of a dielectric resonator antenna with jumping genes evolutionary algorithm","4201607":"A constrained optimization evolutionary algorithm based on multiobjective optimization techniques","51411927":"ChemInform Abstract: Evolving Interpretable Structure—Activity Relationship Models. Part 2. Using Multiobjective Optimization to Derive Multiple Models","260622144":"Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering","221228517":"A Comparative Study of Progressive Preference Articulation Techniques for Multiobjective Optimisation","234024249":"Energy Savings in HVAC Systems Using Discrete Model-Based Predictive Control","271885561":"Sub optimal scheduling in a grid using genetic algorithms","251851727":"Optimal Design of a Class of M-Channel Uniform Filter Bank using Genetic Algorithms","225508768":"Cooperation and competition in multidisciplinary optimization","4232336":"Inverter for microturbines based on multiobjective genetic algorithm","223464835":"A multi-objective genetic programming approach to developing Pareto optimal decision trees","2242801":"A New Approach for the Solution of Multiple Objective Optimization Problems Based on Reinforcement Learning","251600427":"Natural computing for mechanical systems research: A tutorial overview","222684562":"Sub optimal scheduling in a grid using genetic algorithms","225338804":"Project Scheduling Conflict Identification and Resolution Using Genetic Algorithms","256934832":"Elasto-geometrical modeling and calibration of robot manipulators: Application to machining and forming applications","221228489":"Non-invasive Atrial Disease Diagnosis Using Decision Rules: A Multi-objective Optimization Approach","221582813":"A Real Application Example of a Control Structure Selection by Means of a Multiobjective Genetic Algorithm.","220801472":"Multiobjective Optimization Based on Coevolutionary Algorithm","276145308":"A Practical Review on the Application of Constraint Handling Strategies in Evolutionary Computation from an Engineering Point of View","261308281":"Genetic algorithm solution for convex hydro-thermal generation scheduling problem","264709932":"Physical programming for preference driven evolutionary multi-objective optimization","3985617":"Hybrid control and evolutionary decision support within a sustainable environment","233529605":"Increasing the Density of Available Pareto Optimal Solutions","2647239":"Multiobjective Genetic Algorithms with Application to Control Engineering Problems","261369702":"Pareto Front Estimation for Decision Making","229029205":"An operation system for industrial processes: Application to a glass furnace","223384995":"Three-objective fuzzy chance-constrained programming model for multiproject and multi-item investment combination","256938915":"Development of optimal fuzzy models for predicting the strength of intact rocks","220743133":"Approaches Based on Genetic Algorithms for Multiobjective Optimization Problems.","221167064":"On the Use of Multi-Objective Optimization Algorithms for Solving the Impairment Aware-RWA Problem.","220306903":"A constraint-based approach to feasibility assessment in preliminary design","224177573":"An Interactive Territory Defining Evolutionary Algorithm: iTDEA","238344911":"The Good of the Many Outweighs the Good of the One: Evolutionary Multi Objective Optimization","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","222175685":"Availability allocation and multi-objective optimization for parallel–series systems","221532617":"Solar radiation prediction using RBF Neural Networks and cloudiness indices.","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm","257580964":"A polar-based guided multi-objective evolutionary algorithm to search for optimal solutions interested by decision-makers in a logistics network design problem","31104293":"A Jumping Gene Algorithm for Multiobjective Resource Management in Wideband CDMA Systems","220283937":"Evolution of mathematical models of chaotic systems based on multiobjective genetic programming","3412278":"U-Measure: A Quality Measure for Multiobjective Programming","261054093":"An enhanced MOEA/D using uniform directions and a pre-organization procedure","221469744":"EFuNN ensembles construction using CONE with multi-objective GA","224207966":"Diversity Management in Evolutionary Many-Objective Optimization","50418180":"Simultaneous Optimization for Hybrid Electric Vehicle Parameters Based on Multi-Objective Genetic Algorithms","45922235":"Pareto Region Characterization for Rate Control in MIMO Interference Systems and Nash Bargaining","221008933":"Projection-based local search operator for multiple equality constraints within genetic algorithms","3421502":"A fuzzy genetic multiobjective optimization algorithm for a multilevel generalized assignment problem","261125786":"Genetic Algorithm Solution for a Convex Hydro-Thermal Generation Scheduling","220285994":"Multi-class pattern classification using single, multi-dimensional feature-space feature extraction evolved by multi-objective genetic programming and its application to network intrusion detection","222428237":"A multi-objective evolutionary algorithm approach for crusher optimisation and flowsheet design","224677994":"Autonomous Robot Failure Recognition Design using Multi-Objective Genetic Programming","284995059":"A Self-adaptive Genetic Algorithm Applied to Multi-Objective Optimization of an Airfoil","225108095":"Function-based design synthesis approach to design reuse","242539373":"Multiobjective analysis for the design and control of an electromagnetic valve actuator","261524111":"Modified estimation of Distribution algorithm with differential mutation for constrained optimization","252033566":"Transmission network planning with N-1 security criterion based on improved multi-objective genetic algorithm","260910736":"Multi-objective optimization of short-term hydrothermal scheduling using non-dominated sorting gravitational search algorithm with chaotic mutation","242367340":"Multiobjective Control: Linear Matrix Inequality Techniques and Genetic Algorithms Approach","224598141":"Multiarea optimal power flow using multiobjective evolutionary Algorithm","224560253":"Multi-Objective Optimization of a Port-of-Entry Inspection Policy","223110253":"Optimization of building thermal design and control by multi-criterion genetic algorithm","257705598":"Handling multiple objectives with biogeography-based optimization","235744047":"Optimal Gains Tuning of PI-Fuzzy Controllers","4211044":"On-line multiobjective automatic control system generation by evolutionary algorithms","257427068":"Automotive drive by wire controller design by multi-objective techniques","279536012":"A multi-objective genetic algorithm for Assembly Line Resource Assignment and Balancing Problem of type 2 (ALRABP-2)","224472135":"Assessing the quality of the relation between scalarizing function parameters and solutions in multiobjective optimization","222157845":"On-line evolution of robust control systems: An industrial active magnetic bearing application","226025552":"Multi-objective Optimisation of a Hybrid Electric Vehicle: Drive Train and Driving Strategy","3352856":"Structure selection and tuning of multi-variable PID controllers for an industrial benchmark problem","43460538":"Evolutionary Algorithms for Safety-Cost Trade-Offs in Control System Design","221469726":"The Influence of Different Cost Functions in Global Optimization Techniques","260586149":"Controller Tuning by Means of Multi-Objective Optimization Algorithms: A Global Tuning Framework","233828544":"A Neural Network Based Intelligent Predictive Sensor for Cloudiness, Solar Radiation and Air Temperature","221352966":"Creating personalized documents: An optimization approach","220668944":"An Evolutionary Metaheuristic for Approximating Preference-Nondominated Solutions","220381210":"Ensemble of Constraint Handling Techniques","277044667":"Uma Abordagem Multi-Objectivo para a Inclusão da Geração Dispersa no Planeamento da Expansão da Produção de Energia Eléctrica","3978501":"Evolutionary learning function approximator as robot controller","238477069":"A Jumping Gene Algorithm for Multiobjective Resource Management in Wideband","3839237":"Multiple-criteria genetic algorithms for feature selection in neuro-fuzzy modeling","220739690":"Evolutionary path planner for UAVs in realistic environments","10840545":"Optimizing the Size and Configuration of Combinatorial Libraries","4201733":"Evolutionary multiobjective optimization with a segment based external memory support for the multiobjective quadratic assignment problem","4354308":"Handling Constraints for Search Based Software Test Data Generation","226589894":"Multiobjective Particle Swarm Optimization for Optimal Power Flow Problem","253421138":"Efficient Investigation of the Feasible Parameter Set for Large Models","259122746":"A Novel scheme in Audio Watermarking using Multi-Objective Genetic Algorithm","224133138":"A Territory Defining Multiobjective Evolutionary Algorithms and Preference Incorporation","220665975":"Linear matrix inequalities and evolutionary optimization in multiobjective control","220119116":"Particle swarm optimisation of interplanetary trajectories from Earth to Jupiter and Saturn","3754349":"Automating The Reuse Of Predicates In Prolog Programming Libraries","221986927":"Naturally ventilated and mixed-mode buildings—Part II: Optimal control","256841243":"Cooperation and Competition Strategies in Multi-objective Shape Optimization-Application to Low-boom/Low-drag Supersonic Business Jet","220669042":"SSPMO: A Scatter Tabu Search Procedure for Non-Linear Multiobjective Optimization","253054531":"MULTIOBJECTIVE CONTROL OF FLAPS AND T-FOIL IN HIGH-SPEED SHIPS","2897275":"Designing Crushers with a Multi-Objective Evolutionary Algorithm","271206770":"The iPICEA-g: A new hybrid evolutionary multi-criteria decision making approach using the brushing technique","4204828":"Resource placement in content delivery networks using hybrid genetic algorithm","257635846":"Repeated weighted boosting search for discrete or mixed search space and multiple-objective optimisation","220701817":"Multi-objective Optimisation by Co-operative Co-evolution","228614337":"Multi-objective evolutionary–fuzzy augmented flight control for an F16 aircraft","257628735":"A parallel evolutionary algorithm for technical market indicators optimization","254891609":"Poiseuille Flow Controller Design via the Method of Inequalities","3434847":"Some Insight Over New Variations of the Particle Swarm Optimization Method","277689825":"De Novo Molecular Design","269567359":"Benefits of Incorporating Designer Preferences Within a Multi-Objective Airfoil Design Framework","225361951":"Kolmogorov-Chaitin complexity of digital controller implementations","220741722":"Multiobjective real-coded bayesian optimization algorithmrevisited: Diversity preservation","221007966":"Constraint quadratic approximation operator for treating equality constraints with genetic algorithms.","228582633":"Evolutionary algorithms in control systems engineering: a survey. Control Eng Pract","230967475":"Multi-objective optimization of an active constrained layer damping treatment for vibration control of a rotating flexible arm","253097581":"Global Optimization Methods for Designing and Training Feedforward Artificial Neural Networks","220200038":"Hybrid GA-BF based intelligent PID controller tuning for AVR system","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","222691384":"A hybrid multi-objective evolutionary algorithm for solving truck and trailer vehicle routing problems. Eur J Oper Res","228584672":"A Survey of Multiobjective Optimization in Engineering Design","271547820":"Inductive reactive power compensation optimization for 10kV distribution network with distributed generations","259150582":"I. Kacem, S. Hammadi, P. Borne, Pareto-optimality Approach for Flexible Job-shop Scheduling Problems: Hybridization of Evolutionary Algorithms and Fuzzy Logic. Mathematics and Computers in Simulation 2002, 60, 245-276.","7245290":"Designing and performing experiments for model calibration using an automated iterative procedure","237736877":"Study of Fuzzy Sliding-Mode Control for Magnetic Ball Levitation Systems","265170504":"MOEA/D with Baldwinian learning inspired by the regularity property of continuous multiobjective problem","5474778":"Clustering and co-evolution to construct neural network ensembles: An experimental study","4074932":"A new multiobjective evolutionary algorithm: OMOEA","228402193":"Genetic Algorithms for Setup Coordination in Consecutive Stages of a Supply Chain","269116806":"Multi-Objective Robust Optimization Using a Postoptimality Sensitivity Analysis Technique: Application to a Wind Turbine Design","251915918":"Multi-objective genetic algorithm based developing audio watermarking technique","7245308":"Distributed virtual experiments in water quality management","228800561":"Multiobjective Genetic Algorithms for Solving the Impairment-Aware Routing and Wavelength Assignment Problem","224145614":"A Multiobjective Optimization Approach for Product Line Design","222329043":"Distribution-based adaptive bounding genetic algorithm for continuous optimisation problems","221883565":"Borg: An Auto-Adaptive Many-Objective Evolutionary Computing Framework","4074923":"A simplified artificial life model for multiobjective optimisation: A preliminary report","244358918":"Performance Assessment for Iterative Learning Control of Batch Units","220215479":"Dynamic diversity control in genetic algorithm for mining unsearched solution space in TSP problems","257153732":"BSTBGA: a hybrid genetic algorithm for constrained multi-objective optimization problems. Comput Oper Res","220543166":"An Evolutionary Algorithm with Advanced Goal and Priority Specification for Multi-objective Optimization","220200064":"Enhanced Genetic Algorithm-Based Fuzzy Multiobjective Strategy to Multiproduct Batch Plant Design","3963293":"On-line genetic optimization of unstructured controllers for electric drives","220200125":"Multiobjective network topology design","3412371":"Identifying the Structure of NonLinear Dynamic Systems Using Multiobjective Genetic Programming","259523295":"Dynamic security consideration in multiobjective electricity markets","229457925":"A multicriteria evolutionary algorithm for mechanical design optimization with expert rules","2637185":"Selecting Features in Neurofuzzy Modelling by Multiobjective Genetic Algorithms","224326903":"New Multi-Objective Constrained Optimization Evolutionary Algorithm","261053990":"Multi-objective tool sequence and parameter optimization for rough milling applications","222832868":"Dynamic systems modelling using genetic programming","226101462":"The Determination of Optimal Finite-Precision Controller Realisations Using A Global Optimisation Strategy: A Pole-Sensitivity Approach","224671945":"Multipurpose Genetic Algorithm Based in Pareto Optimality to Design Logical Topologies in Reconfigurable WDM Networks","278051135":"Multi-objective optimal design of hybrid renewable energy systems using preference-inspired coevolutionary approach","3413402":"A systematic approach to a self-generating fuzzy rule-table for function approximation","43378491":"Advanced Techniques for the Classification of Very High Resolution and Hyperspectral Remote Sensing Images","281708901":"Critical line affecting power system vulnerability under N-k contingency condition","228739091":"Robust H∞ Controller Design for Aircraft Lateral Dynamics using Multi- Objective. Optimization and Genetic Algorithms","221185181":"Improved Multi-Objective Diversity Control Oriented Genetic Algorithm","220548243":"Genetic algorithm-based scheduling in cognitive radio networks under interference temperature constraints","266749521":"Improved multi-objective particle swarm optimization with preference strategy for optimal DG integration into the distribution system","4913650":"A bi-objective genetic algorithm approach to risk mitigation in project scheduling","245393176":"Multi-objective shape control of prestressed structures with genetic algorithms","221469834":"Global Optimization Methods for Designing and Training Neural Networks.","2918805":"Feature Selection and Classifier Ensembles: A Study on Hyperspectral Remote Sensing Data","2615708":"Multiobjective Evolutionary Algorithm Test Suites","26756134":"On the possibility of non-invasive multilayer temperature estimation using soft-computing methods","266022501":"Multi-Objective Optimisation of Simulated Countercurrent Moving Bed Chromatographic Reactor for Oxidative Coupling of Methane","2473370":"An Evolutionary Algorithm With A Multilevel Pairing Strategy For Single And Multiobjective Optimization","3193330":"Extraction and optimization of B-spline PBD templates forrecognition of connected handwritten digit strings","220119258":"Multi-objective genetic algorithms: A way to improve the convergence rate","49640241":"Gaboxadol has affinity for the proton-coupled amino acid transporter 1, SLC36A1 (hPAT1)-A modelling approach to determine IC50 values of the three ionic species of gaboxadol","4074996":"A hybrid multiobjective evolutionary algorithm for solving truck and trailer vehicle routing problems","224472234":"Performance Assessment of Generalized Differential Evolution 3 with a Given Set of Constrained Multi-Objective Test Problems","258160302":"A generalized computing paradigm based on artificial dynamic models for mathematical programming","3924470":"Multiobjective hierarchical 2G/3G mobility management optimization: Niched Pareto genetic algorithm","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","220850425":"Design of Hybrid Learning Control for Flexible Manipulators: a Multi-objective Optimisation Approach.","260621912":"Preference-Inspired Coevolutionary Algorithms for Many-Objective Optimization","228393036":"A generic optimal feature extraction method using multiobjective genetic programming","3996136":"Closed-loop time-optimal path planning using a multi-objective diversity control oriented genetic algorithm","2568691":"Models for Evolutionary Algorithms and Their Applications in System Identification and Control Optimization","3218917":"A Multiobjective Genetic Algorithm for Optimizing the Performance of Hard Disk Drive Motion Control System","221009144":"Integrating Categorical Variables with Multiobjective Genetic Programming for Classifier Construction","5606787":"Multiobjective evolutionary optimization of the size, shape, and position parameters of radial basis function networks for function approximation","6286727":"Multiobjective Optimization and Hybrid Evolutionary Algorithm to Solve Constrained Optimization Problems","269159888":"Multicriteria Scheduling in Water Resources Engineering Using Genetic Algorithm","3455466":"Evolutionary multi-objective optimization: A historical view of the field","261460596":"Preference-inspired co-evolutionary algorithm using adaptively generated goal vectors","224602240":"A Novel Protocol for Accuracy Assessment in Classification of Very High Resolution Images","6281659":"Molecular optimization using computational multi-objective methods","252045027":"Multi-fidelity Simulation modelling in optimization of a hybrid submarine propulsion system","3217884":"Optimal file placement in VOD system using genetic algorithm","278679922":"Application of Evolutionary Algorithms for Multi-objective Optimization in VLSI and Embedded Systems","281760036":"Comparison of various approaches in multi-objective particle swarm optimization (MOPSO): Empirical study","246900549":"Multiobjective controller design: Optimising controller structure with genetic algorithms","226373770":"A method for evaluating functional content in mechatronic systems using optimisation","8608117":"An Orthogonal Multi-objective Evolutionary Algorithm for Multi-objective Optimization Problems with Constraints","221008086":"Delta-V genetic optimisation of a trajectory from Earth to Saturn with fly-by in Mars","3217866":"An optimal fuzzy PID controller","221787331":"Evolutionary Multi-Objective Robust Optimization","274270626":"Optimization of Gas Transmission Networks under Energetic and Environmental Considerations","220284125":"An Experimental Study of Multi-objective Genetic Algorithms.","225620108":"Constrained Optimization Based on Quadratic Approximations in Genetic Algorithms","228951130":"Co-operative co-evolutionary genetic algorithms for multi-objective topology design","220558554":"An adaptive decision maker for constrained evolutionary optimization","220445475":"ARQ-based cross-layer optimization for wireless multicarrier transmission on cognitive radio networks","220952363":"Scheduling in a Grid Computing Environment Using Genetic Algorithms.","235768844":"Multiobjective Genetic Algorithm for Three-Phase PWM Inverter in Microturbines","224306013":"Comparison of Submarine Drive Topologies Using Multiobjective Genetic Algorithms","216301280":"Conflict, Harmony, and Independence: Relationships in Evolutionary Multi-criterion Optimisation","3418674":"Evolutionary algorithms with dynamic population size and local exploration for multiobjective optimization","3217977":"Fuzzy scheduling control of a gas turbine aero-engine: A multiobjective approach","262837666":"The Shapley Value in Marketing Research: 15 Years and Counting","224601962":"Genetic algorithms and treatment of multiple objectives in the allocation of capacitor banks in an electric power distribution system","216301293":"Liew, K.: A Swarm Metaphor for Multiobjective Design Optimization. Engineering Optimization 34, 141-153","224141142":"Evolutionary Trajectory Planner for Multiple UAVs in Realistic Scenarios","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","227676062":"Evolutionary search for limit cycle and controller design in multivariable nonlinear systems","290742104":"A Real-World Application of a Many-Objective Optimisation Complexity Reduction Process","224301904":"Performance assessment of Generalized Differential Evolution 3 (GDE3) with a given set of problems","254012717":"The Non-dominated Sorting Genetic Algorithm Based on Layered Target","279845536":"MOGA design for neural networks based system for automatic diagnosis of Cerebral Vascular Accidents","4279886":"New Dynamic Multi-Objective Constrained Optimization Evolutionary Algorithm","224324430":"Multiobjective Evolutionary Algorithm Based on the Pareto Archive and Individual Migration","227642240":"Multiobjective optimization of SMB and VARICOL™ process for chiral separation","239386709":"Tensegrity Active Control: Multiobjective Approach","2615861":"Information Acquisition in Data Fusion Systems","258290038":"dms","262360503":"Aero engine health management system architecture design using multi-criteria optimization","220742461":"Multicriteria Network Design Using Evolutionary Algorithm","216300273":"Evolutionary Optimization of Mould Temperature Control Strategies: Encoding and Solving the Multiobjective Problem with Standard Evolution Strategy and Kit for Evolutionary Algorithms","257512782":"The review of multiple evolutionary searches and multi-objective evolutionary algorithms","3865120":"Accelerating multi-objective control system design using a neuro-genetic approach","235342876":"Decentralized Design Under Uncertainty: Investigating the Impact of Designer Mistakes","225999718":"Solution of multiobjective optimization problems: Coevolutionary algorithm based on evolutionary game theory","220637959":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons.","290767735":"‘‘Whatever Works Best for You’’- A New Method for a Priori and Progressive Multi-objective Optimisation","228812677":"Game theory based coevolutionary algorithm: A new computational coevolutionary approach","262405508":"On Set-Based Multiobjective Optimization","277287597":"The multiobjective genetic . . . benchmark problems -- an analysis","4185620":"Multiobjective Genetic Algorithms for Fuzzy Inverter in Solid Oxide Fuel Cell System","4375145":"Extracting Compact Fuzzy Model for MIMO Systems Using Multi-Objective Genetic Algorithms","2817543":"Metaheuristics for Multiple Objective Combinatorial Optimization","3418649":"Planning multiple paths with evolutionary speciation","225078087":"Strategies of multi-objective optimization in drug discovery and development","2633240":"Multi-Objective Evolutionary Algorithms: Introducing Bias Among Pareto-Optimal Solutions","4075018":"Constrained optimization based on a multiobjective evolutionary algorithm","4131335":"An approach to design reverse logistics networks for product recovery","259982663":"Pre-emption strategies for efficient multi-objective optimization: Application to the development of Lake Superior regulation plan","2446876":"MOBES: A Multiobjective Evolution Strategy for Constrained Optimization Problems","220355355":"Optimization Models of Sound Systems Using Genetic Algorithms","259170632":"A simulated annealing for multi-criteria optimization problem: DBMOSA","229369750":"Multiobjective genetic algorithm strategies for electricity production from generation IV nuclear technology","220549914":"Nonlinear identification of aircraft gas-turbine dynamics","3433077":"Hierarchical provisioning for cellular networks","269998677":"Aggregation Trees for visualization and dimension reduction in many-objective optimization","223727383":"A meta-level evolutionary strategy for many-criteria design: Application to improving tracking filters","226070333":"Evolutionary Algorithms and Constrained Optimization","2249323":"Evolutionary Algorithms for Multi-Criterion Optimization in Engineering Design","3418750":"Dynamic multiobjective evolutionary algorithm: Adaptive cell-based rank and density estimation","287505256":"Multi-objective optimization of operating parameters of a MSF-BR desalination plant using solver optimization tool of Matlab software","235745345":"Developing Parsimonious and Efficient Algorithms for Water Resources Optimization Problems","257153311":"Multi-objective simulation optimization using data envelopment analysis and genetic algorithm: Specific application to determining optimal resource levels in surgical services","3453562":"A Jumping-Genes Paradigm for Optimizing Factory WLAN Network","220392300":"A hybrid system for multiobjective problems - A case study in NP-hard problems","224645933":"On Solving Multiobjective Bin Packing Problems Using Particle Swarm Optimization","2485866":"Multiobjective Genetic Algorithm Applied To Benchmark Problems - An Analysis","241259569":"Evolutionary algorithms in control system engineering","220902266":"Goal oriented ranking scheme","2571891":"A GA Based Configuration Design Optimization Method","221392742":"PSFGA: A Parallel Genetic Algorithm for Multiobjective Optimization.","8997597":"An Adaptive Sharing Elitist Evolution Strategy for Multiobjective Optimization","281319065":"Intelligent multi-objective control and management for smart energy efficient buildings","221026163":"Interactive Multiobjective Evolutionary Algorithms","262352323":"On finding well-spread pareto optimal solutions by preference-inspired co-evolutionary algorithm","222833449":"Obtaining transparent models of chaotic systems with multi-objective simulated annealing algorithms","2358850":"Fuzzy Approach for Modeling Multiple Criteria in the Job Grouping Problem","3418709":"A weighted sum genetic algorithm to support multiple-party multi-objective negotiations","236341365":"On the Performance Comparison of Multiobjective Evolutionary UAV Path Planners","221007688":"The multiobjective evolutionary algorithm based on determine weight and sub-regional search","279421646":"Cognitive Resource Manager","245193969":"Neural network and genetic algorithms for optimizing the plate element of Egyptian research reactor problems","220350285":"Skyline queries with constraints: Integrating skyline and traditional query operators","223816485":"Applying Multi-Objective Genetic Algorithms in Green Building Design Optimization","245413076":"Search for phosphors for use in displays and lighting using heuristics-based combinatorial materials science","224256811":"Multiobjective two-level 0–1 programming through distributed genetic algorithms","3931714":"Total system cost minimization in CDMA PCS network using hierarchical genetic algorithms","3040855":"Optimal Video Placement Scheme for Batching VOD Services","223043378":"Computational steering of a multi-objective evolutionary algorithm for engineering design","226254597":"Optimization Problems for Port-of-Entry Detection Systems","2367140":"Bi-Objective Genetic Algorithms for Forest Management: A Comparative Study","3421873":"Optimal Advertising Campaign Generation for Multiple Brands Using MOGA","36426925":"起業支援の現場を見てわかったこと","255610299":"Extraction of interesting association rules using genetic algorithms","3280570":"Fuzzy Optimization Techniques Applied to the Design of a Digital PMSM Servo Drive","224384981":"Dynamic Multiple Swarms in Multiobjective Particle Swarm Optimization","4340425":"Cognitive Radio Testbed: Exploiting Limited Feedback in Tomorrow\u0027s Wireless Communication Networks","251389046":"Simultaneous Optimization of Actuator Placement and Structural Parameters by Mathematical and Genetic Optimization Algorithms","228633391":"Biobjective evolutionary and heuristic algorithms for intersection of geometric graphs","4208337":"A game model based co-evolutionary for constrained multiobjective optimization problems","220654519":"Domain-independent feature extraction for multi-classification using multi-objective genetic programming","224292810":"Comparison of the Effectiveness of Different Cost Functions in Global Optimization Techniques","229722918":"Three‐dimensional weak‐form conjugate‐ and biconjugate‐gradient FFT methods for volume integral equations","275331838":"A Walk into Metaheuristics for Engineering Optimization: Principles, Methods and Recent Trends","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","232875897":"Multiobjective design optimization by an evolutionary algorithm","220116870":"A Proportional-Integral Control Policy of Two Coupled Concurrent Design Optimization Processes","12473892":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","3418799":"On-Line Genetic Design of Anti-Windup Unstructured Controllers for Electric Drives With Variable Load","51692937":"Diagnostic Assessment of Search Controls and Failure Modes in Many-Objective Evolutionary Optimization","238007439":"Evolutionary multi-objective approach to control of mobile robot in unknown environment","248952948":"Optimal design of artificial neural networks by a multi-objective strategy: groundwater level predictions. Hydrol Sci J","256733673":"Multi-objective optimization of the sandwich panels with prismatic cores using genetic algorithms","220118967":"Designing feedforward command shapers with multi-objective genetic optimisation for vibration control of a single-link flexible manipulator","224854999":"Development and validation of an improved algorithm for overlaying flexible molecules","3418757":"Rank-density-based multiobjective genetic algorithm and benchmark test function study","221144987":"Coordination Optimization-based Variable Structure Control for Main Steam Pressure of Power Plant.","221547393":"A Many-Objective Optimisation Decision-Making Process Applied to Automotive Diesel Engine Calibration","220381079":"A Novel Immune Clonal Algorithm for MO Problems","220215190":"Optimization of an established multi-objective delivering problem by an improved hybrid algorithm","7873231":"Generation of multiple pharmacophore hypotheses using multiobjective optimisation techniques","226831164":"A Pareto evolutionary algorithm approach to bi-objective unrelated parallel machine scheduling problems","257635809":"Ant colony based feedback controller design for soft-starter fed induction motor drive","223363051":"Prediction of building\u0027s temperature using neural networks models","243350589":"Optimising flat-walled multi-layered anechoic linings using evolutionary algorithms","277004863":"Review of Artificial Intelligence Techniques and their Applications to Hydrological Modeling and Water Resources Management. Part 2 – Optimization","5520105":"New directions in library design and analysis","3418762":"Self-Adaptive Fitness Formulation for Constrained Optimization","230025079":"Robust Material Design: A New Workflow for High‐Throughput Experimentation and Analysis","225859507":"Leader identification and leader selection: Its effect on a swarm\u0027s performance for multi-objective design optimization problems","224224152":"Multi-fidelity simulation modelling in optimization of a submarine propulsion system","265570578":"Applications of soft computing. Recend trends","220199893":"Evolutionary-based techniques for real-life optimisation: Development and testing","254864890":"Rotordynamic Optimization of Large Turbo Systems using Genetic Algorithms","8231606":"Incremental Multiple Objective Genetic Algorithms","229121891":"Multiobjective Path Planner for UAVs Based on Genetic Algorithms","251722187":"Metabolic syndrome in the elderly and its clinical implications","228831087":"Multiobjective Genetic Algorithm for Rolling-Horizon Production Planning","4353679":"A New Key Exchange Scheme Based on Chebyshev Polynomials","221006844":"Constraint handling in multi-objective evolutionary optimization","220133323":"Direct Multisearch for Multiobjective Optimization","221308901":"Parallel Evolutionary Computation: Application of an EA to Controller Design","3996394":"Causality assignment using multi-objective evolutionary algorithms","228700022":"A multiobjective optimisation system for a glass furnace","274460300":"A New Multi-Objective Performance Criterion used in PID Tuning Optimization Algorithms","224301958":"Biped fast walking gait shaping via evolutionary multi-objective optimization","49282102":"Multi-level Ranking for Constrained Multi-objective Evolutionary Optimisation","230852379":"Design, Analysis, Modeling, Simulation, and Control of Microscale and Nanoscale Cell Manipulations","239549595":"MULTI-OBJECTIVE CONTROLLER DESIGN: EVOLUTIONARY ALGORITHMS AND BILINEAR MATRIX INEQUALITIES FOR A PASSIVE SUSPENSION","224301953":"Ranking-Dominance and Many-Objective Optimization","261598582":"Controller tuning using evolutionary multi-objective optimisation: Current trends and applications","4157149":"Kolmogorov-Chaitin complexity of linear digital controllers implemented using fixed-point arithmetic","221216717":"World-wide Accessible LDPC Encoder/Decoder Generator Using Web-based GUI and API","220741579":"An Evolutionary Algorithm for Constrained Optimization","261842296":"Evolutionary Algorithms","220381124":"Effective Evolutionary Algorithms for Many-Specifications Attainment: Application to Air Traffic Control Tracking Filters.","2616014":"Multicriteria Optimization with Export Rules for Mechanical Design","3418842":"A Generic Framework for Constrained Optimization Using Genetic Algorithms","249354284":"Multiconstraint Optimization of Composite Structures Manufactured by Resin Transfer Molding Process","216301078":"Optimal design for problems involving flow and transport phenomena in saturated subsurface systems. Adv Water Resour 25(8-12):1233-1256","233687833":"Improved rank-niche evolution strategy algorithm for constrained multiobjective optimization","261457248":"Coevolutionary Multi-Objective EAs: The Next Frontier?","224058284":"Concurrent Optimization for Parameters of Powertrain and Control System of Hybrid Electric Vehicle Based on Multi-Objective Genetic Algorithms","220313561":"Multi-criteria genetic optimisation of the manoeuvres of a two-stage launcher","260636017":"Multi-Objective Parameter Optimization in Support Vector Regression: General Formulation and Application to the Retrieval of Soil Moisture From Remote Sensing Data","221024214":"A Multiobjective Evolutionary Algorithm for Car Front End Design.","4147904":"Path planning for bearing-only simultaneous localisation and mapping","291843994":"Design on a Composite Mobile System for Exploration Robot","3352371":"Shift and delta operator realisations for digital controllers with finite word length considerations","222825032":"Adaptive Genetic Algorithms Applied to Dynamic Multiobjective Problems","3928890":"Evolutionary algorithm with dynamic population size for multi-objective optimization","221009448":"Applying Cost-Sensitive Multiobjective Genetic Programming to Feature Extraction for Spam E-mail Filtering","228360857":"Domain-independent approaches to optimize feature extraction for multi-classification using multi-objective genetic programming","225130083":"EFuNN Ensembles Construction Using a Clustering Method and a Coevolutionary Multi-objective Genetic Algorithm","223820380":"Design optimization of a safety-instrumented system based on RAMS+C addressing IEC 61508 requirements and diverse redundancy","3959600":"An evolution computation approach to hybrid dynamic system optimal control problems","270752558":"Applying Genetic Algorithms to Optimize Energy Efficiency in Buildings","252015626":"Hybrid GA-BF based intelligent PID active queue management control design for TCP network","221228607":"A Diversity Management Operator for Evolutionary Many-Objective Optimisation","2385717":"A Study of Examination Timetabling with Multiobjective Evolutionary Algorithms","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","228567692":"Visualization Technique for Analyzing Non-Dominated Set Comparison","227679873":"Accelerating adaptive trade‐off model using shrinking space technique for constrained evolutionary optimization","3418912":"A Multiobjective Optimization-Based Evolutionary Algorithm for Constrained Optimization","220741181":"An efficient multi-objective evolutionary algorithm with steady-state replacement model","253012993":"CONTROL MULTIOBJETIVO DE UN FERRY DE ALTA VELOCIDAD","229657254":"Multiobjective optimization of molded LDPE foams characteristics using genetic algorithm","3949355":"Design of Multi-Objective Evolutionary Algorithms: Application to the Flow-Shop Scheduling Problem","264289495":"Adaptive multiple evolutionary algorithms search for multi-objective optimal reactive power dispatch","220462651":"Setup coordination between two stages of a production system: A multi-objective evolutionary approach","3217195":"Use of fuzzy logic to describe constraints derived from engineering judgment in genetic algorithms","216300536":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimisation: NSGA-II.","237079868":"Structuration d\u0027ateliers hybrides","220276286":"PSFGA: Parallel processing and evolutionary computation for multiobjective optimisation","3412759":"Interactive Particle Swarm: A Pareto-Adaptive Metaheuristic to Multiobjective Optimization","3949336":"An evolutionary algorithm for constrained multi-objective optimization","224311929":"Effective Evolutionary Algorithms for Many-Specifications Attainment: Application to Air Traffic Control Tracking Filters","276377424":"An analysis of parameter sensitivities of preference-inspired co-evolutionary algorithms","3949334":"Preliminary statement on the current progress of multi-objective evolutionary algorithm performance measurement","220199474":"The use of multiple objective genetic algorithm in self-healing network","282610677":"Many-Objective Problems: Challenges and Methods","239014157":"THE MULTI-CRITERION OPTIMIZATION OF BUILDING THERMAL DESIGN AND CONTROL","220742172":"Multiobjective network design for realistic traffic models","234024647":"MOGA Design of Neural Network Predictors of Inside Temperature in Public Buildings","221228569":"Comparison of Evolutionary and Deterministic Multiobjective Algorithms for Dose Optimization in Brachytherapy","221024794":"Consideration of Partial User Preferences in Evolutionary Multiobjective Optimization","220743199":"An Evolutionary Technique for Multicriterial Optimization Based on Endocrine Paradigm","272408331":"Generic Constraints Handling Techniques in Constrained Multi-criteria Optimization and its Application","245562778":"Short-Haul Airline Crew Rostering by Using Inequality-Based Multiobjective Genetic Algorithm","224055904":"Application of multiobjective genetic algorithms in anatomy based dose optimization in brachytherapy and its comparation with deterministic algorithms","228817566":"Multi-objective Evolutionary Design of Robust Controllers on the Grid⋆","5893912":"Automatic waveguide-fiber coupling system based on a multiobjective evolutionary algorithm","232638111":"Parallel Single Front Genetic Algorithm: Performance Analysis in a Cluster System","4065148":"Multiobjective Resource Optimization in Mobile Communication Network","277972946":"Compromise Rank Genetic Programming for Automated Nonlinear Design of Disaster Management","6598432":"Incorporating partial matches within multiobjective pharmacophore identification","262304999":"Including preferences into a multiobjective evolutionary algorithm to deal with many-objective engineering optimization problems","251507131":"Multiobjective Strategies for New Product Development in the Pharmaceutical Industry","221915772":"PID Tuning: Robust and Intelligent Multi-Objective Approaches","257673232":"Intelligent Systems in Optimizing Reservoir Operation Policy: A Review","225876541":"Constrained Optimization via Multiobjective Evolutionary Algorithms","220955237":"Effective Evolutionary Multimodal Optimization by Multiobjective Reformulation Without Explicit Niching/Sharing","4049778":"A game theoretic model for management of mobile sensors","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","223454721":"A dominance tree and its application in evolutionary multi-objective optimization","222570005":"Design of robust fuzzy-logic control systems by multi-objective evolutionary methods with hardware in the loop","224570931":"Closed-loop evolutionary multiobjective optimization","224215564":"Preference-Based Solution Selection Algorithm for Evolutionary Multiobjective Optimization","232643214":"Cross-Layer Architecture in Cognitive Ad Hoc Networks","3352423":"Genetic algorithm approach to designing finite-precision controllerstructures","220719731":"Evolutionary Multi-objective Optimisation by Diversity Control.","238514531":"Genetic Algorithms for Forest Harvest Adjustment","6758207":"Combining Genetic Algorithms and Lyapunov-Based Adaptation for Online Design of Fuzzy Controllers","257921031":"An analysis of multiobjective evolutionary algorithms for optimization problems with time constraints","225876523":"An Introduction to Multiobjective Metaheuristics for Scheduling and Timetabling","4939564":"Evolutionary multi-objective optimization","260332771":"Multiobjective Optimization","268802925":"Choice Function based Hyper-heuristics for Multi-objective Optimization","268059793":"Solar Cell Parameter Identification Using Genetic Algorithms","220742234":"Evolutionary Multiobjective Optimization","221006430":"Incorporation of imprecise goal vectors into evolutionary multi-objective optimization","277887970":"Multi-Objective Genetic Algorithm for Berth Allocation Problem Considering Daytime Preference","224580118":"Convergence Acceleration Operator for Multiobjective Optimization","226686708":"Evolutionary Computation","223792672":"A decision support system for the electrical power districting problem","260211956":"A multi-objective hyper-heuristic based on choice function","221228632":"Multiobjective Optimization of Mixed Variable Design Problems","220204631":"A diversity preserving selection in multiobjective evolutionary algorithms. Appl Intell","236327278":"D(2)MOPSO: MOPSO based on Decomposition and Dominance with Archiving using Crowding Distance in Objective and Solution Spaces.","275027741":"Branching to Find Feasible Solutions in Unmanned Air Vehicle Mission Planning","224177702":"A novel memetic algorithm for constrained optimization","5266218":"Neuro-genetic non-invasive temperature estimation: Intensity and spatial prediction","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","242376975":"Cost-effective Evolutionary Strategies for Pareto Optimal Front Approximation in Multiobjective Shape Design Optimization of Electromagnetic Devices","223326770":"Solution to the Shell standard control problem using genetically tuned PID controllers","2377646":"Evolutionary Algorithms for Multiobjective Optimization","3949494":"Topological design of communication networks using multiobjective genetic optimization","259505405":"General framework for localised multi-objective evolutionary algorithms","220608170":"A Multiobjective Particle Swarm Optimizer for Constrained Optimization","220380846":"Neighborhood Knowledge-Based Evolutionary Algorithm for Multiobjective Optimization Problems","226482930":"On Improving Multiobjective Genetic Algorithms for Design Optimization","221522596":"A New Fuzzy-Based Multi-Objective Optimization Concept for Process Control Systems","226202344":"Bond Graph Causality Assignment and Evolutionary Multi-Objective Optimization","222522071":"Multi-Objective Optimization of Membrane Separation Modules Using Genetic Algorithm","221006522":"Local search with quadratic approximation in Genetic Algorithms for expensive optimization problems","284779375":"Preference Incorporation in Evolutionary Multiobjective Optimization: A Survey of the State-of-the-Art","262281274":"Coherent design methodology using modelling, simulation and optimisation","4319192":"Application of Computation Intelligence Techniques for Energy Load and Price Forecast in some States of USA","223341269":"Robustness analysis of a reusable launch vehicle flight control law","27812403":"Strategies for multiobjective genetic algorithm development: Application to optimal batch plant design in process systems engineering","220289727":"Balancing exploration and exploitation with adaptive variation for evolutionary multi-objective optimization","224089796":"Reactive Power Planning Using a Two-Level Optimizer Based on Multi-Objective Algorithms","224697031":"Optimization of Position Control of Induction Motors using Compact Genetic Algorithms","234802779":"Coello, C.A.C.: An updated survey of GA-based multi-objective optimization techniques. ACM Computing Surveys 32(2), 109-143","220743311":"Methodology to select solutions from the pareto-optimal set: A comparative study","251555161":"Cost analysis for removal of VOCs from water by pervaporation using NSGA-II","220341898":"Multi-objective optimization of operational variables in a waste incineration plant","232638068":"A Virus Evolutionary Honeybee Mating Optimization","257684722":"Algoritmos Evolutivos y su empleo en el ajuste de controladores del tipo PID: Estado Actual y Perspectivas","2637698":"Comparison Of Two Multiobjective Optimization Techniques With And Within . . .","220403343":"Effects of diversity control in single-objective and multi-objective genetic algorithms","261196860":"Inverse induction motor modelling of a submarine propulsion system","226195156":"Multiobjective GP for Human-Understandable Models: A Practical Application","253585581":"Multiobjective Genetic Algorithm for Product Design","3411845":"Multi-Objective Optimization and Multiple Constraint Handling with Evolutionary Algorithms – Part II: A Unified Formulation","3419014":"An Adaptive Tradeoff Model for Constrained Evolutionary Optimization","220727962":"Multicriteria Network Design Using Distributed Evolutionary Algorithm","254462104":"GECCO 2012 tutorial on evolutionary multiobjective optimization","240985576":"Geometric Thermodynamical Selection for Evolutionary Multi-Objective Optimization: Geometric Thermodynamical Selection for Evolutionary Multi-Objective Optimization","227914275":"Meta‐material surface design using the hierarchical genetic algorithm","4035461":"Computer aided design of sub-100 nm strained-Si/Si\u003csub\u003e1-x\u003c/sub\u003eGe\u003csub\u003ex\u003c/sub\u003e NMOSFET through integrated process and device simulations","3454857":"Nonlinear tuning of aircraft controllers using genetic global optimization: A new periodic mutation operator","222414588":"Floor shape optimization for green building design","3419017":"A Jumping Gene Paradigm for Evolutionary Multiobjective Optimization","239392251":"Pareto optimization using the struggle genetic crowding algorithm","220063452":"An evolutionary strategy for decremental multiobjective optimization problems","227154507":"Multiobjective Evolutionary Search of Difference Equations-based Models for Understanding Chaotic Systems","277703502":"Intelligent Decision Support Systems","220144347":"A roadmap from UMTS optimization to LTE self-optimization","260354114":"Granular Neural Networks: Concepts and Development Schemes","271736820":"Optimization of stamping process parameters to predict and reduce springback and failure criterion","222687874":"Evolving car designs using model-based automated safety analysis and optimisation techniques","254055660":"Enabling run-time utility-based optimization through generic interfaces in wireless networks","224645801":"Preference Incorporation in Multi-objective Evolutionary Algorithms: A Survey","285991617":"IMPROVED APRIORI ALGORITHM USING GENETIC ALGORITHM FOR ITEMSET MINING","252012745":"Concurrent optimization for parameters of hybrid electric vehicle based on Non-dominated Sorting Genetic Algorithms","220509928":"Evolutionary Multiobjective Footstep Planning for Humanoid Robots","223510173":"Evolutionary approaches to the design and organization of manufacturing systems","268296236":"COORDINATED RESCHEDULING OF PRECAST PRODUCTION","225663650":"Computational Intelligence in Multimedia Networking and Communications: Trends and Future Directions","12698386":"Tissue harmonic imaging","272163821":"Genetic algorithm for solving bi-objective redundancy allocation problem with k-out-of-n subsystems","4044772":"Multiobjective optimization of the transport in oil pipelines networks","280237929":"Development of Pareto-based evolutionary model integrated withdynamic goal programming and successive linear objective reduction","254848238":"An Integrated Evaluation System for the Conceptual Design of Space Systems","222830249":"A generic optimising feature extraction method using multiobjective genetic programming","45868377":"Techniques for Highly Multiobjective Optimisation: Some Nondominated Points are Better than Others","265237547":"Interleaving Innovization with Evolutionary Multi-Objective Optimization in Production System Simulation for Faster Convergence","273525673":"Optimization of Cellular Automata Model for the Heating of Dual-Phase Steel by Genetic Algorithm and Genetic Programming","224349880":"Jumping gene genetic algorithm and its applications in controller design","220176120":"Qian, S.: Artificial immune system in dynamic environments solving time-varying non-linear constrained multi-objective problems. Soft Comput. 15(7), 1333-1349","235355631":"Unified forms for Kalman and finite impulse response filtering and smoothing","220204745":"Integrating multi-objective genetic algorithm based clustering and data partitioning for skyline computation","278851447":"Cloud Resource Scheduling Using Semantic Search Engine Based on Improved Parallel Genetic Algorithm","3018692":"BÉzier Representations for the Multiobjective Optimization of Conformal Array Amplitude Weights","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","4047821":"A bicriteria optimization approach for robust OSPF routing","224349871":"Using a Genetic Algorithm to obtain a neural network-based model of a real autonomous vehicle","250158360":"SENSITIVITY ANALYSIS IN PARETO OPTIMAL DESIGN","235349493":"“Effective generation of Pareto sets using genetic programming”","221024990":"Future Challenges.","235343347":"Feasibility Assessment in Preliminary Design Using Pareto Sets","4201396":"A hybrid multi-objective evolutionary algorithm using an inverse neural network for aircraft control system design","260652156":"Hybrid Training Method for MLP: Optimization of Architecture and Training","250417435":"FINDING ROBUST SOLUTIONS TO MULTI-OBJECTIVE OPTIMISATION PROBLEMS USING POLYNOMIAL CHAOS","222534332":"Multi-objective Optimization using Genetic Algorithms: a Tutorial"},"index":807}