{"abs":"Abstract This paper addresses the vehicle routing problem with route balancing (VRPRB), which aims at minimizing two criteria simultaneously: the total routing cost and the difference between the largest and smallest route cost. We propose a multi-start approach based on two search spaces each of them using a different solution presentation: a TSP tour that denotes an indirect solution based on a sequence of customers as in the Traveling Salesman Problem, and a VRPRB solution that denotes a complete solution containing a set of vehicle trips. Switching from an indirect to a complete solution is possible through an adaptation of a splitting algorithm considering both optimization criteria. More precisely, such an adaptation requires an acceptance criterion allowing the generation a set of non-dominated VRPRB solutions from a single TSP tour. A path relinking algorithm improves the set of obtained VRPRB solutions. The proposed method is evaluated on VRPRB instances derived from classical VRP instances and the results reveal the method as effective in comparison with the best published algorithms for the problem optimizing the total routing cost. Regarding both criteria, the method competes with a previous published method handling the VRPRB. In fact, it is able to provide similar results in shorter computational time and since no details are available on state-of-the-art fronts, no further conclusion can be made. A web page presents all the solutions on our fronts to favor future comparative studies. Furthermore, the proposed method allows tackling a variant of the problem ignored by the previous works on VRPRB, which integrates limitation on vehicle service time.","title":"A Multi-Start Split based Path Relinking (MSSPR) approach for the vehicle routing problem with route balancing","id":277889699,"url":"https://www.researchgate.net/publication/277889699_A_Multi-Start_Split_based_Path_Relinking_MSSPR_approach_for_the_vehicle_routing_problem_with_route_balancing","names":["Philippe Lacomme","Christian Prins","Caroline Prodhon","Libo Ren","Engineering Applications of Artificial Intelligence"],"references":{"220340131":"Solving the capacitated location-routing problem by a GRASP complemented by a learning process, a path relinking","222542023":"Active-guided evolution strategies for large-scale capacitated vehicle routing problems","235709769":"Evaluating the quality of approximation to the non-dominated set","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","225159981":"GRASP with Path Relinking for the Capacitated Arc Routing Problem with Time Windows","220209192":"A heuristic two-phase solution method for the multi-objective dial-a-ride problem","220471790":"A GRASP with evolutionary path relinking for the truck and trailer routing problem. Computers \u0026 Operations Research","220403560":"Path relinking for the vehicle routing problem","220471279":"Efficient frameworks for greedy split and new depth first search split procedures for routing problems","237009133":"Statistical analysis of distance-based path relinking for the capacitated vehicle routing problem","220119312":"A multi-start iterated local search with tabu list, path relinking for the two-echelon location-routing problem","221024162":"Enhancements of NSGA II and Its Application to the Vehicle Routing Problem with Route Balancing","220867387":"A Genetic Algorithm for the Capacitated Arc Routing Problem and Its Extensions","50341778":"A genetic algorithm for a bi-objective capacitated arc routing problem","225771616":"Heuristics for the lexicographic max-ordering vehicle routing problem","3949545":"On metrics for comparing nondominated sets","3755951":"More distance functions for order-based encodings","239442974":"Competitive genetic algorithms for the Capacitated Arc Routing Problem and its extensions","220431230":"The String-to-String Correction Problem","23793206":"Route first--Cluster second methods for vehicle routing","223760907":"A Path Relinking approach for the Team Orienteering Problem","220403390":"Distance measures based on the edit distance for permutation-type representations","222547293":"Prins, C.: A simple and effective evolutionary algorithm for the vehicle routing problem. Computer \u0026 Operations Research 31(12), 1985-2002","222402782":"GRASP and path relinking for the matrix bandwidth minimization","260231970":"Order-first split-second methods for vehicle routing problems: A review","223934585":"An evolutionary algorithm for the vehicle routing problem with route balancing","220209473":"Edge Assembly based Memetic Algorithm for the Capacitated Vehicle Routing Problem","216300934":"On metrics for comparing non-dominated sets","225314957":"Scatter Search and Path Relinking: Advances and Applications","285025433":"The optimal agricultural products transportation routing planning with the case study of the routing from Taichung to Hsinchu in Taiwan","226136659":"A Hybrid Heuristic for the p-Median Problem","46487081":"The balanced cargo vehicle routing problem with time windows","220668937":"Context-Independent Scatter and Tabu Search for Permutation Problems","267109723":"The Vehicle Routing Problem: Latest Advances and New Challenges. Springer, New York","220588884":"Mingozzi, A.: An unified exact method for solving different classes of vehicle routing problems. Math. Program. Ser. A 120(2), 347-380","2543892":"Performance of Various Computers Using Standard Linear Equations Software","222319346":"A memetic algorithm and a tabu search for the multi-compartment vehicle routing problem. Computers \u0026 Operations Research","256910307":"Implicit Depot Assignments and Rotations in Vehicle Routing Heuristics","220462480":"Competitive Memetic Algorithms for Arc Routing Problems","3693004":"Distance functions for order-based encodings","257568226":"A path relinking algorithm for a multi-depot periodic vehicle routing problem, Technical Report","220119331":"A hybrid evolutionary local search with depth first search split procedure for the heterogeneous vehicle routing problems","221411215":"An Effective Memetic Algorithm with Population Management for the Split Delivery Vehicle Routing Problem","235290041":"A study of vehicle routing problems with load-balancing","245278241":"An Algorithm For the Vehicle Dispatching Problem","220472219":"A reactive GRASP and path relinking for a combined production-distribution problem"},"citedIn":{"287632562":"A game-based meta-heuristic for a fuzzy bi-objective reliable hub location problem"},"index":809}