{"abs":"This work studies the working principles, behavior, and performance of multiobjective evolutionary algorithms (MOEAs) on multiobjective epistatic fitness functions with discrete binary search spaces by using MNK-landscapes. First, we analyze the structure and some of the properties of MNK-landscapes under a multiobjective perspective by using enumeration on small landscapes. Then, we focus on the performance and behavior of MOEAs on large landscapes. We organize our study around selection, drift, mutation, and recombination, the four major and intertwined processes that drive adaptive evolution over fitness landscapes. This work clearly shows pros and cons of the main features of MOEAs, gives a valuable guide for the practitioner on how to set up his/her algorithm, enhance MOEAs, and presents useful insights on how to design more robust and efficient MOEAs.","title":"Working principles, behavior, and performance of MOEAs on MNK-landscapes","id":223562060,"url":"https://www.researchgate.net/publication/223562060_Working_principles_behavior_and_performance_of_MOEAs_on_MNK-landscapes","names":["Hernan Eduardo Aguirre","Kiyoshi Tanaka","European Journal of Operational Research"],"references":{"216300837":"Mating Scheme for Controlling the Diversity-Convergence Balance for Multiobjective Optimization","3949503":"Scalable multi-objective optimization test problems","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","216457263":"Lecture Notes in Computer Science","4089972":"Effects of elitism and population climbing on multiobjective MNK-landscapes","37811275":"The Origins Order. Self-Organization and Selection in Evolution","220701941":"SPEA2+: Improving the Performance of the Strength Pareto Evolutionary Algorithm 2","3575268":"Evolving better representations through selective genome growth","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","4090091":"Multi-objective fast messy genetic algorithm solving deception problems","3949545":"On metrics for comparing nondominated sets","201976464":"Epistasis Variance: A Viewpoint on GA-Hardness","2493567":"Multi-Objective Bayesian Optimization Algorithm","4089892":"Insights on properties of multiobjective MNK-landscapes","3755941":"Domino convergence, drift, and the temporal-salience structure of problems","220743605":"A Similarity-Based Mating Scheme for Evolutionary Multiobjective Optimization","201976023":"The Genetic Algorithm and the Structure of the Fitness Landscape","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107","3755993":"On the Effectiveness of Evolutionary Search in High-Dimensional NK-Landscapes","243729702":"In Foundations of Genetic Algorithms 4","2918861":"An Empirical Study on the Effect of Mating Restriction on the Search Ability of EMO Algorithms","220740937":"NCGA: Neighborhood Cultivation Genetic Algorithm for Multi-Objective Optimization Problems.","216300934":"On metrics for comparing non-dominated sets","221271187":"Niches in NK-Landscapes","2524549":"An Examination of Tunable, Random Search Landscapes","216300032":"Selection, Drift, Recombination, and Mutation in Multiobjective Evolutionary Algorithms on Scalable MNK-Landscapes","221228490":"Extended Multi-objective fast messy Genetic Algorithm Solving Deception Problems","220867212":"A Study on the Behavior of Genetic Algorithms on NK-Landscapes: Effects of Selection, Drift, Mutation, and Recombination","2258571":"Using Problem Generators to Explore the Effects of Epistasis","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","2804698":"Test Function Generators as Embedded Landscapes","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","242356870":"Adaptation In Natural And Artificial Systems","220045412":"Adoption in Natural and Artificial System"},"citedIn":{"290742100":"Adaptive ε-Sampling and ε-Hood for Evolutionary Many-Objective Optimization","221228398":"Improved Random One-Bit Climbers with Adaptive","261520468":"Diversity Comparison of Pareto Front Approximations in Many-Objective Optimization","266653730":"On set-based local search for multiobjective combinatorial optimization","269227147":"Using Artificial Neural Network For Monitoring And Supporting The Grid Scheduler Performance","282530911":"Many-Objective Evolutionary Algorithms","221547325":"Self-Controlling Dominance Area of Solutions in Evolutionary Many-Objective Optimization","48416168":"Pareto Local Optima of Multiobjective NK-Landscapes with Correlated Objectives","48416169":"Analyzing the Effect of Objective Correlation on the Efficient Set of MNK-Landscapes","249334866":"Variable Space Diversity, Crossover and Mutation in MOEA Solving Many-objective Knapsack Problems","269517056":"Computational Cost Reduction of Nondominated Sorting Using the M-Front","251969492":"A study on interval to swtich combination of objectives considered in pareto partial dominance moea","226210987":"A Hybrid Scalarization and Adaptive ε-Ranking Strategy for Many-Objective Optimization","264452627":"Energy efficient genetic-based schedulers in computational grids","236209989":"Security, energy, and performance-aware resource allocation mechanisms for computational grids","221007294":"Pareto partial dominance MOEA and hybrid archiving strategy included CDAS in many-objective optimization","287251341":"Computing factorized approximations of Pareto-fronts using mNM-landscapes and Boltzmann distributions","220742395":"Space partitioning with adaptive ε-ranking and substitute distance assignments: A comparative study on many-objective MNK-landscapes","260086805":"Security, energy, and performance-aware resource allocation mechanisms for computational grids","281885205":"Force-Based Cooperative Search Directions in Evolutionary Multi-objective Optimization","264784337":"Machine learning based decision support for many-objective optimization problems","262334466":"Analysis on Population Size and Neighborhood Recombination on Many-Objective Optimization","220497349":"Adaptive ε-Ranking on many-objective problems","281328997":"Shake them all! Rethinking Selection and Replacement in MOEA/D","272083413":"Solving Nonlinear Equality Constrained Multiobjective Optimization Problems Using Neural Networks","4251683":"Local Dominance Including Control of Dominance Area of Solutions in MOEAs","262322497":"A Study on Large Population MOEA Using Adaptive ε-Box Dominance and Neighborhood Recombination for Many-Objective Optimization","50842467":"Set-based Multiobjective Fitness Landscapes: A Preliminary Study","224472068":"Constrained Many-objective Optimization: A way forward","270460216":"Japan: An Ecuadorian View","225132675":"Controlling Dominance Area of Solutions and Its Impact on the Performance of MOEAs","281050478":"A feature-based performance analysis in evolutionary multiobjective optimization","272891058":"Multiobjective optimization: When objectives exhibit non-uniform latencies","236209062":"Security, energy, and performance-aware resource allocation mechanisms for computational grids","267951372":"Pareto Partial Dominance MOEA in Many-Objective Optimization","278797930":"What makes an instance difficult for black-box 0-1 evolutionary multiobjective optimizers?","271661252":"Empirical and analytical study of many-objective optimization problems: Analysing distribution of nondominated solutions and population size for scalability of randomized heuristics","265908652":"Local Optimal Sets and Bounded Archiving on Multi-objective NK-Landscapes with Correlated Objectives","268038092":"Artificial Neural Network support to monitoring of the evolutionary driven security aware scheduling in computational distributed environments","282895593":"Analysis of inverted PBI and comparison with other scalarizing functions in decomposition based MOEAs","271615559":"On the structure of multiobjective combinatorial search space: MNK-landscapes with correlated objectives","221228567":"Many-Objective Optimization by Space Partitioning and Adaptive ε-Ranking on MNK-Landscapes","221608844":"Genetic Diversity and Effective Crossover in Evolutionary Many-objective Optimization","220881559":"Improving multi-objective random one-bit climbers on MNK-landscapes","220701528":"Path Relinking on Many-Objective NK-Landscapes","264827383":"Distributed Localized Bi-objective Search","283905875":"Many-objective optimization based on information separation and neighbor punishment selection"},"index":810}