{"abs":"Time and space assembly line balancing considers realistic multiobjective versions of the classical assembly line balancing industrial problems, involving the joint optimization of conflicting criteria such as the cycle time, the number of stations, and/or the area of these stations. The aim of this contribution is to present a new multiobjective memetic algorithm based on ant colony optimization for the 1/3 variant of this family of industrial problems. This variant involves the joint minimisation of the number and the area of the stations, given a fixed cycle time limit. The good behaviour of the proposal is shown in nine problem instances.","title":"A Multiobjective Memetic Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","id":252018382,"url":"https://www.researchgate.net/publication/252018382_A_Multiobjective_Memetic_Ant_Colony_Optimization_Algorithm_for_the_13_Variant_of_the_Time_and_Space_Assembly_Line_Balancing_Problem","names":["Manuel Chica","Oscar Cordon","S. Damas","Joaquín Bautista"],"references":{"227445774":"A Survey of Exact Algorithms for the Simple Assembly Line Balancing Problem","232846944":"Improving the equality of workload assignments in assembly lines","225369391":"Performance evaluation of memetic approaches in 3D reconstruction of forensic objects","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","200026091":"Multiobjective Decision Making: Theory And Methodology","3418745":"Balance between genetic search and local search in memetic algorithms for multiobjective permutation flowshop scheduling. IEEE Trans Evol Comput","251237480":"A Multiobjective GRASP for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","224904054":"Multi-objective constructive heuristics for the 1/3 variant of the time and space assembly line balancing problem: ACO and random greedy search","225237245":"Greedy Randomized Adaptive Search Procedures","7305018":"Classification of adaptive memetic algorithms: A comparative study. IEEE Trans Syst Man Cybern B","226336299":"Greedy Randomized Adaptive Search Procedures","222701915":"Multiobjective constructive heuristics for the 1/3 variant of the time and space assembly line balancing problem: ACO and random greedy search","235709741":"Lecture Notes in Computer Science","216300934":"On metrics for comparing non-dominated sets","223258541":"Two memetic algorithms for heterogeneous fleet vehicle routing problems","3418512":"Gambardella, L.M.: Ant Colony System: A cooperative learning approach to the Traveling Salesman Problem. IEEE Tr. Evol. Comp. 1, 53-66","223087337":"A study of local search algorithms for the biobjective QAP with correlated flow matrices","223871229":"Ant Algorithms for a Time and Space Constrained Assembly Line Balancing Problem","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","222405031":"Jaszkiewicz, A.: Genetic Local Search for Multi-Objective Combinatorial Optimization. European Journal of Operational Research 137, 50-71","2599118":"Tabu Search for Multiobjective Optimization: MOTS","243714285":"Balancing and Sequencing of Assembly Lines","221277596":"A Multiobjective Ant Colony System for Vehicle Routing Problem with Time Windows.","243707816":"A survey of exact algorithms for the simple assembly line balancing","223215905":"State-of-the-art exact and heuristic solution procedures for simple assembly line balancing","2354457":"On Evolution, Search, Optimization, Genetic Algorithms and Martial Arts - Towards Memetic Algorithms","225216146":"Tabu Search Based Procedure for Solving the 0-1 MultiObjective Knapsack Problem: The Two Objectives Case","220702040":"On the Performance Assessment and Comparison of Stochastic Multiobjective Optimizers."},"citedIn":{"220105975":"A new diversity induction mechanism for a multi-objective ant colony algorithm to solve a real-world time and space assembly line balancing problem"},"index":811}