{"abs":"The Colombian coffee supply network, managed by the Federación Nacional de Cafeteros de Colombia (Colombian National Coffee-Growers Federation), requires slimming down operational costs while continuing to provide a high level of service in terms of coverage to its affiliated coffee growers. We model this problem as a biobjective (cost-coverage) uncapacitated facility location problem (BOUFLP). We designed and implemented three different algorithms for the BOUFLP that are able to obtain a good approximation of the Pareto frontier. We designed an algorithm based on the Nondominated Sorting Genetic Algorithm; an algorithm based on the Pareto Archive Evolution Strategy; and an algorithm based on mathematical programming. We developed a random problem generator for testing and comparison using as reference the Colombian coffee supply network with 29 depots and 47 purchasing centers. We compared the algorithms based on the quality of the approximation to the Pareto frontier using a nondominated space metric inspired on Zitzler and Thiele\u0027s. We used the mathematical programming-based algorithm to identify unique tradeoff opportunities for the reconfiguration of the Colombian coffee supply network. Finally, we illustrate an extension of the mathematical programming-based algorithm to perform scenario analysis for a set of uncapacitated location problems found in the literature.","title":"Solution methods for the bi-objective (cost-coverage) unconstrained facility location problem with an illustrative example","id":220462355,"url":"https://www.researchgate.net/publication/220462355_Solution_methods_for_the_bi-objective_cost-coverage_unconstrained_facility_location_problem_with_an_illustrative_example","names":["Juan Villegas","Fernando Palacios","Andrés Medaglia","Annals of Operations Research"],"references":{"222123070":"Multiobjective solution of the uncapacitated plant location problem","220289314":"Using genetic algorithms for single-machine bicriteria scheduling problems","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","235445120":"Discrete Location Theory","220981282":"Towards Landscape Analyses to Inform the Design of Hybrid Local Search for the Multiobjective Quadratic Assignment Problem.","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","2581803":"Approximating the non-dominated front using the Pareto Archived Evolution Strategy","2522154":"Why Quality Assessment of Multiobjective Optimizers Is Difficult","220741029":"Analysis of a Parallel MOEA Solving the Multi-objective Quadratic Assignment Problem.","226211700":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","2523573":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimization: NSGA-II","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","246168757":"Fast stochastic local searches for the biobjective quadratic assignment problem","239044262":"A multi-objective logistics model for a capacitated service facility problem","2634673":"Multiobjective Optimization Using Evolutionary Algorithms --- A Comparative Case Study","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","3810214":"“An updated survey of evolutionary multiobjective optimization techniques: State of the art and future trends,” in: Congress on evolutionary computation","271837973":"The Quadratic Assignment Problem: Theory and Algorithms","4870883":"A genetic-based framework for solving (multi-criteria) weighted matching problems","247946091":"The Plant Location Problem: New Models and Research Prospects","2605963":"An Overview of Genetic Algorithms: Part 2, Research Topics","4867429":"Strategic Facility Location: A Review","32036313":"Network and Discrete Location: Models, Algorithms and Applications","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","222865788":"Multi-objective meta-heuristics: An overview of the current state-of-the-art","30873058":"Genetic + Data Structures \u003d Evolution Programs","2301589":"An Overview of Genetic Algorithms : Part 1, Fundamentals","221228441":"Instance Generators and Test Suites for the Multiobjective Quadratic Assignment Problem","3418766":"Reducing the Run-Time Complexity of Multiobjective EAs: The NSGA-II and Other Algorithms","248757096":"On a Bicriterion Formulation of the Problems of Integrated System Identification and System Optimization","222655102":"Inventory, transportation, service quality and the location of distribution centers. Eur J Oper Res","223407212":"On the Use of Genetic Algorithms to Solve Location Problems","222496254":"Genetic algorithm approach on multi-criteria minimum spanning tree problem. European Journal of Operational Research, 114, 141-152","222621946":"The fixed charge facility location problem with coverage restrictions","216457304":"Lecture Notes in Computer Science","222455553":"Equity measurement in facility location analysis: a review and framework. Eur J Oper Res","222612096":"A branch and bound algorithm for mixed zero-one multiple objective Linear programming","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","246309479":"Genetic Programs + Data Structures \u003d Evolution Programs","223107584":"A mixed integer and multiple objective programming model to analyze coal handling in New England","2685945":"Population Heuristics","220472947":"On the use of genetic algorithms to solve location problems.","256163229":"Multiobjective decision analysis with engineering and business applications","246386546":"Hospital Layout as a Quadratic Assignment Problem","220045504":"Multiple Criteria Optimization: Theory, Computation and Application. N.Y., Wiley","227446096":"An Overview of Representative Problems in Location Research","223366159":"A Multi-Objective Model for Locating Fire Stations","247823013":"Determining Emergency Medical Service Vehicle Deployment in Austin, Texas","223627060":"“A Multicriteria Approach to the Location of Public Facilities”","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","216300934":"On metrics for comparing non-dominated sets","247821985":"An Application of Goal Programming to Resolve a Site Location Problem","201976815":"Genetic Algorithms \u0026 Engineering Design","2400323":"An Overview of Genetic Algorithms: Part 2, ResearchTopics","2268869":"An Updated Survey of Evolutionary Multiobjective Optimization Techniques: State of the Art and Future Trends","282059174":"A survey and annotated bibliography of multiobjective combinatorial optimization","2356301":"Solving The Uncapacitated Warehouse Location Problem By SGA With Add-Heuristic","2488533":"Solving The Simple Plant Location Problem By Genetic Algorithm","245280748":"Facility Location: A Survey of Applications and Methods","227443450":"An Analysis of Private and Public Sector Location Models","242356870":"Adaptation In Natural And Artificial Systems","220901597":"On the Design of ACO for the Biobjective Quadratic Assignment Problem","220045412":"Adoption in Natural and Artificial System","4074691":"Solving the multi-objective quadratic assignment problem using a fast messy genetic algorithm","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"280040497":"Investigating Metaheuristics Applications for Capacitated Location Allocation Problem on Logistics Networks","226622542":"Locating Neighborhood Parks with a Lexicographic Multiobjective Optimization Method","277142615":"P R É -A N A I S MULTIOBJETIVE SUPPLY CHAIN DESING WITH DIRECT SUPPLY","257596745":"Scheduling of parallel machines with sequence-dependent batches and product incompatibilities in an automotive glass facility","266153481":"Comparing Evolutionary Strategies on a Biobjective Cultural Algorithm","274707658":"Research Article Variations in the Flow Approach to CFCLP-TC for Multiobjective Supply Chain Design","220403450":"Hybrid biobjective evolutionary algorithms for the design of a hospital waste management network","277142621":"Variations to the CFCLP-TC for Multiobjective Supply Chain Design","221228533":"A Bi-objective Iterated Local Search Heuristic with Path-Relinking for the p-Median Problem","261186800":"A hybrid multi-objective approach to capacitated facility location with flexible store allocation for green logistics modeling","256919345":"An improved robust topology optimization approach using multiobjective evolutionary algorithms. Comput Struct","277142309":"Direct flow between distribution centers for multi-objective supply chain design","228673408":"Obstacle Avoidance and Travel Path Determination in Facility Location Planning","226735265":"Solving conflicting bi-objective facility location problem by NSGA II evolutionary algorithm","282408243":"Parallel Optimization Algorithm for Competitive Facility Location","237469824":"A Tool for Rapid Development of Multi-Objective Evolutionary Algorithms (MOEAs) with Application to Facility Location Problems","279248654":"A multi-objective genetic algorithm for a bi-objective facility location problem with partial coverage","252020329":"A bi-objective model for hazard materials location and routing problem","257195513":"Some heuristic methods for solving p-median problems with a coverage constraint","257516023":"A new method for managing the uncertainties in evaluating multi-person multi-criteria location choices, using a perceptual computer","237007440":"A new multi-objective self-organizing optimization algorithm (MOSOA) for spatial optimization problems","280769294":"Implementing an evolutionary algorithm for locating container yards of a 3PL provider","263263879":"Sustainable workforce scheduling in construction program management","224472344":"The multi-objective uncapacitated facility location problem for green logistics","221228628":"Lecture Notes in Computer Science","220981079":"A GRASP heuristic with Path-Relinking for a bi-objective p-median problem","275517648":"Memetic Algorithm for Solving the Multilevel Uncapacitated Facility Location Problem","260650612":"Budget constrained flow interception location model for congested systems","222795194":"Multiple criteria facility location problems: A survey","269345970":"Distribution Center Multi-Objective Location Problem Using NSGA-II"},"index":814}