{"abs":"In this paper we present a skin color model for accurate face detection which combines skin color learning and image segmentation. This approach starts from a coarse segmentation which provides regions of homogeneous statistical color distribution. Some regions represent parts of human skin and are selected by minimizing an error between the color distribu- tion of each region and the output of a compression decompression neural network, which learns skin color distribution for several populations of different ethnicity. This ANN is used to find a collection of skin regions which are used to estimate the new parameters of the Gaussian models using a 2-means fuzzy clustering in order to adapt these parameters to the context of the input image. A Bayesian framework is used to perform a finer classification and makes the skin and face detection process invariant to scale and lighting conditions. Finally, a face shape based model is used to validate or not the face hypothesis on each skin region.","title":"Accurate Face Detection Based on Coarse Segmentation and Fine Skin Color Adaption","id":237897366,"url":"https://www.researchgate.net/publication/237897366_Accurate_Face_Detection_Based_on_Coarse_Segmentation_and_Fine_Skin_Color_Adaption","names":["Hichem Sahbi","Nozha Boujemaa"],"references":{"2436741":"Evaluating Strategies and Systems for Content Based Indexing of Person Images on the Web","221364881":"Neural Network-Based Face Detection","222452707":"Detecting human faces in color images","247430109":"Robust matching and description of images","222625504":"Characterization and detection of noise in clustering","225249640":"Color Indexing","256075302":"Eigenfaces for Recognition. J Cogn Neurosci","2776205":"View-Based and Modular Eigenspaces for Face Recognition","2376111":"A Training Algorithm for Optimal Margin Classifier","3766194":"Detecting human faces in color images","2240462":"Graded Learning for Object Detection","3845526":"A fast and accurate face detector for indexation of face images","215721451":"Neural Networks For Pattern Recognition","2710520":"Matching And Recognition Using Deformable Intensity Surfaces","2302416":"Skin-Color Modeling and Adaptation","3809806":"Differential feature distribution maps for image segmentation and region queries in image databases","2767517":"Blobworld: A System for Region-Based Image Indexing and Retrieval","221110772":"Finding Faces in Cluttered Scenes Using Labeled Random Graph Matching.","3745219":"Real-time face recognition using feature combination","2464475":"Training Support Vector Machines: an Application to Face Detection"},"citedIn":{"5614037":"Independent component analysis of Gabor features for face recognition","26453353":"ADAPTIVE SKIN DETECTION UNDER UNCONSTRAINED LIGHTING CONDITIONS USING A BIGAUSSIAN MODEL AND ILLUMINATION ESTIMATION","224637727":"Color-based skin detection: Survey and evaluation"},"index":817}