{"abs":"In this article, we derive a series expansion of the multivariate normal probability integrals based on Fourier series. The basic idea is to transform the limits of each integral from h i to ∞ to be from -∞ to ∞ by multiplying the integrand by a periodic square wave that approximates the domain of the integral. This square wave is expressed by its Fourier series expansion. Then a Cholesky decomposition of the covariance matrix is applied to transform the integrand to a simple one that can be easily evaluated. The resultant formula has a simple pattern that is expressed as multiple series expansion of trigonometric and exponential functions.","title":"A novel series expansion for the multivariate normal probability integrals based on Fourier series","id":268170490,"url":"https://www.researchgate.net/publication/268170490_A_novel_series_expansion_for_the_multivariate_normal_probability_integrals_based_on_Fourier_series","names":["Hatem Fayed","Amir Atiya","Mathematics of Computation"],"references":{"226994279":"Three digit accurate multiple normal probabilities","230663803":"Distributions in Statistics: Continuous Univariate Distribution-II","220286439":"Numerical Computation of Rectangular Bivariate and Trivariate Normal of t Probabilities","23629857":"The use of the tetrachoric series for evaluating multivariate normal probabilities","264908198":"An evaluation of the integral of the product of the error function and the normal probability density with application to the bivariate normal integral","38358468":"Calculation of Univariate and Bivariate Normal Probability Functions","238864883":"On the Computation of the Bivariate Normal Integral","38366104":"Probability Integrals of Multivariate Normal and Multivariate $t^1$","262326803":"Bivariate normal distributions","242922632":"Computation of the Bivariate Normal Integral","2463953":"Numerical Computation Of Multivariate Normal Probabilities","263047835":"Computation of Multivariate Normal and Probabilities","38367071":"Tables for Computing Bivariate Normal Probabilities","261660224":"Multivariate Normal Probabilities: Implementing an Old Idea of Plackett\u0027s","30942785":"(iv) Proof of Relations connected with the Tetrachoric Series and its Generalization","4769425":"From Characteristic Function to Distribution Function: A Simple Framework for the Theory.","4914161":"The evaluation of general non-centred orthant probabilities. J R Stat Soc B","243686298":"“Mathematical Contribution to the Theory of Evolution, VII, On the Correlation of Characters Not Quantitatively Measurable.”","2466874":"Comparison of Methods for the Computation of Multivariate Normal Probabilities"},"citedIn":{"283126472":"Enhancements to cSAM spectral comparison"},"index":819}