{"abs":"The distributional transform (DT) is amongst the computational methods used for estimation of high-dimensional multivariate normal copula models with discrete responses. Its advantage is that the likelihood can be derived conveniently under the theory for copula models with continuous margins, but there has not been a clear analysis of the adequacy of this method. We investigate the small-sample and asymptotic efficiency of the method for estimating high-dimensional multivariate normal copula models with univariate Bernoulli, Poisson, and negative binomial margins, and show that the DT approximation leads to biased estimates when there is more discretisation. For a high-dimensional discrete response, we implement a maximum simulated likelihood method, which is based on evaluating the multidimensional integrals of the likelihood with randomized quasi Monte Carlo methods. Efficiency calculations show that our method is nearly as efficient as maximum likelihood for fully specified high-dimensional multivariate normal copula models. Both methods are illustrated with spatially aggregated count data sets, and it is shown that there is a substantial gain on efficiency via the maximum simulated likelihood method.","title":"Efficient estimation of high-dimensional multivariate normal copula models with discrete spatial responses","id":268079482,"url":"https://www.researchgate.net/publication/268079482_Efficient_estimation_of_high-dimensional_multivariate_normal_copula_models_with_discrete_spatial_responses","names":["Aristidis K. Nikoloulopoulos","Stochastic Environmental Research and Risk Assessment"],"references":{"10609059":"Proper Multivariate Conditional Autoregressive Models for Spatial Data Analysis","265701010":"Multivariate Models and Dependence Concepts, Volume 73","228634405":"An Overview of Composite Likelihood Methods","266218264":"Correlated Data Analysis: Modeling, Analytics, and Applications","225118252":"Copula-based geostatistical modeling of continuous and discrete data including covariates","222423305":"On the distributional transform, Sklar\u0027s theorem, and the empirical copula process","258819364":"On the estimation of normal copula discrete regression models using the continuous extension and simulated likelihood","2468655":"Comparison of Methods for the Computation of Multivariate t Probabilities","266599144":"Copula-Based Models for Multivariate Discrete Response Data","220019731":"Regression Analysis of Count Data, ESM 30","47642713":"Joint Regression Analysis for Discrete Longitudinal Data","254937632":"Multivariate Negative Binomial Models for Insurance Claim Counts","227694208":"Composite Likelihood Estimation in Multivariate Data Analysis","224839797":"Model-Based Geostatistics","229190397":"Multivariate Normal and t Distributions","233015095":"Stochastically ordered distributions and monotonicity of the OC-function of sequential probability ratio tests","259114661":"Factor Copula Models for Item Response Data","268167087":"Dependence modeling with copulas","264423383":"Compact Numerical Methods for Computers: Linear Algebra and Function Minimisation","24053050":"On composite marginal likelihood","225693163":"Maximum Likelihood Estimation of Regression Parameters With Spatially Dependent Discrete Data","236900101":"Approximate copula-based estimation and prediction of discrete spatial data","269797000":"Distributions In Statistics Continuous Univariate Distributions - 2","242310124":"Composite likelihood methods","265681675":"Fonctions de Répartition À N Dimensions Et Leurs Marges","50850520":"Weighted scores method for regression models with dependent data","2466874":"Comparison of Methods for the Computation of Multivariate Normal Probabilities","224839687":"Hierarchical Modeling and Analysis of Spatial Data","13496300":"Spatio-Temporal Models with Errors in Covariates: Mapping Ohio Lung Cancer Mortality","227647478":"Model-Based Geostatistic","265351869":"« Mathematical Statistics: A Decision Theoretic Approach »","271670303":"copCAR: A Flexible Regression Model for Areal Data","222536108":"Constraints on concordance measures in bivariate discrete data. J Multivar Anal","7205021":"Analysis of the relationship between socioeconomic factors and stomach cancer incidence in Slovenia","227700707":"Negative Binomial and Mixed Poisson Regression","268245196":"An Introduction to Copulas","2463953":"Numerical Computation Of Multivariate Normal Probabilities","263047835":"Computation of Multivariate Normal and Probabilities","264944764":"Richly Parameterized Linear Models: Additive, Time Series, and Spatial Models Using Random Effects","228205411":"Longitudinal Modeling of Insurance Claim Counts Using Jitters","23630294":"Multi-dimensional multivariate Gaussian Markov random fields with application to image processing. J Multiv Anal"},"citedIn":{"281380930":"A conditional count model for repeated count data and its application to GEE approach","272845051":"A mixed effect model for bivariate meta-analysis of diagnostic test accuracy studies using a copula representation of the random effects distribution"},"index":821}