{"abs":"In this paper we address the problem of fundamental limitations on resolution in deterministic parameters estimation. We introduce a definition of resolvability based on probability and incorporating a requirement for accuracy unlike most existing definitions. Indeed in many application the key problem is to obtain distributions of estimates that are not only distinguishable but also accurate and compliant with a required precision. We exemplify the proposed definition with estimators that produce normal estimates, as in the conditional model for which the Gaussianity and efficiency of maximum likelihood estimators (MLEs) in the asymptotic region of operation (in terms of signal-to-noise ratio and/or in large number of snapshots) is well established, even for a single snapshot. In order to measure the convergence in distribution, we derive a simple test allowing to check whether the conditional MLEs operate in the asymptotic region of operation. Last, we discuss the resolution of two complex exponentials with closely spaced frequencies and compare the results obtained with the ones provided by the various statistical resolution limit released in the open literature.","title":"On the Accuracy and Resolvability of Vector Parameter Estimates","id":263669665,"url":"https://www.researchgate.net/publication/263669665_On_the_Accuracy_and_Resolvability_of_Vector_Parameter_Estimates","names":["Chengfang Ren","Mohammed Nabil El Korso","Jérome Galy","E. Chaumette","Pascal Larzabal","Alexandre Renaux","IEEE Transactions on Signal Processing"],"references":{"3496118":"Worst-case Cramer-Rao bound for parametric estimation of superimposed signals","3315894":"On the resolvability of normally distributed vector parameter estimates","224326746":"Fundamental Limitations on the Resolution of Deterministic Signals","224174426":"General Classes of Performance Lower Bounds for Parameter Estimation—Part I: Non-Bayesian Bounds for Unbiased Estimators","38367247":"Note on the Distribution of a Definite Quadratic Form","4243656":"Information and Complexity in Statistical Models","244495259":"Sensitivity to Mismatch of Optimum Array Processors","243768141":"On The Kolmogorov-Smirnov Test for Normality With Mean and Variance Unknown","3313784":"Capon algorithm mean-squared error threshold SNR prediction and probability of resolution","3319929":"On the High-SNR Conditional Maximum-Likelihood Estimator Full Statistical Characterization","3315262":"The Cramér-Rao bound on frequency estimates of signals closely spaced in frequency (unconditional case)IEEE Trans. Signal Processing19944261569157210.1109/78.286979","220323251":"The Cramér-Rao Bound on Frequency Estimates of Signals Closely Spaced in Frequency","220321906":"Statistical Angular Resolution Limit for Point Sources","3314087":"A Robust Approach for High Resolution Frequency Estimation","264960925":"Aspects of Multivariate Statistical Theory","245507066":"Aspects of Multivariate Statistical Theory: John Wiley and Sons","224319367":"A New Barankin Bound Approximation for the Prediction of the Threshold Region Performance of Maximum Likelihood Estimators","224134533":"Statistical Analysis of the MUSIC Algorithm in the Presence of Modeling Errors, Taking Into Account the Resolution Probability","3319211":"Threshold region performance of maximum likelihood direction of arrival estimators. IEEE Trans Signal Process","44401023":"Theory of point estimation / E.L. Lehmann","238595235":"New Results on Deterministic Cramér–Rao Bounds for Real and Complex Parameters","3319315":"On the resolvability of sinusoids with nearby frequencies in the presence of noise","40872653":"Unconditional Maximum Likelihood Performance At Finite Number Of Samples And High Signal To Noise Ratio","256994034":"On the asymptotic resolvability of two point sources in known subspace interference using a GLRT-based framework","216545997":"Testing Statistics Hypotheses","50601379":"Statistical Resolution Limit for the Multidimensional Harmonic Retrieval Model: Hypothesis Test and Cramer-Rao Bound Approaches","38366437":"Distribution of a Definite Quadratic Form for Non-Central Normal Variates","220326093":"On the resolvability of normally distributed vector parameter estimates.","3314716":"Worst Case Cramér-Rao Bounds for Parametric Estimation of Superimposed Signals with Applications","3177985":"The statistical performance of the MUSIC and the minimum-norm algorithms in resolving plane waves in noise","3321024":"Statistical Performance of MUSIC-Like Algorithms in Resolving Noncircular Sources","2463953":"Numerical Computation Of Multivariate Normal Probabilities","3082459":"Single Tone Parameter Estimation From Discrete-Time Observations","3327814":"Imaging Below the Diffraction Limit: A Statistical Analysis","3319243":"Statistical Resolution Limits and the Complexified Cramér-Rao Bound","224737054":"Resolving power of signal subspace methods for fnite data lengths","243641790":"Detection estimation and time series analysis","242624905":"Fundamentals of Statistical Signal Processing, Vol. II: Detection Theory"},"citedIn":{"274461183":"On ordered normally distributed vector parameter estimates","274510585":"On ordered normally distributed vector parameter estimates"},"index":823}