{"abs":"A learning account for the problem of object recognition is developed within the PAC (Probably Approximately Correct) model of learnability. The proposed approach makes no assumptions on the distribution of the observed objects, but quantifies success relative to its past experience. Most importantly, the success of learning an object representation is naturally tied to the ability to represent at as a function of some intermediate representations extracted from the image. We evaluate this approach an a large scale experimental study in which the SNoW learning architecture is used to learn representations for the 100 objects in the Columbia Object Image Database (COIL-100). The SNoW-based method is shown to outperform other methods in terms of recognition rates; its performance degrades gracefully when the training data contains fewer views and in the presence of occlusion noise","title":"Learning to recognize objects","id":3854182,"url":"https://www.researchgate.net/publication/3854182_Learning_to_recognize_objects","names":["Dan Roth","Ming-Hsuan Yang","Narendra Ahuja"],"references":{"20856254":"Poggio, T. \u0026 Edelman, S. A network that learns to recognize 3D objects. Nature 343, 263−266","21235655":"Tanaka, K., Saito, H. -A., Fukada, Y. \u0026 Moriya, M. Coding visual images of objects in the inferotemporal cortex of the macaque monkey. J. Neurophysiol. 66, 170-189","12795335":"Object individuation and object identity in infancy: The role of spatiotemporal information, object property information, and language","234793335":"A theory of the learnable. Commun ACM","21867719":"Edelman, S. \u0026 Bülthoff, H.H. Orientation dependence in the recognition of familiar and novel views of 3D objects. Vision Res. 32, 2385-2400","21210578":"Neurobiology. Temporal associations.","227201563":"Learning Quickly When Irrelevant Attributes Abound. A New Linear-threshold Algorithm","19081904":"The Time to Name Disoriented Natural Objects","12086188":"Infants’ Knowledge of Objects: Beyond Object Files and Object Tracking","2925496":"Learning in the Presence of Malicious Errors","5595969":"The Nature Of Statistical Learning Theory","222442967":"Tarr, M. J. \u0026 Pinker, S. Mental rotation and orientation-dependence in shape recognition. Cogn. Psychol. 21, 233-282","226823186":"On learning visual concepts and DNF formulae","2722354":"Part of Speech Tagging Using a Network of Linear Separators","13723722":"“Reuniting Perception and Conception.”","21556308":"Young, M.P. \u0026 Yamane, S. Sparse population coding of faces in the inferotemporal cortex. Science 256, 1327−1331","10832697":"Ullman, S. \u0026 Soloviev, S. Computation of pattern invariance in brain-like structures. Neural Net. 12, 1021−1036","243765145":"Carey S and Diamond R. Are faces perceived as configurations more by adults than by children","15154424":"Studies on the Formation of Perceptually Based Basic‐Level Categories in Young Infants","2620679":"Relational Representations that Facilitate Learning","14821441":"Evidence for representations of perceptually similar natural categories by 3-month-old and 4-month-old Infants","19121159":"Visual analysis of body movements by neurons in the temporal cortex of the macaque monkey: a preliminary report. Beh Brain Res","12265247":"Altering object representations through category learning","226894880":"A Winnow-Based Approach to Context-Sensitive Spelling Correction","21425505":"“Psychophysical support for a 2-D view interpolation theory of object recognition”","222443115":"Equivalence of models for polynomial learnability","2787457":"A Model of Invariant Object Recognition in the Visual System","21807840":"Rolls, E. T. Neurophysiological mechanisms underlying face processing within and beyond the temporal cortical visual areas. Philos. Trans. R. Soc. Lond. Biol. 335, 11−20","13572067":"Navigation and Acquisition of Spatial Knowledge in a Virtual Maze","13194212":"Development of features in object concepts","21807843":"Organization and Functions of Cells Responsive to Faces in the Temporal Cortex [and Discussion]","14565873":"Infants’ Metaphysics: The Case of Numerical Identity","223514083":"The nature and structure of infant categories","221304710":"Learning to Recognize 3D Objects with SNoW","19119765":"Baylis, G. C., Rolls, E. T. \u0026 Leonard, C. M. Selectivity between faces in the responses of a population of neurons in the cortex in the superior temporal sulcus of the monkey. Brain Res. 342, 91−102","14149871":"To what extent can matching algorithms based on direct outputs of spatial filters account for human shape recognition? Spatial Vision, 10, 237-271","18543778":"Visual properties of neurons in inferotemporal cortex of the Macaque. J Neurophysiol","243766845":"The SNoW learning architecture","239030532":"Two cortical visual systems","20403340":"Rolls, E. T., Baylis, G. C., Hasselmo, M. E. \u0026 Nalwa, V. The effect of learning on the face selective responses of neurons in the cortex in the superior temporal sulcus of the monkey. Exp. Brain Res. 76, 153-164","236736807":"Estimation of Dependences Based on Empirical Data","14227556":"Rapid visual learning in neurones of the primate temporal visual cortex","16137160":"Fuster, J. M. \u0026 Jervey, J. P. Neuronal firing in the inferotemporal cortex of the monkey in a visual memory task. J. Neurosci. 2, 361-375","243540164":"Canonical perspective and the perception of objects","239986700":"Face Recognition Under Varying Pose: The Role of Texture and Shape","247360123":"Recovery from Early Blindness: A Case Study","225781552":"Johansson, G.: Visual perception of biological motion and a model for its analysis. Atten. Percept. Psychophys. 14, 201-211","13680280":"What represents a face? A computational approach for the integration of physiological and psychological data","14260755":"Role of learning in three-dimensional form perception","21152142":"A Self-Organizing Multiple-View Representation of 3D Objects","19585510":"Recognition-by-Components: A Theory of Human Image Understanding","2714597":"Graded Learning for Object Detection","221497598":"Redundant Noisy Attributes, Attribute Errors, and Linear-Threshold Learning Using Winnow.","12169207":"Separating Processes in Object Perception","220343922":"Support Vector Network","13105685":"Infants\u0027 Learning about Words and Sounds in Relation to Objects","13626907":"Kobatake, E., Wang, G. \u0026 Tanaka, K. Effects of shape-discrimination training on the selectivity of inferotemporal cells in adult monkeys. J. Neurophysiol. 80, 324−330","221497447":"Equivalence of Models for Polynomial Learnability.","13426074":"Spatio-temporal influences at the neural level of object recognition","13916301":"A model of visual recognition and categorization","222190436":"Decision Theoretic Generalizations of the PAC Model for Neural Net and Other Learning Applications","2428543":"Exponentiated Gradient Versus Gradient Descent for Linear Predictors","3191787":"Learnable and Nonlearnable Visual Concepts","3192172":"On Learning to Recognize 3-D Objects from Examples","222088034":"Categories and percepts: A bi-directionnal framework for categorization","2815988":"Representation, Similarity, and the Chorus of Prototypes","22686980":"The internal representation of solid shape with respect to vision. Biol Cybern","224377985":"A Computational Approach To Edge Detection","232585603":"First Sentences in Language and Play","256075298":"Face-Selective Cells in the Temporal Cortex of Monkeys","12461402":"Young children are sensitive to how an object was created when deciding how to name it","220181883":"On Learning to Recognize 3-D Objects from Examples.","15354638":"Variability in Early Communicative Development","221619409":"A SNoW-based face detector","13549351":"Perrett, D. I., Oram, M. W. \u0026 Ashbridge, E. Evidence accumulation in cell populations responsive to faces: an account of generalisation of recognition without mental transformations. Cognition 67, 111-145","242366361":"Basic Objects in Natural Categories","2240462":"Graded Learning for Object Detection","2689604":"Learning to Resolve Natural Language Ambiguities: A Unified Approach","243657832":"Visual Agnosia: Disorders of Object Recognition and What They Tell Us About Normal Vision","21540280":"Young, M. P. Objective analysis of the topological organization of the primate cortical visual system. Nature 358, 152-155","19072976":"“Shape Constancy and Slant Perception at Birth”","21780665":"Separate Visual Pathways for Perception and Action","21398576":"Perrett, D. I. et al. Viewer-centred and object-centred coding of heads in the macaque temporal cortex. Exp. Brain Res. 86, 159-173","221497540":"On Learning Visual Concepts and DNF Formulae","226983678":"The responses of neurons in the temporal cortex of primates, and face identification and detection","247818943":"The Control of Animate and Inanimate Components in Pretend Play and Language","243763580":"The Nature Of Statistical Learning Theory","243782779":"A network that learns to recognize three-dimensional objects\" Nature 343 263-266","14738204":"Inferior Temporal Cortex: Where Visual Perception Meets Memory","13988904":"Becoming a “Greeble” Expert: Exploring Mechanisms for Face Recognition"},"citedIn":{"42803854":"Learning to Recognize Faces by Successive Meetings","30384331":"What is structural similarity and is it greater in living things","4090171":"Selecting models from videos for appearance-based face recognition","7468153":"Prior experience of rotation is not required for recognizing objects seen from different angles","228748969":"Towards a general law of numerical/object identity","26818957":"Learning illumination- and orientation-invariant representations of objects throughtemporal association","228593846":"A brief introduction to cortical representations of objects","6325881":"The M170 Reflects a Viewpoint-Dependent Representation for Both Familiar and Unfamiliar Faces","12651226":"Learning cortical topography from spatiotemporal stimuli","237494073":"A Dissertation Presented","222816857":"The onset and mastery of spatial language in children acquiring British Sign Language","24414058":"Neural adaptation for novel objects during dynamic articulation","7305806":"Size-invariant but viewpoint-dependent representation of faces","7649111":"Bio-computational model of object-recognition: Quantum Hebbian processing with neurally shaped Gabor wavelets","221305109":"A Tale of Two Classifiers: SNoW vs. SVM in Visual Recognition","11399819":"“Multiple levels of visual object constancy revealed by event-related fMRI of repetition priming”","3738129":"An Ac Welder Controller With Electronic Arc Initiator","2454029":"The Use of Classifiers in Sequential Inference","11080320":"Baker, C.I., Behrmann, M. \u0026 Olson, C.R. Impact of learning on representation of parts and wholes in monkey inferotemporal cortex. Nat. Neurosci. 5, 1210−1216","6720844":"Figure-ground assignment in pigeons: Evidence for a figural benefit","4232812":"Face Recognition from a Tabula Rasa Perspective","10698894":"Learning Optimized Features for Hierarchical Models of Invariant Object Recognition","3193885":"Learning viewpoint invariant perceptual representations from cluttered images","254156823":"A well grounded education: The role of perception in science and mathematics","11708288":"Matching multicomponent objects from different viewpoints: Mental rotation or normalization?","8060488":"View-independent coding of face identity in frontal and temporal cortices is modulated by familiarity: An event-related fMRI study","23252305":"Unsupervised Natural Experience Rapidly Alters Invariant Object Representation in Visual Cortex","51572261":"A lifespan perspective on semantic processing of concrete concepts: Does a sensory/motor model have the potential to bridge the gap?","221908224":"Robot Vision in Industrial Assembly and Quality Control Processes","12382086":"Effects of Visual Experience on the Representation of Objects in the Prefrontal Cortex","3907591":"Hybrid face recognition systems for profile views using the MUGSHOTdatabase","271462163":"Remote Sensing object recognition based on transfer learning","26255312":"Perceptual learning of view-independence in visuo-haptic object representations","251466172":"Chapter 38 Treatment of convulsive disorders","3193201":"Content-based image retrieval at the end of the early","224183837":"Deep Machine Learning - A New Frontier in Artificial Intelligence Research [Research Frontier]","24191285":"Role of ordinal contrast relationships in face encoding","30388102":"Characteristics of 3D environments and potential contributions to spatial learning","8448458":"Shape and the First Hundred Nouns","228856809":"View-based recognition under illumination changes using local features","221093731":"The Contribution of 3-D Environments to Conceptual Understanding","5284614":"Using Gaze-tracking Data and Mixture Distribution Analysis to Support a Holistic Model for the Detection of Cancers on Mammograms","4031850":"Perceptual learning and abstraction in machine learning","7081780":"Structural similarity and spatiotemporal noise effects on learning dynamic novel objects","6117381":"Young Children Associate Novel Words With Complex Objects Rather Than Salient Parts","255621222":"On the Empirical Complexity of Text Classification Problems","2389374":"Relational Learning via Propositional Algorithms: An Information Extraction Case Study","3738210":"Three-Dimensional Surface Measurement of a Human Face","11837935":"The Representation of Objects in the Human Occipital and Temporal Cortex","225768234":"Autobiography and science education: An introduction","228599489":"Automatic acquisition of exemplar-based representations for recognition from image sequences","268324765":"On-board three-dimensional object tracking: Software and hardware solutions","237562956":"LEARNING AND RECOGNIZING FACES: FROM STILL IMAGES TO VIDEO SEQUENCES","228387067":"Promoting Transfer by Grounding Complex Systems Principles","23160585":"The integration of higher order form and motion by the human brain","238621265":"From Stimulus to Science: The Changing Nature of Visual Perception","43470591":"The role of object motion in forging long-term representations of objects","228788175":"Image search engines: An overview","23998210":"Three-Dimensional Information in Face Representations Revealed by Identity Aftereffects","260665573":"An improved LBP transfer learning for remote sensing object recognition","221567834":"Pose-Independent Object Representation by 2-D Views","221080386":"Unsupervised Learning of Combination Features for Hierarchical Recognition Models","12133321":"Perception, representation and recognition: A holistic view of recognition","42609400":"Multiple Grasp-Specific Representations of Tool Dynamics Mediate Skillful Manipulation","12133322":"Reconstructing mental object representations: A machine vision approach to human visual recognition","247676603":"Infants\u0027 understanding of model objects and modeled actions should not be assumed","23718160":"Developmental changes in visual object recognition between 18 and 24 months of age","221304142":"Learning a Sparse Representation for Object Detection","253165160":"Gender and Identity Classification for a Naive and Evolving System","46253633":"How the mind constitutes itself through perceptual learning","227609618":"Early Education for Spatial Intelligence: Why, What, and How","11669814":"Humphreys, G. W. \u0026 Forde, E. M. Hierarchies, similarity, and interactivity in object recognition: \u0027category-specific\u0027 neuropsychological deficits. Behav. Brain Sci. 24, 453-509","225168367":"Using discriminant analysis for multi-class classification: an experimental investigation. Knowl Inf Syst 10(4): 453-472","37995460":"Probabilistic geometric grammars for object recognition","4022965":"On region merging: The statistical soundness of fast sorting, with applications","33778058":"Experiments in generic object recognition /","237379498":"THE MIDDLE EAST TECHNICAL UNIVERSITY","4047536":"Using discriminant analysis for multi-class classification","50402191":"Categorization and Object Shape","224090324":"Learning Posture Invariant Spatial Representations Through Temporal Correlations","6708726":"An attentional learning account of the shape bias: Reply to Cimpian \u0026 Markman (2005) and Booth, Waxman \u0026 Huang (2005)","28764199":"The cognitive roots of gender in Russian","222415315":"Moving words: Dynamic representations in language comprehension","240754378":"Generalizing from Simple Instances: An Uncomplicated Lesson from Kids Learning Object Categories","11193151":"Differential Effects of Viewpoint on Object-Driven Activation in Dorsal and Ventral Streams","4284121":"Becoming Visually Familiar","40897769":"Ennaceur A. One-trial object recognition in rats and mice: methodological and theoretical issues. Behav Brain Res 215: 244-254","258959350":"Parts and Relations in Young Children\u0027s Shape-Based Object Recognition","44600882":"Exploring the effects of similarity on mapping spatial relations","51247510":"Action Alters Shape Categories","4150692":"Face exemplars selection from video streams for online learning","250695020":"A feedback model of perceptual learning and categorization","32964456":"Toward Concept-Based Text Understanding and Mining","220173185":"Dynamische Konzeptgenerierung in konnektionistischen Netzen: Begriffsklärung, Modellvorstellungen zur Szenenrekonstruktion und experimentelle Ergebnisse","250458226":"The Transfer of Scientific Principles Using Concrete and Idealized Simulations","221305263":"Using Inter-feature-Line Consistencies for Sequence-Based Object Recognition","251471714":"Posttranslational Processing of Nuclear Lamins","12650085":"Encoding \u0027regular\u0027 and \u0027random\u0027 sequences of views;of novel three-dimensional objects","251491928":"Wykorzystanie znieczulenia podtlenkiem azotu na oddziale dziecięcym szpitala rejonowego","8666146":"Visual object understanding","240047591":"Inference with Classiflers: The Phrase Identiflcation Problem","32964444":"Learning and Inference for Information Extraction","220233611":"The emergence of links between lexical acquisition and object categorization: A computational study","41027294":"View-invariant object recognition ability develops after discrimination, not mere exposure, at several viewing angles","24410820":"Change of search time and non-search time in X-ray baggage screening due to training","8013768":"They call it like they see it: Spontaneous naming and attention to shape","3940751":"A pure learning approach to background-invariant object recognition using pedagogical support vector learning","6299092":"Induced Gamma Band Responses Predict Recognition Delays during Object Identification","4014468":"Evolutionary feature design for object recognition with hierarchical networks","34223281":"Inference with classifiers : a study of structured output problems in natural language processing /","242086609":"Learning Topology of Curves with Application to Clustering","238157964":"A Limit to the Speed of Processing in UltraRapid Visual Categorization of Novel Natural Scenes","280044302":"Embodied sentence comprehension","222556802":"How honeybees generalize visual patterns to their mirror image and left–right transformation","6850730":"On the Psychology of the Recognition Heuristic: Retrieval Primacy as a Key Determinant of Its Use","232400156":"Cognition and language acquisition in normal and autistic children","220927981":"A Spectral Representation for Appearance-Based Classification and Recognition.","12506998":"Minimal information to determine affine shape equivalence","7948981":"Stability Criteria for Unsupervised Temporal Association Networks","3421676":"Perceptual learning and abstraction in machine learning: an application to autonomous robotics. IEEE Trans Syst Man Cybern Part C Appl Rev","5290122":"Simplicity and generalization: Short-cutting abstraction in children\u0027s object categorizations","2373118":"Scaling Up Context-Sensitive Text Correction","216360510":"Testing Viewpoint Invariance in the Neural Representation of Faces: An MEG Study","11499121":"A contour propagation approach to surface filling-in and volume formation","11590742":"Effect of object onset on the distribution of visual attention","243775343":"Face Detection and Gesture Recognition for Human-computer Interaction","224292791":"Multi-Stage Optimal Component Analysis","220785858":"A Comparative Study of Polynomial Kernel SVM Applied to Appearance-Based Object Recognition.","228690765":"The Effect of Vocabulary Size on Toddlers\u0027 Receptiveness to Unexpected Testimony About Category Membership","2475978":"On Region Merging: The Statistical Soundness of Fast Sorting, with Applications","233639197":"The Evolution of Umwelt and Communication","238691534":"Functional Object Classification","222414774":"Neural coding strategies and mechanisms of competition","10710616":"The Time-Organized Map Algorithm: Extending the Self-Organizing Map to Spatiotemporal Signals","11636300":"Eye position sense contributes to the judgement of slant","228725853":"When will Feature Feedback help? Quantifying the Complexity of Classification Problems"},"index":825}