{"abs":"Family studies provide an important tool for understanding etiology of diseases, with the key aim of discovering evidence of family aggregation and to determine if such aggregation can be attributed to genetic components. Heritability and concordance estimates are routinely calculated in twin studies of diseases, as a way of quantifying such genetic contribution. The endpoint in these studies are typically defined as occurrence of a disease versus death without the disease. However, a large fraction of the subjects may still be alive at the time of follow-up without having experienced the disease thus still being at risk. Ignoring this right-censoring can lead to severely biased estimates. We propose to extend the classical liability threshold model with inverse probability of censoring weighting of complete observations. This leads to a flexible way of modeling twin concordance and obtaining consistent estimates of heritability. We apply the method in simulations and to data from the population based Danish twin cohort where we describe the dependence in prostate cancer occurrence in twins.","title":"The Liability Threshold Model for Censored Twin Data","id":263736424,"url":"https://www.researchgate.net/publication/263736424_The_Liability_Threshold_Model_for_Censored_Twin_Data","names":["Klaus Holst","Thomas H. Scheike","Jacob B. Hjelmborg","Computational Statistics \u0026 Data Analysis"],"references":{"265448822":"An Empirical Transition Matrix for Non-Homogeneous Markov Chains Based on Censored Observations","13193900":"Likelihood-Based Approach to Estimating Twin Concordance for Dichotomous Traits","5207591":"Predicting cumulative incidence probability by direct binomial regression","38094573":"Fitting ACE Structural Equation Models to Case-Control Family Data","235398253":"Estimating heritability for cause specific mortality based on twin studies","7997015":"Genetic Susceptibility to Prostate, Breast, and Colorectal Cancer among Nordic Twins","262193165":"The Heritability of Prostate Cancer in the Nordic Twin Study of Cancer","238308730":"Recovery of Information and Adjustment for Dependent Censoring Using Surrogate Markers","17128842":"The inheritance of liability to diseases with variable age of onset, with particular reference to Diabetes Mellitus","10600977":"Linear Regression Analysis of Censored Medical Costs","239064398":"Semiparametric Regression Estimation in the Presence of Dependent Censoring","51271389":"Multi-Variate Probit Analysis","12079115":"Akaike\u0027s Information Criteria in Generalized Estimating Equations","2463953":"Numerical Computation Of Multivariate Normal Probabilities","10932082":"Three-state frailty model for age at onset of dementia and death in Swedish Twins","232128642":"A Generalization of Sampling Without Replacement From a Finite Universe","280806248":"Fine JP, Gray RJA proportional hazards model for the subdistribution of a competing risk. J Am Stat Assoc 94:496-509","45648654":"Frailty-Based Competing Risks Model for Multivariate Survival Data","12426724":"Environmental and Heritable Factors in the Causation of Cancer — Analyses of Cohorts of Twins from Sweden, Denmark, and Finland","257889667":"Estimating twin concordance for bivariate competing risks twin data","270970552":"XV.—The Correlation between Relatives on the Supposition of Mendelian Inheritance.","4745814":"The Calculus of M-Estimation","13847116":"Lange K. An approximate model of polygenic inheritance. Genetics 147: 1423-1430"},"citedIn":{"282530454":"Special issue on advances in survival analysis","283845186":"The Heritability of Breast Cancer among women in the Nordic Twin Study of Cancer","280123833":"Estimating Twin Pair Concordance for Age of Onset"},"index":826}