{"abs":"A novel approach to pattern matching is presented in which time complexity is reduced by two orders of magnitude compared to traditional approaches. The suggested approach uses an efficient projection scheme which bounds the distance between a pattern and an image window using very few operations on average. The projection framework is combined with a rejection scheme which allows rapid rejection of image windows that are distant from the pattern. Experiments show that the approach is effective even under very noisy conditions. The approach described here can also be used in classification schemes where the projection values serve as input features that are informative and fast to extract.","title":"Real Time Pattern Matching Using Projection Kernels","id":7591015,"url":"https://www.researchgate.net/publication/7591015_Real_Time_Pattern_Matching_Using_Projection_Kernels","names":["Yacov Hel-Or","Hagit Hel-Or","IEEE Transactions on Pattern Analysis and Machine Intelligence"],"references":{"220182686":"Similarity Measures.","220685222":"Correction to \u0027A Suboptimal Lossy Data Compression Based on Approximate Pattern Matching\u0027.","3661110":"A lossy data compression based on an approximate pattern matching","248425804":"What\u0027\u0027s wrong With Mean-square Error","3209010":"Example-based super-resolution","3193268":"Antifaces: A novel, fast method for image detection","215458771":"A Combined Corner and Edge Detector","3327415":"Fast block matching algorithm based on the winner-update strategy","3816636":"Empirical evaluation of dissimilarity measures for color and texture","239060278":"Computational image quality metrics: A review","2632888":"Parametric Feature Detection","3327138":"A multilevel successive elimination algorithm for block matching motion estimation","243763222":"A Course in Digital Signal Processing","224733556":"An Improvement of the Minimum Distortion Encoding Algorithm for Vector Quantization","4090284":"Filtering with Gray-Code Kernels","3178148":"Fast Hadamard Transform Based on a Simple Matrix Factorization","256181840":"The efficiency of using k-d trees for finding nearest neighbors in discrete space","220183431":"Real-Time Texture Synthesis by Patch-Based Sampling","200086000":"A Tutorial on Support Vector Machines for Pattern Recognition","221618581":"Learning a Rare Event Detection Cascade by Direct Feature Selection","225092552":"A Wavelet Tour of Signal Processing","3725595":"Psychovisual Aspects Of Image Processing: What\u0027s Wrong With Mean Squared Error?","221894301":"Perceptually-based Comparison of Image Similarity Metrics","3845522":"Hallucinating faces","220424200":"Multidimensional Binary Search Trees Used for Associative Searching.” Communications of the ACM, 18(9), 509-517","234802517":"What\u0027s wrong with mean-squared error?","215721846":"Robust Real-Time Object Detection","4033555":"Universal discrete denoising: known channel","3158814":"Image quality measures and their performance. IEEE Trans Commun","234791241":"Summed-Area Tables for Texture Mapping","3766402":"General framework for object detection","257200104":"Linear Algebra And Its Applications","220017568":"Matrix Computations","13232009":"Statistics of natural images: Scaling in the woods","5576340":"Fast computation of the discrete Walsh and Hadamard transforms","221115111":"One-Class Classification with Subgaussians","5562136":"Successive Elimination Algorithm for Motion Estimation","2714597":"Graded Learning for Object Detection","224378001":"Multiple Resolution Representation and Probabilistic Matching of 2-D Gray-Scale Shape","246727904":"Pyramid Methods in Image Processing","2885243":"Image Quilting for Texture Synthesis and Transfer","8909136":"Building a Cascade Detector and its Applications in Automatic Target Detection","3897955":"Pattern detection using a maximal rejection classifier","4079333":"Fast and high quality overlap repair for patch-based texture synthesis","243765083":"The Design and Analysis of Spatial Data Structure","3326703":"A fast motion estimation algorithm based on the block sum pyramid","224068485":"Fast pattern recognition using gradient-descent search in an image pyramid","268192412":"Real time pattern matching using projection kernels","260920174":"Statistics of natural images","226658534":"A Tutorial on Support Vector Machines for Pattern Recognition","215659315":"A Wavelet Tour of Signal Processing","2240462":"Graded Learning for Object Detection","3637851":"Pattern rejection","220865498":"Quantifying Perceptual Image Quality","30867879":"Multidimensional Binary Search Trees Used for Associative Searching","242508293":"Applications of Spatial Data Structure","224731668":"Energy Packing Efficiency of the Hadamard Transform","3045215":"Computation of the Fast Walsh-Fourier Transform","2397655":"Pattern Detection Using Maximal Rejection Classifier","2991318":"Hadamaard Transform Image Coding","2905427":"Image-Based Rendering Using Image-Based Priors","243782008":"Applications of Spatial Data Structures: Addison-Wesley"},"citedIn":{"242400880":"Sparse Modeling in Classification, Compression and","251850759":"Multiresolution texture synthesis using real-time pattern matching","4223046":"Statistical threshold for real time pattern matching using projection kernels","224086610":"Fixed Time Template Matching","221572158":"KPB-SIFT: a compact local feature descriptor.","229015213":"Representing Images Using Non-orthogonal Binary Bases","239723332":"Synthesis of Reflectance Function Textures from Examples","225401953":"Interactive image completion with perspective correction","3309373":"Fast Motion Estimation for H.264/AVC in Walsh–Hadamard Domain","230665386":"Monocular Visual Scene Understanding: Understanding Multi-Object Traffic Scenes","4246104":"Learning Semantic Patterns with Discriminant Localized Binary Projections","224363075":"Applying Two-Pixel Features to Face Detection","27522239":"Sparse Modeling in Classification, Compression and Detection","221314861":"Template Matching Based on the L_p Norm Using Sufficient Conditions with Incremental Approximations.","221303826":"Efficient NCC-Based Image Matching in Walsh-Hadamard Domain","220744974":"Efficient Normalized Cross Correlation Based on Adaptive Multilevel Successive Elimination","261162166":"Scene understanding from a moving camera for object detection and free space estimation","258393676":"Frame Interpolation Based on Visual Correspondence and Coherency Sensitive Hashing","4193812":"Sparse image coding using a 3D non-negative tensor factorization","23493450":"Full-Search-Equivalent Pattern Matching with Incremental Dissimilarity Approximations","261485243":"Computing Nearest-Neighbor Fields via Propagation-Assisted KD-Trees","252509243":"A Fast Template Matching Algorithm Based on Wavelet Coefficient Projection Transform","265464037":"Multi-Bin search: improved large-scale content-based image retrieval","45821315":"Applying Property Testing to an Image Partitioning Problem","4223097":"Fast motion estimation in Walsh Hadamard domain","44608481":"A Dual-Bound Algorithm for Very Fast and Exact Template Matching","263930091":"On Optimizing Auto-correlation for Fast Template Matching Through Transitive Elimination","282940045":"Measurement and 3D reconstruction method for pipeline\u0027s joints based on shape feature","220785273":"A Template Analysis Methodology to Improve the Efficiency of Fast Matching Algorithms.","244098271":"Synthesis and Rendering of 3D Textures","47647620":"Sliding Conjugate Symmetric Sequency-Ordered Complex Hadamard Transform: Fast Algorithm and Applications","251988829":"Fast pattern matching using Black Sheep algorithm","224163333":"Fast Algorithms for the Computation of Sliding Sequency-Ordered Complex Hadamard Transform","221111671":"Coherency Sensitive Hashing","249932472":"TEMPLATE-BASED ACTION RECOGNITION: CLASSIFYING HOCKEY PLAYERS\u0027 MOVEMENT","221364304":"Patch-based Image Correlation with Rapid Filtering.","224338238":"Fast Template Matching Based on Normalized Cross Correlation With Adaptive Multilevel Winner Update","259658777":"Speed-up Template Matching through Integral Image based Weak Classifiers","40653322":"Low Computational Complexity Variable Block Size (VBS) Partitioning for Motion Estimation using the Walsh Hadamard Transform (WHT)","4193881":"Non-orthogonal binary subspace and its applications in computer vision","224061500":"Fast Multi-scale Template Matching Using Binary Features","261121785":"Foreground detection using spatiotemporal projection kernels","225203714":"Efficient NCC-Based Image Matching Based on Novel Hierarchical Bounds","262307021":"Asplünd׳s metric defined in the Logarithmic Image Processing (LIP) framework: A new way to perform double-sided image probing for non-linear grayscale pattern matching","220647255":"Adaptive Low Resolution Pruning for fast Full Search-equivalent pattern matching","2888530":"SynthesisandRendering of 3DTextures","6576877":"The Gray-Code Filter Kernels","220645295":"Welfare interface implementation using multiple facial features tracking for the disabled people","220932007":"Winner Update on Walsh-Hadamard Domain for Fast Motion Estimation","261168669":"A Fast Nearest Neighbor Search Algorithm by Nonlinear Embedding","220785574":"Geodesic Active Contours with Combined Shape and Appearance Priors","221305023":"CSDD Features: Center-Surround Distribution Distance for Feature Extraction and Matching","4090284":"Filtering with Gray-Code Kernels","220928446":"CDIKP: A highly-compact local feature descriptor","261259272":"Realtime arbitrary-shaped template matching process","45372713":"Combining raster- and vector-representations for image and geometry processing applications","51715255":"Correlation-Coefficient-Based Fast Template Matching Through Partial Elimination","245569792":"Automatic Detection of Highlights in Soccer videos based on analysis of scene structure","51131055":"Performance Evaluation of Full Search Equivalent Pattern Matching Algorithms","272636390":"Video Block Motion Estimation Based on Walsh-Hadamard Projection Kernels","224164336":"Fast pattern matching using orthogonal Haar transform","247932267":"Image postprocessing by Nonlocal Kuan\u0027s filter","261596730":"A Complete Logo Detection/Recognition System for Document Images","4044685":"Generalized pattern matching using orbit decomposition","4262896":"Second-Order Belief Propagation and Its Application to Object Localization","224359406":"Efficient image matching using concentric sampling features and boosting process","242447553":"Block Matching Using Fast Walsh Search","258240726":"Efficient Cellular Automata Algorithm for Template Matching","221392006":"Applying Parallel Design Techniques to Template Matching with GPUs.","282599522":"Panorama completion for street views","5911525":"Representing Images Using Nonorthogonal Haar-Like Bases","224110490":"Applying robust structure from motion to markerless augmented reality","233941552":"The Segmented Gray-Code Kernels for Fast Pattern Matching.","221304309":"A Dynamic Conditional Random Field Model for Joint Labeling of Object and Scene Classes","3194614":"Robust Real-Time Pattern Matching Using Bayesian Sequential Hypothesis Testing","224136084":"A Near Optimal Acceptance-Rejection Algorithm for Exact Cross-Correlation Search","5462936":"Fast Full-Search Equivalent Template Matching by Enhanced Bounded Correlation","221363967":"Fast and high-performance template matching method","4246161":"Off-road Path Following using Region Classification and Geometric Projection Constraints","257467018":"Fast exhaustive-search equivalent pattern matching through norm ordering","224711089":"Fast Template Matching by Applying Winner-Update on Walsh-Hadamard Domain","251624234":"Motivation in a computer-supported collaborative learning scenario and its impact on learning activities and knowledge acquisition","252039635":"Research of monitoring method modeling of moving objects in video","38114450":"Fast Algorithm for Walsh Hadamard Transform on Sliding Windows","220745215":"Fast Block Matching Algorithm in Walsh Hadamard Domain.","8909136":"Building a Cascade Detector and its Applications in Automatic Target Detection","50590431":"Object Detection In Image Using Predator-Prey Optimization","269471440":"Fast and Accurate Template Matching Algorithm Based on Image Pyramid and Sum of Absolute Difference Similarity Measure","221361616":"Real-Time Image Matching Based on Multiple View Kernel Projection","224506246":"Video Block Motion Estimation Based on Gray-Code Kernels","264387625":"Fast Orthogonal Haar Transform PatternMatching via Image Square Sum","245568847":"A Study on Audience Counting Method in Auditorium Based on Pattern Comparison","229366853":"Four-dimensional matrix Walsh transform for lossless compression of color video","229892674":"Fast Multidimensional Nearest Neighbor Search Algorithm Using Priority Queue","221184990":"Object Recognition for Obstacle Avoidance in Mobile Robots","243101838":"Nonlocal linear image regularization and supervised segmentation. UCLA CAM Report 06-47","224622230":"Irregular pattern matching using projections","228626522":"Fast Simultaneous Tracking and Recognition Using Incremental Keypoint Matching","224680091":"A Fast Block Motion Estimation Algorithm Using Gray Code Kernels"},"index":827}