{"abs":"Probabilistic constraints represent a major model of stochastic optimization. A possible approach for solving probabilistically constrained optimization problems consists in applying nonlinear programming methods. To do so, one has to provide suﬃciently precise approximations for values and gradients of probability functions. For linear probabilistic constraints under Gaussian distribution this can be done successfully by analytically reducing these values and gradients to values of Gaussian distribution functions and computing the latter, for instance, by Genz’s code. For nonlinear models one may fall back on the spherical-radial decomposition of Gaussian random vectors and apply, for instance, Dea´k’s sampling scheme for the uniform distribution on the sphere in order to compute values of corresponding probability functions. The present paper demonstrates how the same sampling scheme can be used to simultaneously compute gradients of these probability functions. More precisely, we prove a formula representing these gradients in the Gaussian case as a certain integral over the sphere again. The result is also extended to alternative distributions with an emphasis on the multivariate Student’s (or t-) distribution.","title":"Gradient Formulae for Nonlinear Probabilistic Constraints with Gaussian and Gaussian-Like Distributions","id":263048542,"url":"https://www.researchgate.net/publication/263048542_Gradient_Formulae_for_Nonlinear_Probabilistic_Constraints_with_Gaussian_and_Gaussian-Like_Distributions","names":["Wim van Ackooij","René Henrion","SIAM Journal on Optimization"],"references":{"230873408":"Lectures on stochastic programming: Modeling and theory. Philadelphia, SIAM","232945510":"Differentiability of probability function","267065326":"Hypermultitrees and sharp Bonferroni inequalities","238848699":"Derivatives of probability functions and integrals over sets given by inequalities","263047973":"Derivatives of Probability Functions and some Applications","220462124":"Some Aspects of Stability in Stochastic Programming","228463758":"Joint Chance Constrained Programming for Hydro Reservoir Management","230679979":"QMC designs: Optimal order Quasi Monte Carlo Integration schemes on the sphere","2463282":"Quantitative Stability in Stochastic Programming: The Method of Probability Metrics","263047733":"Structural Reliability Methods","232998394":"“Computing Probabilities of Rectangles in Case of Multinormal Distribution,”","263047729":"Concavity and efficient points for discrete distributions in stochastic programming","226015335":"Stability and sensitivity-analysis for stochastic programming","226901145":"Quantitative stability of variational systems: III.ε-approximate solutions","263047944":"Probabilistic Programming","40100170":"Estimation method of multivariate exponential probabilities based on a simplex coordinates transform","263048092":"Differentiation of Probability Functions : The Transformation Method","227219385":"Derivatives of probability functions and some applications","226793782":"Evaluation of a special multivariate gamma distribution function","225958593":"Stochastic Optimization of Insurance Portfolios for Managing Exposure to Catastrophic Risks","225661253":"Scenario tree generation for multiperiod financial optimization by optimal discretization","263047835":"Computation of Multivariate Normal and Probabilities","233092306":"Monotony Analysis and Sparse-Grid Integration for nonlinear Chance Constrained Process Optimization","227447732":"Chance-Constrained Programming,” Manage","257480034":"Regularization methods for optimization problems with probabilistic constraints","220133409":"Probability Gradient Estimation by Set-Valued Calculus and Applications in Network Design","227283379":"Scenarios for Multistage Stochastic Programs","227082312":"Portfolio optimization via stochastic programming: Methods of output analysis","2582626":"Power Management in a Hydro-Thermal System under Uncertainty by Lagrangian Relaxation","230663669":"Constructing Optimal Samples from a Binomial Lattice","263047783":"On Logarithmic Concave Measures and Functions","220462441":"Subroutines for Computing Normal Probabilities of Sets - Computer Experiences","222652296":"Quasi-Monte Carlo methods can be efficient for integration over products of spheres","200035362":"Convex Approximations of Chance Constrained Programs","249599151":"Derivatives of Probability and Integral Functions: General Theory and Examples","46491530":"Asymptotic formulas for the derivatives of probability functions and their Monte Carlo estimations","220589174":"Quantitative stability in stochastic programming","226496214":"Stochastic Lagrangian Relaxation Applied to Power Scheduling in a Hydro-Thermal System under Uncertainty","225348280":"Nemirovski, A.: Robust solutions of linear programming problems contaminated with uncertain data. Math. Prog., Ser. A 88, 411-424","222819728":"On joint probabilistic constraints with Gaussian coefficient matrix","259927463":"A Gradient Formula for Linear Chance Constraints Under Gaussian Distribution","226206881":"Concavity and efficient points of discrete distributions in probabilistic programming","263048183":"Differentiability of Probability function","3032435":"The Scenario Approach to Robust Control Design","263047666":"A mixed-integer stochastic nonlinear optimization problem with joint probabilistic constraints","225523732":"On probabilistic constraints induced by rectangular sets and multivariate normal distributions","263047749":"Gradient estimates for Gaussian distribution functions: Application to probabilistically constrained optimization problems","263048261":"Differentiation of Probability Functions : The Transformation Method","220462409":"Improved Bounds and Simulation Procedures on the Value of the Multivariate Normal Probability Distribution Function","225490846":"Sample Average Approximation Method for Chance Constrained Programming: Theory and Applications","23739524":"Scenario Modeling for the Management of International Bond Portfolios","225781530":"Stability analysis for stochastic programs","226424847":"Sensitivity of Bond Portfolio\u0027s Behavior with Respect to Random Movements in Yield Curve: A Simulation Study","2463953":"Numerical Computation Of Multivariate Normal Probabilities","2611026":"EVPI-Based Importance Sampling Solution Procedures for Multistage Stochastic Linear Programmes on Parallel MIMD Architectures","226516087":"Extensions of Stochastic Optimization Results to Problems with System Failure Probability Functions","226535935":"Mathematical Properties of the Multivariate t Distribution"},"citedIn":{"263047982":"A Characterization of the Subdifferential of Singular Gaussian Distribution Functions","263048554":"Constrained Bundle Methods for Upper Inexact Oracles with Application to Joint Chance Constrained Energy Problems","273495466":"Probabilistic constraints via SQP solver: application to a renewable energy management problem","287159171":"On probabilistic constraints with multivariate truncated Gaussian and lognormal distributions"},"index":828}