{"abs":"A method for detecting and describing the features of faces using deformable templates is described. The feature of interest, an eye for example, is described by a parameterized template. An energy function is defined which links edges, peaks, and valleys in the image intensity to corresponding properties of the template. The template then interacts dynamically with the image, by altering its parameter values to minimize the energy function, thereby deforming itself to find the best fit. The final parameter values can be used as descriptors for the features. This method is demonstrated by showing deformable templates detecting eyes and mouths in real images","title":"Feature Extraction Faces Using Deformable Templates","id":220659647,"url":"https://www.researchgate.net/publication/220659647_Feature_Extraction_Faces_Using_Deformable_Templates","names":["Alan L. Yuille","Peter W. Hallinan","David S. Cohen","International Journal of Computer Vision"],"references":{"19599435":"An analogue approach to the Travelling Salesman Problem using an Elastic Net Method","3507700":"Classification of facial features for recognition","246356652":"HANPS: A Pattern Theoretical Study of Biological Shapes","34020675":"Finding Image Features Using Deformable Templates and Detailed Prior Statistical Knowledge","252915254":"Tutorial on advances in morphological image processing and analysis (Invited Paper)","220659872":"Active contour models. Int J Comput Vis","243678316":"Facial feature extraction by deformable templates","235077641":"Recognition by Parts","223101287":"A dynamic model for image registration","243673769":"Computer Recognition of Human Faces","224377615":"Elastic Matching of Line Drawings","243775702":"Building Highly Structured Volume Representations in 3D Medical Images","225122681":"Deformable templates for feature extraction from medical images","242918920":"An Analysis of the Elastic Net Approach to the Traveling Salesman Problem","235981539":"Mathematical morphology in image analysis","3045915":"The representation and matching of pictorial structures. IEEE Trans Comp","234530179":"Statistical Field Theory"},"citedIn":{"251969285":"Iris detection method using particle filter and edge directional features","3659829":"Planar Shape Enhancement and Exaggeration","222522688":"Face Detection: A Survey","228898211":"Eye Contour Extraction For Fetal Alcohol Syndrome Screening","221304119":"Learning Flexible Models from Image Sequences","241188457":"Driver gaze tracker using deformable template matching","220931364":"Generic Real-Time Tracking Method on Semi-Dynamic Scenes","4036653":"A parametric model for realistic lip segmentation","4040749":"Real-time view-based face alignment using active wavelet networks","3192865":"An analytic-to-holistic approach for face recognition based on a single frontal view","4239441":"Face detection in color images based on sub-image fusion and SVM","255563567":"Pattern Theory: A Unifying Perspective","224398708":"Methodological Approach for Machine based Expression and Gender Classification","5589058":"Face authentication with Gabor information on deformable graphs","29651421":"Organising a photograph collection based on human appearance","3659822":"Locating and tracking facial speech features","220587324":"A Geometric Invariant Approach to Human Face Verification.","3659821":"Tracking of deformable contours by synthesis and match","255622947":"Human Hidden Emotion Identification Techniques with Multi-Feature Face Recognition System","251903776":"Facial component features for facial expression identification using Active Appearance Models","2871309":"Tracking Objects Using Density Matching and Shape Priors","224079223":"A facial expression recognition for a speaker of a phoneme of vowel using thermal image processing and a speech recognition system","251916079":"Application of Mean Shift Algorithm in Real-Time Facial Expression Recognition","3455001":"Objects Matching using Optimization Techniques","262725509":"An Overview of Holistic Face Recognition","39379565":"Contribución al reconocimiento de objetos desde primitivas de elementos de contorno","4053000":"Face recognition using hybrid feature","222657907":"Robust real-time eye detection and tracking under variable lighting conditions and various face orientations. Comp Vis Im Und","3192838":"A Volumetric/iconic Frequency domain Representation for objects with application for pose invariant face recognition","42803893":"A Novel Method for 3D Face Detection and Normalization","254420755":"An Introduction to Active Shape Models","235114041":"Eye Detection and Tracking for Intelligent Human Computer Interaction","221052178":"Eye-State Action Unit Detection by Gabor Wavelets.","221424909":"Integrating face recognition techniques with blog as a distance education support system (DESS) in international distance learning","3969148":"Key points based segmentation of lips","266164120":"A bayesian framework for face recognition","2248804":"Planar Shape Enhancement And Exaggeration","3969147":"Localizing the iris center by region growing search","277297344":"An Analysis of Eigenfaces for Face Detection by","228896239":"Face Recognition using Wavelet, PCA, and Neural Networks","223464732":"An automatic algorithm for semantic object generation and temporal tracking","45200127":"Object Detection with Discriminatively Trained Part-Based Models","277934274":"Image contour based on context aware in complex wavelet domain","3917934":"Automatic features detection for overlapping face images on their3D range models","3766382":"Accurate, real-time, unadorned lip tracking","245462777":"Face recognition from front-view face","257406733":"Automatic visual speech segmentation and recognition using directional motion history images and Zernike moments","222827795":"Improving verification accuracy by synthesis of locally enhanced biometric images and deformable model","249786045":"BORANG PENGESAHAN STATUS TESISä","242753063":"Final Report To NSF of the Planning Workshop on Facial Expression Understanding","224744762":"Facial feature extraction using topological methods","2517063":"Computing Spatio-Temporal Representations of Human Faces","3813467":"Fast, reliable head tracking under varying illumination","228822465":"Effect of eye localization on the MPEG-7 face recognition descriptor","224386364":"Unsupervised Object Segmentation with a Hybrid Graph Model (HGM)","12640420":"Automated DNA fragment collection by capillary array gel electrophoresis in search of differentially expressed genes","243785442":"FACE RECOGNITION USING GABOR WAVELET TRANSFORM","221551954":"Extended Fitting Methods of Active Shape Model for the Location of Facial Feature Points","251801445":"Detecção de Faces e Características Faciais","4186199":"Implicit surface segmentation by minimal paths, applications in 3D medical images","226030868":"Robust Object Detection with Interleaved Categorization and Segmentation","7161859":"Automatic Image Hanging Protocol for Chest Radiographs in PACS","282687670":"Multiple Hierarchical Technique to Predict the Gender of a Person based on 3 Sigma Control Limits on Neural Network","239031886":"Automatic face and gestual recognition for video indexing","3221568":"Guide-wire tracking during endovascular interventions","2433105":"Fast, Reliable Head Tracking under Varying Illumination","2439248":"Deformable Prototypes for Encoding Shape Categories in Image Databases","265002942":"Lip Analysis for Person Recognition","225156381":"Recursive Compositional Models for Vision: Description and Review of Recent Work","222833968":"Pupil Detection and Tracking Using Multiple Light Sources","3684418":"A Hyperquadric Model for {2-D} and {3-D} Data Fitting","2758736":"Segmenting Non-Random Noise Biomedical Images","221304139":"Face Alignment Via Component-Based Discriminative Search","261312488":"An algorithm for human eye location in complex background based on image processing","255579974":"Modification of Audible and Visual Speech","229885390":"Automatic Detection of Circular Structures in High-resolution Satellite Images of Agricultural Land","271482960":"A Model-Based Approach for Compound Leaves Understanding and Identification","3792966":"Performance of visual tracking systems: Implications for visual controlled motion","251668355":"157 The mTOR kinase inhibitor AZD8055 induces cell death in Her2+ tumours partially or intrinsically resistant to ErbB2 inhibitors","235337347":"An approach of eye detection under varying in-plane rotation of face\nimage","3684528":"Facial feature extraction from color images","270018707":"Face Detection Using the 3X3 Block Rank Patterns of Gradient Magnitude Images","238696113":"Active Contours . London","223583711":"A Region-Based Scheme Using RKLT and Predictive Classified Vector Quantization","4124851":"Locatization of human eyes based on a series of binary images","223688133":"Eye/eyes tracking based on a unified deformable template and particle filtering","241749753":"A PHOTOGRAMMETRIC METHOD FOR THE ASSESSMENT OF FACIAL MORPHOLOGY IN FETAL ALCOHOL SYNDROME SCREENING","232652111":"Determining facial expressions in real time","263575331":"Object recognition by deterministic annealing","221318568":"Wavelet, active basis, and shape script - A tour in the sparse land","220601788":"Extracting facial features by an inhibitory mechanism based on gradient distributions","220728755":"Realistic Animation Using Extended Adaptive Mesh for Model Based Coding","220183939":"Multiresolution Stochastic Hybrid Shape Models with Fractal Priors","220845493":"A Parametric Active Polygon for Leaf Segmentation and Shape Estimation","37245605":"Recognizing Faces -- An Approach Based on Gabor Wavelets","4221149":"Multi-stage fusion for face localization","221361583":"Recognizing Upper Face Action Units for Facial Expression Analysis.","261203726":"Eyes location method based on the adaboost algorithm and block integral projection","3917979":"Bayesian face recognition with deformable image models","221588881":"Multiple Neural Networks for Facial Feature Localization in Orientation-Free Face Images.","222053786":"Active vision-based face authentication","26665265":"An improved graph cut segmentation method for cervical lymph nodes on sonograms and its relationship with node\u0027s shape assessment","221052292":"An Approach to Robust and Fast Locating Lip Motion","2306184":"Real-Time Detection of Human Faces in Uncontrolled Environments","253069242":"Facial Recognition and Destiny Foreseeing for Specified Persons Using Fuzzy Classification Technique","3858569":"Extraction and tracking of the eyelids","220763547":"Facial Expression Analysis under Various Head Poses","267198297":"Improved lip fitting and tracking for model-based multimedia and coding","246341144":"Graphical Templates for Image Matching","228973842":"Two methodologies for iris detection and location in face images","49664578":"Using Statistical Deformable Models to Reconstruct Vocal Tract Shape from Magnetic Resonance Images","220611995":"On modelling, extraction, detection and classification of deformable contours from noisy images","37999357":"Coördinating human-robot communication","256520074":"Non-linear generalization of point distribution models using polynomial regression","251567678":"Eyelid contour detection and tracking for startle research related eye-blink measurements from high-speed video records","220728813":"Using Prior Shape and Points in Medical Image Segmentation","246156907":"Face recognition: A literature surve y","220464620":"Ji, Q.: Information extraction from image sequences of real-world facial expressions. Machine Vision and Applications 16(2), 105-115","268175152":"Algorithms Fusion for Face Localization","224351633":"A Novel Method for Facial Features Extraction Using Bilateral Filtering and Wavelet Transform","220728807":"Object Recognition Using Stochastic Optimization.","221292031":"Dual-State Parametric Eye Tracking.","234171685":"Feature-specific imaging: Extensions to adaptive object recognition and active illumination based scene reconstruction","2500853":"Towards Perceptual Intelligence: Statistical Modeling of Human Individual and Interactive Behaviots","30871809":"Recognition and Retrieval in Visual Architectural Databases","220644848":"Integrating prior shape models into level-set approaches","221259239":"Translation Templates for Object Matching Across Predictable Pose Variation","221621730":"Hand Detection by Direct Convexity Estimation.","276240544":"Eye Location Based on Hough Transform and Direct Least Square Ellipse Fitting","265676559":"Face Recognition using Neural Network and Eigenvalues with Distinct Block Processing","265756426":"An integrated approach for visual tracking of hands, faces and facial features","3660009":"Context based detection of keypoints and features in eye regions","26532212":"MAP Estimation of Chin and Cheek Contours in Video Sequences","2986191":"Recent advances in the automatic recognition of audiovisual speech","227308904":"Shape statistics and image analysis","26511729":"Animation of 3D Model of Human Head","251748327":"Extracorporeal CO2 removal with AV pumpless bypass","220061173":"Robotic Intelligence for Industrial Automation: Object Flaw Auto Detection and Pattern Recognition by Object Location Searching, Object Alignment, and Geometry Comparison","4288681":"A Robust Approach for Eye Localization Under Variable Illuminations","238690003":"VISUAL OBJECTS AND ENVIRONMENTS: CAPTURE, EXTRACTION, AND REPRESENTATION","242402971":"Iris Recognition On the Move At A Distance \u0026 Related Technologies","220804549":"Extraction Of Eye Features For Fetal Alcohol Syndrome Screening","2898112":"Interleaved Object Categorization and Segmentation","220460494":"Tracking and Synthesizing Facial Motions with Dynamic Contours","228531570":"Active Basis for Modeling, Learning and Recognizing Deformable Templates","3975379":"Improving adaptive skin color segmentation by incorporating results from face detection","28621120":"Performance of visual tracking systems: Implications for visual controlled motion","228799830":"Eigenfaces and Beyond","42803834":"Optimal Weighting of Landmarks for Face Recognition","37997243":"Real-time face verification","226925950":"Detection of Facial Feature Points Using Anthropometric Face Model","222862770":"Integrating active face tracking with model based coding","3659980":"Facial Component Extraction by Cooperative Active Nets with Global Constraints","258252697":"A Novel Eye Localization Method With Rotation Invariance","268054267":"Real Time Face Tracking Using Active Contour Models","221703220":"Automatic Age Prediction of Aging Effects on Face Images","3666229":"On Merging Hidden Markov Models with Deformable Templates","228523162":"Eye state detection from color facial image sequence","220726318":"Three Dimensional Model Adaptation and Tracking of a Human Face.","3666224":"Extraction of facial sketch images and expression transformation based on FACS","2373933":"Representation and Recognition of Complex Human Motion","262348458":"Guest login: visitor-centred information design","40541024":"Real-Time Detection and Tracking of Human Eyes in Video Sequences","50952706":"Cascaded Pose Regression","220177426":"Automatic facial expression recognition using facial animation parameters and multistream HMMs.","261340830":"A Fast Training Method for Face Detection","3612984":"Closed-world tracking","26531995":"Image-Based 3D Face Modeling System","280041892":"TEMPLATE-BASED STATISTICAL SHAPE MODELLING ON DEFORMATION SPACE","2797887":"Planar Shape Enhancement and Exaggeration","3887404":"Discriminant snakes for 3D reconstruction in medical images","261082774":"Face analysis and pose approximation","3359017":"Statistical coding method for facial features","223542345":"Fiducial point localization in color images of face foregrounds","246157239":"Face Detection Using Locally Linear Embedding","3922215":"HMM-based audio-visual speech recognition integrating geometric and appearance-based visual features","3666218":"New robust image operators and applications in automatic facialfeature analysis","226403424":"Determining the Contour of Cylindrical Biological Objects Using the Directional Field","3678502":"Locating facial features using threshold images","282984896":"Robust face detection using haar features with weber local descriptor and local binary pattern","250136567":"Swarmtrack: A particle swarm approach to visual tracking","268043993":"ANALYSIS, RECOGNITION AND SYNTHESIS OF FACIAL GESTURES","225496148":"Robot tracking by color image","239562594":"Directeur de Recherche : J. M. MOREL","232656121":"Estimation of the chin and cheek contours for precise face model adaptation","224726093":"Feasibility of Hough-transform-based iris localisation for real-time-application","8337751":"Automatic Eyeglasses Removal from Face Images","2824448":"Optimization Approaches in Computer Vision and Image Processing","263906967":"AUTOMATIC FACIAL FEATURE EXTRACTION USING EDGE DISTRIBUTION AND GENETIC SEARCH","221582363":"Simultaneous Recognition of Multiple Objects Using the MEM Model.","228973707":"Multi-cues eye detection on gray intensity image","243152718":"Surface modeling using deformable templates","3455236":"Automatic Facial Expression Recognition Using Facial Animation Parameters and Multistream HMMs","220359699":"Face and Eye Detection from Head and Shoulder Image on Mobile Devices.","220599316":"Physically-based active shape models: Initialization and optimization","2689307":"Image Representations for Object Detection Using Kernel Classifiers","232645871":"Variational Shape Model for Lip Postures Recognition Using GA","2814238":"Head Tracking via Robust Registration in Texture Map Images","223595623":"Lip contour extraction from color images using a deformable model","225807425":"Real-time visual tracking for surveillance and path planning","242145115":"Segmentation des données visuelles et télémétriques Application pour la détection de véhicules en milieu autoroutier","240695149":"A computational model of facial expression","30517479":"Segmentation, suivi et visualisation d\u0027objets biologiques en microscopie 3D par fluorescence : Approches par modèles déformables","3776782":"Analysis and synthesis of facial expressions for MPEG-4 system","3193099":"Fast, reliable head tracking under varying illumination: An approach based on registration of texture-mapped 3D models","222549112":"Bayesian Shape Model for Facial Feature Extraction and Recognition","224207974":"Competitive Combination of Multiple Eye Detection and Tracking Techniques","222493697":"A Hierarchical Markov Modeling Approach for the Segmentation and Tracking of Deformable Shapes","3307892":"Automatic adaptation of a face model using action units for semantic coding of videophone sequences","4133241":"A new method for eye extraction from facial image","27541731":"Automatic soft plaque detection from CTA","265852560":"Deep Regression for Face Alignment","4086134":"Feature-based human face detection","3729777":"Motion tracking of the facial components using constraints by thefacial muscles","3193210":"A Fast and Accurate Face Detector Based on Neural Networks","220181587":"Recognizing Human Facial Expressions From Long Image Sequences Using Optical Flow.","268185265":"Facial feature units\u0027 localization using horizontal information of most significant bit planes","2515305":"Face Segmentation For Identification Using Hidden Markov Models","215895441":"A new color image energy for active contours in natural scenes","3776872":"Identifying human faces in general appearances","226405423":"Object localization using color, texture and shape","3729770":"Automatic feature extraction of facial organs and contour","251848272":"Robust facial element extraction under lighting variation","2793854":"Visual Tracking Using Closed-Worlds","3729772":"Facial expression recognition using thermal image processing and neural network","266344117":"Συνέργεια Κατάτµησης Εικόνων και Αναγνώρισης Αντικειµένων µε Γεωµετρικές και Στατιστικές Τεχνικές της ΄Ορασης Υπολογιστών","3729773":"Deformable templates for tracking the facial components","261338822":"Lip Contour Modeling Based on Active Shape Model","229149950":"Visual tracking of hands, faces and facial features of multiple persons","3613036":"Tracking and recognizing rigid and non-rigid facial motions usinglocal parametric models of image motion","3895648":"Dental caries lesions detection using deformable templates","3613032":"A Unified Approach To Coding and Interpreting Face Images","3193199":"Automatic analysis of facial expressions: the state of the art. IEEE Trans PAMI","246996953":"A Multi-Agent Framework for a Hybrid Facial Action Tracker","3326288":"A Markov random field model-based approach to unsupervised texture segmentation using local and global spatial statistics","221226061":"Concurrent grammar inference machines for 2-d pattern recognition: A comparison with the level set approach","3660116":"Face recognition by feature orientation and feature geometry matching","256075302":"Eigenfaces for Recognition. J Cogn Neurosci","3707230":"A Knowledge-based System For Hair Region Segmentation","269101421":"Facial Expression Recognition Using Neural Network Trained with Zernike Moments","254287439":"Bayesian Faces via Hierarchical Template Modeling","241420036":"Internal shape-deformation invariant 3D surface matching using 2D principal component analysis - art. no. 60560D","221209671":"Wavelet Transform and Fusion of Linear and Non Linear Method for Face Recognition.","2830659":"Face Localization from Discriminative Regions","221303898":"Towards Real-Time Cue Integration by Using Partial Results","220134517":"Preprocessing of Face Images: Detection of Features and Pose Normalization","3193180":"Correspondence with cumulative similarity transforms","2617672":"Morphological Scale-Space With Application to Three-Dimensional Object Recognition","220654678":"A multi-scale template method for shape detection with bio-medical applications","235140978":"Recognition by Linear Combination of Models","268254862":"FACE VERIFICATION FOR ACCESS CONTROL","27609296":"Combinaison de classifieurs pour la localisation de visage","235089781":"Towards a Vision Algorithm Compiler for Recognition of Partially Occluded 3-D Objects","2609488":"Robust car tracking using Kalman filtering and Bayesian templates","2931035":"Bone Morphing with statistical shape models for enhanced","228852958":"Monitoring and modeling of pupillary dynamics: Study of the autonomous nervous system","250775439":"Frontal View Human Face Detection and Recognition","220726358":"VIDAS Workshop on Synthetic Natural Hybrid Coding.","232658014":"Facial features localization in front view head and shoulders images","221361332":"The Integration of Optical Flow and Deformable Models with Applications to Human Face Shape and Motion Estimation.","3703217":"LAFTER: lips and face real time tracker","2742688":"Estimation of Eye, Eyebrow and Nose Features in Videophone Sequences","263040548":"Eye and gaze tracking for visually controlled interactive stereoscopic displays - an experiment study on the subjective effects of disparity magnitude and depth of focus","228615210":"Active contours technique in retinal image identification of the optic disk boundary","237379498":"THE MIDDLE EAST TECHNICAL UNIVERSITY","280852784":"Fast and Exact: ADMM-Based Discriminative Shape Segmentation with Loopy Part Models","224640238":"Tracking deformable objects with unscented Kalman filtering and geometric active contours","251831951":"Facial feature extraction using improved deformable templates","251129720":"Facial Recognition with Singular Value Decomposition","228983862":"Head Recognition System","224744693":"Jumping snakes and parametric model for lip segmentation","283095375":"Fusion of audio and video data by neural networks for robust vowel recognition","222682327":"Parametric models for facial features segmentation","3193250":"Deformable shape detection and description via model-based region grouping","243136488":"Design of rotation, illumination, and texture-invariant composite filters from range images using simulated annealing for face recognition","28360742":"Local Graph-Based Probabilistic Representation of Object Shape and Appearance for Model-Based Medical Image Segmentation","237234100":"Figure 1. Automatic eyeglasses removal system overview. (a) An input face image. (b) Face localization by ASM. (c) Glasses recognition by a classifier. (d) Glasses localization by MCMC. (e) Glasses removal based on a set of training examples. Automatic Eyeglasses Removal from Face Images","271303091":"Face Recognition Using Eigen Faces and Artificial Neural Network","3193257":"Corrections to \"Deformable shape detection and description via model-based region grouping\"","275294706":"Emotion Recognition-A Selected Review","220214459":"Using geometric properties of topographic manifold to detect and track eyes for human-computer interaction","223208656":"Learning probabilistic deformation models from image sequences","241588219":"Eye detection system based on SVM filter","2947505":"Recognition of Humans and Their Activities Using Video","223546573":"Model based recognition of specular objects using sensor models","277154075":"Εξελιγμενες Τεχνικες Επεξεργασιας Και Αναλυσης Ψηφιακων Εικονων Αμφιβληστροειδους Με Χρηση Πλατφορμας Matlab","249734979":"YÜZ TANIMA: ÖZ YÜZLER, YAPAY SİNİR AĞLARI, GABOR DALGACIK DÖNÜŞÜMÜ YÖNTEMLERİ","3705241":"Modelling active contours using neural networks isomorphic to boundaries","224750791":"Inner lip feature extraction for MPEG-4 facial animation","228848640":"Facial expression recognition for speaker using thermal image processing and speech recognition system","4041115":"A new facial feature extraction method based on linear combination model","222766313":"Infrared thermography on ocular surface temperature: A review","222833912":"Active blobs: Region-based, deformable appearance models","5671398":"Real-Time Image Restoration for Iris Recognition Systems","3193219":"Recognizing Action Units for Facial Expression Analysis. IEEE Transactions on Pattern Analysis and Machine Intelligence, 23(2): 97-115","3717516":"Automatic face image recognition: an accurate eye location procedure","2488721":"Facial Feature Extraction And Image Warping Using Pca Based Statistic Model","255606408":"IMPROVED FACIAL FEATURE EXTRACTION FOR MODEL-BASED MULTIMEDIA","257093348":"On advances in differential-geometric approaches for 2D and 3D shape analyses and activity recognition","2931099":"Statistical Models of Appearance for computer vision","265313896":"Real Time Eye Template Detection and Tracking","2433439":"Machine Learning Strategies for Complex Tasks","223694057":"Object recognition with constrained elastic models","262166044":"ActiveIris: uma solução para comunicação alternativa e autonomia de pessoas com deficiência motora severa","242436046":"VISUAL SPEECH RECOGNITION USING ACTIVE SHAPE MODELS AND HIDDEN MARKOV MODELS Juergen Luettin, Neil A. Thacker and Steve W. Beet Department of Electronic and Electrical Engineering University of Sheffield, Sheffield, UK","220142754":"Method for detecting transitions of emotional states using a thermal facial image based on a synthesis of facial expressions","224746712":"Monitoring and modeling of pupillary dynamics","226696254":"A Hands-Free Non-Invasive Human Computer Interaction System","223515884":"Eye tracking in the wild. Comp Vis Im Und","265883239":"A Study on Human Eye Detection in a Color Image Based on Harris Corner Detector and Sobel Edge Operator","3660169":"Face detection and facial feature extraction using color, shape and symmetry-based cost functions","224441567":"Eye State Detection in Facial Image based on Linear Prediction Error of Wavelet Coefficients","221922552":"User, Gesture and Robot Behaviour Adaptation for Human-Robot Interaction","2499054":"Active Shape Model Search using Local Grey-Level Models: A Quantitative Evaluation","49593148":"Template Matching based Eye Detection in Facial Image","221492473":"Extraction of Pose Invariant Facial Features","3193340":"Detecting Faces in Images: A Survey","47528728":"Prestaciones de la Normalización del Rostro en el Reconocimiento Facial","227886170":"A contour tracking method using elastic contour model and energy minimization approach","261447237":"Iris tracking with feature free contours","251909843":"A Practical Eye State Recognition Based Driver Fatigue Detection Method","220882171":"Face Recognition Using Principle Component Analysis, Eigenface and Neural Network","41890733":"Multi Local Feature Selection Using Genetic Algorithm For Face Identification","3504614":"Representation and the dimensions of shape deformation","3504609":"Analysis of Facial Images Using Physical and Anatomical Models","3715564":"Considerations on extended feature vectors in automatic face recognition","240764813":"A Snake-based approach for TIGER road data conflation","283496753":"Automatic computation of histogram threshold for lip segmentation using feedback of shape information","283095306":"Lip image feature extraction utilizing snake\u0027s control points for lip reading applications","222694559":"Synthesizing realistic facial animations using energy minimization for model-based coding","8337829":"Nonlinear Color Space and Spatiotemporal MRF for Hierarchical Segmentation of Face Features in Video","37991327":"Analysis, Interpretation and Synthesis of Facial Expressions","220902646":"Emotion recognition through facial expression analysis using neuro-fuzzy system","37413863":"Kernel-based classifiers with applications to face detection","2241020":"Coarse-to-Fine Visual Selection","273021339":"Development of a robust active infrared-based eye tracker","3965407":"Prior shape models for boundary finding","251907813":"Eye-verifier using ternary template for reliable eye detection in facial color images","222571683":"3D nonrigid motion analysis under small deformations","221400282":"Bayesian Estimation of Intra-operative Deformation for Image-Guided Surgery Using 3-D Ultrasound.","221506778":"Iris Tracking with Feature Free Contours.","3561949":"Issues in database management of multimedia information","2302415":"Generalization to Novel Images in Upright and Inverted Faces","29603886":"A New 3D Lip Model for Analysis and Synthesis of Lip Motion in Speech Production","2681285":"Contours Actifs Pour La Lecture Labiale En Combinant \"snakes\" Et \"templates\"","229071945":"In: Language Acquisition SPEAKER-SPECIFIC ARTICULATORY ASSESSMENT AND MEASUREMENTS DURING PORTUGUESE SPEECH PRODUCTION BASED ON MAGNETIC RESONANCE IMAGES","11000137":"Active shape model segmentation with optimal features","290797733":"Review of Face Recognition Techniques","248592163":"A Bayesian Model for Extracting Facial Features","8143247":"Quantification of facial expressions using high-dimensional shape transformations","31889426":"Possibilities of man-machine interaction through the perception of human gestures","225799297":"Automated Processing and Classification of Face Images for Human–Computer Interaction Applications","220720338":"“Video Rewrite: Driving Visual Speech with Audio”","269724134":"Simultaneous high-dimensional clustering and feature selection using asymmetric Gaussian mixture models","267669006":"Intelligent multimedia processing with soft computing","236953573":"Face Recognition Based on Facial Features","41028489":"In the Eye of the Beholder: A Survey of Models for Eyes and Gaze","264033863":"Detection of Pupil using Template Matching Based on Genetic Algorithm in Facial Images","228605020":"Facial expression synthesis using a statistical model of appearance","224274270":"Flexible face animation using MPEG-4/SNHC parameter streams","2495011":"A Real-Time Head Nod and Shake Detector","37650491":"Methods to Automatically Build Point Distribution Models for Objects like Hand Palms and Faces Represented in Images","239666255":"Semi-automatic methods for recovering radial distortion parameters from a single image","224673634":"A Facial Expression Model for Human-Like Agent","2509358":"Geometrically Deformable Templates for Shape-based Segmentation and Tracking in Cardiac MR Images","228585365":"Real-time detection of eyes and faces","220659500":"Generalization to Novel Views: Universal, Class-based, and Model-based Processing","3818038":"Lip signatures for automatic person recognition","240720983":"Automatic and Accurate Lip Tracking","221458210":"Detection of facial features based on the relaxation algorithm.","252120341":"Issues in Database Management of Multimedia Information (Invited Paper)","234799084":"Parametrically deformable contour models for image analysis","245419186":"On Tracking of Eye for Human-Robot Interface","220645170":"Learning explicit and implicit visual manifolds by information projection","224722801":"Facial feature extraction using genetic algorithm","221304613":"Object Recognition Using Junctions","2824765":"From Global to Local, a Continuum of Shape Models with Fractal Priors","221458212":"Automatic Facial Animation Parameters extraction in MPEG-4 visual communication","228978621":"Real time positioning system based on active stereo and facial features identification","221282090":"Eye-Distance Based Mask Selection for Person Identification","287933195":"Detección de Rostros en Una Imagen Bidimensional","220598020":"Accurate and quasi-automatic lip tracking.","221622039":"Facial Phoneme Extraction for Taiwanese Sign Language Recognition","223846259":"Use of deformable template for two-dimensional growth ring detection of otoliths by digital image processing:: Application to plaice (Pleuronectes platessa) otoliths","8043103":"Improving performance of distribution tracking through background mismatch","210333356":"Color-based Lip Localization Method","3181078":"Real-time Embedded Face Recognition for Smart Home","3840541":"Methods of global optimization in the tracking of contours","2261509":"Multidimensional Elastic Pattern Matching","221531934":"Tracking gestures using a probabilistic Self-Organising network.","224110448":"Face Processing on Low-Power Devices","255653143":"Un modèle géométrique de lèvres 3D adaptable au locuteur","2527757":"Automatic Facial Action Analysis","264142227":"Robust Pupil Detection using Rank Order Filter and Pixel Difference","265127392":"Lip-Contour based Speaker Activity Detection in Smart Environments","3998227":"Lip tracking for MPEG-4 facial animation","251202774":"AVTOMATSKO ISKANJE ČLOVEŠKIH OBRAZOV NA SLIKAH","8254034":"Fast and Reliable Active Appearance Model Search for 3-D Face Tracking","229062536":"3D face recognition using 2DPCA","3887627":"Large vocabulary audio-visual speech recognition using active shape models","3193347":"Extraction of visual features for lipreading","277283508":"To my parents, Geoff and Libby.","282950379":"Robust and fast teat detection and tracking in low-resolution videos for automatic milking devices","3883532":"Synthesized virtual view-based eigenspace for face recognition","223461225":"Deformable template models: A review","3906049":"Region segmentation via deformable model-guided split and merge","2351641":"Statistical Models of Appearance for Medical Image Analysis and Computer Vision","2527770":"Active System To Generate Views Of Facial Features With Selectable Resolution","229334932":"Anatomical Modeling with Fuzzy Implicit Surface Templates: Application to Automated Localization of the Heart and Lungs in Thoracic MR Volumes","47861914":"3-D Time-Varying Scene Capture Technologies—A Survey","255622525":"A Robust Eye Detection Approach Based on Edge-related Information","3758712":"Head tracking via robust registration in texture map images","3887737":"Efficient object matching using affine-invariant deformable contour","224245535":"Eye-based HCI with Full Specification of Mouse and Keyboard Using Pupil Knowledge in the Gaze Estimation","257627417":"Real-time eye-gaze estimation using a low-resolution webcam. Multimed Tools Appl","220753772":"Eye detection method robust to facial pose changes for eye input device.","233889719":"International Association of Scientific Innovation and Research (IASIR) Feature Extraction Techniques for Face Recognition","228554711":"Variance projection function and its application to eye detection for human face recognition. Pattern Recogn Lett","238732402":"Feature and Module Integration for Image Segmentation","2265705":"Automatic Human Face Detection And Localization","234825652":"An efficient facial expression detection system","275214892":"Face Recognition Using Principal Component Analysis","261461465":"Component based scale and pose invariant face recognition","242777142":"L\u0027Active Shape Model applicato all\u0027Eye Tracking: analisi di immagini","221622116":"Personalized Facial Animation Based on 3D Model Fitting from Two Orthogonal Face Images.","221304675":"A Robust Active Contour Model for Natural Scene Contour Extraction with Automatic Thresholding.","220604275":"Region-based face detection","4321817":"A Robust Eye Detection and Tracking Technique Using Gabor Filters","234815398":"Active-GNG: Model acquisition and tracking in cluttered backgrounds","224157444":"A novel approach for real time eye state detection in fatigue awareness system","277146334":"Interfaz 3D basado en localización de los ojos mediante visión por computadora","220176196":"Construction of human faces from textual descriptions","220600186":"Efficient Face Candidates Selector for Face Detection","221355885":"Probabilistic Corner Detection for Facial Feature Extraction","222836500":"Hierarchical vibrations for part-based recognition of complex objects","4076131":"Robust lip contour extraction using separability of multi-dimensional distributions","5431820":"A Hierarchical Compositional Model for Face Representation and Sketching","233009027":"Image warping and Bayesian reconstruction with grey-level templates","2875979":"Eye-State Action Unit Detection by Gabor Wavelets","225263373":"Two dimensional discrete statistical shape models construction","253726078":"Common Shape Model and Inter-individual Variations of the Heart using Medial Representation","237562956":"LEARNING AND RECOGNIZING FACES: FROM STILL IMAGES TO VIDEO SEQUENCES","224622343":"Feature extraction of non-stained melanocyte cells","271737430":"A new elliptic contour extraction method for reference hole detection in robotic drilling","27343812":"Knowledge driven facial modelling","221362007":"Pose Estimation, Model Refinement, and Enhanced Visualization Using Video.","223471415":"A non-contact device for tracking gaze in a human computer interface","3193432":"Bidirectional deformable matching with application to handwritten character extraction","266026419":"Algorithm for face detection, adapted for platforms with limited resources","279458498":"Human Shape Variation - An Efficient Implementation using Skeleton","4215340":"Facial feature extraction using a cascade of model-based algorithms","3758676":"Connected vibrations: A modal analysis approach for non-rigid motion tracking","220604235":"Facial expressions in American sign language: Tracking and recognition","222551852":"A modular approach to facial feature segmentation on real sequences","222433074":"A face recognition system based on automatically determined facial fiducial points","3193408":"Recognizing imprecisely localized, partially occluded, andexpression variant faces from a single sample per class","221226847":"Statistical Face Recognition via a k-Means Iterative Algorithm.","277297910":"Recognizing Human FACIAL EXPRESSION","229928901":"Human‐face search and location in a scene by multi‐pyramid architecture for personal identification","29651893":"Enhancing person annotation for personal photo management using content and context based technologies","37435465":"Identification of the optic disk boundary in retinal images using active contours","10912468":"Eye feature extraction for diagnosing the facial phenotype associated with fetal alcohol syndrome","200548742":"Multisensor cooperation of assistance to driving","4092490":"Driver\u0027s eye state detecting method design based on eye geometry feature","268174729":"3D-Rekonstruktion von Objekten aus Fotos am Beispiel von Gesichtern","10582740":"Monitoring of Polyethylene Wear in Nonmetal-Backed Acetubular Cups by Digitized Anteroposterior Pelvic Radiography","277297919":"Deformable Models","288932673":"A Comparative Study of Multiple Object Detection Using Haar-Like Feature Selection and Local Binary Patterns in Several Platforms","220100455":"Segmentation, Registration and Measurement of Shape Variation via Image Object Shape.","3637834":"Competitive mixture of deformable models for pattern classification","263636424":"Remote Control through Tracking of Pupil on Mobile Device","3758662":"Object detection and localization by dynamic template warping","250858611":"FACIAL EXPRESSION DETECTION AND RECOGNITION SYSTEM","251905411":"A Novel Two-Step-Deformation Active Contour with Application to Facial Features Extraction","235363461":"ASPICO:Advanced Scientific Portal for International Cooperation on Digital Cultural Content","285674372":"3D Face Recognition Based On Extracting PCA Methods","239207622":"Recognizing Human Motion Using Parameterized Models of Optical Flow","232626009":"Eye Location Based on Gray Projection","48416869":"Tutorial: Introduction to Emotion Recognition for Digital Images","220602287":"A robust eye detection method using combined binary edge and intensity information","4022967":"Object-specific figure-ground segregation","4082356":"Face localization via hierarchical CONDENSATION with Fisher boosting feature selection","264611157":"Driver Drowsiness Detection Based on Multisource Information","221292450":"Eye localization through multiscale sparse dictionaries","220585905":"A multi-view face recognition system","224194502":"Mouth open or closed decision for frontal face images with given eye locations","3758759":"Using adaptive tracking to classify and monitor activities in site","248857674":"An Image Analysis Based Full-Embedded System forOptical Metrology","266653051":"Automatic assessment of facial expressions using fiducial points","267871570":"Human Emotion Recognition and Classification from Digital Colour Images Using Fuzzy and PCA Approach","266863949":"A study of data-driven and model-driven image segmentation techniques","261334325":"Estimation of lip opening for scaling of vocal tract area function for speech training aids","228974338":"Multi-scale analysis techniques in pattern recognition systems","2747008":"Finding Initial Estimates of Human Face Location","2886277":"Active Appearance Models: Theory and Cases","222470121":"The Use of Active Shape Models For Locating Structures in Medical Images","2312847":"Shape-based Tracking and Analysis of the Aorta in Cardiac MR Images Using Geometrically Deformable Templates","221304734":"Tracking Moving Contours Using Energy-Minimizing Elastic Contour Models.","4205296":"Face recognition using wavelet transform, fast Fourier transform and discrete cosine transform","251968948":"Eye location method based on Haar features","12606065":"Incorporating a statistically based shape model into a system for computer-assisted anterior cruciate ligament surgery","225335260":"Classification of face images using local iterated function systems","221472640":"Real-Time Facial Feature Extraction by Cascaded Parameter Prediction and Image Optimization","4004489":"Appearance-based Eye Gaze Estimation","221110168":"Evaluating Information Contributions of Bottom-up and Top-down Processes","220659603":"A framework for spatiotemporal control in the tracking of visual contours. Int J Comput Vis","3836559":"Monitoring driver fatigue using facial analysis techniques","277283377":"Modeling Child Development using a Game Theoretic Approach and Genetic Algorithm Cluster Analysis with Dynamically Restructuring Self-Organizing Maps","257627629":"Linear principal transformation: toward locating features in N-dimensional image space","223778785":"On improving eye feature extraction using deformable templates","221026197":"Interleaving Object Categorization and Segmentation.","237577360":"The Institute For Research In Cognitive Science Final Report to NSF of the Standards for Facial Animation Workshop","221304714":"A Generative Shape Regularization Model for Robust Face Alignment","221292427":"Recognizing Lower Face Action Units for Facial Expression Analysis.","228603675":"Human face recognition using PCA on wavelet subband","221337484":"Automatic Iris Segmentation Using Active Near Infra Red Lighting","215721573":"Interleaved Object Categorization and Segmentation","259714490":"Discriminative learning of deformable contour models","2257634":"Towards an Automatic Human Face Localization System","2462437":"Tracking Facial Features in Video Sequences Using a Deformable Model-Based Approach","257519001":"Infrared point target detection with improved template matching","228781923":"Submission to VLSM Special issue Fast Constrained Surface Extraction by Minimal Paths","3672825":"Joint audio-video processing for multimedia","28638071":"Anatomical models in cardiovascular image analysis","266288411":"Face Recognition A Single View Based HMM Approach","220930030":"2D Cascaded AdaBoost for Eye Localization","222490503":"Generalized likelihood ratio-based face detection and extraction of mouth features","239422592":"Finding the Discrepancy of MRI Images Using the Second Moment and Geometric Comparison Techniques","239422594":"Object Feature Extraction by Using the Searching Temporal and Feature Salient Technique","41910455":"Ricci Flow for 3D Shape Analysis","221364216":"A Framework for Recognizing a Facial Image from a Police Sketch.","224331669":"Multi features Active Shape Models for lip contours detection","256822661":"A local region based approach to lip tracking","220809189":"Comparison of Different Combination Strategies for Face Localization.","251938248":"Some Experiments On Face Recognition With Neural Networks","233623357":"Nonrigid Motion Analysis: Articulated and Elastic Motion","8055470":"Anatomical statistical models and their role in feature extraction. Br J Radiol 77:S133-S139","228962162":"A refined particle filter method for contour tracking","262391161":"Robust Face Landmark Estimation under Occlusion","266024193":"Visual Words for Automatic Lip-Reading","3834597":"Facial Feature Tracking for Eye-Head Controlled Human Computer Interface","4246177":"Composite Templates for Cloth Modeling and Sketching","228702016":"Vision-based force sensing at nanonewton scales","221304790":"Recognition of Human Facial Expressions Without Feature Extraction.","223252391":"Face segmentation and tracking based on connected operators and partition projection","220587983":"A Robust and Accurate Calibration Method by Computer Vision Techniques for Coordinate Transformation between Display Screens and Their Images.","223238052":"Automated study of ocular thermal images: Comprehensive analysis of corneal health with different age group subjects and validation","220598221":"3-D Time-Varying Scene Capture Technologies - A Survey.","222502829":"Age Classification from Facial Images","2931420":"Recognition of Geons byParametric","3193536":"Effective tracking through tree-search","221630405":"Face Recognition Using Interpolated Bezier Curve Based Representation","3963597":"Color-space analysis for facial feature detection","37451970":"Information theoretic combination of classifiers with application to face detection","222408635":"Iris detection using intensity and edge information","27607902":"Coopération entre processus guidés par les données et par les modèles pour la segmentation","221362127":"Partially Occluded Object-Specific Segmentation in View-Based Recognition.","267996408":"CT-Densitometry A structure-based quantitative analysis of lung-CT in emphysema","221210158":"Combinational Method for Face Recognition: Wavelet, PCA and ANN","245034393":"A Random Walk through Eigenspace","223624786":"Detecting eye blink states by tracking iris and eyelids. Pattern Recognit Lett","4301638":"A Hybrid Graph Model for Unsupervised Object Segmentation","3480380":"Matching radar and satellite images for ship trajectory estimation using the Hausdorff distance","4137776":"A novel pupil localization method based on GaborEye model and radial symmetry operator","3308349":"Video object tracking with a sequential hierarchy of template deformations","225177188":"Experimental Evaluation of Eye Location Accuracies and Time-Lapse Effects on Face Recognition Systems","239732058":"An FPGA-based Parallel Hardware Architecture for Real-time Eye Detection","221052476":"Gravity-Center Template Based Human Face Feature Detection","220778041":"ICA Based on KPCA and Hierarchical RBF Network for Face Recognition","264141996":"Robust Pupil Detection using Rank Order Filter and Cross-Correlation","251436522":"Automatic Detecting Neutral Face for Face Authentication and Facial Expression Analysis","220728895":"Hierarchical Vibrations: A Structural Decomposition Approach for Image Analysis","3302187":"Human expression recognition from motion using radial basis function network architecture. IEEE Trans Neural Netw","220728882":"Deformable Templates for Tracking and Analysis of Intravascular Ultrasound Sequences.","239551836":"Cardboard People: A Parameterized Model of Articulated I","237415739":"Eye Detection Using Morphological and Color Image Processing","265934023":"APPLICATIONS OF VARIATIONAL PARTIAL DIFFERENTIAL EQUATION MODELS IN MEDICAL IMAGE PROCESSING","47870458":"Efficient algorithms for human face modeling","221621781":"A Face Recognition System Based on Local Feature Characterization","232634108":"Estimation of the Mouth Features Using Deformable Template Matching","220728846":"A Pupil Localization Algorithm Based on Adaptive Gabor Filtering and Negative Radial Symmetry","2792205":"Deformable Contours: Modeling, Extraction, Detection And Classification","221052420":"Lip Tracking for MPEG-4 Facial Animation.","253600821":"Multistage feature extraction for accurate face alignment","4207465":"Detecting and Tracking Eyes Through Dynamic Terrain Feature Matching","249849293":"A face recognition algorithm based on multiple individual discriminative models","277289900":"D.3.5 A System Capable of Robustly Categorizing the Objects from the Database in a Real-World Environment","3640091":"Deformable models in medical image analysis","242421059":"Age classification form facial images","3668742":"Optimal supports for image matching","252015668":"Segmentation of proximal femur in digital radiographic image using principal component model","3922697":"Interactive digital mirror","244454816":"Audio-Visual Automatic Speech Recognition: An Overview","222692979":"Applying deformable templates for cell image segmentation. Pattern Recognit","220745232":"An Energy Minimization Process for Extracting Eye Feature Based on Deformable Template","220696093":"Recognition of Humans and Their Activities Using Video","220728852":"A New Implicit Method for Surface Segmentation by Minimal Paths in 3D Images","27411102":"The Bi-elliptical deformable contour and its application to automated tongue segmentation in Chinese medicine","221052433":"Detecting Facial Features on Images with Multiple Faces.","27529883":"Filtering for Closed Curves","221509234":"Real-Time Facial Patterns Mining and Emotion Tracking","216360871":"Localising Facial Features with Matched Filters","2892655":"A 3D Model Search Engine","227077836":"An information theory perspective on computational vision","4109179":"Fuzzy and ISODATA classification of face contours","4215559":"Large Motion Object Tracking using Active Contour Combined Active Appearance Model","255663226":"ESTIMATION DE LA CINETIQUE DE L\u0027ŒIL","2376556":"Large Vocabulary Audio-Visual Speech Recognition Using Active Shape Models","222656015":"On internal representations in face recognition systems","3974007":"Reliable and fast eye finding in close-up images","220671595":"An active contour model with shape regulation scheme","50946117":"Novel Bound Setting Algorithm for Occluded Region Reconstruction for Reducing the Inpainting Complexity under Extreme Conditions","4156271":"MosaicShape: Stochastic region grouping with shape prior","277887938":"A Novel Technique for Face Recognition and Retrieval Using Fiducial Point Features","227018459":"Detection of glasses in facial images","258518075":"Image-Based plant phenotyping with incremental learning and active contours","225121855":"Improvement of Gaze Estimation Robustness Using Pupil Knowledge","238124390":"A Generic System for Image Interpretation Using Flexible Templates","220849777":"Principal Component Analysis for Gesture Recognition Using SystemC.","235013466":"Real Time Eye Tracking and Hand Tracking Using Regular Video Cameras for Human Computer Interaction","279458801":"Occlusion Coherence: Detecting and Localizing Occluded Faces","3765091":"Eye tracking and animation for MPEG-4 coding","3720035":"Estimation of the mouth features using deformable templates","3765090":"Model-based multi-stage compression of human face images","3308370":"Automatic 3-D face model adaptation for model-based coding of videophone sequences","3193684":"Vision-Based Force Measurement","35942721":"An integrated framework enhanced with appearance model for facial motion modeling, analysis and synthesis /","3830610":"Face detection and its applications in intelligent and focused image retrieval","265350329":"Gesture-based Representations of Speech: Acquiring and Analysing Resources for Audio-visual Processing","220464724":"A machine-vision system for iris recognition","3765065":"Towards Detection of Glasses in Facial Images","37605709":"Learning and Example Selection for Object and Pattern Detection","262153424":"Nested Pictorial Structures","224364078":"The Use of Dynamic Deformable Templates for Lip Tracking in an Audio-Visual Corpus with Large Variations in Head Pose, Face Illumination and Lip Shapes","276915191":"Driver Eye State Classification Based on Cooccurrence Matrix of Oriented Gradients","26532588":"Audio-Visual Speech Recognition Using MPEG-4 Compliant Visual Features","26532589":"Automatic Speechreading with Applications to Human-Computer Interfaces","3513167":"Face recognition based on depth and curvature features","246298069":"Generalized Deformable Models, Statistical Physics, and Matching Problems","2646869":"The Mug-Shot Search Problem - A Study of the Eigenface Metric, Search Strategies, and Interfaces in a System for Searching Facial Image Data","3693382":"Hierarchical filtering scheme for the detection of facial keypoints","268004473":"Statistical Face Recognition and Intruder Detection Via a k-means Iterative Algorithm: a Resampling Approach","274717663":"Emotional Facial Expression and Tears Simulation: An Analysis \u0026 Comparison of Current Approaches","271967156":"Combination of CT Scan and Radioimmunoscintigraphy in Diagnosis and Prognosis of Colorectal Cancer","2460577":"Modeling Bayesian Estimation for Deformable Contours","224622309":"An improved eye feature extraction algorithm based on deformable templates","239930827":"Associative-Memory-Based Human Face Detection","3957690":"Eye feature extraction for fetal alcohol syndrome screening","241257958":"Towards Face Unlock: On the Difficulty of Reliably Detecting Faces on Mobile Phones","275330016":"Emotion Recognition-A Selected Review","221048480":"Shape Recognition of the Embryo Cell Using Deformable Template for Micromanipulation","222693067":"Gaze determination via images of irises","3765175":"Connected vibrations method for non-rigid motion tracking","267574397":"Extraction of Pose Invariant Feature","220745401":"Muscle-Based Feature Models for Analyzing Facial Expressions.","222826202":"Distinctive and compact features","267230329":"Reconstruction, Registration, and Modeling of Deformable Object Shapes","3765165":"Recognition of facial expressions using muscle-based feature models, (in Japanese)","3326887":"Image segmentation via adaptive K-mean clustering and knowledge-based morphological operations with biomedical applications","30513735":"Reconnaissance de la Langue Française Parlée Complété (LPC) : décodage phonétique des gestes main-lèvres.","2984885":"Model-Based Image Coding: Advanced Video Coding Techniques for Very Low Bit-Rate Applications","2839479":"Geometry and Photometry in 3D Visual Recognition","234829407":"A Study on Iris Localization and Recognition on Mobile Phones","51855542":"Learning Hybrid Image Templates (HIT) by Information Projection","234825309":"MDS: a multimodal-based dialog system","44261632":"Convolutional Neural Networks for Eye Detection in Remote Gaze Estimation Systems","256822506":"Reliable detection of eye features and eyes in color facial images using ternary eye-verifier","281670508":"A Dual Fast and Slow Feature Interaction in Biologically Inspired Visual Recognition of Human Action","2503553":"Active Shape Models - Smart Snakes","2567052":"Medical Applications Of Virtual Reality","2413450":"Learning Structure and Deformation Modes of Nonrigid Objects in Long Image Sequences","257142013":"Robust Eye Feature Extraction from Facial Color Image Using Iris Color Compensation","227264036":"Tracking a person with pre-recorded image database and a pan, tilt, and zoom camera","221458076":"Video coding of model-based at very low bit rates","222723831":"Face Recognition using a Hybrid Supervised/Unsupervised Neural Network","261760043":"A comparative study of face landmarking techniques","267811911":"Novel Method to Predict Body Weight in Children Based on Age and Morphological Facial Features","220135084":"Pose-invariant face recognition by matching on multi-resolution MRFs linked by supercoupling transform","237299088":"Exploiting Visual Information in Automatic Speech Processing","221292164":"A probabilistic framework for perceptual grouping of features for human face detection","228873745":"Face Recognition System using Artificial Intelligent Techniques based on Hybrid Feature Selection","2870160":"Real-time View-based Face Alignment using Active Wavelet Networks","265198706":"Trainable vision systems for automatic and real-time identification and tracking of human facial expressions and behavior","230692477":"ROBUST EYELID TRACKING FOR FATIGUE DETECTION","220659352":"Constructing Facial Identity Surfaces for Recognition","221458060":"Toward fast feature adaptation and localization for real-time face recognition systems.","267918393":"Semi-supervised Method of Multiple Object Segmentation with a Region Labeling and Flood Fill","222021368":"Encoding and recognition of faces based on the human visual model and DCT","3970047":"Color-based mouth shape tracking for synthesizing realistic facial expressions","3326967":"Automatic facial feature extraction by genetic algorithms","221052649":"Deformation Transformation for Handwritten Chinese Character Shape Correction","254448876":"Invariant Recognition Of Human Faces","279806826":"International Journal of Computer Science and Mobile Computing A Review of Numerous Facial Recognition Techniques in Image Processing","282792732":"Model of Bayesian tangent eye shape for eye capture","2714597":"Graded Learning for Object Detection","228556370":"An hybrid approach to orientation-free liptracking","5462941":"Snakuscules.","257934479":"Visual Speech Recognition","250737953":"A Comparative Study of Active Contour Models for Boundary Detection in Brain Images","2710520":"Matching And Recognition Using Deformable Intensity Surfaces","260174928":"3D face recognition using 2DPCA 3D face recognition using 2DPC","242736544":"1 3-25 Relaxation Algorithm for Detection of Fare Outlirie and Eye Locations","235890130":"Markov Random Field Modeling in Image Analysis","238892512":"A method for eye detection based on SVD transforms","220118723":"Robust facial feature points extraction in color images","216360763":"Recovering facial pose with the EM algorithm","223561356":"Non-linear Point Distribution Modelling using a Multi-layer Perceptron","234927586":"Visual Communications and Image Processing 2003","222721701":"Implicit, view invariant, linear flexible shape modelling","221621980":"A Composite Method to Extract Eye Contour","220427981":"Monocular Model-Based 3D Tracking of Rigid Objects: A Survey","232623667":"Particle Swarms as Video Sequence Inhabitants For Object Tracking in Computer Vision","2362315":"Finding Initial Estimates of Human Face Location","220235471":"Precise Pupil Contour Detection Based on Minimizing the Energy of Pattern and Edge.","221271745":"Objektivierung der Beurteilung von Gesichtsasymmetrien durch Bildanalyse.","4207538":"Improved Likelihood Function in Particle-based IR Eye Tracking","222467761":"Determining the similarity of deformable shapes. Vision Research, Vol. 38","222541493":"Face recognition using holistic Fourier invariant features","221304520":"Segmenting Highly Articulated Video Objects with Weak-Prior Random Forests","261387373":"A novel energy based filter for cross-blink eye detection","267195415":"Finding and Segmenting Human Faces","242517391":"The Optimal De sign of Interpolating Wavelet Transformation","2984913":"Human and Machine Recognition of Faces: A Survey","268426237":"REAL-TIME HUMAN FACIAL BEHAVIOR UNDERSTANDING FOR HUMAN COMPUTER INTERACTION","3308599":"Face Sketch Recognition","228927904":"Image recognition via deformable templates","237294115":"VISION-BASED FORCE MEASUREMENT FOR MICROMANIPULATION AND MICROROBOTICS","257690453":"Probabilistic models of vision and max-margin methods","215664848":"Principal Component Analysis for Gesture Recognition using SystemC","3935286":"Real-time normalization and feature extraction of 3D face data using curvature characteristics","4045873":"Modeling Elastic Objects with Neural Networks for Vision-Based Force Measurement","36134441":"An Exploration Of The Spectral Histrogram Representation For Face Detection [electronic resource] /","223185219":"Realistic mouth synthesis based on shape appearance dependence mapping","261155743":"Facial feature detection and extraction using symmetry and region-based deformable template matching","225593699":"A Neural Network Approach to Planar-Object Recognition in 3D Space","220119311":"Multi-view based face chin contour extraction","225122681":"Deformable templates for feature extraction from medical images","272092196":"An Experimental Comparison of Face Detection Algorithms","4156459":"Particle filtering for geometric active contours with application to tracking moving and deforming objects","220068105":"Detection of human faces in a compressed domain for video stratification","4138023":"Fast facial feature extraction using a deformable shape model with Haar-wavelet based local texture attributes","221110580":"Deformable Template As Active Basis","221305130":"Object Recognition by Flexible Template Matching using Genetic Algorithms.","240929345":"Automatically Log Off Upon Disappearance of Facial Image","266499071":"FACIAL FEATURE BASED HEAD TRACKING AND POSE ESTIMATION","263521194":"Physically-based active shape models - Theory and Applications","3955747":"Sensing nanonewton level forces by visually tracking structural deformations","242309713":"Audio-Visual Biometrics Low-cost technology that combines recognition of individuals\u0027 faces with voice recognition is now available for low-security applications, but overcoming false rejections remains an unsolved problem","225929559":"Contour Tracking in Clutter: A Subset Approach","3693596":"Audio-visual interaction in multimedia communication","43493042":"Intelligent CCTV via planetary sensor network","222407016":"Facial feature extraction by a cascade of model-based algorithms","221356312":"An Adaptive Deformable Template for Mouth Boundary Modeling.","3560476":"Computing spatio-temporal representations of human faces","3908625":"Nose shape estimation and tracking for model-based coding","2923527":"Part-based Grouping and Recognition: A Model-Guided Approach","221280540":"Feature Extraction from Front and Side Views of Faces for 3D Facial Model Creation.","2462728":"Generation, Estimation And Tracking Of Faces","256822112":"A novel rotation/scale invariant template matching algorithm using weighted adaptive lifting scheme transform","259165021":"Towards pan shot face unlock: Using biometric face information from different perspectives to unlock mobile devices","267037637":"Performance evaluation for face identification algorithm using Z-based specification and empirical analysis","37432842":"Audio visual speech recognition","2405397":"Object Localization Using Linear Adaptive Filters","35499564":"A Trainable System for Object Detection in Images and Video Sequences","222570871":"Projection functions for eye detection. Pattern Recogn","242272837":"A robust algorithm for eye detection on gray intensity face without spectacles","3730445":"Automatic segmentation of training set for facial feature detection","221597966":"Analysis and Encoding of Lip Movements.","2542621":"Detecting Facial Features On Images With Multiple Faces","46286590":"An Adaptive Multimodal Biometric Recognition Algorithm for Face Image using Speech Signal","220061984":"Face Recognition by Using Feature Orientation and Feature Geometry Matching","229896589":"Human face analysis based on distributed two‐dimensional appearance models","252019515":"A Gray Gradient Based Fast Training Algorithm for Face Detection","29799929":"Locating landmarks using templates","222599547":"Detection of human faces in color image sequences with arbitrary motions for very low bit-rate videophone coding","220659992":"A Coupled Minimization Problem for Medical Image Segmentation with Priors","235174468":"Learning Data Driven Representations from Large Collections of Multidimensional Patterns with Minimal Supervision","221956472":"Inter-image outliers and their application to image classification","3308656":"Accurate and Quasi-Automatic Lip Tracking","222435585":"Facial feature extraction using complex dual-tree wavelet transform","220660068":"Simplex Mesh Diffusion Snakes: Integrating 2D and 3D Deformable Models and Statistical Shape Knowledge in a Variational Framework","268411828":"EXTENDING AND APPLYING ACTIVE APPEARANCE MODELS FOR AUTOMATED, HIGH PRECISION SEGMENTATION IN DIFFERENT IMAGE MODALITIES","3699828":"Face and eye location algorithms for visual user interface","15463610":"CT volumetric data-based left ventricle motion estimation: an integrated approach","222398740":"Poseinvariant face recognition using a 3D deformable model. Pattern Recognition, 36, 1835-1846","275539003":"Automatic Eye Detection using Fast Corner Detector of North East Indian (NEI) Face Images","286481732":"Review of object detection methods based on SVM","3560558":"A Hierarchical statistical framework for the segmentation of deformable objects in image sequences","2456701":"Automatic Recognition of Facial Expressions Using Hidden Markov Models and Estimation of Expression Intensity","3568748":"Identification of human faces through texture-based feature recognition and neural network technology","2432127":"Shape Recovery Of Volume Data With Deformable B-Spline Models","3296361":"Visual information management system for the interactive retrieval of faces","225761579":"HandTalker\n: A Multimodal Dialog System Using Sign Language and 3-D Virtual Human","263871461":"FACE AND FACIAL FEATURE TRACKING USING DEFORMABLE MODELS","225646867":"Skin-based Face Detection-Extraction and Recognition of Facial Expressions","264981418":"A method for detecting optokinetic nystagmus based on the optic flow of the limbus","2755656":"Automatic Face Recognition using Radial Basis Function Networks","262507462":"MODEL PARAMETERS TUNING USING GA, ON LIP POSTURES RECOGNITION","257671998":"Learning Active Basis Model for Object Detection and Recognition","220660033":"Face Recognition Using the Discrete Cosine Transform","224755970":"Real-time facial feature extraction using statistical shape model and Haar-wavelet based feature search","263750608":"Feature-based human face detection","224114994":"Inner and outer lip contour tracking using cubic curve parametric models","2524236":"Vectorizing Face Images by Interleaving Shape and Texture Computations","4072533":"Robust eye extraction using deformable template and feature tracking ability","34172517":"Layered deformotion with radiance [electronic resource] : a model for appearance, segmentation, registration, and tracking /","224321843":"Vision-based eye blink monitoring system for human-computer interfacing","220338508":"Continuous audio-visual digit recognition using","228954570":"Face components extraction via image segmentation","3886164":"Individual 3D face synthesis based on orthogonal photos and speech-driven facial animation","224712971":"Speech and Face Biometric for Person Authentication","250718851":"Model-based image processing to locate pigs within images","3699788":"Lip parameters extraction based on projection of raw images ontoreference shapes","228800982":"Iris tracking and blink detection for human-computer interaction using a low resolution webcam","5469220":"Adaptive feature-specific imaging: A face recognition example","46288565":"Features versus Context: An Approach for Precise and Detailed Detection and Delineation of Faces and Facial Features","224649499":"A Novel Eye Location Algorithm based on Radial Symmetry Transform","257334063":"Lip contour segmentation and tracking compliant with lip-reading application constraints","235973225":"An effective eye states detection method based on projection","3644493":"Visual Speech Recognition using Active Shape Models and Hidden Markov Models","220930475":"Robust Eye Detection under Active Infrared Illumination","37650110":"Detecção e Extracção de Características do Olho em Imagens usando um Modelo Protótipo Deformável","265352017":"Visual tracking of hands, faces and facial features as a basis for human-robot communication","220600743":"An efficient 2D deformable objects detection and location algorithm","2919597":"Providing the Basis for Human-Robot-Interaction: A Multi-Modal Attention System for a Mobile Robot","260797192":"Advances in Computational Vision and Medical Image Processing: Methods and Applications","270671012":"On-Road Driver Monitoring System Based on a Solar-Powered In-Vehicle Embedded Platform","265218889":"An automatic Approach for Eye Tracking and Blink Detection in Real Time","257014745":"Biomedical active segmentation guided by edge saliency","280695858":"Partial Matching Face Recognition Method for Rehabilitation Nursing Robots Beds","257014744":"On-line detection of red blood cell shape using deformable templates","238668467":"Face Localization from Discriminative Regions Thesis Proposal","220955040":"Combining Edge Detection and Region Segmentation for Lip Contour Extraction","221110689":"Ricci Flow for 3D Shape Analysis","222681544":"LAFTER: A Real-time Face and Lips Tracker with Facial Expression Recognition","220660138":"A Variational Approach for the Segmentation of the Left Ventricle in Cardiac Image Analysis.","227086616":"An Efficient Genetic Algorithm for Small Search Range Problems and Its Applications","3579044":"An Original Approach for the Localization of Objects in Images","263906089":"FACE LEARNING USING A SEQUENCE OF IMAGES","2520242":"Image Sequence Restoration Using Gibbs Distributions","225880547":"2D-3D Pose Invariant Face Recognition System for Multimedia Applications","243217129":"Range face recognition based on the phase Fourier transform","255607716":"Blink Rate Monitoring for a Driver Awareness System","24163818":"Expectations of Random Sets and Their Boundaries Using Oriented Distance Functions","261526282":"PCA-LDA based face recognition system \u0026 results comparison by various classification techniques","3730597":"Some applications of active contours using ANNs isomorphic to boundaries","228917560":"Face model adaptation for tracking and active appearance model training","2243773":"Localized Principal Component Analysis Learning for Face Feature Extraction and Recognition","221434258":"Contour Extraction of Facial Feature Components Using Template Based Snake Algorithm.","222495202":"Region-based template deformation and masking for eye-feature extraction and description","221991322":"An analytic solution for the pose determination of human faces from a monocular image","3208339":"Automatic Creation of 3D Facial Models","261342011":"Extension of the MPEG-7 Fourier Feature Descriptor for face recognition using PCA","34559654":"Computing spatio-temporal representations of human faces /","228749580":"MPEG-4 compliant tracking of facial features in video sequences","3835018":"Face detection in complex environments from color images","278660142":"The Role of Shape in Visual Recognition","3816590":"A subset approach to contour tracking in clutter","4035721":"Virtual gaze redirection in face images","2350228":"Information Theory and Face Detection","224074220":"Facial feature extraction and image warping using PCA based statistic model","273929450":"Malignant Brain Tumor Detection","4035716":"A feature-based face recognition system","265567082":"Adaptive Boosting of Support Vector Machine Component Classifiers Applied in Face Detection","220463514":"A proposal of improved lip contour extraction method using deformable template matching and its application to dental treatment","242369201":"INVITED SURVEY PAPER Surveys on Image Processing Technologies-Algorithms, Sensors and Applications Optimization Approaches in Computer Vision and Image Processing","225153455":"A comparison of face and facial feature detectors based on the Viola–Jones general object detection framework","37394162":"Eye Detection Using Wavelets and ANN","224375190":"Semantic Feature Extraction for Accurate Eye Corner Detection","2352362":"Cardboard People: A Parameterized Model of Articulated Image Motion","268395316":"Real Time Face Recognition","225894842":"Intelligent CCTV via Planetary Sensor Network","268526796":"Novel automatic eye detection and tracking algorithm","220463593":"Facial feature point extraction method based on combination of shape extraction and pattern matching","224211346":"Using salient region constraints on Active Appearance Model initialization for facial feature extraction","264014707":"Face Detection Using Adaboost and Template Matching of Depth Map based Block Rank Patterns","2301169":"Automatic Speech Recognition System Using Acoustic and Visual Signals","224649653":"A hybrid classifier for precise and robust eye detection","227025232":"Coarse-to-Fine Face Detection","221204982":"3D Facial Pose Tracking in Uncalibrated Videos","2743541":"Object and Pattern Detection in Video Sequences","36452081":"Visual tracking for multimodal human computer interaction","224201149":"Statistics of local surface curvatures for mis-localized iris detection","3835098":"Technologies for building networked collaborative environments","3816667":"Modeling Bayesian estimation for deformable contours","267690775":"IMAGE-BASED FACE RECOGNITION UNDER VARYING POSE AND ILLUMINATION CONDITIONS","227176812":"A Robust Eye Tracking Procedure for Medical and Industrial Applications","225128835":"Detection of Facial Features","8250518":"Image processing for craniofacial landmark identification and measurement: A review of photogrammetry and cephalometry","3878096":"Automatic eye detection using intensity and edge information","2923712":"Robust and Accurate Eye Contour Extraction","220660171":"Prior Knowledge, Level Set Representations \u0026 Visual Grouping","238865107":"Image search using trained flexible shape models","237535960":"Detection and Recognition of Human Faces using Random Forests for a Mobile Robot","271824067":"Design of a Brazilian Portuguese Virtual Keyboard for People with Severe Motor Disability","258651035":"Biometric Authentication with Face Recognition using Principal Component Analysis and Feature based Technique","263867208":"Adaptive classifier integration for invariant face recognition (ACIIFR)","220361175":"Multiple elastic modules for visual pattern recognition","26541409":"Speech-Driven Mouth Animation Based on Support Vector Regression","241402527":"Application of morphology to feature extraction for face recognition","3421384":"Complex character decomposition using deformable model","266169122":"Non-Ideal Iris Recognition","223377839":"Statistical Models of Face Images - Improving Specificity","238687032":"Eye Detection Using Support","225824886":"Recognition of Visual Speech Elements Using Hidden Markov Models","252123651":"Physics of Automatic Target Recognition","221433908":"On the Face Detection with Adaptive Template Matching and Cascaded Object Detection for Ubiquitous Computing Environment.","221280311":"Combining model-based classifiers for face localization.","2665761":"Recovery of Generic Solid Parts by Parametrically Deformable Aspects","3618108":"Matching and recognition using deformable intensity surfaces","3618107":"Robust and accurate image segmentation using deformable templatesin scale space","222648393":"AI-EigenSnake: An affine-invariant deformable contour model for object matching","222531663":"Knowledge modelling for the motion detection task: The algorithmic lateral inhibition method","221356092":"A New Methodology to Automatically Segment Biomedical Images.","220160017":"Adaptive Appearance Based Face Recognition","263791275":"A parameter-based combined classifier for invariant facial expression and gender recognition","2438454":"Color Region Grouping and Shape Recognition with Deformable Models","277167504":"Speaker-specific articulatory assessment and measurements during Portuguese speech production based on Magnetic Resonance Images","222193707":"A hierarchical deformation model for on-line cursive script recognition","224331846":"A new eye location method based on Ring Gabor Filter","3611949":"Training a general purpose deformable template","257307213":"Human Identification by Vascular Pattern","3611946":"Model-based versus knowledge-guided representation of non-rigid objects: a case study","241625979":"A hardware/software co-design model for face recognition using Cognimem Neural Network chip","221597716":"Robust Eye Centre Extraction Using the Hough Transform.","37439256":"Face Pose Estimation using a Tree of Boosted Classifiers","4003097":"Eye detection based on grayscale morphology","3663122":"A real-time, parallel face recognition on task-level pipelined multicomputer","7755091":"Face recognition by using feature-specific imaging","244433849":"Learning Shape: Optimal Models for Analysing Natural Variability","220657678":"Swarm contours: A fast self-organization approach for snake initialization","242176836":"Extraction of rectangular buildings in aerial images","224057462":"Image Segmentation using Salient Points-Based Object Templates","228960393":"3D modelling and recognition","3618075":"Segmentation, grouping and feature detection for face imageanalysis","3802390":"Knowledge-embedded symmetry transform for accurate eyeball location","2813190":"Optical Flow Constraints on Deformable Models with Applications to Face Tracking","2563338":"Object-specific figure-ground segregation. In CVPR’03","221597720":"A Face Recognition System Based on Local Feature Analysis","3618073":"Vehicle segmentation using deformable templates","2985219":"Iris recognition: An emerging biometrie technology","259224157":"Directional symmetry transform for human face location","230553747":"Self-organizing neural networks based on spatial isomorphism for active contour modeling","4003084":"Eye extraction using spatial fuzzy clustering method","264073868":"An Improved Normalization Method for Haar-like Features for Real-time Object Detection","267399874":"國立台灣科技大學 電 子 工 程 系 碩士學位論文 運用眼鏡鏡框區塊之即時眼睛追蹤與狀態偵測 Real-Time Eye Tracking and State Detection Based on Eyeglasses Frame Blocks 廖啟宏 M9502207 指導教授：賴坤財 博士","11758977":"SignStream: A tool for linguistic and computer vision research on visual-gestural language data","237230869":"Segmentation of complex buildings from aerial images and DEM","3192071":"Boundary Finding with Parametrically Deformable Models.","220346389":"Application of an Improved Mean Shift Algorithm in Real-time Facial Expression Recognition","3802370":"Method of deformable optimum threshold for lipreading","2370846":"Face Recognition from Frontal and Profile Views","253950494":"An Accurate Eye Detection Method Using Elliptical Separability Filter and Combined Features","221597704":"A Viseme-based Approach to Labiometrics for Automatic Lipreading.","262273695":"Comparison of Eyes Characteristics in Different Color Spaces","263877253":"ROSE CURVE MODEL AND AN ANALYTICAL SOLUTION FOR ESTIMATING ITS PARAMETERS","221315185":"Boosting particle filter-based eye tracker performance through adapted likelihood function to reflexions and light changes","220135518":"Tracking Deformable Templates Using a Shortest Path Algorithm","255568511":"Malignant Brain Tumor Detection","3845503":"Real-time multiple face detection using active illumination","2446700":"Multi-State Based Facial Feature Tracking and Detection","220862561":"Multimedia Database Management: Perspectives and Challenges.","261169882":"Head Movement Recognition Based on Lucas-Kanade Algorithm","239436567":"Audio-visual Speech Processing","37990167":"Interactive-Time Vision: Face Recognition as a Visual Behavior","252930628":"Understanding Leaves in Natural Images - A Model-Based Approach for Tree Species Identification","257352205":"Feature local binary patterns with application to eye detection","7771434":"Face Detection Using Spectral Histograms and SVMs","241171260":"Learning prototypical shapes for object categories","30758070":"Remote surveillance and face tracking with mobile phones (smart eyes).","3192149":"Analysis and synthesis of facial image sequences using physical and anatomical models. IEEE Trans Pattern Anal Mach Intell","239147817":"Tracking Non-Rigid Objects Using Functional Distance Metric","220913730":"Multi features hybrid Active Shape Model for automated lip contours tracking in video sequence","10591688":"Discriminant snakes for 3D reconstruction of anatomical organs","3820881":"Self-training statistic snake for image segmentation and tracking","220600397":"A hierarchical multiscale and multiangle system for human face detection in a complex background using gravity-center template","7109916":"A faster converging snake algorithm to locate object boundaries","221597765":"Video Compression and Person Authentication.","222545971":"Unsupervised and adaptive Gaussian skin-color model","3886410":"A system for the automatic extraction of 3-D facial feature points for face model calibration","226123784":"Creating and Animating Personalized Head Models from Digital Photographs and Video","234778764":"A simple approach to facial expression recognition","3513665":"Computer operation via face orientation","221610048":"A Simple and Novel Method for Skin Detection and Face Locating and Tracking","221565004":"Face Recognition Using Multi-feature and Radial Basis Function Network.","222429241":"Image Understanding for Iris Biometrics: A Survey","220600413":"A method of detecting and tracking irises and eyelids in video","220465240":"The background primal sketch: An approach for tracking moving objects","252375668":"Research of adaptive threshold model and its application in iris tracking","241191711":"Automatic extraction of eye field from a gray intensity image using intensity filtering and hybrid projection function","2801070":"Robust Lip Tracking by Combining Shape, Color and Motion","220659873":"A Deformable Object Tracking Algorithm Based on the Boundary Element Method that is Robust to Occlusions and Spurious Edges","221364408":"Representation Of Objects In A Volumetric Frequency Domain With Application To Face Recognition.","3730866":"Human face image coding using deformable templates, wavelet decomposition and VQ","221546686":"Blending Textured Images using a Multiscale MRF Method","220905637":"Design of an Immersive Teleconferencing Application.","224393423":"Classification of Polar-Thermal Eigenfaces using Multilayer Perceptron for Human Face Recognition","267229823":"DEVELOPMENT OF A PERCEPTION ORIENTED TEXTURE-BASED IMAGE RETRIEVAL SYSTEM FORWALLPAPERS","221470884":"SISCHMAX: Discovering common contour patterns","221364392":"Learning-Based Building Outline Detection from Multiple Aerial Images.","251972255":"A new approach for open-close eye states detection: Complex wavelet transform and complex-valued ANN","2579898":"Auxiliary Variables and Two-step Iterative Algorithms in Computer Vision Problems","236694457":"Face Image Conformance to ISO/ICAO standards in Machine Readable Travel Documents","221304978":"Model-Based Head and Facial Motion Tracking","3886494":"Detection of eyes from human faces by Hough transform and separability filter","227307562":"Multi-cue-based face and facial feature detection on video segments","220659840":"A Numerical Study of the Bottom-Up and Top-Down Inference Processes in And-Or Graphs","3820947":"Subpixellic eyes detection","222558441":"On deformable models for visual pattern recognition","223357178":"Real-time facial feature localization by combining space displacement neural networks","260653605":"Driver drowsiness recognition based on computer vision technology","2985344":"Audio-Visual Integration in Multimodal Communication","3845527":"Learning-based approach to real time tracking and analysis of faces","2823558":"Illumination Invariant Face Recognition Using Photometric Stereo","220057776":"Rule-Driven Object Tracking in Clutter and Partial Occlusion with Model-Based Snakes","26512442":"Integrated Detection, Tracking, and Recognition of Faces with Omnivideo Array in Intelligent Environments","2985346":"Face to Virtual Face","228849683":"Automatic Neutral Face Detection Using Location and Shape","3192193":"Finite-element methods for active contour models and ballons for 2-D and 3-D images. IEEE Trans Pattern Anal Mach Intell","2762136":"Locating and Tracking Facial Speech Features","271465885":"Recommending New Links in Social Networks Using Face Recognition","228806678":"3D face recognition based on high-resolution 3D face modeling from frontal and profile views","37650312":"Segmentação de Faces em Imagens baseada na Detecção de Pele e dos Olhos","221304966":"Model-Based Initialisation for Segmentation","222449914":"Determining the gaze of faces in images","251914939":"Learning Hybrid Template by EM-Type Algorithm","277298494":"DETECTION OF FEMUR FRACTURES IN X-RAY IMAGES","220659870":"Analysis of Two-Dimensional Non-Rigid Shapes","221110423":"A Symmetry-Based Generative Model for Shape","3321224":"Audio-visual interaction in multimodal communication","222230660":"Pose determination of human faces by using vanishing points","4095364":"Facial gesture recognition for interactive applications","8025536":"Segmentation of fetal ultrasound images","37650309":"Detecção de Faces em Imagens baseada na Identificação da Pele e dos Olhos","239561721":"Ein integriertes strukturell-morphologisches Modell zur Erkennung des Heschl\u0027schen Gyrus in planaren Kortexkarten","222306558":"Facial feature localization and adaptation of a generic face model for model-based coding","223842536":"Autonomous agents for edge detection and continuity perception on otolith images","3507700":"Classification of facial features for recognition","26864728":"Adaptive feature-specific imaging for recognition of non-Gaussian classes","221337843":"Eyes and Eyebrows Detection for Performance Driven Animation","222130431":"Deformable model-guided region split and merge of image regions","3503600":"Automated bone density calculation using feature extraction by deformable templates","221159656":"Guiding Active Contours for Tree Leaf Segmentation and Identification","2121196":"Hierarchical testing designs for pattern recognition","2444788":"Training Models of Shape from Sets of Examples","242607022":"REAL-TIME DETECTION AND TRACKING OF HUMAN EYES IN VIDEO","3188203":"An efficient distributed deadlock avoidance algorithm for the ANDmodel","3513833":"A hierarchical deformation model for online cursive script recognition","228853880":"Automatic scalable face model design for 2D model-based video coding","236694470":"A multi-classifier approach to face image segmentation for travel documents","4365724":"Efficient Eye States Detection in Real-Time for Drowsy Driving Monitoring System","261505655":"Human eye detection of color images based on morphological segmentation using modified Harris corner detector","222556326":"Photo-realistic facial expression synthesis","225761427":"Facial expression recognition of a speaker using vowel judgment and thermal image processing","252269281":"Face recognition in complex backgrounds","245472072":"Manufacture Automation: Model and Object Recognition by Using Object Position Auto Locating Algorithm and Object Comparison Model","224725132":"A skeleton based shape matching \u0026 recovery approach","2696646":"A Unified Framework for Handwritten Character Recognition using Deformable Models","2731481":"Towards A Real-Time Model Based Coding System","259824270":"An Identification System Using Eye Detection Based On Wavelets And Neural Networks","224344237":"Research of Face Location System Based on Human Vision Simulations","264153677":"Robust Face and Facial Feature Tracking in Image Sequences","269303294":"Ship positioning by matching radar images and map data","2747870":"Automatic Face Identification","261393005":"Deformable contours: modeling and extraction","2651602":"Off-line Cursive Handwriting Recognition using Recurrent Neural Networks","255587015":"Image Interpretation using Bottom-up Top-down Cycle on Fragment Trees","250856206":"Facial Dynamics for Identity Recognition PhD Thesis Proposal","275660177":"Eye Localization using PCA Based Genetic Search","221485878":"An hybrid image processing approach to liptracking independent of head orientation.","216722159":"An Analytic-to-Holistic Approach for Face Recognition Based on a Single Frontal View","29603780":"From Raw Images of the Lips to Articulatory Parameters : A Viseme-based Prediction","5635677":"Model-based deformable surface finding for medical images. IEEE Trans Med Imaging","2391596":"Automatic Recognition of Facial Expressions and Human Emotions","4027959":"Facial feature tracking combining model-based and model-free method","257296733":"Identification of geometrical properties of red blood cells from light scattering images using SVD","265890261":"Generating a Mapping Function from one Expression to another using a Statistical Model of Facial Shape","51887386":"Learning Active Basis Models by EM-Type Algorithms","232633299":"The Application of Facial Characteristics Extraction in the Intelligent Network Teaching System","280385191":"A Review of Numerous Facial Recognition Techniques in Image Processing","228957110":"DICTA2002: Digital Image Computing Techniques and Applications, 21-22 January 2002, Melbourne, Australia Robust Lip Tracking with Improved Active …","3763756":"Face recognition in a heterogeneous population","3943977":"Parameter analysis and synthesis for MPEG4 facial animation","220928828":"Learning Image Anchor Templates for Document Classification and Data Extraction","2360895":"Feature-Based Human Face Detection","3876391":"Facial features for identification","238729252":"A novel approach to solve drowsy driver problem by using eye-localization technique using CHT","224691066":"Robust tracking of stochastic deformable models in long image sequences","221127473":"Automatic contour estimation in fetal ultrasound images","268014041":"A Fast and Effective Algorithm for Image Co-segmentation","280592025":"Classification of Medical Image Modeling Methods: A Review","224359293":"Eye states detection by boosting Local Binary Pattern Histogram features","224068478":"Classifying range images of human faces with Hausdorff distance","229475208":"Unification scheme for 3D surface reconstruction using physically based models","229000064":"An And-Or Graph Model for Face Representation, Sketching and Aging","4232807":"Face Alignment with Unified Subspace Optimization of Active Statistical Models","239929445":"Detection of diabetic retinopathy lesions in color retinal images","2319881":"The Graphical Specification of Similarity Queries","221567774":"Recognizing Expressions by Direct Estimation of the Parameters of a Pixel Morphable Model","221111040":"Deformable Model-Based Shape and Motion Analysis from Images using Motion Residual Error.","220781318":"A Robust and Efficient Algorithm for Eye Detection on Gray Intensity Face","3321346":"Audiovisual speech processing","262357395":"Lipreading procedure for liveness verification in video authentication systems","272832118":"Face detection and facial feature extraction based on a fusion of knowledge based method and morphological image processing","3114521":"Controlling a Computer via Facial Aspect","224674642":"Age Classification using Fuzzy Lattice Neural Network","263547273":"Subjective Age Prediction of Face Images Using PCA","238749703":"Human Face Detection and Segmentation using Eigenvalues of Covariance Matrix, Hough Transform and Raster Scan Algorithms","224068454":"Robust extraction of eyes from face","237244443":"THIS PAGE IS NOT PART OF THE THESIS, BUT SHOULD BE TURNED IN TO THE PROOFREADER","224392032":"Multi Features Models for Robust Lip Tracking","223189775":"An improved likelihood model for eye tracking","4015737":"A hybrid approach to designing an autonomous driving alert system using geometrical features and gray level information of face images","235114564":"Graphical Shape Templates for Deformable Model Registration with Applications to MRI Brain Scans","3669630":"Face and facial feature extraction from color image","24393535":"Robust real time eye tracking for computer interface for disabled people","2836070":"Computational Models of Perceptual Organization","259633462":"A refined particle filter based on determined level set model for robust contour tracking","242522148":"Human Face Detection Using Genetic Algorithm","37649516":"Imagens de Faces: Exemplos de Metodologias e Aplicações","3669605":"Deformable model-based face shape and motion estimation","260880862":"Three dimensional tracking of Human eye","3669601":"Speechreading: an overview of image processing, feature extraction, sensory integration and pattern recognition techniques","220586866":"Automatic Facial Feature Extraction in Model-Based Coding.","3675746":"A real-time face tracker","237318270":"Eye-contour Extraction Method Based on Transform Projection","3683939":"Using grey-level models to improve active shape model search","3839585":"Application of associative memory in human face detection","2647668":"Connected Vibrations: A Modal Analysis Approach for Non-rigid Motion Tracking","35976312":"Facial feature extraction using genetic algorithm /","37413978":"Implicit meshes: unifying implicit and explicit surface representations for 3D reconstruction and tracking","221277009":"Facial Feature Extraction Based on Wavelet Transform","220660547":"Recognizing Facial Expressions in Image Sequences Using Local Parameterized Models of Image Motion","4027995":"Face tracking in video with hybrid of Lucas-Kanade and condensation algorithm","224135990":"Robust Facial Feature Tracking using Selected Multi-Resolution Linear Predictors","34776185":"Construction et apprentissage statistique de modèles auto-associatifs non-linéaires : application à l\u0027identification d\u0027objets déformables en radiographie /","3669595":"Cardboard people: a parameterized model of articulated image motion","223324961":"Blink detection for real-time eye tracking","270388851":"Vision-Based Interaction","262271442":"A literature survey on robust and efficient eye localization in real-life scenarios","44260567":"Automatic Adaptive Center of Pupil Detection Using Face Detection and CDF Analysis","224135972":"An efficient algorithm for Co-segmentation","4193862":"Probabilistic contour extraction using hierarchical shape representation","255652163":"Development of a Unified Probabilistic Framework for Segmentation and Recognition of Semi-Rigid Objects in Complex Backgrounds via Deformable Shape Models","3671737":"Detection of eye locations in unconstrained visual images","221363123":"Shape band: A deformable object detection approach","285276035":"Subjective Age Prediction of Face Images Using PCA","28096303":"Possibilities of man-machine interaction through the perception of human gestures","221174696":"A Novel Method for Eye Features Extraction","3671729":"Description of eye figure with small parameters","282807889":"Multiple Image Characterization Techniques for Enhanced Facial Expression Recognition","3612348":"Face segmentation using fuzzy reasoning","242387198":"Extraction des traits caractéristiques du visage à l\u0027aide de modèles paramétriques adaptés Parametric models for facial features segmentation","4038321":"Reliable recovery of piled box-like objects via parabolically deformable superquadrics","2920096":"Lecture Notes in Computer Science","273399495":"Precise localization of eye centers in low resolution color images","239542472":"Embedded face recognition using cascaded structures","3192481":"Vanishing Point Detection by Line Clustering","2557622":"Facial Feature Point Extraction by Partial Least Square Regression","220785594":"Face Recognition Using Parabola Edge Map","224324557":"A Novel Eye Localization Method Based on Spectral Residual Model","221303717":"Hierarchical Shape Modeling for Automatic Face Localization","3839661":"A facial expression recognition system using neural networks","223017949":"Eye synthesis using the eye curve model","238688416":"Coordinating Human-Robot Communication","289658840":"Efficient Focusing and Face Detection","225627119":"A closed-loop algorithm to detect human face using color and reinforcement learning","3948193":"Real-time, fully automatic upper facial feature tracking","224629758":"A fast neural-based eye detection system","280329768":"Active skeleton for bacteria modeling","4163232":"Cooperation of a system of omnidirectional vision and a rangefinder laser for the detection of vehicles on the highway","37649566":"Detecção e Extracção de Características do Olho Humano a partir de um Modelo Protótipo Deformável","232825664":"Automated detection of eye and cornea on infrared thermogram using snake and target tracing function coupled with genetic algorithm","222694375":"A background robust active appearance model using active contour technique","225123273":"Discriminant analysis for recognition of human faces","45927454":"Classification of Log-Polar-Visual Eigenfaces using Multilayer Perceptron","2918031":"Detection of Eye Locations in Unconstrained Visual Images","2459264":"Atlas Guided Segmentation of Brain Images Via Optimizing Neural Networks","224064509":"Automatic lip model extraction for constrained contour-based tracking","241467598":"Use of Fourier Shape Descriptors to identify mid-latitude weather systems","3114628":"Real-Time Eye Feature Tracking from a Video Image Sequence Using Kalman Filter","242491608":"SINTONIZACIÓNDEPARÁMETROSDEMODELOSPOR MEDIODEGA,EN ELRECONOCIMIENTODEPOSTURAS LABIALES MODELPARAMETERSTUNINGUSINGGA,ONLIP POSTURESRECOGNITION","224725961":"Multiple rectangle model for buildings segmentation and 3D scene reconstruction","243134673":"Continuous audio-visual digit recognition using N-best decision fusion","2471569":"Robust Facial Feature Tracking","3669634":"Edge and Keypoint Detection in Facial Regions","226223053":"Object Detection and Localization by Dynamic Template Warping","37649545":"Metodologias para identificação de faces em imagens: Introdução e exemplos de resultados","253432226":"DETECTION DE VEHICULES DANS UN ENVIRONNEMENT AUTOROUTIER A L\u0027AIDE DE DONNEES TELEMETRIQUES ET VISUELLES","220181414":"Deformable Contours: Modeling and Extraction","251734456":"Eyes Based Eletric Wheel Chair Control System - I (eye) can control Electric Wheel Chair -","37649538":"Emparelhamento de Objectos Utilizando Técnicas de Optimização","3669642":"Modelling the variability in face images","37995774":"Learning the dynamics of deformable objects and recursive boundary estimation using curve evolution techniques","27608859":"Extraction des traits caractéristiques du visage à l\u0027aide de modèles paramétriques adaptés","271548048":"Face and facial expression recognition using Extended Locality Preserving Projection","8171186":"Maplets for correspondence-based object recognition","226210728":"Bayesian Estimation of Intra-operative Deformation for Image-Guided Surgery Using 3-D Ultrasound","263883113":"Emotional synchronization-based human-robot communication and its effects","262279542":"Medical computer vision, virtual reality and robotics: promising research tracks","3948267":"Model-based head pose tracking with stereovision","27608957":"Détection de visages sur des images fixes par combinaison de classifieurs discriminants et de modèles","224721853":"Information Fusion System with Wireless Transmission for Monitoring the Status of Driver","228731769":"Localization of facial features and fiducial points","224273281":"On parameter estimation in deformable models","220611527":"Use of active shape models for locating structures in medical images.","3192530":"Vehicle segmentation and classification using deformable templates","2549445":"Using Toboggan-Based Intelligent Scissors For Image And Movie Editing","234169110":"Design and Implementation of Floating Point based System for Pellet Size Distribution using Circular Hough Transform","34991344":"Features for audio-visual speech recognition.","4038362":"Tracking objects using density matching and shape priors","4038357":"Using prior shape and intensity profile in medical image segmentation","260944230":"Fast and Exact: Shape Segmentation Using ADMM and Structured Prediction","2301647":"Tracking Human Faces in Real-Time","2860741":"Model-Based Car Tracking Integrated with a Road-Follower","222180304":"Locating human faces within images","4046546":"Automatic Lesion/Tumor Detection Using Intelligent Mesh-Based Active Contour","221141982":"Human-Computer Interaction Using Emotion Recognition from Facial Expression","3555015":"Physically-based surface modeling using flexible wire frames","10683984":"Statistical models of shape for the analysis of protein spots in two-dimensional electrophoresis gel images","4038350":"Entropy-of-likelihood feature selection for image correspondence","2866911":"Model-based Head Pose Tracking With Stereovision","3192518":"Graphical templates for model registration","252955114":"Recognizing human eyes","3192521":"Object matching using deformable templates","241514649":"The Eigenface Approach to Automated Face Recognition","2698964":"Human Face Segmentation and Identification","4284092":"Automated Lip Contour Detection Using the Level Set Segmentation Method","267258129":"A REAL-TIME HUMAN-COMPUTER INTERFACE BASED ON GAZE DETECTION FROM A LOW-GRADE VIDEO CAMERA","3192625":"Frequency-based Non-rigid Motion Analysis: Application to Four Dimensional Medical Images","223795799":"Object localization using color, texture and shape","2783016":"Norges Teknisk-Naturvitenskapelige Universitet","220611109":"Fitting 3D face models for tracking and active appearance model training. Image Vis Comput","220863008":"LBP-based driver fatigue monitoring system with the adoption of haptic warning scheme","242749811":"Combining model-based classif ier s f or f ace localiz at ion","222532174":"Eye detection in a face image using linear and nonlinear filters","228795053":"Robust Eye Detection for Cockpit Access Control using an Appearance Model and Radial Symmetry Transform under Active Near Infrared Illumination","265527516":"-i - Investigation into Matching High Level Features Across Images","2279213":"Audio-visual and Multimodal Speech Systems","224238156":"Facial feature detection with 3D convex local models","222333523":"Automatic human face location in a complex background using motion and color information","2617136":"A Subset Approach to Contour Tracking in Clutter","228891315":"Fast Dynamic Link Matching by Communicating Synapses","280917926":"Automatic extraction of eye field from a gray intensity image using intensity filtering and hybrid projection function","232383169":"An automatic human face recognition system","3854114":"Pose estimation, model refinement, and enhanced visualization usingvideo","264112295":"Face Detection using Color Information and AdaBoost Algorithm","222571101":"Lennard-Jones Force Field for Geometric Active Contour","2588476":"On Classifying Deformable Contours Using the Generalized Active Contour Model","250884584":"Locating Facial Features with Active Shape Models","2723636":"Information Theoretic View-Based and Modular Face Detection","4126492":"A new method of detecting human eyelids based on deformable templates","13414377":"Deformable models in medical image analysis: a survey","2752268":"Estimation of Eye and Mouth Corner Point Positions in a Knowledge-Based Coding System","234801880":"Modelling objects with changing shapes: a survey","266174705":"Face detection with colour segmentation and fuzzy template matching","241432909":"Lip tracking using pattern matching snakes","264167569":"Real-time Eye Detection Method Robust to Facial Pose Variations Using Gradient Directional Features and Particle Filter","3784459":"Real-time lip tracking and bimodal continuous speech recognition","2854681":"Learning with Kernel Machine Architectures","220183084":"An Analytic-to-Holistic Approach for Face Recognition Based on a Single Frontal View.","2862876":"Finite Element Methods for Active Contour Models and Balloons for 2D and 3D Images","222397049":"Robust facial feature tracking under varying face pose and facial expression. Pattern Recogn","222304888":"Motion tracking of human mouth by generalized deformable models","277284798":"EX025/2003 1 Face verification using biometric hashing","239010054":"A Robust Approach to Automatic Iris Localization","2266905":"Analyzing the Deformation of the Left Ventricle of the Heart With a Parametric Deformable Model","220146212":"Fast Surface Segmentation Guided by User Input Using Implicit Extension of Minimal Paths","224057882":"Object Detection and Recognition via Deformable Illumination and Deformable Shape","222501383":"Speechreading using Probabilistic Models","236683603":"Motion estimation for medical application in psychiatry","3854193":"Representation and recognition of complex human motion","221356669":"Segmentation of X-Ray CT Images Using Stochastic Templates caroline@math.ed.ac.uk .","223601182":"A Parametric Deformable Model to Fit Unstructured 3D Data","4353804":"Ensemble Classification Based on ICA for Face Recognition","223683098":"A hierarchical neural network for human face detection","261486785":"Lip contours detection and tracking with multi features","224211467":"Combination of Wavelet and PCA for face recognition","220701296":"Shape-Guided Split and Merge of Image Regions","220785279":"A New Approach to Face Localization in the HSV Space Using the Gaussian Model.","225561129":"Skeleton Search: Category-Specific Object Recognition and Segmentation Using a Skeletal Shape Model","3561327":"System for automated iris recognition","3614573":"Using deformable templates to infer visual speech dynamics","224164358":"An Eye for an Eye: A Single Camera Gaze-Replacement Method","2998128":"Audio-Visual Biometrics","24395305":"Analysis of Normal Human Eye with Different Age Groups using Infrared Images","266526908":"Accurate Extraction of Iris and Eye Corners for Facial Biometrics","3561320":"Recognizing a facial image from a police sketch","241191169":"A face clustering method based on facial shape information","232639167":"Face Pose Estimate Technology and Its Application in Video Invigilation","251818086":"Attractor-Based Person Identification","271642453":"Driver’s Fatigue Detection Based on Yawning Extraction","2516800":"Active Shape Models: Evaluation of a Multi-Resolution Method for Improving Image Search","3309397":"Automatic Single View-Based 3-D Face Synthesis for Unsupervised Multimedia Applications","260290795":"An Automatic eye detection method for gray intensity facial images","266291383":"Automatic features identification with Infrared Thermography in Fever Screening","220566092":"Face Recognition: A Literature Survey","220611148":"Automatic face authentication with self compensation","37649748":"Eye detection using a deformable template in static images","224055857":"Quantitative evaluation of facial palsy by contour extraction of facial features","228707023":"Fast Facial Feature Tracking with Multi-Cue Particle Filter","3557190":"From global to local, a continuum of shape models with fractal priors","24251907":"Recognition using information-optimal adaptive feature-specific imaging","224057896":"Matching Radar and Satellite Images Employing the Hausdorff Distance for Ship Positioning and Trajectory Estimation","3854153":"An image-based Bayesian framework for face detection","220785247":"Robust Lip Contours Localization and Tracking Using Multi Features – Statistical Shape Models","37649734":"Segmentação de Objectos Representados em Imagens Segundo Princípios Físicos","222343737":"Facial feature tracking for cursor control","224586267":"Human portrait generation system for robot arm drawing","2770768":"Facial Features Segmentation by Model-Based Snakes","220701277":"Skeleton-Based Shape Models with Pressure Forces: Application to Segmentation of Overlapping Leaves.","220635738":"A Survey of Face Recognition Techniques","273479472":"Automatic Generation of Facial Expression Using Triangular Geometric Deformation","224293411":"Robust Eye Detection from Facial Image based on Multi-cue Facial Information","3424074":"A review of speech-based bimodal recognition","221110957":"LOCUS: Learning Object Classes with Unsupervised Segmentation","220590756":"A Cloud Model-based Approach for Facial Expression Synthesis.","255594685":"An improved eye localization algorithm using multi-cue facial information","224297692":"Automatic ship positioning and radar biases correction using the Hausdorff distance","277290756":"The LATEX Companion","257485020":"Effective elliptic fitting for iris normalization","4368327":"Real-time driver eye detection method using Support Vector Machine with Hu invariant moments","255162547":"pxc3884622","4040634":"Efficient active appearance model for real-time head and facial feature tracking","222696142":"A robust method for eye features extraction on color image","2473901":"Eye Tracking using Active Deformable Models","220517036":"Editing by Viewing: Automatic Home Video Summarization by Viewing Behavior Analysis","221997745":"Index trees for accelerating deformable template matching","233988728":"A feature-based approach for segmenting faces","222483145":"Medical Computer Vision, Virtual Reality and Robotics","258277614":"Recognition of Facial Pattern by Modified Kohonen\u0027s Self Organizing Map (MKSOM) and Analyze the Performance","221362877":"Enhanced Pictorial Structures for precise eye localization under incontrolled conditions","7141345":"Meticulously detailed eye region model and its application to analysis of facial images","266580082":"Semiautomatic Methods for Recovering Radial Distortion Parameters from A Single Image","220660406":"Using Prior Shapes in Geometric Active Contours in a Variational Framework","243656983":"Face recognition based on depth maps and surface curvature","250069365":"Audio-Visual Speech Recognition Using MPEG4 Compliant Visual Features","259991788":"Facial-feature detection and localization based on a hierarchical scheme","233970278":"Real time head and facial features tracking from uncalibrated monocular views","258547965":"Object recognition based on spatial Active Basis template","27313718":"3D facial data fitting using the biharmonic equation","29754960":"Face image analysis with convolutional neural networks","260456465":"3-D model assisted facial error concealment technique using regenerative particle filter based tracking","220050049":"Processing of audio and visual speech for telecommunication systems","226802200":"Eye-blink detection system for human–computer interaction","3217324":"Audio-to-visual conversion for multimedia communication","224203458":"Robust Facial Feature Tracking Using Shape-Constrained Multiresolution-Selected Linear Predictors","220643974":"Edge detection by estimation and minimization of errors","224568002":"The realization of robot theater: Humanoid robots and theatric performance","238723483":"Eye Detection in Facial Image by Genetic Algorithm Driven Deformable Template Matching","239800808":"Face Recognition Combining Eigen Features with a Parzen Classifier","229177867":"Soil Nitrogen","3297175":"Image representations and feature selection for multimedia database search","224135930":"Active Skeleton for Non-rigid Object Detection","273764347":"A Review on Face Detection Approaches","3805073":"Design of a vision system for identity verification","3549062":"Magnetoencephalographic data indicates separate component modelingis necessary in evaluating evoked responses","224236268":"Face detection using templates","243482930":"Illumination-invariant face recognition using composite filters synthesized by simulated annealing","222671604":"Eigenhill vs. eigenface and eigenedge","223202044":"Generating Realistic Facial Expressions with Wrinkles for Model-Based Coding","3614596":"Lip modeling for visual speech recognition","2426769":"Model-Based Three-Dimensional Freehand Ultrasound Imaging","3192708":"Automatic interpretation and coding of face images using flexible models. IEEE Trans Pattern Anal Mach Intell","255404175":"Face Alignment","4354037":"Eye-Gaze Tracking Research Based on Image Processing","222544635":"Projection based method for segmentation of human face and its evaluation","47449455":"Towards the Automatic Study of the Vocal Tract From Magnetic Resonance Images","254421142":"A Human-Robot Interface Using Eye-Gaze Tracking System for People with Motor Disabilities","221573768":"An object-based video coding framework for video sequences obtained from static cameras","2854891":"Parallel Processing for Automatic Face Recognition using Eigenfaces","4372354":"Face recognition by using 4D Discrete Cosine Transform","220777193":"Locating Human Eyes Using Edge and Intensity Information","220660453":"Computation and analysis of image motion: a synopsis of current problems and methods. Int J Comput Vision","222182140":"Invariant pattern recognition using analog recurrent associative memories","38958486":"Acquisition et modélisation de données articulatoires dans un contexte multimodal","220166870":"Statistical models of appearance for eye tracking and eye-blink detection and measurement. IEEE Trans Consum Electron","3907570":"On the incorporation of shape priors into geometric active contours. In: IEEE VLSM","225581752":"Eye-Blink Controlled Human-Computer Interface for the Disabled","4052977":"Face detection using gradient vector flow","269270978":"Design of face detection and tracking system","228903540":"Monitoring of Facial Characteristic Movement for the Control of Mobile Devices: Issues and Recommendations","3192800":"Example Based Learning for View-Based Human Face Detection","237634043":"Vom Promtionsausschuss des Fachbereichs Informatik der Univer- sitat Koblenz-Landau zur Verleihung des akademischen Grades Doktor der Naturwissenschaften (Dr. rer. nat.) geneh- migte Dissertation","220996349":"3D face authentication by mutual coupled 3D and 2D feature extraction","271914977":"Segmentation of Lip Region in Color Images by Fuzzy Clustering","220928764":"Face Detection and Precise Eyes Location.","254009595":"A Novel Haptic Jacket based Alerting Scheme in a Driver Fatigue Monitoring System","251844827":"Information Fusion System with GPRS module for Monitoring the Status of Driver","4003809":"Active tracking and cloning of facial expressions using spatio-temporal information","238694886":"Appearance-Based Tracking of Non-Rigid Objects","228870777":"Robust lip-tracking using rigid flocks of selected linear predictors","3561449":"Articulated and Elastic Non-rigid Motion: A Review","3813339":"Dynamic occluding contours: A new external-energy term for snakes","2865098":"Visual Speech And Speaker Recognition","3928025":"A Hybrid Approach To Mouth Features Detection","228954695":"A system for human face and facial feature location","36419016":"Fitting Parametric Curve Models to Images Using Local Self-adapting Separation Criteria","2514885":"Automatic Interpretation of Human Faces and Hand Gestures Using Flexible Models","2539458":"Accurate, Real-Time, Unadorned Lip Tracking","221280981":"Precise Pupil Contour Detection Based on Minimizing the Energy of Pattern and Edge.","221356759":"Automatic Features Detection for Overlapping Face Images on their 3D Range Models.","4216743":"An eye feature detector based on convolutional neural network","255563987":"A Hybrid Hyperquadric Model for 2-D and 3-D Data Fitting","2240462":"Graded Learning for Object Detection","15265541":"Medical image interpretation: A generic approach using deformable templates","4368300":"Incorporating corner information for mouth feature extraction","222468781":"Frontal-view face detection and facial feature extraction using color, shape and symmetry based cost functions","2555862":"Modeling And Animating Personalized Faces","234813966":"Overview of automatic facial expressions analysis","261236834":"Active Contours with Group Similarity","228817489":"3D pose estimation and normalization for face recognition","228571755":"Kernel Method for Linear Operator Variational Problems: Non-linear Unit Normal Algorithm for Non-Rigid Motion Estimation of 3D Surfaces","3813327":"Deformable Shape Detection and Description via Model-Based Region Grouping","228395626":"MPEG-4 Synthetic Video in real implementation","222466746":"On active contour models and balloons. CVGIP","264863793":"Fast object detection based on selective visual attention","221301451":"Facial Feature Extraction Using Geometric Feature and Independent Component Analysis","240785830":"Snakes Based Analysis of Ocular Fatigue"},"index":829}