{"abs":"Summary form only given. Parallel genetic algorithm for search and constrained multiobjective optimization introduces the design and complexity analysis of a parallel genetic algorithm to generate a \"best\" path for a robot arm to follow, given a starting position and a goal in three dimensional space. Path generation takes into account any obstacles near the arm. This algorithm uses multiple optimization criteria, independent cross-pollinating populations, and handles multiple hard constraints. Individuals in the population consist of multiple chromosomes. The complexity of the algorithm is the number of generations processed times O(N ) where N is the total number of individuals used for path generation on all of the optimizations.","title":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","id":220949396,"url":"https://www.researchgate.net/publication/220949396_Parallel_Genetic_Algorithm_for_Search_and_Constrained_Multi-Objective_Optimization","names":["Lucas A. Wilson","Michelle D. Moore","Jason P. Picarazzi","Simon D. San Miquel"],"references":{"216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","220885629":"Biases in the Crossover Landscape.","220045412":"Adoption in Natural and Artificial System","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","2718690":"Using Genetic Algorithms to Solve NP-Complete Problems","246307253":"Genetic Algorithms and Robotics: A Heuristic Strategy for Optimization","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","264923669":"Genetic Algorithms, Noise, and the Sizing of Populations"},"citedIn":{"258083640":"A multiobjective optimization approach to statistical mechanics","265125216":"Optimal point-to-point motion planning of non-holonomic mobile robots in the presence of multiple obstacles","220180305":"Cross-pollinating parallel genetic algorithms for multiobjective search and optimization","251988411":"Optimal motion planning of non-holonomic mobile robots in presence of multi obstacles","220479978":"Multi-objective robot motion planning using a particle swarm optimization model","222534332":"Multi-objective Optimization using Genetic Algorithms: a Tutorial"},"index":83}