{"abs":"We investigate the application of Support Vector Machines (SVMs) in computer vision. SVM is a learning technique developedbyV.Vapnik and his team (AT\u0026T Bell Labs.) that can beseen as a new methodfortraining polynomial, neural network, or Radial Basis Functions classifiers. The decision surfaces are found by solving a linearly constrained quadratic programming problem. This optimization problem is challenging because the quadratic form is completely dense and the memory requirements grow with the square of the number of data points. We present a decomposition algorithm that guarantees global optimality, and can beusedtotrain SVM\u0027s over very large data sets. The main ideabehind the decomposition is the iterative solution of sub-problems and the evaluation of optimality conditions which areused both to generate improved iterative values, and also establish the stopping criteria for the algorithm. We present experimental results of our implementation of SVM, and demonstrate the feasibili...","title":"Training Support Vector Machines: an Application to Face Detection","id":2464475,"url":"https://www.researchgate.net/publication/2464475_Training_Support_Vector_Machines_an_Application_to_Face_Detection","names":["Edgar Osuna","Robert M Freund","Federico Girosi","Proceedings / CVPR, IEEE Computer Society Conference on Computer Vision and Pattern Recognition. IEEE Computer Society Conference on Computer Vision and Pattern Recognition"],"references":{"221345107":"Simplified Support Vector Decision Rules.","22861727":"[Functional analysis].","2654988":"Determination of Face Position and Pose With a Learned Representation Based on Labeled Graphs","37605594":"Support vector machines : training and applications","2376111":"A Training Algorithm for Optimal Margin Classifier","3192800":"Example Based Learning for View-Based Human Face Detection","220343922":"Support Vector Network","226284653":"Large-Scale Linearly Constrained Optimization","3579044":"An Original Approach for the Localization of Objects in Images","5595969":"The Nature Of Statistical Learning Theory","3612993":"Probabilistic visual learning for object detection","2459475":"Human Face Detection in Visual Scenes","220644412":"Detection and localization of faces on digital images","223244629":"Human face detection in complex background"},"citedIn":{},"index":830}