{"abs":"We propose a computational model for detecting and localizing instances from an object class in static gray-level images. We divide detection into visual selection and final classification, concentrating on the former: drastically reducing the number of candidate regions that require further, usually more intensive, processing, but with a minimum of computation and missed detections. Bottom-up processing is based on local groupings of edge fragments constrained by loose geometrical relationships. They have no a priori semantic or geometric interpretation. The role of training is to select special groupings that are moderately likely at certain places on the object but rate in the background. We show that the statistics in both populations are stable. The candidate regions are those that contain global arrangements of several local groupings. Whereas our model was not conceived to explain brain functions, it does cohere with evidence about the functions of neurons in V1 and V2, such as responses to coarse or incomplete patterns (e.g., illusory contours) and to scale and translation invariance in IT. Finally, the algorithm is applied to face and symbol detection.","title":"A Computational Model for Visual Selection","id":220499751,"url":"https://www.researchgate.net/publication/220499751_A_Computational_Model_for_Visual_Selection","names":["Yali Amit","Donald Geman","Neural Computation"],"references":{"221364881":"Neural Network-Based Face Detection","14998692":"Kobatake, E. \u0026 Tanaka, K. Neuronal selectivities to complex object features in the ventral visual pathway of the macaque cortex. J. Neurophysiol. 71, 856-867","15364878":"Inferior Temporal Mechanisms for Invariant Object Recognition","236633919":"Multiple memory systems in the visual cortex.","3669554":"Tracking and learning graphs and pose on image sequences of faces","15483753":"Size and position invariance of neuronal response in monkey inferotemporal cortex","3497808":"Object recognition by affine invariant matching","230675353":"Eye, Brain and Vision","21425505":"“Psychophysical support for a 2-D view interpolation theory of object recognition”","14567385":"Speed of Processing in the Human Visual System","239339854":"A quotient space hough transform for scpae-variant visual attention","3192800":"Example Based Learning for View-Based Human Face Detection","258350166":"The Effects of Contextual Scenes on the Identification of Objects","235172182":"Perceptual Organization and Visual Recognition","22328391":"Schiller, P. H., Finlay, B. L. \u0026 Volman, S. F. Quantitative studies of single-cell properties in monkey striate cortex. I. Spatiotemporal organization of receptive fields. J. Neurophysiol. 39, 1288-1319","223938540":"Human Image Understanding: Recent Research and a Theory","21707869":"Fujita, I., Tanaka, K., Ito, M. \u0026 Cheng, K. Columns for visual features of objects in monkey inferotemporal cortex. Nature 360, 342-346","14784919":"Macaque VI neurons can signal ‘illusory’ contours","12413254":"A Neural Network Architecture for Visual Selection","23112221":"Ferrier Lecture: Functional Architecture of Macaque Monkey Visual Cortex","220499641":"Shape Quantization And Recognition With Randomized Trees."},"citedIn":{"221110317":"A Bayesian Approach to Unsupervised One-Shot Learning of Object Categories.","10677670":"An integrated network for invariant visual detection and recognition","3428145":"License Plate Recognition From Still Images and Video Sequences: A Survey","220660513":"Weakly Supervised Learning of Visual Models and Its Application to Content-Based Retrieval","224773218":"Machine Learning Applied to Object Recognition in Robot Search and Rescue Systems","220757282":"Learning Hierarchical Representations of Object Categories for Robot Vision","8153458":"A Coarse-to-Fine Strategy for Multi-Class Shape Detection","4351053":"Similarity-based cross-layered hierarchical representation for object categorization","220320052":"A Hierarchy of Support Vector Machines for Pattern Detection","220923454":"Statistical Methods for Data Mining and Knowledge Discovery.","45449378":"On the Optimality of Spatial Attention for Object Detection","221363755":"Visual Object Detection with Deformable Part Models","4246107":"Hierarchical Statistical Learning of Generic Parts of Object Structure","4038433":"Object recognition with informative features and linear classification","237494073":"A Dissertation Presented","221111859":"Robust Real-Time Face Detection.","221305391":"Sparse Flexible Models of Local Features","222423905":"The quantitative characterization of the distinctiveness and robustness of local image descriptors","221304850":"Multiple Component Learning for Object Detection","23676490":"A Sparsity-Enforcing Method for Learning Face Features","221305109":"A Tale of Two Classifiers: SNoW vs. SVM in Visual Recognition","29621989":"Dynamic ensemble for target tracking","225156684":"Cascaded online boosting","225845086":"Low-Energy Digit-Serial/Parallel Finite Field Multipliers","257409662":"Using Map-Based Visual Interfaces to Facilitate Knowledge Discovery in Digital Libraries","220809731":"End-Stop Exemplar Based Recognition.","220785411":"Image Indexing by Focus Map.","7502175":"Robust acoustic object detection","260665254":"Automatic License Plate Recognition (ALPR): A State-of-the-Art Review","220989722":"Novel Face Detection Using Gabor Filter Bank with Variable Threshold","4156424":"Integrated learning of saliency, complex features, and object detectors from cluttered scenes","277026744":"Saliency-based keypoint selection for fast object detection and matching","239853168":"Object Detection with Heuristic Coarse-to-Fine Search","4156418":"The distinctiveness, detectability, and robustness of local image features","262159517":"D.: Self-normalized linear tests","265052302":"Learning a Hierarchical Compositional Shape Vocabulary for Multi-class Object Representation","221362803":"Part-Based Statistical Models for Object Classification and Detection.","237228902":"Combining Low and High Level Features for Object Recognition","220106325":"A Survey of Face Detection, Extraction and Recognition.","215722384":"Local Spatio-Temporal Image Features for Motion Interpretation","44608484":"Active Testing for Face Detection and Localization","228448209":"Learning to Detect Objects with Minimal Supervision","2560361":"Visual Feature Learning","221305214":"Voting by grouping dependent parts. In: ECCV","9077982":"Pattern Filtering for Detection of Neural Activity, with Examples from HVc Activity During Sleep in Zebra Finches","280894698":"Understanding Objects in Detail with Fine-Grained Attributes","5613827":"Distance Sets for Shape Filters and Shape Recognition","51769922":"Rapid and accurate developmental stage recognition of C. elegans from highthroughput image data","232654214":"Computational Anatomy for Generating 3D Avatars and Boosting Face Recognition Systems","6139653":"Context-Based Object-Class Recognition and Retrieval by Generalized Correlograms","220660094":"Robust Real-Time Face Detection","267444651":"Coarse-to-fine classification and scene labeling","7771434":"Face Detection Using Spectral Histograms and SVMs","7452716":"Relative focus map estimation using blind deconvolution","273687053":"Development of Contactless Integrated Interface of Complex Production Lines","221363823":"Deconvolutional networks","6381568":"Bootstrapped learning of novel objects","2374982":"Computational Models of Object Recognition in Cortex: A Review","4351009":"Unsupervised learning of probabilistic object models (POMs) for object classification, segmentation and recognition","261211378":"Object detection using signature library","276073488":"Beyond the Sum of Parts: Voting with Groups of Dependent Entities","221618000":"Learning Hyper-Features for Visual Identification.","237122891":"PATTERN RECOGNITION USING COMPOSITE FEATURES","11218370":"Acquisition of visual shape primitives","6841603":"Using hidden scale for salient object detection","226552303":"Weakly Supervised Scale-Invariant Learning of Models for Visual Recognition","3973971":"Fast face detection with precise pose estimation","244441057":"Shape recognition with edge-based features","4215351":"Motion-based flexible camera registration","240308777":"Deep Hierarchies in the Primate Visual Cortex: What Can We Learn for Computer Vision?","7211794":"One-shot learning of object categories","1892960":"False discovery rate control with multivariate $p$-values","220875351":"Generative Models for Labeling Multi-object Configurations in Images","220745045":"A Regularized Approach to Feature Selection for Face Detection","221304142":"Learning a Sparse Representation for Object Detection","2985901":"Design, analysis, and engineering of video monitoring systems: An approach and a case study","228394527":"Face Detection","3940792":"Constructing models for content-based image retrieval","3193526":"Vanishing Point Detection without Any A Priori Information","224309464":"Unsupervised Learning of Probabilistic Grammar-Markov Models for Object Categories","282626654":"Adding discriminative power to a generative hierarchical compositional model using histograms of compositions","2399139":"Constructing Models for Content-Based Image Retrieval","34510980":"Engineering, statistical modeling and performance characterization of a real-time dual camera surveillance system /","215991634":"Context, Computation, and Optimal ROC Performance in Hierarchical Models","221429923":"Visual object classification by robots using on-line self-supervised learning","225223935":"Pictorial Structures for Object Recognition","27524919":"On the Design of Cascades of Boosted Ensembles for Face Detection","259294433":"An Effective Hybrid Method for Face Detection","220989114":"Image model based on salient regions and its applications","221363366":"Statistical Modeling and Performance Characterization of a Real-Time Dual Camera Surveillance System.","220259000":"Jump Diffusion over Feature Space for Object Recognition","221363369":"Towards Scalable Representations of Object Categories: Learning a Hierarchy of Parts","221305000":"Learning Visual Shape Lexicon for Document Image Content Recognition.","259294445":"An Effective Hybrid Method for Face Detection","251723418":"Automatic Recognition and Location of Civil Infrastructure Objects Using Mobile Mapping Technology, Neural Network and Markov Chain Monte Carlo","224633849":"Extraction of attributes for visual object recognition and DNA microarray analysis","8198113":"Learning to detect objects in images via a sparse Part-base representation","242405869":"Dieren tial Geometry and Shape Lecture notes","12200741":"Models of object recognition","220745143":"Hierarchical Learning of Dominant Constellations for Object Class Recognition.","228576573":"Constellation Models for Recognition of Generic Objects","220319874":"A Stochastic Algorithm for Feature Selection in Pattern Recognition","12200733":"The basic unit of computation","220659585":"POP: Patchwork of Parts Models for Object Recognition","241527245":"Computation Intensive Methods: State of the Art","237563521":"Learning attentive features for face recognition Ph.D. Second Year Report","2523791":"An Integrated Network for Invariant Visual Detection","242077889":"Learning Hierarchical Compositional Representations of Object Structure","26756904":"Unsupervised Learning of Probabilistic Object Models (POMs) for Object Classification, Segmentation, and Recognition Using Knowledge Propagation","228538155":"Computational strategies for model-based scene interpretation","265718882":"Parameter Estimation in Image Processing and Computer Vision","261168679":"Efficient Object Detection Using Cascades of Nearest Convex Model Classifiers","282223204":"Shade Interest Points for Dynamic Stream Object Categorization","263112985":"An edge-based scale- and affine-invariant algorithm for remote sensing image registration","5911523":"Flexible Spatial Configuration of Local Image Features","241605337":"On theorists and data in computational neuroscience","243787846":"Object Class Recognition Using Discriminative Local Features","222817667":"Learning generative visual models from few training examples: an incremental Bayesian approach tested on 101 object categories. Comput Vis Image Underst","238684156":"AVisualCategoryFilterforGoogleImages","11952253":"Attractor Networks for Shape Recognition","2121196":"Hierarchical testing designs for pattern recognition","2714597":"Graded Learning for Object Detection","11395425":"Learning to Recognize Three-Dimensional Objects","47329567":"Unsupervised learning of models for object recognition","235126989":"Mathematical Foundations for Object Recognition and Image Analysis","224330385":"Fusion of heterogeneous features via cascaded on-line boosting","257484936":"50 Years of object recognition: Directions forward","281067538":"Chapter 8 DOI: 10.4018/978-1-4666-6030-4.ch008 An Efficient System for Blocking Pornography Websites","227025232":"Coarse-to-Fine Face Detection","221351145":"About Implicit and Explicit Shape Representation.","242082228":"Object Recognition Using Flexible Groups of Local Features","6469308":"Invariance and selectivity in the ventral visual pathway","4082400":"Self-normalized linear tests","2241020":"Coarse-to-Fine Visual Selection","220785096":"Use of Human Motion Biometrics for Multiple-View Registration","261054313":"An efficient face detection in color images using eye mouth triangular approach","35211518":"Parts-based object detection using multiple views /","4022999":"Object class recognition by unsupervised scale-invariant learning. In CVPR’03","2240462":"Graded Learning for Object Detection","2361032":"Object Recognition with Pictorial Structures","220660169":"Learning to Locate Informative Features for Visual Identification","258386569":"Discriminant Phase Component for Face Recognition","221304543":"Unsupervised Learning of Models for Recognition","37536204":"Categorical Perception","41028490":"Learning the Compositional Nature of Visual Object Categories for Recognition","12413254":"A Neural Network Architecture for Visual Selection","2586332":"On Affine Invariant Clustering and Automatic Cast Listing in Movies","5657002":"Fast Asymmetric Learning for Cascade Face Detection","4038337":"Selection of Scale-Invariant Parts for Object Class Recognition","255587015":"Image Interpretation using Bottom-up Top-down Cycle on Fragment Trees","221305293":"A Visual Category Filter for Google Images","221696200":"A New Biased Discriminant Analysis Using Composite Vectors for Eye Detection","227106422":"Categorical Perception"},"index":833}