{"abs":"We describe a method of locating hypotheses for the positions of faces in an image. We use statistical feature detectors to locate candidates for features, then use a statistical model of the shape and orientation of the features to test combinations of such features to find the most plausible. The best sets can be used as the initial position of an Active Shape Model, which can then accurately locate the full face","title":"Locating faces using statistical feature detectors","id":3669633,"url":"https://www.researchgate.net/publication/3669633_Locating_faces_using_statistical_feature_detectors","names":["T.F. Cootes","Christopher J Taylor"],"references":{"2257634":"Towards an Automatic Human Face Localization System","239986664":"Face localisation via shape statistics","246295560":"General Shape Distributions in a Plane","2516800":"Active Shape Models: Evaluation of a Multi-Resolution Method for Improving Image Search","220659872":"Active contour models. Int J Comput Vis","222470121":"The Use of Active Shape Models For Locating Structures in Medical Images","2518504":"A Unified Approach To Coding and Interpreting Face Images","3612993":"Probabilistic visual learning for object detection","3507757":"Closed-form solution for physically based shape modeling and recognition","216722131":"Applied Multivariate Statistical Analysis Third Ed","220612188":"Statistical grey-level models for object location and identification.","257485030":"Active Shape Models-Their Training and Application","3613032":"A Unified Approach To Coding and Interpreting Face Images"},"citedIn":{"234779326":"Automatic detection of face and facial features","239614093":"FACIAL EXPRESSION RECOGNITION SYSTEM USING WEIGHT-BASED APPROACH","238668467":"Face Localization from Discriminative Regions Thesis Proposal","3766194":"Detecting human faces in color images","2714597":"Graded Learning for Object Detection","3193340":"Detecting Faces in Images: A Survey","2121196":"Hierarchical testing designs for pattern recognition","225894842":"Intelligent CCTV via Planetary Sensor Network","229041640":"A New Technique for Detection and Location of Human Faces in Digital Image","3308029":"Face segmentation using skin-color map in videophone applications","226801044":"Fast and robust Face Detection","3824747":"An image processing and belief network approach to face detection","3830703":"Enhancing the Bayesian network approach to face detection","29754960":"Face image analysis with convolutional neural networks","227025232":"Coarse-to-Fine Face Detection","224164036":"Embedded facial image processing with Convolutional Neural Networks","289658840":"Efficient Focusing and Face Detection","2241020":"Coarse-to-Fine Visual Selection","225646867":"Skin-based Face Detection-Extraction and Recognition of Facial Expressions","222452707":"Detecting human faces in color images","43493041":"Real-Time Face Detection and Classification for ICCTV","223252391":"Face segmentation and tracking based on connected operators and partition projection","2240462":"Graded Learning for Object Detection","281360811":"APPLICATION OF A MULTI-LAYER PERCEPTRON NETWORK FOR DETECTION OF HUMAN FACES ON A LARGE DATABASE","2763736":"Enhancing Human Face Detection using Motion and Active Contours","224273260":"Active contour model for extracting human faces","3745229":"Facial contour extraction model","235122039":"Spatial Graphical Models for Image Matching and Object Recognition","12413254":"A Neural Network Architecture for Visual Selection","249645215":"NEURAL NETWORK FOR HUMAN FACE DETECTION AND LOCALIZATION IN COLOR IMAGES","3875588":"Knowledge-based eye detection for human face recognition"},"index":834}