{"abs":"An algorithm for locating quasi-frontal views of human faces in cluttered scenes is presented. The algorithm works by coupling a set of local feature detectors with a statistical model of the mutual distances between facial features it is invariant with respect to translation, rotation (in the plane), and scale and can handle partial occlusions of the face. On a challenging database with complicated and varied backgrounds, the algorithm achieved a correct localization rate of 95% in images where the face appeared quasi-frontally","title":"Finding Faces in Cluttered Scenes Using Labeled Random Graph Matching.","id":221110772,"url":"https://www.researchgate.net/publication/221110772_Finding_Faces_in_Cluttered_Scenes_Using_Labeled_Random_Graph_Matching","names":["Thomas Leung","Michael C. Burl","Pietro Perona"],"references":{"225304623":"Inroduction to Statistical Pattern Recognition","239986664":"Face localisation via shape statistics","216721999":"Pattern Classification and Scene Analysis","256075302":"Eigenfaces for Recognition. J Cogn Neurosci","3028808":"Optimal filtering","256075301":"Deformable Templates for Face Recognition","246295560":"General Shape Distributions in a Plane","223659250":"Face recognition using perspective invariant features","3192217":"Face Recognition: Features Versus Templates”","243673769":"Computer Recognition of Human Faces","235581573":"Detection, Estimation, and Modulation Theory. Part III","246341144":"Graphical Templates for Image Matching","246832896":"Low dimensional representation of faces in high dimensions of the space. J Opt Soc Am A","223452203":"Connectionist models of face processing: A survey","220644412":"Detection and localization of faces on digital images","223244629":"Human face detection in complex background","222467519":"Computational framework for determining stereo correspondence from a set of linear filters","3027121":"Pattern classification and scene analysis","46381820":"Optical network for real-time face recognition"},"citedIn":{"4060732":"A low cost FPGA system for high speed face detection and tracking","4264517":"Composite Object Detection in Video Sequences: Application to Controlled Environments","3637810":"Recognition via consensus of local moments of brightness andorientation","2986027":"Learning and vision machines","221103910":"Constellations and the Unsupervised Learning of Graphs","242084449":"Face Detection in Still Color Images Using Skin Color Information","224057175":"Multi-Camera Face Recognition by Reliability-Based Selection","234791920":"Trackable surfaces","274709070":"SVM Based Adaptive Median Filter Design for Face Detection in Noisy Images","224398708":"Methodological Approach for Machine based Expression and Gender Classification","220320052":"A Hierarchy of Support Vector Machines for Pattern Detection","4040740":"Advances in Component-Based Face Detection","2360895":"Feature-Based Human Face Detection","4363353":"Development of an interactive robot with emotional expressions and face detection","233882604":"A 3D geometric approach to face detection and facial expression recognition","265871358":"A VISITOR RECOGNITION AND MONITORING SYSTEM FOR PEOPLE WITH MILD COGNITIVE IMPAIRMENT","251821861":"Multiscale Face Detection: A New Approach to Robust Face Detection","224058226":"Mirrobot: Fast Detection of Body-Parts in the Scale-Space of Range Images with an Application to Human Motion Copying","3297305":"An Efficient Algorithm for Discovering Frequent Subgraphs","220467976":"Appearance-based face detection with artificial neural networks","256822112":"A novel rotation/scale invariant template matching algorithm using weighted adaptive lifting scheme transform","4246127":"Training Deformable Models for Localization","2405397":"Object Localization Using Linear Adaptive Filters","269250109":"Can Your Eyes Tell Me How You Think? A Gaze Directed Estimation of the Mental Activity","221506305":"Face Detection by Aggregated Bayesian Network Classifiers.","242457152":"PHÁT HIỆN KHUÔN MẶT DỰA TRÊN ĐẶC TRƯNG LỒI LÕM","232639968":"Names and Faces in the News","2834454":"Component Fusion for Face Detection in the Presence of Heteroscedastic Noise","220285215":"Automatic extraction of face contours in images and videos","257344361":"Facial feature extraction using a probabilistic approach","47861914":"3-D Time-Varying Scene Capture Technologies—A Survey","220603749":"Fast face detection via morphology-based pre-processing","2380384":"Learning Visual Models of Social Engagement","282331793":"IMPLEMENTATION AND ANALYSIS OF FEATURE BASED FACE DETECTION ALGORITHM","235219522":"Automatic Face Recognition in a crowded scene using Multi layered clutter filtering and Independent Component Analysis","228357588":"Automatic Detection of Human Nudes","225644346":"Face Detection by Aggregated Bayesian Network Classifiers","3766386":"A probabilistic contour discriminant for object localisation","261306328":"Face Detection, Pose Estimation, and Landmark Localization in the Wild","221533050":"Automatic extraction of face contours","37649516":"Imagens de Faces: Exemplos de Metodologias e Aplicações","3974248":"Coarse-to-fine support vector classifiers for face detection","221567848":"A Color-Triangle-Based Approach to the Detection of Human Face","2426491":"Face Localization via Shape Statistics","228796924":"Identifying perceptually significant features for recognizing faces","4027995":"Face tracking in video with hybrid of Lucas-Kanade and condensation algorithm","4082264":"Automatic cascade training with perturbation bias","263750608":"Feature-based human face detection","220809539":"The Emergence of Visual Categories - A Computational Perspective","221304671":"Finding Pictures of Objects in Large Collections of Images.","2584662":"A Trainable View-Based Object Detection System Thesis Proposal","224398609":"Hybrid Skin Detection Algorithm for Face localization in facial Expression Recognition","271472223":"An efficient face detection method","225810183":"Automatic Web Rating: Filtering Obscene Content on the Web","3758669":"Probabilistic affine invariants for recognition","223383845":"Face detection for image annotation","262217174":"Ciratefi: An RST-invariant template matching with extension to color images","2878044":"Dressed Human Modeling, Detection, and Parts Localization","236209772":"An Automatic Face Detection System for RGB Images","2439262":"Omni-Face Detection For Video/Image Content Description","4351550":"Automatic human face detection for content-based image annotation","249645215":"NEURAL NETWORK FOR HUMAN FACE DETECTION AND LOCALIZATION IN COLOR IMAGES","2820180":"Object Detection in Images by Components","4377282":"Video Face Recognition on Invariable Moment","258727915":"Multi-scale elastic graph matching for face detection","242694900":"Object component models using Gabor filters for visual recognition","237327521":"UNIVERSIDADE FEDERAL DO RIO GRANDE DO SUL INSTITUTO DE INFORMÁTICA PROGRAMA DE PÓS-GRADUAÇÃO EM COMPUTAÇÃO","221303733":"Spatial Dependence in the Observation of Visual Contours.","37993668":"Learning a Dictionary of Shape-Components in Visual Cortex: Comparison with Neurons, Humans and Machines","222526923":"Facial feature extraction for quick 3D face modeling","4082356":"Face localization via hierarchical CONDENSATION with Fisher boosting feature selection","238738608":"Efficient Features for Object Recognition","238668467":"Face Localization from Discriminative Regions Thesis Proposal","226575631":"Eigenfaces vs. Fisherfaces: Recognition Using Class Specific Linear Projection","262322477":"A Methodology For Detecting Faces From Different Views","228820790":"Finding objects with hypothesis testing","221303717":"Hierarchical Shape Modeling for Automatic Face Localization","261344005":"A novel algorithm for simultaneous face detection and recognition","282984010":"Real time face detection system using adaboost and haar-like features","2821297":"Computers Seeing People","221618581":"Learning a Rare Event Detection Cascade by Direct Feature Selection","222452707":"Detecting human faces in color images","220659585":"POP: Patchwork of Parts Models for Object Recognition","228974338":"Multi-scale analysis techniques in pattern recognition systems","220759936":"Real-Time Face Detection on a Configurable Hardware System.","2747008":"Finding Initial Estimates of Human Face Location","226635566":"Face Detection in Color Images Using Primitive Shape Features","222430190":"Social Signal Processing: Survey of an Emerging Domain","3192991":"Face detection from color images using a fuzzy pattern matching method","266515287":"Machine learning and data mining in pattern recognition. 2nd international workshop, MLDM 2001, Leipzig, Germany, July 25–27, 2001. Proceedings","221025177":"A System for Object Class Detection.","228973842":"Two methodologies for iris detection and location in face images","237897366":"Accurate Face Detection Based on Coarse Segmentation and Fine Skin Color Adaption","3659917":"Recognition and learning with polymorphic structural components","222669817":"Real-time face detection and tracking for mobile videoconferencing","222580728":"Unsupervised constellation model learning algorithm based on voting weight control for accurate face localization","265576810":"Smart Human Face Detection System","2257634":"Towards an Automatic Human Face Localization System","220954601":"Shape Matching Based on Fully Automatic Face Detection on Triangular Meshes","2374375":"Symbiotic Interfaces For Wearable Face Recognition","223619487":"Kaneko, S.: Using orientation codes for rotation-invariant template matching. Pattern Recognition 37(2), 201-209","221120482":"Face detection using coarse-to-fine support vector classifiers","35483347":"Discriminative distance measures for object detection /","46578197":"Robust Learning-Based Parsing and Annotation of Medical Radiographs","227025232":"Coarse-to-Fine Face Detection","37597927":"Detecting Faces in Impoverished Images","3834597":"Facial Feature Tracking for Eye-Head Controlled Human Computer Interface","221292527":"Detection of human faces under scale, orientation and viewpoint variations.","221363154":"Shape Matching and Object Recognition Using Low Distortion Correspondences.","251977696":"Optimisation the real time implementation of the Viola \u0026 Jones face detection algorithm on RISC processor","2458317":"Face Detection in Still Gray Images","220598221":"3-D Time-Varying Scene Capture Technologies - A Survey.","220307405":"Facial feature extraction for quick 3D face modeling.","242407071":"ON MULTI-SCALE DIFFERENTIAL FEATURES AND THEIR REPRESENTATIONS FOR IMAGE RETRIEVAL AND RECOGNITION","38321318":"Speeding up Adaboost object detection with motion segmentation and Haar feature acceleration","222180304":"Locating human faces within images","221139422":"Using Biologically Inspired Visual Features and Mixture of Experts for Face/Nonface Recognition.","2947288":"ViBE: A Video Indexing and Browsing Environment","2251988":"Learning the Human Face Concept From Black and White Pictures","33763067":"Multimodal verification of identity for a realistic access control application /","37451970":"Information theoretic combination of classifiers with application to face detection","242367628":"ViBE:ACompressedVideo DatabaseStructured for Active BrowsingandSearch","238687032":"Eye Detection Using Support","2433318":"Video Classification Based On HMM Using Text And Faces","26531994":"Feature Extraction Methods for Real-Time Face Detection and Classification","220929594":"Facial Components Detection with Boosting and Geometric Constraints.","222709332":"Face detection by aggregated Bayesian network classifiers","222588503":"Component-based face detection and verification","222696529":"Retinal vision applied to facial features detection and face authentication","246157239":"Face Detection Using Locally Linear Embedding","220181507":"Eigenfaces vs. Fisherfaces: Recognition Using Class Specific Linear Projection","224653948":"Efficient and Robust Face Detection from Color Images","220804105":"Interactive Selection of Visual Features through Reinforcement Learning.","47870458":"Efficient algorithms for human face modeling","221304850":"Multiple Component Learning for Object Detection","2806028":"Learning the Human Face Concept in Black and White Images","222787681":"Active face recognition with a hybrid approach","8337751":"Automatic Eyeglasses Removal from Face Images","277284778":"All rights reservedA MULTI-MODAL APPROACH TO FRONTAL AND NON FRONTAL FACIAL FEATURE DETECTION","221011457":"From Partition Trees to Semantic Trees","284729814":"Robust Face Detection with Eyes Occluded by the Shadow from Dazzling Avoidance System","261054624":"Exploration of VLIW Space processor for Adaboost-Based Applications","250742210":"Face Detection by Image Discriminating","221363718":"Detector Ensemble.","262332565":"ANN face detection with skin color distribution rules","224622171":"Detection of semantic objects using description graphs","220050469":"Automatic target recognition performance losses in the presence of atmospheric and camera effects","265893091":"FRONTAL FACE DETECTION METHODS –NEURAL NETWORKS AND AGGRESSIVE LEARNING ALGORITHM","224307301":"Simple Face-detection Algorithm Based on Minimum Facial Features","222663685":"A generative framework for real time object detection and classification","235039555":"StreetScenes: Towards Scene Understanding in Still Images","257352213":"Graph matching and clustering using kernel attributes","4086134":"Feature-based human face detection","221582460":"On the Application of Heteroassociative Morphological Memories to Face Localization","2430318":"From Coarse to Fine Skin and Face Detection","223525890":"Object recognition based on fractal neighbor distance","283764665":"Robust Three-step facial landmark localization under the complicated condition via ASM and POEM","4216593":"Detection and expression classification systems for face images (FADECS)","221215354":"Face Recognition from Color Images in Presence of Dynamic Orientations and Illumination Conditions","255624810":"Ongoing Challenges in Face Recognition","226491431":"Testing Some Morphological Approaches to Face Localization","220931702":"Human Face Detection Using Geometric Triangle Relationship.","2551672":"Face Detection and Recognition in an Image Sequence using Eigenedginess","221356625":"Fast Face Detection via Morphology-Based Pre-processing.","2527557":"A Probabilistic Contour Discriminant for Object Localisation","221318742":"Redundancy, redundancy, redundancy: The three keys to highly robust anatomical parsing in medical images","2830659":"Face Localization from Discriminative Regions","266268855":"Digital image analysis. Selected techniques and applications. Incl. 1 CD-ROM","220134517":"Preprocessing of Face Images: Detection of Features and Pose Normalization","267680920":"Situated Face Detection","220654665":"A probabilistic hit-and-miss transform for face localization. Pattern Anal Appl 7:117-127","268254862":"FACE VERIFICATION FOR ACCESS CONTROL","222079557":"A view-based statistical system for multi-view face detection and pose estimation","7211794":"One-shot learning of object categories","232621729":"An unsupervised face detection based on skin color and geometric information","261467880":"Automatic face recognition in a crowded scene using multi layered clutter filtering and independent component analysis","237107107":"FACE DETECTION WITH COLOR EIGENFACES","4243906":"Face detection by color and multilayer feedforward neural network","225610993":"Object Recognition: A \nFocused Vision\nBased Approach","220183192":"From Few to Many: Illumination Cone Models for Face Recognition Under Variable Lighting and Pose","38108109":"A Frontal Face Detection Algorithm Using Fuzzy Classifier خوارزم لإكتشاف الصور الأمامية للوجه باستخدام المنطق الغامض","3765169":"Learning the human face concept in black and white images","221119142":"A Grayscale Hit-or-Miss Transform Based on Level Sets.","233988728":"A feature-based approach for segmenting faces","3766194":"Detecting human faces in color images","221362877":"Enhanced Pictorial Structures for precise eye localization under incontrolled conditions","6899684":"Building models of animals from video","222671573":"Triangle-based approach to the detection of human face","251873938":"Face detection in video sequence with complex background","42425619":"Person Identification from Video using Facial and Speaker Features","220902588":"Real-time face recognition system with dynamic training and enhanced multi-algorithm face recognition","237234100":"Figure 1. Automatic eyeglasses removal system overview. (a) An input face image. (b) Face localization by ASM. (c) Glasses recognition by a classifier. (d) Glasses localization by MCMC. (e) Glasses removal based on a set of training examples. Automatic Eyeglasses Removal from Face Images","224215749":"Utilizing Skin Mask and Face Organs Detection for Improving the Viola Face Detection Method","2790832":"3D Object Recognition: A Model of View-Tuned Neurons","220844723":"Object Recognition: A","224125633":"Power Quality Improvement at Medium-Voltage Grids Using Hexagram Active Power Filter","221364881":"Neural Network-Based Face Detection","2540420":"Categorization by Learning and Combining Object Parts","228609026":"Probabilistic methods for finding people. Int J Comput Vision","220797579":"Object Recognition with Statistically Independent Features: A Model Inspired by the Primate Visual Cortex","220360321":"Towards Practical Facial Feature Detection.","238440338":"A Generative Framework for Real Time Object Detection","2741644":"Learning Appearance Based Models: Hierarchical Mixtures of Experts Approach based on Generalized Second Moments","244212521":"Development of A Mobile Service Robot","3193242":"Example-based object detection in images by components","215572853":"Localization of facial Region in Digital Images","223827194":"Adaptive object detection and recognition based on a feedback strategy","261760043":"A comparative study of face landmarking techniques","221292164":"A probabilistic framework for perceptual grouping of features for human face detection","2719132":"Face Detection with In-Plane Rotation: Early Concepts and Preliminary Results","221303943":"Coarse to Fine Face Detection Based on Skin Color Adaption","240844770":"خوارزم لإكتشاف الصور الأمامية للوجه باستخدام المنطق الغامض","228827672":"Robust Component-based Face Detection Using Color Feature","232643681":"Face Localization Based on the Morphological Multiscale Fingerprint","2853783":"Advances in Component-based Face Detection","221175955":"Automatic Web Rating: Filtering Obscene Content on the Web.","221356175":"A Probabilistic Model for the Human Skin Color.","37435781":"Fast Face Detection Using AdaBoost","286556884":"Towards an Autonomous Vision-Based Unmanned Aerial System against Wildlife Poachers","223900828":"Region and constellations based categorization of images with unsupervised graph learning","35658216":"Shape matching and object recognition /","7638460":"Recognizing Partially Occluded, Expression Variant Faces From Single Training Image per Person With SOM and Soft $k$ -NN Ensemble","225774269":"Shape Matching and Object Recognition","224401065":"Large scale learning and recognition of faces in web videos","228538966":"Image authentication using automatic detected ROIs","261346393":"Comparative research of the common face detection methods","3193340":"Detecting Faces in Images: A Survey","242606521":"AUTOMATIC HUMAN FACE RECOGNITION METHOD BASED ON GEOMETRICAL FACE FEATURES","2714597":"Graded Learning for Object Detection","221621497":"Statistical Learning Approaches with Application to Face Detection.","47329567":"Unsupervised learning of models for object recognition","3637754":"Recognition of planar object classes","242473379":"\"Integrazione e valutazione di algoritmi detezione volti per la valutazione in un contesto applicativo tempo-reale","264109164":"A Method of Auto Photography Composition Suggestion","37413863":"Kernel-based classifiers with applications to face detection","2241020":"Coarse-to-Fine Visual Selection","225352332":"Real-Time Face Detection on a Configurable Hardware System","220427976":"Computational Studies of Human Motion: Part 1, Tracking and Motion Synthesis","2240462":"Graded Learning for Object Detection","221411551":"Grayscale Template-Matching Invariant to Rotation, Scale, Translation, Brightness and Contrast","2856388":"Component-based Face Detection","2362315":"Finding Initial Estimates of Human Face Location","221304543":"Unsupervised Learning of Models for Recognition","221174494":"Component-Based Online Learning for Face Detection and Verification","221259457":"Scale and Orientation Invariance in Human Face Detection.","235138034":"Robust Visual Detection and Recognition of Moving Objects in Real-Time","221472962":"Fovea Based Coding for Video Streaming","242503559":"Graph-Based Representations in Pattern Recognition, 6th IAPR-TC-15 International Workshop, GbRPR 2007, Alicante, Spain, June 11-13, 2007, Proceedings","2528210":"Shape matching and object recognition using shape contexts. IEEE Trans PAMI","225799297":"Automated Processing and Classification of Face Images for Human–Computer Interaction Applications","268747250":"A Novel Approach to Face Detection Using Advanced Support Vector Machine","220939475":"A Fast Multi-Modal Approach to Facial Feature Detection.","221318859":"Learning people annotation from the web via consistency learning","220516568":"ViBE: A Compressed Video Database Structured for Active Browsing and Search","223285425":"Face-texture model based on SGLD and its application in face detection in a color scene"},"index":835}