{"abs":"The recently introduced Gene-pool Optimal Mixing Evolutionary Algorithm (GOMEA), with a lean, but sufficient, linkage model and an efficient variation operator, has been shown to be a robust and efficient methodology for solving single objective (SO) optimization problems with superior performance compared to classic genetic algorithms (GAs) and estimation-of-distribution algorithms (EDAs). In this paper, we bring the strengths of GOMEAs to the multi- objective (MO) optimization realm. To this end, we modify the linkage learning procedure and the variation operator of GOMEAs to better suit the need of finding the whole Pareto- optimal front rather than a single best solution. Based on state-of-the-art studies on MOEAs, we further pinpoint and incorporate two other essential components for a scalable MO optimizer. First, the use of an elitist archive is beneficial for keeping track of non-dominated solutions when the main population size is limited. Second, clustering can be cru-cial if different parts of the Pareto-optimal front need to be handled differently. By combining these elements, we construct a multi-objective GOMEA (MO-GOMEA). Experimental results on various MO optimization problems confirm the capability and scalability of our MO-GOMEA that compare favorably with those of the well-known GA NSGA-II and the more recently introduced EDA mohBOA.","title":"Multi-objective Gene-pool optimal mixing evolutionary algorithms","id":266656292,"url":"https://www.researchgate.net/publication/266656292_Multi-objective_Gene-pool_optimal_mixing_evolutionary_algorithms","names":["Ngoc Hoang Luong","Han La Poutré","Peter A.N. Bosman"],"references":{"3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","1957866":"Multiobjective hBOA, Clustering, and Scalability","220742128":"Optimal mixing evolutionary algorithms.","2493567":"Multi-Objective Bayesian Optimization Algorithm","262322315":"More concise and robust linkage learning by filtering and combining linkage hierarchies","220741826":"The anticipated mean shift and cluster registration in mixture-based EDAs for multi-objective optimization","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","1957889":"Decomposable Problems, Niching, and Scalability of Multiobjective Estimation of Distribution Algorithms","226110070":"Current and Future Research Trends in Evolutionary Multiobjective Optimization","220112912":"Optimal implementations of UPGMA and other common clustering algorithms"},"citedIn":{},"index":837}