{"abs":"Germplasm collections are an important strategy for conservation of diversity, a challenge in ecoinformatics. It is common to select a core to represent the genetic diversity of a germplasm collection, aiming to minimize the costs of conservation , while ensuring the maximization of genetic variation. For the problem of finding a core for a germplasm collection , we proposed the use of a constrained multi-objective artificial immune algorithm (MAIS), based on principles of systematic conservation planning (SCP), and incorporating heterozygosity information. Therefore, optimization takes genotypic diversity and variability patterns into account. As a case study, we used Dipteryx alata molecular marker information. We were able to identify within several accessions, the exact entries that should be chosen to preserve species diversity. MAIS presented better performance measure results when compared to NSGA-II. The proposed approach can be used to help construct cores with maximal genetic richness, and also be extended to in situ conservation. As far as we know, this is the first time that an AIS algorithm is applied to the problem of finding a core for a germplasm collection using heterozygosity information as well.","title":"Using Multi-Objective Artificial Immune Systems to Find Core Collections Based on Molecular Markers","id":280320202,"url":"https://www.researchgate.net/publication/280320202_Using_Multi-Objective_Artificial_Immune_Systems_to_Find_Core_Collections_Based_on_Molecular_Markers","names":["Shana Schlottfeldt","Emilia M T Maria","Maria Emilia Telles Walter","Jon Timmis","André C P L F Carvalho","Mariana Pires de Campos Telles"],"references":{"220286112":"Solving Multiobjective Optimization Problems Using an Artificial Immune System","232795602":"Systematic Conservation Planning","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","220151992":"Zarges, C.: Analyzing different variants of immune inspired somatic contiguous hypermutations. Theoretical Computer Science 412(6), 517-533","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","261288744":"Artificial Immune Systems: A New Computational Approach","243973318":"Targeting global conservation funding to limit immediate biodiversity losses","268037541":"Population Structure and Genetic Diversity in a Rice (Oryza sativa L.) Core Collection Population Investigated with SSR Markers","237187774":"Brown AHD. Core collections-a practical approach to genetic resources management. Genome 31: 818-824","266656426":"On the runtime analysis of stochastic ageing mechanisms","37617090":"Does Conservation Planning Matter in a Dynamic and Uncertain World?"},"citedIn":{},"index":838}