{"abs":"This article introduces ME-MLS, an efficient multithreading local search algorithm for solving the multiobjective scheduling problem in heterogeneous computing systems. We consider the minimization of both the makespan and energy consumption objectives. The proposed method follows a fully multiobjective approach, applying a Pareto-based dominance search that is executed in parallel by using several threads. The experimental analysis demonstrates that the new multithreading algorithm outperforms a set of fast and accurate two-phases deterministic heuristics based on the traditional MinMin. The new ME-MLS method is able to achieve significant improvements in both makespan and energy consumption objectives in reduced execution times for a large set of testbed instances, while exhibiting a near linear speedup behavior when using up to 24 threads.","title":"Energy Efficient Scheduling in Heterogeneous Systems with a Parallel Multiobjective Local Search","id":259752374,"url":"https://www.researchgate.net/publication/259752374_Energy_Efficient_Scheduling_in_Heterogeneous_Systems_with_a_Parallel_Multiobjective_Local_Search","names":["Sergio Nesmachnow","Santiago Iturriaga","Bernabe Dorronsoro","Pascal Bouvry","Computing and Informatics"],"references":{"3848888":"Task execution time modeling for heterogeneous computing systems","232398745":"A parallel bi-objective hybrid metaheuristic for energy-aware scheduling for cloud computing systems","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","222510982":"A Comparison of Eleven Static Heuristics for Mapping a Class of Independent Tasks onto Heterogeneous Distributed Computing Systems","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","221140708":"Multiobjective Scheduling on Distributed Heterogeneous Computing and Grid Environments Using a Parallel Micro-CHC Evolutionary Algorithm","225165281":"Parallel Memetic Algorithms for Independent Job Scheduling in Computational Grids","221186789":"Comparison of Heuristics for Scheduling Independent Tasks on Heterogeneous Distributed Environments","254017769":"Time analysis of standard evolutionary algorithms as software programs","236209988":"Hierarchical genetic-based grid scheduling with energy optimization","3940394":"Scheduling with dynamic voltage/speed adjustment using slack reclamation in multi-processor real-time systems","220867378":"A New Local Search Algorithm for the DNA Fragment Assembly Problem","222417496":"A revisit of fast greedy heuristics for mapping a class of independent tasks onto heterogeneous computing systems","220176005":"Heterogeneous computing scheduling with evolutionary algorithms","236627333":"A two-phase heuristic for the energy-efficient scheduling of independent tasks on computational grids","220293764":"Dynamic Resource Management in Energy Constrained Heterogeneous Computing Systems Using Voltage Scaling","220716558":"A Multi-objective GRASP Algorithm for Joint Optimization of Energy Consumption and Schedule Length of Precedence-Constrained Applications","257650162":"Computers and Intractability","224208556":"Energy Conscious Scheduling for Distributed Computing Systems under Different Operating Conditions","220199980":"A parallel micro evolutionary algorithm for heterogeneous computing and grid scheduling","220940959":"Minimizing Energy Consumption for Precedence-Constrained Applications Using Dynamic Voltage Scaling","224315498":"Ahmad, I.: A Cooperative Game Theoretical Technique for Joint Optimization of Energy Consumption and Response Time in Computational Grids. IEEE Transactions on Parallel and Distributed Systems 20(3), 346-360","257252000":"Solving very large instances of the scheduling of independent tasks problem on the GPU","220941330":"Power Aware Scheduling of Bag-of-Tasks Applications with Deadline Constraints on DVS-enabled Clusters","221040977":"A Heuristic Energy-aware Scheduling Algorithm for Heterogeneous Clusters","220358495":"Comparison and analysis of eight scheduling heuristics for the optimization of energy consumption and makespan in large-scale distributed systems","242545161":"The Grid: Blueprint for New Computing Infrastructure","215877153":"Mersenne Twister: A 623-dimensionally equidistributed uniform pseudorandom number generator"},"citedIn":{"286705348":"Controlling datacenter power consumption while maintaining temperature and QoS levels","280643080":"Online Bi-Objective Scheduling for IaaS Clouds Ensuring Quality of Service","280641150":"Online Bi-Objective Scheduling for IaaS Clouds Ensuring Quality of Service","264555362":"Energy-Aware Online Scheduling: Ensuring Quality of Service for IaaS Clouds","264555443":"Bi-Objective Online Scheduling with Quality of Service for IaaS Clouds","259480617":"AEDB Protocol Tuning with a Fast Efficient Parallel Multi-Objective Local Search","265129858":"A Hierarchical Approach for Energy-efficient Scheduling of Large Workloads in Multicore Distributed Systems","289120596":"Multiobjective energy-aware datacenter planning accounting for power consumption profiles"},"index":842}