{"abs":"Multiobjective (MO) optimization is an emerging field which is increasingly being encountered in many fields globally. Various metaheuristic techniques such as differential evolution (DE), genetic algorithm (GA), gravitational search algorithm (GSA), and particle swarm optimization (PSO) have been used in conjunction with scalarization techniques such as weighted sum approach and the normal-boundary intersection (NBI) method to solve MO problems. Nevertheless, many challenges still arise especially when dealing with problems with multiple objectives (especially in cases more than two). In addition, problems with extensive computational overhead emerge when dealing with hybrid algorithms. This paper discusses these issues by proposing an alternative framework that utilizes algorithmic concepts related to the problem structure for generating efficient and effective algorithms. This paper proposes a framework to generate new high-performance algorithms with minimal computational overhead for MO optimization.","title":"An Algorithmic Framework for Multiobjective Optimization","id":259957632,"url":"https://www.researchgate.net/publication/259957632_An_Algorithmic_Framework_for_Multiobjective_Optimization","names":["Timothy Ganesan","Irraivan Elamvazuthi","ku zilati ku shaari","P Vasant","The Scientific World Journal"],"references":{"28601013":"An efficient multi-objective optimization algorithm based on swarm intelligence for engineering design. Eng Optim","223066575":"A feature-based approach to injection mould cooling system design","221228586":"Evolutionary Multi-objective Environmental/Economic Dispatch: Stochastic Versus Deterministic Approaches","274735205":"Multiobjective Optimal Power Flow Using Hybrid Evolutionary Algorithm","266476645":"Additive utilities with incomplete product set: applications to priorities and assignements","2836771":"Strategies for Finding Good Local Guides in Multi-objective Particle Swarm Optimization (MSPSO)","263734962":"Zhang Q. and Mahfouf M.: ‘A nature-inspired multi-objective optimisation strategy based on a new reduced space searching algorithm for the design of alloy steels’, Eng. Appl. Artif. Intell.","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220118677":"Optimization by Simulated Annealing","201168883":"Additive Utilities with Incomplete Product Sets: Application to Priorities and Assignments","223297887":"Evaluation of wet air oxidation as a pretreatment strategy for bioethanol production from rice husk and process optimization. Biomass Bioenergy","220418354":"An Interactive Fuzzy Satisficing Method for Multiobjective Nonlinear Integer Programming Problems with Block-Angular Structures through Genetic Algorithms with Decomposition Procedures","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","238652069":"Adaptation in Natural and Artificial Systems: An Introductory Analysis with Applications to Biology, Control and AI","220888328":"Optimization of Non-Linear Chemical Processes using Modified Differential Evolution.","264276708":"Optimization and Synthesis of Heat Integrated Distillation Systems Using Differential Evolution","2460803":"Normal-Boundary Intersection: A New Method for Generating the Pareto Surface in Nonlinear Multicriteria Optimization Problems","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","222574063":"Abido, M.A.: A Novel Multiobjective Evolutionary Algorithm for Environmental / Economic Power Dispatch. Electric Power Systems Research 65(1), 71-81","236177855":"Adaption in Natural and Artificial Systems: An Introductory Analysis with Applications to Biology, Control and AI","221563162":"Evolutionary Multiobjective Design targeting a Field Programmable Transistor Array.","222909287":"Multiobjective optimization of synthesis gas production using non-dominated sorting genetic algorithm","275876959":"Comparative Performance of Gravitational Search Algorithm and Modified Particle Swarm Optimization Algorithm for Synthesis of Thinned Scanned Concentric Ring Array Antenna","32898651":"A multi-objective genetic algorithm for the design of\npressure swing adsorption","246648860":"Differential Evolution: A Simple and Efficient Adaptive Scheme for Global Optimization Over Continuous Spaces","225609287":"Managing approximation models in multiobjective optimization","228775060":"Optimization of an HVAC system with a strength multi-objective particle-swarm algorithm","255817608":"Multiobjective Optimization of Steam Reformer Performance Using Genetic Algorithm","3270536":"Multiobjective Control of Power Plants Using Particle Swarm Optimization Techniques","3418509":"Macready, W.G.: No Free Lunch Theorems for Optimization. IEEE Transactions on Evolutionary Computation 1(1), 67-82","4017030":"Strategies for finding local guides in multi-objective particle swarm optimization (MOPSO)","231390454":"Multiobjective Optimization of Industrial Autothermal Reformer for Syngas Production Using Nonsorting Genetic Algorithm II","216457304":"Lecture Notes in Computer Science","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","238002155":"A nonlinear regression based multi-objective optimization of parameters based on experimental data from an IC engine fueled with biodiesel blends","248464395":"Multicriteria optimization and engineering","281266055":"No Free Lunch Theorems for Optimization","245365978":"An Interactive Multistage ɛ-Inequality Constraint Method For Multiple Objectives Decision Making","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","254029666":"Evolutionary normal-boundary intersection (ENBI) method for multi-objective optimization of green sand mould system","216457263":"Lecture Notes in Computer Science","266355242":"Solving Economic Emissions Load Dispatch problem by using Hybrid ACO-MSM approach","38077704":"Multiobjective Optimization of Temporal Processes","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","51252958":"Multi-objective optimization of bioethanol production during cold enzyme starch hydrolysis in very high gravity cassava mash","220095949":"Optimization of nonlinear geological structure mapping using hybrid neuro-genetic techniques","3949545":"On metrics for comparing nondominated sets","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","220341243":"Multi-objective optimization of an industrial fluidized-bed catalytic cracking unit (FCCU) using two jumping gene adaptations of simulated annealing","224325767":"Analysis of the pareto front of a multi-objective optimization problem for a fossil fuel power plant","3623274":"Particle swarm Optimization","225593132":"Mechanical Component Design for Multiple Ojectives Using Elitist Non-dominated Sorting GA","216301189":"A Critical Survey of Performance Indices for Multi-Objective Optimisation","220249665":"Hybrid Tabu Search Hopfield Recurrent ANN Fuzzy Technique to the Production Planning Problems: A Case Study of Crude Oil in Refinery Industry.","216300934":"On metrics for comparing non-dominated sets","267791122":"Differential Evolution for the Optimal Design of Heat Exchangers","257435453":"Hybrid neuro-swarm optimization approach for design of distributed generation power systems","201976815":"Genetic Algorithms \u0026 Engineering Design","45904981":"Cuckoo Search via Levy Flights","228572273":"Performance metrics for multiobjective optimization evolutionary algorithms","258159757":"Evolutionary Multi-Criterion Optimization","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","224181933":"A study of particle swarm technique for renewable energy power systems","222541105":"Multiobjective optimization with economic and environmental objective functions using Modified Simulated Annealing","275998853":"Hybrid Tabu Search Hopfield Recurrent ANN Fuzzy Technique to the Production Planning Problems","265891488":"Multi objective economic dispatch using Pareto frontier differential evolution’","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","222853813":"GSA: a Gravitational Search Algorithm"},"citedIn":{"277348719":"Game-theoretic differential evolution for multiobjective optimization of green sand mould system","289994303":"On the performance of accelerated particle swarm optimization for charging plug-in hybrid electric vehicles","288357847":"Multiobjective Optimization of Bioactive Compound Extraction Process via Evolutionary Strategies","282220207":"A multi-criteria approach for nurse scheduling fuzzy simulated metamorphosis algorithm approach","279270427":"A comprehensive solution for continuous casting production planning and scheduling"},"index":844}