{"abs":"In recent years, indicator-based evolutionary algorithms, allowing to implicitly incorporate user preferences into the search, have become widely used in practice to solve multiobjective optimization problems. When using this type of methods, the optimization goal changes from optimizing a set of objective functions simultaneously to the single-objective optimization goal of finding a set of points that maximizes the underlying indicator. Understanding the difference between these two optimization goals is fundamental when applying indicator-based algorithms in practice. On the one hand, a characterization of the inherent optimization goal of different indicators allows the user to choose the indicator that meets her preferences. On the other hand, knowledge about the sets of points with optimal indicator values–the so-called optimal -distributions–can be used in performance assessment whenever the indicator is used as a performance criterion. However, theoretical studies on indicator-based optimization are sparse.","title":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications","id":222889399,"url":"https://www.researchgate.net/publication/222889399_Hypervolume-based_Multiobjective_Optimization_Theoretical_Foundations_and_Practical_Implications","names":["Anne Auger","Johannes Bader","Dimo Brockhoff","Eckart Zitzler","Theoretical Computer Science"],"references":{"220741544":"Reference Point Based Multi-Objective Optimization Using Evolutionary Algorithms","3949503":"Scalable multi-objective optimization test problems","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","225109103":"Finding Knees in Multi-objective Optimization","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","216457248":"The maximum hypervolume set yields near-optimal approximation","4201415":"Evolutionary many-objective optimisation: Many once or one many?","226733706":"On characterizing the “knee” of the Pareto curve based on Normal-Boundary Intersection","216457263":"Lecture Notes in Computer Science","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","265669829":"Elements of mathematics. General topology. Chapters 5-10. Transl. from the French. 2nd printing","221228479":"The Measure of Pareto Optima.","220701493":"Evaluating the CMA Evolution Strategy on Multimodal Test Functions","226681552":"An Adaptive Divide-and-Conquer Methodology for Evolutionary Multi-criterion Optimisation","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","3949545":"On metrics for comparing nondominated sets","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","215542657":"Multi-objective topology optimization using evolutionary algorithms","47843204":"Multiplicative Approximations and the Hypervolume Indicator","216300868":"Scalable Test Problems for Evolutionary Multi-Objective Optimization","216300934":"On metrics for comparing non-dominated sets","220743243":"G-Metric: an M-ary quality indicator for the evaluation of non-dominated sets","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","262405508":"On Set-Based Multiobjective Optimization","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","224579855":"On the Complexity of Computing the Hypervolume Indicator","216457303":"Indicator-Based Selection in Multiobjective Search","284004639":"Lecture Notes in Computer Science","28358342":"Gradient-based/Evolutionary Relay Hybrid for Computing Pareto Front Approximations Maximizing the S-Metric","216457232":"Investigating and Exploiting the Bias of the Weighted Hypervolume to Articulate User Preferences","47750112":"Lecture Notes in Computer Science","221228373":"Evolutionary Multi-objective Optimization for Simultaneous Generation of Signal-Type and Symbol-Type Representations","246047825":"Elements of Mathematics: General Topology","216301279":"On the Evolutionary Optimisation of Many Objectives","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","216457304":"Lecture Notes in Computer Science","216457240":"Effects of 1-Greedy S-Metric-Selection on Innumerably Large Pareto Fronts","4074752":"Bounded archiving using the Lebesgue measure","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"268821509":"Feedback-control operators for improved Pareto-set description: Application to a polymer extrusion process","269998677":"Aggregation Trees for visualization and dimension reduction in many-objective optimization","270961698":"On using the hypervolume indicator to compare Pareto fronts: Applications to multi-criteria optimal experimental design","262292324":"Population size matters: Rigorous runtime results for maximizing the hypervolume indicator","266653730":"On set-based local search for multiobjective combinatorial optimization","261054212":"Regularized hypervolume selection for robust portfolio optimization in dynamic environments","273910879":"A dual-population paradigm for evolutionary multiobjective optimization","275551329":"Beam Search for integer multi-objective optimization","225624893":"Optimal k-Level Planarization and Crossing Minimization","288827687":"Multiobjective evolutionary algorithm based on multimethod with dynamic resources allocation","273128597":"Polymer: A Model-Driven Approach for Simpler, Safer, and Evolutive Multi-Objective Optimization Development","265330819":"EVOLVE – A bridge between probability, set oriented numerics, and evolutionary computation III. Selected papers based on the presentations at the international conference, Mexico City, Mexico, August 7–9, 2012","276175392":"A Many-Objective Evolutionary Algorithm With Enhanced Mating and Environmental Selections","272037344":"Bi-objective hypervolume-based Pareto optimization","267871584":"An Efficient Chemical Reaction Optimization Algorithm for Multiobjective Optimization","280089837":"Algorithme Évolutionnaire Multimodal pour la Recherche d\u0027Images par le Contenu","282195249":"Preference Articulation by Means of the R2 Indicator","278619582":"A Correlation Analysis of Set Quality Indicator Values in Multiobjective Optimization","257313203":"MOMCMC: An efficient Monte Carlo method for multi-objective sampling over real parameter space","284013192":"New version of a multi-algorithm genetically adaptive for multiobjective optimization","254462273":"On the Properties of the R2 Indicator","235709863":"Automatically Improving the Anytime Behaviour of Optimisation Algorithms","263586138":"R 2 Indicator-Based Multiobjective Search","280851276":"Optimal μ-Distributions for the Hypervolume Indicator for Problems With Linear Bi-Objective Fronts: Exact and Exhaustive Results","266658262":"On the visualization of trade-offs and reducibility in many-objective optimization","272891057":"Quantifying uncertainty on Pareto fronts with Gaussian Process conditional simulations","288838659":"Enhanced Version of Multi-algorithm Genetically Adaptive for Multiobjective optimization","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","47750112":"Lecture Notes in Computer Science","237009117":"Time Complexity and Zeros of the Hypervolume Indicator Gradient Field"},"index":846}