{"abs":"Balancing convergence and diversity plays a key role in evolutionary multiobjective optimization (EMO). Most current EMO algorithms perform well on problems with two or three objectives, but encounter difficulties in their scalability to many-objective optimization. This paper proposes a grid-based evolutionary algorithm (GrEA) to solve many-objective optimization problems. Our aim is to exploit the potential of the grid-based approach to strengthen the selection pressure towards the optimal direction while maintaining an extensive and uniform distribution among solutions. To this end, two concepts—grid dominance and grid difference—are introduced to determine the mutual relationship of individuals in a grid environment. Three grid-based criteria, i.e., grid ranking, grid crowding distance, and grid coordinate point distance, are incorporated into the fitness of individuals to distinguish them in both the mating and environmental selection processes. Moreover, a fitness adjustment strategy is developed by adaptively punishing individuals based on the neighborhood and grid dominance relations in order to avoid partial overcrowding as well as guide the search towards different directions in the archive. Six state-of-the-art EMO algorithms are selected as the peer algorithms to validate GrEA. A series of extensive experiments is conducted on 52 instances of nine test problems taken from three test suites. The experimental results show the effectiveness and competitiveness of the proposed GrEA in balancing convergence and diversity. The solution set obtained by GrEA can achieve a better coverage of the Pareto front than that obtained by other algorithms on most of the tested problems. Additionally, a parametric study reveals interesting insights of the division parameter in a grid and also indicates useful values for problems with different characteristics.","title":"A Grid-Based Evolutionary Algorithm for Many-Objective Optimization","id":253348620,"url":"https://www.researchgate.net/publication/253348620_A_Grid-Based_Evolutionary_Algorithm_for_Many-Objective_Optimization","names":["Shengxiang Yang","Miqing Li","Xiaohui Liu","Jinhua Zheng","IEEE Transactions on Evolutionary Computation"],"references":{"243534212":"How to Solve It: Modern Heuristics","224207966":"Diversity Management in Evolutionary Many-Objective Optimization","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","220381221":"A Pareto Corner Search Evolutionary Algorithm and Dimensionality Reduction in Many-Objective Optimization Problems.","4201415":"Evolutionary many-objective optimisation: Many once or one many?","28358328":"Lecture Notes in Computer Science","221228454":"Substitute Distance Assignments in NSGA-II for Handling Many-objective Optimization Problems","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","235701505":"Distance Based Ranking in Many-Objective Particle Swarm Optimization","220740664":"A grid-based fitness strategy for evolutionary many-objective optimization","221228478":"Adaptive Objective Space Partitioning Using Conflict Information for Many-Objective Optimization.","220702002":"Enhancing Diversity for Average Ranking Method in Evolutionary Many-Objective Optimization","2811965":"Guidance in Evolutionary Multi-Objective Optimization","51692937":"Diagnostic Assessment of Search Controls and Failure Modes in Many-Objective Evolutionary Optimization","220741943":"Study of preference relations in many-objective optimization","216300612":"Many-Objective Optimization: An Engineering Design Perspective","220743049":"Many-objective directed evolutionary line search","224516803":"On the Effects of Adding Objectives to Plateau Functions","220691075":"How to solve it - modern heuristics: second, revised and extended edition (2. ed.).","224311929":"Effective Evolutionary Algorithms for Many-Specifications Attainment: Application to Air Traffic Control Tracking Filters","220702222":"Lecture Notes in Computer Science","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","215571828":"Visualisation and Ordering of Many-objective Populations","221228545":"Visualization and Data Mining of Pareto Solutions Using Self-Organizing Map","3418906":"An Investigation on Preference Order Ranking Scheme for Multiobjective Evolutionary Optimization","216457303":"Indicator-Based Selection in Multiobjective Search","246389917":"How entropy-theorems can show that approximating high-dim Pareto-fronts is too hard","224086888":"Evolutionary many-objective optimization by NSGA-II and MOEA/D with large populations","221228572":"Quantifying the Effects of Objective Space Dimension in Evolutionary Multiobjective Optimization","3412352":"A Fuzzy Definition of “Optimality” for Many-Criteria Optimization Problems","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","224330083":"Evolutionary Many-Objective Optimization: A Short Review","216301146":"Lecture Notes in Computer Science","3904004":"Failure of Pareto-based MOEAs: Does non-dominated really mean near to optimal?","220740073":"A many-objective test problem for visually examining diversity maintenance behavior in a decision space","221228397":"Robust Multi-Objective Optimization in High Dimensional Spaces","224177694":"Two novel approaches for many-objective optimization","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","260621901":"Objective Reduction in Many-Objective Optimization: Linear and Nonlinear Algorithms","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","224182548":"On the Influence of the Number of Objectives on the Hardness of a Multiobjective Optimization Problem","228655721":"Managing population and drought risks using many-objective water portfolio planning under uncertainty","3418750":"Dynamic multiobjective evolutionary algorithm: Adaptive cell-based rank and density estimation","221228515":"Spread Assessment for Evolutionary Multi-Objective Optimization","220953703":"Improving service of access on a logistics platform","224133138":"A Territory Defining Multiobjective Evolutionary Algorithms and Preference Incorporation","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","224570930":"A systems approach to evolutionary multiobjective structural optimization and beyond","221228415":"Lecture Notes in Computer Science","220742395":"Space partitioning with adaptive ε-ranking and substitute distance assignments: A comparative study on many-objective MNK-landscapes","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","221228409":"Combining Aggregation with Pareto Optimization: A Case Study in Evolutionary Molecular Design","220742910":"Improved S-CDAs using crossover controlling the number of crossed genes for many-objective optimization.","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","215542657":"Multi-objective topology optimization using evolutionary algorithms","3418862":"A faster algorithm for calculating hypervolume","224214406":"A Pareto Corner Search Evolutionary Algorithm and Dimensionality Reduction in Many-Objective Optimization Problems","220743285":"Using a distance metric to guide PSO algorithms for many-objective optimization","224301952":"Dynamic resizing for grid-based archiving in evolutionary multi objective optimization","224301953":"Ranking-Dominance and Many-Objective Optimization","45868377":"Techniques for Highly Multiobjective Optimisation: Some Nondominated Points are Better than Others","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","220381124":"Effective Evolutionary Algorithms for Many-Specifications Attainment: Application to Air Traffic Control Tracking Filters.","4074711":"Multiple single objective Pareto sampling","220701896":"Many-Objective Test Problems to Visually Examine the Behavior of Multiobjective Evolution in a Decision Space","23249682":"A New Evolutionary Algorithm for Solving Many-Objective Optimization Problems","226333967":"Objective Space Partitioning Using Conflict Information for Many-Objective Optimization","225141790":"Framework for Many-Objective Test Problems with Both Simple and Complicated Pareto-Set Shapes","226622839":"Performance Scaling of Multi-objective Evolutionary Algorithms","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","220113382":"Convergence analysis of a self-adaptive multi-objective evolutionary algorithm based on grids","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","5826087":"Pareto-adaptive ε-dominance"},"citedIn":{"269275405":"A Knee Point Driven Evolutionary Algorithm for Many-Objective Optimization","265021130":"A test problem for visual investigation of high-dimensional multi-objective search","261520468":"Diversity Comparison of Pareto Front Approximations in Many-Objective Optimization","289825861":"A Reference Vector Guided Evolutionary Algorithm for Many-Objective Optimization","273296140":"An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition","282627166":"A clustering-ranking method for many-objective optimization","280151668":"A comparative study of many-objective evolutionary algorithms for the discovery of software architectures","282530911":"Many-Objective Evolutionary Algorithms","280534066":"Bi-goal evolution for many-objective optimization problems","281980165":"Many-objective optimization integrating open angle based congestion control strategy","286412505":"Ensemble of many-objective evolutionary algorithms for many-objective problems","253359061":"Shift-Based Density Estimation for Pareto-Based Algorithms in Many-Objective Optimization","274729969":"Constraints on New Gravitylike Forces in the Nanometer Range","274263562":"Behavior of Multiobjective Evolutionary Algorithms on Many-Objective Knapsack Problems","285673109":"Multi-objective optimisation for regression testing","257888652":"Evolutionary Algorithms With Segment-Based Search for Multiobjective Optimization Problems","287972729":"On the use of many quality attributes for software refactoring: a many-objective search-based software engineering approach","273918342":"Sets evolution-based particle swarm optimization for many-objective problems","276175392":"A Many-Objective Evolutionary Algorithm With Enhanced Mating and Environmental Selections","237094200":"ETEA: A Euclidean Minimum Spanning Tree-Based Evolutionary Algorithm for Multi-Objective Optimization","280534179":"A Performance Comparison Indicator for Pareto Front Approximations in Many-Objective Optimization","261447374":"Set-based genetic algorithms for solving many-objective optimization problems","284719460":"Pareto or Non-Pareto: Bi-Criterion Evolution in Multi-Objective Optimization","276123563":"Novel prediction and memory strategies for dynamic multiobjective optimization","272328027":"Reformulating Branch Coverage as a Many-Objective Optimization Problem","280063760":"MOEA/VAN: Multiobjective Evolutionary Algorithm Based on Vector Angle Neighborhood","282584756":"A Study on Many-Objective Optimization Using the Kriging-Surrogate-Based Evolutionary Algorithm Maximizing Expected Hypervolume Improvement","261040107":"Single Objective Guided Multiobjective Optimization Algorithm","267982364":"An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition","265021421":"A Comparative Study on Evolutionary Algorithms for Many-Objective Optimization","276377424":"An analysis of parameter sensitivities of preference-inspired co-evolutionary algorithms","287406344":"Modified Distance Calculation in Generational Distance and Inverted Generational Distance","282544702":"An objective reduction algorithm using representative Pareto solution search for many-objective optimization problems","290852708":"Difficulties in specifying reference points to calculate the inverted generational distance for many-objective optimization problems","278711337":"Lecture Notes in Computer Science","277605171":"An Algorithm for Many-Objective Optimization With Reduced Objective Computations: A Study in Differential Evolution","264641919":"Evolutionary Path Control Strategy for Solving Many-Objective Optimization Problem","276832697":"An adaptive evolutionary algorithm for optimizing process planning of parallel drilling operations","265021232":"IPESA-II: Improved Pareto Envelope-Based Selection Algorithm II","263469071":"On the Performance of Multiple Objective Evolutionary Algorithms for Software Architecture Discovery","261054003":"Ranking many-objective Evolutionary Algorithms using performance metrics ensemble","271002970":"Multiobjective optimization algorithm with objective-wise learning for continuous multiobjective problems","281887155":"Evolutionary algorithm based on information separation for Many-Objective optimization","282528680":"Decomposition-based multi-objective evolutionary algorithm for vehicle routing problem with stochastic demands","283905875":"Many-objective optimization based on information separation and neighbor punishment selection"},"index":847}