{"abs":"► An enhanced DE variant (MODEA) is proposed for solving multi-objective optimization problems (MOPs). ► It is a fusion of opposition based learning, random localization and a single population DE structure. ► MODEA introduces a new selection mechanism for generating a well distributed Pareto optimal front. ► The efficiency of MODEA is validated on a set of 9 bi-objective and 5 tri-objective problems. ► Modifications/enhancements embedded in DE provides an efficient mechanism for solving MOPs.","title":"An efficient Differential Evolution based algorithm for solving multi-objective optimization problems.","id":220288943,"url":"https://www.researchgate.net/publication/220288943_An_efficient_Differential_Evolution_based_algorithm_for_solving_multi-objective_optimization_problems","names":["Musrrat Ali","Patrick Siarry","Millie Pant"],"references":{"4242497":"Opposition-Based Learning: A New Scheme for Machine Intelligence","221228524":"DEMO: Differential Evolution for Multiobjective Optimization","220176795":"Multi-objective self-adaptive differential evolution with elitist archive and crowding entropy-based diversity measure. Soft Comput Fusion Found Method Appl","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","222402442":"Ali, M.M.: A numerical study of some modified differential evolution algorithms. Eur. J. Oper. Res. 169, 1176-1184","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","4939867":"Omni-optimizer: A generic evolutionary algorithm for single and multi-objective optimization","26850953":"Multi-Objective Differential Evolution Algorithm for Solving Engineering Problems","220742329":"Incorporating directional information within a differential evolution algorithm for multiobjective optimization","3949353":"Multiobjective optimization using a Pareto differential evolution approach","235838553":"A comparative study of various meta-heuristic techniques applied to the multilevel thresholding problem","2478141":"The Self-Adaptive Pareto Differential Evolution","220119492":"Image thresholding based on Pareto multiobjective optimization","2239800":"On Measuring Multiobjective Evolutionary Algorithm Performance","220702076":"A Multiobjective Differential Evolution Based on Decomposition for Multiobjective Optimization with Variable Linkages","216300868":"Scalable Test Problems for Evolutionary Multi-Objective Optimization","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","234802779":"Coello, C.A.C.: An updated survey of GA-based multi-objective optimization techniques. ACM Computing Surveys 32(2), 109-143","223684848":"Adaptive differential evolution algorithm for multiobjective optimization problems","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","262405508":"On Set-Based Multiobjective Optimization","4090135":"A comparative study of differential evolution, particle swarm optimization, and evolutionary algorithms on numerical benchmark problems, Evolutionary Computation CEC 2004. Congress on, vol 2. IEEE","221007493":"MODE-LD+SS: A novel Differential Evolution algorithm incorporating local dominance and scalar selection mechanisms for multi-objective optimization","221494233":"A Novel Opposition-Based Multi-objective Differential Evolution Algorithm for Multi-objective Optimization","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","46491882":"An improved multiobjective differential evolution based on Pareto-adaptive -dominance and orthogonal design","3904009":"PDE: A Pareto-frontier differential evolution approach for multi-objective optimization problems","3419015":"Opposition-based differential evolution. IEEE Trans Evol Comput","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","232644522":"A Modified Differential Evolution Algorithm and Its Application to Engineering Problems","227201202":"Multi-Criteria Decision Making","4074951":"Pareto-based multi-objective differential evolution","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","220403416":"A study on the use of non-parametric tests for analyzing the evolutionary algorithms\u0027 behaviour: A case study on the CEC\u00272005 Special Session on Real Parameter Optimization","220045346":"An Empirical Study of Evolutionary Techniques for Multiobjective Optimization in Engineering Design"},"citedIn":{"287125711":"Analysis of mutation vectors selection mechanism in differential evolution","239944377":"Multiobjective Optimization Design of a Fractional Order PID Controller for a Gun Control System","287799326":"Multi-objective Allocation of Multi-type Distributed Generators along Distribution Networks Using Backtracking Search Algorithm and Fuzzy Expert Rules","286254101":"Differential Evolution for Data Envelopment Analysis"},"index":851}