{"abs":"It is shown that Gibbs sampling, making systematic use of an adaptive rejection algorithm proposed by Gilks and Wild, provides a straightforward computational procedure for Bayesian inferences in a wide class of generalized linear and proportional hazards models.","title":"Bayesian Inference for Generalized Linear and Proportional Hazards Models via Gibbs Sampling","id":265672532,"url":"https://www.researchgate.net/publication/265672532_Bayesian_Inference_for_Generalized_Linear_and_Proportional_Hazards_Models_via_Gibbs_Sampling","names":["Petros Dellaportas","A.F.M. Smith","Journal of the Royal Statistical Society Series C Applied Statistics"],"references":{"254287149":"Generalized Linear Models With Random Effects; A Gibbs Sampling Approach","268490386":"Applications of a Method for the Efficient Computation of Posterior Distributions”, Applied Statistics, 31, 214-225","258437108":"Applications of Bayesian Software: Two Examples","238309671":"Regression Models and Life-Tables (With Discussion)","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","225304570":"Non-Uniform Random Variate Generation","21481501":"Scheduling of revaccination against hepatitis B virus","268849693":"Bayesian estimation of Poisson means using a hierarchical log-linear model","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","38358230":"Maximum Likelihood Estimates in Exponential Response Models","245865479":"Density Estimation for Statistics and Data Analysis, Chapman and Hall, New York","38359144":"Consistency and Asymptotic Normality of the Maximum Likelihood Estimator in Generalized Linear Models","235961592":"Generalised Linear Model","235361263":"Bayesian Statistics Without Tears: A Sampling-Resampling Perspective","242383515":"The Fitting of Exponential, Weibull and Extreme Value Distributions to Complex Censored Survival Data Using GLIM","19923545":"Incorporating Prior Information into the Analysis of Contingency Tables","235013231":"Bayesian Analysis of Constrained Parameter and Truncated Data Problems","258437000":"A Bayesian Approach to the Analysis of LD50 Experiments","224910613":"Adaptive Rejection Sampling for Gibbs Sampling","265429604":"Stochastic Simulation","271760261":"Progress with Numerical and Graphical Methods for Practical Bayesian Statistics","263072663":"Generalized Linear Model","244464104":"Hierarchical Bayesian Analysis of Change Point Problems","239059908":"Bayesian Methods in Practice: Experiences in the Pharmaceutical Industry","239540024":"On the Existence and Uniqueness of the Maximum Likelihood Estimates for Certain Generalized Linear Models","243689785":"Illustration of Bayesian Inference in Normal Data Models Using Gibbs Sampling"},"citedIn":{"268649728":"Dirichlet Process Mixed Generalized Linear Models","228392607":"Principal Applications of Bayesian Methods in Actuarial Science","267566582":"Control Variates for Estimation Based on Reversible MCMC Samplers","290017357":"Semiparametric PK/PD Models","224881763":"Bayesian Constrained Variable Selection","252614667":"Semiparametric Bayesian Decision Models for Optimal Replacement","229809333":"Bayesian Survival Analysis","38348609":"MCMC convergence diagnosis via multivariate bounds on log-concave densities","231891928":"The Middle Ages Through Modern Eyes. A Historical Problem The Prothero Lecture","4746051":"Predictive Variable Selection in Generalized Linear Models","224367953":"A hybrid systems model for supervisory cognitive state identification and estimation in neural prosthetics","262872997":"Semiparametric errors-in-variables models A Bayesian approach","49109503":"Estadística actuarial : teoría y aplicaciones / J.M. Sarabia Alegría, E. Gómez Déniz, F.J. Vázquez Polo.","220286515":"On Bayesian model and variable selection using MCMC","222621014":"A latent class selection model for nonignorably missing data","41910119":"Outlier detection for a hierarchical Bayes model in a study of hospital variation in surgical procedures","279356093":"Generalized Linear Models","238879773":"Approximate Predetermined Convergence Properties of the Gibbs Sampler","27403139":"Modeling and analysis of multiple-event survival data","15696846":"Regression Analyses of Counts and Rates: Poisson, Overdispersed Poisson, and Negative Binomial Models","227621552":"Incorporating heterogeneous intercourse records into time to pregnancy models","226713254":"Accelerating Monte Carlo Markov Chain Convergence for Cumulative-Link Generalized Linear Models","239329380":"A New Perspective on Priors for Generalized Linear Models","11205506":"Modeling the Effects of Genetic Factors on Late-Onset Diseases in Cohort Studies","12214163":"Evidence-based medicine as Bayesian decision-making","264958949":"Regression: Models, Methods and Applications","224712532":"Learning Hybrid System Models for Supervisory Decoding of Discrete State, with applications to the Parietal Reach Region","271689985":"Infinite Estimates with Fractional Factorial Experiments","247562481":"A Bayesian Population Model With Hierarchical Mixture Priors Applied to Blood Count Data","2690075":"A Bayesian Weibull Survival Model","259926092":"Direct Sampling","4743807":"Statistical Interpretation of Species Composition","47343338":"Practical Use of MCMC Methods: Lessons from a Case Study","15445456":"Problems and prediction in survival data","223006326":"Auxiliary mixture sampling with applications to logistic models","41483077":"Inference in hybrid systems with applications in neural prosthetics","242997573":"Geostatistical modelling for spatial interaction data with application to postal service performance","226490433":"Calculation of marginal densities for parameters of multinomial distributions","2286432":"Bayesian Modelling of Outstanding Liabilities Incorporating Claim Count Uncertainty","227610068":"Assessment of mortgage default risk via Bayesian reliability models","222493956":"Overdispersed generalized linear models","228975331":"Bayesian classification methods","26899677":"Reliability characterization and prediction of high k dielectric thin film","4742159":"Likelihood Subgradient Densities","254778981":"BAYESIAN ANALYSIS OF CORRELATED PROPORTIONS","242530111":"Bayesian Analysis of Binary and Polychotomous Response Data","243766743":"A Language and Program for Complex Bayesian Modelling","50903128":"Fitting Bayesian multiple random effects models","228925940":"Output Assessment for Monte Carlo Simulations via the Score Statistic","23524151":"Acquisition, Insolvency and Managers in UK Small Companies","227519453":"Design of follow‐up experiments for improving model discrimination and parameter estimation","23511602":"Spatial Econometric Issues for Bio-Economic and Land-Use Modeling","222150245":"Noninformative priors for one-parameter item response models","225324855":"Bayesian Methods for Contingency Tables using Gibbs Sampling.","45863906":"Notes on Using Control Variates for Estimation with Reversible MCMC Samplers","6415162":"Bayesian generalized monotonic functional mixed models for the effects of radiation dose histograms on normal tissue complications","15198598":"Abrams K, Ashby D, Errington D: Simple Bayesian analysis in clinical trials: A tutorial","254330954":"Bayesian Binomial Regression: Predicting Survival at a Trauma Center","2277961":"Markov Chain Monte Carlo Methods in Biostatistics","4993312":"Model determination for categorical data with factor level merging","4747303":"Bayesian analysis of mortality data","223053371":"Mixtures of Dirichlet process priors for variable selection in survival analysis","224910614":"Adaptive Rejection Metropolis Sampling Within Gibbs Sampling","12019909":"Hierarchical Proportional Hazards Regression Models for Highly Stratified Data","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","257099556":"Discussion","228383201":"Bayesian computational methods in biomedical research","283835799":"Insider threats in a financial institution: Analysis of attack-proneness of information systems applications","254287784":"Using Historical Controls to Adjust for Covariates in Trend Tests for Binary Data","259119089":"Bayesian binary regression with exponential power link","3318455":"A peak preserving algorithm for the removal of colored noise from signals","226405880":"Random variate transformations in the Gibbs sampler: issues of efficiency and convergence","7440123":"A Semi-parametric Bayesian Analysis of Survival Data Based on Lévy-driven Processes","5867735":"A false-discovery-rate-based loss framework for selection of interactions","235933598":"Nonparametric survival regression using the beta-Stacy process","4914136":"Gibbs Sampling for Bayesian Non-Conjugate and Hierarchical Models by Using Auxiliary Variables","2453431":"A Sequential Particle Filter Method for Static Models","10747954":"Bayesian Meta‐analysis for Longitudinal Data Models Using Multivariate Mixture Priors","6353654":"Flexible parametric models for random-effects distributions","2469309":"Semiparametric generalized linear models: Bayesian approaches","227564041":"Simulation‐Based Bayesian Econometric Inference: Principles and Some Recent Computational Advances","2678454":"Bayesian Tests And Model Diagnostics In Conditionally Independent Hierarchical Models","277795885":"Bayesian Analysis of Semiparametric Proportional Hazards Models","13882736":"Accounting for Pregnancy Dependence in Epidemiologic Studies of Reproductive Outcomes","267796821":"Bayesian prior distributions for the analysis of screening experiments","265319796":"A multivariate family of distributions on (0, ∞)P","4741868":"Are Maintenance Practices for Railroad Tracks Effective?","14988098":"Use of the Gibbs sampler to estimate transition rates between grades of coronary disease following cardic transplantation","2612365":"Bayesian Estimation and Model Choice in Item Response Models","291097847":"Bayesian Computations in Survival Models Via the Gibbs Sampler","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","275178967":"“Principal Applications of Bayesian Methods in Actuarial Science: A Perspective”, Udi E. Makov, October 2001","237229714":"A Bayesian Semiparametric Analysis of the Reliability and Maintenance of Machine Tools","12757104":"Bayesian analysis of prevalence with covariates using simulation-based techniques: Applications to HIV screening","12079118":"Bayesian Partitioning for Estimating Disease Risk","264949107":"Maximum Likelihood Estimation and Mathematica","14830685":"Random-Effects Models for Longitudinal Data Using Gibbs Sampling","268650178":"An introduction to MCMC","45933694":"Control Variates for Reversible MCMC Samplers","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","45359730":"Multilevel modelling of event history data: comparing methods appropriate for large datasets","265797407":"Bayesian analysis of three-way ANOVA model and a diagnostic test for the convergence of the estimation","226826572":"Data Augmentation and MCMC for Binary and Multinomial Logit Models","26631516":"Bayesian inference in the semiparametric log normal frailty model using Gibbs sampling","255584753":"Computational Issues in Semiparametric Bayesian Replacement Models","227970653":"Variance components analysis for pedigree-based censored survival data using general linear mixed models (GLMMs) and Gibbs sampling in BUGS","243048371":"An index sampling algorithm for the bayesian analysis of a class of model selection problems","222006516":"Aspects of smoothing and model inadequacy in generalized regression","10606702":"Bayesian Inference on Order Constrained Parameters in Generalized Linear Models","228434508":"Non-linear regression modelling","46434325":"Simulation based bayesian econometric inference: principles and some recent computational advances","229712483":"Bayesian Methods for Categorical Data","260997980":"A Robust Parameter Estimation Method for Estimating Disease Burden of Respiratory Viruses","227629381":"The Modern Call Center: A Multi‐Disciplinary Perspective on Operations Management Research","220286453":"Multivariate Poisson Regression with Covariance Structure","2632957":"Bayesian Residual Analysis For Binary Response Regression Models","4732573":"Proportional Hazards Models: A Latent Competing Risk Approach","13366803":"Gibbs sampler for the logistic model in the analysis of longitudinal binary data","223738253":"Assessing high reliability via Bayesian approach and accelerated tests","7544747":"Bayesian evidence synthesis to extrapolate survival estimate in cost-effectiveness studies","2800624":"Applications of Hybrid Monte Carlo to Bayesian Generalized Linear Models: Quasicomplete Separation and Neural Networks","223422858":"Adaptive rejection Metropolis sampling using Lagrange interpolation polynomials of degree 2","254396404":"Acquisition, Involvency and Managers in UK Small Companies","267080969":"Screening. Methods for experimentation in industry, drug dicovery, and genetics","229752658":"Markov Chain Monte Carlo","23400065":"Finding factors influencing risk: comparing Bayesian stochastic search and standard variable selection methods applied to logistic regression models of cases and controls. Stat Med","228995904":"Bias correction for censored data with exponential lifetimes","228874563":"Bayesian serial revision method for RLLC cluster systems failure prediction","4991141":"Spatial Econometric Issues for Bio-Economic and Land-Use Modelling","222603183":"A New Algorithm to Generate Beta Processes","238866647":"Bayesian analysis of an intervened poisson distribution","51073248":"Approximate Predictive Densities and Their Applications in Generalized Linear Models","229374023":"Extended Weibull type distribution and finite mixture of distributions","242923415":"On convergence of the EM algorithmand the Gibbs sampler","221422301":"A Stochastic Framework for Hybrid System Identification with Application to Neurophysiological Systems","222416819":"Bayesian locally optimal design of knockout tournaments","226261640":"Efficient sampling from the posterior distribution in generalized linear mixed models. Statistics and Computing, 7, 57-68","11594052":"Bayesian Modeling of the Level and Duration of Fertility in the Menstrual Cycle","240768161":"Bayesian binary regression model: an application to in-hospital death after AMI prediction","227907692":"Robust Bayesian Premium Principles in Actuarial Science","14556453":"A generalized linear model for analyzing Receiver Operating characteristics curves","226073479":"An iterative Monte Carlo method for nonconjugate Bayesian analysis"},"index":858}