{"abs":"We apply recent results in Markov chain theory to Hastings and Metropolis algorithms with either independent or symmetric candidate distributions, and provide necessary and sufficient conditions for the algorithms to converge at a geometric rate to a prescribed distribution π. In the independence case (in ℝ k ) these indicate that geometric convergence essentially occurs if and only if the candidate density is bounded below by a multiple of π; in the symmetric case (in ℝ only) we show geometric convergence essentially occurs if and only if π has geometric tails. We also evaluate recently developed computable bounds on the rates of convergence in this context: examples show that these theoretical bounds can be inherently extremely conservative, although when the chain is stochastically monotone the bounds may well be effective.","title":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","id":265465075,"url":"https://www.researchgate.net/publication/265465075_Tweedie_RL_Rates_of_convergence_of_the_Hastings_and_Metropolis_algorithms_Ann_Stat_24_101-121","names":["K.L. Mengersen","R.L. Tweedie","The Annals of Statistics"],"references":{"235014147":"Exploring Posterior Distributions Using Markov Chains","200111118":"Markov Chains and Stochastic Stability","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","200105001":"Equation of State by Fast Computing Machines","264966253":"Subgeometric Rates of Convergence of f-Ergodic Markov Chains","2358116":"Explicit Rates of Convergence of Stochastically Ordered Markov Chains","235361263":"Bayesian Statistics Without Tears: A Sampling-Resampling Perspective","243776875":"Spatial Statistics and Bayesian Computing","239432137":"Asymptotic Behavior of the Gibbs Sampler","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","244475332":"On the Convergence of Successive Substitution Sampling"},"citedIn":{"221042989":"Construction of Lyapunov Functions for Piecewise-Deterministic Markov Processes","48419553":"A Metropolis-Hastings based method for sampling from the G-Wishart distribution in Gaussian graphical models","258919277":"Lieder, F., Griffiths, T.L., \u0026 Goodman, N.D. (2013). Burn-in, bias, and the rationality of anchoring. In P. Bartlett, F.C.N. Pereira, Leon Bottou, Chris J.C. Burges, \u0026 K.Q. Weinberger (editors). Advances in Neural Information Processing Systems 25, Lake Tahoe, USA.","247529157":"Simulation-based Estimation Methods for-Stable Distributions and Processes","51969309":"Fluctuations of Interacting Markov Chain Monte Carlo Models","38326862":"Honest Exploration of Intractable Probability Distributions Via Markov Chain Monte Carlo","2119719":"Accelerating diffusions. Ann Appl Prob","29687759":"Note on the Sampling Distribution for the Metropolis-Hastings Algorithm","228954025":"Quantitative bounds for geometric convergence rates of Markov chains","6893157":"Metropolis","233866237":"Optimisation via Slice Sampling","2369066":"Necessary conditions for geometric and polynomial ergodicity of random walk-type Markov chains","272499246":"Recent Bayesian approaches for spatial analysis of 2-D images with application to environmental modelling","227697539":"Bayesian Analysis of Growth Curves Using Mixed Models Defined by Stochastic Differential Equations","242441319":"Accelerating Monte Carlo Markov processes","242536034":"Estimation of Bayes Factors in a Class of Hierarchical Random Effects Models Using a Geometrically Ergodic MCMC Algorithm","3193384":"Image segmentation by data-driven Markov Chain Monte Carlo","229790634":"Efficiency and Convergence Properties of Slice Samplers","267625962":"An Integrated Procedure for Bayesian Reliability Inference Using MCMC","23634291":"A note on geometric ergodicity and floating-point roundoff error","2552381":"MCMC Methods for Financial Econometrics","51945733":"Quasi-compactness of Markov kernels on weighted-supremum spaces and\ngeometrical ergodicity","255325480":"Adaptive evolutionary Monte Carlo algorithm for optimization with applications to sensor placement problems","2118656":"Quantitative bounds on convergence of time-inhomogeneous Markov chains","4764266":"Bayesian range-based estimation of stochastic volatility models","277679273":"Bayesian Computation Via Markov Chain Monte Carlo","256762728":"Metropolis Integration Schemes for Self-Adjoint Diffusions","2127878":"Selection of a MCMC simulation strategy via an entropy convergence criterion","242397269":"Simulation-based Estimation Methods for fi-Stable Distributions and Processes Tesi di dottorato in Statistica Applicata ñ XVI ciclo","272521750":"Extremes Control of Complex Systems With Applications to Social Network","228789130":"Examples of adaptive MCMC","222579567":"Bayesian analysis of the Logit model and comparison of two Metropolis–Hastings strategies","2676740":"Ordering, Slicing And Splitting Monte Carlo Markov Chains","48419023":"Sequentially interacting Markov chain Monte Carlo methods","4919930":"Improved Sampling-Importance Resampling and Reduced Bias Importance Sampling","258567000":"Time series prediction via aggregation: An oracle bound including numerical cost","271513115":"Bounds on regeneration times and convergence rates for Markov chainsfn1fn1Work supported in part by NSF Grant DMS 9504561 and EPSRC grant GR/J19900.","35734552":"Convergence of Markov chain Monte Carlo algorithms with applications to image restoration [microform].","38348915":"Convergence of the Monte Carlo expectation maximization for curved exponential families","23977808":"Convergence of Adaptive Sampling Schemes","228870041":"An Adaptive Markov Chain Monte Carlo Approach to Time Series Clustering of Processes with Regime Transition Behavior","5207567":"Population-Based Reversible Jump Markov Chain Monte Carlo","228677600":"Memorial Article","228859874":"How to compare MCMC simulation strategies?","4742159":"Likelihood Subgradient Densities","222688524":"Perfect sampling from independent Metropolis-Hastings chains","38322179":"Necessary conditions for geometric and polynomial ergodicity of random walk-type Markov chains","232697237":"Variance bounding and geometric ergodicity of Markov chain Monte Carlo for approximate Bayesian computation","2460264":"On The Approximation Of Certain Probability Measures By A Set Of Points","232503189":"Remarks on the speed of convergence of mixing coefficients and\napplications","244253918":"Data Augmentation for the Bayesian Analysis of Multinomial Logit Models","268296620":"Blocking Gibbs Sampling for Inference in Large and Complex Bayesian Networks With Applications in Genetics","225580838":"A SAEM algorithm for the estimation of template and deformation parameters in medical image sequences","277285075":"Simulation-Based Estimation Methods for . . .","222935327":"A general Bayesian framework for calibrating and evaluating stochastic models of annual multi-site hydrological data","228744187":"Bayesian Econometrics in finance","46588058":"Interacting Markov Chain Monte Carlo Methods For Solving Nonlinear Measure-Valued Equations","263032816":"Attaining the Optimal Gaussian Diffusion Acceleration","38350870":"Sensitivity and convergence of uniformly ergodic Markov chains","47461044":"A patch that imparts unconditional stability to certain explicit integrators for SDEs","226791397":"First Hitting Time Analysis of the Independence Metropolis Sampler","225261327":"Geometric Ergodicity of Metropolis-Hastings Algorithms for Conditional Simulation in Generalized Linear Mixed Models","227848695":"A Bayesian inference approach to the ill‐posed Cauchy problem of steady‐state heat conduction","45901023":"On computational tools for Bayesian data analysis","224176440":"Stochastic Optimization on Continuous Domains With Finite-Time Guarantees by Markov Chain Monte Carlo Methods","45853395":"Pathwise Accuracy and Ergodicity of Metropolized Integrators for SDEs","5207588":"Retrospective MCMC for Dirichlet process hierarchical models","229009866":"On Convergent Rate of Genetic Algorithms","45864661":"Nonasymptotic bounds on the estimation error for regenerative MCMC algorithms","272037977":"A hybrid modeling approach for parking and traffic prediction in urban simulations","246155971":"Extremal indices, geometric ergodicity of Markov chains, and MCMC","268441712":"ON THE CONVERGENCE OF UNCONSTRAINED ADAPTIVE MARKOV CHAIN MONTE CARLO ALGORITHMS","251875187":"A Bayesian Analysis on Weibull Model Allowing Nearly Instantaneous Failures","280496847":"Gradient-based MCMC samplers for Dynamic Causal Modelling","4288569":"SMC Samplers for Bayesian Optimal Nonlinear Design","40798228":"Genetic algorithms and Markov Chain Monte Carlo: Differential Evolution Markov Chain makes Bayesian computing easy","221042512":"Survey on Computational Complexity with Phase Transitions and Extremal Optimization","234108809":"Variational MCMC","258345755":"Computation of Expectations by Markov Chain Monte Carlo Methods","2657367":"Adaptive Chains","48198751":"Nonasymptotic Bounds on the Mean Square Error for MCMC Estimates via Renewal Techniques","227522317":"Particle Markov Chain Monte Carlo . . .","233387883":"Markov chain Monte Carlo for computing rare-event probabilities for a\nheavy-tailed random walk","235761295":"Relative fixed-width stopping rules for Markov Chain Monte Carlo simulations","23418348":"Batch Means and Spectral Variance Estimation in Markov Chain Monte Carlo","264903491":"Randomized Algorithms for Analysis and Control of Uncertain Systems, with Applications","225317861":"Convergence of Metropolis-type algorithms for a large canonical ensemble","41713393":"Theoretical and numerical comparison of some sampling methods for molecular dynamics. Esaim Math. Model. Numer. Anal. 41, 351-389","261289218":"Irreversible Langevin samplers and variance reduction: A large deviations approach","273157850":"Accelerating Metropolis-Hastings algorithms by Delayed Acceptance","275897059":"Comparison of hit-and-run, slice sampling and random walk Metropolis","228677431":"Convergence of adaptive MCMC algorithms: Ergodicity and law of large numbers","220165001":"Minimum Cross-entropy Methods for Rare-event Simulation","2113722":"Practical Drift Conditions for Subgeometric Rates of Convergence","259367918":"A Shrinkage-Thresholding Metropolis adjusted Langevin algorithm for Bayesian Variable Selection","38350549":"On The Geometric Ergodicity Of Hybrid Samplers","276296427":"Approximate Bayesian Computation by Modelling Summary Statistics in a Quasi-likelihood Framework","264733541":"Inference for Diffusion Processes with Applications in Life Sciences","230569757":"On the Convergence Rates of Some Adaptive Markov Chain Monte Carlo\nAlgorithms","227944755":"A Markov Chain Monte Carlo version of the genetic algorithm Differential Evolution: Easy Bayesian computing for real parameter spaces","279260160":"The Nearest Neighbor entropy estimate: an adequate tool for adaptive MCMC evaluation","2364034":"Geometric ergodicity of Metropolis-Hastings algorithms for conditional simulation in generalised linear mixed models","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","259441094":"Uniform Ergodicity of the Iterated Conditional SMC and Geometric Ergodicity of Particle Gibbs samplers","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","2847898":"Shift-Coupling and Convergence Rates of Ergodic Averages","51957673":"Markovian stochastic approximation with expanding projections","227276601":"An Introduction to MCMC for Machine Learning","255618953":"A versatile MCMC strategy for sampling posterior distributions of analytically intractable models","45864462":"Regeneration and Fixed-Width Analysis of Markov Chain Monte Carlo Algorithms","264925564":"Convergence of conditional Metropolis-Hastings samplers","255612292":"CONVERGENCE OF ADAPTIVE MARKOV CHAIN Monte Carlo Algorithms","274730206":"The Metropolis—Hastings Algorithm","221661064":"A Class Coupler for Perfect Sampling from Continuous Distributions With\nand Without Atoms","227604783":"Improving Convergence of the Hastings–Metropolis Algorithm with an Adaptive Proposal","48198752":"Adaptive Gibbs samplers and related MCMC methods","48175135":"Central limit theorem for triangular arrays of Non-Homogeneous Markov\nchains","273788050":"Automated Parameter Blocking for Efficient Markov-Chain Monte Carlo Sampling","238734585":"Using MALA to Solve SDEs","265035017":"A two-step approach to aircraft conflict resolution combining optimal deterministic design with Monte Carlo stochastic optimization","241756333":"Parallel hierarchical sampling: A general-purpose interacting Markov chains Monte Carlo algorithm","51617749":"Tail Paradox, Partial Identifiability, and Influential Priors in Bayesian Branch Length Inference","4729985":"Markov Chain Monte Carlo Simulation Methods in Econometrics","273703579":"Gradient-free MCMC Methods for Dynamic Causal Modelling.","10606703":"Bayesian Latent Variable Models for Median Regression on Multiple Outcomes","222549388":"Approximate Bayesian inference for hierarchical Gaussian Markov random fields","45130367":"Markov Chain Monte Carlo Technology","227623232":"Markov Chain Monte Carlo Method and its applications","239542933":"Adaptive MCMC: Background, Theory, and Simulations","226627927":"Data augmentation, frequentist estimation, and the Bayesian analysis of multinomial logit models","242374315":"How Do Heuristics Expedite Markov Chain Search? Hitting-time Analysis of the Independence Metropolis Sampler","225786287":"Metropolis–Hastings Algorithms with acceptance ratios of nearly 1","220816370":"Exploiting Informative Priors for Bayesian Classification and Regression Trees.","4742803":"Stochastic Approximation in Monte Carlo Computation","38339733":"Polynomial Convergence Rates of Markov Chains","227944779":"Genetic algorithms and Markov Chain Monte Carlo: Differential Evolution Markov Chain makes Bayesian computing easy","228636543":"On the Containment Condition for Adaptive Markov Chain Monte Carlo Algorithms","51931128":"Explicit error bounds for Markov chain Monte Carlo","3193555":"Statistical modeling and conceptualization of visual patterns","230238559":"Handbook of Statistical Systems Biology","38373539":"Exponential Convergence of Langevin Distributions and Their Discrete Approximations","242404504":"Advances and applications in perfect sampling","23631235":"On the Geometrical Convergence of Gibbs Sampler inRd","270277360":"Markov Chain Monte Carlo with Linchpin Variables","265406268":"MCMC Approach to Classical Estimation with Overidentifying Restrictions","43518070":"A Bayesian solution to reconstructing centrally censored distributions","255971761":"Sequential Markov Chain Monte Carlo","31327020":"Computational complexity of Markov chain Monte Carlo methods for finite Markov random fields","256762299":"On Metropolis Integrators for Molecular Dynamics","242998924":"Algorithmes de Hastings–Metropolis en interaction","226243460":"Quantitative Non-Geometric Convergence Bounds for Independence Samplers","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","2572508":"Approximating Hidden Gaussian Markov Random Fields","228578659":"On the geometric ergodicity of Metropolis-Hastings algorithms","257466788":"Generalized Gaussian mixture models as a nonparametric Bayesian approach for clustering using class-specific visual features","278795361":"On the rate of convergence of the Gibbs sampler for the 1-D Ising model by geometric bound","40120164":"Genetic algorithms and Markov Chain Monte Carlo: Differential Evolution Markov Chain makes Bayesian computing easy (revised)","1759003":"Convergence of adaptive mixtures of importance sampling schemes","2579750":"Improving convergence of the Hastings-Metropolis Algorithm with a learning proposal","223596113":"Chapter 56. Computationally Intensive Methods for Integration in Econometrics*","41706878":"Coupling a stochastic approximation version of EM with a MCMC procedure","277959058":"Gradient-free Hamiltonian Monte Carlo with Efficient Kernel Exponential Families","4986693":"Fixed-Width Output Analysis for Markov Chain Monte Carlo","286767646":"Parameter Estimation of Population Pharmacokinetic Models with Stochastic Differential Equations: Implementation of an Estimation Algorithm","265922771":"Bayesian Risk Management -\"Frequency Does Not Make You Smarter\"","50996224":"Handbook of Monte Carlo Methods","230738639":"Ergodicity for the $GI/G/1$-type Markov Chain","222605911":"Geometric Ergodicity of Gibbs and Block Gibbs Samplers for a Hierarchical Random Effects Model","265528000":"Monte Carlo Standard Errors for Markov Chain Monte Carlo","24079482":"Using simulation methods for bayesian econometric models: inference, development and communication: some comments","2633022":"Hierarchical Models: A Current Computational Perspective","227197084":"Langevin-Type Models II: Self-Targeting Candidates for MCMC Algorithms*","23634047":"V-Subgeometric ergodicity for a Hastings-Metropolis algorithm","238092075":"Nonreversible perturbations accelerate convergence","259555940":"Estimates and standard errors for ratios of normalizing constants from multiple Markov chains via regeneration","242748773":"BOOSTING, DOWNSIZING AND OPTIMALITY OF TEST FUNCTIONS OF MARKOV CHAINS","2655031":"Information bounds for Gibbs samplers","228573824":"Tuning of Markov chain Monte Carlo algorithms using copulas","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","274094454":"Stability of Noisy Metropolis-Hastings","279968655":"Fast Langevin based algorithm for MCMC in high dimensions","45884317":"Non-parametric Deprojection of Surface Brightness Profiles of Galaxies in Generalised Geometries","257146993":"Corrigendum to “Bounds on regeneration times and convergence rates for Markov chains” : [Stochastic Processes and their Applications 80 (1999) 211–229]","267812048":"Complexity Bounds for MCMC via Diffusion Limits","251211218":"On a Directionally Adjusted Metropolis-Hastings Algorithm","235892514":"Discrepancy bounds for uniformly ergodic Markov chain quasi-Monte Carlo","1737000":"Variance bounding Markov chains","247934451":"Stochastic Approximation Monte Carlo for MLP Learning","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","4772221":"Approximating hidden Gaussian Markov random fields","23633488":"Geometric convergence of the Metropolis-Hastings simulation algorithm","221591049":"What Do We Know about the Metropolis Algorithm ?","271855369":"Bayesian computation: a perspective on the current state, and sampling backwards and forwards","288151569":"Monte Carlo Methods and Bayesian Computation: Overview","2777364":"Bounding Convergence Time of the Gibbs Sampler in Bayesian Image Restoration","221042707":"On the approximate domain optimization of deterministic and expected value criteria","2738026":"Theoretical rates of convergence for Markov chain Monte Carlo","4897039":"On the influence of the proposal distributions on a reversible jump MCMC algorithm applied to the detection of multiple change-points","242552637":"Using Structural Information in Modeling and Multiple Alignments for Phylogenetics","254287968":"Markov Chain Monte Carlo: 10 Years and Still Running!","4920066":"Convergence of Heavy-tailed Monte Carlo Markov Chain Algorithms","254287969":"Empirical Bayes: Past, Present and Future","2136938":"Markov Chain Monte Carlo: Can We Trust the Third Significant Figure?","46538122":"Frailty Correlated Default","225566780":"Stability of Partially Implicit Langevin Schemes and Their MCMC Variants","45895665":"Adaptive Gibbs samplers","37675886":"Bayesian Analysis and Computational Methods for Dynamic Modeling","226539729":"Convergence assessment techniques for Markov chain Monte Carlo","45919214":"Bayesian Inference for General Gaussian Graphical Models With Application to Multivariate Lattice Data","267986090":"Smoothness of Metropolis-Hastings algorithm and application to entropy estimation","228862706":"Implementations of the MCEM algorithm","2349940":"Markov Chains: Structure and Applications","228167872":"MCMC Methods for Continuous-Time Financial Econometrics","227467988":"Measuring Corporate Default Risk","4993296":"On the use of local optimizations within Metropolis-Hastings updates","4741911":"Hidden Markov Models for Longitudinal Comparisons","230569182":"Markov Chain Monte Carlo Estimation of Quantiles","227425005":"Geometric ergodicity of Metropolis algorithms","268988267":"Unbiased Monte Carlo: posterior estimation for intractable/infinite-dimensional models","2645324":"On the Use of Auxiliary Variables in Markov Chain Monte Carlo Sampling","250754966":"Ch. 9. Empirical estimators based on MCMC data","41562908":"Bayesian estimation of marker dosage in sugarcane and other autopolyploids","281031078":"Virtual Stochastic Testing of Advanced Driver Assistance Systems","45855187":"Stochastic optimization on continuous domains with finite-time guarantees by Markov chain Monte Carlo Methods","268351637":"Morphometric MCMC (mcmc Package Ver. 0.9)","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","2807617":"Bounding the convergence time of the Gibbs sampler in Bayesian image restoration","227651837":"Phase randomization: A convergence diagnostic test for MCMC","4899620":"Adaptive MCMC methods for inference on affine stochastic volatility models with jumps","226936553":"A Pool-Based Model of the Spatial Distribution of Undiscovered Petroleum Resoufrces","24418311":"Stochastic Approximation Boosting for Incomplete Data Problems","227503350":"Maximum likelihood estimation of a multi‐dimensional log‐concave density","286678127":"Burn-in, bias, and the rationality of anchoring","252341360":"Adaptive Markov Chain Monte Carlo: Theory and Methods","3328840":"Algorithmic and Architectural Optimizations for Computationally Efficient Particle Filtering","220155488":"On the Convergence Rates of Genetic Algorithms.","232979558":"Pseudo-perfect and adaptive variants of the Metropolis–Hastings algorithm with an independent candidate density","228716583":"Selection of a Metropolis-Hastings simulation strategy via an entropy convergence criterion","221618866":"Simulated Annealing: Rigorous finite-time guarantees for optimization on continuous domains","24148216":"Component-Wise Markov Chain Monte Carlo: Uniform and Geometric Ergodicity under Mixing and Composition","2333611":"Self-Targeting Candidates for Metropolis-Hastings Algorithms","2322858":"A Geometric Interpretation Of The Metropolis-Hastings Algorithm","247615816":"Spectrum of the Metropolis-Hastings chain with an application to geometric ergodicity","220286635":"Evolutionary stochastic approximation Monte Carlo for global optimization","1920909":"Maximum likelihood estimation of a multidimensional log-concave density","2470839":"Bayesian Image Classification with Baddeley\u0027s Delta Loss","227577858":"Markov-chain Monte Carlo: Some practical implications of theoretical results","267670113":"Stochastic Approximation in Monte Carlo Computation","231609430":"Convergence properties of pseudo-marginal Markov chain Monte Carlo\nalgorithms","51916417":"A central limit theorem for adaptive and interacting Markov chains","225215222":"Micro-local analysis for the Metropolis algorithm","50869911":"Weak consistency of Markov chain Monte Carlo methods","246406415":"Hypothesis Testing: From p Values to Bayes Factors","38338536":"Numerical Results for the Metropolis Algorithm","268025947":"Convergence of Conditional Metropolis-Hastings Samplers, with an Application to Inference for Discretely-Observed Diffusions","226046683":"Langevin-Type Models I: Diffusions with Given Stationary Distributions and their Discretizations*","2463623":"Convergence of Simulated Annealing using Foster-Lyapunov Criteria","2111878":"General state space Markov chains and MCMC algorithms","222429412":"On convergence of properly weighted samples to the target distribution","277238063":"Lower bounds on the convergence rates of adaptive MCMC methods","280330526":"Geometric ergodicity of the Random Walk Metropolis with position-dependent proposal covariance","31373939":"Bounding the convergence time of the Gibbs sampler in Bayesian image restoration","261289021":"Information-Geometric Markov Chain Monte Carlo Methods Using Diffusions","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","225357533":"Erratum to: Extremal indices, geometric ergodicity of Markov chains, and MCMC","1906602":"Adaptive Independent Metropolis-Hastings by Fast Estimation of Mixtures of Normals","4996596":"Using a Markov Chain to Construct a Tractable Approximation of an Intractable Probability Distribution","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","5066736":"Estimation of Quadratic Functions: Noninformative Priors for Non-Centrality Parameters.","46582137":"Multiplicative random walk Metropolis-Hastings on the real line","243104706":"Conductance bounds on the L2 convergence rate of Metropolis algorithms on unbounded state spaces","46215937":"Marked point processes for statistical and morphological analysis of astronomical data","243103678":"[Bayesian Computation and Stochastic Systems]: Rejoinder","220206819":"A patch that imparts unconditional stability to explicit integrators for Langevin-like equations","2661869":"Exact Transition Probabilities For The Independence Metropolis Sampler","227423307":"Polynomial ergodicity of Markov transition kernels","30513687":"Modèles variationnels et bayésiens pour le débruitage d\u0027images : de la variation totale vers les moyennes non-locales","228696681":"A Shuffled Complex Evolution Metropolis algorithm optimization and uncertainty assessment of hydrologic models parameters","224904879":"On automating Markov chain Monte Carlo for a class of spatial models","229867642":"Slow convergence of the Gibbs sampler","2131950":"On the ergodic properties of some adaptive MCMC algorithms","245582195":"Variable-at-a-time Implementations of Metropolis-Hastings","277559131":"Thermal performance of refrigerated vehicles in the distribution of perishable food","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","47843593":"The Random Walk Metropolis: Linking Theory and Practice Through a Case Study","51953356":"Issues in Designing Hybrid Algorithms","228905584":"On a Class of Genealogical and Interacting Metropolis Models","2729461":"Analysis of the Gibbs sampler for a model related to James-Stein estimators","259105965":"On Geometric Ergodicity of Additive and Multiplicative Transformation Based Markov Chain Monte Carlo in High Dimensions","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","243047326":"Exact bound for the convergence of metropolis chains","259312791":"Error bounds of MCMC for functions with unbounded stationary variance","220343492":"Annealing stochastic approximation Monte Carlo for neural network training","2868684":"Computable Bounds For Polynomial Ergodicity","268376599":"CONVERGENCE RATES AND REGENERATION OF THE BLOCK GIBBS SAMPLER FOR BAYESIAN RANDOM EFFECTS MODELS","240925111":"MCMC Methods to Estimate Bayesian Parametric Models","2841561":"Convergence of the Monte Carlo EM for Curved Exponential Families","2241494":"Computable Bounds For Subgeometrical And Geometrical Ergodicity","227535995":"Perfect samplers for mixtures of distributions","2213337":"Gibbs Sampling for a Bayesian Hierarchical General Linear Model","26406507":"On the Markov chain central limit theorem","41717635":"Convergence Rates to Optimal Distribution of the Boltzmann Machine on Simulated Annealing"},"index":86}