{"abs":"Scientific learning is an iterative process employing Criticism and Estimation. Correspondingly the formulated model factors into two complementary parts--a predictive part allowing model criticism, and a Bayes posterior part allowing estimation. Implications for significance tests, the theory of precise measurement and for ridge estimates are considered. Predictive checking functions for transformation, serial correlation, bad values, and their relation with Bayesian options are considered. Robustness is seen from a Bayesian viewpoint and examples are given. For the bad value problem a comparison with M estimators is made.","title":"Sampling and Bayes\u0027 Inference in Scientific Modelling and Robustness","id":230872692,"url":"https://www.researchgate.net/publication/230872692_Sampling_and_Bayes\u0027_Inference_in_Scientific_Modelling_and_Robustness","names":["George E. P. Box","Journal of the Royal Statistical Society Series A (General)"],"references":{"228057717":"An Introduction to Probability Theory and Its Applications II","224839716":"Time Series Analysis, Forecasting and Control, Holden-Day","241736141":"Detection of Influential Observation in Linear Regression","254284515":"Discrimination Procedures for Separate Families of Hypotheses","269947580":"Processing Data for Outliers","38357634":"A Bayesian Analysis of Some Non-Parametric Problems","268636591":"On the Foundations of Statistical Inference","272593490":"Some Comments on a Paper of Coen, Gomme and Kendall","266216624":"Testing transformation to normality","247643213":"Statistical Information and Likelihood","230872689":"Discrimination Among Mechanistic Models","200806059":"An Analysis of Transformation","247873523":"The Examination and Analysis of Residuals","268531000":"The Role of Significance Tests (with Discussion)","243687932":"Reference Posterior Distributions for Bayesian Inference","276047433":"The Exploration and Exploitation of Response Surfaces: An Example of the Link between the Fitted Surface and the Basic Mechanism of the System","225902602":"Robust Estimation: A Condensed Partial Survey","30975462":"A Test for Normality Against Symmetric Alternatives","254285526":"Comments on a Criterion of Transformation Proposed by Schlesselman","3027281":"Approximate non-Gaussian filtering with linear state and observation relation"},"citedIn":{"4767304":"Stochastic Processes for Interest Rates and Equilibrium Bond Prices","222180670":"A Bayesian non-parametric estimate for multivariate regression","200018413":"Automatic processing of high-rate, high-density multibeam echosunder data","13219532":"Criticism of a hierarchical model using Bayes factors","271774267":"Contaminant Detection in the Visual Inspection of Seed Samples","263582652":"Posterior predictive checks to quantify lack-of-fit in admixture models of latent population structure","237105707":"EXTENSIBLE FORMATS FOR DATA ANALYSIS AND DOCUMENTATION","24123770":"Optimal Prediction Pools","291866984":"Cuscore Statistics: Directed Process Monitoring for Early Problem Detection","231390680":"Prior Checking and Moving Horizon Smoothing for Improved Particle Filtering","243763359":"Statistical and Knowledge-Based Approaches to Clinical Decision-Support Systems, with an Application in Gastroen-terology","222832976":"Error and uncertainty in modeling and simulation","283318009":"Crome, F. H. J., Thomas, M. and Moore, L. A. 1996. A novel Bayesian approach to assessing impacts of rainforest logging. Ecological Applications 6: 1104-1123","2626611":"Models in Decision Analysis","20721440":"Statistical methods for model discrimination: Application to gating kinetics and permeation of the acetylcholine receptor channel","260169116":"Bayesian model comparison: Log scores and DICDIC","268020710":"Bayesian inference with misspecified models","233276359":"Reconciling Classical and Prior Predictive P-Values in the Two-Sided Location Parameter Testing Problem","227687346":"Methods for Default and Robust Bayesian Model Comparison: The Fractional Bayes Factor Approach","45895836":"Bayes, Jeffreys, Prior Distributions and the Philosophy of Statistics","237803021":"MODEL SELECTION WITH VAGUE PRIOR INFORMATION (AsymptoticslBayes factor/Hypothesis testing/Intrinsic priorslModel comparison)","27403139":"Modeling and analysis of multiple-event survival data","2354178":"Computational Experiments and Reality","273898096":"Hippocampal subfield and medial temporal cortical persistent activity during working memory reflects ongoing encoding","2471938":"Nonparametric Statistical Modeling of Recurrent Events: A Bayesian Approach","38326880":"Logicist Statistics I. Models and Modeling","266309622":"Bayesian Analysis of Ring-Recovery Data Via Markov Chain Monte Carlo Simulation","24065350":"A Simulation-Intensive Approach for Checking Hierarchical Models","227425701":"A limit result for the prior predictive applied to checking for prior-data conflict","51718974":"Critical comments on dynamic causal modelling","249681612":"Model Validation in Spatial Econometrics: A Review and Evaluation of Alternative Approaches","286487357":"Calibrated Bayes, an Alternative Inferential Paradigm for Official Statistics","233892803":"Bayesian regression in SAS software","281676537":"Testing for Aberrant Behavior in Response Time Modeling","220056360":"MCMC methods to approximate conditional predictive distributions","248182012":"Two-Stage Reliability Tests with Technological Evolution: A Bayesian Analysis","241144419":"Foundations of Monitoring Dynamic Systems","5283948":"Predictive checking for Bayesian interim analyses in clinical trials","8410813":"Bayesian Difference Refinement","250181335":"Models, Computational Experiments and Reality","223215887":"The deductive phase of statistical analysis via predictive simulations: Test, validation and control of a linear model with autocorrelated errors representing a food process","233034144":"Bayesian Estimation of Odds Ratios Under Prior Hypotheses of Independence and Exchangeability","4909582":"Post-Processing Posterior Predictive p Values","49799347":"Bayesian models for subgroup analysis in clinical trials","5127691":"Robust Bayesian Estimation","227811793":"Cumulative Score Charts","260169668":"New model diagnostics for spatio-temporal systems in epidemiology and ecology","261805533":"Present Position and Potential Developments: Some Personal Views: Bayesian Statistics","229761526":"Comments on An inquiry into computer understanding","24171319":"Weaknesses of Bayesian model averaging for meta-analysis in the study of Vitamin E and mortality","260407244":"George Box and Bayesian inference","225348900":"Posterior predictive p-values: What they are and what they are not","4741122":"Testing Fisher, Neyman, Pearson, and Bayes","270252629":"Theory and Practice of Bayesian Statistics","30995351":"Falsification of Propensity Models by Statistical Tests and the Goodness-of-Fit Paradox","241530421":"THE CONCEPT OF PREDICTIVE PROBABILITY AND A SIMPLE TEST FOR GEOSTATISTICAL MODEL VALIDATION","241736251":"Empirical Bayes Estimation of the Reliability of Nuclear-Power-Plant Emergency Diesel Generators","15200946":"Helping doctors to draw appropriate inferences from the analysis of medical studies","228890108":"Bayesian Analysis of Data-Worth Considering Model and Parameter Uncertainties","8410840":"Bayesian Weighting for Macromolecular Crystallographic Refinement","233235390":"Discrepancy measures for item fit analysis in item response theory","8410841":"Correlated Phasing of Multiple Isomorphous Replacement Data","290478857":"Addressing potential prior‐data conflict when using informative priors in proof‐of‐concept studies","250755240":"Role of P-values and other Measures of Evidence in Bayesian Analysis","290110225":"Prediction and Entropy","241779250":"A geostatistical approach to contaminant source identification","23407934":"Bayesian Analysis in Plant Pathology","250755241":"Bayesian Model Checking and Model Diagnostics","225813294":"Multivariate Probabilistic Projections Using Imperfect Climate Models. Part II: Robustness of Methodological Choices and Consequences for Climate Sensitivity","232503174":"Principles and Procedures of Exploratory Data Analysis","4996625":"A Robust Conflict Measure of Inconsistencies in Bayesian Hierarchical Models","26291150":"Model criticism based on likelihood-free inference, with an application to protein network evolution","283334844":"There is Individualized Treatment. Why Not Individualized Inference?","2306627":"Some Uses of Order Statistics in Bayesian Analysis","2469445":"Diagnostic Check For Monotone Spread","250961553":"Mixtures and diagnostic plots in modelling road traffic vehicle headways","233009541":"Choice Between Weibull and Lognormal Models: A Simulation Based Bayesian Study","223714109":"Modelling and forecasting reliability","228706760":"Modeling and forecasting realized volatility: the role of power variation","33053074":"Prediction Intervals for Class Probabilities","265018279":"Approximate Bayesian inference for complex ecosystems","4746789":"Methods and Criteria for Model Selection","228383217":"Discussion: Towards a Bayesian analysis template?","228363762":"Using input dependent weights for model combination and model selection with multiple sources of data","233223049":"Reconciling Bayesian and Frequentist Evidence in the One-Sided Scale Parameter Testing Problem","5207584":"Studentization and deriving accurate p-values","232710574":"On the value of conditioning data to reduce conceptual model uncertainty in groundwater modeling","237799517":"MODELSELECTIONAND ACCOUNTINGFOR MODEL UNCERTAINTYIN LINEAR REGRESSIONMODELS","19374933":"Probabilistic prediction in patient management","4721212":"Bayesian Model Comparison and Validation","226094860":"Statistical inference and Monte Carlo algorithms","51314555":"Bayesian adaptive sequence alignment algorithms","239809585":"CREDIBILITY FOR CLASSIFICATION RATEMAKING VIA THE HIERARCHICAL NORMAL LINEAR MODEL","220343646":"Robust Sensor Fusion: Analysis and Application to Audio Visual Speech Recognition","263504328":"manuscript","2771031":"Markovian Structures in Biological Sequence Alignments","226417408":"An overview of robust Bayesian analysis","24065296":"The relation between theory and application in statistics","38326985":"The Interplay of Bayesian and Frequentist Analysis","268636288":"Applied statistical inference. Likelihood and Bayes","270902950":"Do we always need a filter","233338221":"Application of Laplace approximation to record values","227664153":"Model Discrimination and Criticism with Single-Response Data","258437102":"Bayesian Statistics and the C/E-acceptability curve derived from clinical trials data - Technical Report, 99-1,","2469036":"P Values for Composite Null Models","264717646":"Extending Integrated Nested Laplace Approximation to a Class of Near-Gaussian Latent Models","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","221860790":"‘Philosophy and the Practice of Bayesian Statistics.’","228872500":"Calibrating Bayes factor under prior predictive distributions","23631352":"On Robust Bayesian Analysis for Location and Scale Parameters","10747957":"Generalized Conjugate Priors for Bayesian Analysis of Risk and Survival Regressions","273784000":"Statistical Foundations for Model-Based Adjustments","220263347":"Bayesian adaptive sequence alignment algorithms.","4730588":"Learning-by-Doing as a Propagation Mechanism","279607871":"Chapter 2. Goals in Environmental Monitoring","228721972":"Sample size determination using posterior predictive distributions","5272774":"Bayesian Interpretation and Analysis of Research Results","256005588":"A hierarchical generalized linear model with variable selection: studying the response of a representative fish assemblage for large European rivers in a multi-pressure context. Stoch Env Res Risk Assess 1:16","274967284":"Optimal Multiple Testing Under a Gaussian Prior on the Effect Sizes","235926677":"Bayesian Forecasting and Dynamic Linear Models","251562081":"Quantitative assessment of probabilistic forecasts with applications in epidemiology","2286722":"Posterior Predictive Assessment of Model Fitness Via Realized Discrepancies","238166675":"Probability networks for handling uncertainty in the performance assessment of high-level nuclear waste repositories","4746473":"The Impact of Prior Distributions for Uncontrolled Confounding and Response Bias: A Case Study of the Relation of Wire Codes and Magnetic Fields to Childhood Leukemia","13713522":"Assessing Placebo Response Using Bayesian Hierarchical Survival Models","263273751":"A novel probabilistic method for robust parametric identification and outlier detection","255642011":"Sampling to Assess the Fit of Regression Models","38359265":"Assessing Normality in Random Effects Models","243082964":"A General Framework for Model-Based Statistics","229620486":"Diagnostics for regression modeling in spatial econometrics. J Reg Sci","276494547":"\"All Models Are Wrong, but Some Are Useful\"","38348514":"Bayesian goodness-of-fit testing using infinite-dimensional exponential families","226736430":"Bayesian analysis of contingency tables: A simulation and graphics-based approach","241546954":"Evaluation and criticism of multivariate probabilistic forecasts","282837099":"Bayesian data analysis in population ecology: motivations, methods, and benefits","240202979":"Chapter 2 Statistical theory and econometrics","264639860":"Testing for ontological errors in probabilistic forecasting models of natural systems","228203309":"Evidence for Hedge Fund Predictability from a Multivariate Student-T Full-Factor GARCH Model","254332305":"The Importance of Practice in the Development of Statistics","243103431":"The Impact of Prior Distributions for Uncontrolled Confounding and Response Bias","237821074":"Identifying Mixtures of Regression Equations by the SAR procedure","238306037":"A plea for Popperian significance testing","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","4854409":"Density inference for ranking European research systems in the field of economics","229565293":"Hypothesis Testing","2291946":"Model Choice: A Minimum Posterior Predictive Loss Approach","28290917":"Detección de outliers en muestras de Poison y exponencial","263579519":"Effect of individual observations on the Box–Cox transformation","24136124":"Forecasting Realized Volatility: A Bayesian Model Averaging Approach","257298331":"A Novel Bayesian Approach to Assessing Impacts of Rain Forest Logging","46714374":"Bayesian data analysis","31223571":"Two Graphical Displays for Outlying and Influential Observations in Regression","284281889":"Extending Bayesian induction","28285821":"Heterogeneity and model uncertainty in Bayesian regression models","280209505":"Bayesian Model Averaging for Propensity Score Analysis","220106701":"Modelling Uncertainty in Expert Systems.","241128075":"Microbiological detoxification of chromate from chrome-plating effluents","4745884":"A Graphical Method for Assessing the Fit of a Logistic Regression Model","265209626":"Synthesising evidence to estimate pandemic (2009) A/H1N1 influenza severity in 2009-2011","238042854":"System identification based on variational Bayes method and the invariance under coordinate transformations","225239483":"Recursive residuals and model diagnostics for normal and non-normal state space models","38359185":"Bayesianly Justifiable and Relevant Frequency Calculations for the Applied Statistician.” Annals of Statistics 12, 1151-1172","251575844":"Multimodel Bayesian analysis of data-worth applied to unsaturated fractured tuffs","4857489":"Highest predictive density estimator in regression models","232954681":"Design of a robust estimator for nonlinear kinetic modelling","28285810":"The posterior predictive p-value: an alternative to the classical p-value","238083310":"Uncertainty and Spatial Linear Models for Ecological Data","262452091":"Estimation of HIV Burden through Bayesian Evidence Synthesis","237393602":"Meta-Analysis for Diagnostic Test Data: a Bayesian Approach","278231667":"The philosophy of statistics - Comments","222253529":"Fitting the dynamic model PCLake to a multi-lake survey through Bayesian Statistics","228443509":"Second-Order Exchangeability Analysis for Multimodel Ensembles","222708653":"Benchmark priors for Bayesian Model Averaging. J Econom 100: 381-427","2299598":"Model Selection and Accounting for Model Uncertainty in Linear Regression Models","267627783":"Robust Meta-Analytic-Predictive Priors in Clinical Trials with Historical Control Information","261579618":"Outlier … … …. s","242939532":"A Bayesian Estimator of the Optimum for a Single Factor Quadratic Response Model","265669932":"Inference from Empirical Research","227110768":"Bayesian spatial prediction","265943843":"Calibration results for Bayesian model specification","23528551":"Prior Distributions for Variance Parameters in Hierarchical Models","222340673":"Weibull extension model: A Bayes study using Markov chain Monte Carlo simulation","38359882":"Robust Bayes Decision Procedures: Gross Error in the Data Distribution","243102585":"Calibrated Bayes","229681333":"Scientific Method and Statistics","261805714":"Comparison of Discrimination Techniques Applied to a Complex Data Set of Head Injured Patients","2353963":"Evolutionary Similarity Among Genes When Data Are Sparse","254212143":"Checking for prior-data conflict","228328087":"A Prior Predictive Loss Function for the Evaluation of Inequality Constrained Hypotheses, manuscript under review","2807585":"Bayesian Identification of Outliers in Computerized Adaptive Tests","263353017":"Comparative investigation of three Bayesian values","235181832":"A Celebration of Statistics","251343350":"Bayesian nonparametric model selection and model testing","5110083":"Sensitivity Analysis and Model Evaluation in Simulated Dynamic General Equilibrium Economies","227626654":"Posterior Predictive p‐values in Bayesian Hierarchical Models","2469162":"Quantifying Surprise in the Data and Model Verification","222868056":"Asymptotic results in robust quasi-bayesian estimation","30990537":"Transformation Diagnostics for Linear Models","227602563":"Cross-Country Growth Regressions and What the Textbooks Don\u0027t Tell You","228825783":"Sequential change-point detection for time series models: assessing the functional dynamics of neuronal networks.","229576377":"A Goodness‐Of‐Fit Test for the Latent Class Model When Expected Frequencies Are Small","253084685":"Checking for Prior-Data Conßict with Hierarchically SpeciÞed Priors","41035627":"PHYSTAT-LHC Workshop on Statistical Issues for LHC Physics","50892307":"A New Calibrated Bayesian Internal Goodness-of-Fit Method: Sampled Posterior p-Values as Simple and General p-Values That Allow Double Use of the Data","2484537":"Outlier Measures and Norming Methods for Computerized Adaptive Tests","228414083":"A Bayesian EWMA for Mean and Variance","4914004":"How not to measure the efficiency of public services (and how one might)","27254463":"Probabilistic Methods for the Quantification of Uncertainty and Error in Computational Fluid Dynamic Simulations","29654758":"Statistical Decision Problems and Bayesian Nonparametric Methods","19328003":"TUTORIAL SECTION Analysis of Pharmacokinetic Data Using Parametric Models. II. Point Estimates of an Individual\u0027s Parameters.","254393356":"Bayesian Priors from Loss Matching","275595595":"The Logistic function as an aid in the detection of acute coronary disease in emergency patients (A Case Study)","229137024":"Nystagmus de convergence et paralysie de la verticalité du regard d’origine vasculaire","279378316":"Simulation in Research on Linear Models","222684783":"Hedge fund pricing and model uncertainty","225945692":"Robust bayesian estimation","237228301":"Risk of Bayesian Inference in Misspecified Models, and the Sandwich Covariance Matrix","229701760":"Comments on An inquiry into computer understanding by Peter Cheeseman","2402576":"Could Fisher, Jeffreys, and Neyman Have Agreed on Testing?","265089273":"Testing Hypotheses in Particle Physics: Plots of $p_{0}$ Versus $p_{1}$","260161208":"Hierarchical Generalized Linear Models","256501874":"The current state of Bayesian methods in medical product development: survey results and recommendations from the DIA Bayesian Scientific Working Group","282623460":"Inference after checking multiple Bayesian models for data conflict and applications to mitigating the influence of rejected priors","223424620":"Two methods for the structured assessment of model uncertainty by experts in performance assessments of radioactive waste repositories. Reliability Engineering \u0026 System Safety, 54, 225-241","45895553":"Relaxation Penalties and Priors for Plausible Modeling of Nonidentified Bias Sources","236866849":"Predictive Likelihood Comparisons with DSGE and DSGE-VAR Models","265313007":"Likelihood robustness","21597302":"On some applications of Bayesian methods in cancer clinical trials","281261954":"Beyond subjective and objective in statistics","241722154":"Asymptotic Distribution of P Values in Composite Null Models","263679221":"In Praise of Simplicity not Mathematistry! Ten Simple Powerful Ideas for the Statistical Scientist","228424926":"Assessing climate uncertainty using evaluations of several different climate simulators","242997048":"Stopping rules and the likelihood function","222700037":"Chapter 1 Bayesian Forecasting","258442275":"Bayesian threshold selection for extremal models using measures of surprise","265727121":"Bayesian factors","230581497":"Response to commentaries on our paper: Critical comments on dynamic causal modelling","23444013":"Fully Bayesian tests of neutrality using genealogical summary statistics","12217843":"Testing Thurstonian Case V ranking models using posterior predictive checks","268789071":"Comparison of confidence interval methods for an intra-class correlation coefficient (ICC)","29654664":"A Bayesian Formulation of Exploratory Data Analysis and Goodness–of–Fit Testing*","264425103":"Small area estimation of general parameters with application to poverty indicators: A hierarchical Bayes approach","5889303":"25 years of Bayesian methods in the pharmaceutical industry: A personal, statistical bummel","8411089":"Bayesian Correlated MAD Phasing","283618742":"guide13","227657923":"Bayesian analysis of mark‐recapture data with travel time‐dependent survival probabilities","223692289":"Posterior predictive model checking in hierarchical models","228775157":"Piecing together the past: Statistical insights into paleoclimatic reconstructions","2385267":"A Comparison Between P-Values for Goodness-of-fit Checking","239883547":"Conflict Diagnostics in Directed Acyclic Graphs, with Applications in Bayesian Evidence Synthesis","13404564":"Heritability Estimates from Human Twin Data by Incorporating Historical Prior Information","228983550":"Discussion of nested sampling for Bayesian computations by John Skilling","241681214":"Prior Distributions for Variance Parameters in Hierarchical Models","258528817":"Erratum to: The researcher and the consultant: a dialogue on null hypothesis significance testing","5140243":"Statistical Inference in Calibrated Models","3861349":"Synthesis of digital filter characteristics as a part of program FCAD-96 for filters synthesis","51677813":"Bayesian Meta-Experimental Design: Evaluating Cardiovascular Risk in New Antidiabetic Therapies to Treat Type 2 Diabetes","4817709":"Bayesian spatial prediction of the site index in the study of the Missouri Ozark Forest Ecosystem Project","260010522":"A general skew-t mixed model that allows different degrees of freedom for random effects and error distributions","24017417":"Model Selection Strategies in a Spatial Setting: Some Additional Results","220326472":"Assessment of Nonlinear Dynamic Models by Kolmogorov–Smirnov Statistics","4746529":"Evolutionary Similarity Among Genes","228671688":"A Reasoned Basis for Inference: Randomization and Design Justifying Estimation and Testing","51930226":"Calibrated Bayes, for Statistics in General, and Missing Data in\nParticular","51625592":"Conditional predictive inference for online surveillance of spatial disease incidence","45890513":"Notes to Robert et al.: Model criticism informs model choice and model comparison","228273910":"Analysis of Variance for Bayesian Inference","266707080":"Bayesian inference with misspecified models: Inference about what?","254286407":"Monitoring and Adaptation in Bayesian Forecasting Models","232834704":"Optimality of the posterior predictive p-value based on the posterior. Odds","276211973":"Iterating on a single model is a viable alternative to multimodel inference","227669218":"The Philosophy of Statistics","47226280":"Reply to Robert et al.: Model criticism informs model choice and model comparison","254332497":"Development in Linear Regression Methodology: 1959-1982","2553692":"Diagnostic Measures for Model Criticism","266719896":"Goodness-of-Fit Tests and Model Validity","257199147":"Bayesian measures of surprise for outlier detection","229750990":"Intent to treat: The Reductio ad absurdum that became gospel","239655370":"Bayesian Model Choice: Asymptotics and Exact Calculations","49756530":"Evidence and statistical summaries in environmental assessment","228764206":"Loss Function Estimation of Forecasting Models: A Bayesian Perspective","30864475":"Some Topics in Missing Data and Adaptive Confidence Intervals. Some Topics in Missing Data and Adaptive Confidence Intervals.","24065249":"Rejoinder on: Assessing probabilistic forecasts of multivariate quantities, with an application to ensemble predictions of surface winds","31102548":"Diagnostics for Heteroscedasticiy in Regression","4914117":"Applying discrete choice models to predict Academy Award winners","267680870":"P Values: What They Are and How to Use Them","257909448":"A coarse Bayesian approach to evaluate luminescence ages","2660784":"Pediatric Pain, Predictive Inference and Sensitivity Analysis","24079605":"Bayesian analysis of DSGE models","4725224":"Benchmark Priors for Bayesian Model Averaging","275508170":"Build, Compute, Critique, Repeat: Data Analysis with Latent Variable Models","290109678":"Modeling Customer Survey Data","2414464":"Loss function-based evaluation of DSGE models. J Appl Econom 15(6): 645-670","228859393":"Bayesian selection of multiresponse nonlinear regression model","228644873":"A Bayesian Sampling Approach to Regression Model Checking","243050454":"Bayesian P-Values for Testing Independence in 2 × 2 Contingency Tables","2485646":"Bayesian Model Choice for the Short Term US Interest Rate","221677210":"A Fully Bayesian Approach to Assessment of Model Adequacy in Inverse\nProblems","254286981":"The Cost of Generalizing Logistic Regression","42767650":"A Score Regression Approach to Assess Calibration of Continuous Probabilistic Predictions","47799657":"Posterior Predictive Analysis for Evaluating DSGE Models","242042845":"That Wretched Prior: Online Appendix to \\A Practical Solution to the Pervasive Problems of p{Values\", to appear in Psychonomic Bulletin \u0026 Review","257940719":"Monte Carlo Methods in Bayesian Statistics","230726770":"Assessing Effects of Unreplicated Perturbations: No Simple Solutions","261588003":"Bayesian ikference procedures derived via the concept of relative surprise","254288028":"A Hierarchical Latent Variable Model for Ordinal Data from a Customer Satisfaction Survey with “No Answer” Responses","24065241":"Assessing probabilistic forecasts of multivariate quantities, with applications to ensemble predictions of surface winds","41663425":"Bayesian Models for Computer-Aided Underwriting","2378655":"Measures of Surprise in Bayesian Analysis","4791282":"Posterior predictive \"p\"-values for classical null hypotheses","19086493":"A non-parametric confidence interval method","47799654":"A Forecasting Metric for Evaluating DSGE Models for Policy Analysis","38359944":"Calibration-Based Empirical Probability","251182393":"P Values and Nuisance Parameters","270369247":"Identification and Accommodation of Outliers in General Hierarchical Models","14276379":"A control-conditional test for assessing HIV vaccine efficacy in small sample perclinical studies","35925984":"Bayesian model checking strategies for dichotomous item response theory models [electronic resource] /","233901111":"Living with Statistics in Observational Research","2679777":"An Approach to Bayesian Sensitivity Analysis","257557651":"A zero-inflated Bayesian spatial model with near-locating measurements","47327000":"Rejoinder: Likelihood Inference for Models with Unobservables Another View","47341337":"Posterior predictive checks: Principles and discussion","47646492":"Semi-parametric dynamic time series modelling with applications to detecting neural dynamics","7072166":"Assessing model mimicry using the parametric bootstrap","23953085":"Comparison of Hierarchical Bayesian Models for Overdispersed Count Data using DIC and Bayes\u0027 Factors","254394617":"A Graphical Diagnostic for Identifying Influential Model Choices in Bayesian Hierarchical Models","4849560":"Bayesian Robustness Of The Posterior Predictive P-Value","259335335":"Sensitivity Analysis for Bayesian Hierarchical Models","261440070":"A Conversation with Donald B. Rubin","228739702":"Bayesian Updating of Parameters for a Sediment Entrainment Model Via Markov Chain Monte Carlo","227152477":"Relevance of the Bayesian paradigm for “applied probabilists”","247914783":"The Insignificance of Statistical Significance Test","277943112":"Uniformity of Node Level Conflict Measures in Bayesian Hierarchical Models Based on Directed Acyclic Graphs","222054118":"Robust Bayesian diagnostics","277512528":"Model Choice: A Minimum Posterior Predictive Loss Approach","280676199":"Model Verification and the Likelihood Principle","265325069":"Bayesian reasoning. Modeling and inference","2296318":"Semiparametric Bayesian Analysis Of Survival Data","228984440":"A Bayesian control chart for service quality control","222463645":"Languages and Designs for Probability Judgment*","23633544":"Diagnostics for penalized least-squares estimators","262292546":"Signal-to-Noise Ratios, Performance Criteria, and Transformations","243083167":"Comparing Probabilistic Methods for Outlier Detection in Linear Models","2178499":"Evaluation of three methods for calculating statistical significance when incorporating a systematic uncertainty into a test of the background-only hypothesis for a Poisson process","228930118":"A Constructivist View of the Statistical Quantification of Evidence","2232769":"Bayesian Checking of the Second Levels of Hierarchical Models","46584611":"The Predictive Lasso","3991001":"Assessing Local Impacts: Progress and Some Problems","12351833":"Effects of tannins and related polyphenols on superoxide-induced histamine release from rat peritoneal mast cells","246922065":"Multivariate fixed- and random-effects models for summarizing ordinal data in meta-analysis of diagnostic staging studies","223119019":"“Bayesian Regression Diagnostics with Applications to International Consumption and Income Data”","19257026":"A formal approach to symptoms in dyspepsia","227946609":"Discrimination and Goodness of Fit of Multiresponse Mechanistic Models","227740276":"Exact P-values for discrete models obtained by estimation and maximisation","27515978":"Bayesian Model Assessment and Selection Using Expected Utilities","226714735":"Invariance, Symmetry And Rationality","232910350":"Uncertainty in Designed Experiments","4914106":"A Hierarchical Modelling Framework for Identifying Unusual Performance in Health Care Providers","14697233":"The use of Bayesian analysis of PCR-derived genomic DNA sequences to enable a biologically relevant interpretation of immunoglobulin variable region gene expression.","225359519":"Multivariate Probabilistic Projections Using Imperfect Climate Models. Part I: Outline of Methodology","13904160":"Bayesian alignment and inference","243768179":"Bayesian Approaches to Randomized Trials","263141467":"Bayesian Analysis of Ordinal Survey Data Using the Dirichlet Process to Account for Respondent Personality Traits","49695488":"Meta-analysis of diagnostic test data: A bivariate Bayesian modeling approach","236952040":"Ecology, statistics, and the art of misdiagnosis: The need for a paradigm shift","233778199":"Lower posterior death probabilities from a quick medical response in road traffic accidents","241721747":"Statistical Test Based on Transformed Data","239059908":"Bayesian Methods in Practice: Experiences in the Pharmaceutical Industry","24083601":"Strategies for inference robustness in focused modelling","4914100":"Theoretic and empirical data-inclusive process characterization"},"index":863}