{"abs":"Many practical optimization problems are dynamically changing, and require a tracking of the global optimum over time. However, tracking usually has to be quick, which excludes re-optimization from scratch every time the problem changes. Instead, it is important to make good use of the history of the search even after the environment has changed. In this paper, we consider Efficient Global Optimization (EGO), a global search algorithm that is known to work well for expensive black box optimization problems where only few function evaluations are possible. It uses metamodels of the objective function for deciding where to sample next. We propose and compare four methods of incorporating old and recent information in the metamodels of EGO in order to accelerate the search for the global optima of a noise-free objective function stochastically changing over time. As we demonstrate, exploiting old information as much as possible significantly improves the tracking behavior of the algorithm.","title":"Tracking global optima in dynamic environments with efficient global optimization","id":270053330,"url":"https://www.researchgate.net/publication/270053330_Tracking_global_optima_in_dynamic_environments_with_efficient_global_optimization","names":["Sergio Morales-Enciso","Juergen Branke","European Journal of Operational Research"],"references":{"242383792":"Optimization for Simulation: Theory vs. Practice","226200574":"A Review of Recent Advances in Global Optimization","43299986":"Wilcoxon–Mann–Whitney or t-test? On assumptions for hypothesis test and multiple interpretations of decision rules","242591539":"Individual Comparisons by Ranking Methods. Biom Bull","3421747":"Combining global and local surrogate models to accelerate evolutionary optimization. IEEE Trans Syst Man Cybern Part C Appl Rev","228677353":"Multi-fidelity optimization via surrogate modelling","41781559":"Gaussian Process for Machine Learning","216300585":"Introduction To Evolutionary Computing","238681257":"An Investigation into the Use of Hypermutation as an Adaptive Operator in Genetic Algorithms Having Continuous, Time-Dependent Nonstationary Environments","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","278185606":"Response Surfaces with Discounted Information for Global Optima Tracking in Dynamic Environments","48190924":"Convergence rates of efficient global optimization algorithms","222071209":"Stochastic radial basis function algorithms for large-scale optimization involving expensive black-box objective and constraint functions","269996418":"Gaussian Processes for Machine Learning (Adaptive Computation and Machine Learning)","262495155":"Evolutionary Dynamic Optimization: A Survey of the State of the art","245135498":"A Versatile Stochastic Model of a Function of Unknown and Time-Varying Form","237773755":"Handbook of Global Optimization","220133318":"The Correlated Knowledge Gradient for Simulation Optimization of Continuous Parameters using Gaussian Process Regression","216300861":"A Taxonomy of Global Optimization Methods Based on Response Surfaces","220668798":"The Knowledge-Gradient Policy for Correlated Normal Beliefs","261283787":"Selecting random Latin hypercube dimensions and designs through estimation of maximum absolute pairwise correlation","221008054":"Model-based Optimization Revisited: Towards Real-World Processes","222662110":"Kriging metamodeling in simulation: a review. Eur J Oper Res","234834403":"PSO Based on Surrogate Modelling as Meta-Search to Optimise Evolutionary Algorithms Parameters","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","31050886":"A Simplex Method for Function Minimization Comput","220258688":"A Knowledge-Gradient Policy for Sequential Information Collection","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","224472194":"Detecting change in dynamic fitness landscapes","227145388":"Expected improvement in efficient global optimization through bootstrapped kriging","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","220669056":"Optimization for simulation: theory vs. practice. INFORMS J Comput","226923694":"Survey of modeling and optimization strategies to solve high-dimensional design problems with computationally-expensive black-box functions","268164688":"Stochastic global optimization","216300810":"Handbook Global Optimization","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","221346309":"Active learning for directed exploration of complex systems","257196128":"Multicanonical jump walk annealing assisted by tabu for dynamic optimization of chemical engineering processes","220695762":"InformationTheory, Inference, and Learning Algorithms","3810317":"Memory Enhanced Evolutionary Algorithms for Changing Optimization Problems","224177826":"A surrogate-assisted evolutionary algorithm for minimax optimization","46491387":"Speeding up continuous GRASP","220175968":"Optimization in dynamic environments: a survey on problems, methods and measures. Soft Comput"},"citedIn":{},"index":866}