{"abs":"Bayesian optimization has recently emerged as a popular and efficient tool for global optimization and hyperparameter tuning. Currently, the established Bayesian optimization practice requires a user-defined bounding box which is assumed to contain the optimizer. However, when little is known about the probed objective function, it can be difficult to prescribe such bounds. In this work we modify the standard Bayesian optimization framework in a principled way to allow automatic resizing of the search space. We introduce two alternative methods and compare them on two common synthetic benchmarking test functions as well as the tasks of tuning the stochastic gradient descent optimizer of a multi-layered perceptron and a convolutional neural network on MNIST.","title":"Unbounded Bayesian Optimization via Regularization","id":281084649,"url":"https://www.researchgate.net/publication/281084649_Unbounded_Bayesian_Optimization_via_Regularization","names":["Bobak Shahriari","Alexandre Bouchard-Côté","Nando de Freitas"],"references":{"221345649":"Gaussian Process Optimization in the Bandit Setting: No Regret and Experimental Design","50402307":"Gaussian Processes for Machine Learning (GPML) toolbox","272522140":"Scalable Bayesian Optimization Using Deep Neural Networks","262395872":"Random Search for Hyper-Parameter Optimization","51969726":"Entropy Search for Information-Efficient Global Optimization","230859045":"Thompson Sampling for Contextual Bandits with Linear Payoffs","224983695":"Thompson Sampling: An Asymptotically Optimal Finite Time Analysis","216816964":"Algorithms for Hyper-Parameter Optimization","225307589":"Practical Bayesian Optimization of Machine Learning Algorithms","227701432":"A modern Bayesian look at the multi‐armed bandit","235710112":"Sequential Model-Based Parameter Optimisation: an Experimental Investigation of Automated and Interactive Approaches","266529330":"An Empirical Evaluation of Thompson Sampling","201976635":"On the Likelihood That One Unknown Probability Exceeds Another in View of the Evidence of Two Samples","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","263012187":"Predictive Entropy Search for Efficient Global Optimization of Black-box Functions","263160696":"A Taxonomy of Global Optimization Methods Based on Response Surfaces","51949507":"Bayesian Optimization for Adaptive MCMC","248818761":"The application of Bayesian methods for seeking the extremum"},"citedIn":{},"index":868}