{"abs":"It is known that Pareto dominance has its own weaknesses as the selection criterion in evolutionary multi-objective optimization. Algorithms based on Pareto dominance can suffer from slow convergence to the optimal front, inferior performance on problems with many objectives, etc. Non-Pareto criterion, such as decomposition-based criterion and indicator-based criterion, has already shown promising results in this regard, but its high selection pressure may lead the algorithm to prefer some specific areas of the problem’s true Pareto front, especially when the front is highly irregular. In this paper, we propose a bi-criterion evolution framework of Pareto criterion and non-Pareto criterion, which attempts to make use of their strengths and compensates for each other’s weaknesses. The proposed framework consists of two parts, Pareto criterion evolution and non-Pareto criterion evolution. The two parts work collaboratively, with an abundant exchange of information to facilitate each other’s evolution. Specifically, the non-Pareto criterion evolution leads the Pareto criterion evolution forward and the Pareto criterion evolution compensates the possible diversity loss of the non-Pareto criterion evolution. The proposed framework keeps the freedom on the implementation of the non-Pareto criterion evolution part, thus making it applicable for any non-Pareto-based algorithm. In the Pareto criterion evolution, two operations, population mainte- nance and individual exploration, are presented. The former is to maintain a set of representative nondominated individuals, and the latter is to explore some promising areas which are undeveloped (or not well-developed) in the non-Pareto criterion evolution. Experimental results have shown the effectiveness of the proposed framework. The bi-criterion evolution works well on seven groups of 42 test problems with various characteristics, including those where Pareto-based algorithms or non-Pareto- based algorithms struggle.","title":"Pareto or Non-Pareto: Bi-Criterion Evolution in Multi-Objective Optimization","id":284719460,"url":"https://www.researchgate.net/publication/284719460_Pareto_or_Non-Pareto_Bi-Criterion_Evolution_in_Multi-Objective_Optimization","names":["Miqing Li","Shengxiang Yang","Xiaohui Liu","IEEE Transactions on Evolutionary Computation"],"references":{"265021130":"A test problem for visual investigation of high-dimensional multi-objective search","259179376":"Stable Matching Based Selection in Evolutionary Multiobjective Optimization","261141271":"Fuzzy-Based Pareto Optimality for Many-Objective Evolutionary Algorithms","3419059":"AbYSS: Adapting Scatter Search to Multiobjective Optimization","275369184":"An External Archive Guided Multiobjective Evolutionary Algorithm Based on Decomposition for Combinatorial Optimization","280534066":"Bi-goal evolution for many-objective optimization problems","220381225":"A review of multiobjective test problems and a scalable test problem toolkit.","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","235701505":"Distance Based Ranking in Many-Objective Particle Swarm Optimization","258551782":"Incorporation of Hypervolume Approximation with Scalarizing Functions into Indicator-Based Evolutionary Multiobjective Optimization Algorithms","4201424":"GDE3: The third evolution step of generalized differential evolution","253348620":"A Grid-Based Evolutionary Algorithm for Many-Objective Optimization","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","237094200":"ETEA: A Euclidean Minimum Spanning Tree-Based Evolutionary Algorithm for Multi-Objective Optimization","280534179":"A Performance Comparison Indicator for Pareto Front Approximations in Many-Objective Optimization","265602507":"Two_Arch2: An Improved Two-Archive Algorithm for Many-Objective Optimization","221162126":"Multiobjective optimization by decomposition with Pareto-adaptive weight vectors","261053613":"A ranking method based on the R2 indicator for many-objective optimization","274568575":"Theory of the hypervolume indicator: optimal μ-distributions and the choice of the reference point","265021421":"A Comparative Study on Evolutionary Algorithms for Many-Objective Optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","216457303":"Indicator-Based Selection in Multiobjective Search","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","265432807":"Multiobjective optimization Test Instances for the CEC 2009 Special Session and Competition","221008662":"Multiple Trajectory Search for Unconstrained/Constrained Multi-Objective Optimization","261054003":"Ranking many-objective Evolutionary Algorithms using performance metrics ensemble","224330083":"Evolutionary Many-Objective Optimization: A Short Review","224472028":"The performance of a new version of MOEA/D on CEC09 unconstrained MOP test instances","3904004":"Failure of Pareto-based MOEAs: Does non-dominated really mean near to optimal?","263286000":"An improved version of the multiple trajectory search for real value multi-objective optimization problems","260621901":"Objective Reduction in Many-Objective Optimization: Linear and Nonlinear Algorithms","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","282326932":"Ranking Methods in Many-Objective Evolutionary Algorithms","220701536":"A Fast and Effective Method for Pruning of Non-dominated Solutions in Many-Objective Problems","224301847":"Indicator-based multi-objective local search","253359061":"Shift-Based Density Estimation for Pareto-Based Algorithms in Many-Objective Optimization","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","260621913":"A Hybrid Framework for Evolutionary Multi-Objective Optimization","274263562":"Behavior of Multiobjective Evolutionary Algorithms on Many-Objective Knapsack Problems","257888652":"Evolutionary Algorithms With Segment-Based Search for Multiobjective Optimization Problems","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","221228537":"An Elitist GRASP Metaheuristic for the Multi-objective Quadratic Assignment Problem","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","224214406":"A Pareto Corner Search Evolutionary Algorithm and Dimensionality Reduction in Many-Objective Optimization Problems","265408780":"Techniques to Deal with Many-objective Optimization Problems Using Evolutionary Algorithms","220743285":"Using a distance metric to guide PSO algorithms for many-objective optimization","264387359":"An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point-Based Nondominated Sorting Approach, Part I: Solving Problems With Box Constraints","256276504":"Generalized Decomposition","47843204":"Multiplicative Approximations and the Hypervolume Indicator","280631909":"Online Diversity Assessment in Evolutionary Multiobjective Optimization: A Geometrical Perspective","281339301":"Pareto-, aggregation-, and indicator-based methods in many-objective optimization","45868377":"Techniques for Highly Multiobjective Optimisation: Some Nondominated Points are Better than Others","266653824":"A fast approximation-guided evolutionary multi-objective algorithm","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","269187692":"A Simple and Fast Hypervolume Indicator-Based Multiobjective Evolutionary Algorithm","225132675":"Controlling Dominance Area of Solutions and Its Impact on the Performance of MOEAs","260134761":"Consistencies or Contradictions of Performance Metrics in Multiobjective Optimization?","239946277":"MOEA/D with adaptive weight adjustment","254462273":"On the Properties of the R2 Indicator","220812487":"Approximation-Guided Evolutionary Multi-Objective Optimization.","220701896":"Many-Objective Test Problems to Visually Examine the Behavior of Multiobjective Evolution in a Decision Space","2609749":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations","225141790":"Framework for Many-Objective Test Problems with Both Simple and Complicated Pareto-Set Shapes","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","228622427":"Evolutionary multi-objective optimization and its use in finance","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","5826087":"Pareto-adaptive ε-dominance"},"citedIn":{},"index":872}