{"abs":"We propose a new approach to the computation of the hypervolume indicator, based on partitioning the dominated region into a set of axis-parallel hyperrectangles or boxes. We present a nonincremental algorithm and an incremental algorithm, which allows insertions of points, whose time complexities are O(n p−1 2 +1) and O(n p 2 +1), respectively. While the theoretical complexity of such a method is lower bounded by the complexity of the partition, which is, in the worst-case, larger than the best upper bound on the complexity of the hypervolume computation, we show that it is practically efficient. In particular, the nonincremental algorithm competes with the currently most practically efficient algorithms. Finally, we prove an enhanced upper bound of O(n p−1) and a lower bound of Ω(n p 2 log n) for p ≥ 4 on the worst-case complexity of the WFG algorithm.","title":"A Box Decomposition Algorithm to Compute the Hypervolume Indicator","id":282665709,"url":"https://www.researchgate.net/publication/282665709_A_Box_Decomposition_Algorithm_to_Compute_the_Hypervolume_Indicator","names":["Renaud Lacour","Kathrin Klamroth","Carlos M Fonseca"],"references":{"281339301":"Pareto-, aggregation-, and indicator-based methods in many-objective optimization","3949503":"Scalable multi-objective optimization test problems","236886938":"A linear bound on the number of scalarizations needed to solve discrete tricriteria optimization problems","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","272752333":"On the representation of the search region in multi-objective optimization","46620331":"Computational Geometry: Algorithms and Applications","224579855":"On the Complexity of Computing the Hypervolume Indicator","261054434":"Klee\u0027s Measure Problem Made Easy","220090539":"A two phase method for multi-objective integer programming and its application to the assignment problem with three objectives","267511239":"Empirical Performance of the Approximation of the Least Hypervolume Contributor","2634673":"Multiobjective Optimization Using Evolutionary Algorithms --- A Comparative Case Study","229431286":"A fast dimension-sweep algorithm for the hypervolume indicator in four dimensions","3418862":"A faster algorithm for calculating hypervolume","220381049":"A Fast Way of Calculating Exact Hypervolumes"},"citedIn":{},"index":876}