{"abs":"Variations of manufacturing process parameters, environment aspects, and imperfections may significantly affect the quality and performance of stiffened shells. The reliability-based design optimization (RBDO) of stiffened shells, considering all these uncertainty factors simultaneously, is extremely time-consuming, even if the surrogate-based technology is used. Therefore, a hybrid bi-stage framework for RBDO of stiffened shells is presented to release the computational burden, where two main sources of uncertainties are considered: variations of material properties and geometric dimensions are described as random variables, while various forms of imperfections of stiffened shells are covered by the single perturbation load approach. The basic idea of the proposed method is to combine the efficiency of smeared stiffener method with the accuracy of finite element method, and then narrow the design window efficiently with little accuracy sacrifice. The adaptive chaos control method is used to ensure the robustness of the search process of the most probable target point. The numerical example illustrates the advantage of the proposed method over other RBDO approaches from the point of view of computational cost, accuracy and robustness of the result.","title":"Hybrid Framework for Reliability-Based Design Optimization of Imperfect Stiffened Shells","id":275026075,"url":"https://www.researchgate.net/publication/275026075_Hybrid_Framework_for_Reliability-Based_Design_Optimization_of_Imperfect_Stiffened_Shells","names":["Peng Hao","Bo Wang","Gang Li","Zeng Meng","et al","AIAA Journal"],"references":{"223223631":"Understanding imperfection-sensitivity in the buckling of thin-walled shells","222740164":"Optimum design of composite stiffened panels under combined loads","225120104":"Reliability-based design optimization for crashworthiness of vehicle side impact","275870965":"Generatrix shape optimization of stiffened shells for low imperfection sensitivity","260815375":"Non-Classical Problems in the Theory of Elastic Stability","262937508":"Worst Multiple Perturbation Load Approach of stiffened shells with and without cutouts for improved knockdown factors","259443198":"Design Optimization of Composite Cylindrical Shells Under Uncertainty","245059345":"Buckling analysis of imperfect shells with stochastic non-Gaussian material and thickness properties","245059344":"Nonlinear buckling optimization of composite structures considering “worst” shape imperfections","223564511":"Surrogate-based analysis and optimization","223762500":"Giavotto, V.: Post-buckling optimization of composite stiffened panels: computations and experiments. Compos Struct. 73, 208-220","271873062":"Probabilistic resolution of 20th century conundrum in elastic stability","265966925":"Surrogate-based optimization of stiffened shells including load-carrying capacity and imperfection sensitivity","223806016":"Uncertainty analysis of stiffened composite panels","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","227319575":"Comparative Studies of Metamodeling Techniques Under Multiple Modeling Criteria","24287343":"Shell Buckling Design Criteria Based on Manufacturing Imperfection Signatures","258569206":"Optimization and Antioptimization of Buckling Load for Composite Cylindrical Shells Under Uncertainties","224999368":"Robust design of composite cylindrical shells under axial compression—simulation and validation. Thin-Walled Struct","262235397":"Future structural stability design for composite space and airframe structures","253361343":"Reliability-based structural optimization using response surface approximations and probabilistic sufficiency factor","258739014":"Lower-Bound Analysis of Fiber-Reinforced Polymeric Laminated Cylindrical Shells","233893596":"Optimum design of shell structures with random geometric, material and thickness imperfections","223088354":"Buckling of thin cylindrical shells under axial compression","269162148":"An Adaptive Reliability-Based Design Optimization Approach using Modified Chaos Control Method","24313537":"Buckling of thin-walled circular cylinders","259518660":"Accounting for future redesign to balance performance and development costs","245425942":"Toward a Probabilistic Preliminary Design Criterion for Buckling Critical Composite Shells","272856063":"Knockdown Factor based Imperfection Sensitivity Analysis for Stiffened Shells","245058087":"Uncertain buckling: Its past, present and future","225005911":"Probabilistic Design of Axially Compressed Composite Cylinders with Geometric and Loading Imperfections","266397278":"A hybrid chaos control approach of the performance measure functions for reliability-based design optimization","258569000":"Surrogate-Based Optimum Design for Stiffened Shells with Adaptive Sampling","262990191":"Optimum design of hierarchical stiffened shells for low imperfection sensitivity","257335187":"Determination of realistic worst imperfection for cylindrical shells using surrogate model","4695808":"Haftka, R.: Optimization of laminate stacking sequence for buckling load maximization by genetic algorithm. AIAA J 31, 951-956","261918160":"Hybrid optimization of hierarchical stiffened shells based on smeared stiffener method and finite element method","225005477":"Investigations on imperfection sensitivity and deduction of improved knock-down factors for unstiffened CFRP cylindrical shells","243787593":"Hybrid Analysis Method for Reliability-Based Design Optimization","223644034":"Static collapse: A survey of methods and modes of behavior","223805961":"Vulnerability-based robust design optimization of imperfect shell structures. Struct Saf","222736547":"Collapse of axially compressed cylindrical shells with random imperfections","223607989":"Reliability-based knockdown factors for composite cylindrical shells under axial compression. Thin-Walled Struct","260389613":"Reliability assessment of axially compressed composite cylindrical shells with random imperfections","226317334":"The Use of Metamodeling Techniques for Optimization Under Uncertainty","259901329":"Perturbation-based imperfection analysis for composite cylindrical shells buckling in compression","257306278":"Buckling analysis of imperfect shells with stochastic non-Gaussian material and thickness properties","226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","259570569":"Theory of Shell Structures","223390497":"Buckling load analysis of grid stiffened composite cylinders","227900388":"Preliminary design optimization of stiffened panels using approximate analysis models","258658207":"Statistical Knockdown Factors of Buckling Anisotropic Cylinders Under Axial Compression","265058871":"Two-stage size-layout optimization of axially compressed stiffened panels"},"citedIn":{"280102289":"Optimization of Curvilinearly Stiffened Panels with Single Cutout Concerning the Collapse Load","289693374":"Efficient Optimization of Cylindrical Stiffened Shells with Reinforced Cutouts by Curvilinear Stiffeners","283309661":"Imperfection-Insensitive Design of Stiffened Conical Shells based on Perturbation Load Approach"},"index":879}