{"abs":"We consider the problem of efficient estimation of tail probabilities of sums of correlated lognormals via simulation. This problem is motivated by the tail analysis of portfolios of assets driven by correlated Black-Scholes models. We propose two estimators that can be rigorously shown to be efficient as the tail probability of interest decreases to zero. The first estimator, based on importance sampling, involves a scaling of the whole covariance matrix and can be shown to be asymptotically optimal. A further study, based on the Cross-Entropy algorithm, is also performed in order to adaptively optimize the scaling parameter of the covariance. The second estimator decomposes the probability of interest in two contributions and takes advantage of the fact that large deviations for a sum of correlated lognormals are (asymptotically) caused by the largest increment. Importance sampling is then applied to each of these contributions to obtain a combined estimator with asymptotically vanishing relative error. 2009 Springer Science+Business Media, LLC.","title":"Efficient simulation of tail probabilities of sums of correlated lognormals","id":49514135,"url":"https://www.researchgate.net/publication/49514135_Efficient_simulation_of_tail_probabilities_of_sums_of_correlated_lognormals","names":["Soren Asmussen","Jose Blanchet","Sandeep Juneja","Leonardo Rojas-Nandayapa","Annals of Operations Research"],"references":{"245453665":"Applied Probability and Queues John Wiley \u0026 Sons","5142798":"Numerical Computation of Multivariate Normal and Multivariate-t Probabilities over Convex Regions","220084382":"Editorial: Rare-event simulation for queues","228940071":"Cross-Entropy Method","230663741":"Distributions. In Continuous Univariate Distributions, Vol. 2","225713713":"Estimating tail probabilities of heavy tailed distributions with asymptotically zero relative error","235622467":"Quantitative Risk Management: Concepts, Techniques, Tools","228525907":"Loss Distribution Approach in Practice","220136275":"Asymptotics and fast simulation for tail probabilities of maximum of sums of few random variables","265727384":"Stochastic Simulation: Algorithms and Analysis","32012839":"Applied Probability and Queues","271513121":"The Cross-Entropy Method","264995908":"Modeling Extremal Events: For Insurance and Finance","220136464":"Importance sampling for sums of random variables with regularly varying tails","2800954":"Simulating Heavy Tailed Processes Using Delayed Hazard Rate Twisting","216301303":"Adventures in Stochastic Processes","237107634":"Continuous Univariate Distributions - II","23636158":"Asymptotics of sums of lognormal random variables with Gaussian copula. Stat Prob Lett","228632440":"Rare event simulation techniques: An introduction and recent advances","222491736":"Stochastic bounds on sums of dependent risks","251463777":"Chapter 11 Rare-Event Simulation Techniques: An Introduction and Recent Advances","225532462":"Tail asymptotics for the sum of two heavy-tailed dependent risks","2466874":"Comparison of Methods for the Computation of Multivariate Normal Probabilities","265815481":"An Introduction to Rare Event Simulation","228057717":"An Introduction to Probability Theory and Its Applications II","237460933":"Sums of dependent lognormal random variables: asymptotics and simulation","225828439":"Monte Carlo Methods","235622440":"Monte Carlo Methods in Financial Engineering","221525777":"Efficient tail Estimation for sums of correlated Lognormals","220136506":"An Efficient SinglePass Trace Compression Technique Utilizing Instruction Streams","220085048":"Fluid heuristics, Lyapunov bounds and efficient importance sampling for a heavy-tailed G/G/1 queue","267239746":"Risk Probabilities: Asymptotics and Simulation","1748970":"Efficient rare-event simulation for the maximum of heavy-tailed random walks. Ann Appl Probab","24055517":"Bounds for Functions of Dependent Risks","37616846":"Improved Algorithms for Rare Event Simulation With Heavy Tails","261623084":"Multivariate Models and Dependence Concepts","223497967":"Diversification of aggregate dependent risks","3885893":"Introduction to simulation","221527818":"Simulating heavy tailed processes using delayed hazard rate twisting. ACM Trans Model Comput Simul","232657505":"Gaussian importance sampling and stratification: computational issues"},"citedIn":{"4311137":"Variational Kullback-Leibler divergence for Hidden Markov models","281627882":"R.AHK13Feb2015","256498826":"Tail behavior of sums and differences of log-normal random variables","254211651":"Efficient simulation of tail probabilities of sums of dependent random variables","257665533":"Markov chain importance sampling with applications to rare event probability analysis","256760491":"Exact tail asymptotics of aggregated parametrised risk","254050531":"A reflection-based variance reduction technique for sum of random variables","262071159":"Asymptotic tail probability of randomly weighted large risks","269289444":"Tail Behavior and Limit Distribution of Maximum of Logarithmic General Error Distribution","262299726":"AHK2014V1","262991872":"Asymptotic tail probability of randomly weighted large risks","264545801":"Tail Behavior of Weighted Sums of Order Statistics of Dependent Risks","257194938":"Efficient simulation of tail probabilities for sums of log-elliptical risks","4102609":"Integrated 0.9 V charge-control switching converter with self-biased current sensor","261960818":"Efficient Simulations for the Exponential Integrals of Holder Continuous Gaussian Random Fields","260946558":"Exponential Family Techniques for the Lognormal Left Tail","259804008":"Tail Asymptotics of Random Sum and Maximum of Log-Normal Risks","281539664":"Aggregation of randomly weighted large risks","251712760":"State-dependent importance sampling for rare-event simulation: An overview and recent advances","251317380":"Exact Tail Asymptotics of the Total Loss of Largest Claim Reinsurance Treaties","257620229":"Second Order Asymptotics of Aggregated Log-Elliptical Risk"},"index":882}