{"abs":"The impact of model microphysics on the relationships between microphysical variables and derived satellite microwave brightness temperatures (T B\u0027s) and on the retrievals of microphysical variables was using a three-dimensional, nonhydrostatic, adaptive-grid cloud model to simulate two mesoscale convective systems, one over land and one over ocean. Four microphysical schemes (each employing 3-ice bulk parameterizations) were compared in both convective and stratiform precipitation using Empirical Orthogonal Function analysis. The validity of the microphysical schemes suggests that over land the model microphysical schemes produce too much reflectivity aloft and too rapid a decrease in reflectivity from the melting level to the surface, and over ocean the simulations produced more graupel and not enough rain. Model microphysics had a noticeable impact on the relations between the hydrometeor structure and TB\u0027s. Classified in terms of TB \u0027s, the microphysical schemes produce significantly different mean vertical profiles of cloud water, cloud ice, snow, vertical velocity, and latent heating, especially in stratiform clouds. Vertical velocity and latent heating in simulated stratiform clouds were not well correlated with TB\u0027s for any of the Tropical Rainfall Measuring Mission (TRMM) Microwave Imager (TMI) frequencies. Differences in the amount of supercooled cloud water produced in the various schemes accounted for much of the variation in TB relations. The uncertainty in retrieving hydrometeor and latent heating profiles for passive microwave measurements has been examined quantitatively. The four microphysical schemes exhibited analogous uncertainties in retrieving rain and graupel, but very different uncertainties in retrieving cloud water, cloud ice, and snow. The uncertainty in retrieving latent heating appears to be related to the insensitivity of TMI frequencies to cloud water, cloud ice, and snow. Structural differences in hydrometeor and latent heating profiles of 15-60% and 60-140%, respectively, correspond to only a few degrees of difference in TB\u0027s at TMI frequencies. After the model outputs are area-averaged over 42 x 42 km2, the low resolutions exhibit a large decrease in the structural differences in convective region, but a slight decrease in stratiform region. The ability to detect these hydrometeor species is needed to improve the retrieval of latent heating in convective systems.","title":"Sensitivity of hydrometeor profiles and satellite brightness temperatures to model microphysics for MCSs over land and ocean: Model comparison using EOF analysis and implications for rain and latent heat retrievals","id":238025811,"url":"https://www.researchgate.net/publication/238025811_Sensitivity_of_hydrometeor_profiles_and_satellite_brightness_temperatures_to_model_microphysics_for_MCSs_over_land_and_ocean_Model_comparison_using_EOF_analysis_and_implications_for_rain_and_latent_he","names":["Eun-Kyoung Seo"],"references":{"249608864":"The Mesoscale and Microscale Structure and Organization of Clouds and Precipitation in Midlatitude Cyclones. XII: A Diagnostic Modeling Study of Precipitation Development in Narrow Cold-Frontal Rainbands","23912302":"Microwave Simulations of a Tropical Rainfall System with a Three-Dimensional Cloud Model","23581508":"Microwave Radiance from Precipitating clouds containing aspherical ice, combined phase and liquid hydrometeors","4664833":"Foundations for Statistical-Physical Precipitation Retrieval from Passive Microwave Satellite Measurements. Part I: Brightness-Temperature Properties of a Time-dependent Cloud-Radiation Model","23912490":"Comparison of Ice-Phase Microphysical Parameterization Schemes Using Numerical Simulations of Tropical Convection","230891428":"Some Implications of the Mesoscale Circulations in Tropical Cloud Clusters for Large-Scale Dynamics and Climate","216681389":"Goddard Cumulus Ensemble Model. Part I: Model Description","252531077":"Foundations for StatisticalÂ Physical Precipitation Retrieval from Passive Microwave Satellite Measurements. Part II: Emission-Source and Generalized Weighting-Function Properties of a Time-dependent Cloud-Radiation Model","239743271":"A Method for Combined PassiveActive Microwave Retrievals of Cloud and Precipitation Profiles","253085637":"Diagnosis of Extratropical Variability in Seasonal Integrations of the ECMWF Model","23603098":"A Satellite Infrared Technique to Estimate Tropical Convective and Stratiform Rainfall","23875614":"A proposed Tropical Rainfall Measuring Mission (TRMM) Satellite","3700460":"Rain profiling algorithm for the TRMM precipitation radar","248796674":"A methodology for assessing ensemble experiments","234246543":"a Quantitative Study of the `BRIGHT Band\u0027 in Radar Precipitation Echoes.","234363650":"The Role of Organized Unsaturated Convective Downdrafts in the Structure and Rapid Decay of an Equatorial Disturbance","234184526":"On Precipitation Mechanisms and their Artificial Modification","23704277":"Some Comments on Passive Microwave Measurement of Rain","248787371":"Thermal microwave radiances from horizontally finite clouds of hydrometeors"},"citedIn":{"276184420":"Rainfall Characteristics in the Tropical Oceans: Observations using TRMM TMI and PR","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","243435366":"Anisotropy of the GaAs(001)-β2(2×4) surface from high-resolution electron energy loss spectroscopy","2166023":"Quantum mechanics of Dirac particle beam optics: Single-particle theory","224140682":"A new type of temperature driven reorientation transition in magnetic thin films","242150953":"Impact of Cloud Model Microphysics on Passive Microwave Retrievals of Cloud Properties. Part II: Uncertainty in Rain, Hydrometeor Structure, and Latent Heating Retrievals","23809297":"Microphysical and Radiative Characteristics of Convective Clouds during COHMEX"},"index":886}