{"abs":"In sampling-based reliability-based design optimization (RBDO) of large-scale engineer-ing applications, the Monte Carlo simulation (MCS) is often used for the probability of failure calculation and probabilistic sensitivity analysis using the prediction from the sur-rogate model for the performance function evaluations. When the number of samples used to construct the surrogate model is not enough, the prediction from the surrogate model becomes inaccurate and thus the Monte Carlo simulation results as well. There-fore, to count in the prediction error from the surrogate model and assure the obtained optimum design from sampling-based RBDO satisfies the probabilistic constraints, a con-servative surrogate model, which is not overly conservative, needs to be developed. In this paper, a conservative surrogate model is constructed using the weighted Kriging var-iance where the weight is determined by the relative change in the corrected Akaike In-formation Criterion (AICc) of the dynamic Kriging model. The proposed conservative surrogate model performs better than the traditional Kriging prediction interval approach because it reduces fluctuation in the Kriging prediction bound and it performs better than the constant safety margin approach because it adaptively accounts large uncertainty of the surrogate model in the region where samples are sparse. Numerical examples show that using the proposed conservative surrogate model for sampling-based RBDO is necessary to have confidence that the optimum design satisfies the probabilistic constraints when the number of samples is limited, while it does not lead to overly con-servative designs like the constant safety margin approach. [","title":"Conservative Surrogate Model Using Weighted Kriging Variance for Sampling-Based RBDO","id":258223634,"url":"https://www.researchgate.net/publication/258223634_Conservative_Surrogate_Model_Using_Weighted_Kriging_Variance_for_Sampling-Based_RBDO","names":["Liang Zhao","Kyung K Choi","Ikjin Lee","David Gorsich","Journal of Mechanical Design"],"references":{"251876162":"Using Cross Validation to Design Conservative Surrogates","4784065":"The Correct Kriging Variance Estimated by Bootstrapping","220578095":"Least Squares Support Vector Machine Classifiers","226630153":"Sampling-Based RBDO Using the Dynamic Kriging (D-Kriging) Method and Stochastic Sensitivity Analysis","228077459":"Geostatistics: Modeling Spatial Uncertainty. Wiley, New York","228850030":"An Adaptive Sequential Linear Programming Algorithm for Optimal Design Problems With Probabilistic Constraints","254042923":"Use of Kriging Models to Approximate Deterministic Computer Models","257177732":"Concurrent control chart patterns recognition with singular spectrum analysis and support vector machine","30998539":"Regression and Time Series Model Selection in Small Samples","235255965":"Sampling-Based Stochastic Sensitivity Analysis Using Score Functions for RBDO Problems With Correlated Random Variables","209436387":"A Tutorial on Support Vector Regression","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","232861627":"Reliability-based multidisciplinary optimization for aircraft wing design","225981794":"Multiple surrogates: How cross-validation errors can help us to obtain the best predictor","227700495":"Design sensitivity analysis and optimization for minimizing springback of sheet‐formed part","225475567":"Application of bootstrap method in conservative estimation of reliability with limited samples","255994333":"Adaptive Virtual Support Vector Machine for the Reliability Analysis of High-Dimensional Problems","235255969":"Metamodeling Method Using Dynamic Kriging for Design Optimization","227724726":"The Bootstrap and Kriging Prediction Intervals","225388163":"System Reliability-Based Design Optimization Using MPP-Based Dimension Reduction Method","229190789":"Model Selection and Inference. A Practical Information-Theoric Approach","3027229":"A New Look At The Statistical Model Identification","228341103":"Comparing Effectiveness of Measures That Improve Aircraft Structural Safety","244964522":"Reliability sensitivity analysis with random and interval variables","7075602":"Model Selection For Geostatistical Models","245311014":"Optimizing Latin hypercube design for sequential sampling of computer experiments","245426395":"Cross Validation Can Estimate How Well Prediction Variance Correlates with Error","225682127":"Weighted stochastic response surface method considering sample weights","225711496":"Comparing error estimation measures for polynomial and kriging approximation of noise-free functions","238184782":"Design Optimization With System-Level Reliability Constraints","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand"},"citedIn":{"272004578":"Robust optimization of structural dynamic characteristics based on adaptive Kriging model and CNSGA","281840537":"Simulation-based design optimization by sequential multi-criterion adaptive sampling and dynamic radial basis functions"},"index":888}