{"abs":"In web classification, most researchers assume that the ob- jects to classify are individual web pages from one or more web sites. In practice, the assumption is too restrictive since a web page itself may not always correspond to a concept instance of some semantic concept (or category) given to the classification task. In this paper, we want to relax this as- sumption and allow a concept instance to be represented by a subgraph of web pages or a set of web pages. We identify several new issues to be addressed when the assumption is removed, and formulate the web unit mining problem. We also propose an iterative web unit mining (iWUM) method that first finds subgraphs of web pages using some knowledge about web site structure. From these web subgraphs, web units are constructed and classified into semantic concepts (or categories) in an iterative manner. Our experiments us- ing the WebKB dataset showed that iWUM improves the overall classification performance and works very well on the more structured parts of a web site.","title":"Web unit mining: Finding and classifying subgraphs of Web pages","id":220269825,"url":"https://www.researchgate.net/publication/220269825_Web_unit_mining_Finding_and_classifying_subgraphs_of_Web_pages","names":["Aixin Sun","Ee-Peng Lim"],"references":{"243769540":"Overview of the TREC2001 Web Track","2326374":"Does \"Authority\" Mean Quality? Predicting Expert Quality Ratings of Web Documents","2526253":"Composite Kernels for Hypertext Categorisation","2540010":"The Importance of Prior Probabilities for Entry Page Search","38364549":"A Correspondence Between Bayesian Estimation on Stochastic Processes and Smoothing by Splines","262333164":"Making Large-Scale Support Vector Machine Learning Practical","224952248":"Machine Learning in Automated Text Categorization","246379775":"Turning {{\\sc Yahoo!}}\\ into an automatic Web page classifier","5595969":"The Nature Of Statistical Learning Theory","221345257":"Composite Kernels for Hypertext Categorisation","3316651":"Comparing Support Vector Machines With Gaussian Kernels to Radial Basis Function Classifiers","2769718":"Model Fitting and Testing for Non-Gaussian Data with Large Data Sets","2314686":"Hierarchical Classification of Web Content","2638730":"Support Vector Machines, Reproducing Kernel Hilbert Spaces and the Randomized GACV","28355923":"Making large-scale SVM Learning Practical","225223944":"A Study of Approaches to Hypertext Categorization","2568387":"Web Site Mining : A new way to spot Competitors, Customers And Suppliers in the World Wide Web","225771346":"On a Kernel-Based Method for Pattern Recognition, Regression, Approximation, and Operator Inversion","2257476":"Enhanced Hypertext Categorization Using Hyperlinks","13587623":"An Equivalence Between Sparse Approximation And Support Vector Machines","2555279":"On the Automated Classification of Web Sites","2364046":"A Generalized Approximate Cross Validation for Smoothing Splines with Non-Gaussian Data","2442574":"Structured Machine Learning for \u0027Soft\u0027 Classification with Smoothing Spline ANOVA and Stacked Tuning, Testing and Evaluation","242473304":"Spline interpolation and smoothing on the sphere. SIAM J Sci Stat Comput 2:5-16","2368585":"A Study on Thresholding Strategies for Text Categorization","2574039":"Adaptive Tuning of Numerical Weather Prediction Models: Simultaneous Estimation of Weighting, Smoothing and Physical Parameters","38360059":"Asymptotic Optimality of $C_L$ and Generalized Cross-Validation in Ridge Regression with Application to Spline Smoothing","220343505":"Relational Learning with Statistical Predicate Invention: Better Models for Hypertext","2867422":"Probabilistic Models of Text and Link Structure for Hypertext Classification","2907035":"Web Classification Using Support Vector Machine","2517852":"Improved Classification via Connectivity Information","220668764":"Feature Selection via Mathematical Programming","221677965":"Theory of reproducing kernels. Trans Am Math Soc","2518877":"Effective Site Finding using Link Anchor Information","2573979":"Retrieving Web Pages using Content, Links, URLs and Anchors","2661780":"Generalized Cross-Validation for Large Scale Problems","2248350":"Smoothing Spline ANOVA for Exponential Families, with Application to the Wisconsin Epidemiological Study of Diabetic Retinopathy"},"citedIn":{"28356272":"Learning interpretable models","2833962":"Regularized Least-Squares Classification","228915872":"Recognition of Human Mitochondrial Sequences Using SVM","221165352":"A kernel based adaline.","2478380":"A Study on Sigmoid Kernels for SVM and the Training of non-PSD Kernels by SMO-type Methods","242637946":"SVM-based Filtering of E-mail Spam with Content-speciÞc MisclassiÞcation Costs","220345139":"Privacy-preserving classification of vertically partitioned data via random kernels","221653792":"Event detection from evolution of click-through data","240745551":"Support Vector Machines with Applications1","221534764":"Reproducing Kernel Banach Spaces for Machine Learning","2180668":"Bayesian Field Theory: Nonparametric Approaches to Density Estimation, Regression, Classification, and Inverse Quantum Problems","238675227":"Chapter 7 Regularized Least-Squares Classification","50996265":"Framework for Building a High-Quality Web Page Collection Considering Page Group Structure","220940547":"Improving Semantic Consistency of Web Sites by Quantifying User Intent.","228343217":"An integrated statistical approach for volume reconstruction from unregistered sequential slices","4309873":"Content Extraction from News Pages Using Particle Swarm Optimization on Linguistic and Structural Features","5488227":"Adaptive Weighted Learning for Unbalanced Multicategory Classification","7676230":"Recipes for the linear analysis of EEG","228429736":"0 Robustness and Stability of Reweighted Kernel Based Regression","2438931":"Statistical Properties and Adaptive Tuning of Support Vector Machines","4309879":"Correct your Text with Google","234787785":"Matching Web Site Structure and Content","4742783":"Robust Truncated Hinge Loss Support Vector Machines","24283464":"Kernel Quadratic Discriminant Analysis for Positive Definite and Indefinite Kernels","2539805":"Kernel Logistic Regression and the Import Vector Machine","255602689":"Explicit connections between longitudinal data analysis and kernel machines","237526634":"The Generalized Bayesian Committee Machine (Proceedings of the Sixth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD2000)","257820188":"A Probabilistic Framework for SVM Regression and Error Bar Estimation","224303132":"Identification of expensive-to-simulate parametric models using Kriging and Stepwise Uncertainty Reduction","38443534":"On discovering concept entities from web sites.","237050980":"WWW 2004 - Matching Web Site Structure and Content","38443535":"Evaluating the effectiveness of a collaborative querying environment.","225136416":"Improving Semantic Consistency of Web Sites by Quantifying User Intent","226942669":"Riding the Rough Waves of Genre on the Web","220705386":"Blog Classification Using Tags: An Empirical Study","249804205":"Kernel PLS Smoothing for Nonparametric Regression Curve Fitting: an Application to Event Related Potentials","262296813":"Detecting and Tracking Topics and Events from Web Search Logs","220216179":"Web classification of conceptual entities using co-training","43076294":"Radius-margin bound on the leave-one-out error of the LLW-M-SVM","228746494":"Web Mining-The Ontology Approach","3998049":"Hybrid wavelet packet - Support vector classification of atrial activation patterns","2486395":"On the Relation Between the GACV and Joachims\u0027 ... Method for Tuning Support Vector Machines, With Extensions to the Non-Standard Case","220320832":"Refinable Kernels.","220705603":"A Method for Creating a High Quality Collection of Researchers’ Homepages from the Web","220914511":"Feasible Adaptation Criteria for Hybrid Wavelet - Large Margin Classifiers.","220766272":"DECK: Detecting Events from Web Click-through Data","10994383":"Soft and hard classification by reproducing kernel Hilbert space methods","240844593":"Variable Selection for SVM via Smoothing Spline ANOVA","220669268":"Mathematical Programming for Data Mining: Formulations and Challenges","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","2518099":"Subspace Classifier in Reproducing Kernel Hilbert Space","228451563":"Nonparametric Bayes kernel-base priors for functional data analysis","239560767":"MATHEMATICAL ENGINEERING TECHNICAL REPORTS Information Criteria for Kernel Machines","240976676":"Buildingweb page collections efficiently exploiting local surrounding pages","3203402":"A Cost-Effective Semisupervised Classifier Approach With Kernels","220262491":"Classification of Multiple Cancer Types by Multicategory Support Vector Machines Using Gene Expression Data.","2482777":"Multicategory Support Vector Machines, Theory, and Application to the Classification of Microarray Data and Satellite Radiance Data","4742709":"On L1-Norm Multiclass Support Vector Machines: Methodology and Theory","220320673":"VC Theory of Large Margin Multi-Category Classifiers.","220319914":"Some Properties of Regularized Kernel Methods","220499624":"On a Class of Support Vector Kernels Based on Frames in Function Hilbert Spaces","242285821":"Kernel Methods","228620334":"Multicategory ψ-Learning and Support Vector Machine: Computational Tools","8161260":"Hidden Space Support Vector Machines","228957495":"On multicategory truncated-hinge-loss support vector machines","203918261":"Kernel Partial Least Squares Regression in Reproducing Kernel Hilbert Space","238687657":"Study on Building a High-Quality Homepage Collection from the Web Considering Page Group Structures","220906942":"Computational Developments of Psi-learning.","251314284":"Various Kernel Methods with Applications","209436387":"A Tutorial on Support Vector Regression","2115256":"Statistical properties of the method of regularization with periodic Gaussian reproducing kernel","229004606":"Optimizing psi-learning via mixed integer programming","220320441":"Undercomplete Blind Subspace Deconvolution.","225172466":"iWed: An Integrated Multigraph Cut-Based Approach for Detecting Events from a Website","2394303":"Optimal Properties and Adaptive Tuning of Standard and Nonstandard Support Vector Machines","220705722":"Web Page Classification Exploiting Contents of Surrounding Pages for Building a High-Quality Homepage Collection.","220910004":"Heat-ray: Combating identity snowball attacks using machine learning, combinatorial optimization and attack graphs","221324946":"CUM: An Efficient Framework for Mining Concept Units.","228943619":"Web Documents Classification Using Text, Anchor, Title and Metadata Information","228718603":"On Robustness Properties of Convex Risk Minimization Methods for Pattern Recognition","255588501":"L´ EVY RANDOM MEASURES: POSTERIOR CONSISTENCY AND APPLICATIONS","41477832":"Discovery of Concept Entities from Web Sites using Web Unit Mining","2242962":"Towards Scalable Support Vector Machines using Squashing","220433298":"Web Site Topic-Hierarchy Generation Based on Link Structure","221501313":"Machine Learning and Statistical MAP Methods.","224342507":"Beyond Traditional Kernels: Classification in Two Dissimilarity-Based Representation Spaces","251045443":"An Experimental Study on Topic Distillation Using Web Site Structure","220320151":"On Efficient Large Margin Semisupervised Learning: Method and Theory","221653643":"Hierarchical topic segmentation of websites","215530597":"Perspectives on System Identification","222539139":"Support vector machines with adaptive Lq penalty","221038318":"Reconstruct Logical Hierarchical Sitemap for Related Entity Finding","2237665":"A Generalized Representer Theorem","222833793":"Robust Learning from Bites for Data Mining","220434920":"Web unit-based mining of homepage relationships","250222650":"Bayesian Field Theory: From likelihood fields to hyperfields","237227760":"Effectively Finding the Optimal Wavelet for Hybrid Wavelet - Large Margin Signal Classification","228674933":"Statistical Likelihood Representations of Prior Knowledge in Machine Learning","237554173":"Cloud Classification of Satellite Radiance Data by Multicategory Support Vector Machines","221509606":"Detecting Hot Events from Web Search Logs","242453669":"Title On discovering concept entities from web sites","222502549":"A Statistical Perspective on Data Mining","3917795":"Nonlinear perceptual audio filtering using support vector machines","239723152":"Scale-Invariance of Support Vector Machines based on the Triangular Kernel","220320507":"Support Vector Machine Soft Margin Classifiers: Error Analysis.","222417564":"Robustness of reweighted Least Squares Kernel Based Regression","220072958":"Nonlinear Dimension Reduction with Kernel Sliced Inverse Regression","2461377":"Bayesian Methods for Support Vector Machines: Evidence and Predictive Class Probabilities","220434886":"Extracting link chains of relationship instances from a Web site","242400660":"Regularization Approaches in Learning Theory","47935019":"Support Vector Machines - Backgrounds and Practice","220705236":"Web Page Classification exploiting Surrounding Pages with Noisy Page Filtering.","12413257":"New Support Vector Algorithms","29609787":"Global optimization of expensive-to-evaluate functions: An empirical comparison of two sampling criteria","268361476":"Design and Implementation for Malicious Links Detection System Based On Security Relevance of Webpage Script Text"},"index":889}