{"abs":"Salinas systems are artificial wetlands which are interesting from the viewpoint of nature conservation. They play an important role both as habitats for migratory waterbird species and as nodes of biotic connectivity networks. In the Mediterranean basin, where the coastal salinas are highly significant as alternative and complementary habitats for waterbirds, a process of abandonment occurs, and many seminatural systems of this kind are disappearing. This abandonment is having serious consequences for migratory bird populations and for the ecological role these play. In the present paper, this group of waterbird species has been used to evaluate these wetlands for conservation purposes. We have developed a methodological approach for the selection of ecological indicators for the conservation and management of these Mediterranean habitats and waterbird assemblages, the main consumers therein. The stepwise procedure developed constitutes a practical tool for this task. Application thereof enabled us to differentiate the habitats available for the waterbirds and to identify the biotic and abiotic indicators for the maintenance and management of the salina ecosystems. These variables can then be incorporated into monitoring programs.","title":"Selection of ecological indicators for the conservation, management and monitoring of Mediterranean coastal salinas","id":26250404,"url":"https://www.researchgate.net/publication/26250404_Selection_of_ecological_indicators_for_the_conservation_management_and_monitoring_of_Mediterranean_coastal_salinas","names":["Enrique López","Pedro A Aguilera","María F Schmitz","Henrique Guilhon de Castro","Francisco D Pineda","Environmental Monitoring and Assessment"],"references":{"223273551":"An ecological account of a Mediterranean salina: The Salin de Giraud, Camargue (S. France)","8645889":"An Ecological Integrity Index for Littoral Wetlands in Agricultural Catchments of Semiarid Mediterranean Regions","233193828":"Assessing and monitoring bird populations in Africa: An overview","258918508":"Bioassessment of Freshwater Ecosystems - Using the Reference Condition Approach","216770415":"Factors Affecting the Distribution of a Waterbird Community: The Role of Habitat Configuration and Bird Abundance","271787191":"Habitat Preferences of Wintering Shorebirds in a Temporally Changing Environment: Western Sandpipers in the San Francisco Bay Estuary","223374293":"Reducing effort in the use of benthic bioindicators","227644820":"Use of focal species in marine conservation and management: A review and critique","42635916":"Mathematical Theory of Communication","222561228":"Biotic Wetland Connectivity – Supporting a New Approach for Wetland Policy","37626421":"Making smart conservation decisions","245069079":"A simpli?ed Monte Carlo signi?cance test proce-dure","226038262":"A Proposed Framework for Developing Indicators of Ecosystem Health for the Great Lakes Region","225251042":"Assessing alternative anthropogenic habitat for conserving waterbirds: Salinas as buffer areas against the impact of natural habitat loss for shorebirds","225665763":"Biological effects of salinity gradient reversals in a southeast African estuarine lake","28152124":"Bibliografía y bibliometría relacionadas con los humedales almerienses (sudeste ibérico)","28151864":"Humedales almerienses, importancia, problemática y gestión","225252347":"Conservation of salt lakes","28152122":"Inventario abierto de los humedales de la región semiárida almeriense: consideraciones sobre su tipificación","224434552":"Species Assemblages and Indicator Species: The Need for a Flexible Asymmetrical Approach","245760701":"Chapter 2: Conceptual Basis for Designing an Effectiveness Monitoring Program","226318177":"ter Braak CJF, Verdonschot PFM.. Canonical correspondence analysis and related multivariate methods in aquatic ecology. Aquat Sci 57: 255-289","28139315":"Hábitats de las albuferas de adra (Almería) recogidos en el anexo 1 de la Directiva 92/43/CEE","222038172":"Waterbirds on an adjacent freshwater lake and salt lake in arid Australia. Biol Conserv","226913831":"Methoden der Bestandserfassung in der Ornithologie: Übersicht und kritische Betrachtung","225828439":"Monte Carlo Methods","281300070":"Una visión histórica de las salinas andaluzas","270265406":"The Statistical Evaluation of Ecological Indicators","264958061":"“A Simplified Monte Carlo Significance Test Procedure","280780948":"Species Assemblages and Indicator Species: The Need for a Flexible Asymmetrical Approach","227693627":"Spatial and seasonal variability of the macrobenthic fauna in Mediterranean solar saltworks ecosystems","229944990":"Constrained indicator species analysis (COINSPAN): an extension of TWINSPAN","224744136":"Heino J. Lentic macroinvertebrate assemblage structure along gradients in spatial heterogeneity, habitat size and water chemistry. Hydrobiologia","222691563":"An accurate comparison of methods for quantifying variable importance in artificial neural networks using simulated data. Ecol Model","234523732":"Setting Expectations for the Ecological Condition of Streams:The Concept of Reference Condition","222538482":"Modelling the consequences of duck migration patterns on the genetic diversity of aquatic organisms: A first step towards a predictive tool for wetland management","40150485":"Consequences of habitat loss at migratory stopover sites: A theoretical investigation","222563185":"Challenges in the development and use of ecological indicators","270057518":"Consequences of Habitat Loss at Migratory Stopover Sites: A Theoretical Investigation","223393382":"Using Stressor Gradients to Determine Reference Expectations for Great River Fish Assemblages","229130000":"Foraminifera as ecological indicators in the Lagoon of Venice, Italy","201997234":"Species assemblages \u0026 indicator species: the need for a flexible asymmetrical approach","224945621":"AWWA, WEF Standard Methods for the Examination of Water and Wastewater","222674808":"A probability-based indicator of ecological condition. Ecol Indic 7:793-806","26991140":"Evaluation Guidelines for Ecological Indicators. EPA/620/R-99/005","224982441":"The Mathematic Theory of Communication","225804599":"A Rapid Impact Assessment Method for Use in a Regulatory Context","258452260":"Complementary use of intertidal mudflats and adjacent salinas by foraging waders","216900651":"Canonical Correspondence Analysis: A New Eigenvector Method for Multivariate Direct Gradient Analysis","226666568":"On the Chemistry and Biota of Some Saline Lakes in Western Australia","223406875":"Strategies for evaluating indicators based on guidelines from the Environmental Protection Agency’s Office of Research and Development","225402785":"Association between Aquatic Vegetation and Landscape Indicators of Human Pressure","232675468":"Repercussions of the Abandonment of Mediterranean Saltpans on Waterbird Communities","277069904":"Spatiotemporal distribution of birds at the Guerrero Negro Saltworks, Baja California Sur, Mexico","246910944":"Multivariate Statistics for Wildlife Ecology Research","226232740":"A comparison between saline and freshwater wetlands on Bloodwood Station, the Paroo, Australia, with special reference to their use by waterbirds","226454567":"Bird Species Assemblages as Indicators of Biological Integrity in Great Basin Rangeland","226845151":"A Framework for the Design of Ecological Monitoring Programs as a Tool for Environmental and Nature Management","6850483":"Setting Expectations for the Ecological Condition of Running Waters: The Concept of Reference Condition","25336793":"Standard Methods for the Examination of Water and Sewage","222347931":"Food supply for waders (Aves: Charadrii) in an estuarine area in the Bay of Cádiz (SW Iberian Peninsula)","28139341":"Sobre el estatus fenológico de las aves acuáticas en las salinas almerienses","6598406":"Defining Acceptable Levels for Ecological Indicators: An Approach for Considering Social Values","201998829":"Assessing the Indicator Properties of Species Assemblages for Natural Areas Monitoring","6964109":"Evaluating Ecological Indicators: Lakes In The Northeastern United States","258487424":"Complementary use of intertidal mudflats and adjacent salinas by foraging waders","227944702":"CANOCO- a FORTRAN Program for Canonical Community Ordination by Canonical Correspondence Analysis, Principal Component Analysis and Redundancy Analysis (version 2.1)","235418978":"A Mathematical Theory of Communication","239066709":"Restoring Life in Running Waters","281609765":"The importance of supratidal foraging habitats for waders at a south temperate estuary","216770310":"Application of ecological indictors","263601243":"A comparison between saline and freshwater wetlands on Bloodwood Station, the Paroo, Australia, with special reference to their use by waterbirds","225388189":"Variation of the waterbird community relying to the Ichkeul National Park, Tunisia","215446181":"The Mathematical Theory of Communication. Urbana","258340767":"Conservation Strategy for Migratory Species","7040791":"An exploration of the relationships between macroinvertebrate community composition and physical and chemical habitat characteristics in farm dams","248412849":"Identification of similar environmental areas in Tagus estuary by using multivariate analysis. Ecol Indic","225420816":"Monitoring change in aquatic invertebrate biodiversity: Sample size, faunal elements and analytical methods"},"citedIn":{"256436568":"Habitat use of an endangered cyprinodontid fish in a saline wetland of the Iberian Peninsula (SW Mediterranean Sea)","51770437":"Artisanal salt production in Aveiro/Portugal - an ecofriendly process","232693806":"Structure and Distribution of the Waterbird Community in the Mar Menor Coastal Lagoon (SE Spain) and Relationships with Environmental Gradients","237816924":"Non-linear feeding functional responses in the Greater Flamingo (Phoenicopterus roseus) predict immediate negative impact of wetland degradation on this flagship species","282735275":"Diversity partitioning of a phytoplankton community in semiarid salterns","264323570":"Eco-spatial and Temporal Variation in Waterbirds Composition and their relationship with Habitat Characteristics of Urban Lakes of Bengaluru city, India","267787521":"The recent history of the Tarquinia Salterns offers the opportunity to investigate parallel changes at the habitat and biodiversity levels","272391845":"Contribution of soil properties to the assessment of a seawater irrigation programme as a management strategy for abandoned solar saltworks","275465493":"Spatial modeling of limnological parameters in a solar saltwork of northeastern Brazil","223971830":"Brazilian solar saltworks - ancient uses and future possibilities"},"index":898}