{"abs":"Efficient identification of parameters in numerical models remains a computationally demanding problem. Here we present an iterative Importance Sampling approach and demonstrate its application to estimating parameters that control the heat uptake efficiency of a physical/biogeochemical ocean model coupled to a simple atmosphere. The algorithm has similarities to a previously-developed ensemble Kalman filtering (EnKF) method applied to similar problems, but is more flexible and powerful in the case of nonlinear models and non-Gaussian uncertainties. The method is somewhat more computationally demanding than the EnKF but may be preferred in cases where the approximations that the EnKF relies upon are unsound. Our results suggest that the three-dimensional structure of ocean tracer fields may act as a useful constraint on ocean mixing and consequently the heat uptake of the climate system under anthropogenic forcing.","title":"Efficient identification of ocean thermodynamics in a physical/biogeochemical ocean model with an iterative Importance Sampling method","id":222707927,"url":"https://www.researchgate.net/publication/222707927_Efficient_identification_of_ocean_thermodynamics_in_a_physicalbiogeochemical_ocean_model_with_an_iterative_Importance_Sampling_method","names":["James D Annan","Julia Catherine Hargreaves","Ocean Modelling"],"references":{"215530717":"A New Approach to Linear Filtering and Prediction Problems","6266840":"Efficient estimation and ensemble generation in climate modelling","224839919":"A New Approach To Linear Filtering and Prediction Problems","222554569":"Parameter estimation in an intermediate complexity Earth System Model using an ensemble Kalman filter","236269080":"Statistical Methods in the Atmosphere Science","29631179":"Marine geochemical data assimilation in an efficient Earth System Model of global biogeochemical cycling","37991771":"Estimated PDFs of Climate System Properties Including Natural and Anthropogenic Forcings","11405236":"Knutti, R., Stocker, T. F., Joos, F. \u0026 Plattner, G. K. Constraints on radiative forcing and future climate change from observations and climate model ensembles. Nature 416, 719−723","1825409":"Sequential monte carlo samplers","26428937":"Parameter estimation in an atmospheric GCM using the Ensemble Kalman Filter","38004830":"Probabilistic Forecast for 21st Century Climate Based on Uncertainties in Emissions (without Policy) and Climate Parameters","251534940":"Constraints on the transient climate response from observed global temperature and ocean heat uptake","228726400":"Mineral particle size as a control on aerosol iron solubility","225828439":"Monte Carlo Methods","222438241":"Abyssal recipes","226763682":"Probabilistic Inference for Future Climate Using an Ensemble of Climate Model Evaluations","228730379":"A global ocean carbon climatology: Results from GLODAP","1924532":"Curse-of-dimensionality revisited: Collapse of the particle filter in very large scale systems: Probability and statistics","38326887":"Simulating Normalizing Constants: From Importance Sampling to Bridge Sampling to Path Sampling","243775157":"Simulating Ratios of Normalizing Constants via a Simple Identity: A Theoretical Exploration","42796856":"Location of potential energy sources and the export of dense water from the Atlantic Ocean","260258485":"Decoupling of iron and phosphate in the global ocean","203931920":"The NMC/NCAR 40-year reanalysis project. Bull Am Meteorol Soc","249611736":"The Sensitivity of the Rate of Transient Climate Change to Ocean Physics Perturbations","227736362":"The average vertical mixing coefficient for the oceanic thermocline","253896859":"The climate response to CO2 of the Hadley Centre coupled AOGCM with and without flux adjustment","23791313":"Tackling Regional Climate Change By Leaf Albedo Bio-geoengineering","251736904":"Do deep ocean temperature records verify models?","2568941":"Practical and Theoretical Aspects of Adjoint Parameter Estimation and Identifiability in Meteorology and Oceanography,","228811374":"The Role of Climate Sensitivity and Ocean Heat Uptake on AOGCM Transient Temperature Response","242307647":"Probabilistic Inference for Future Climate Using an Ensemble of Simulator Evaluations","201169715":"Climate Change 2007: The Physical Science Basis. Contribution of Working Group I to the Fourth Assessment Report of the Intergovernmental Panel on Climate Change (IPCC)","42792259":"Uncertainties due to transport-parameter sensitivity in an efficient 3-D ocean-climate model","240439553":"Mixing and Energetics of the Oceanic Thermohaline Circulation","6062469":"Climate Response Times: Dependence on Climate Sensitivity and Ocean Mixing","42797652":"A modular, scalable, Grid ENabled Integrated Earth system modelling (GENIE) framework: Effects of atmospheric dynamics and ocean resolution on bi-stability of the thermohaline circulation","225534764":"Claussen, M. et al. Earth system models of intermediate complexity: closing the gap in the spectrum of climate system models. Clim. Dynam. 18, 579-586","37405927":"Numerical Recipes in FORTM: The Art of Scientific Computing","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","2704064":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","248788516":"The Role of Deep Sea Heat Storage in the Secular Response to Climate Forcing","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","226386829":"The Ensemble Kalman Filter: Theoretical Formulation and Practical Implementation","225347229":"An efficient climate forecasting method using an intermediate complexity Earth System Model and the ensemble Kalman filter. Clim Dyn","251435786":"An oceanic origin for increase of atmospheric radiocarbon during the Younger Dryas","8404087":"Murphy, J. M. et al. Quantification of modelling uncertainties in a large ensemble of climate change simulations. Nature 430, 768−772","49245590":"Natural Variability in a Stable, 1000-Yr Global Coupled Climate–Carbon Cycle Simulation","241062055":"Physical and biological regulation of the soft tissue carbon pump","230691771":"Mahowald, N. et al. Dust sources and deposition during the last glacial maximum and current climate: A comparison of model results with paleodata from ice cores and marine sediments. J. Geophys. Res. 104 (D13). 15895-15916"},"citedIn":{"235431147":"Carbon dioxide and climate impulse response functions for the computation of greenhouse gas metrics: A multi-model analysis","258645790":"MESMO 2: A mechanistic marine silica cycle and coupling to a simple terrestrial scheme","257703892":"Particle filter-based data assimilation for a 3-dimensional biological ocean model and satellite observations","236840997":"Historical and idealized climate model experiments: An intercomparison of Earth system models of intermediate complexity","258645777":"The Rock Geochemical Model (RokGeM) v0.9","236342365":"Historical and idealized climate model experiments: an EMIC intercomparison","235937115":"Controls on the spatial distribution of oceanic δ13CDIC","269698973":"Modeling in Earth system science up to and beyond IPCC AR5","262773302":"Deep water formation in the North Pacific and deglacial CO2 rise"},"index":899}