{"abs":"In the field of evolutionary multi-criterion optimization, the hypervolume indicator is the only single set quality measure that is known to be strictly monotonic with regard to Pareto dominance: whenever a Pareto set approximation entirely dominates another one, then the indicator value of the dominant set will also be better. This property is of high interest and relevance for problems involving a large number of objective functions. However, the high computational effort required for hypervolume calculation has so far prevented the full exploitation of this indicator\u0027s potential; current hypervolume-based search algorithms are limited to problems with only a few objectives. This paper addresses this issue and proposes a fast search algorithm that uses Monte Carlo simulation to approximate the exact hypervolume values. The main idea is not that the actual indicator values are important, but rather that the rankings of solutions induced by the hypervolume indicator. In detail, we present HypE, a hypervolume estimation algorithm for multi-objective optimization, by which the accuracy of the estimates and the available computing resources can be traded off; thereby, not only do many-objective problems become feasible with hypervolume-based search, but also the runtime can be flexibly adapted. Moreover, we show how the same principle can be used to statistically compare the outcomes of different multi-objective optimizers with respect to the hypervolume--so far, statistical testing has been restricted to scenarios with few objectives. The experimental results indicate that HypE is highly effective for many-objective problems in comparison to existing multi-objective evolutionary algorithms. HypE is available for download at http://www.tik.ee.ethz.ch/sop/download/supplementary/hype/.","title":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","id":45280500,"url":"https://www.researchgate.net/publication/45280500_HypE_An_Algorithm_for_Fast_Hypervolume-Based_Many-Objective_Optimization","names":["Johannes Bader","Eckart Zitzler","Evolutionary Computation"],"references":{"4201672":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","2404908":"Full Elite Sets for Multi-Objective Optimisation","28358328":"Lecture Notes in Computer Science","221228450":"A New Analysis of the LebMeasure Algorithm for Calculating Hypervolume","242360316":"Genetic Algorithms in Search","1885715":"Novel Algorithm to Calculate Hypervolume Indicator of Pareto Approximation Set","220939835":"Faster S-Metric Calculation by Considering Dominated Hypervolume as Klee’s Measure Problem","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","263453856":"The Analysis of Evolutionary Algorithms on Sorting and Shortest Paths Problems: Evolutionary Computation Combinatorial Optimization (Editors: Jens Gottlieb, Emma Hart, Martin Middendorf, Günter Raidl and Colin Reeves)","221008825":"Improving hypervolume-based multiobjective evolutionary algorithms by using objective reduction methods","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","265702220":"The Analysis of Evolutionary Algorithms on Sorting and Shortest Paths Problems","216300536":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimisation: NSGA-II.","2584888":"An Evolutionary Algorithm for Multiobjective Optimization: The Strength Pareto Approach","224645825":"An Improved Dimension-Sweep Algorithm for the Hypervolume Indicator","216457282":"Multi-objective particle swarm optimization on computer grids","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2605569":"PISA --- A Platform and Programming Language Independent Interface for Search Algorithms","262405508":"On Set-Based Multiobjective Optimization","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","216457303":"Indicator-Based Selection in Multiobjective Search","242384707":"Practical Nonpammetric Statistics","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","2471963":"A Survey Of Ranking, Selection, And Multiple Comparison Procedures For Discrete-Event Simulation","216457304":"Lecture Notes in Computer Science","222540032":"Lecture Notes in Computer Science","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","226145598":"Faster Hypervolume-Based Search Using Monte Carlo Sampling","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","216457263":"Lecture Notes in Computer Science","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","3418862":"A faster algorithm for calculating hypervolume","220605304":"Review of Genetic Algorithms in Search, Optimization, and Machine Learning","216300934":"On metrics for comparing non-dominated sets","224472067":"Updating Exclusive Hypervolume Contributions Cheaply","224645892":"Maximising Hypervolume for Selection in Multi-objective Evolutionary Algorithms","2439369":"Approximating the Pareto Set: Concepts, Diversity Issues, and Performance Assessment","224579855":"On the Complexity of Computing the Hypervolume Indicator","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","28358342":"Gradient-based/Evolutionary Relay Hybrid for Computing Pareto Front Approximations Maximizing the S-Metric","221228375":"A Two-Level Evolutionary Approach to Multi-criterion Optimization of Water Supply Systems.","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","224301859":"Incrementally maximising hypervolume for selection in multi-objective evolutionary algorithms","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"265792470":"A Portfolio Optimization Approach to Selection in Multiobjective Evolutionary Algorithms","259179376":"Stable Matching Based Selection in Evolutionary Multiobjective Optimization","266082783":"Novel multi-objective optimization algorithm","270961698":"On using the hypervolume indicator to compare Pareto fronts: Applications to multi-criteria optimal experimental design","261030283":"Multiplicative Approximations, Optimal Hypervolume Distributions, and the Choice of the Reference Point","220742944":"Articulating User Preferences in Many-Objective Problems by Sampling the Weighted Hypervolume","290109763":"Approximation Model Guided Selection for Evolutionary Multiobjective Optimization","221007654":"Indicator-based MONEDA: A comparative study of scalability with respect to decision space dimensions","273078349":"Multi-Objective Heuristic Computation Applied To Architectural And Structural Design: A Review","273910879":"A dual-population paradigm for evolutionary multiobjective optimization","288827687":"Multiobjective evolutionary algorithm based on multimethod with dynamic resources allocation","273392728":"Personalized Recommendation Based on Evolutionary Multi-Objective Optimization [Research Frontier]","253348620":"A Grid-Based Evolutionary Algorithm for Many-Objective Optimization","232250818":"Adaptive Multi-objective Genetic Algorithm using Multi-Pareto-Ranking","257512782":"The review of multiple evolutionary searches and multi-objective evolutionary algorithms","271325750":"An interactive simple indicator-based evolutionary algorithm (I-SIBEA) for multiobjective optimization problems","280534179":"A Performance Comparison Indicator for Pareto Front Approximations in Many-Objective Optimization","224211267":"Decomposition-Based Memetic Algorithm for Multiobjective Capacitated Arc Routing Problem","263074225":"Speed Up Reliability Model Optimization With Hypervolume Contribution Calculating Algorithm","265602507":"Two_Arch2: An Improved Two-Archive Algorithm for Many-Objective Optimization","263813018":"Design and construction of an autonomous underwater vehicle","281812207":"Advantages of Task-Specific Multi-Objective Optimisation in Evolutionary Robotics","265021421":"A Comparative Study on Evolutionary Algorithms for Many-Objective Optimization","262405508":"On Set-Based Multiobjective Optimization","286264120":"Many-Objective Optimization Using Adaptive Differential Evolution with a New Ranking Method","287406344":"Modified Distance Calculation in Generational Distance and Inverted Generational Distance","282852593":"A Predictive Pareto Dominance Based Algorithm for Many-Objective Problems","224086389":"A novel algorithm for non-dominated hypervolume-based multiobjective optimization","6532179":"Diffusion tensor imaging: techniques and clinical applications.","220742937":"Moving away from error-based learning in multi-objective estimation of distribution algorithms.","283718874":"Urban Design Synthesis for Building Layouts Urban Design Synthesis for Building Layouts based on Evolutionary Many-Criteria Optimization","282333921":"Advantages of Multi-Objective Optimisation in Evolutionary Robotics: Survey and Case Studies","267511239":"Empirical Performance of the Approximation of the Least Hypervolume Contributor","283685586":"A fuzzy based approach for fitness approximation in multi-objective evolutionary algorithms","256660343":"Approximation quality of the hypervolume indicator","257392488":"An evolutionary algorithm approach to generate distinct sets of non-dominated solutions for wicked problems","264827383":"Distributed Localized Bi-objective Search","269998677":"Aggregation Trees for visualization and dimension reduction in many-objective optimization","220743532":"Solving complex high-dimensional problems with the multi-objective neural estimation of distribution algorithm","235709513":"Do Hypervolume Regressions Hinder EMOA Performance? Surprise and Relief","264002043":"Application of Cognitive Techniques to Network Management and Control","235745345":"Developing Parsimonious and Efficient Algorithms for Water Resources Optimization Problems","220753253":"Remote sensing image fusion based on multi-objective evolutionary algorithm","282410136":"Evolutionary many-objective optimization: A quick-start guide","220743544":"Optimizing Architectural and Structural Aspects of Buildings towards Higher Energy Efficiency","283485877":"Predictive analytics of environmental adaptability in multi-omic network models","274263562":"Behavior of Multiobjective Evolutionary Algorithms on Many-Objective Knapsack Problems","257516298":"A simulated annealing based genetic local search algorithm for multi-objective multicast routing problems","287972729":"On the use of many quality attributes for software refactoring: a many-objective search-based software engineering approach","264433558":"Automatic design of evolutionary algorithms for multi-objective combinatorial optimization","276175392":"A Many-Objective Evolutionary Algorithm With Enhanced Mating and Environmental Selections","235832912":"An efficient Differential Evolution based algorithm for solving multi-objective optimization problems","283551928":"Indicator-Based Selection","262352323":"On finding well-spread pareto optimal solutions by preference-inspired co-evolutionary algorithm","221608788":"Multi-Objective Optimization with an Adaptive Resonance Theory-Based Estimation of Distribution Algorithm: A Comparative Study.","254462280":"Leveraging Indicator-based Ensemble Selection in Evolutionary Multiobjective Optimization Algorithms","282584756":"A Study on Many-Objective Optimization Using the Kriging-Surrogate-Based Evolutionary Algorithm Maximizing Expected Hypervolume Improvement","50842467":"Set-based Multiobjective Fitness Landscapes: A Preliminary Study","261040107":"Single Objective Guided Multiobjective Optimization Algorithm","284013192":"New version of a multi-algorithm genetically adaptive for multiobjective optimization","269187692":"A Simple and Fast Hypervolume Indicator-Based Multiobjective Evolutionary Algorithm","280546517":"TEVC-TA2","265467810":"Evolutionary multi-criteria optimization for building layout planning","282481319":"An improved {\\alpha }-dominance strategy for many-objective optimization problems","262407120":"Many-Hard-objective optimization using differential evolution based on two-stage constraint-handling","228928977":"On current model building methods for multi-objective estimation of distribution algorithms: Shortcommings and directions for improvement","283193499":"Solving a multi-objective dynamic stochastic districting and routing problem with a co-evolutionary algorithm","286331285":"A survey on network community detection based on evolutionary computation","291049439":"Selection Operators Based on Maximin Fitness Function for Multi-Objective Evolutionary Algorithms","282627166":"A clustering-ranking method for many-objective optimization","220740015":"Integrating decision space diversity into hypervolume-based multiobjective search","282530911":"Many-Objective Evolutionary Algorithms","291337172":"A Self-Organizing Multiobjective Evolutionary Algorithm","281627712":"Reducing Complexity in Many Objective Optimization Using Community Detection","280534066":"Bi-goal evolution for many-objective optimization problems","220288943":"An efficient Differential Evolution based algorithm for solving multi-objective optimization problems.","229329189":"Quick HyperVolume","268163956":"A novel preference articulation operator for the Evolutionary Multi-Objective Optimisation of classifiers in concealed weapons detection","281049682":"On Using Populations of Sets in Multiobjective Optimization","263863084":"Adaptive Memetic Computing for Evolutionary Multiobjective Optimization","257636349":"Identification of multi-resolution network structures with multi-objective immune algorithm","264936813":"A new evolutionary algorithm based on contraction method for many-objective optimization problems","291186153":"The Bi-Objective Quadratic Multiple Knapsack Problem: Model and Heuristics","263286019":"Controller Tuning by Means of Evolutionary Multiobjective Optimization: a Holistic Multiobjective Optimization Design Procedure","235960483":"Cone-Based Hypervolume Indicators: Construction, Properties, and Efficient Computation","216457298":"A portfolio optimisation approach to selection in multi-objective evolutionary algorithms","278711337":"Lecture Notes in Computer Science","282249316":"PICEA-g Using An Enhanced Fitness Assignment Method","220199847":"Evolution strategies and multi-objective optimization of permanent magnet motor","264641919":"Evolutionary Path Control Strategy for Solving Many-Objective Optimization Problem","265799530":"TOWARDS ENHANCING SOLUTION SPACE DIVERSITY IN MULTI-OBJECTIVE OPTIMIZATION: A HYPERVOLUME-BASED APPROACH","276100299":"Network Structural Balance Based on Evolutionary Multiobjective Optimization: A Two-Step Approach","216457248":"The maximum hypervolume set yields near-optimal approximation","280151668":"A comparative study of many-objective evolutionary algorithms for the discovery of software architectures","273394316":"Big Data Opportunities and Challenges: Discussions from Data Analytics Perspectives [Discussion Forum]","265635612":"Clustering-Based Selection for Evolutionary Many-Objective Optimization","253359061":"Shift-Based Density Estimation for Pareto-Based Algorithms in Many-Objective Optimization","262242681":"A multi-objective artificial immune system based on hypervolume","269294293":"Challenges of Dynamic Multi-objective Optimisation","261460815":"A new selection mechanism based on hypervolume and its locality property","255564256":"Microsoft-CNRS Chair \"Optimization for Sustainable Development\", Activity Report 2009-2011","224214406":"A Pareto Corner Search Evolutionary Algorithm and Dimensionality Reduction in Many-Objective Optimization Problems","241770164":"Local Preference-inspired Co-evolutionary Algorithms","264387359":"An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point-Based Nondominated Sorting Approach, Part I: Solving Problems With Box Constraints","259804065":"An Adaptive Multi-Swarm Optimizer for Dynamic Optimization Problems","280631909":"Online Diversity Assessment in Evolutionary Multiobjective Optimization: A Geometrical Perspective","251238425":"Incorporating User Preferences in Many-Objective Optimization using Relation Epsilon-Preferred","233529610":"Generalized Decomposition and Cross Entropy Methods for Many-Objective Optimization","272376541":"Design Optimization of an Unmanned Underwater Vehicle Using Low- and High-Fidelity Models","254043590":"An estimation of distribution algorithm based on decomposition for the multiobjective TSP","260134761":"Consistencies or Contradictions of Performance Metrics in Multiobjective Optimization?","257385406":"A survey of multi-objective metaheuristics applied to structural optimization","264709932":"Physical programming for preference driven evolutionary multi-objective optimization","263586138":"R 2 Indicator-Based Multiobjective Search","261054334":"Hypervolume-based expected improvement: Monotonicity properties and exact computation","216457232":"Investigating and Exploiting the Bias of the Weighted Hypervolume to Articulate User Preferences","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","264432442":"Deconstructing Multi-objective Evolutionary Algorithms: An Iterative Analysis on the Permutation Flow-Shop Problem","261054322":"R2-IBEA: R2 indicator based evolutionary algorithm for multiobjective optimization","222889399":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications","269275405":"A Knee Point Driven Evolutionary Algorithm for Many-Objective Optimization","265021130":"A test problem for visual investigation of high-dimensional multi-objective search","269190922":"High dimensional search-based software engineering","254043686":"A Decomposition based estimation of distribution algorithm for multiobjective knapsack problems","261054093":"An enhanced MOEA/D using uniform directions and a pre-organization procedure","289825861":"A Reference Vector Guided Evolutionary Algorithm for Many-Objective Optimization","265611475":"Towards a Greener Cloud Infrastructure Management using Optimized Placement Policies","235709701":"Recent Developments in Derivative-Free Multiobjective Optimisation","259084900":"Speeding up many-objective optimization by Monte Carlo approximations","278797707":"Using Comparative Preference Statements in Hypervolume-Based Interactive Multiobjective Optimization","276075363":"A New Uniform Evolutionary Algorithm Based on Decomposition and CDAS for Many-objective Optimization","277764505":"Empirical Evaluations Using Character and Word N-Grams on Authorship Attribution for Telugu Text","237094200":"ETEA: A Euclidean Minimum Spanning Tree-Based Evolutionary Algorithm for Multi-Objective Optimization","261053613":"A ranking method based on the R2 indicator for many-objective optimization","266967755":"Interrelationship-Based Selection for Decomposition Multiobjective Optimization","224177791":"Combining multiobjective and single-objective genetic algorithms in heterogeneous island model","278619582":"A Correlation Analysis of Set Quality Indicator Values in Multiobjective Optimization","276377424":"An analysis of parameter sensitivities of preference-inspired co-evolutionary algorithms","221418008":"SMSP-EMOA: Augmenting SMS-EMOA with the prospect indicator for multiobjective optimization","285952549":"Element Spacing Optimization of Low Sidelobe Concentric Hexagonal Antenna Arrays Using MOEA/D","259982925":"Pareto archived dynamically dimensioned search with hypervolume-based selection for multi-objective optimization","288838659":"Enhanced Version of Multi-algorithm Genetically Adaptive for Multiobjective optimization","280033160":"Use HypE to Hide Association Rules by Adding Items","272846207":"Preference-inspired co-evolutionary algorithms using weight vectors","235686193":"Cone-based Hypervolume Indicator: Definition, Efficient Computation, and Interpretation","233986253":"Optimierung von Fahrzeugkonzepten in der frühen Entwicklungsphase mit Hilfe Genetischer Algorithmen und Künstlicher Neuronaler Netze","224177694":"Two novel approaches for many-objective optimization","273296140":"An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition","282941851":"Optimal WCDMA network planning by multiobjective evolutionary algorithm with problem-specific genetic operation","221336182":"A Multiobjective Evolutionary Algorithm for Numerical Parameter Space Characterization of Reaction Diffusion Systems","266656428":"An improved NSGA-III procedure for evolutionary many-objective optimization","47757713":"Lecture Notes in Computer Science","262527726":"The assessment of evolutionary algorithms for analyzing the positional accuracy and uncertainty of maps","47843222":"Don\u0027t be greedy when calculating hypervolume contributions","210205139":"Computing Hypervolume Contributions in Low Dimensions: Asymptotically Optimal Algorithm and Complexity Results","242823982":"Decomposition-Based Memetic Algorithm for Multi-Objective Capacitated Arc Routing Problem","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","289520152":"A Posteriori Pareto Front Diversification Using a Copula-Based Estimation of Distribution Algorithm","261447374":"Set-based genetic algorithms for solving many-objective optimization problems","47843204":"Multiplicative Approximations and the Hypervolume Indicator","221416557":"Boosting Indicator-Based Selection Operators for Evolutionary Multiobjective Optimization Algorithms.","281329563":"Experiments on Local Search for Bi-objective Unconstrained Binary Quadratic Programming","220776522":"Local Meta-models for ASM-MOMA","281413027":"Indicator Based Ant Colony Optimization for Multi-objective Knapsack Problem","250890131":"Efficient evolutionary approach to approximate the Pareto-optimal set in multiobjective optimization, UPS-EMOA","282833842":"Manage the Tradeoff in Data Sanitization","272373586":"A New Decomposition Based Evolutionary Algorithm with Uniform Designs for Many-objective Optimization","220981336":"Improving many-objective optimizers with aggregate meta-models","4035396":"Multiple layer asymmetric vertical comb-drive actuated scanning mirrors","264387256":"Multiobjective Estimation of Distribution Algorithm Based on Joint Modeling of Objectives and Variables","261342959":"A CMA stochastic differential equation approach for many-objective optimization","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","271002970":"Multiobjective optimization algorithm with objective-wise learning for continuous multiobjective problems","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","281887155":"Evolutionary algorithm based on information separation for Many-Objective optimization","278705437":"Comparison of PI and Fractional PI Controllers on a Hydraulic Canal Using Pareto Fronts","259515122":"Resource allocation model and double-sphere crowding distance for evolutionary multi-objective optimization","220935340":"Asymmetric Pareto-adaptive Scheme for Multiobjective Optimization","237148074":"Combining Crowding Estimation in Objective and Decision Space With Multiple Selection and Search Strategies for Multi-Objective Evolutionary Optimization","262272552":"Recombination of Similar Parents in SMS-EMOA on Many-Objective 0/1 Knapsack Problems","259505405":"General framework for localised multi-objective evolutionary algorithms","255968973":"R2-IBEA: R2 Indicator Based Evolutionary Algorithm for Multiobjective Optimization","239765978":"Many-Objective Optimization of Antenna Arrays Using an Improved Multiple-Single-Objective Pareto Sampling Algorithm","221008573":"A progress indicator for detecting success and failure in evolutionary multi-objective optimization.","261184006":"An Improved Decomposition-Based Memetic Algorithm for Multi-Objective Capacitated Arc Routing Problem","221139127":"Alleviate the Hypervolume Degeneration Problem of NSGA-II.","284719460":"Pareto or Non-Pareto: Bi-Criterion Evolution in Multi-Objective Optimization","224246979":"ASM-MOMA: Multiobjective memetic algorithm with aggregate surrogate model","281897298":"A hybrid evolutionary multiobjective optimization algorithm with adaptive multi-fitness assignment","280063760":"MOEA/VAN: Multiobjective Evolutionary Algorithm Based on Vector Angle Neighborhood","260166692":"A Memetic Optimization Strategy Based on Dimension Reduction in Decision Space","220741262":"Multiobjectivization for parameter estimation: A case-study on the segment polarity network of Drosophila","216300866":"Non-monotonicity of Observed Hypervolume in 1-Greedy S -Metric Selection","261053992":"Many-objective and many-variable test problems for visual examination of multiobjective search","273916923":"Objective reduction based on nonlinear correlation information entropy","273696249":"On Current Model–Building Methods for Multi–Objective Estimation of Distribution Algorithms: Shortcommings and Directions for Improvement","261130810":"An adaptive constraint handling approach embedded MOEA/D","264826978":"Multiobjective optimization based on reputation","271003019":"A multi-population cooperative coevolutionary algorithm for multi-objective capacitated arc routing problem","265552506":"High Dimensional Search-based Software Engineering: Finding Tradeoffs among 15 Objectives for Automating Software Refactoring Using NSGA-III","280727316":"Self-organizing Multiobjective Optimization Based on Decomposition with Neighborhood Ensemble","261078079":"Effects of duplicated objectives in many-objective optimization problems on the search behavior of hypervolume-based evolutionary algorithms","220741273":"Scaling up indicator-based MOEAs by approximating the least hypervolume contributor: A preliminary study","254462104":"GECCO 2012 tutorial on evolutionary multiobjective optimization","277717819":"Optimizing an Amplifier by a Many-Objective Algorithm Based on R2 Indicator","277605171":"An Algorithm for Many-Objective Optimization With Reduced Objective Computations: A Study in Differential Evolution","281704307":"Multi-objective bat algorithm based on decomposition","261054005":"MOMBI: A new metaheuristic for many-objective optimization based on the R2 indicator","224247009":"Effective ranking + speciation \u003d Many-objective optimization","261054003":"Ranking many-objective Evolutionary Algorithms using performance metrics ensemble","287330461":"IMPACT ANALYSIS OF CROSSOVERS IN MULTIOBJECTIVE EVOLUTIONARY ALGORITHM","261120557":"An algorithm for calculating the hypervolume contribution of a set","290109684":"Relation between Neighborhood Size and MOEA/D Performance on Many-Objective Problems","221008531":"Optimising multi-modal polynomial mutation operators for multi-objective problem classes","283905875":"Many-objective optimization based on information separation and neighbor punishment selection","261520468":"Diversity Comparison of Pareto Front Approximations in Many-Objective Optimization","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","266653730":"On set-based local search for multiobjective combinatorial optimization","269126092":"Meta-level multi-objective formulations of set optimization for multi-objective optimization problems: Multi-reference point approach to hypervolume maximization","286412505":"Ensemble of many-objective evolutionary algorithms for many-objective problems","260621912":"Preference-Inspired Coevolutionary Algorithms for Many-Objective Optimization","264002669":"Hypervolume Maximization via Set Based Newton\u0027s Method","282970380":"An alternative hypervolume-based selection mechanism for multi-objective evolutionary algorithms","225836716":"A Hypervolume-Based Optimizer for High-Dimensional Objective Spaces","260360285":"A survey on multi-objective evolutionary algorithms for many-objective problems","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","261276238":"Preference-Based Evolutionary Multi-objective Optimization","282195249":"Preference Articulation by Means of the R2 Indicator","261460596":"Preference-inspired co-evolutionary algorithm using adaptively generated goal vectors","261460599":"Use of cooperative coevolution for solving large scale multiobjective optimization problems","257588920":"New fitness sharing approach for multi-objective genetic algorithms","267982364":"An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition","257352368":"Aggregate meta-models for evolutionary multiobjective and many-objective optimization","262323269":"A Surrogate Based Multiobjective Evolution Strategy with Different Models for Local Search and Pre-Selection","261460604":"A steady state decomposition based quantum genetic algorithm for many objective optimization","282970423":"An Interactive Simple Indicator-Based Evolutionary Algorithm (I-SIBEA) for Multiobjective Optimization Problems","261202557":"An Evolutionary Strategy for Surrogate-Based Multiobjective Optimization","220310732":"Achieving balance between proximity and diversity in multi-objective evolutionary algorithm","282570552":"A Bayesian approach to constrained single- and multi-objective optimization","235790839":"Stochastic Pareto local search: Pareto neighbourhood exploration and perturbation strategies","261430382":"Issues with performance measures for dynamic multi-objective optimisation","267744266":"An Evolutionary Algorithm with Double-Level Archives for Multiobjective Optimization","283101984":"D-NSGA-II: Dual-stage nondominated sorting genetic algorithm-II"},"index":9}