{"abs":"This paper proposes a new method that extends the efficient global optimization to address stochastic black-box systems. The method is based on a kriging meta-model that provides a global prediction of the objective values and a measure of prediction uncertainty at every point. The criterion for the infill sample selection is an augmented expected improvement function with desirable properties for stochastic responses. The method is empirically compared with the revised simplex search, the simultaneous perturbation stochastic approximation, and the DIRECT methods using six test problems from the literature. An application case study on an inventory system is also documented. The results suggest that the proposed method has excellent consistency and efficiency in finding global optimal solutions, and is particularly useful for expensive systems.","title":"Global Optimization of Stochastic BlackBox Systems via Sequential Kriging Meta-Models","id":238833171,"url":"https://www.researchgate.net/publication/238833171_Global_Optimization_of_Stochastic_BlackBox_Systems_via_Sequential_Kriging_Meta-Models","names":["D. Huang","Theodore T. Allen","William I. Notz","Ning Zheng","Journal of Global Optimization"],"references":{"229712053":"Some experiments in global optimization","244958556":"A Method for Finding Multiple Extrema of a Function of n Variables","239060152":"Uniform design: Theory and application","244959955":"A New Method of Locating the Maximum Point of an Arbitrary Multipeak Curve in the Presence of Noise","245893283":"Designs for Computer Experiments","2367848":"The Use of Surrogate Modeling Algorithms to Exploit Disparities in Function Computation Time within Simulation-Based Optimization","201975941":"A Connectionist Machine for Genetic Hill-Climbing","224104534":"Widely Convergent Method for Finding Multiple Solutions of Simultaneous Nonlinear Equations","227446912":"Nelder-Mead Simplex Modifications for Simulation Optimization","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","258950396":"Simulation Modeling and Analysis","38367066":"On the Measure of Information Provided by an Experiment","225953250":"Optimization via Simulation: a Review","38363487":"The Design and Analysis of Computer Experiments","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","216756595":"Uniform Design: Theory and Application","2383486":"Comparison Of Response Surface Methodology And The Nelder And Mead Simplex Method For Optimization In Microsimulation Models","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","38367465":"Stochastic Estimation of the Maximum of A Regression Function","216301381":"The Design and Analysis Computer Experiments","265414448":"Multivariate Stochastic Approximation Using a Simultaneous Perturbation Gradient Approximation","250754768":"9 Computer experiments","216301383":"Exploration of Metamodeling Sampling Criteria for Constrained Global Optimization","226216344":"Lipschitzian Optimisation Without the Lipschitz Constant","256569833":"Optimization in Simulation Experiments Using Response Surface Methodology","243450406":"Minimization Algorithms for Functions with Random Noise","226055709":"A parallel updating scheme for approximating and optimizing high fidelity computer simulations","3997912":"Response surface methodology revisited","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","238677918":"Random Number Generation and Quasi-Monte Carlo Methods. SIAM, Philadelphia","222490346":"Minimax and Maximin Distance Designs","38363488":"[Design and Analysis of Computer Experiments]: Comment","38363491":"[Design and Analysis of Computer Experiments]: Comment","3885911":"Framework for Response Surface Methodology for simulation optimization","267463197":"Mimun. Optimization of one-dimensional multimodal functions in the presence of noise","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","2615754":"A Revised Simplex Search Procedure For Stochastic Simulation Response-Surface Optimization","225595231":"Sequential approximate optimization using variable fidelity response surface approximation","216301386":"Flexibility and Efficiency Enhancements For Constrainted Global Design Optimization with Kriging Approximations","3002947":"Implementation of the simultaneous perturbation algorithm of stochastic optimization","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","216756632":"Sequential Design of Computer Experiments to Minimize Integrated Response Functions","226301763":"A locally-biased form of the DIRECT algorithm","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","3021008":"Spall, J.C.: Multivariate stochastic approximation using a simultaneous perturbation gradient approximation. IEEE Trans. Auto. Cont. 37(3), 332-341"},"citedIn":{"228438173":"Simultaneous kriging-based estimation and optimization of mean response","242330481":"An Adaptive Hybrid Surrogate Model","273957973":"Rigorous design of distillation columns using surrogate models based on Kriging interpolation","220740907":"An experimental investigation of model-based parameter optimisation: SPO and beyond.","233424111":"Development of artificial neural network models based on experimental data of response surface methodology to establish the nutritional requirements of digestible lysine, methionine, and threonine in broiler chicks","221008932":"Sequential Parameter Optimization of an Evolution Strategy for the design of Mold Temperature Control Systems.","225394534":"Generalized sequential kriging (GSK) for heterogeneous cell size: Property modeling without matrices","287807788":"Parametric Optimization: Response Surfaces and Neural Networks","254230327":"Combining radial basis function surrogates and dynamic coordinate search in high-dimensional expensive black-box optimization","258407543":"Integration of AI and OR Techniques in Constraint Programming for Combinatorial Optimization Problems","221006911":"Online convergence detection for evolutionary multi-objective algorithms revisited","48190924":"Convergence rates of efficient global optimization algorithms","258452593":"Inventory routing for dynamic waste collection","45416610":"Dealing with asynchronicity in parallel Gaussian Process based global optimization","264132261":"A STUDY ON CONSTRAINED EGO METHOD FOR NOISY CFD DATA","236963842":"Adapting Control Policies for Expensive Systems to Changing Environments","242713705":"Knowledge-Gradient Methods for Statistical Learning","227505553":"Efficient sampling for spatial uncertainty quantification in multibody system dynamics applications","242330478":"Domain Segmentation based on Uncertainty in The Surrogate (DSUS)","257588857":"Optimal learning for sequential sampling with non-parametric beliefs","270158905":"Optimization of Spot-Welded Joints Combined Artificial Bee Colony Algorithm with Sequential Kriging Optimization","48166394":"A Tutorial on Bayesian Optimization of Expensive Cost Functions, with Application to Active User Modeling and Hierarchical Reinforcement Learning","260011867":"A Beginner\u0027s Guide to Tuning Methods","227145388":"Expected improvement in efficient global optimization through bootstrapped kriging","257588605":"A quasi-multistart framework for global optimization of expensive functions using response surface models","268687919":"Reduction of calibration effort in FEM-based optimization via numerical and experimental data fusion","280873107":"A Knowledge Gradient Policy for Sequencing Experiments to Identify the Structure of RNA Molecules Using a Sparse Additive Belief Model","46429930":"Constrained Optimization in Simulation: A Novel Approach","46766566":"Sequential Approximate Optimization using Radial Basis Function network for engineering optimization","270302259":"A study on constrained efficient global optimization method for noisy computational fluid dynamics data","262575241":"Learning surrogate models for simulation‐based optimization","259134790":"Joint production and major maintenance planning policy of a manufacturing system with deteriorating quality. Int J Prod Econ","261152678":"Non-uniform mode-pursuing sampling method based on multivariate multimodal distribution model","254320926":"A statistical model-based algorithm for ‘black-box’ multi-objective optimisation","280019336":"Simulation optimization: a review of algorithms and applications","220789266":"A Bayesian Interactive Optimization Approach to Procedural Animation Design","251876153":"Efficient global optimization algorithm assisted by multiple surrogate techniques","273869422":"Characterizing Uncertainty Attributable to Surrogate Models","221345649":"Gaussian Process Optimization in the Bandit Setting: No Regret and Experimental Design","238080113":"Efficient algorithms for mixed aleatory-epistemic uncertainty quantification with application to radiation-hardened electronics. Part I, algorithms and benchmark results","282926748":"Discrete optimization via simulation using Gaussian Markov random fields","224303132":"Identification of expensive-to-simulate parametric models using Kriging and Stepwise Uncertainty Reduction","282379926":"Effectiveness indicators for stopping criteria based on minimum required improvement","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","270162527":"Development of a novel identification platform for automotive dampers","223623709":"Onboard sensor orientation analysis with kriging method","270882668":"Value-Based Global Optimization","221529726":"Simulation Optimization using Metamodels.","220385644":"Discussion (5): Jones-Johnson Paper","235710045":"A Subjective Review of the State of the Art in Model-Based Parameter Tuning","254331259":"Quantile-Based Optimization of Noisy Computer Experiments With Tunable Precision","223897356":"Lean optimization using supersaturated experimental design","281840537":"Simulation-based design optimization by sequential multi-criterion adaptive sampling and dynamic radial basis functions","260125143":"Engineering Design and Decision Making Models","221528172":"Calibrating simulation models using the knowledge gradient with continuous parameters","277034459":"Anpassungen von Suchheuristiken für ereignisdiskrete Modelle","220668798":"The Knowledge-Gradient Policy for Correlated Normal Beliefs","225689898":"A response-modeling approach to global optimization and OUU","266829244":"Chinese translation of [Design and Analysis of Simulation Experiments]","235709783":"Automated Algorithm Configuration and Parameter Tuning","221494383":"On the Performance of Metamodel Assisted MOEA/D","227704780":"Design and Analysis for the Gaussian Process Model","221007474":"Iteration-wise parameter learning","259139116":"The use of partially converged simulations in building surrogate models","261163251":"Efficient discrete optimization via simulation using stochastic kriging","30861493":"Active/Passive Optimization of Helicopter Rotor Blades for Improved Vibration, Noise, and Performance Characteristics.","221608790":"Lecture Notes in Computer Science","277567471":"Simulation data management for adaptive design of EXPERIMENTS: a litterature review","281231526":"Sequential Selection with Unknown Correlation Structures","30514102":"Optimisation de Forme Multi-Objectif sur Machines Parallèles avec\nMéta-Modèles et Coupleurs. Application aux Chambres de Combustion Aéronautiques.","285965923":"An Initialization Strategy for High-Dimensional Surrogate-Based Expensive Black-Box Optimization","236617840":"Optimization of a centrifugal fan impeller using kriging simulated annealing","254222410":"Optimisation of composite manufacturing processes with computer experiments and Kriging methods","263546072":"A CAD/CAE integrated framework for structural design optimization using sequential approximation optimization","228346610":"The Knowledge-Gradient Algorithm for Sequencing Experiments in Drug Discovery","220702281":"Local Meta-models for Optimization Using Evolution Strategies","263048671":"Monte Carlo sampling-based methods for stochastic optimization","260124658":"Surrogate-Based Optimization of Expensive-to-Evaluate Objective for Optimal Highway Toll Charges in Transportation Network","241638164":"Information-Theoretic Regret Bounds for Gaussian Process Optimization in the Bandit Setting","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","272374601":"Multi objective optimization of computationally expensive multi-modal functions with RBF surrogates and multi-rule selection","221024596":"Meta-Modeling in Multiobjective Optimization","226266372":"Kriging-based convex subspace single linkage method with path-based clustering technique for approximation-based global optimization","221608782":"Time-Bounded Sequential Parameter Optimization","226716412":"Kriging Is Well-Suited to Parallelize Optimization","274714656":"The numerical solution of elliptic partial differential equations with fuzzy coefficients","260836339":"Derivative-free optimization for expensive constrained problems using a novel expected improvement objective function","263471925":"Expected improvement in efficient experimental design supported by a global optimizer","238058675":"Penetrator reliability investigation and design exploration : from conventional design processes to innovative uncertainty-capturing algorithms","262161700":"High-Dimensional Model-Based Optimization Based on Noisy Evaluations of Computer Games","226200574":"A Review of Recent Advances in Global Optimization","221228457":"Noisy Multiobjective Optimization on a Budget of 250 Evaluations","251621497":"Mixed aleatory-epistemic uncertainty quantification with stochastic expansions and optimization-based interval estimation","281127496":"Automatic discovery and optimization of chemical processes","51841947":"On the Effect of Response Transformations in Sequential Parameter Optimization","254463654":"Bayesian Kriging Analysis and Design for Stochastic Simulations","226310128":"An experimental methodology for response surface optimization methods","260029170":"Structural design employing a sequential approximation optimization approach","277222408":"Optimisation sans dérivées sous contraintes : deux applications industrielles en ingénierie de réservoir et en calibration des moteurs","235709827":"Optimizing Support Vector Machines for Stormwater Prediction","272164535":"Hypersonic lifting body aerodynamic shape optimization based on the multiobjective evolutionary algorithm based on decomposition","224209103":"A Bayesian metamodeling approach for stochastic simulations","250587772":"Zur Zuordnung des1H- und des13C-NMR-Spektrums des N-Methylchinolinium-ions","269329310":"Conditional simulation for efficient global optimization","46587728":"Portfolio Allocation for Bayesian Optimization","225513703":"Sequential kriging optimization using multiple-fidelity evaluations","220863676":"On Selection of Testable Paths with Specified Lengths for Faster-Than-At-Speed Testing","235036052":"Development of Multidisciplinary, Multifidelity Analysis, Integration, and Optimization of Aerospace Vehicles","220200072":"Simulation optimization based on Taylor Kriging and evolutionary algorithm","222662110":"Kriging metamodeling in simulation: a review. Eur J Oper Res","30816586":"Optimization of Stochastic Discrete Event Simulation Models","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","281946477":"Robust minimax design from costly simulations.","269047469":"Impact of Turbulence Closures and Numerical Errors for the Optimization of Flow Control Devices","266017149":"Programming by Optimisation","45416733":"Simultaneous Kriging-Based Sampling For Optimization And Uncertainty Propagation","281927780":"Uncertainty Management Using Sequential Parameter Optimization","257588720":"Setting targets for surrogate-based optimization","44218382":"Noisy Expected Improvement and on-line computation time allocation for the optimization of simulators with tunable fidelity","235710112":"Sequential Model-Based Parameter Optimisation: an Experimental Investigation of Automated and Interactive Approaches","266000502":"A Dynamic Sampling Method for Kriging and Cokriging Surrogate Models","262236687":"Noisy kriging-based optimization methods: A unified implementation within the DiceOptim package","43292197":"Optimisation globale de systèmes mécaniques","241706969":"Worst-case global optimization of black-box functions through Kriging and relaxation","267707718":"Hybrid-surrogate-model-based efficient global optimization for high-dimensional antenna design","221008536":"Fuzzy Clustering Based Gaussian Process Model for Large Training Set and Its Application in Expensive Evolutionary Optimization","223385573":"Optimal design of aeroengine turbine disc based on kriging surrogate models","257777640":"Surrogate-Based Optimization of Expensive Flowsheet Modeling for Continuous Pharmaceutical Manufacturing","226876467":"Assessing the value of another cycle in Gaussian process surrogate-based optimization","255659402":"Modélisation et prise en compte des incertitudes dans les systèmes de décision","233256031":"An improvement of Kriging based sequential approximate optimization method via extended use of design of experiments","271366292":"Efficient multi-criteria optimization on noisy machine learning problems","279474705":"OPTIMIZATION OF ALGORITHMS WITH THE OPAL FRAMEWORK","274673377":"Bayesian optimization for tuning chaotic systems","51951015":"A Framework for Optimization under Limited Information","277899311":"A kind of balance between exploitation and exploration on kriging for global optimization of expensive functions","44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","282400016":"Multiobjective optimization of expensive-to-evaluate deterministic computer simulator models","224367002":"Kriging model with modified nugget effect for random simulation with heterogeneous variances","225702326":"Application of SEUMRE global optimization algorithm in automotive magnetorheological brake design","257335184":"A benchmark of kriging-based infill criteria for noisy optimization","226724932":"Modelling of a thermomechanically coupled forming process based on functional outputs from a finite element analysis and from experimental measurements","278381904":"Simulation Data Management for Adaptive Design Of Experiment","266694957":"A Hybrid Model of Uniform Design and Artificial Neural Network for The Optimization of Dietary Metabolizable Energy, Digestible Lysine, and Methionine in Quail Chicks","248880156":"Assessing a Response Surface-Based Optimization Approach for Soil Vapor Extraction System Design","228351315":"Gaussian processes for global optimization","234467126":"CFD-based surrogate modeling of liquid rocket engine components via design space refinement and sensitivity assessment","220346866":"Kriging metamodel management in the design optimization of a CNG injection system","221527783":"Discrete stochastic optimization using linear interpolation","220384497":"Kriging metamodel with modified nugget-effect: The heteroscedastic variance case","263244902":"Constrained optimization by radial basis function interpolation for high-dimensional expensive black-box problems with infeasible initial points","278649676":"A Review of Random Search Methods","220133318":"The Correlated Knowledge Gradient for Simulation Optimization of Continuous Parameters using Gaussian Process Regression","29639452":"A Multi-points Criterion for Deterministic Parallel Global Optimization based on Kriging","220636670":"The Challenge of Optimising Expensive Black Boxes, A Scatter Search/Rough Set Theory Approach","242161075":"Stochastic Optimization in Dynamic Environments With applications in e-commerce","49289516":"RBFネットワークによる逐次近似最適化 : サンプル関数の基礎的検討　","226702431":"A method for simulation based optimization using radial basis functions","262371966":"A surrogate-based optimization method with RBF neural network enhanced by linear interpolation and hybrid infill strategy","222679450":"Convergence properties of the expected improvement algorithm with fixed mean and covariance functions","271454705":"The knowledge gradient algorithm using locally parametric approximations","221837016":"Resampling Methods for Meta-Model Validation with Recommendations for Evolutionary Computation","267736340":"EVALUATION OF KRIGING-BASED METHODS FOR SIMULATION OPTIMIZATION WITH HOMOGENEOUS NOISE","276461208":"Computational Enhancements to Bayesian Design of Experiments Using Gaussian Processes","283117826":"GLASSES: Relieving The Myopia Of Bayesian Optimisation","277072736":"MULTIPLES MÉTAMODÈLES POUR L\u0027APPROXIMATION ET L\u0027OPTIMISATION DE FONCTIONS NUMÉRIQUES MULTIVARIABLES","261842296":"Evolutionary Algorithms","254306508":"Simulation Optimization via Kriging: A Sequential Search using Expected Improvement with Computing Budget Constraints","254860245":"Optimization under uncertainty of metal forming processes - an overview : literature report","281128487":"A new expected-improvement algorithm for continuous minimax optimization","264961313":"Modeling and optimization. Theory and applications. Selected contributions from the MOPTA 2012 conference, Bethlehem, PA, USA, July 30 – August 1, 2012","264561960":"A Bayesian Approach to Sequential Optimization based on Computer Experiments","265473087":"Optimization and Analysis of Centrifugal Pump considering Fluid-Structure Interaction","265738296":"The Correlated Knowledge Gradient for Maximizing Expensive Continuous Functions with Noisy Observations using Gaussian Process Regression","237590215":"Multimodal Reliability Assessment for Complex Engineering Applications using Ecient Global Optimization","251833069":"A Method to Optimize the Geometry of Radiation Detectors by Exploiting the Multiphysics Nature of the Simulations","228395629":"Efficient sampling of dynamical systems with spatial uncertainty","258581405":"Multi-Point Sequential Sampling Method for Complex Engineering Optimization Problems","276378765":"Importance Sampling for Reliability Evaluation With Stochastic Simulation Models","277609855":"Optimal learning with a local parametric belief model","259249029":"Calibration of forcefields for molecular simulation: Sequential design of computer experiments for building cost-efficient kriging metamodels","29609787":"Global optimization of expensive-to-evaluate functions: An empirical comparison of two sampling criteria","275241118":"Adaptive Kriging surrogate model for the optimization design of a dense non-aqueous phase liquid-contaminated groundwater remediation process","271753928":"Optimization Under Constraints by Applying an Asymmetric Entropy Measure","273693867":"Simulation-Based Optimization of Mixed Road Pricing Policies in a Large Real-World Network","253397473":"Risk analysis: Frequentist and Bayesians unite!","221353676":"Automated Configuration of Mixed Integer Programming Solvers","233586706":"System development and application of Taylor Kriging metamodeling","222148546":"Constrained optimization in simulation: A novel approach"},"index":900}