{"abs":"Statistical approaches to overdispersion, correlated errors, shrinkage estimation, and smoothing of regression relationships may be encompassed within the framework of the generalized linear mixed model (GLMM). Given an unobserved vector of random effects, observations are assumed to be conditionally independent with means that depend on the linear predictor through a specified link function and conditional variances that are specified by a variance function, known prior weights and a scale factor. The random effects are assumed to be normally distributed with mean zero and dispersion matrix depending on unknown variance components. For problems involving time series, spatial aggregation and smoothing, the dispersion may be specified in terms of a rank deficient inverse covariance matrix. Approximation of the marginal quasi-likelihood using Laplace\u0027s method leads eventually to estimating equations based on penalized quasilikelihood or PQL for the mean parameters and pseudo-likelihood for the variances. Implementation involves repeated calls to normal theory procedures for REML estimation in variance components problems. By means of informal mathematical arguments, simulations and a series of worked examples, we conclude that PQL is of practical value for approximate inference on parameters and realizations of random effects in the hierarchical model. The applications cover overdispersion in binomial proportions of seed germination; longitudinal analysis of attack rates in epilepsy patients; smoothing of birth cohort effects in an age-cohort model of breast cancer incidence; evaluation of curvature of birth cohort effects in a case-control study of childhood cancer and obstetric radiation; spatial aggregation of lip cancer rates in Scottish counties; and the success of salamander matings in a complicated experiment involving crossing of male and female effects. PQL tends to underestimate somewhat the variance components and (in absolute value) fixed effects when applied to clustered binary data, but the situation improves rapidly for binomial observations having denominators greater than one.","title":"Approximate Inference In Generalized Linear Mixed Models","id":265423254,"url":"https://www.researchgate.net/publication/265423254_Approximate_Inference_In_Generalized_Linear_Mixed_Models","names":["N.E. Breslow","D.G. Clayton","Journal of the American Statistical Association"],"references":{"265367507":"Exponential dispersion models","246910388":"Multivariate Regression Analyses for Categorical Data","254287149":"Generalized Linear Models With Random Effects; A Gibbs Sampling Approach","224840043":"Recovery of Inter-Block Information When Block Sizes are Unequal","269923224":"Covariance Selection","20914481":"Nonlinear Mixed Effects Models for Repeated Measures Data","265545308":"Penalized Likelihood for General Semi-Parametric Regression Models","20914480":"Some Covariance Models for Longitudinal Count Data with Overdispersion","243083117":"Hypothesis Testing of Regression Parameters in Semiparametric Generalized Linear Models for Cluster Correlated Data","38366552":"An Optimum Property of Regular Maximum Likelihood Estimation","22015068":"Indirect Standardization and multiplicative models for rates, with reference to age adjustment of cancer incidence and relative frequency data","245735987":"Compound Poisson Regression Models","223822273":"Iterative simulation methods","38363346":"That EBLUP is a good thing: The estimation of random effects","239986129":"Extra-Binomial Variation in Logistic Linear Models","243042658":"Regression Analysis of Correlated Binary Data: Some Small Sample Results for the Estimating Equation Approach","34435245":"Extension of the Stein Estimating Procedure Through the Use of Estimating Functions","268553124":"Empirical Bayes Confidence Intervals Based on Bootstrap Samples","22202101":"Regression Analysis of the Log Odds Ratio: A Method for Retrospective Studies","24052037":"Bayesian Image Restoration With Two applications In Spatial Statistics","11228416":"Empirical Bayes Procedures for Stabilizing Maps of U.S. Cancer Mortality Rates","246154631":"Extra-Poisson Variation in Log-Linear Models","31086711":"A Generalized Linear Model with Nested Strata of Extra-Poisson Variation","19497758":"“Empirical Bayes Estimates of Age-Standardized Relative Risk for Use in Disease Mapping.”","254286111":"Approximations for Standard Errors of Estimators of Fixed and Random Effect in Mixed Linear Models","31478744":"Empirical Bayes Methods for Two-Way Contingency Tables","16662725":"Random-Effects Models for Serial Observations with Binary Response","38364043":"Notes on the Covariance Matrix of a Random, Nested Anova Model","242939448":"Restricted BLUP for mixed linear models","18051408":"Problems Arising in Estimating from Retrospective Survey Data the Latent Periods of Juvenile Cancers Initiated by Obstetric Radiography","240166806":"Parameter orthogonality and approximate conditional inference. J Roy Stat Soc Ser B","239442562":"Bayesian Methods for Mapping Disease Risk","19346671":"Methods of Estimation in Log Odds Ratio Regression Models","268621515":"Bayesian forecasting. Discussion","243082921":"A Regression Model for Time Series of Counts","243672273":"Longitudinal Data Analysis Using General Linear Models","243768030":"Estimation in Generalized Linear Models with Random Effects","246785131":"Maximum likelihood from incomplete observations","21517719":"Generalized Linear Models with Random Effects; Salamander Mating Revisited","38358829":"Robust Estimation in Heteroscedastic Linear Models","19923543":"Correlated Binary Regression with Covariate Specific to Each Binary Observation","265812159":"The Evaluation of Integrals of the Form : Application to Logistic Normal-Models","19923544":"Zeger SL, Liang KY, Albert PS: Models for longitudinal data: A generalized estimating equation approach","243082641":"Asymptotic Properties of Moment Estimators for Overdispersed Counts and Proportions","254286535":"Dynamic Generalized Linear Models and Bayesian Forecasting","243082386":"The Analysis of Several 2 × 2 Contingency Tables","243713791":"Maximum Likelihood Approaches to Variance Component Estimation and to Related Problems: Rejoinder","31413542":"A Fast Scoring Algorithm for Maximum Likelihood Estimation in Unbalanced Mixed Models with Nested Random Effects","215385384":"An Algorithm for Least-Squares Estimation of Nonlinear Parameter","243082114":"Nonparametric Roughness Penalties for Probability Densities"},"citedIn":{},"index":902}