{"abs":"This paper presents an advanced algorithm for optimal motion planning of non-holonomic mobile robots in presence of multi obstacles. The proposed method is based on optimal control theory. To formulate optimal control problem, an appropriate objective function is assumed and the full nonlinear dynamic equations of non-holonomic mobile robot are used as constraints of problem. Also, for obstacles avoidance of mobile robot in presence of multi obstacles, the appropriate distance potential functions are applied to the objective function. By employing indirect solution of optimal control, the necessary equations of optimal motion planning are derived which can be solved numerically. Beyond the simplicity of our procedure, the presented method is able to plan optimal motion of non-holonomic mobile robots in the cluttered environment with multi obstacles. Finally, in order to demonstrate the power and efficiency of algorithm, a number of simulations are performed which truly show applicability of method.","title":"Optimal motion planning of non-holonomic mobile robots in presence of multi obstacles","id":251988411,"url":"https://www.researchgate.net/publication/251988411_Optimal_motion_planning_of_non-holonomic_mobile_robots_in_presence_of_multi_obstacles","names":["M. H. Korayem","M. Nazemizadeh","H. Binabaji","Vahid Azimirad"],"references":{"4012861":"Experimental evaluation of robot path planning by artificial potential field approach with simulated annealing","225157227":"Nonlinear dynamic analysis for elastic robotic arms","242351349":"Robot Motion Planning: A Distributed Representation Approach","223248712":"Optimal dynamics of actuated kinematic chains. Part 2: Problem statements and computational aspects","224645732":"Evolutionary Stigmergy in Multipurpose Navigation Systems","261425298":"Obstacle avoidance in mobile robot using Neural Network","241147605":"Robot Path Planning Based on Artificial Potential Field Approach with Simulated Annealing","4355150":"A new algebraic method for robot motion planning and real geometry","224677110":"Smooth Path Planning of a Mobile Robot Using Stochastic Particle Swarm Optimization","222582098":"Dynamic modelling, simulation and control of a manipulator with flexible links and joints","220432313":"Shortest Paths in the Plane with Polygonal Obstacles.","245040768":"A retraction method for planning the motion of a disc","221073462":"A Systematic Representation of Edges in Topological Maps for Mobile Robots using Wavelet Transformation.","224669688":"Coordinating locomotion and manipulation of a mobile manipulator. In","223618633":"Analysis of wheeled mobile flexible manipulator dynamic motions with maximum load carrying capacities","229867822":"Optimal Control of Rigid‐Link Manipulators by Indirect Methods","230872668":"A Multiple Shooting Algorithm for Direct Solution of Optimal Control Problems","245406014":"2D Laser-based Probabilistic Motion Tracking in Urban-like Environments","2308481":"Approximating Polyhedra with Spheres for Time-Critical Collision Detection","222528352":"An Ant Colony Optimization Approach to the Vehicle Routing Problem","226950690":"Symbolic–Numeric Indirect Method for Solving Optimal Control Problems for Large Multibody Systems","268474793":"Genetic Algorithm and Indirect Method Coupling for Low-Thrust Trajectory Optimization","220493066":"A BVP solver based on residual control and the Maltab PSE","226075976":"Dynamic Motion Planning for Mobile Robots Using Potential Field Method","3631360":"Randomized roadmap method for path and manipulation planning","262544145":"A rough terrain traction control technique for all-wheel-drive mobile robots","3298056":"Autonomous Navigation in a Manufacturing Environment","230872953":"Direct trajectory optimization using nonlinear programming and collocation, AIAA","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","224318618":"Optimal trajectory generation for nonholonomic robots in dynamic environments","262757228":"On-line planning of nonholonomic mobile manipulators based on stability twist constraint","4041594":"Trajectory Planning of Mobile Manipulator with Stability Considerations","263487475":"Robust adaptive neural network control for environmental boundary tracking by mobile robots","37441265":"Introduction to Autonomous Mobile Robots","220690155":"Digraphs. Theory, Algorithms and Applications","2383339":"Sensor-Based Exploration: Incremental Construction of the Hierarchical Generalized Voronoi Graph","231828227":"Maximum load carrying capacity of mobile manipulators: Optimal control approach","267718307":"Fuzzy-genetic optimal control for robotic systems","220122234":"Reactive Nonholonomic Trajectory Generation via Parametric Optimal Control","3979224":"Real-time obstacle avoidance for manipulators and mobile robots. Int J Robot Res 5:90-98","3930320":"Trajectory planning of mobile manipulator with end-effector\u0027s specified path","3026499":"Optimal control theory: An introduction","220981830":"Optimum Path Planning for Mobile Robots Based on a Hybrid Genetic Algorithm.","247343827":"Real-Time Obstacle Avoidance System for Manipulators and Mobile Robots","3021888":"“Coordinating Locomotion and Manipulation of a Mobile Manipulator,”","220492747":"Using AD to solve BVPs in Matlab","245981656":"Dynamic Load Carrying Capacity of Mechanical Manipulators—Part I: Problem Formulation","239552565":"The Complexity of Robot Motion Planning","220096748":"Autonomous robot navigation using adaptive potential fields","221911113":"Path Planning of Mobile Elastic Robotic Arms by Indirect Approach of Optimal Control","224730131":"A Local Based Approach for Path Planning of Manipulators with a High Number of Degrees of Freedom","227008240":"Maximum payload for flexible joint manipulators in point-to-point task using optimal control approach","44352605":"Optimal control theory : an introduction / Donald E. Kirk","221503688":"Robot Path Planning using Particle Swarm Optimization of Ferguson Splines","222686265":"Ant Colony System Algorithm for Real-Time Globally Optimal Path Planning of Mobile Robots"},"citedIn":{"234126038":"Trajectory optimization of nonholonomic mobile manipulators departing to a moving target amidst moving obstacles"},"index":903}