{"abs":"Optimization problems have been the subject of statistical physics approximations, given the natural connection between fitness optima in rugged landscapes, disordered systems and their underlying Hamiltonians. In this paper we present a novel approach to Multi-Objective Optimization (MOO), a general optimization method that encompasses all optimal solutions as long as no bias toward any of the objectives exists. The potential solutions are scattered over the so called Pareto front, and it is shown here that thermodynamics can be treated as a MOO using the associated free energy with constraints. The nature of phase transitions is tied to the Pareto front organization and we illustrate this using both the Ising and Potts models.","title":"A multiobjective optimization approach to statistical mechanics","id":258083640,"url":"https://www.researchgate.net/publication/258083640_A_multiobjective_optimization_approach_to_statistical_mechanics","names":["Luís F. Seoane","Ricard Sole"],"references":{"250165160":"Optimal Performance of the Heat-Shock Gene Regulatory Network","226999173":"The Potts Glass Model: A Scenario for the Freezing Transition of Structural Glasses?","8541633":"Least Effort and the origins of scaling in human language","222686733":"09/16/03 4:17 PM Multiple Criteria Decision Making Combined with Finance: A Categorized Bibliographic Study","13385669":"Physical aspects of evolutionary optimization and adaption","225086374":"Efficiency in Evolutionary Trade-Offs","235562887":"Evolutionary strategies of optimization","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","5342785":"Optimization in computational systems biology","13233116":"Analysis of genetic algorithms using statistical mechanics","230590050":"Multi-Criteria Optimization of Regulation in Metabolic Networks","3455466":"Evolutionary multi-objective optimization: A historical view of the field","23740085":"Optimization in Complex Networks","224855878":"Evolutionary Trade-Offs, Pareto Optimality, and the Geometry of Phenotype Space","2383237":"The TSP Phase Transition","1950395":"Genetic algorithm dynamics on a rugged landscape","225601428":"Functional–structural models optimize the placement of foliage units for multiple whole-canopy functions","228084720":"Parallel Predator-Prey Interaction for Evolutionary Multi-Objective Optimization","223038179":"Phase transitions and the search problem","239648032":"Statistics of Two-Dimensional Lattices with Many Components","12027036":"Small Worlds: How and Why","228095925":"Analysis of an information-theoretic model for communication","255959148":"Evolutionary Tradeoffs between Economy and Effectiveness in Biological Homeostasis Systems","11364995":"Ensemble-based control of evolutionary optimization algorithms","6880647":"Optimal design of spatial distribution networks","13229877":"Optimization on Rugged Landscapes: A New General Purpose Monte Carlo Approach","51930020":"Statistical Genetics and Evolution of Quantitative Traits","222530044":"Statistical mechanics methods and phase transitions in optimization problems","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","222534332":"Multi-objective Optimization using Genetic Algorithms: a Tutorial"},"citedIn":{"281707354":"Critical behaviour in charging of electric vehicles","283334726":"Systems poised to criticality through Pareto selective forces"},"index":904}