{"abs":"This paper presents theoretical and experimental investigations in dynamic modeling and optimal path planning of a non-holonomic mobile robot in cluttered environments. A mobile robot in the presence of multiple obstacles was considered. Nonlinear dynamic model of the system was derived with respect to non-holonomic constraints of robot’s platform. Motion planning of the system was formulated as an optimal control problem, and efficient potential functions were employed for collision avoidance. Applying the Pontryagin’s minimum principle was resulted in a two-point boundary value problem solved numerically. The effectiveness and capability of the proposed method were demonstrated through simulation studies. Finally, for verifying the feasibility of the presented method, results obtained for the Scout mobile robot were compared with the experiments.","title":"Optimal point-to-point motion planning of non-holonomic mobile robots in the presence of multiple obstacles","id":265125216,"url":"https://www.researchgate.net/publication/265125216_Optimal_point-to-point_motion_planning_of_non-holonomic_mobile_robots_in_the_presence_of_multiple_obstacles","names":["M. Nazemizadeh","Moharam Habibnejad Korayem","Hamed Rahimi Nohooji","Journal of the Brazilian Society of Mechanical Sciences and Engineering"],"references":{"225157227":"Nonlinear dynamic analysis for elastic robotic arms","4012861":"Experimental evaluation of robot path planning by artificial potential field approach with simulated annealing","279922733":"Path Planning for a Mobile Robot to Avoid Polyhedral and Curved Obstacles","223248712":"Optimal dynamics of actuated kinematic chains. Part 2: Problem statements and computational aspects","261425298":"Obstacle avoidance in mobile robot using Neural Network","224645732":"Evolutionary Stigmergy in Multipurpose Navigation Systems","245372071":"Dynamic Load Carrying Capacity of Mechanical Manipulators—Part II: Computational Procedure and Applications","3450301":"Deployment of mobile robots with energy and timing constraints","241147605":"Robot Path Planning Based on Artificial Potential Field Approach with Simulated Annealing","4355150":"A new algebraic method for robot motion planning and real geometry","224677110":"Smooth Path Planning of a Mobile Robot Using Stochastic Particle Swarm Optimization","222582098":"Dynamic modelling, simulation and control of a manipulator with flexible links and joints","220432313":"Shortest Paths in the Plane with Polygonal Obstacles.","245040768":"A retraction method for planning the motion of a disc","221073462":"A Systematic Representation of Edges in Topological Maps for Mobile Robots using Wavelet Transformation.","224669688":"Coordinating locomotion and manipulation of a mobile manipulator. In","229867822":"Optimal Control of Rigid‐Link Manipulators by Indirect Methods","223618633":"Analysis of wheeled mobile flexible manipulator dynamic motions with maximum load carrying capacities","245406014":"2D Laser-based Probabilistic Motion Tracking in Urban-like Environments","230872668":"A Multiple Shooting Algorithm for Direct Solution of Optimal Control Problems","267411409":"Path planning for a mobile robot in dynamic environments","2308481":"Approximating Polyhedra with Spheres for Time-Critical Collision Detection","222528352":"An Ant Colony Optimization Approach to the Vehicle Routing Problem","226950690":"Symbolic–Numeric Indirect Method for Solving Optimal Control Problems for Large Multibody Systems","268474793":"Genetic Algorithm and Indirect Method Coupling for Low-Thrust Trajectory Optimization","220493066":"A BVP solver based on residual control and the Maltab PSE","220406419":"A \"Retraction\" Method for Planning the Motion of a Disc.","262544145":"A rough terrain traction control technique for all-wheel-drive mobile robots","3298056":"Autonomous Navigation in a Manufacturing Environment","230872953":"Direct trajectory optimization using nonlinear programming and collocation, AIAA","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","224318618":"Optimal trajectory generation for nonholonomic robots in dynamic environments","265347732":"Conversion of Optimal Control Problems into Parameter Optimization Problems","262757228":"On-line planning of nonholonomic mobile manipulators based on stability twist constraint","4041594":"Trajectory Planning of Mobile Manipulator with Stability Considerations","263487475":"Robust adaptive neural network control for environmental boundary tracking by mobile robots","220690155":"Digraphs. Theory, Algorithms and Applications","267718307":"Fuzzy-genetic optimal control for robotic systems","224713145":"A Tabu Search-based Approach for Online Motion Planning","239744682":"A BVP solver based on residual control and the Matlab PSE","220122234":"Reactive Nonholonomic Trajectory Generation via Parametric Optimal Control","284741022":"Minimum Decompositions of Polygonal Objects","3930320":"Trajectory planning of mobile manipulator with end-effector\u0027s specified path","220981830":"Optimum Path Planning for Mobile Robots Based on a Hybrid Genetic Algorithm.","3021888":"“Coordinating Locomotion and Manipulation of a Mobile Manipulator,”","220492747":"Using AD to solve BVPs in Matlab","245981656":"Dynamic Load Carrying Capacity of Mechanical Manipulators—Part I: Problem Formulation","239552565":"The Complexity of Robot Motion Planning","267488643":"Optimal Motion Planning of Manipulators With Elastic Links and Joints in Generalized Point-to-Point Task","221911113":"Path Planning of Mobile Elastic Robotic Arms by Indirect Approach of Optimal Control","224730131":"A Local Based Approach for Path Planning of Manipulators with a High Number of Degrees of Freedom","44352605":"Optimal control theory : an introduction / Donald E. Kirk","221503688":"Robot Path Planning using Particle Swarm Optimization of Ferguson Splines","222686265":"Ant Colony System Algorithm for Real-Time Globally Optimal Path Planning of Mobile Robots"},"citedIn":{"283439057":"Option-based motion planning and ANFIS-based tracking control for wheeled robot in cluttered environment"},"index":905}