{"abs":"This paper discusses the design of a parallel genetic algorithm to generate solutions to multi-objective problems. The algorithm uses multiple optimization criteria, independent cross-pollinating populations, and handles multiple hard constraints. Individuals in the population consist of multiple chromosomes. The complexity of the algorithm is the number of generations processed times O(N2) where N is the total number of individuals used for path generation on any of the optimizations. The results of initial empirical studies on the effects of pollination and recommendations for possible future work are presented.","title":"Cross-pollinating parallel genetic algorithms for multiobjective search and optimization","id":220180305,"url":"https://www.researchgate.net/publication/220180305_Cross-pollinating_parallel_genetic_algorithms_for_multiobjective_search_and_optimization","names":["Lucas A. Wilson","Michelle D. Moore","International Journal of Foundations of Computer Science"],"references":{"279964590":"Using a new GA-based multiobjective optimization technique for the design of robot arms","2790697":"Genetic Algorithms with Gender for Multi-function Optimisation","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","2718690":"Using Genetic Algorithms to Solve NP-Complete Problems","2595880":"Automated Synthesis and Optimization of Robot Configurations: An Evolutionary Approach","220045356":"Using a new GA-based Multiobjective Optimization Technique for the Design of Robot Arms","3865097":"Evolutionary Artificial Potential Fields and their application in real time robot path planning","2473558":"Trading-Off Mind Complexity And Locomotion In A Physically Simulated Quadruped","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","223595719":"An accurate parallel genetic algorithm to schedule tasks on a cluster","224742643":"An accurate and efficient parallel genetic algorithm to schedule tasks on a cluster","220885629":"Biases in the Crossover Landscape.","220045412":"Adoption in Natural and Artificial System","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","246307253":"Genetic Algorithms and Robotics: A Heuristic Strategy for Optimization","220742197":"Robot Trajectory Planning Using Multi-objective Genetic Algorithm Optimization","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","264923669":"Genetic Algorithms, Noise, and the Sizing of Populations"},"citedIn":{"37464746":"Optimization of Dynamic Data Types in Embedded Systems using DEVS/SOA-based Modeling and Simulation","37467503":"Optimization of Multimedia Embedded Applications using Parallel Genetic Algorithms","227702263":"Evolutionary multiobjective optimization","233880247":"Naturally selecting solutions","225433316":"Parallel and Distributed Optimization of Dynamic Data Structures for Multimedia Embedded Systems","225398531":"A Parallel Evolutionary Algorithm to Optimize Dynamic Data Types in Embedded Systems","260138317":"ParallelRobust","257430311":"An efficient dynamic load balancing algorithm"},"index":906}