{"abs":"Multi-objective formulations are realistic models for many complex engineering optimization problems. In many real-life problems, objectives under consideration conflict with each other, and optimizing a particular solution with respect to a single objective can result in unacceptable results with respect to the other objectives. A reasonable solution to a multi-objective problem is to investigate a set of solutions, each of which satisfies the objectives at an acceptable level without being dominated by any other solution. In this paper, an overview and tutorial is presented describing genetic algorithms (GA) developed specifically for problems with multiple objectives. They differ primarily from traditional GA by using specialized fitness functions and introducing methods to promote solution diversity.","title":"Multi-objective Optimization using Genetic Algorithms: a Tutorial","id":222534332,"url":"https://www.researchgate.net/publication/222534332_Multi-objective_Optimization_using_Genetic_Algorithms_a_Tutorial","names":["Abdullah Konak","David W. Coit","Alice E. Smith","Reliability Engineering [?] System Safety"],"references":{"216545901":"Genetic Algorithms in Search, Optimization, and Machine Learning. Menlo Park, CA: Addison-Wesley","3418674":"Evolutionary algorithms with dynamic population size and local exploration for multiobjective optimization","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","223638867":"RAMS+C informed decision-making with application to multi-objective optimization of technical specifications and maintenance using genetic algorithms. Reliab Eng Syst Saf","3949492":"Comparison of data structures for storing Pareto-sets in MOEAs","3949494":"Topological design of communication networks using multiobjective genetic optimization","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","237427113":"List of References on Constraint-Handling Techniques used with Evolutionary Algorithms","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2365630":"A Hybrid Multi-Objective Evolutionary Approach to Engineering Shape Design","12473892":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","239062948":"PESA-II: Region-based selection in evolutionary multiobjective optimization","3810214":"“An updated survey of evolutionary multiobjective optimization techniques: State of the art and future trends,” in: Congress on evolutionary computation","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107","220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","2274048":"A Survey of Constraint Handling Techniques used with Evolutionary Algorithms","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","3949336":"An evolutionary algorithm for constrained multi-objective optimization","234802779":"Coello, C.A.C.: An updated survey of GA-based multi-objective optimization techniques. ACM Computing Surveys 32(2), 109-143","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","221228550":"A Two-Phase Local Search for the Biobjective Traveling Salesman Problem","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","3425822":"Multiobjective Placement of Electronic Components Using Evolutionary Algorithms","3623579":"MOGA: Multi-objective genetic algorithms","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","2241938":"M-PAES: A Memetic Algorithm for Multiobjective Optimization","2279954":"Evolutionary Techniques for Constrained Multiobjective Optimization Problems","3418757":"Rank-density-based multiobjective genetic algorithm and benchmark test function study","222697333":"Constraint-handling in genetic algorithms through the use of dominance-based tournament selection","222865788":"Multi-objective meta-heuristics: An overview of the current state-of-the-art","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","222044938":"Multi-objective genetic algorithm and its application to flowshop scheduling. Comput Ind Eng","220049322":"Genetic algorithms for multiobjective optimization: formulation, disscussion and generalization","3418766":"Reducing the Run-Time Complexity of Multiobjective EAs: The NSGA-II and Other Algorithms","260709937":"Overview of multi-objective optimization methods","222827635":"A new multiobjective evolutionary algorithm","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","223038859":"Application of genetic algorithm for reliability allocation in nuclear power plant","3418741":"Considerations in engineering parallel multiobjective evolutionary algorithms. IEEE Trans Evol Comput","222860939":"Availability allocation to repairable systems with genetic algorithms: A multi-objective formulation","3418750":"Dynamic multiobjective evolutionary algorithm: Adaptive cell-based rank and density estimation","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","3418745":"Balance between genetic search and local search in memetic algorithms for multiobjective permutation flowshop scheduling. IEEE Trans Evol Comput","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","220885605":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms.","220471028":"Reducing the size of the nondominated set: Pruning by clustering.","221228411":"A Micro-Genetic Algorithm for Multiobjective Optimization","221392742":"PSFGA: A Parallel Genetic Algorithm for Multiobjective Optimization.","216300989":"A variant of evolution strategies for vector optimization","221032054":"Multi-Objective Genetic Local Search Algorithm.","263446766":"A Method of Fuzzy Multi-objective Nonlinear Programming with GUB Structure by Hybrid Genetic Algorithm","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","3642856":"Genetic algorithms with dynamic niche sharing for multimodal function optimization","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","227702263":"Evolutionary multiobjective optimization","221025610":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","4037845":"Parallel strength Pareto multiobjective evolutionary algorithm","2782915":"A Variant of Evolution Strategies for Vector Optimization","224723086":"Rank-density based multiobjective genetic algorithm","256561569":"“Reducing the Size of Nondominated Set: Pruning by Clustering,”","243665386":"Genetic Algorithms in Searching","246900826":"Multiobjective optimization of survivable networks considering reliability","220381133":"Considerations in engineering parallel multiobjective evolutionary algorithms.","223621435":"Alternatives and challenges in optimizing industrial safety using genetic algorithms. Rel Eng Syst Saf 86(1):25?38","3152706":"Optimal Reliability/Availability of Uncertain Systems via Multi-Objective Genetic Algorithms","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","242356870":"Adaptation In Natural And Artificial Systems","220381014":"Using unconstrained elite archives for multiobjective optimization","216300947":"Capacitated Network Design Considering Survivability: An Evolutionary Approach","220045412":"Adoption in Natural and Artificial System","226762616":"Lecture Notes in Computer Science","242372494":"Genetic algorithm in search","2877781":"PESA-II: Region-based Selection in Evolutionary Multiobjective","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"220204321":"Mixed-Model U-Shaped Assembly Line Balancing Problems with Coincidence Memetic Algorithm","228900256":"Development of a neural network model for selective catalytic reduction (SCR) catalytic converter and ammonia dosing optimization using multi objective genetic …","270395417":"Designing a solar powered Stirling heat engine based on multiple criteria: Maximized thermal efficiency and power","254230304":"Project scheduling: A multi-objective evolutionary algorithm that optimizes the effectiveness of human resources and the project makespan","261986197":"Entropy based region reducing genetic algorithm for reliability redundancy allocation in interval environment","257879886":"Multi-GPU based on multicriteria optimization for motion estimation system","251938583":"A high diversity hybrid ensemble of classifiers","228953521":"Efficiently solving multiple objective optimal control problems","261304199":"A Genetic Algorithm for the construction of optimized covariance descriptors","266393590":"Advanced Monte Carlo Simulation Methods and Neural Network Regression for the Reliability Analysis of Nuclear Passive Systems","275658872":"A model-based embedded control hardware/software co-design approach for optimized sensor selection of industrial systems","270985273":"Economic emission dispatching with variations of wind power and loads using multi-objective optimization by learning automata","273490029":"A genetic algorithm designed for robot trajectory Planning","263813019":"Multi-objective new product development by complete Pareto front and ripple-spreading algorithm","271915024":"Optimization Process for Concept Design of Tactical Missiles by Using Pareto Front and TOPSIS","267397080":"Evolutionary Minimization of Network Coding Resources","221009157":"On the Effectiveness of Evolution Compared to Time-Consuming Full Search of Optimal 6-State Automata","257773425":"Genetic algorithm application for matching ordinary black oil PVT data","270395441":"Thermodynamic and thermo-economic analysis and optimization of performance of irreversible four-temperature-level absorption refrigeration","258559815":"A Study on Various Meteoroid Disintegration Mechanisms as Observed from the Resolute Bay Incoherent Scatter Radar (RISR)","252016438":"Iris feature extraction using optimized Gabor wavelet based on multi objective genetic algorithm","280301702":"Synthetic Generators for Cloning Social Network Data","42588860":"Combining image, voice, and the patient\u0027s questionnaire data to categorize laryngeal disorders","251705150":"T403 INFLUENCE OF EMOTIONALLY-LOADED VISUAL AND GUSTATORY STIMULI ON EXPERIMENTAL JAW-MUSCLE PAIN","225336621":"A new method to approximate the field of movements of 1-DOF linkages with lower-pairs","281356419":"Multi-objective Clustering Ensemble: A Framework for Cluster Analysis","241169939":"Multi-objective nature-inspired clustering techniques for image segmentation","224105750":"A classical-cum-Evolutionary Multi-objective optimization for optimal machining parameters","268884052":"Solving the dynamic traveling salesman problem using a genetic algorithm with trajectory prediction: An application to fish aggregating devices","233391546":"Power and Task Management in Wireless Body Area Network Based Medical Monitoring Systems","270764150":"Dynamic channel allocation in electromagnetic nanonetworks for high resolution monitoring of plants","270395467":"Various criteria in optimization of a vapor compression refrigeration system","281065622":"A multi criterion analysis for renewable energy integration process of a standalone hybrid energy system with internal combustion generator","256816914":"How to effectively compute the reliability of a thermal–hydraulic nuclear passive system","251993944":"Surveillance Test Interval optimization for nuclear plants using Real Parameter Genetic Algorithms","233020862":"Optimised configuration of sensors for fault tolerant control of an electro-magnetic suspension system","226262303":"Condition based maintenance optimization considering multiple objectives","270395515":"Designing a solar powered Stirling heat engine based on multiple criteria: Maximized thermal efficiency and power","262922188":"Reliability-based robust design optimization: A general methodology using Genetic Algorithm","263266265":"Optimisation of maintenance strategy for rural road network using genetic algorithm","229909977":"Modified NSGA-II Algorithm for Multiobjective Optimization of Compact High-Efficiency Square Horns","274012197":"Using novelty-biased GA to sample diversity in graphs satisfying constraints","262021096":"Heuristics for Multiobjective Optimization of Two-Sided Assembly Line Systems","261367788":"An improved SPEA2 Multi-objective algorithm with non-dominated elitism and Generational Crossover","224185637":"Model-based Controller Design for a Plastic Film Extrusion Process","259475213":"Multi-Objective Optimisation of hybrid MSF–RO desalination system using Genetic Algorithm","283328671":"ASME-GT70025","52009830":"A hybrid analytical-heuristic method for calibrating land-use change models","241628697":"Multi-Objective control through evolutionary neuro-controller for interactive mobile robot manipulator","273791187":"Exergoeconomic analysis and multi-objective optimization of an ejector refrigeration cycle powered by an internal combustion (HCCI) engine","270923948":"Prediction and optimization of friction welding parameters for super duplex stainless steel (UNS S32760) joints","260994817":"An improved cellular automata model of enzyme kinetics based on genetic algorithm","267368317":"Inventory Optimization in Efficient Supply Chain Management","224198088":"Evolutionary algorithms for multi-objective optimization problems with interval parameters","263806767":"An Accurate Method for the PV Model Identification Based on a Genetic Algorithm and the Interior-Point Method","233137522":"A holistic method for reliability performance assessment and critical components detection in complex networks","283867251":"Full-factorial design space exploration approach for multi-criteria decision making of the design of industrial halls","233799030":"Calculating Complete and Exact Pareto Front for Multiobjective Optimization: A New Deterministic Approach for Discrete Problems","261482251":"Optimal ESS operation strategy in distribution system with wind power","221230512":"GA-Based Solutions Comparison for Storage Strategies Optimization for an Automated Warehouse","271921303":"A Newton-based heuristic algorithm for multi-objective flexible job-shop scheduling problem","277622830":"Energy Efficient Clustering and Routing Algorithms for Wireless Sensor Networks: GA Based Approach","280035349":"Multi-objective integrated production distribution planning concerning manufacturing partners","283334726":"Systems poised to criticality through Pareto selective forces","264560482":"Thermo-economic multi-objective optimization for a solar-dish Brayton system using NSGA-II and decision making","256360417":"Multi-objective optimization of a direct methanol fuel cell system using a genetic-based algorithm","280913945":"Towards optimized scheduling for data-intensive scientific workflow in multiple datacenter environment","257896438":"Modeling and multiobjective optimization of traction performance for autonomous wheeled mobile robot in rough terrain","49775196":"Long term cardiovascular risk models\u0027 combination","266749770":"Analysis of information security reliability: A tutorial","277612576":"Multi-Objective Optimization Design for a Hybrid Energy System Using the Genetic Algorithm","281096300":"This document contains the post-print pdf-version of the refereed paper: “Interactive NBI and (E)NNC methods for the progressive exploration of the criteria space in multi-objective optimization and optimal control” by Mattia Vallerio, ! Dominique Vercammen, Jan Van Impe and Filip Logist which has been archived on the university repository Lirias (https://lirias.kuleuven.be/) of KU Leuven.","260233009":"Thermodynamic optimization of Stirling heat pump based on multiple criteria","265213821":"High-Level Diversity of Tailed Phages, Eukaryote-Associated Viruses, and Virophage-Like Elements in the Metaviromes of Antarctic Soils","263737099":"A strategic planning model for the railway system accident rescue problem","260014022":"A modified artificial bee colony based on chaos theory for solving non-convex emission/economic dispatch","266344282":"Improving Search In Genetic Algorithms Through Instinct-Based Mating Strategies","3907717":"Negative- and positive-temperature dependences of electron emissionproperties of hydrogen- and oxygen-terminated diamond fieldemitters","262903659":"A multiobjective optimization of a UWB antenna using a self organizing genetic algorithm","267669302":"Success in evolutionary computation","256937876":"Automatic path generation for terrain navigation","226063804":"Applying Genetic Algorithms to Optimize the Cost of Multiple Sourcing Supply Chain Systems – An Industry Case Study","257580959":"Optimizing bi-objective imperfect preventive maintenance model for series-parallel system using established hybrid genetic algorithm","267816753":"Optimal Robot Path Planning for Multiple Goals Visiting Based on Tailored Genetic Algorithm","272402676":"Optimization approach of balancing life cycle cost and environmental impacts on residential building design","251620913":"Optimization of the inspection intervals of a safety system in a nuclear power plant by Multi-Objective Differential Evolution (MODE)","260007853":"Exergetic, economic and environmental (3E) analyses, and multi-objective optimization of a CO2/NH3 cascade refrigeration system","263968617":"Solving a new multi-objective multi-route flexible flow line problem by multi-objective particle swarm optimization and NSGA-II","261504837":"Multi-objective optimization design of multi-piece leaf springs based on Pareto","224198027":"MOPSO Applied to Architecture Tuning with Unified Second-Level Cache for Energy and Performance Optimization","257560450":"Assessing ICT risk through a Monte Carlo method","261195595":"Optimization and decision-making in electrical distribution networks","220384760":"Multi-objective two-sided mixed-model assembly line balancing using particle swarm optimisation with negative knowledge","282845185":"Optimal sensor placement under uncertainties using a nondirective movement glowworm swarm optimization algorithm","221148623":"Routing Path Determination Using QoS Metrics and Priority Based Evolutionary Optimization","264349475":"Developing a practical optimization of the refueling program for ordinary research reactors using a modified simulated annealing method","260112231":"Multi-objective optimization of Stirling engine using non-ideal adiabatic method","283570191":"Towards Multi-Objective Optimization for Sustainable Buildings with Both Quantifiable and Non-Quantifiable Design Objectives","251989998":"Spatial Multiple Criteria Fuzzy Clustering for Image Segmentation","268300050":"A multi-objective optimization approach to groundwater management using genetic algorithm","273481916":"Preventive maintenance and replacement optimization on CNC machine using multiobjective evolutionary algorithms","261390182":"Fault detection and diagnosis of a plastic film extrusion process","282490916":"A leader–follower partially observed, multiobjective Markov game","266176302":"A Robust Approach for Optimization – NS-NR I Part II: Algorithm and Applications","252047345":"Multicarrier Cognitive Radio system configuration based on interference analysis by two dimensional Genetic Algorithm","235431665":"Taguchi\u0027s method for multi-objective optimization problems","263989063":"Automatic discovery of agent based models: An application to social anthropology","251424257":"A combined NLP-differential evolution algorithm approach for the optimization of looped water distribution systems","257564580":"Multi-objective optimization of QCA circuits with multiple outputs using genetic programming","273396042":"An evolutionary based topological optimization strategy for consensus based clock synchronization protocols in wireless sensor network","269273352":"Evaluation of reactive power compensation on voltage stability and NTC values in the Swedish transmission network","281182663":"Optimization performance and thermodynamic analysis of an irreversible nano scale Brayton cycle operating with Maxwell–Boltzmann gas","262215336":"Minimizing Test Suites in Software Product Lines Using Weight-based Genetic Algorithms","257392220":"A New Multi-Objective Particle Swarm Optimization Method for Solving Reliability Redundancy Allocation Problems","275065194":"Integrated Multiobjective Optimal Design for Active Control System Based on Genetic Algorithm","282536391":"Pareto-Ranking Based Quantum-Behaved Particle Swarm Optimization for Multiobjective Optimization","269412638":"Pin-Align: A New Dynamic Programming Approach to Align Protein-Protein Interaction Networks","261377669":"Multi-Objective Portfolio Optimization for Spectrum Selection in Cognitive Radio Systems","269295903":"A multi-objective genetic algorithm based bus vehicle scheduling approach","261193348":"Optimizing software integration in component-based embedded systems by using simulated annealing","274006336":"A Hybrid Genetic Algorithm and Particle Swarm Optimization with Type-2 Fuzzy Sets for Generating Systems of Systems Architectures","278161794":"Automating design with intelligent human–machine integration","278792584":"Pareto Optimization Identifies Diverse Set of Phosphorylation Signatures Predicting Response to Treatment with Dasatinib","281534943":"Adequacy Assessment of a Wind-Integrated System Using Neural Network-based Interval Predictions of Wind Power Generation and Load","239765328":"Latency-aware mapping for 3D NoC using rank-based multi-objective genetic algorithm","261406351":"A multi-attribute decision model for intrusion response system","237045505":"Job Sequence Optimisation Using Combinatorial Evolutionary Approach in High Variety/Low Volume Manufacturing Environment","253650495":"Advanced Model-Based Greenhouse Climate Control Using Multi- Objective Optimization","221277201":"Designing a Multi-label Kernel Machine with Two-Objective Optimization","220955663":"A Survey on Interpretability-Accuracy (I-A) Trade-Off in Evolutionary Fuzzy Systems","221142021":"Intelligent Composition of Dynamic-Cost Services in Service-Oriented Architectures","44387208":"Automated Implant-Processor Design","236660533":"Design Optimization of a 3-Unit Satellite De-Orbiting Mechanism","220199984":"Parallel genetic algorithm in bus route headway optimization","262360716":"A Self-organizing Genetic Algorithm for UWB Microstrip Antenna Optimization Using a Machine Learning Technique","270393642":"Multi Objective Optimization for Vehicle Routing Problem Using Fitness Aggregated Genetic Algorithm (FAGA)","261070517":"Exergy analysis and parametric optimization of three power and fresh water cogeneration systems using refrigeration chillers","261267113":"The Optimal Deployment of Wi-Fi Wireless Access Points Using the Genetic Algorithm","231390454":"Multiobjective Optimization of Industrial Autothermal Reformer for Syngas Production Using Nonsorting Genetic Algorithm II","278325718":"Thermo-ecological analysis and optimization performance of an irreversible three-heat-source absorption heat pump","281766284":"Thermo-economic modeling and optimization of an irreversible solar-driven heat engine","273504516":"Memetic algorithm with Preferential Local Search using adaptive weights for multi-objective optimization problems","285929539":"Solving water resources allocation problems using heuristic-based methods","264427144":"Fuzzy reliability analysis of repairable industrial systems using soft-computing based hybridized techniques","266677928":"A comprehensive evacuation planning model and genetic solution algorithm","279519719":"Multiobjective optimization for efficient energy utilization in batch biodiesel production","228080840":"CCLab - A multi-objective genetic algorithm based combinatorial library design software and an application for histone deacetylase inhibitor design","256841243":"Cooperation and Competition Strategies in Multi-objective Shape Optimization-Application to Low-boom/Low-drag Supersonic Business Jet","271141245":"Optimization density power and thermal efficiency of an endoreversible Braysson cycle by using non-dominated sorting genetic algorithm","282960267":"Multi-objective optimization of an irreversible regenerative Brayton cycle using genetic algorithm","263495404":"Free vibration analysis of an adhesively bonded functionally graded double containment cantilever joint","283185593":"A multi-objective, multidisciplinary design optimization methodology for the conceptual design of a spacecraft bi-propellant propulsion system","277334493":"Phase transitions in Pareto optimal complex networks","283740595":"Multi-objective optimization of maintenance programs in nuclear power plants using Genetic Algorithm and Sensitivity Index decision making","257977915":"A Novel Multiobjective Taguchi\u0027s Optimization Technique for Multibeam Array Synthesis","232612994":"Overview of NSGA-II for Optimizing Machining Process Parameters","257639995":"Integrated washland optimization model for flood mitigation using multi-objective genetic algorithm. J Hydro Environ Res","224517125":"An Evaluation of the NSGA-II and MOCell Genetic Algorithms for Self-Management Planning in a Pervasive Service Middleware","261076711":"Bandwidth adaptation in hierarchical scheduling using fuzzy controllers","254230097":"Adaptive multi-objective archive-based hybrid scatter search for segmentation in lung computed tomography imaging","261127910":"Finding Preferred Skyline Solutions for SLA-Constrained Service Composition","260062967":"Artificial Evolution by Viability Rather Than Competition","3684679":"Breadth-first manipulation of very large binary-decision diagrams","251967099":"Security Vs cost: An issue of multi-objective optimization for choosing PGP algorithms","261078543":"Energy-Efficient Base Stations Locations Optimisation in an Airport Environment","277950738":"Heap and parameter-based load balanced clustering algorithms for wireless sensor networks","280135985":"Survey of Multi Objective Evolutionary Algorithms","224597231":"Fixed-State Tests for Delay Faults in Scan Designs","280705334":"A Clustering Based Archive Multi Objective Gravitational Search Algorithm","238186428":"Events group risk importance by genetic algorithms","281323850":"A Synthesis of Logic and Biology in the Design of Dependable Systems","271561148":"Convex hull ranking algorithm for multi-objective evolutionary algorithms","4067755":"Humanoid robot and its application possibility","261488131":"Multi-objective optimization for a helicopter pilot using genetic algorithms","277936391":"Toward SLA-constrained service composition: An approach based on a fuzzy linguistic preference model and an evolutionary algorithm","259911397":"Optimization of a cooling system based on Peltier effect for photovoltaic cells","288233655":"Torque Ripple Reduction of Switched Reluctance Motor Drive with Adaptive Sliding mode Control and Particle Swarm Optimization","220200064":"Enhanced Genetic Algorithm-Based Fuzzy Multiobjective Strategy to Multiproduct Batch Plant Design","244387632":"Arrangement of primary and secondary reformers for synthesis gas production","261398064":"Effects of genetic algorithm parameters on multiobjective optimization algorithm applied to system identification problem","224208120":"An optimum sensor selection design framework applied to an electro-magnetic suspension system","221009033":"Genetic algorithm based on primal and dual theory for solving multiobjective bilevel linear programming","41030613":"Accounting for the effects of rehabilitation actions on the reliability of flexible pavements: performance modeling and optimization","271952280":"Research on the Efficiency Improvement of Design for Testability Using Test Point Allocation","220384397":"Multi-objective genetic local search algorithm using Kohonen\u0027s neural map","286453920":"Damage Assessment of Structures with Uncertainty","224097519":"Instinct-Based Mating in Genetic Algorithms Applied to the Tuning of 1-NN Classifiers","267333211":"Assurance of system service level robustness in complex supply chain networks","271534489":"Wireless Sensor Deployment Method on 3D Environments to Maximize Quality of Coverage and Quality of Network Connectivity","258635485":"Notice of Violation of IEEE Publication Principles Multiobjective Reinforcement Learning: A Comprehensive Overview","211191086":"High Order Computational Intelligence in Data Mining - A generic approach to systemic intelligent Data Mining","50590398":"Multiobjective Optimization Approaches in Image Segmentation – The Directions and Challenges","260939312":"Analysis and optimization of hybrid electric vehicle thermal management systems","262692373":"An hybrid evolutionary multiobjective algorithm for multiuser margin maximization in DSL","277018940":"Optimal Design of Hybrid Renewable Energy Systems in Buildings with Low to High Renewable Energy Ratio","273961451":"An integrated multi-objective optimization model for solving the construction time-cost trade-off problem","257574556":"GA-based cloud resource estimation for agent-based execution of bag-of-tasks applications","257580701":"A comparative analysis of meta-heuristic approaches for facility layout design problem: A case study for an elevator manufacturer","228447322":"Efficient Optimization of Reliable Two-Node Connected Networks: A Biobjective Approach","224576683":"A new genetic algorithm approach for intrusion response system in computer networks","280318334":"Multi-objective optimization of thermo-electric heat pump using genetic algorithm and fuzzy Bellman-Zadeh decision making","220200148":"A multi-objective approach for the motion planning of redundant manipulators","281149711":"Multi-Objective joint maintenance and inventory optimization model with considering obsolescence and incremental discounts for spare parts","269291999":"Resolving multi objective stock portfolio optimization problem using genetic algorithm","220200140":"Multi-objective nature-inspired clustering and classification techniques for image segmentation","222958749":"Solving multi-objective routing and wavelength assignment in WDM network using hybrid evolutionary computation approach","262323829":"A hybrid algorithm based on particle swarm and chemical reaction optimization","257066635":"Design of Ultra-Wideband LNA for WiMAX Network Applications","277283166":"A simulation based GA for multi-objective optimization in patient flow distribution","257588927":"Multi-objective optimization by learning automata","271460802":"On Pareto-Koopmans Efficiency for Performance-Driven Optimisation in Self-Organising Networks","220349645":"PDE-PEDA: A new Pareto-based multi-objective optimization algorithm","248254264":"Calculation OOIP in oil reservoir by pressure matching method using genetic algorithm","259354240":"A Location Selection Policy of Live Virtual Machine Migration for Power Saving and Load Balancing","221754562":"Design of a Fuzzy-based Decision Support System for Coronary Heart Disease Diagnosis","284735757":"Seismic Reliability-Based Design of Water Distribution Networks Using Multi-objective Harmony Search Algorithm","257537711":"Applicability of entransy dissipation based thermal resistance for design optimization of two-phase heat exchangers","274270626":"Optimization of Gas Transmission Networks under Energetic and Environmental Considerations","236888032":"Two fully-unsupervised methods for MR brain image segmentation using SOM-based strategies","236888033":"Improving MRI segmentation with probabilistic GHSOM and multiobjective optimization","268013062":"Multiple objective optimization of an airfoil shape","265922008":"A multi-objective extremum-seeking controller design technique","258399588":"Mixed Static and Dynamic Optimization of Four-Parameter Functionally Graded Completely Doubly Curved and Degenerate Shells and Panels Using GDQ Method","282479314":"A Genetic-Algorithm-Based Approach for Task Migration in Pervasive Clouds","266888672":"Manual Engineering and Evolution of Emergent Algorithms for Agents on Two-dimensional Grids","277414529":"Robust Nonlinear Generalised Minimum Variance Control and Fault Monitoring","274920040":"A New Multiobjective Evolutionary Algorithm Based on Decomposition of the Objective Space for Multiobjective Optimization","261166490":"Robust Nonlinear Generalised Minimum Variance control","222398284":"Strategic defense and attack for reliability systems","264596956":"An Interference Avoidance Method Using Two Dimensional Genetic Algorithm for Multicarrier Communication Systems","267779567":"Using GPUs to Learn Effective Parameter Settings for GPU-Accelerated Iterative CT Reconstruction Algorithms","224145219":"Differential evolution for multi-objective optimization with self adaptation","275589700":"Thermo-economic and thermodynamic analysis and optimization of a two-stage irreversible heat pump","273519201":"A multiobjective approach to the genetic code adaptability problem","278727341":"A model-based embedded control hardware/software co-design approach for optimized sensor selection of industrial systems","221175578":"An Adaptive Multi-objective Image Watermarking Scheme for QIM Using NSGA-II.","221570816":"Applying Multi-objective Evolutionary Algorithms to QoS-Aware Web Service Composition","260343216":"The value of satellite-derived snow cover images for calibrating a hydrological model in snow-dominated catchments in Central Asia","228966288":"Enhancing Ensemble Performance through Feature Selection and Hybridization","257592687":"Quantitative selection model of ecological indicators and its solving method","283296469":"A multi-constrained maintenance scheduling optimization model for a hydrocarbon processing facility","220579614":"Optimising mobile base station placement using an enhanced Multi-Objective Genetic Algorithm","236248111":"Dew Point modelling using GEP based multi objective optimization","229369750":"Multiobjective genetic algorithm strategies for electricity production from generation IV nuclear technology","284351183":"A memetic algorithm approach for batch-model assembly line balancing problem of sub-block in shipbuilding","257052012":"Thermo-economic multi-objective optimization of solar dish-Stirling engine by implementing evolutionary algorithm","261389739":"Joint spectrum selection and radio resource management based on multi-objective portfolio optimization for cognitive radio networks","267492785":"Optimization of Wind Turbine Blade Airfoils Using a Multi-Objective Genetic Algorithm","259931453":"Optimised sensor selection for control and fault tolerance: Comparison and some new results","228960227":"Evolvable hardware applied to multi-objective optimization of controllers structure for robot manipulators","236108894":"Application of Pareto optimality to linear models with errors-in-all-variables","48353452":"Optimised configuration of sensing elements for control and fault tolerance applied to an electro-magnetic suspension system","229355519":"Engineering failure analysis and design optimisation with HiP-HOPS","232818614":"Multi-objective optimisation and sensitivity analysis of a paratransit bus structure for rollover and side impact tests","260586974":"Model-based fault monitoring of a plastic film extrusion process","230920084":"Application of the genetic algorithm to the optimized design of semimagnetic semiconductor-based spin-filters","252063057":"Transmission Augmentation With Mathematical Modeling of Market Power and Strategic Generation Expansion—Part II","259622178":"Optimised sensor selection for control: A Hardware-in-the-loop realization on FPGA for an EMS system","263007729":"Multi-objective optimization of a Stirling engine with irreversibility consideration using Finite speed thermodynamics.","261371336":"Thermal–economic–environmental analysis and multi-objective optimization of an ice thermal energy storage system for gas turbine cycle inlet air cooling","257744129":"Energy Efficient Random Transmission Control for Cognitive Radio Systems","250918057":"New Optimization Approach Using Clustering-Based Parallel Genetic Algorithm","282505867":"published paper","256195867":"Genetic Algorithms for Multi-objective Optimization: Application to a Multi-reservoir System in the Chi River Basin, Thailand","49608848":"Multi-objective automatic calibration of hydrodynamic models utilizing inundation maps and gauge data","225253131":"Global optimization of core station networks for space geodesy: Application to the referencing of the SLR EOP with respect to ITRF","282505919":"1748006X15573166.full (2)","233766786":"Individual dispersal, landscape connectivity and ecological networks","220215117":"Questionnaire- versus voice-based screening for laryngeal disorders","259525909":"Diversity and Convergence Issues in Evolutionary Multiobjective Optimization: Application to Agriculture Science","257420602":"Microcontroller Implementation of a Multi Objective Genetic Algorithm for Real-Time Intelligent Control","262907332":"Multiobjective genetic algorithm to allocate budgetary resources for condition assessment of water and sewer networks","271399490":"A novel, streamline-based injection efficiency enhancement method using multi-objective genetic algorithm","273064502":"An Interval-Valued Neural Network Approach for Uncertainty Quantification in Short-Term Wind Speed Prediction","257066272":"Hybridizing a multi-objective simulated annealing algorithm with a multi-objective evolutionary algorithm to solve a multi-objective project scheduling problem","281076407":"Optimal Capacity Allocation for a Failure Resilient Electrical Infrastructure","257600802":"A constraint satisfaction approach to resolving product configuration conflicts","264971697":"Optimization of thermodynamic performance of Stirling Engine","260652535":"Multiobjective Optimization in Multifunction Multicapability System Development Planning","261160430":"Face identification using soft computing tool","264529219":"A multi-cell multi-objective self-optimisation methodology based on genetic algorithms for wireless cellular networks","256257486":"A Multi-Objective Optimization Approach Using Genetic Algorithms for Quick Response to Effects of Variability in Flow Manufacturing","278319640":"Computational Intelligence Techniques for Multicriteria Decision Aiding: An Overview","266650999":"Improved Particle Swarm Optimization for Designing Tobacco Logistics Scheme","264971612":"Optimum dimension of geometric parameters of solar chimney power plants - A multi-objective optimization approach","258391550":"Multiobjective Optimization of a Benfield HiPure Gas Sweetening Unit","224393159":"Genetic-Algorithm-Based Parameter Estimation Technique for Fragmenting Radar Meteor Head Echoes","279958067":"Some Single- and Multiobjective Optimization Techniques","270817978":"A review on simulation-based optimization methods applied to building performance analysis","275559112":"Liquid propellant engine conceptual design by using a fuzzy-multi-objective genetic algorithm (MOGA) optimization method","257336819":"An integrated evolutionary approach for modelling and optimization of laser beam cutting process","262178053":"A dynamic MOPSO algorithm for multiobjective optimal design of hybrid renewable energy systems","274782930":"Multi-objective biogeography-based optimization for supply chain network design under uncertainty","271581827":"Coordination of Economic Load Dispatch and Load Frequency Control for Interconnected Power System","257392099":"Effective computing algorithm for maintenance optimization of highly reliable systems","263806209":"SURVEILLANCE TEST INTERVAL OPTIMIZATION FOR NUCLEAR PLANTS USING MULTI OBJECTIVE REAL PARAMETER GENETIC ALGORITHMS","272616070":"A Simple GA Based Approach for Multi-Objective Optimization of Machining Parameters","262579556":"A Framework for Economic Load Frequency Control Design Using Modified Multi-objective Genetic Algorithm","273891985":"Layout optimization of wireless sensor networks for structural health monitoring","273322633":"Comparing Two Meta-Heuristic Approaches for Solving Complex System Reliability Optimization","232410911":"Energy and Cost Optimization of a Plate and Fin Heat Exchanger Using Genetic Algorithm","288918512":"Thermodynamic analysis and optimization for an irreversible heat pump working on reversed Brayton cycle","223041410":"Modeling and optimization of parameters of flow rate of paddy rice grains through the horizontal rotating cylindrical drum of drum seeder","257666449":"Enhancing genetic algorithms for dependent job scheduling in grid computing environments","273453696":"Optimal multi-objective distribution system reconfiguration with multi criteria decision making-based solution ranking and enhanced genetic operators","277674560":"Optimization of Friction Welding Parameters of AISI 904L Super Austenitic Stainless Steel by Evolutionary Computational Techniques","263316835":"Multi-objective controller for enhancing nutrient removal and biogas production in wastewater treatment plants","260230481":"Tammam, M. A.; Aboelela; M. A., Moustafa; M. A., \u0026 Seif, A. E. A.;\" A Multi-Objective Genetic Algorithm Based PID Controller for Load Frequency Control of Power Systems\"; International Journal of Emerging Technology and Advanced Engineering (ISSN 2250-2459) Vol. 3, Issue 12, December 2013.","264721684":"Optimizing the Number and Location of Time Point Stops.","237075700":"Solving Multi-objective Multicast Routing Problems by Evolutionary Multi-objective Simulated Annealing Algorithms with Variable Neighborhoods","259993001":"Multi-objective highway alignment optimization incorporating preference information","269294293":"Challenges of Dynamic Multi-objective Optimisation","282665475":"Influence of demographics and service provision, accessibility and adequacy in hot and cold spots of depression in Catalonia","256744850":"Efficient genetic based topological mapping using analytical models for on-chip networks","261598582":"Controller tuning using evolutionary multi-objective optimisation: Current trends and applications","258508170":"Memory-efficient Genetic Algorithm for Path Optimization in Embedded Systems","3568340":"Evolution and status of smart power technology","265731380":"Design of SCADA water resource management control center by a bi-objective redundancy allocation problem and particle swarm optimization","251565085":"Multiobjective cuckoo search for design optimization. Computers and Operations Research","224601989":"Optimal operation of a microturbine cluster with partial-load efficiency and emission characterization","279212617":"Multi-objective optimization of material model parameters of an adhesive layer by using SPEA2","221548484":"A Robust Image Watermarking Method in Wavelet Domain Using Genetic Algorithm","261113184":"Multi-objective optimization of an Interior PM motor for a high-performance drive","257392038":"Solving binary-state multi-objective reliability redundancy allocation series-parallel problem using efficient epsilon-constraint, multi-start partial bound enumeration algorithm, and DEA","266988826":"Nuclear Power Plant Maintenance Optimization with Heuristic Algorithm","224186283":"Modeling and Control of a Plastic Film Manufacturing Web Process","257392045":"Multi-objective optimization of a series–parallel system using GPSIA","48353306":"Optimised sensor configurations for a MAGLEV suspension system","225939340":"Dynamic Objectives Aggregation Methods in Multi-objective Evolutionary Optimization","257392041":"Multi-objective optimization of design and testing of safety instrumented systems with MooN voting architectures using a genetic algorithm","277562251":"Genetic Algorithms in the Framework of Dempster-Shafer Theory of Evidence for Maintenance Optimization Problems","225662583":"Development of a multiobjective GA for advanced planning and scheduling problem","259867765":"Multi-objective optimisation of vehicle bodies made of FRP sandwich structures","277832582":"Multi-objective microzone-based vehicle routing for courier companies: From tactical to operational planning","228847273":"Simulation-based Optimum Sensor Selection Design for an Uncertain EMS System via Monte-Carlo Technique.⋆","275069806":"Achieving Fair Spectrum Allocation and Reduced Spectrum Handoff in Wireless Sensor Networks: Modeling via Biobjective Optimization","267957493":"Resource Planning of Industrial Product-Service Systems (IPS²) by a Heuristic Resource Planning Approach","220063247":"Application of a niched Pareto genetic algorithm for selecting features for nuclear transients classification. Int J Intell Syst","267920620":"Um framework para análise de agrupamento baseado na combinação multi-objetivo de algoritmos de agrupamento","261440651":"Disease Diagnosis with a hybrid method SVR using NSGA-II","266288320":"Self organizing multi-objective optimization problem","272018199":"Evolutionary algorithm-based PID controller tuning for nonlinear quarter-car electrohydraulic vehicle suspensions","220280324":"An approach to optimization of fault tolerant architectures using HiP-HOPS","225871441":"Multi-objective optimization research on preventive maintenance planning and production scheduling","3568410":"Design of the parallel resonant converter as a low harmonic rectifier","235410724":"A NSGA-II Algorithm for the Residue-Residue Contact Prediction","220849670":"Simulation Optimization of Process Parameters in Composite Drilling Process Using Multi-objective Evolutionary Algorithm","273507193":"A Multi-objective Evolutionary Algorithm for Feature Selection Based on Mutual Information with a New Redundancy Measure","240428386":"Properties of a genetic algorithm equipped with a dynamic penalty function","283532252":"A Pareto Optimal D* Search Algorithm for Multiobjective Path Planning","224177760":"Optimal v-SVM parameter estimation using multi objective evolutionary algorithms","228757148":"Multi-objective sequencing problems of mixed-model assembly systems using memetic algorithms","267457742":"Regularization in History Matching Using Multi-Objective Genetic Algorithm and Bayesian Framework","276511547":"Best Suitable Cogeneration Power for Factories from Multi-Objective Data Analysis","270463836":"Exergoeconomic optimization of gas turbine power plants operating parameters using genetic algorithms: A case study","242472247":"Preventive Maintenance and Replacement Scheduling: Models and Algorithms","232996519":"A methodology for the strategic design of reverse logistics networks and its application in the Turkish white goods industry","283194276":"Development of comprehensive model and BFO algorithm for dynamic cellular manufacturing system","261371100":"Multi-objective optimization of an irreversible Stirling cryogenic refrigerator cycle","234108607":"Computational fluid dynamics investigation and multi-objective optimization of an engine air-cooling system using genetic algorithm","281283476":"Applying an Evolutionary Algorithm for the Analysis of Mental Disorders in Macro-urban Areas: The Case of Barcelona","284898221":"Optimization of mechanical properties of bamboo plywood","272102240":"Thermodynamic and thermo-economic analysis and optimization of an irreversible regenerative closed Brayton cycle","258569264":"Surrogate-Based Multi-Objective Aerothermodynamic Design Optimization of Hypersonic Spiked Bodies","268332193":"Jacobian Matrix Normalization - A Comparison of Different Approaches in the Context of Multi-Objective Optimization of 6-DOF Haptic Devices","257799229":"Application of sharing genetic algorithm for optimization of groundwater management problems in Wadi El-Farigh, Egypt","282053551":"Imaging-Duration Embedded Dynamic Scheduling of Earth Observation Satellites for Emergent Events","261186800":"A hybrid multi-objective approach to capacitated facility location with flexible store allocation for green logistics modeling","263910617":"PSONK: Particle swarm optimization with negative knowledge formulti-objective u-shaped assembly lines balancing with parallel workstations","221048392":"Using MOGA to Order Batches in a Real World Pipeline Network","255923239":"A Deterministic and Probabilistic Approach for Robust Optimal Design of a 6-DOF Haptic Device","266390663":"Comparing Network-Centric and Power Flow Models for the Optimal Allocation of Link Capacities in a Cascade-Resilient Power Transmission Network","254469187":"The Quality-Aware Service Selection Problem: An Adaptive Evolutionary Approach:Application to the Selection of Distributed Data and Software Services in the ATLAS Experiment","225639961":"Multiobjective Memetic Algorithm and Its Application in Robust Airfoil Shape Optimization","241759491":"Dose optimization in HDR brachytherapy: A literature review of quantitative models","267365506":"OPTIMAL THERMAL GENERATING UNIT COMMITMENT WITH WIND POWER IMPACT: A PSO-IIW PROCEDURE","221306462":"An Optimization Mechanism Intended for Two-Level Cache Hierarchy to Improve Energy and Performance Using the NSGAII Algorithm.","268813173":"A novel multi criteria decision making model for optimizing time–cost–quality trade-off problems in construction projects","279931871":"Multiobjective optimization of strategies for operation and testing of low-demand safety instrumented systems using a genetic algorithm and fault trees","235955554":"A Multi-Objective Optimization Approach Using Genetic Algorithms to Reduce the Level of Variability from Flow Manufacturing","277887970":"Multi-Objective Genetic Algorithm for Berth Allocation Problem Considering Daytime Preference","272081732":"Genetic Algorithm Optimization of Point Charges in Force Field Development: Challenges and Insights","220980830":"Multi-objective optimization using hybrid genetic algorithm and cellular learning automata applying to graph partitioning problem","290306618":"Double-layer parallelization for hydrological model calibration on HPC systems","224196129":"Multi-objective optimization by reinforcement learning for power system dispatch and voltage stability","259525638":"A constraint handling technique for constrained multi-objective genetic algorithm","291603169":"Towards a Genetic Algorithm Based Approach for Task Migrations","228845090":"Comparative Study of Multiobjective Genetic Algorithms","261159956":"An Effective Approach to Identifying Optimal Software Reliability Allocation with Consideration of Multiple Constraints","282831709":"Optimised spatial planning to meet long term urban sustainability objectives","265208905":"Handbook of CO2 in Power Systems","263892023":"Designing a solar powered Stirling heat engine based on multiple criteria: Maximized thermal efficiency and power","264971332":"Evaluation of the maximized power of a regenerative endoreversible Stirling cycle using the thermodynamic analysis","224247506":"State assignment for sequential circuits using multi-objective genetic algorithm","232742479":"On the Optimization of Wireless Multimedia Sensor Networks: A Goal Programming Approach","264475729":"A small UWB CPW-FED monopole antenna with double band-notch property","261057563":"Multi-objective design of a close-coupled inductor for a three-phase interleaved 140kW DC-DC converter","227016209":"Multi-objective optimization of a plate and frame heat exchanger via genetic algorithm","232840823":"A review of the current applications of genetic algorithms in mixed-model assembly line sequencing","282456908":"การจัดสมดุลที่มีหลายวัตถุประสงค์บนสายการประกอบแบบขนานผลิตภัณฑ์ผสมด้วยการหาค่าที่เหมาะสมที่สุดแบบการกระจายตัวของสิ่งมีชีวิตตามภูมิศาสตร","233520757":"Stochastic behavior analysis of the forming unit in a paper mill using NGABLT technique","245222719":"A Pareto-optimization approach for a fair ramp metering","257684722":"Algoritmos Evolutivos y su empleo en el ajuste de controladores del tipo PID: Estado Actual y Perspectivas","243463470":"A literature review and future perspectives on maintenance optimization. Journal of Quality in Maintenance Engineering, 17(1), 5-25","220288653":"Multi-objective optimization for stochastic computer networks using NSGA-II and TOPSIS","231007851":"Low emittance lattice optimization using a multi-objective evolutionary algorithm","268407886":"OPTIMIZATION MODELS FOR PATIENT ALLOCATION DURING A PANDEMIC INFLUENZA OUTBREAK","263371783":"Two-stage hybrid flow shop scheduling with preventive maintenance using multi-objective tabu search method","257391841":"Genetic algorithms in reliability engineering","245079341":"Minmax defense strategy for complex multi-state systems","258268371":"Joint parameter estimation from magnetic resonance and vertical electric soundings using a multi-objective genetic algorithm","261446701":"A DESIGN METHODOLOGY FOR HAPTIC DEVICES final Version","282776419":"GMDH-type neural network modeling and genetic algorithm-based multi-objective optimization of thermal and friction characteristics in heat exchanger tubes with wire-rod bundles","287591070":"Shape Optimization of an Airfoil in Ground Effect for Application to WIG Craft","255751298":"Co-immobilization of cholesterol esterase, cholesterol oxidase and peroxidase on PVC strip for serum cholesterol determination","262851606":"Multi-objective optimization of sheet metal forming die using FEA coupled with RSM","4035456":"Study on cell characteristics of PRAM using the phase-change simulation","261479504":"Quantifying the relative merits of genetic and swarm algorithms for network optimization in cognitive radio networks","282133277":"Performance assessment and optimization of an irreversible nano-scale Stirling engine cycle operating with Maxwell-Boltzmann gas","267766840":"A Robust Approach for Optimization – NS-NR I Part I: Theory","220118737":"Modelling preferences in multi-objective engineering design","233602617":"Genetic algorithm for optimisation of A-TIG welding process for modified 9Cr–1Mo steel","265415688":"Cost-Effective Test Suite Minimization in Product Lines Using Search Techniques","42428761":"Engineering Solutions to Optimise the Design of Carbon-Neutral Tall Office Buildings","224708229":"Optimal spectra of white light-emitting diodes using quantum dot nanophosphors","261272694":"A robust fault detection approach on the basis of virtual sensors collocated with fault excitations","284812061":"Optimal design of composite shells based on minimum weight and maximum feasibility robustness","258845834":"Multi-objective Optimization of Sheet Metal Forming Die Using Genetic Algorithm Coupled with RSM and FEA","222187223":"Multi-objective planning of distributed energy resources: A review of the state-of-the-art","279634752":"Practical Handling of Multiple Objectives Using Evolutionary Strategy for Optimal Placement of Hydraulic Fracture Stages in Unconventional Gas Reservoirs","286509817":"A Coral Reef Algorithm Based on Learning Automata for the Coverage Control Problem of Heterogeneous Directional Sensor Networks","235890172":"Yang, X.S.: Multiobjective Firefly Algorithm for Continuous Optimization. Engineering with Computers 29(2), 175-184","235711995":"Modeling and genetic algorithm-based multi-objective optimization of the MED-TVC desalination system","276317305":"Optimal power flow management for distributed energy resources with batteries","236358164":"A comparative study of genetic algorithms for the multi-objective optimization of composite stringers under compression loads","231590344":"Cost-stable truck scheduling at a cross-dock facility with unknown truck arrivals: A meta-heuristic approach","263216053":"A two-stage approach for a multi-objective component assignment problem for a stochastic-flow network","278695065":"An Evolutionary Algorithm with Path Relinking for a Bi-objective Multiple Traveling Salesman Problem with Profits","285398276":"Cellular and Porous Materials: Thermal Properties Simulation and Prediction","279704739":"Selecting Countermeasures for ICT Systems Before They are Attacked","264971201":"Optimal Design of a Solar Driven Heat Engine Based on Thermal and Thermo-economic Criteria","278391940":"Privacy Preserving Distributed Data Mining with Evolutionary Computing","261071771":"Fast workflow scheduling for grid computing based on a multi-objective Genetic Algorithm","265776066":"Modern optimization techniques with applications in electric power systems","262357947":"...It\u0027s orange and small, and white stripes... augmented-reality system for fish species identification in aquariums","280976551":"Thermoeconomic optimization using an evolutionary algorithm of a trigeneration system driven by a solid oxide fuel cell","273574997":"A trajectory planning of redundant manipulators based on bilevel optimization","267865066":"Multiobjective Design Optimization of IGBT Power Modules Considering Power Cycling and Thermal Cycling","233865681":"Toward Bezier Curve Bank-Turn Trajectory Generation for Flying Robot","251976494":"A multi-objective genetic algorithm for mixed-model assembly line rebalancing","253967113":"Spectral optimization of warm-white light-emitting diode lamp with both color rendering index (CRI) and special CRI of R9 above 90","252066605":"Cellular and Porous Materials: Thermal Properties Simulation and Prediction","283593932":"Multi-objective optimization for asphalt pavement maintenance plans at project level: Integrating performance, cost and environment","276151367":"Multi-objective genetic algorithm as channel selection method for P300 and motor imagery data set","260957114":"Application of ANN and GA for the Prediction and Optimization of Thermal and Flow Characteristics in a Rectangular Channel Fitted with Twisted Tape Vortex Generators","233861576":"Protecting critical infrastructures against intentional attacks-A two-stage game with incomplete information","280263820":"Optimization of Liquid Desiccant Regenerator with Multiobject Particle Swarm Optimization Algorithm","265604079":"Life cycle assessment and life cycle cost implications of wall assemblages designs","269329457":"Multi-objective optimization for bridge retrofit to address earthquake hazards","232976860":"A joint pricing, lot-sizing, and supplier selection model","234783157":"NSGA-II-Trained Neural Network Approach to the Estimation of Prediction Intervals of Scale Deposition Rate in Oil \u0026 Gas Equipment","232657298":"Multi-objective Optimization of Graph Partitioning Using Genetic Algorithms","241086995":"Selection of Appropriate Plate Theories by Using a Genetic Like Algorithms","286141763":"Optimized selection of suitable sites for farmland consolidation projects using multi-objective genetic algorithms","45709037":"Multi-objective genetic algorithm applied to spectroscopic ellipsometry of organic-inorganic hybrid planar waveguides","258083640":"A multiobjective optimization approach to statistical mechanics","262188028":"Design a multi-objective Genetic Algorithm for guaranteed QoS in Unicast complex Topologies","264971177":"Multi-Objective Thermodynamic-Based Optimization of Output Power of Solar Dish-Stirling Engine Implementing an Evolutionary Algorithm","220866889":"A Guided Search Non-dominated Sorting Genetic Algorithm for the Multi-Objective University Course Timetabling Problem","261420023":"Multi-objective optimization of a flash lamp drive","221929803":"Model Predictive Controller Employing Genetic Algorithm Optimization of Thermal Processes with Non-Convex Constraints","273222715":"Weldability Studies and Parameter Optimization of AISI 904L Super Austenitic Stainless Steel Using Friction Welding","273501246":"Thermodynamic analysis and optimization of the Atkinson engine by using NSGA-II","3617856":"Design principle of colored-noise tolerant optimum despreading-codesequences for spread-spectrum systems","283118745":"Modelling and optimization of critical parameters by hybrid RSM-GA for BSA separation using tubular configured MFI-type zeolite microfiltration membrane","266974099":"Soil erosion evaluation in a rapidly urbanizing city (Shenzhen, China) and implementation of spatial land-use optimization","287360346":"Predictive demand side management of a residential house under intermittent primary energy source conditions","270619743":"Analysis and optimization of integrated gas turbine, heat recovery steam generator and multi-effect thermal vapour compression desalination plant","270449761":"Optimization of a flexible floating structure for wave energy production and protection effectiveness","280040497":"Investigating Metaheuristics Applications for Capacitated Location Allocation Problem on Logistics Networks","236227221":"Multi-objective optimization and design of experiments as tools to tailor molecularly imprinted polymers specific for glucuronic acid","288144808":"Ecodesign of Chemical Processes with Multi-Objective Genetic Algorithms","261141269":"Multi-Objective Optimization by Using Evolutionary Algorithms: The $p$-Optimality Criteria","274320607":"Two-tier particle swarm optimization protocol for clustering and routing in wireless sensor network","277720074":"Multi-Objective X-bar Control Chart Design by Integrating NSGA-II and Data Envelopment Analysis","221624763":"Selection of optimal texture descriptors for retrieving ultrasound medical images.","263074592":"Optimization of flatback airfoils for wind turbine blade","265292639":"Optimizing the number and location of time point stops","24247776":"Cyndi: A multi-objective evolution algorithm based method for bioactive molecular conformational generation","281893982":"Fuzzy reliability analysis of dual-fuel steam turbine propulsion system in LNG carriers considering data uncertainty","259124203":"Multi-objective real-time dispatching for integrated delivery in a Fab using GA based simulation optimization","220373382":"Reliability-Based Optimization Models for Scheduling Pavement Rehabilitation","270345401":"Multiobjective planning of distribution networks incorporating switches and protective devices using a memetic optimization","279737353":"Tradeoffs between production and perennial vegetation in dairy farming systems vary among counties in the Northeastern U.S.","259216351":"Multiobjective Genetic Algorithm Approach to the Economic Statistical Design of Control Charts with an Application to X¯bar and S 2 Charts","259124189":"A novel hybrid meta-heuristic algorithm for solving multi objective flexible job shop scheduling","224408015":"Opportunities for active DER management in deferral of distribution system reinforcements","282649705":"Comparative Analysis of MOGA, NSGA-II and MOPSO for Regression Test Suite Optimization","220199341":"A hybrid multi-objective approach based on the genetic algorithm and neural network to design an incremental cellular manufacturing system. Comput Ind Eng","280683533":"AN APPROACH FOR MULTI-OBJECTIVE OPTIMIZATION OF HYBRID MATERIAL STRUCTURE FOR MOBILITY APPLICATIONS","270685338":"An Overview of Multi-Objective Evolutionary Optimization for Routing in Mobile Ad-hoc Networks","278152236":"Hybrid approach to FACTS devices allocation using multi-objective function with NSPSO and NSGA-II algorithms in Fuzzy framework","257391598":"Multi-objective optimization of linear multi-state multiple sliding window system","248392311":"Multi-commodity warehouse location and distribution planning with inventory consideration","272018678":"Efficient Workflow Scheduling for Grid Computing Using a Leveled Multi-objective Genetic Algorithm","262345570":"Multi-objective test generation for software product lines","261118805":"An overview of the probability-based methods for optimal electrical distribution system reconfiguration","260412224":"Robust design optimization of friction dampers for structural response control","258433965":"Automatic Optimisation of System Architectures using EAST-ADL","260008883":"Multi-objective Multidisciplinary design of Space Launch System using Holistic Concurrent Design","283296818":"Performance evaluation of multi-objective genetic algorithms for preventive maintenance scheduling","279385206":"Multi-Objective Optimization","258952119":"Protein superfamily classification using adaptive evolutionary radial basis function network","278309963":"Optimal Reliability Design-Modeling","257403785":"A multi-objective genetic algorithm approach to rule mining for affective product design","230865181":"Asynchronous evolutionary shape optimization based on high-quality surrogates: Application to an air-conditioning duct","220307906":"A Dynamic Multi-Objective Optimization Framework for Selecting Distributed Deployments in a Heterogeneous Environment","261313399":"Multi-objective optimization problems: Method and application","271951057":"Application of a Multi-Objective Approach and Sequential Covering Algorithm to the Fatigue Segment Classification Problem","265583420":"A SOFT-COMPUTING BASED SYSTEM LEVEL DESIGN SPACE EXPLORATION METHODOLOGY FOR SYSTEM-ON-CHIP DESIGNS","285904352":"Optimization investigation on configuration parameters of serrated fin in plate-fin heat exchanger using genetic algorithm","223402427":"Efficient deterministic multiple objective optimal control of (bio)chemical processes","251507216":"A multi-objective analysis for the retrofit of a pulverized coal power plant with a CO 2 capture and compression process","225425793":"Adaptive multi-objective optimization based on feedback design","261311331":"Single-objective vs. multi-objective scheduling algorithms for scheduling jobs in grid environment","3767498":"Low-cost, 3 Kv, Triggered, Stripline, Surface-discharge Switch","221008340":"Multi-objective optimisation by reinforcement learning","220217822":"A novel hybrid charge system search and particle swarm optimization method for multi-objective optimization","263606964":"Linear Programming Based Genetic Algorithm for the Unequal Area Facility Layout Problem","220794922":"Combining memory optimization with mapping of multimedia applications for multi-processors system-on-chip","263154346":"Optimal Capital Structure and Financial Risk of Project Finance Investments: A Simulation Optimization Model With Chance Constraints","271998268":"Tolerance Optimization of a Lower Arm by using Genetic Algorithm and Process Capability Index","271668540":"A bi-objective optimization approach for exclusive bus lane selection and scheduling design","285758470":"Multi-objective end optimization based on an improved cross-entropy method. A case study of a micro-scale manufacturing process","268206831":"Validation and Demonstration of the Prescott Spatial Growth Model in Metropolitan Atlanta, Georgia","261563010":"Accurate point matching based on multi-objective Genetic Algorithm for multi-sensor satellite imagery","221988908":"Optimization of the core configuration design using a hybrid artificial intelligence algorithm for research reactors","274404684":"Systematic selection of tuning parameters for efficient predictive controllers using a multiobjective evolutionary algorithm","267684561":"Automated Planning and Design of Formwork for Freeform shell structures","259535454":"Multiobjective Optimization Design of Heating System in Electric Heating Rapid Thermal Cycling Mold for Yielding High Gloss Parts","264090261":"Considering skills evolutions in multi-skilled workforce allocation with flexible working hours","256664160":"Optimised sensor selection for control and fault tolerance of electromagnetic suspension systems: A robust loop shaping approach","232065272":"Multi-objective optimization framework for networked predictive controller design","290497663":"Developing a safe and high performance fuel management optimization for MTRs using stochastic knowledge base searches","259705419":"Multi-objective optimization of satellite image registration using Discrete Particle Swarm Optimisation","288838659":"Enhanced Version of Multi-algorithm Genetically Adaptive for Multiobjective optimization","275379539":"A Novel Method to Design and Optimize Flat-Foldable Origami Structures Through a Genetic Algorithm","4279555":"Geometric Feature Equalizers Based on Hybrid Genetic Algorithm","229017835":"Optimal operation of a 30 kW natural gas microturbine cluster","251710030":"Optimal control of amine plant using non-dominated sorting genetic algorithm-II","274576658":"Availability Approach to Optimizing Railway Track Renewal Operations","251673167":"Separation of toluene/ n-heptane mixtures experimental, modeling and optimization","220459127":"Optimizing Access Point Allocation Using Genetic Algorithmic Approach for Smart Home Environments","281857432":"A dynamic multi-objective evolutionary algorithm using a change severity-based adaptive population management strategy","274263311":"Vehicle Scheduling of an Urban Bus Line via an Improved Multiobjective Genetic Algorithm","256905736":"Large-Scale Experimental Evaluation of Cluster Representations for Multiobjective Evolutionary Clustering","257012239":"Expected value multiobjective portfolio rebalancing model with fuzzy parameters","276176149":"Assessing and Managing ICT Risk with Partial Information","248632242":"A Decision Support System for Solving Multi- Objective Redundancy Allocation Problems","271136079":"Multicriteria Assessment of Crosswalk Location in Urban Roundabout Corridors","270234995":"Solving Multi-objective Vehicle Routing Problem with Time Windows by FAGA","235613025":"Multi-objective optimization of a stand-alone hybrid renewable energy system by using evolutionary algorithms: A review","274122043":"Complex System Reliability Optimisation: A Multi-Criteria Approach","226871540":"A hybrid-constrained MOGA and local search method to optimize the load path for tube hydroforming","277145078":"A Pareto Front-Based Multiobjective Path Planning Algorithm","224215086":"Multiobjective Evolutionary Algorithm Approach in Modeling Discrete-Time Multivariable Dynamics Systems","261278433":"Particle swarm optimization based secure QoS clustering for mobile ad hoc network","221431879":"Parallel Distributed Genetic Algorithm for Expensive Multi-Objective Optimization Problems","262939354":"A multi-objective evolutionary algorithm for facility dispersion under conditions of spatial uncertainty","274431267":"Can Tidal Current Energy Provide Base Load?","276174093":"Iterative Selection of Cost-Effective Countermeasures for Intelligent Threat Agents","221947974":"Multi-objective optimization of a cooling tower assisted vapor compression refrigeration system","256692787":"Four E analysis and multi-objective optimization of combined cycle power plants integrated with Multi-stage Flash (MSF) desalination unit","220219552":"Multi-objective feature selection by using NSGA-II for customer churn prediction in telecommunications","265378385":"Design Optimization of Centrifugal Pump Using Radial Basis Function Metamodels","262816299":"A Tetrahedron-Based Endmember Selection Approach for Urban Impervious Surface Mapping","221003944":"Design optimization of the Tau haptic device","267203179":"Assessing the performance of improved harmony search algorithm (IHSA) for the optimization of unconstrained functions using Taguchi experimental design","224983267":"Pareto-based optimization of part orientation in stereolithography","261202458":"A preliminary study of a new multi-objective optimization algorithm","272700874":"Solving a new bi-objective joint replenishment inventory model with modified RAND and genetic algorithms","273948122":"The Generalized Consistent Vehicle Routing Problem","261417473":"Multi-objective optimization of temperature distributions using Artificial Neural Networks","257153732":"BSTBGA: a hybrid genetic algorithm for constrained multi-objective optimization problems. Comput Oper Res","233424969":"Dynamic SLA Management with Forecasting using Multi-Objective Optimizations","220350595":"Collaborative clustering with background knowledge","272166289":"Multi-objective Discrete Rotor Design Optimization","257764081":"Modeling and Optimization of Electrodialytic Desalination of Fish Sauce Using Artificial Neural Networks and Genetic Algorithm","43378491":"Advanced Techniques for the Classification of Very High Resolution and Hyperspectral Remote Sensing Images","282854771":"Thermodynamic modeling of hydrophobic interaction chromatography of biomolecules in the presence of salt","236018593":"Feature Selection for Face Recognition Based on Multi-Objective Evolutionary Wrappers","268508597":"Multi-Objective Optimization of Node-Based Spacecraft Radiator Design","264497786":"A Multi-Stage Supply Chain Network Optimization Using Genetic Algorithms","259232433":"A Multi-Objective Approach to Optimize a Periodic Maintenance Policy","273401218":"Node-based spacecraft radiator design optimization","276075966":"Clear and smooth path planning","259504827":"Exergetic, economic and environmental analyses and multi-objective optimization of an SOFC-gas turbine hybrid cycle coupled with an MSF desalination system","262892132":"Bi-objective optimisation for integrated scheduling of single machine with setup times and preventive maintenance planning","224118922":"Multi-objective optimization of a fire-tube heat recovery steam generator system","281603355":"Array processing for the characterisation of acoustic sources on rolling stock","220170442":"Multi-Objective Approaches to Optimal Testing Resource Allocation in Modular Software Systems","273460634":"Robust Identification of Hydrocarbon Debutanizer Unit using Radial Basis Function Neural Networks (RBFNNs)","257096324":"Experimental investigation, modeling and optimization of membrane separation using artificial neural network and multi-objective optimization using genetic algorithm","274265486":"A holistic production planning approach in a reconfigurable manufacturing system with energy consumption and environmental effects","280046954":"Mapping Functional Behavior onto Architectural Model in a Model Driven Embedded System Design","224602240":"A Novel Protocol for Accuracy Assessment in Classification of Very High Resolution Images","222318756":"Baud-spaced constant modulus blind equalization via hybrid genetic algorithm and generalized pattern search optimization","261202555":"A new archive based steady state genetic algorithm","230813738":"Spare parts allocation by improved Genetic Algorithm and Monte Carlo simulation","261499513":"An Optimization Mechanism Intended for Two-Level Cache Hierarchy to Improve Energy and Performance Using the NSGAII Algorithm","267041305":"High performance architecture for NSGA-II","284970245":"UM ALGORITMO HEURÍSTICO MULTIOBJETIVO BASEADO NO MÉTODO DE NEWTON PARA O PROBLEMA INTEGRADO DE ALOCAÇÃO DE RECURSOS E SEQUENCIAMENTO DE OPERAÇÕES","281419068":"Uncertainty modeling in wind power generation prediction by neural networks and bootstrapping","267493899":"Various Criteria in Optimization of a Vapor Compression Refrigeration System","284546319":"Multi-Objective Optimization Design for Indirect Forced-Circulation Solar Water Heating System Using NSGA-II","283751701":"On Meta-heuristics in Optimization and Data Analysis. Application to Geosciences","282049840":"Multi-objective thermo-economic optimization of solar parabolic dish Stirling heat engine with regenerative losses using NSGA-II and decision making","44260527":"A Multi-Objective Formulation for Facility Layout Problem","262490549":"Energy efficient clustering and routing algorithms for wireless sensor networks: Particle swarm optimization approach","238512165":"Evolutionary algorithm for multi-objective Exergoeconomic optimization of Biomass Waste Gasification Combined Heat and Power System","282404545":"Theoretical analysis and design optimization of wideband input/output branch waveguide couplers for a sheet beam traveling wave tube","269567494":"Vibro-Acoustic Optimization of Turbulent Boundary Layer Excited Panel with Curvilinear Stiffeners","266871282":"Multi-Objective Optimisation of a PEM Fuel Cell System","228576132":"Traditional genetic algorithm and random-weighted genetic algorithm with GIS to plan radio network","239732822":"A Genetic Algorithm Based Global Search Strategy for Population Pharmacokinetic/Pharmacodynamic Model Selection.","280970915":"Optimized Design of a Dual-Band Power Amplifier With SiC Varactor-Based Dynamic Load Modulation","261364148":"A Machine-by-Machine Analysis of a Bi-Objective Resource Allocation Problem","282265329":"Selecting countermeasures for ict systems before they are attacked","252039463":"System modeling and optimization of microgrid using genetic algorithm","224402243":"Multi-objective Stochastic Heuristic Methodology for Tradespace Exploration of a Network Centric System of Systems","256008545":"Prediction of Mean Flow Stress during Hot Strip Rolling Using Genetic Algorithms","38308972":"Optimisation des mémoires dans le flot de conception des systèmes multiprocesseurs sur puces pour des applications de type multimédia","282210036":"Interference-Aware Energy-Efficient Resource Allocation for OFDMA-Based Heterogeneous Networks With Incomplete Channel State Information","235925543":"Econometrics and Metaheuristic Optimization Approaches to International Portfolio Diversification","50937121":"Optimal colour quality of LED clusters based on memory colours","229710744":"Multi‐objective optimization for channel allocation in mobile computing using NSGA‐II","224217972":"E³: Multi-Objective Genetic Algorithms for SLA-aware Service Deployment Optimization Problem","276235870":"Multi-objective optimisation of bridge retrofit and post-event repair selection to enhance sustainability","270794249":"Airflow and temperature distribution optimization in data centers using artificial neural networks","4308588":"An Optimal Access Points Allocation Scheme Based on Genetic Algorithm","251556049":"A comprehensive approach in optimization of a dual nuclear power and desalination system","280872589":"Multi-objective optimization of pulsatile ventricular assist device hemocompatibility based on neural networks and a genetic algorithm","3937792":"Attenuation factors of multistage non-linear parallel interference cancellation with small spread factors","283584219":"A Continuum Framework for Modeling the Excitation–Contraction Coupling of Smooth Muscle","282275567":"Thermodynamic analysis and performance optimization of irreversible Carnot refrigerator by using multi-objective evolutionary algorithms (MOEAs)","45630599":"AMI Screening Using Linguistic Fuzzy Rules","268181951":"Review of Multi-objective Optimization using Genetic Algorithm and Particle Swarm Optimization","227427275":"Berth Scheduling by Customer Service Differentiation: A Multi-Objective Approach","221449076":"Optimal design of a novel micro-gripper with completely parallel movement of gripping arms","223953681":"Multi-objective hierarchical genetic algorithms for multilevel redundancy allocation optimization","237844582":"Attribute Index and Uniform Design Based Multiobjective Association Rule Mining with Evolutionary Algorithm","270880361":"Composite Goal Methods for Transportation Network Optimization","228926443":"A design methodology for haptic devices","261482945":"Multi-objective optimization of ocean thermal energy conversion power plant via genetic algorithm","283797181":"BPOpt: A framework for BIM-based performance optimization","231582618":"2 3 Multi-objective Genetic Topological Optimization for Design of Blast Resistant Composites","271203954":"Incorporation of Preferences, Adaptive Operators and Hybridization in Multi-Objective Evolutionary Algorithms","260729296":"Hybrid Fractal-Wavelet Method for Multi-Channel EEG Signal Compression","273024536":"Bi-Objective Optimization Approach for Exclusive Bus Lane Scheduling Design","220199807":"Multiobjective invasive weed optimization: Application to analysis of Pareto improvement models in electricity markets","259096853":"Response analysis and optimum configuration of a modular floating structure with flexible connectors","273927732":"Incorporation of high recyclability material selection in computer aided design","273524266":"Optimization of shape and angle of attack of winglet vortex generator in a rectangular channel for heat transfer enhancement","221786961":"Multiple Multi-Objective Servo Design - Evolutionary Approach","271326791":"Experimental Investigation and Multiobjective Optimization of Turning Duplex Stainless Steels","227230688":"Machining scheme selection of digital manufacturing based on genetic algorithm and AHP","277432036":"Shape Optimization of an Organic Rankine Cycle Radial Turbine Nozzle","209707538":"Multi-objective, short-term hydrothermal scheduling based on two novel search techniques","225028888":"Contributions to hyperspectral image processing from Lattice Computing and Computational Intelligence","230888368":"FACE IDENTIFICATION USING SOFT COMPUTING TOOL","259473667":"An automated approach towards detecting complex behaviours in deep brain oscillations","260995579":"Optimum analysis of pavement maintenance using multi-objective genetic algorithms","225028885":"Contributions to hyperspectral image processing from Lattice Computing and Computational Intelligence","256721203":"A survey on optimization metaheuristics","223755049":"The behavior of MENA oil and non-oil producing countries in international portfolio optimization","270223003":"Thermo-economic optimization of Stirling heat pump by using non-dominated sorting genetic algorithm","264542536":"Multi-Objective Optimization of PID Controller for Coupled-Tank Liquid-Level Control System Using Genetic Algorithm","277587463":"An Improved Artificial Bee Colony Algorithm and Its Application to Multi-Objective Optimal Power Flow","276160250":"Multi-objective optimization of indoor air quality control and energy consumption minimization in a subway ventilation system","261200128":"Base stations locations optimisation in an airport environment using genetic algorithms","261482759":"Distribution feeder voltage support and power factor control by distributed multiple inverters","257157568":"A hybrid tool to combine multi-objective optimization and multi-criterion decision making in designing standalone hybrid energy systems","50996639":"Public Transport Route Finding using a Hybrid Genetic Algorithm","257171907":"Multi-objective methods for determining optimal ventilation rates in dwellings","251621479":"Determination of Pareto frontier in multi-objective maintenance optimization","266799484":"Thermodynamic analysis and optimization of an irreversible Ericsson cryogenic refrigerator cycle","290430929":"Thermodynamic analysis and multi objective optimization of performance of solar dish Stirling engine by the centrality of entransy and entropy generation","251810211":"A study of gross error detection and data reconciliation","224326653":"MAGLEV suspensions - A sensor optimisation framework","261714236":"Partially Observed, Multi-objective Markov Games","267503958":"Micro-Turbine Design Point Definition Using Genetic Algorithm With Single and Multi-Objective Optimization","251621457":"Dependability assessment of network-based safety-related system","261413156":"Multi-Objective Genetic Algorithm optimization of CMOS operational amplifiers","262228243":"ASMiGA: An archive-based steady-state micro genetic algorithm","276903475":"A possibilistic approach to UMTS base-station location problem","266015085":"OMAE2011-49259 PERMANENT MEANS OF ACCESS STRUCTURAL DESIGN USING MULTI-OBJECTIVE OPTIMIZATION","257880553":"Design of a New Hand Exoskeleton for Rehabilitation of Post- Stroke Patients","260958522":"Multicomponent pre-stack seismic waveform inversion in transversely isotropic media using a non-dominated sorting genetic algorithm","270892701":"Evolutionary algorithms for de novo drug design – A survey","276926017":"Endocrine-Immune Network and Its Application for Optimization","271550190":"Comparative study of a Hybrid Model for network traffic identification and its optimization using Firefly Algorithm","281413122":"Inventory replenishment planning and staggering","226501447":"Optimization of electronics component placement design on PCB using self organizing genetic algorithm (SOGA)","268820172":"A Multi-objective Jumping Particle Swarm Optimization Algorithm for the Multicast Routing","267555128":"Multi-Objective Evolutionary Algorithms for Vehicle Routing Problems","277909083":"Spacecraft attitude dynamics simulator actuated by cold gas propulsion system","220285935":"Long memory time series forecasting by using genetic programming","252047829":"Multiple objective system reliability post-Pareto optimality using self organizing trees","254638591":"Simulation-based analysis and optimization on recipient prioritization for cadaveric liver allocation","267634976":"Optimizing bi-objective redundancy allocation problem with a mixed redundancy strategy","246044796":"Multi-Objective Optimization for High Recyclability Material Selection using Genetic Algorithm","282545665":"Multi-objective optimization of collation delay and makespan in mail-order pharmacy automated distribution system","280444527":"Multi Response Optimization of Turning Operation with Self-propelled Rotary Tool","271724264":"Optimal Energy Management Strategy for Distributed Energy Resources","222114786":"Privacy-preserving data mining: A feature set partitioning approach","281411104":"Multi-objective optimization to identify key players in large social networks","224154551":"Resource Allocation in LTE OFDMA Systems Using Genetic Algorithm and Semi-Smart Antennas","263563591":"A multicriteria optimisation model for reliability design of series-parallel systems: Part 1","253954519":"Distribution system reconfiguration using genetic algorithm based on connected graphs","259086729":"Feasibility study and performance assessment for the integration of a steam-injected gas turbine and thermal desalination system","282134056":"Review sobre el diseño y la optimización de los Intercambiadores de Calor de Tubo y Coraza. Autores","268196103":"Power-aware multi-objective evolvable hardware system on an FPGA","278158954":"Efficient non-linear analysis and optimal design of biomechanical systems","222100419":"Endmember induction by lattice associative memories and multi-objective genetic algorithms","283336674":"Specific cutting force and cutting condition interaction modeling for round insert face milling operation","257417299":"Mathematical Modeling and Multi-Objective Optimization of a Mini-Channel Heat Exchanger Via Genetic Algorithm","279941035":"Optimal design and operation of activated sludge processes: State-of-the-art","223820380":"Design optimization of a safety-instrumented system based on RAMS+C addressing IEC 61508 requirements and diverse redundancy","278677392":"MED\u002715 Presentation","286572059":"Application of genetic algorithms to neural networks based control of a liquid level tank system","281397206":"FinalPublished(Ansari-MultiObjective)","285396497":"Genetic algorithm approach for k-coverage and m-connected node placement in target based wireless sensor networks","241101130":"Multi-objective optimization of sensor array using genetic algorithm","275355517":"Two Machine Learning Approaches for Short-Term Wind Speed Time-Series Prediction","239348049":"An optimized Line Sampling method for the estimation of the failure probability of nuclear passive systems","51508228":"A Common Mutation in the Defensin DEFB126 Causes Impaired Sperm Function and Subfertility","261152903":"Tuning of a fuzzy PD type controller applied to the buck converter using the NSGA-II algorithm","257525825":"Multi-Objective Optimization of a Vehicular PEM Fuel Cell System","260735127":"Selection of optimal texture descriptors for retrieving ultrasound medical images","232415994":"Resource Discovery and Allocation in Network Virtualization","283817946":"Multi-Objective and Multi-Stage Reliability Growth Planning in Early Product-Development Stage","223799911":"Design, optimization and manufacturing of wood–plastic composite pallet","230800112":"Mining Online Store Client Assessment Classification Rules with Genetic Algorithms","252028976":"Optimal selection for sensor fault tolerant control of an EMS system via loop-shaping robust control","275597146":"Development of a Multi-objective Genetic Algorithm for MDO Problem","267665612":"Unsupervised classification. Similarity measures, classical and metaheuristic approaches, and applications","273588087":"Hybrid NSGA-II Algorithm on multi-objective inventory management problem","227426994":"Multi-objective optimization of a road diet network design","262213788":"Natural Language Processing applied in itinerary recommender systems","245512607":"A biased random-key genetic algorithm for OSPF and DEFT routing to minimize network congestion","278701987":"Multi-objective Simulated Annealing Algorithm for Partner Selection in Virtual Enterprises","269705043":"Application of Genetic Algorithm Methodologies in Fuel Bundle Burnup Optimization of Pressurized Heavy Water Reactor","259911740":"Feasibility Study of Using Thermoelectric Cooling Modules for Active Cooling of Photovoltaic Panels","241176871":"Non-dominated sorting simplex algorithm for multi-objective optimization","224188955":"Geo-Spatial resource analysis and optimization of investment strategies for renewable energy","262856941":"Method of dimensional optimization of spherical robots for medical applications using specialized indices","280233971":"Multi-objective optimization of two stage series connected thermo-electric generator using genetic algorithm","264159472":"Computational intelligence and safe reduction of test suite","220164686":"Simulation-Based Planning and Optimization in Multi-Echelon Supply Chains","251634082":"Multiobjective optimization scheme for industrial synthesis gas sweetening plant in GTL process","274095881":"Variable Coded Hierarchical Fuzzy Classification Model using DNA Coding and Evolutionary Programming","271066971":"Pumped storage-based standalone photovoltaic power generation system: Modeling and techno-economic optimization","263563457":"The Optimized Operation of a Solar Hybrid Desiccant/Displacement Ventilation Combined with a Personalized Evaporative Cooler","239348016":"Modelling and optimization of proof testing policies for safety instrumented systems","220686931":"Tripartite modular multiplication","265461930":"Maintenance grouping strategy for multi-component systems with dynamic contexts","282533805":"Multi-objective thermodynamic optimization of an irreversible regenerative Brayton cycle using evolutionary algorithm and decision making","257810464":"Autonomous Neural Models for the Classification of Events in Power Distribution Networks","265126067":"Automatic Satellite Sun Sensor Placement Using Multi-objective Genetic Algorithms","283465575":"Developing a bi-objective optimization model for solving the availability allocation problem in repairable series–parallel systems by NSGA II","259406066":"A Modified Non-Dominated Sorting Genetic Algorithm with Fractional Factorial Design for Multi-Objective Optimization Problems","264560712":"Multi-objective optimization of GPU3 Stirling engine using third order analysis","264546377":"Robust Watermarking against Print and Scan Attack through Efficient Modeling Algorithm","272379825":"Hybrid Uncertainty and Sensitivity Analysis of the Model of a Twin-Jet Aircraft","286600837":"An Integrated Approach to Robust Multi-echelon Inventory Policy Decision","276164581":"Predictive control with multiobjective optimization: Application to a sludge drying operation","263530534":"Design optimisation of switch rails in railway turnouts","285896345":"Design and Evaluation of Accelerated Life Testing Plans with Dual Objectives","273393629":"Multiobjective Reinforcement Learning: A Comprehensive Overview","269989761":"A Multi-Objective Evolutionary Algorithm for Energy Management of Agricultural Systems – A case study in Iran","280874790":"Performance and energy aware scheduling simulator for HPC: Evaluating different resource selection methods","224066246":"Learning from examples with spatial-adaptive wavelet-based reproducing kernels","224213748":"Optimization of biomass waste gasification Combined Heat and Power System","257351932":"Protein secondary structure prediction using DWKF based on SVR-NSGAII","279248654":"A multi-objective genetic algorithm for a bi-objective facility location problem with partial coverage","257415419":"Application of the multi-objective optimization method for designing a powered Stirling heat engine: Design with maximized power, thermal efficiency and minimized pressure loss","251210068":"Reliable Network Design Using Hybrid Genetic Algorithm Based on Multi-Ring Encoding","257896689":"Developing a multi-objective, multi-item inventory model and three algorithms for its solution","287252141":"Optimal Selection of Security Countermeasures for Effective Information Security","272910321":"Genetic Algorithm Based Multi Product and Multi AgentInventory Optimization in Supply Chain Management","265642089":"Entropy-based evaluation function in a multi-objective approach for the investigation of the genetic code robustness","228434464":"Distributed Control Systems for Aero Gas Turbine Engines: A wicked problem for systems engineering?","262516763":"Markov Modelling of In-Vehicle Power Line Communications","220371687":"The Analytical Hierarchy Process for contaminated land management","49837373":"Development of a new spatial analysis tool in mental health: Identification of highly autocorrelated areas (hot-spots) of schizophrenia using a Multiobjective Evolutionary Algorithm model (MOEA/HS)","224461481":"Optimal Test Points Selection Based on Multi-Objective Genetic Algorithm","257392772":"A micro-genetic algorithm for multi-objective scheduling of a real world pipeline network. Eng Appl Artif Intell","266289160":"Multi-Objective Evolutionary Computation Solution for Chocolate Production System Using Pareto Method","277962573":"How to Find a Comfortable Bus Route - Towards Personalized Information Recommendation Services","261568586":"The ENCODE project and perspectives on pathways","257581247":"Multi objective outbound logistics network design for a manufacturing supply chain","257378481":"Experimental study and genetic algorithm-based multi-objective optimization of thermal and flow characteristics in helically coiled tubes","226005663":"Supply Chain Cyclic Planning and Optimisation","275183499":"Investigation of a Bridge Pier Scour Prediction Model for Safe Design and Inspection","268525551":"Genetic Algorithms in Wireless Networking: Techniques, Applications, and Issues","271919044":"A Multi-Objective Optimization Approach for Joint Channel Assignment and Multicast Routing in Multi-Radio Multi-Channel Wireless Mesh Networks","274198437":"Location and Distribution Management of Relief Centers: A Genetic Algorithm Approach","270008290":"Multi-objective and thermodynamic optimisation of a parabolic trough receiver with perforated plate inserts","268038148":"Safety and operational integrity evaluation and design optimization of safety instrumented systems","272373699":"Genetic algorithms for condition-based maintenance optimization under uncertainty","261851236":"Introduction of a Mutation Specific Fast Non-dominated Sorting GA Evolved for Biochemical Optimizations"},"index":911}