{"abs":"this paper we very briefly review some of these results. RKHS can be chosen tailored to the problem at hand in many ways, and we review a few of them, including radial basis function and smoothing spline ANOVA spaces. Girosi (1997), Smola and Scholkopf (1997), Scholkopf et al (1997) and others have noted the relationship between SVM\u0027s and penalty methods as used in the statistical theory of nonparametric regression. In Section 1.2 we elaborate on this, and show how replacing the likelihood functional of the logit (log odds ratio) in penalized likelihood methods for Bernoulli [yes-no] data, with certain other functionals of the logit (to be called SVM functionals) results in several of the SVM\u0027s that are of modern research interest. The SVM functionals we consider more closely resemble a \"goodness-of-fit\" measured by classification error than a \"goodness-of-fit\" measured by the comparative Kullback-Liebler distance, which is frequently associated with likelihood functionals. This observation is not new or profound, but it is hoped that the discussion here will help to bridge the conceptual gap between classical nonparametric regression via penalized likelihood methods, and SVM\u0027s in RKHS. Furthermore, since SVM\u0027s can be expected to provide more compact representations of the desired classification boundaries than boundaries based on estimating the logit by penalized likelihood methods, they have potential as a prescreening or model selection tool in sifting through many variables or regions of attribute space to find influential quantities, even when the ultimate goal is not classification, but to understand how the logit varies as the important variables change throughout their range. This is potentially applicable to the variable/model selection problem in demographic m...","title":"Support Vector Machines, Reproducing Kernel Hilbert Spaces and the Randomized GACV","id":2638730,"url":"https://www.researchgate.net/publication/2638730_Support_Vector_Machines_Reproducing_Kernel_Hilbert_Spaces_and_the_Randomized_GACV","names":["Grace Wahba"],"references":{"38359951":"A Comparison of GCV and GML for Choosing the Smoothing Parameter in the Generalized Spline Smoothing Problem","200033835":"The Nature of Statistical Learning Theory","38364549":"A Correspondence Between Bayesian Estimation on Stochastic Processes and Smoothing by Splines","236736850":"Spline Models of Observational Data","254286973":"Inequality-Constrained Multivariate Smoothing Splines with Application to the Estimation of Posterior Probabilities","2398643":"Adaptive tuning of numerical weather prediction models: Part I: randomized GCV and related methods in three and four dimensional data assimilation","238247273":"Improper Priors, Spline Smoothing and the Problem of Guarding Against Model Errors in Regression","2769718":"Model Fitting and Testing for Non-Gaussian Data with Large Data Sets","2403322":"Approximate Smoothing Spline Methods for Large Data Sets in the Binary Case","250956438":"Erratum: spline interpolation and smoothing on the sphere. SIAM J Sci Stat Comput 3:385-386","221995160":"Theory of reproducing kernels. Trans Am Math Soc","225771346":"On a Kernel-Based Method for Pattern Recognition, Regression, Approximation, and Operator Inversion","247486758":"Semiparametric analysis of variance with tensor product thin plate splines","2364046":"A Generalized Approximate Cross Validation for Smoothing Splines with Non-Gaussian Data","242473304":"Spline interpolation and smoothing on the sphere. SIAM J Sci Stat Comput 2:5-16","2442574":"Structured Machine Learning for \u0027Soft\u0027 Classification with Smoothing Spline ANOVA and Stacked Tuning, Testing and Evaluation","38366373":"An Approach to Time Series Analysis","38359590":"Asymptotic Optimality of the Fast Randomized Versions of GCV and $C_L$ in Ridge Regression and Regularization","2574039":"Adaptive Tuning of Numerical Weather Prediction Models: Simultaneous Estimation of Weighting, Smoothing and Physical Parameters","38360059":"Asymptotic Optimality of $C_L$ and Generalized Cross-Validation in Ridge Regression with Application to Spline Smoothing","243099855":"On Absolute Continuity of Measures Corresponding to Homogeneous Gaussian Fields","38348606":"Asymptotic comparison of (partial) cross-validation, GCV and randomized GCV in nonparametric regression","220668764":"Feature Selection via Mathematical Programming","2248350":"Smoothing Spline ANOVA for Exponential Families, with Application to the Wisconsin Epidemiological Study of Diabetic Retinopathy","235121661":"Statistical inference on time series by RKHS methods","235194939":"Constrained Regularization for Ill Posed Linear Operator Equations, with Applications in Meteorology and Medicine"},"citedIn":{"2833962":"Regularized Least-Squares Classification","258432354":"Adaptive inverse control using kernel identification","221165352":"A kernel based adaline.","280561854":"Efficient Algorithm for Privately Releasing Smooth Queries","8593540":"Gaussian processes for machine learning","33957391":"Adaptive conjoint wavelet-support vector classifiers /","49641214":"Robust Model-Free Multiclass Probability Estimation","242637946":"SVM-based Filtering of E-mail Spam with Content-speciÞc MisclassiÞcation Costs","220344111":"An algebraic characterization of the optimum of regularized kernel methods","226999688":"Privacy-Preserving Random Kernel Classification of Checkerboard Partitioned Data","220345139":"Privacy-preserving classification of vertically partitioned data via random kernels","221112123":"Using Hard Classifiers to Estimate Conditional Class Probabilities","240745551":"Support Vector Machines with Applications1","261566863":"GIS Partial Discharge Pattern Recognition Based on the Chaos Theory","231588820":"Radius Margin Bounds for Support Vector Machines with the RBF Kernel","220551999":"Probabilistic SVM outputs for pattern recognition using analytical geometry","220321082":"A Generalized Kernel Approach to Dissimilarity-based Classification.","2180668":"Bayesian Field Theory: Nonparametric Approaches to Density Estimation, Regression, Classification, and Inverse Quantum Problems","220269825":"Web unit mining: Finding and classifying subgraphs of Web pages","45283473":"Support Vector Machines for Classification: A Statistical Portrait","228582842":"Multicategory Support Vector Machines (Preliminary Long Abstract)","2544142":"On the Dual Formulation of Regularized Linear Systems With Convex Risks","228343217":"An integrated statistical approach for volume reconstruction from unregistered sequential slices","225044313":"Smoothness Selection for Penalized Quantile Regression Splines","5488227":"Adaptive Weighted Learning for Unbalanced Multicategory Classification","222578037":"Efficient wavelet adaptation for hybrid wavelet–large margin classifiers","30518245":"SVM Multiclasses, Théorie et Applications","223419749":"Hybrid wavelet-support vector classification of waveforms","228429736":"0 Robustness and Stability of Reweighted Kernel Based Regression","4742783":"Robust Truncated Hinge Loss Support Vector Machines","227164083":"A Fast Dual Algorithm for Kernel Logistic Regression","24283464":"Kernel Quadratic Discriminant Analysis for Positive Definite and Indefinite Kernels","281262328":"Another Look at DWD: Thrifty Algorithm and Bayes Risk Consistency in RKHS","5608558":"Nonlinear kernel-based statistical pattern analysis","223558511":"Kernel based modelling of friction dynamics","5802521":"A Bayesian 3D Volume Reconstruction for Confocal Micro-rotation Cell Imaging","237526634":"The Generalized Bayesian Committee Machine (Proceedings of the Sixth ACM SIGKDD International Conference on Knowledge Discovery and Data Mining, KDD2000)","238879871":"On ψ-Learning","256721166":"Introducing the Discriminative Paraconsistent Machine (DPM)","2573922":"Mathematical Programming Approaches To Machine Learning And Data Mining","10985698":"On Different Facets of Regularization Theory","220981089":"Comparing Several Evaluation Functions in the Evolutionary Design of Multiclass Support Vector Machines.","4139635":"Approximate leave-one-out error estimation for learning with smooth, strictly convex margin loss","223445277":"Parameter detection of thin films from their X-ray reflectivity by support vector machines","220504936":"Analysis of Convertible Bond Value Based on Integration of Support Vector Machine and Copula Function","40498233":"Gaussian Processes for Classification: Mean-Field Algorithms","220158798":"Solutions of nonlinear control and estimation problems in reproducing kernel Hilbert spaces: Existence and numerical determination","220216179":"Web classification of conceptual entities using co-training","43076294":"Radius-margin bound on the leave-one-out error of the LLW-M-SVM","5845505":"Ultra-fast quantification of hearing loss by neural synchronization stabilities of auditory evoked brainstem activity","2486395":"On the Relation Between the GACV and Joachims\u0027 ... Method for Tuning Support Vector Machines, With Extensions to the Non-Standard Case","222697767":"A new kernel-based approach for linear system identification","2907725":"Automatic Bayes Carpentry Using Unlabeled Data In Semi-Supervised Classification","220914511":"Feasible Adaptation Criteria for Hybrid Wavelet - Large Margin Classifiers.","222538532":"Evaluation of simple performance measures for tuning SVM parameters","10994383":"Soft and hard classification by reproducing kernel Hilbert space methods","221497695":"Sparse Probability Regression by Label Partitioning.","46491306":"Forecasting cancellation rates for services booking revenue management using data mining","220669268":"Mathematical Programming for Data Mining: Formulations and Challenges","242524673":"BAYESIAN MODELS AND MACHINE LEARNING WITH GENE EXPRESSION ANALYSIS APPLICATIONS","4741181":"Penalized Splines and Reproducing Kernel Methods","26661344":"Prediction of Protein Beta-Residue Contacts by Markov Logic Networks with Grounding Specific Weights","49677441":"Non-crossing large-margin probability estimation and its application to robust SVM via preconditioning","239560767":"MATHEMATICAL ENGINEERING TECHNICAL REPORTS Information Criteria for Kernel Machines","2482777":"Multicategory Support Vector Machines, Theory, and Application to the Classification of Microarray Data and Satellite Radiance Data","4742709":"On L1-Norm Multiclass Support Vector Machines: Methodology and Theory","221620042":"Learning sparse dynamic linear systems using stable spline kernels and exponential hyperpriors.","220320673":"VC Theory of Large Margin Multi-Category Classifiers.","228729127":"Support Vector Methods in Learning and Feature Extraction","229616936":"About kernel latent variable approaches and SVM","221345213":"A Fast Dual Algorithm for Kernel Logistic Regression.","242285821":"Kernel Methods","255180728":"A Unified View of Nonparametric Trend-Cycle Predictors Via Reproducing Kernel Hilbert Spaces","228957495":"On multicategory truncated-hinge-loss support vector machines","220981176":"Learning Adaptive Kernels for Model Diagnosis.","220906942":"Computational Developments of Psi-learning.","251314284":"Various Kernel Methods with Applications","229004606":"Optimizing psi-learning via mixed integer programming","209436387":"A Tutorial on Support Vector Regression","2115256":"Statistical properties of the method of regularization with periodic Gaussian reproducing kernel","251474021":"On L 1 Norm Multiclass Support Vector Machines","49459307":"Bayesian Model Selection for Support Vector Machines, Gaussian Processes and Other Kernel Classifiers","2394303":"Optimal Properties and Adaptive Tuning of Standard and Nonstandard Support Vector Machines","225524714":"Text classification toward a scientific forum","36123834":"Regularized nonparametric logistic regression and kernel regularization /","258790897":"Determination of liquefaction susceptibility of soil: a least square support vector machine approach. Int J Numer Anal Methods Geomech","220910004":"Heat-ray: Combating identity snowball attacks using machine learning, combinatorial optimization and attack graphs","220199357":"Fuzzy kernel hyperball perceptron","262395136":"Radial basis function regularization for linear inverse problems with random noise","221619088":"Support Vector Machines","224265208":"A randomized heuristic for kernel parameter selection with large-scale multi-class data","220156855":"Fast computation of smoothing splines subject to equality constraints","221501313":"Machine Learning and Statistical MAP Methods.","280866830":"Prediction of Plant Height in Arabidopsis thaliana Using DNA Methylation Data","224342507":"Beyond Traditional Kernels: Classification in Two Dissimilarity-Based Representation Spaces","24318917":"Locally-Based Kernal PLS Smoothing to Non-Parametric Regression Curve Fitting","220320151":"On Efficient Large Margin Semisupervised Learning: Method and Theory","262150424":"A novel manifold–manifold distance index applied to looseness state assessment of viscoelastic sandwich structures","220175783":"Clustering Analysis of Gene Expression Data based on Semi-supervised Visual Clustering Algorithm","2320537":"The Relaxed Online Maximum Margin Algorithm","215530597":"Perspectives on System Identification","245304865":"Classification Approach for Reliability Analysis with Stochastic Finite-Element Modeling","224591836":"Pattern Classification With Class Probability Output Network","222539139":"Support vector machines with adaptive Lq penalty","233264933":"Practical estimation of Volterra filters of arbitrary degree","220372960":"Pattern classification with mixtures of weighted least-squares support vector machine experts. Neural Comput Appl","2237665":"A Generalized Representer Theorem","221578736":"Joint Optical Flow Motion Compensation and Video Compression Using Hybrid Vector Quantization.","221345783":"Feature Selection via Concave Minimization and Support Vector Machines.","261165398":"Classifying circuit performance using active-learning guided support vector machines","2315503":"The Kernel Gibbs Sampler","262174573":"Review and performance comparison of SVM- and ELM-based classifiers","221497340":"Lecture Notes in Computer Science","250222650":"Bayesian Field Theory: From likelihood fields to hyperfields","224746933":"Hybrid Wavelet-Kernel Based Classifiers and Novelty Detectors in Biosignal Processing","262021455":"New Fuzzy Support Vector Machine for the Class Imbalance Problem in Medical Datasets Classification","220549623":"Expectation maximization of prefrontal-superior temporal network by indicator component-based approach","226556754":"Efficient Hyperkernel Learning Using Second-Order Cone Programming","237227760":"Effectively Finding the Optimal Wavelet for Hybrid Wavelet - Large Margin Signal Classification","228674933":"Statistical Likelihood Representations of Prior Knowledge in Machine Learning","2591999":"Support Vector Machines And The Bayes Rule In Classification","239723152":"Scale-Invariance of Support Vector Machines based on the Triangular Kernel","274656389":"Hyperspectral image classification incorporating bacterial foraging-optimized spectral weighting","225734063":"An approach to model complex high–dimensional insurance data","229751661":"Inferences from Mixed Models in Quantitative Genetics","220828149":"A Non-linear Model of Nondestructive Estimation of Anthocyanin Content in Grapevine Leaves with Visible/Red-Infrared Hyperspectral","220072958":"Nonlinear Dimension Reduction with Kernel Sliced Inverse Regression","223389107":"Self-organized topological structures in neural networks for the visual cortex of the brain","2461377":"Bayesian Methods for Support Vector Machines: Evidence and Predictive Class Probabilities","8459880":"Objective Detection of the Central Auditory Processing Disorder: A New Machine Learning Approach","262247757":"Robust classification of imbalanced data using one-class and two-class SVM-based multiclassifiers","47935019":"Support Vector Machines - Backgrounds and Practice","2800860":"The Generalized Bayesian Committee Machine","29609787":"Global optimization of expensive-to-evaluate functions: An empirical comparison of two sampling criteria","220551647":"From linear to non-linear kernel based classifiers for bankruptcy prediction","271396560":"Probabilistic SVM outputs for pattern recognition using analytical geometry","220017634":"A Statistical Perspective on Data Mining","254408150":"Bayesian multiple response kernel regression model for high dimensional data and its practical applications in near infrared spectroscopy","28356272":"Learning interpretable models","11429806":"Discriminating between supraventricular and ventricular tachycardias from EGM onset analysis","223740503":"High-dimensional pseudo-logistic regression and classification with applications to gene expression data","277239173":"Contribution à l\u0027intégration des machines à vecteurs de support au sein des systèmes de reconnaisance de formes : application à la lecture automatique de l\u0027écriture manuscrite","225382508":"Estimation of the misclassification error for multicategory support vector machine classification","228915872":"Recognition of Human Mitochondrial Sequences Using SVM","226570886":"Support Vector Machine Classification for High Dimensional Microarray Data Analysis, With Applications in Cancer Research","2644768":"A Generalized Representer Theorem","2478380":"A Study on Sigmoid Kernels for SVM and the Training of non-PSD Kernels by SMO-type Methods","220777505":"Event Detection and Tracking Based on Improved Incremental K-Means and Transductive SVM.","3203898":"Supervised image classification by contextual AdaBoost based on posteriors in neighborhoods","268420852":"Identification of large-scale sparse linear dynamic systems: a regularization based approach","45603260":"A Practical Approach to Model Selection for Support Vector Machines With a Gaussian Kernel","260408970":"A new intrusion detection method based on SVM with minimum within-class scatter","51952655":"Estimation of scale functions to model heteroscedasticity by support\nvector machines","277790617":"On the Fast Detection of Auditory Brainstem Responses : A Novelty Detection Paradigm","2451773":"A Support Vector/Hidden Markov Model Approach to Phoneme Recognition","221534764":"Reproducing Kernel Banach Spaces for Machine Learning","271498548":"Remote sensing image classification based on SVM classifier","224323141":"A new kernel-based approach for system identification","254408757":"Bayesian nonlinear regression for large p small n problems","228911802":"Convergence rates of compactly supported radial basis function regularization","261808315":"On ѱ-Learning","238675227":"Chapter 7 Regularized Least-Squares Classification","221144077":"Using Support Vector Machines for Generating Synthetic Datasets","228426939":"From the Support Vector Machine to the Bounded Constraint Machine","227266732":"Regularized Kernel Forms of Minimum Squared Error Method","221277207":"Method for Determining Parameters of Posterior Probability SVM Based on Relative Cross Entropy","252045868":"Bayesian Kalman filtering, regularization and compressed sampling","41574224":"Inversion d\u0027un système par krigeage : application à la synthèse des catalyseurs à haut débit","260737190":"Malicious Code Detection Using Penalized Splines on OPcode Frequency","7676230":"Recipes for the linear analysis of EEG","2438931":"Statistical Properties and Adaptive Tuning of Support Vector Machines","224529492":"Differentiation of perceived sound levels by electroencephalographic data : A novelty detection approach using habituation correlates","4013316":"Identification of central auditory processing disorders by scale and entropy features of binaural auditory brainstem potentials","2539805":"Kernel Logistic Regression and the Import Vector Machine","229800590":"Identification of Central Auditory Processing Disorders by Binaurally Evoked Brainstem Responses","226244160":"Regularization Paths for \nν\n-SVM and \nν\n-SVR","255602689":"Explicit connections between longitudinal data analysis and kernel machines","222405247":"Lateral interaction in accumulative computation: A model for motion defection","3203854":"A Classification Approach Based on SVM for Electromagnetic Subsurface Sensing","6532387":"Fast detection of wave V in ABRs using a smart single sweep analysis system","7131949":"Genomic-Assisted Prediction of Genetic Value with Semiparametric Procedures","241068831":"23 Statistical Learning in Medical Data Analysis","51952729":"The theory and application of penalized methods or Reproducing Kernel\nHilbert Spaces made easy","224303132":"Identification of expensive-to-simulate parametric models using Kriging and Stepwise Uncertainty Reduction","257820188":"A Probabilistic Framework for SVM Regression and Error Bar Estimation","233831084":"Nonlinear Vertex Discriminant Analysis with Reproducing Kernels","259578428":"Differentially Private Data Releasing for Smooth Queries with Synthetic Database Output","5421846":"Nonparametric Methods for Incorporating Genomic Information Into Genetic Evaluations: An Application to Mortality in Broilers","5421845":"Reproducing Kernel Hilbert Spaces Regression Methods for Genomic Assisted Prediction of Quantitative Traits","4816133":"Kernel logistic PLS: A tool for supervised nonlinear dimensionality reduction and binary classification","249804205":"Kernel PLS Smoothing for Nonparametric Regression Curve Fitting: an Application to Event Related Potentials","2472311":"From Margin To Sparsity","3998049":"Hybrid wavelet packet - Support vector classification of atrial activation patterns","49627049":"A Kernel-Based Novelty Detection Scheme for the Ultra-Fast Detection of Chirp Evoked Auditory Brainstem Responses","220320832":"Refinable Kernels.","251893858":"An Improved Binary Tree SVM Classification Algorithm Based on Bayesian","221345362":"Ridge Regression Learning Algorithm in Dual Variables.","226658534":"A Tutorial on Support Vector Machines for Pattern Recognition","234689688":"The Connection Between Bayesian Estimation of a Gaussian Random Field and RKHS","2642765":"Probabilistic methods for Support Vector Machines","2791746":"Ridge Regression Learning Algorithm in Dual Variables","227673339":"Intrinsic Kriging and prior information: Research Articles","220552777":"Mean field method for the support vector machine regression","263540442":"On the Effect and Remedies of Shrinkage on Classification Probability Estimation","262266574":"Exploration of classification confidence in ensemble learning","220390995":"Approximation with polynomial kernels and SVM classifiers","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","232627374":"Innovating Risk Management and Hedging Strategy for Convertible Bonds Using Support Vector Machine","228451563":"Nonparametric Bayes kernel-base priors for functional data analysis","228578025":"Multimedia autoannotation via hierarchical semantic ensembles","3203402":"A Cost-Effective Semisupervised Classifier Approach With Kernels","220262491":"Classification of Multiple Cancer Types by Multicategory Support Vector Machines Using Gene Expression Data.","4742452":"Multicategory -Learning","220871766":"Probabilistic Ranking Support Vector Machine.","259701252":"Multicategory Large-Margin Unified Machines","234131061":"Anomaly Classification with the Anti-Profile Support Vector Machine","3814332":"Margin-like quantities and generalized approximate cross validation for support vector machines","221317816":"News Event Tracking Using an Improved Hybrid of KNN and SVM","238621106":"Digital stabilization of delayed-input strict-feedforward dynamics","220319914":"Some Properties of Regularized Kernel Methods","220499624":"On a Class of Support Vector Kernels Based on Frames in Function Hilbert Spaces","228620334":"Multicategory ψ-Learning and Support Vector Machine: Computational Tools","8161260":"Hidden Space Support Vector Machines","203918261":"Kernel Partial Least Squares Regression in Reproducing Kernel Hilbert Space","282843983":"On the Robustness of Regularized Pairwise Learning Methods Based on Kernels","257391296":"Probabilistic outputs for twin support vector machines. Knowl-Based Syst","220320441":"Undercomplete Blind Subspace Deconvolution.","51872398":"Robust penalized logistic regression with truncated loss functions","28352041":"A Simple Method For Estimating Conditional Probabilities For SVMs","2549181":"A Generalized Kernel Approach to Dissimilarity Based Classification","2766257":"Feature Selection via Concave Minimization and Support Vector Machines","259450093":"Adaptively Weighted Large Margin Classifiers","261805118":"Estimation of scale functions to model heteroscedasticity by regularised kernel-based quantile methods","221335190":"The Error Bar Estimation for the Soft Classification with Gaussian Process Models","224674499":"A New Method to Assist Small Data Set Neural Network Learning","238687123":"CONDITIONAL RANDOM FIELDS FOR CONTINUOUS SPEECH RECOGNITION","228718603":"On Robustness Properties of Convex Risk Minimization Methods for Pattern Recognition","24199387":"González-Recio, O., Gianola, D., Rosa, G. J., Weigel, K. A., Kranis, A. Genome-assisted prediction of a quantitative trait measured in parents and progeny: application to food conversion rate in chickens. Genet. Sel. Evol. 41, 3","261154876":"Improved facial expression recognition via uni-hyperplane classification","255588501":"L´ EVY RANDOM MEASURES: POSTERIOR CONSISTENCY AND APPLICATIONS","220763783":"A System for Detecting and Tracking Internet News Event","262203407":"Eigenvalues perturbation of integral operator for kernel selection","2242962":"Towards Scalable Support Vector Machines using Squashing","230554636":"Multilayer Kerceptron","257490145":"A kernel-based Adaline for function approximation","257352426":"Fuzzy support vector machine based on within-class scatter for classification problems with outliers or noises","227899944":"A comparative study of multi‐class support vector machines in the unifying framework of large margin classifiers","7060907":"Information criteria for support vector machines","261186641":"Rare Variants Detection with Kernel Machine Learning Based on Likelihood Ratio Test","226096314":"Regularized learning in Banach spaces as an optimization problem: Representer theorems","2616802":"Generalized Approximate Cross Validation For Support Vector Machines, Or, Another Way To Look At Margin-Like Quantities","257516191":"Relaxing support vectors for classification","222833793":"Robust Learning from Bites for Data Mining","275060142":"A general framework for monitoring complex processes with both in-control and out-of-control information","7428029":"Gene selection based on multi-class support vector machines and genetic algorithms.","224142483":"A Novel Technique for Subpixel Image Classification Based on Support Vector Machine","262576233":"Two-Dimensional Solution Surface for Weighted Support Vector Machines","24145058":"Isotropic high resolution 3D confocal micro-rotation imaging for non-adherent living cells","224248463":"Pricing Convertible Bond Based on Integration of Support Vector Machine and Copula Function","237554173":"Cloud Classification of Satellite Radiance Data by Multicategory Support Vector Machines","228585033":"Efficient Data Mining for Enabling Genome-wide Computing","222502549":"A Statistical Perspective on Data Mining","3917795":"Nonlinear perceptual audio filtering using support vector machines","220320507":"Support Vector Machine Soft Margin Classifiers: Error Analysis.","224971442":"Feasibility of an objective electrophysiological loudness scaling: A kernel-based novelty detection approach","268525531":"Large-Margin Classification with Multiple Decision Rules","222417564":"Robustness of reweighted Least Squares Kernel Based Regression","7060917":"Binary tree of SVM: A new fast multiclass training and classification algorithm","221996773":"Kernel Partial Least Squares Regression in Reproducing Kernel Hilbert Space","220218111":"Robust truncated support vector regression","245032827":"Robustness and Outlier Detection in Chemometrics","222689441":"Design of complex systems in the presence of large uncertainties: A statistical approach","242400660":"Regularization Approaches in Learning Theory","222550692":"Model Selection for Support Vector Machine Classification","222571694":"Hyperparameter tuning criteria for Support Vector Classifiers","220488907":"A Quadratic Loss Multi-Class SVM","12413257":"New Support Vector Algorithms","220785872":"Forward Decoding Kernel Machines: A Hybrid HMM/SVM Approach to Sequence Recognition","7782799":"Robust classification modeling on microarray data using misclassification penalized posterior","220579551":"Finding and classifying web units in websites","221618888":"Bayesian Model Selection for Support Vector Machines, Gaussian Processes and Other Kernel Classifiers."},"index":912}