{"abs":"Fourier acceleration is a useful technique which can be applied to many different numerical algorithms in order to alleviate the problem of critical slowing down. Here we describe its application to an optimization problem in the simulation of lattice gauge theories, that of gauge fixing a configuration of link fields to the Landau gauge (∂muAmu\u003d0). We find that a steepest-descents method of gauge fixing link fields at beta\u003d5.8 on an 84 lattice can be made 5 times faster using Fourier acceleration. This factor will grow as the volume of the lattice is increased. We also discuss other gauges that are useful to lattice-gauge-theory simulations, among them one that is a combination of the axial and Landau gauges. This seems to be the optimal gauge to impose for the Fourier acceleration of two other important algorithms, the inversion of the fermion matrix and the updating of gauge field configurations.","title":"Fourier acceleration in lattice gauge theories. I. Landau gauge fixing","id":13330145,"url":"https://www.researchgate.net/publication/13330145_Fourier_acceleration_in_lattice_gauge_theories_I_Landau_gauge_fixing","names":["C.T.H. Davies","Ghassan George Batrouni","G. R. Katz","A. S. Kronfeld","G. P. Lepage","K. G. Wilson","Physical review D: Particles and fields"],"references":{"226197594":"Langevin simulations of lattice field theories using Fourier acceleration","223118333":"Quantization of non-Abelian gauge theories","13333352":"Langevin simulation of lattice field theories. Phys. Rev. D 32, 2736","256575903":"Monte Carlo simulations and gauge fixing","222618914":"Hadron wave functions in lattice QCD","13330146":"Fourier acceleration in lattice gauge theories. II. Matrix inversion and the quark propagator","222591101":"Accelerated Langevin simulations of lattice QCD and other models","222583037":"The gluon is massive: A lattice calculation of the gluon propagator in the Landau gauge","13257057":"Fourier Acceleration of Relaxation Processes in Disordered Systems","235547953":"Monte-Carlo study of quantized SU(2) Gauge-theory","13254596":"Numerical analysis of accelerated stochastic algorithms near a critical temperature"},"citedIn":{"222506562":"Bc spectroscopy from lattice QCD","222414661":"Two-point functions of quenched Lattice QCD in Numerical Stochastic Perturbation Theory. (I) The ghost propagator in Landau gauge","237842985":"Quark Propagation in the Instantons of Lattice QCD","29524165":"Numerical results on Gribov copies in lattice SU(3) theory","1986329":"Infrared Behavior of the Gluon Propagator on a Large Volume Lattice","51949842":"The Upsilon spectrum and the determination of the lattice spacing from\nlattice QCD including charm quarks in the sea","222486606":"Wolff-type embedding algorithms for general nonlinear σ-models","229352356":"High statistics study of the gluon propagator in the Landau gauge at ß \u003d 6.0","1989647":"Infrared Gluon Propagator from lattice QCD: results from large asymmetric lattices","1990925":"An investigation into a wavelet accelerated gauge fixing algorithm","222679891":"Gribov copies, lattice QCD and the gluon propagator","230609575":"Landau Gauge Fixing on GPUs and String Tension","242307435":"Study of Critical SlowingDown in SU(2) Landau Gauge Fixing","222470242":"Gauge boson masses in the 3D, SU(2) gauge-Higgs model","235532841":"Center vortices and the quark propagator in SU(2) gauge theory","228340925":"Numerical Solutions of the Complex Langevin Equations in Polymer Field Theory","222475367":"Testing the quasi-temporal gauge on the lattice","227231405":"Infrared exponents and the strong-coupling limit in lattice Landau gauge","1987384":"Lattice quark propagator with staggered quarks in Landau and Laplacian gauges","222490730":"Four-loop result in SU(3) lattice gauge theory by a stochastic method: lattice correction to the condensate","13330146":"Fourier acceleration in lattice gauge theories. II. Matrix inversion and the quark propagator","243352488":"A multilink update algorithm for SU(2) lattice gauge theory","1993013":"Tadpole renormalization and relativistic corrections in lattice NRQCD","222622057":"Lattice QCD simulations beyond the quenched approximation","282000355":"Connection between centre vortices and instantons through gauge-field smoothing","1993520":"Asymptotic Scaling and Infrared Behavior of the Gluon Propagator","232735472":"GPU implementation of a Landau gauge fixing algorithm","235454778":"Quantum interactions between nonperturbative vacuum fields","243208009":"Multigrid Monte Carlo for a bose field in an external gauge field","1986854":"Problems in Lattice Gauge Fixing","243352763":"Stochastic gauge fixing for compact lattice gauge theories","255144207":"Chiral symmetry restoration in anisotropic QED 3","279752595":"Evidence that centre vortices underpin dynamical chiral symmetry breaking in SU(3) gauge theory","13276040":"Fourier acceleration in lattice gauge theories. III. Updating field configurations","222652673":"A lattice study of the Faddeev-Niemi effective action","222394372":"Effective theories of confinement","258884395":"Nucleon Excited State Wave Functions from Lattice QCD","262568672":"Fourier Accelerated Conjugate Gradient Lattice Gauge Fixing","222112890":"Fermions as Global Correction: the QCD Case","1989967":"Exploring the infrared gluon and ghost propagators using large asymmetric lattices","222304022":"On the definition of gauge field operators in lattice gauge-fixed theories","1993028":"Gluon Propagator in the Infrared Region","47524239":"SU(3) Landau gauge gluon and ghost propagators using the logarithmiclattice gluon field definition","13328791":"On the fate of a J/ produced in a nucleus-nucleus collision","232400314":"Improved Landau Gauge Fixing and Discretisation Errors","1991295":"The SU(3) running coupling from lattice gluons","223921466":"Critical slowing-down in SU(2) Landau gauge-fixing algorithms","222481184":"Lattice gauge-fixing for generic covariant gauges","234119831":"Landau gauge fixing on the lattice using GPU\u0027s","222439713":"A comparative study of gauge fixing procedures on the connection machines CM2 and CM5","222567200":"Gribov Copies and Gauge Fixing in Lattice Gauge Theories","243268377":"Lattice saddle-point configurations in SU (2)3","47719600":"Wave Functions of the Proton Ground State in the Presence of a Uniform\nBackground Magnetic Field in Lattice QCD","225098755":"Landau gauge fixing on GPUs","222058581":"A preliminary study of the Gribov ambiguity in lattice SU(3) Coulomb gauge","222478894":"Upsilon spectroscopy from lattice QCD","1992816":"FFT for the APE parallel computer","45908179":"Spectral sum for the color-Coulomb potential in SU(3) Coulomb gauge lattice Yang-Mills theory","1993322":"The new definition of lattice gauge fields and the Landau gauge","258739992":"A MAG-Landau interpolating gauge for Yang-Mills theory on the lattice","2741855":"Higher Order Unitary Integrators for the Schrodinger Equation","1993063":"Diquark masses from lattice QCD","1987428":"Light hadron spectroscopy in quenched lattice QCD with chiral Fixed-Point fermions","258369820":"Coulomb gauge gluon propagator on anisotropic lattices","243208196":"α s from the non-perturbatively renormalised lattice three-gluon vertex","229076188":"Lattice Landau gauge gluon propagator: Lattice spacing and volume dependence","260933133":"Gauge fixing and the Gibbs phenomenon","263877179":"A Study of Gluon Propagator on Coarse Lattice","258567147":"Lattice Monte Carlo methods for systems far from equilibrium","252932247":"Wave Function of the Roper from Lattice QCD","256577486":"SU (3) lattice gauge fixing with overrelaxation and Gribov copies","13277506":"Multigrid Monte Carlo method. Conceptual foundations","222477000":"Gribov noise on the lattice axial current renormalisation constant","222427084":"R-symmetry in the Q-exact (2,2) 2d lattice Wess–Zumino model","51909781":"Scaling study of the gluon propagator in Coulomb gauge QCD on isotropic\nand anisotropic lattices","266972004":"Coulomb string tension, asymptotic string tension, and the gluon chain","1991567":"Precision Charmonium Spectroscopy From Lattice QCD","230775379":"Lattice methods for strongly interacting many-body systems","1991051":"Sphalerons and Other Saddles from Cooling","222304219":"The gluon propagator at high temperature","234119787":"Constraining a fourth generation of quarks: Non-perturbative Higgs boson mass bounds","1988538":"Perturbation theory vs. simulation for tadpole improvement factors in pure gauge theories","2003899":"Quark-gluon vertex from lattice QCD","222489316":"Gribov copies and smeared correlation functions in lattice QCD","234522972":"Bc andspectra from lattice NRQCD — Results at β \u003d 5.7","222015900":"Introduction to algorithms for Monte Carlo simulations and their application to QCD","243352617":"Gauge-fixing ambiguities in SU(3) lattice gauge theory","47535993":"Stationary point analysis of the one-dimensional lattice Landau gauge\nfixing functional, aka random phase XY Hamiltonian","1991344":"A numerical attempt on the Chiral Schwinger Model","282737259":"A study of gluon propagator on coarse lattice","222517233":"Edinburgh 2008/39 Non-Perturbative Renormalization of Three-Quark Operators","258082513":"Gluon mass at finite temperature from Landau gauge gluon propagator in lattice QCD","1992363":"Quarkonium spin structure in lattice NRQCD","1993384":"Evolutionary Algorithms Applied to Landau-Gauge Fixing","251232334":"Covariant gauges without Gribov ambiguities in Yang-Mills theories","253599709":"Conditioning techniques for dynamical fermions","256600971":"Evidence for the existence of gribov copies in landau gauge lattice QCD","271584498":"Gribov copies, lattice QCD and the gluon propagator","252867286":"Shape of the proton in a uniform magnetic field","1988313":"A global optimization method for Landau gauge fixing in Lattice QCD","222872962":"Multigrid landau gauge fixing","256600704":"Multigrid simulation of the XY model","222503823":"1) The influence of Gribov copies on gluon and ghost propagators in Landau gauge and 2) A new implementation of the Fourier Acceleration method","1987790":"Effective sigma models and lattice Ward identities","222740886":"SU (N) multigrid Landau gauge fixing","13340954":"Fourier-accelerated Langevin simulation of the frustrated XY model","1992900":"Multigrid implementation of the Fourier acceleration method for Landau gauge fixing","1986496":"SU(2) gluon propagator on a coarse anisotropic lattice","1993665":"Discretisation Errors in Landau Gauge on the Lattice","259445398":"Kenneth Geddes Wilson","222205663":"Multigrid techniques for quark propagator","263035974":"Fourier Accelerated Conjugate Gradient Lattice Gauge Fixing","239631783":"Experiencing gribov copies in SU(3) lattice gauge theory","51935991":"Computing the Effective Hamiltonian of Low-Energy Vacuum Gauge Fields","243352945":"Confinement and saddle-point configurations","222486964":"The Gluon Propagator on a Large Volume, at $\\beta\u003d6.0$","269116413":"Coulomb and Landau Gauge Fixing in GPUs using CUDA and MILC","235522034":"Quark propagator in Landau and Laplacian gauges with overlap fermions"},"index":913}