{"abs":"Structural reliability methods aim at computing the probability of failure of systems with respect to some prescribed performance functions. In modern engineering such functions usually resort to running an expensive-to-evaluate computational model (e.g. a finite element model). In this respect simulation methods, which may require $10^{3-6}$ runs cannot be used directly. Surrogate models such as quadratic response surfaces, polynomial chaos expansions or kriging (which are built from a limited number of runs of the original model) are then introduced as a substitute of the original model to cope with the computational cost. In practice it is almost impossible to quantify the error made by this substitution though. In this paper we propose to use a kriging surrogate of the performance function as a means to build a quasi-optimal importance sampling density. The probability of failure is eventually obtained as the product of an augmented probability computed by substituting the meta-model for the original performance function and a correction term which ensures that there is no bias in the estimation even if the meta-model is not fully accurate. The approach is applied to analytical and finite element reliability problems and proves efficient up to 100 random variables.","title":"Metamodel-based importance sampling for structural reliability analysis","id":51890126,"url":"https://www.researchgate.net/publication/51890126_Metamodel-based_importance_sampling_for_structural_reliability_analysis","names":["Vincent Dubourg","Francois Deheeger","Bruno Sudret","Probabilistic Engineering Mechanics"],"references":{"245284895":"Efficient Algorithm for Second-Order Reliability Analysis","224839970":"Some Methods for Classification and Analysis of MultiVariate Observations","229350702":"Modified Metropolis–Hastings algorithm with reduced chain correlation for efficient subset simulation","4772685":"Estimating percentiles of uncertain computer code outputs","265369049":"Slice sampling. (With discussions and rejoinder)","245747245":"Computer Analysis of Cylindrical Shells","222718989":"A sampling technique enhancing accuracy and efficiency of metamodel-based RBDO: Constraint boundary sampling","250693053":"Reliability Estimation for Dynamical Systems Subject to Stochastic Excitation using Subset Simulation with Splitting","222165872":"Reliability analysis—A review and some perspectives","240910540":"Simulation of second-order processes using Karhunen–Loeve expansion","1911433":"Controlled stratification for quantile estimation","223416196":"“Response surface method using vector projeted sampling points”","38363487":"The Design and Analysis of Computer Experiments","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","263047733":"Structural Reliability Methods","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","229328945":"Cumulative formation of response surface and its use in reliability analysis","250310896":"Adaptive encoding of a videoconference image sequence via neural networks","223325330":"Hybrid Subset Simulation Method for Reliability Estimation of Dynamical Systems Subject to Stochastic Excitation","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","222933783":"Asymptotic sampling for high-dimensional reliability analysis","275188793":"Asymptotic Approximations for Multinormal Integrals","256380695":"A path-following technique via an asymptotic-numerical method","223307920":"Multiple design points in first and second-order reliability","248560911":"Importance sampling in structural system","216301381":"The Design and Analysis Computer Experiments","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","222548334":"Reliability-based structural optimization using neural networks and Monte Carlo simulation","2681158":"Monte Carlo Statistical Methods","221900823":"Cross Validity Choice and Assessment of Statistical Predictions","226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","268441586":"IMPROVING ACCURACY AND COMPENSATING FOR UNCERTAINTY IN SURROGATE MODELING","225805894":"Asymptotic approximations for multinormal domain and surface integrals","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","227580645":"Three dimensional extension of non-linear shell formulation based on the Enhanced Assumed Strain Concept","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","216301661":"Screening, Predicting, and Computer Experiments","222780925":"A new adaptive importance sampling scheme","223906278":"Application of Kriging method to structural reliability","264910325":"Structural reliability. Statistical learning perspectives","257007022":"System reliability analysis by enhanced Monte Carlo simulation"},"citedIn":{"283056222":"A study on a stopping criterion for active refinement algorithms in Kriging surrogate models","257101719":"A new adaptive response surface method for reliability analysis","260914185":"Wavelet density-based adaptive importance sampling method","278381904":"Simulation Data Management for Adaptive Design Of Experiment","272350067":"Polynomial-Chaos-Based Kriging","283308843":"Global sensitivity analysis-enhanced surrogate (GSAS) modeling for reliability analysis","260145162":"Metamodel-based importance sampling for reliability sensitivity analysis","265603865":"Pre-posterior optimization of sequence of measurement and intervention actions under structural reliability constraint","268807818":"A new system formulation for the tolerance analysis of overconstrained mechanisms","268443151":"PC-Kriging: A new meta-modelling method and its application to quantile estimation","256249109":"Challenges and future trends in Uncertainty-Based Multidisciplinary Design Optimization for space transportation system design","270987507":"Efficient structural reliability analysis method based on advanced Kriging model","261291205":"Assessment of the Efficiency of Kriging Surrogate Models for Structural Reliability Analysis","283462770":"Decoupled Multidisciplinary Design Optimization Formulation for Interdisciplinary Coupling Satisfaction Under Uncertainty","285311256":"Échantillonnage préférentiel quasi-optimal par krigeage pour l’évaluation de la fiabilité des cuves de réacteur à eau pressurisée","291013505":"Cross-entropy-based adaptive importance sampling using von Mises-Fisher mixture for high dimensional reliability analysis","291011714":"New Sampling Method and Procedures for Estimating Failure Probability","51990403":"Reliability-based design optimization of imperfect shells using adaptive\nkriging meta-models","280310254":"Estimating the small failure probability of a nuclear passive safety system by means of an efficient Adaptive Metamodel-Based Subset Importance Sampling method","273093147":"Mixed Efficient Global Optimization for Time-Dependent Reliability Analysis","281185693":"Échantillonnage préférentiel et méta-modèles : méthodes bayésiennes optimale et défensive","260145246":"Meta-model-based importance sampling for reliability sensitivity analysis","273206504":"Estimation of passive systems functional failure probabilities by the modified meta-IS algorithm","277567471":"Simulation data management for adaptive design of EXPERIMENTS: a litterature review","262922188":"Reliability-based robust design optimization: A general methodology using Genetic Algorithm","268038033":"Improved metamodel-based importance sampling for the performance assessment of radioactive waste repositories","283542543":"Assessment of polynomial correlated function expansion for high-fidelity structural reliability analysis","273506849":"X-TMCMC: Adaptive kriging for Bayesian inverse modeling","263666649":"An improved adaptive kriging-based importance technique for sampling multiple failure regions of low probability","282543143":"An adaptive reliability method combining relevance vector machine and importance sampling","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","281144371":"Rare Event Simulation","281704632":"Recent Results on Nonparametric Quantile Estimation in a Simulation Model","276378765":"Importance Sampling for Reliability Evaluation With Stochastic Simulation Models","264349943":"Passive systems failure probability estimation by the meta-AK-IS2 algorithm","275280785":"A new sampling strategy for SVM-based Response Surface for Structural Reliability Analysis","281913142":"Risk and Reliability Analysis of Multibarrier System for Near-Surface Disposal Facilities","263141907":"Decoupled UMDO formulation for interdisciplinary coupling satisfaction under uncertainty","278402789":"Integrated deterministic and probabilistic safety assessment: Concepts, challenges, research directions"},"index":916}