{"abs":"Several methods based on Kriging have recently been proposed for calculating a probability of failure involving costly-to-evaluate functions. A closely related problem is to estimate the set of inputs leading to a response exceeding a given threshold. Now, estimating such a level set—and not solely its volume—and quantifying uncertainties on it are not straightforward. Here we use notions from random set theory to obtain an estimate of the level set, together with a quantification of estimation uncertainty. We give explicit formulae in the Gaussian process set-up and provide a consistency result. We then illustrate how space-filling versus adaptive design strategies may sequentially reduce level set estimation uncertainty.","title":"Estimating and Quantifying Uncertainties on Level Sets Using the Vorob’ev Expectation and Deviation with Gaussian Process Models","id":284330223,"url":"https://www.researchgate.net/publication/284330223_Estimating_and_Quantifying_Uncertainties_on_Level_Sets_Using_the_Vorob\u0027ev_Expectation_and_Deviation_with_Gaussian_Process_Models","names":["Clément Chevalier","David Ginsbourger","Julien Bect","Ilya Molchanov"],"references":{"228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","216301381":"The Design and Analysis Computer Experiments","2132882":"Estimation of the volume of an excursion set of a Gaussian process using intrinsic Kriging","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","226166306":"Averaging of Random Sets Based on Their Distance Functions","220692253":"Engineering Design via Surrogate Modelling: A Practical Guide","267109921":"Theory of Random Sets","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","29640793":"Estimation du volume des ensembles d\u0027excursion d\u0027un processus Gaussien par Krigeage intrinsèque"},"citedIn":{},"index":92}