{"abs":"In this paper we study the asymptotic variance of sample path averages for inhomogeneous Markov chains that evolve alternatingly according to two different $\\pi$-reversible Markov transition kernels. More specifically, we define a partial ordering over the pairs of $\\pi$-reversible Markov kernels, which allows us to compare directly the asymptotic variances for the inhomogeneous Markov chains associated with each pair. As an important application we use this result for comparing different data-augmentation-type Metropolis-Hastings algorithms. In particular, we compare some pseudo-marginal algorithms (in the terminology of [1]) and propose a novel exact algorithm, referred to as the random refreshment algorithm, which is more efficient, in terms of asymptotic variance, than the Grouped Independence Metropolis Hastings (GIMH) algorithm and has a computational complexity that does not exceed that of the Monte Carlo Within Metropolis (MCWM) algorithm. Finally, we provide a theoretical justification of the Carlin and Chib algorithm [3] used in model selection.","title":"Partial Ordering of Inhomogeneous Markov Chains with Applications to Markov Chain Monte Carlo Methods","id":249316198,"url":"https://www.researchgate.net/publication/249316198_Partial_Ordering_of_Inhomogeneous_Markov_Chains_with_Applications_to_Markov_Chain_Monte_Carlo_Methods","names":["Florian Maire","Randal Douc","Jimmy Olsson"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","200105001":"Equation of State by Fast Computing Machines","2111878":"General state space Markov chains and MCMC algorithms","228667343":"An MCMC model search algorithm for regression problems","225081349":"Coupled MCMC with a randomized acceptance probability","220286515":"On Bayesian model and variable selection using MCMC","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","41222435":"Monte Carlo Statistical Method","38326864":"Ordering and Improving the Performance of Monte Carlo Markov Chains","231609430":"Convergence properties of pseudo-marginal Markov chain Monte Carlo\nalgorithms","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","244509996":"The Multiple-Try Method and Local Optimization in Metropolis Sampling","220321086":"A generalization of the Multiple-try Metropolis algorithm for Bayesian estimation and model selection."},"citedIn":{"274094454":"Stability of Noisy Metropolis-Hastings","256376004":"Quantitative convergence rates for sub-geometric Markov chains","261369129":"On the use of Markov chain Monte Carlo methods for the sampling of mixture models"},"index":922}