{"abs":"In this paper, we are concerned with the simulation of Gaussian random fields by means of iterative stochastic algorithms, which are compared in terms of rate of convergence. A parametrized class of algorithms, which includes stochastic relaxation (Gibbs sampler), is proposed and its convergence properties are established. A suitable choice for the parameter improves the rate of convergence with respect to stochastic relaxation for special classes of covariance matrices. Some examples and numerical experiments are given.","title":"Improving Stochastic Relaxation for Gussian Random Fields","id":231909716,"url":"https://www.researchgate.net/publication/231909716_Improving_Stochastic_Relaxation_for_Gussian_Random_Fields","names":["Piero Barone","Arnolodo Frigessi","Probability in the Engineering and Informational Sciences"],"references":{"226660785":"Generalized consistent ordering and the optimum successive over-relaxation factor","238848601":"On the accelerated iterative method for estimating the optimum overrelaxation parameter","244416205":"A New Approach to the Limit Theory of Recurrent Markov Chains","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","222629386":"A survey of the iterative methods for the solution of linear systems by extrapolation, relaxation and other techniques"},"citedIn":{"45933694":"Control Variates for Reversible MCMC Samplers","240944088":"Spatial Simulations with Markov Chains","277679273":"Bayesian Computation Via Markov Chain Monte Carlo","21674605":"Graphs and stochastic relaxation for hierarchial Bayes modelling","279352961":"Metropolis Methods, Gaussian Proposals and Antithetic Variables","265369049":"Slice sampling. (With discussions and rejoinder)","2762752":"Over-relaxation methods and Metropolis-Hastings coupled Markov chains for Monte Carlo simulation","23631235":"On the Geometrical Convergence of Gibbs Sampler inRd","243776875":"Spatial Statistics and Bayesian Computing","255644850":"Studio della convergenza nell\u0027analisi di immagini digitali","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","2606836":"Suppressing Random Walks in Markov Chain Monte Carlo Using Ordered Overrelaxation","229760130":"Gibbs Sampling","239755230":"On the performance of the gibbs sampler for the multivariate normal distribution","257822568":"Stochastic optimization with structured distributions:The case of Bayesian nets","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","48167141":"Zero Variance Markov Chain Monte Carlo for Bayesian Estimators","2241439":"General over-relaxation Markov chain Monte Carlo algorithms for Gaussian densities","45858374":"Rates of convergence of some multivariate Markov chains with polynomial eigenfunctions","265623304":"Sampling Gaussian Distributions in Krylov Spaces with Conjugate Gradients","226090855":"Asymptotic behavior of eigenvalues and random updating schemes"},"index":924}