{"abs":"The Gibbs sampler, the algorithm of Metropolis and similar iterative simulation methods are potentially very helpful for summarizing multivariate distributions. Used naively, however, iterative simulation can give misleading answers. Our methods are simple and generally applicable to the output of any iterative simulation; they are designed for researchers primarily interested in the science underlying the data and models they are analyzing, rather than for researchers interested in the probability theory underlying the iterative simulations themselves. Our recommended strategy is to use several independent sequences, with starting points sampled from an overdispersed distribution. At each step of the iterative simulation, we obtain, for each univariate estimand of interest, a distributional estimate and an estimate of how much sharper the distributional estimate might become if the simulations were continued indefinitely. Because our focus is on applied inference for Bayesian posterior distributions in real problems, which often tend toward normality after transformations and marginalization, we derive our results as normal-theory approximations to exact Bayesian inference, conditional on the observed simulations. The methods are illustrated on a random-effects mixture model applied to experimental measurements of reaction times of normal and schizophrenic patients.","title":"Inference From Iterative Simulation Using Multiple Sequences","id":38363224,"url":"https://www.researchgate.net/publication/38363224_Inference_From_Iterative_Simulation_Using_Multiple_Sequences","names":["Andrew Gelman","Donald B. Rubin","Statistical Science"],"references":{"245071851":"A single series from the Gibbs sampler provides a false sense of security","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","200105001":"Equation of State by Fast Computing Machines","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","243689785":"Illustration of Bayesian Inference in Normal Data Models Using Gibbs Sampling"},"citedIn":{},"index":926}