{"abs":"Prior knowledge on the space of possible images is given in the form of a function or template in some domain. The set of all possible true images is assumed to be formed by a composition of that function with continuous mappings of the domain into itself. A prior Gaussian distribution is given on the set of continuous mappings. The observed image is assumed to be a degradation of the true image with additive noise. Given the observed image, a posterior distribution is then obtained and has the form of a nonlinear perturbation of the Gaussian measure on the space of mappings. We present simulations of the posterior distribution that lead to structural reconstructions of the true image in the sense that it enables us to determine landmarks and other characteristic features of the image, as well as to spot pathologies in it. Moreover, we show that the reconstruction algorithm is relatively robust when the images are degraded by noise that is not necessarily additive.","title":"Structural Image Restoration Through Deformable Templates","id":242609128,"url":"https://www.researchgate.net/publication/242609128_Structural_Image_Restoration_Through_Deformable_Templates","names":["Yali Amit","Ulf Grenander","Mauro Piccioni","Journal of the American Statistical Association"],"references":{"38360808":"A Nonhomogeneous Markov Process for the Estimation of Gaussian Random Fields with Nonlinear Observations","236736511":"On the Shape of Plane Images","246356652":"HANPS: A Pattern Theoretical Study of Biological Shapes","255482463":"Brownian Motion and Stochastic Calculus","242529506":"Diffusions for Global Optimization","44368626":"Lectures on diffusion problems and partial differential equations / by S. R. S. Varadhan","242706958":"Spatial interaction and statistical analysis of lattice systems","224839692":"Spatial Interaction and the Statistical Analysis of Lattice Systems","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","220662570":"A Unified Approach to Pattern Analysis.","234806928":"Hands. A pattern theoretic study of biological shapes"},"citedIn":{"3192883":"Hilbert-Schmidt Lower Bounds for Estimators on Matrix Lie Groups for ATR","248132809":"Towards automatic interpretation of sheep ultrasound scans","228927904":"Image recognition via deformable templates","222491470":"High-Dimensional Image Registration Using Symmetric Priors","225224035":"A framework for incorporating structural prior information into the estimation of medical images","250801891":"Spatial Normalisation Using Basis Functions","11260601":"On the metrics and Euler-Lagrange equations of computational anatomy. Ann. Rev. Biomed. Eng. 4:375-405","224136015":"Deformation Invariant Image Matching by Spectrally Controlled Diffeomorphic Alignment","243043944":"Markov models and Bayesian methods in image analysis","2768434":"A Wavelet Based Approach to Deformable Templates","277283486":"Local Analysis On A Shape Manifold","47821507":"Bayesian Image Analysis","20353321":"Brain mapping.","239930989":"Reaction Neuron Network Model for Image Perception","3659796":"A distance for elastic matching in object recognition","224074102":"Analysis of cloudy structures evolution on meteorological satellite acquisitions","284002524":"Shape classification based on interpoint distance distributions","5634151":"Deformable template models for emission tomography","2309143":"Chi-Square Fitting Of Deformable Templates For Lane Boundary Detection","3906061":"Learning inhomogeneous Gibbs model of faces by minimax entropy","223461225":"Deformable template models: A review","3665934":"Detecting straight edges in millimeter-wave images","29799929":"Locating landmarks using templates","270222427":"Rigid and Non-rigid Shape Evolutions for Shape Alignment and Recovery in Images","3326576":"Automatic target recognition organized via jump-diffusion algorithms","244467409":"Chapter 7. Large Deformation Fluid Diffeomorphisms for Landmark and Image Matching","235114564":"Graphical Shape Templates for Deformable Model Registration with Applications to MRI Brain Scans","243765967":"Anatomically Driven Strategies for High-Dimensional Brain Image Warping and Pathology Detection","3816564":"Bayesian Structure From Motion","220146001":"Statistical M-Estimation and Consistency in Large Deformable Models for Image Warping","259178274":"Boundary reconstruction in binary images using splines","277934274":"Image contour based on context aware in complex wavelet domain","225580838":"A SAEM algorithm for the estimation of template and deformation parameters in medical image sequences","4243988":"Sonar image segmentation using snake models based on cellular neural network","242913324":"A Nonlinear Variational Problem for Image Matching","4082281":"2D-Shape Analysis Using Conformal Mapping","228559303":"An Introduction to Brain Warping","3560558":"A Hierarchical statistical framework for the segmentation of deformable objects in image sequences","234796454":"Computational anatomy: An emerging discipline","277198044":"Dynamic Data-Driven Deformable Reduced Models for Coherent Fluids","50981205":"Adaptive Error Modelling in MCMC Sampling for Large Scale Inverse Problems","228028872":"Spatial Registration of Images","233009027":"Image warping and Bayesian reconstruction with grey-level templates","2466885":"Economical Representation of Image Deformation Functions Using a Wavelet Mixture Model","255598936":"Image Database Exploration: Progress and Challenges","4070488":"Stochastic models in image analysis: parameter estimations and case studies in image segmentation","226149650":"Elastic matching of very large digital images on high performance clusters","220146549":"Morphological analysis of discrete random shapes. J Math Imaging Vis 2(2/3):193-215","2660419":"Shape-Based Retrieval: A Case Study with Trademark Image Databases","238675540":"FITTING OF DEFORMABLE TEMPLATES FOR LANE BOUNDARY DETECTION","5583930":"Joint Solution of Low, Intermediate, and High-Level Vision Tasks by Evolutionary Optimization: Application to Computer Vision at Low SNR","3665989":"3D boundary extraction of the left ventricle by a deformable modelwith a priori information","279720670":"Spatial Normalization","278303969":"Existence and Consistency of Wasserstein Barycenters","2355288":"Markov chain Monte Carlo in image analysis","257334059":"Aircraft classification with a low resolution infrared sensor","255652163":"Development of a Unified Probabilistic Framework for Segmentation and Recognition of Semi-Rigid Objects in Complex Backgrounds via Deformable Shape Models","220600743":"An efficient 2D deformable objects detection and location algorithm","2466983":"A Wavelet Mixture Approach to the Estimation of Image Deformation Functions","234489720":"On-line re-optimization of prostate IMRT plan for adaptive radiation therapy: A feasibility study and implementation","4772046":"A penalized likelihood approach to image warping","2242724":"Handwritten Digit Recognition via Deformable Prototypes","226871554":"Medical Image Registration","220642735":"Random Planar Shapes and Their Statistical Recognition.","242432761":"3~ brain mapping using a deformable neuroanatomy","4772035":"Nonparametric maximum likelihood estimation for shifted curves","2372265":"Detection of Curved Road Edges in Radar Images Via Deformable Templates","45286973":"Unbiased average age-appropriate atlases for pediatric studies","227055367":"The Joy of Sampling","38349510":"Bayesian object recognition with Baddeley\u0027s Delta Loss","220184464":"A Search Engine for 3D Models","242254560":"Markov Chain Monte Carlo Methods for Statistical Inference","224196557":"Optimal Feature Set for Automatic Detection and Classification of Underwater Objects in SAS Images","238726312":"Deformationsbasierte Morphometrie - eine Methode zur Analyse hirnstruktureller Ver ¨ anderungen","220647348":"Nonrigid registration of medical image by linear singular blending techniques","2499760":"Backfitting in smoothing spline ANOVA, with application to historical global temperature data","13973580":"Matching a Computerized Brain Atlas to Multimodal Medical Images","2560702":"Geometric Analysis of Continuous, Planar Shapes","24163818":"Expectations of Random Sets and Their Boundaries Using Oriented Distance Functions","221364650":"Shape evolution for rigid and nonrigid shape registration and recovery","221119410":"Analysis of cloudy structures evolution on meteorological satellite acquisitions.","227068183":"Models for Image Interpolation Based on the Optical Flow","3085488":"Near-Optimal Detection of Geometric Objects by Fast Multiscale Methods","34567341":"Deformable Shape Models For Anatomy","220499843":"Neural Networks and the Bias/Variance Dilemma","3885212":"Segmentation of a road from a vehicle-mounted radar and accuracy of the estimation","226209756":"A framework for computational anatomy","271943325":"Dynamic image analysis using Bayesian shape and texture models","51959219":"Distribution\u0027s template estimate with Wasserstein metrics","23645124":"Likelihood ratio tests for equality of shape under varying degrees of orientation invariance","275634880":"Predefined pattern detection in large time series","2738823":"Segmentation of the Sea Floor in Øresund using Deformable Templates in Feature Space","12890218":"Nonlinear spatial normalization using basis functions","4741880":"A Statistical Model for Signature Verification","228330285":"4D CT image reconstruction with diffeomorphic motion model","263319813":"Shape Analysis of Planar Multiply-Connected Objects Using Conformal Welding","2422417":"Statistical Models For Shapes And Deformations","246341144":"Graphical Templates for Image Matching","283447890":"Arxiv WasserTest Final","221911424":"Mean Pattern Estimation of Images Using Large Diffeomorphic Deformations","225507790":"Effects of stimulus transformations on estimates of sensory neuron selectivity","252147654":"Measuring, mapping, and modeling brain structure and function","48185373":"Group Invariant Scattering","275281067":"Splines for Diffeomorphisms","228800869":"Bayesian Flexible Shape Matching with Applications to Structural Proteomics","10651755":"Volume-Preserving Nonrigid Registration of MR Breast Images Using Free-Form Deformation with an Incompressibility Constraint","2386669":"Disease-Specific Brain Atlases","228415319":"On Medical Image Registration","2362612":"Bayesian Registration Of Models Using Fem Eigenmodes","241872570":"Applications of Stochastic Geometry in Image Analysis","261274435":"Robust image matching for irregular illumination variation based on spatio-temporal analysis of image intensity","220659700":"Diffeomorphisms Groups and Pattern Matching in Image Analysis","233941794":"Hierarchical Object Parsing from Structured Noisy Point Clouds","238125285":"A Variational Problem Arising from Speech Recognition","21092756":"Neuroimaging in Alzheimer\u0027s disease.","253913076":"Hierarchical Object Parsing from Noisy Point Clouds","254287358":"Estimation of Lag in Misregistered, Averaged Images","255645675":"Gaussian random field models for spatial data","257896836":"Dust collector localization in trouble of moving freight car detection system","221128691":"Image segmentation using GMRF models: parameters estimation and applications.","2650312":"Priors on Scale-Space Templates","281298980":"A statistical analysis of a deformation model with Wasserstein barycenters : estimation procedure and goodness of fit test","271943892":"An Algorithm for the Detection and Measurement of Rail Surface Defects","3192530":"Vehicle segmentation and classification using deformable templates","3327190":"Unsupervised contour representation and estimation using B-splines and a minimum description length criterion","227308904":"Shape statistics and image analysis","3192534":"A deformable template approach to detecting straight edges in radar images","3193046":"Statistical region snake-based segmentation adapted to different physical noise models","220132345":"Local Geometry of Deformable Templates","10635338":"Non-linear registration for brain images by maximising feature and intensity similarities with a Bayesian framework","229088078":"MCMC in image analysis","269723902":"A parametric registration model for warped distributions with Wasserstein’s distance","3154654":"An Algorithm for Detecting Roads and Obstacles in Radar Images","250048022":"Toward a coherent statistical framework for dense deformable template estimation","3192518":"Graphical templates for model registration","3192521":"Object matching using deformable templates","260648304":"Analysis of Variance in Statistical Image Processing","3220685":"A surface-based technique for warping 3-dimensional images of the brain","2368804":"Paper Number 648","47792089":"Intrinsic Bayesian Active Contours for Extraction of Object Boundaries in Images","221401648":"Elastic Model Based Non-rigid Registration Incorporation Statistical Shape Information.","232034512":"A shape-recognition model using dynamical links","12011966":"Maps of the Brain","265433307":"Consistent Atlas Estimation on BME Template Model: Applications to 3D Biomedical Images","222531663":"Knowledge modelling for the motion detection task: The algorithmic lateral inhibition method","220659754":"Image Registration of Sectioned Brains","220284972":"Elastic registration of brain images on large PC-Clusters","11380156":"A shape-space-based approach to tracking myocardial borders and quantifying regional left-ventricular function applied in echocardiography. IEEE Trans Med Imaging","228525709":"SOME APPROACHES TO SHAPE ANALYSIS","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","280041892":"TEMPLATE-BASED STATISTICAL SHAPE MODELLING ON DEFORMATION SPACE","51055133":"Physical Phenomenology of Phyllotaxis","220875827":"Large-Deformation Image Registration Using Fluid Landmarks.","238834469":"Fast inversion of matrices arising in image processing","3854112":"Learning from one example through shared densities on transforms","220728882":"Deformable Templates for Tracking and Analysis of Intravascular Ultrasound Sequences.","244465550":"Iterative Multigrid Regularization Techniques for Image Matching","221362734":"Metropolis-Hasting techniques for finite element-based registration","2821940":"A 3D Deformable Magnetic Resonance Textbook Based on Elasticity","265566961":"Empiricism and the Epistemic Status of Imaging Technologies","283379137":"Bayesian Framework for Image Registration Using Eigenfunctions","235011369":"Image Acquisition and Processing Equipment for Machine Vision","3618073":"Vehicle segmentation using deformable templates","2245395":"Deformations, Warping and Object Comparison - A tutorial","271808768":"Partition Models in the Analysis of Autoradiographic Images","3783951":"Segmentation of road edges from a vehicle-mounted imaging radar","8174923":"(3D) Brain mapping using a deformable neuroanatomy","239848816":"POSITIONAL UNCERTAINTY IN MAP OPERATIONS","220728851":"Adaptive Parametrically Deformable Contours.","24180300":"Invariant template matching in systems with spatiotemporal coding: A matter of instability","2837270":"A Statistical Model for Signatures","2833771":"Deformable Markov Model Templates for Time-Series Pattern Matching","279432677":"Chapter 8. Template Matching","222493697":"A Hierarchical Markov Modeling Approach for the Segmentation and Tracking of Deformable Shapes","227617986":"Three-dimensional Bayesian image analysis and confocal microscopy","12350428":"Staib, L.H.: Physical model based non-rigid registration incorporating statistical shape information. Med. Image Anal. 4, 7-20","7788308":"Unified Segmentation","254287439":"Bayesian Faces via Hierarchical Template Modeling","30967984":"Bayesian Object Identification","266268855":"Digital image analysis. Selected techniques and applications. Incl. 1 CD-ROM","2388808":"Large-Deformation Image Registration using Fluid Landmarks","37992751":"Learning from one example in machine vision by sharing probability densities","227896571":"Image registration using a symmetric prior - In three dimensions","2658136":"Integrated Approaches to Non-Rigid Registration in Medical Images","220654678":"A multi-scale template method for shape detection with bio-medical applications","1768809":"Bayesian Deformable Models Building via Stochastic Approximation Algorithm: A Convergence Study","221400646":"Nonrigid Image Registration Using Free-Form Deformations with a Local Rigidity Constraint","251465096":"Scale-Space Methods and Regularization for Denoising and Inverse Problems","2827101":"Elastic Image Registration And Pathology Detection","14161839":"Amit, Y.: Graphical shape templates for automatic anatomy detection with applications to MRI brain scans. IEEE Trans. Med. Imaging 16(1), 28-40","2422099":"A Hierarchical Feature Based Deformation Model Applied to 4D Cardiac SPECT Data","286535276":"Statistical Shape Methodology in Image Analysis","24082967":"A review of image-warping methods","262205145":"Pattern recognition methods for thermal drift correction in Atomic Force Microscopy imaging","3559244":"An FPGA-based custom coprocessor for automatic image segmentation applications","288303697":"2D-Shape Analysis Using Conformal Mapping","2307493":"Automatic Analysis of Medical Images Using a Deformable Textbook","2806695":"Deformable Models for Volume Feature Tracking","2356657":"Bayesian Surface Reconstruction from Noisy Images","246898978":"Spatial Registration and Normalization of Images","2827710":"Jump-diffusion processes for the automated understanding of FLIR scenes","220223157":"Simulation by Diffusion on a Manifold with Boundary: Applications to Ultrasonic Prenatal Medical Imaging","223208656":"Learning probabilistic deformation models from image sequences","242405869":"Dieren tial Geometry and Shape Lecture notes","251835037":"Shape Estimation and Object Classification in Images Using Geometric Priors","3705241":"Modelling active contours using neural networks isomorphic to boundaries","229875218":"Structural analysis of spatio‐temporal threshold exceedances","225074376":"Bayesian Technique for Image Classifying Registration","45420311":"Stochastic algorithm for Bayesian mixture effect template estimation","277788968":"ADAC System Design and Its Application to Mine Hunting Using SAS Imagery","12546840":"Image registration using a symmetric prior—in three-dimensions","222520555":"A deformable model for fingerprint matching. Pattern Recogn","263607838":"Spatial Inference for Coherent Geophysical Fluids by Appearance and Geometry","3691410":"MRI-based elastic-mapping method for inter-subject comparison of brain FDG-PET images","254333570":"Analysis of Variance in Statistical Image Processing","2621324":"Segmentation of a Road From a Vehicle-Mounted Radar and Accuracy of the Estimation","2362262":"Fem Eigenmodes As Shape Features","29613687":"Construction of Bayesian Deformable Models via Stochastic Approximation Algorithm: A Convergence Study","2426769":"Model-Based Three-Dimensional Freehand Ultrasound Imaging","29613686":"Stochastic Algorithm For Parameter Estimation For Dense Deformable Template Mixture Model","3135386":"A new axial smoothing method based on elastic mapping","244284218":"Non-Linear Image Registration on PC-Clusters Using Parallel FFT Techniques","257093348":"On advances in differential-geometric approaches for 2D and 3D shape analyses and activity recognition","282841443":"Hierarchical Geodesic Models in Diffeomorphisms","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","265192463":"STATISTICAL SIGNAL PROCESSING APPROACHES TO IMAGE FUSION","220660453":"Computation and analysis of image motion: a synopsis of current problems and methods. Int J Comput Vision","38068102":"The role of image registration in brain mapping","220226276":"2D vector-cycle deformable templates","3782140":"Integrated approaches to non-rigid registration in medical images","2693614":"Variational Problems on Flows of Diffeomorphisms for Image Matching","2793952":"Wavelets in Statistics: Some Recent Developments","220615914":"Automated Analysis and Exploration of Image Databases: Results, Progress, and Challenges.","250737953":"A Comparative Study of Active Contour Models for Boundary Detection in Brain Images","221197053":"A Feature Space for Derivatives of Deformations.","5562242":"Deformable template using large deformation kinematics","224660668":"Bayesian computer vision methods for improved tumor localization and delineation","2811376":"Markov Chain Monte Carlo for Statistical Inference","224642239":"Generative Model and Consistent Estimation Algorithms for Non-Rigid Deformable Models","220646596":"A comparative study of markovian and variational image-matching techniques in application to mammograms","236582906":"Estimation of deformations between distributions by minimal Wasserstein distance","264044633":"Physical model-based non-rigid registration incorporating statistical shape information","243776875":"Spatial Statistics and Bayesian Computing","227599998":"Towards a coherent statistical framework for dense deformable template estimation","224221874":"Deformable CT Registration Using Fourier Basis Functions in 3D","2350546":"Computable Elastic Distances Between Shapes","222467761":"Determining the similarity of deformable shapes. Vision Research, Vol. 38","7368584":"Fingerprint warping using ridge curve correspondences","3193291":"Aircraft detection: A case study in using human similarity measure","242408845":"Registration of Brain Images for Statistical Study","5560235":"Multiscale stochastic image model for automated inspection"},"index":927}