{"abs":"There has been much recent interest in Bayesian image analysis, including such topics as removal of blur and noise, detection of object boundaries, classification of textures, and reconstruction of two- or three-dimensional scenes from noisy lower-dimensional views. Perhaps the most straightforward task is that of image restoration, though it is often suggested that this is an area of relatively minor practical importance. The present paper argues the contrary, since many problems in the analysis of spatial data can be interpreted as problems of image restoration. Furthermore, the amounts of data involved allow routine use of computer intensive methods, such as the Gibbs sampler, that are not yet practicable for conventional images. Two examples are given, one in archeology, the other in epidemiology. These are preceded by a partial review of pixel-based Bayesian image analysis.","title":"Bayesian Image Restoration With Two applications In Spatial Statistics","id":24052037,"url":"https://www.researchgate.net/publication/24052037_Bayesian_Image_Restoration_With_Two_applications_In_Spatial_Statistics","names":["Julian Besag","Jeremy York","Annie Mollié","Annals of the Institute of Statistical Mathematics"],"references":{"244446162":"Tutorial in Pattern Theory","230837921":"Exact maximum a posterior estimation for binary images","233950933":"On the Statistical-Analysis of Dirty Pictures","237128102":"Markov random field image models and their applications to computer vision","232841830":"Digital Image Processing","240355956":"Towards Bayesian Image Analysis","289221530":"Bayesian mapping of mortality rates","224839692":"Spatial Interaction and the Statistical Analysis of Lattice Systems","246154631":"Extra-Poisson Variation in Log-Linear Models","3191805":"Boundary detection by contrained optimization","228083862":"Digital Image Processing","243769716":"“The Statistical Analysis of Non-Lattice Data.”","3191588":"Spatial classification using fuzzy membership models","19497758":"“Empirical Bayes Estimates of Age-Standardized Relative Risk for Use in Disease Mapping.”","30962626":"Intrinsic Autoregressions and Related Models on the Two-Dimensional Lattice","243667034":"Statistical methods for tomographic image reconstruction","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","248018710":"The spatial analysis of site phos-phate data","3220206":"Green, P.J.: Bayesian reconstructions from emission tomography data using a modified EM algorithm. IEEE Trans. Med. Imaging 9(1), 84-93"},"citedIn":{},"index":928}