{"abs":"Simple Monte Carlo significance testing has many applications, particularly in the preliminary analysis of spatial data. The method requires the value of the test statistic to be ranked among a random sample of values generated according to the null hypothesis. However, there are situations in which a sample of values can only be conveniently generated using a Markov Chain, initiated by the observed data, so that independence is violated. This paper describes two methods that overcome the problem of dependence and allow exact tests to be carried out. The methods are applied to the Rasch model, to the finite lattice Ising model and to the testing of association between spatial processes. Power is discussed in a simple case.","title":"Generalized Monte Carlo Significance Tests","id":232128380,"url":"https://www.researchgate.net/publication/232128380_Generalized_Monte_Carlo_Significance_Tests","names":["Julian E. Besag","Peter Clifford","Biometrika"],"references":{"245580674":"Barnard\u0027s Monte Carlo Tests: How Many Simulations?","264958061":"“A Simplified Monte Carlo Significance Test Procedure","38360000":"Finite Sample Properties and Asymptotic Efficiency of Monte Carlo Tests","224839692":"Spatial Interaction and the Statistical Analysis of Lattice Systems","232128382":"Simple Monte Carlo Tests for Spatial Pattern","235213931":"Computers and Unconventional Test-Statistics","246868729":"Monte Carlo Calculations of the Radial Distribution Functions for a Proton?Electron Plasma","230663819":"Statistical Analysis of Spatial Point Pattern","240430178":"“Some Methods of Statistical Analysis for Spatial Data.”","226813042":"Monte Carlo calculation of phase separation in a two-dimensional Ising system","271758149":"Variation in Yield Among Competing Individuals within Mixed Genotype Stands of Tea: A Selection Problem","30962626":"Intrinsic Autoregressions and Related Models on the Two-Dimensional Lattice","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741"},"citedIn":{"242394738":"Detection of Spatial and Spatio-Temporal Clusters","267046379":"Sequential Importance Sampling for Two-dimensional Ising Models","267120362":"Multicanonical MCMC for sampling rare events: An illustrative review","267467507":"Sequential Screening in Semiconductor Manufacturing, I: Exploiting Spatial Dependence","245578912":"Valid p-Values using Importance Sampling","241552737":"Exact evaluation of bias in Rasch model residuals","247742913":"On Local Homogeneity and Stochastically Ordered Mixed Rasch Models","243781005":"20 The art of computer generation of random variables","269721887":"The switch Markov chain for sampling irregular graphs","5771092":"Exact Sample Size Needed to Detect Dependence in 2 × 2 × 2 Tables","222090032":"Archaeology, Mass Graves, and Resolving Commingling Issues through Spatial Analysis","243048305":"Multivariate process capability: A Bayesian perspective","220286764":"Markov chain Monte Carlo exact inference for binomial and multinomial logistic regression models","227498370":"Residual Analysis for Spatial Point Processes (with Discussion)","263556280":"Pregnancy patterns of pantropical spotted dolphins (Stenella attenuata) in the eastern tropical Pacific determined from hormonal analysis of blubber biopsies and correlations with the purse-seine tuna fishery","4741702":"Sequential Monte Carlo Methods for Statistical Analysis of Table","232226245":"Conservative hypothesis tests and confidence intervals using importance sampling","220649777":"Building a prototype Geographical Correlates Exploration Machine","226630549":"The relationship between climate and outbreak characteristics of the spruce budworm in eastern Canada","275891817":"Global envelope tests for spatial processes","251680282":"215. Vascularized bone marrow transplantation extends survival of vascularized skin allografts","45855136":"A Dynamic Programming Approach for Approximate Uniform Generation of\nBinary Matrices with Specified Margins","236101902":"Establishing Likelihood Ratios for Patterned Garment Comparisons from Seam Measurement Data(.)","228984194":"Social network analysis and valid Markov chain Monte Carlo tests of null models","239560803":"MATHEMATICAL ENGINEERING TECHNICAL REPORTS The list of indispensable moves of the unique minimal Markov basis for 3 4 K and 4 4 4 contingency tables with xed two-dimensional marginals","243770531":"Monte Carlo Exact Tests for Square Contingency Tables","279352961":"Metropolis Methods, Gaussian Proposals and Antithetic Variables","24065350":"A Simulation-Intensive Approach for Checking Hierarchical Models","283208910":"Advance care planning as a shared endeavor: completion of ACP documents in a multidisciplinary cancer program","225104218":"Testing the cascade model for food webs","228092072":"Sampling From A Manifold","229464731":"A review of point pattern methods for spatial modelling of events around sources of pollution","263496578":"Simple Methods for Simulating Sociomatrices with Given Marginal Totals","220766239":"Assessing Data Mining Results on Matrices with Randomization","227621033":"Minimal Basis for a Connected Markov Chain over 3 × 3 ×K Contingency Tables with Fixed Two‐Dimensional Marginals","228832411":"Small, short duration technical team dynamics","248978159":"Decision rule-based approach to automatic tree crown detection and size classification","238472463":"16 Rasch Models","220345115":"Assessing data mining results via swap randomization","261490095":"Assessing the Significance of Data Mining Results on Graphs with Feature Vectors","24063314":"“Logit Models and Logistic Regressions for Social Networks: III. Valued Relations.”","285304894":"10 Ecological statistics","251546561":"Reconstructing climate variability on the northeastern Tibetan Plateau since the last Lateglacial - a multi-proxy, dual-site approach comparing terrestrial and aquatic signals. Quat Sci Rev","279365606":"Simple Monte Carlo P-Values","262874351":"The influence of forest composition and climate on outbreak characteristics of the spruce budworm in eastern Canada","31476135":"Biometrika Centenary: Nonparametrics","246125536":"Exact methods and Markov chain Monte Carlo methods of conditional inference for contingency tables","241735460":"On Generalized Score Tests","51560031":"A Stochastic Version of the Brass PF Ratio Adjustment of Age-Specific Fertility Schedules","34334790":"Food web analysis of macrobenthic riffle communities /","38348807":"Markov chains for Monte Carlo tests of genetic equilibrium in multidimensional contingency","45869813":"Connecting Tables with Zero-One Entries by a Subset of a Markov Basis","225465151":"Null matrices and the analysis of species co-occurences","2927741":"Invariant minimal Markov basis for sampling contingency tables with fixed marginals","23633465":"Comparisons of spatially correlated binary data","259554345":"Are there biases in biopsy sampling? Potential drivers of sex ratio in projectile biopsy samples from two small delphinids","228977399":"Computing Exact P-values in Incomplete Multi-way Tables","261680076":"On the enumeration of rectangular (0, 1)-matrices","220271988":"Tell Me Something I Don’t Know: Randomization Strategies for Iterative Data Mining","251408299":"An Introduction to Markov Chain Monte Carlo Methods","248152466":"Statistical analysis of occupancy rates for overdispersed populations by redistribution procedures: Application to the european corn borer EGG masses distribution","226700760":"Social network analysis and valid Markov chain Monte Carlo tests of null models. Behav Ecol Sociobiol","24063537":"Exact tests for the Rasch model via sequential importance sampling","51955323":"Semigroups and sequential importance sampling for multiway tables and\nbeyond","267930268":"Spatiotemporal Conditional Inference and Hypothesis Tests for Neural Ensemble Spiking Precision","221336148":"Preservation of Statistically Significant Patterns in Multiresolution 0-1 Data","4746529":"Evolutionary Similarity Among Genes","227686395":"Permutation Models for Relational Data","227727352":"Bayesian Sample Size Calculations for Hypothesis Testing","235713633":"Exact Goodness‐of‐Fit Tests for Markov Chains","272587601":"Aggregation Patterns of Pelagic Predators and their Principal Prey, Antarctic Krill, near South Georgia","225911303":"A short history of algebraic statistics","220198510":"Randomization methods for assessing data analysis results on real-valued matrices","223803685":"Avoiding spurious findings of nonrandom social structure in association data","227799783":"Habitat use by beech martens in a fragmented landscape","241210649":"Exact tests of the Rasch model based on scalability coecients","2870866":"The list of indispensable moves of the unique minimal Markov basis for 3 × 4 × K and 4 × 4 × 4 contingency tables with fixed two-dimensional marginals","282576046":"Estimación de pautas de asociación y patrones de distribución de edificaciones aisladas en espacios rurales mediante SIG y técnicas basadas en procesos puntuales","23692053":"An Efficient MCMC Algorithm to Sample Binary Matrices with Fixed Marginals","220907092":"Evaluating Query Result Significance in Databases via Randomizations","2128223":"Sequential importance sampling for multiway tables","229797681":"Field test for correlates of dispersal in hedgehogs (Erinaceus europaeus)","51944604":"A polynomial bound on the mixing time of a Markov chain for sampling\nregular directed graphs","228768037":"Analysing spatial point patterns in R","268887681":"Permutation, Parametric, Bootstrap Tests of Hypotheses","288988339":"Reconstructing Environmental Impacts of Fire from the Holocene Sedimentary Record","220907169":"Randomization Techniques for Graphs","290368450":"Applications of Monte Carlo Methods in Spatial and Image Analysis","37675955":"A Geometric Approach for Inference on Graphical Models","227944728":"On the statistical analysis of vegetation change: a wetland affected by water extraction and soil acidification. J Veg Sci 5:361-372","269162884":"Seasonal Patterns of Mixed Species Groups in Large East African Mammals","2558391":"Markov chain Monte Carlo exact tests for incomplete two-way contingency tables","242254560":"Markov Chain Monte Carlo Methods for Statistical Inference","222089901":"A Companion to Forensic Anthropology","259744488":"Corrigendum to \"Quantitative reconstruction of precipitation changes on the NE Tibetan Plateau since the Last Glacial Maximum – extending the concept of pollen source area to pollen-based climate reconstructions from large lakes\" published in Clim. Past, 10, 21–39, 2014","266561146":"Exact goodness-of-fit testing for the Ising model","45859617":"Query Significance in Databases via Randomizations","27531832":"Annealing and Tempering for Sampling and Counting","50853531":"Dynamic Markov Bases","5142992":"The Rasch Sampler","233755249":"Responses of oribatid mite communities to summer drought: The influence of litter type and quality","229222921":"11 Spatial statistical methods for environmental epidemiology","220764810":"Testing the Significance of Patterns in Data with Cluster Structure","2264193":"Assessing the Order of Dependence for Partially Exchangeable Binary Data","254287501":"Confidence Intervals From Monte Carlo Tests","49855327":"Bayes computation for ecological inference","265582195":"Sampling large tables with constraints","23990982":"Estimate-based goodness-of-fit test for large sparse multinomial distributions","227610939":"Permutation Tests for Linear Models","23475404":"Diversity and Seasonality of Bioluminescent Vibrio cholerae Populations in Chesapeake Bay","243963942":"Global envelope tests for spatial processes","5207521":"Fuzzy p-values in latent variable problems. Biometrika 94: 49-60","6015470":"Sampling for Conditional Inference on Case-Control Data","230744185":"The relationship of environmental factors to the structure and distribution of subtidal seaweed vegetation of the western Basque coast (N Spain). Estuar Coast Shelf Sci 56(5-6):1041-1054","24052946":"Minimal invariant Markov basis for sampling contingency tables with fixed marginals","200734795":"Swap algorithms in null model analysis","226077639":"Simulating posterior Gibbs distributions: a comparison of the Swendsen-Wang and Gibbs sampler methods","220345500":"Exact sampling with couple Markov chains and applications to statistical mechanics","51245491":"A rank-based statistical test for measuring synergistic effects between two gene sets","24253106":"Monte Carlo tests of the Rasch model based on scalability coefficients","227602517":"Sampling Binary Contingency Tables with a Greedy Start","248579092":"The Statistical Analysis of Artefacts in Graves: Presence and Absence Data","46307591":"Associations Between the Drill (Mandrillus leucophaeus) and Sympatric Monkeys in Korup National Park, Cameroon","51959764":"Semigroups and sequential importance sampling for multiway tables","21517700":"Performing the Exact Test of Hardy-Weinberg Proportion for Multiple Alleles","216812577":"Spatial Autocorrelation: Trouble or New Paradigm?","2627559":"An Interruptible Algorithm for Perfect Sampling via Markov Chains","259655592":"Open Access Quantitative reconstruction of precipitation changes on the NE Tibetan Plateau since the Last Glacial Maximum - extending the concept of pollen source area to pollen-based climate reconstructions from large lakes","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","2489072":"Serkan Hosten","254078193":"A Note on Item–Restscore Association in Rasch Models","24063416":"Nonparametric goodness-of-fit tests for the Rasch model","228361028":"Terrestrial and aquatic responses to climate change and human impact on the southeastern Tibetan Plateau during the past two centuries","2811376":"Markov Chain Monte Carlo for Statistical Inference","226842463":"Ladau, J. Validation of null model tests using Neyman–Pearson hypothesis testing theory. Theoretical Ecology","45928032":"Characterizing Optimal Sampling of Binary Contingency Tables via the\nConfiguration Model","46582053":"Combining individually valid and conditionally i.i.d. P-variables","24063372":"“Network Models for Social Influence Processes.”","2232769":"Bayesian Checking of the Second Levels of Hierarchical Models","4745377":"Discovering Combinations of Genomic Aberrations Associated With Cancer","243776875":"Spatial Statistics and Bayesian Computing","51090918":"Participation in Fitness-Related Activities of an Incentive-Based Health Promotion Program and Hospital Costs: A Retrospective Longitudinal Study","254314456":"Markov Chains, Quotient Ideals, and Connectivity with Positive Margins","223904424":"Network Models for Social Selection Processes","5175999":"Sequential screening in semiconductor manufacturing","40209302":"A hierarchical set of models for species response models. J Veg Sci 4:37-46","266856210":"Differential expression analysis for multiple conditions","265993763":"Gentle. Elements of Computational Statistics","247927869":"The Many Faces of Logistic Regression","220907216":"Randomization of real-valued matrices for assessing the significance of data mining results","234140175":"Importance sampling for weighted binary random matrices with specified\nmargins","265094193":"Fast randomization of large genomic datasets while preserving alteration counts","263016017":"Maximum linkage space-time permutation scan statistics for disease outbreak detection","222089920":"A Companion to Forensic Anthropology","253045995":"Analysis of sparse contingency tables: Monte Carlo estimation of exact P-values"},"index":930}