{"abs":"MCMC algorithms such as Metropolis-Hastings algorithms are slowed down by the computation of complex target distributions as exemplified by huge datasets. We offer in this paper an approach to reduce the computational costs of such algorithms by a simple and universal divide-and-conquer strategy. The idea behind the generic acceleration is to divide the acceptance step into several parts, aiming at a major reduction in computing time that outranks the corresponding reduction in acceptance probability. The division decomposes the \"prior x likelihood\" term into a product such that some of its components are much cheaper to compute than others. Each of the components can be sequentially compared with a uniform variate, the first rejection signalling that the proposed value is considered no further, This approach can in turn be accelerated as part of a prefetching algorithm taking advantage of the parallel abilities of the computer at hand. We illustrate those accelerating features on a series of toy and realistic examples.","title":"Accelerating Metropolis-Hastings algorithms: Delayed acceptance with prefetching","id":263012108,"url":"https://www.researchgate.net/publication/263012108_Accelerating_Metropolis-Hastings_algorithms_Delayed_acceptance_with_prefetching","names":["Marco Banterle","Clara Grazian","Christian P. Robert"],"references":{"238879805":"Markov chain Monte Carlo Using an Approximation","38357609":"Markov Chains for Exploring Posterior Distributions","236235190":"Austerity in MCMC Land: Cutting the Metropolis-Hastings Budget","47373174":"Using Parallel Computation to Improve Independent Metropolis–Hastings Based Estimation","243765314":"Estimation of nite mixture distributions by Bayesian sampling","259334992":"Parallel MCMC via Weierstrass Sampler","43481745":"Finite Mixture Model","2787469":"Markov Chain Monte Carlo Methods Based on `Slicing\u0027 the Density Function","46494018":"Efficient parallelisation of Metropolis-Hastings algorithms using a prefetching approach","232062873":"Efficient implementation of Markov chain Monte Carlo when using an unbiased likelihood estimator","48213072":"The Theory of Probability","38327033":"Markov Chain Monte Carlo Methods and the Label Switching Problem in Bayesian Mixture Modeling","2316151":"Bayesian Methods for Mixtures of Normal Distributions","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","41222435":"Monte Carlo Statistical Method","258631741":"Asymptotically Exact, Embarrassingly Parallel MCMC","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","261683938":"Parallel Markov chain Monte Carlo Simulation by Pre-Fetching","261217260":"Accelerating MCMC via Parallel Predictive Prefetching","243739482":"Efficient Metropolis Jumping Rules","2821588":"Practical Bayesian Density Estimation Using Mixtures Of Normals"},"citedIn":{"268747974":"Big Learning with Bayesian Methods","280033955":"Scalable MCMC for Large Data Problems using Data Subsampling and the Difference Estimator","283273878":"Tractable Bayesian teaching"},"index":933}