{"abs":"The most common way to sample from a probability distribution is to use Monte-Carlo methods. For distributions on a continuous state space, one can find diffusions with the target distribution as equilibrium measure, so that the state of the diffusion after a long time provides a good sample from the desired distribution. There exist many diffusions with a common equilibrium, and one would naturally like to choose those that make the convergence to equilibrium faster. One way to do this is to consider a reversible diffusion, and add to it an antisymmetric drift which preserves the invariant measure. It has been proven that, in general, the irreversible algorithm performs better than the reversible one, in that the spectral gap is larger. In the present work, asymptotic variance is used as the criterion to compare these algorithms. We first provide a general comparison result, and then apply it to the specific cases of a diffusion on $\\mathbb{R}^d$, or on a compact Riemannian manifold. We prove that, in general, adding an antisymmetric drift to a reversible diffusion reduces the asymptotic variance. We also provide some extensions of this result concerning strict inequality, the worst-case analysis, and the behavior of the asymptotic variance when the drift goes to infinity.","title":"Variance reduction for diffusions","id":263237778,"url":"https://www.researchgate.net/publication/263237778_Variance_reduction_for_diffusions","names":["Chii-Ruey Hwang","Raoul Normand","Sheng-Jhih Wu","Stochastic Processes and their Applications"],"references":{"239168579":"L^p-Regularity for Elliptic Operators with Unbounded Coefficients","248390410":"Methods of Modem Mathematical Physics, Vol. II: Fourier Analysis, Self-Adjointness","226482809":"On the functional central limit theorem and the law of the iterated logrithm for Markov processes","239059448":"Methods of Modern Mathematical Physics: Analysis of Operator, Vol. IV","2119719":"Accelerating diffusions. Ann Appl Prob","48445551":"Fluctuations in Markov Processes","266548595":"Theory of linear operators in Hilbert space. Transl. from the Russian and with a preface by Merlynd Nestell (Two volumes bound as one). Repr. of the 1961 and 1963 transl","261289218":"Irreversible Langevin samplers and variance reduction: A large deviations approach","227623232":"Markov Chain Monte Carlo Method and its applications","264969176":"On the Optimal Transition Matrix for Markov Chain Monte Carlo Sampling","38362909":"Accelerating Gaussian Diffusions","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","240474944":"Methods of Modern Mathematical Physic. Vol. I: Functional Analysis","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","2287413":"On non-reversible Markov chains","38326864":"Ordering and Improving the Performance of Monte Carlo Markov Chains","38362960":"Optimal Spectral Structure of Reversible Stochastic Matrices, Monte Carlo Methods and the Simulation of Markov Random Fields","243080864":"The behavior of the spectral gap under growing drift","268244829":"Lunardi, A.: On the Ornstein-Uhlenbeck operator in L 2 spaces with respect to invariant measures. Trans. Am. Math. Soc. 349, 155-169","257013104":"Accelerating Brownian motion on NN-torus","265957182":"Heat kernel and analysis on manifolds","222541412":"Efficiency of finite state space Monte Carlo Markov chains","266004722":"Accelerating reversible Markov chains","281388274":"Accelerating diffusions","285364218":"Biometrika"},"citedIn":{"278733910":"Variance Reduction using Nonreversible Langevin Samplers"},"index":934}