{"abs":"The Multipoint Expected Improvement criterion (or q-EI) has recently been stud-ied in batch-sequential Bayesian Optimization. This paper deals with the new way of computing q-EI, without using Monte-Carlo simulations, through a new closed-form formula. The latter allows a very fast computation of q-EI for reasonably low values of q (typically, less than 10). New parallel kriging-based optimization strategies, tested on a 6-dimensional toy example, show promising results.","title":"Fast Computation of the Multi-Points Expected Improvement with Applications in Batch Selection","id":258831560,"url":"https://www.researchgate.net/publication/258831560_Fast_Computation_of_the_Multi-Points_Expected_Improvement_with_Applications_in_Batch_Selection","names":["Clément Chevalier"],"references":{"216301381":"The Design and Analysis Computer Experiments","242922491":"Bayesian Approach to Global Optimization--Theory and Applications","29608194":"Real-Parameter Black-Box Optimization Benchmarking 2009: Noisy Functions Definitions","277072736":"MULTIPLES MÉTAMODÈLES POUR L\u0027APPROXIMATION ET L\u0027OPTIMISATION DE FONCTIONS NUMÉRIQUES MULTIVARIABLES","265221736":"Parallel expected improvements for global optimization: summary, bounds and speed-up","267264742":"Expected Improvements for the Asynchronous Parallel Global Optimization of Expensive Functions : Potentials and Challenges","265010241":"Real-Parameter Black-Box Optimization Benchmarking 2009: Presentation of the Noisy Functions","228077459":"Geostatistics: Modeling Spatial Uncertainty. Wiley, New York","267178407":"Gaussian process modeling with inequality constraints","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","2463953":"Numerical Computation Of Multivariate Normal Probabilities","229190397":"Multivariate Normal and t Distributions","263047835":"Computation of Multivariate Normal and Probabilities","247932223":"The Moment Generating Function of the Truncated Multi-Normal Distribution","216301406":"Computer Experiments and Global Optimization","241735314":"The Moment-Generating Function and Negative Integer Moments","248818761":"The application of Bayesian methods for seeking the extremum","215992257":"Genetic Optimization Using Derivatives: The rgenoud Package for R","278821472":"DiceKriging, DiceOptim: two R packages for the analysis of computer experiments by kriging-based metamodelling and optimization"},"citedIn":{"278815822":"Fast integration of multi-point improvements","281128487":"A new expected-improvement algorithm for continuous minimax optimization","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","264936662":"A new integral loss function for Bayesian optimization","281320363":"Multi-point Efficient Global Optimization using Niching Evolution Strategy"},"index":937}