{"abs":"We present a new adaptive delayed-acceptance Metropolis-Hastings algorithm (ADAMH) that adapts to the error in a reduced order model to enable efficient sampling from the posterior distribution arising in complex inverse problems. This use of adaptivity differs from existing algorithms that tune proposals of the Metropolis-Hastings algorithm (MH), though ADAMH also implements that strategy. We build on the recent simplified conditions given by Roberts and Rosenthal (2007) to give practical constructions that are provably convergent to the correct target distribution. The main components of ADAMH are the delayed acceptance scheme of Christen and Fox (2005), the enhanced error model introduced by Kaipio and Somersalo (2007) as well as recent advances in adaptive MCMC (Haario et al., 2001; Roberts and Rosenthal, 2007). We developed this algorithm for automatic calibration of large-scale numerical models of geothermal reservoirs. ADAMH shows good computational and statistical efficiencies on measured data sets. This algorithm could allow significant improvement in computational efficiency when implementing sample-based inference in other large-scale inverse problems.","title":"Adaptive Error Modelling in MCMC Sampling for Large Scale Inverse Problems","id":50981205,"url":"https://www.researchgate.net/publication/50981205_Adaptive_Error_Modelling_in_MCMC_Sampling_for_Large_Scale_Inverse_Problems","names":["Tiangang Cui","Colin Fox","Michael O\u0027Sullivan"],"references":{"243673478":"Lectures in Pattern Theory I","228614563":"MCMC using an approximation","200622065":"Equation of State Calculations by Fast Computing Machines","4772045":"Bayesian Calibration of Computer Models","253498391":"Statistical inverse problems","230663724":"Statistics for Spatial Data (Revised Edition). Wiley, New York","4771804":"Gaussian Markov Random Fields: Theory and Applications","244475140":"On the ergodicity properties of some adaptive Markov Chain Monte Carlo algorithms","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","228370315":"A review of statistical modelling and inference for electrical capacitance tomography","1737229":"On the Ergodicity of the Adaptive Metropolis Algorithm on Unbounded Domains","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","30962626":"Intrinsic Autoregressions and Related Models on the Two-Dimensional Lattice","242609128":"Structural Image Restoration Through Deformable Templates","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","37790686":"Treatment of input uncertainty in hydrologic modeling: Doing hydrology backward with Markov chain Monte Carlo simulation, Water Resources Research, 44, W00B09","233950933":"On the Statistical-Analysis of Dirty Pictures","227944755":"A Markov Chain Monte Carlo version of the genetic algorithm Differential Evolution: Easy Bayesian computing for real parameter spaces","236433968":"TOUGH2—A General Purpose Numerical Simulator for Multiphase Fluid and Heat Flow","228789130":"Examples of adaptive MCMC","24052037":"Bayesian Image Restoration With Two applications In Spatial Statistics","215446267":"Monte Carlo Strategies in Scientic Computing","51992375":"Parameter and State Model Reduction for Large-Scale Statistical Inverse Problems","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","2538646":"Krylov Projection Methods For Model Reduction","45882123":"Can the Adaptive Metropolis Algorithm Collapse Without the Covariance\nLower Bound?","223461225":"Deformable template models: A review","216301661":"Screening, Predicting, and Computer Experiments","38322292":"An Adaptive Metropolis Algorithm","265999079":"Coloured Voronoi tesselations for Bayesian image analysis and reservoir modelling","263078766":"Monte Carlo errors with less errors","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","223681553":"Bayesian uncertainty quantification for flows in heterogeneous porous media using reversible jump Markov chain Monte Carlo methods","227693396":"Bayesian image analysis with Markov chain Monte Carlo and coloured continuum triangulation models","23644450":"Bayesian Object Identification: Variants","12807310":"Three-dimensional electrical impedance tomography based on the complete electrode model","38322438":"On adaptive Markov chain Monte Carlo algorithms","254511097":"Tenth SPE Comparative Solution Project: A Comparison of Upscaling Techniques","252797252":"Lectures in pattern theory - Volume 1: Pattern synthesis","247195885":"Point-Based Polygonal Models for Random Graphs","245810545":"Coupling and Ergodicity of Adaptive MCMC","46421907":"Bayesian calibration of geothermal reservoir models via Markov Chain Monte Carlo","4993300":"MCMC methods for high dimensional inversion in remote sensing","249900863":"An efficient two-stage Markov chain Monte Carlo method for dynamic data integration","246868205":"Monte Carlo sampling using Markov chains and their applications","220286586":"Dram: efficient adaptive MCMC","225578286":"Markov Chain Monte Carlo methods for conditioning a permeability field to pressure data","38363051":"[Bayesian Computation and Stochastic Systems]: Comment","223012398":"Statistical inverse problems: Discretization, model reduction and inverse crimes","2606787":"On Conditional and Intrinsic Autoregression","2342340":"Fully Bayesian Reconstructions From Single-Photon Emission Computed Tomography Data","3318229":"A Bayesian approach to characterizing uncertainty in inverse problems using coarse and fine-scale information","265892912":"Regular structures. Lectures in pattern theory, Vol. 3","4742946":"Computer Model Calibration Using High-Dimensional Output","243769067":"“Representations of Knowledge in Complex Systems.”","32896153":"Approximation errors and model reduction with an application in optical diffusion tomography","226384784":"On the Histogram as a Density Estimator: L2 Theory","1899891":"Computer model validation with functional output","233717787":"Statistical inversion of South Atlantic circulation in an abyssal neutral density layer","243615858":"Stochastic geometry models in high-level vision","234355471":"Geothermal Reservoir Simulation","4772144":"Bayesian inversion of geoelectrical resistivity data","37606598":"Model reduction of large linear systems via low rank system gramians","227606382":"Bayesian Analysis of the Scatterometer Wind Retrieval Inverse Problem","225860489":"A process-convolution approach to modelling temperatures in the North Atlantic Ocean (Disc: P191-192)","5848742":"BGX: a Bioconductor package for the Bayesian integrated analysis of Affymetrix GeneChips"},"citedIn":{"282608158":"Accelerating Monte Carlo Markov chains with proxy and error models","251425239":"Bayesian calibration of a large-scale geothermal reservoir model by a new adaptive delayed acceptance Metropolis Hastings algorithm","260956800":"Accelerated Bayesian Inference for the Estimation of Spatially Varying Heat Flux in a Heat Conduction Problem","256187243":"A Computational Framework for Infinite-Dimensional Bayesian Inverse Problems, Part II: Stochastic Newton MCMC with Application to Ice Sheet Flow Inverse Problems"},"index":941}