{"abs":"General methods are provided for analyzing the convergence of discrete-time, general state-space Markov chains, such as those used in stochastic simulation algorithms including the Gibbs sampler. The methods provide rigorous, a priori bounds on how long these simulations should be run to give satisfactory results. Results are applied to two models of the Gibbs sampler: a bivariate normal model, and a hierarchical Poisson model (with gamma conditionals). The methods use the notion of minorization conditions for Markov chains.","title":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","id":2868221,"url":"https://www.researchgate.net/publication/2868221_Rosenthal_JS_Minorization_conditions_and_convergence_rates_for_Markov_chain_Monte_Carlo_J_Am_Stat_Assoc_90_558-566","names":["Jeffrey S. Rosenthal","Journal of the American Statistical Association"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","244456594":"Convergence diagnostics of the Gibbs sampler","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","200105001":"Equation of State by Fast Computing Machines","200622065":"Equation of State Calculations by Fast Computing Machines","38362126":"Limit Theorems for Semi-Markov Processes and Renewal Theory for Markov Chains on General State Spaces","2554222":"On the Geometric Convergence of the Gibbs Sampler","240205403":"Random polynomial time algorithms for sampling from joint distributions","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","32012839":"Applied Probability and Queues","221669734":"Equations of State Calculations by Fast Computing Machines","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","38363224":"Inference From Iterative Simulation Using Multiple Sequences","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","226560788":"On coupling of Markov chains","244475332":"On the Convergence of Successive Substitution Sampling","2633151":"Sampling From Log-Concave Distributions","38362960":"Optimal Spectral Structure of Reversible Stochastic Matrices, Monte Carlo Methods and the Simulation of Markov Random Fields","2249534":"Rates of Convergence for Data Augmentation on Finite Sample Spaces","244416205":"A New Approach to the Limit Theory of Recurrent Markov Chains","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","243787289":"Lectures on the Coupling Method","38357609":"Markov Chains for Exploring Posterior Distributions","200111118":"Markov Chains and Stochastic Stability","233971671":"Large Deviation Techniques and Applications","245804736":"Correlation structure and convergence rate of the Gibbs sampler with various scans","239061974":"An Introduction to Probability Theory and Its Applications – Volume I and II","245804744":"Correlation structure and convergence rate of the Gibbs sampler I","244493629":"Rates of convergence of Markov chains related to association schemes","23630599":"Comparing sweep strategies for stochastic relaxation","242505862":"General Irreducible Markov Chains and Non-Negative Operators","2750746":"Regeneration in Markov Chain Samplers","2855903":"Rates of Convergence for Gibbs Sampling for Variance Component Models","232347309":"A slowly mixing Markov chain with implications for Gibbs sampling","243777023":"Eigen Analysis for Some Examples of the Metropolis Algorithm","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","245453658":"Applied Probability and Queueing","222499134":"Rates of convergence for everywhere-positive Markov chains","242353101":"Group Representations in Probability and Statistics"},"citedIn":{"222695237":"Explicit error bounds for lazy reversible Markov chain Monte Carlo","243118712":"The Evolution of Markov Chain Monte Carlo Methods","38326862":"Honest Exploration of Intractable Probability Distributions Via Markov Chain Monte Carlo","233352686":"An Extension of the Metropolis Algorithm","226235248":"Markov Chain Monte Carlo","257147229":"Applications of geometric bounds to the convergence rate of Markov chains on Rn","220395821":"Effects of Chemical Reaction on Two-Dimensional Turbulence","280909487":"Geometric Ergodicity of a Hybrid Sampler for Bayesian Inference of Phylogenetic Branch Lengths.","220743483":"Convergence analysis of gene expression programming based on maintaining elitist.","50991390":"Gibbs/Metropolis algorithms on a convex polytope","225469285":"Stochastic Models as Tools for the Analysis of Decomposition and Crystallisation Phenomena in Solids","2552381":"MCMC Methods for Financial Econometrics","6366333":"An Approximation Method for Solving the Steady-state Probability Distribution of Probabilistic Boolean Networks","265702859":"Geometric Ergodicity of van Dyk and Meng\u0027s Algorithm for the Multivariate Student\u0027s t Model","222658392":"A new approach to estimating the expected first hitting time of evolutionary algorithms","255325480":"Adaptive evolutionary Monte Carlo algorithm for optimization with applications to sensor placement problems","258882417":"Nonlinear Time Series: Theory, Methods and Applications with R Examples","2118656":"Quantitative bounds on convergence of time-inhomogeneous Markov chains","266240506":"Meeting Hausdorff in Monte Carlo: A Surprising tour with antihype fractals","277679273":"Bayesian Computation Via Markov Chain Monte Carlo","38322273":"Markov Chain Monte Carlo Estimation of the Law of the Mean of a Dirichlet Process","237310991":"Asymptotic Variance and Convergence Rates of Nearly-Periodic MCMC Algorithms","225809752":"A distance-based diagnostic for trans-dimensional Markov chains","227606975":"Bayesian Estimation of Dynamic Discrete Choice Models","271513115":"Bounds on regeneration times and convergence rates for Markov chainsfn1fn1Work supported in part by NSF Grant DMS 9504561 and EPSRC grant GR/J19900.","35734552":"Convergence of Markov chain Monte Carlo algorithms with applications to image restoration [microform].","255593734":"Subgeometric rates of convergence of f-ergodic Markov chains","235903537":"Convergence rate of Markov chain methods for genomic motif discovery","2631273":"General Strategies for Assessing Convergence of MCMC Algorithms Using Coupled Sample Paths","269000780":"Bayesian Item Response Modeling: Theory and Applications","220258662":"Stability of Stochastic Approximation under Verifiable Conditions","48167060":"On the Stationary Distribution of Iterative Imputations","227704792":"Bayesian estimation in Kibble\u0027s bivariate gamma distribution","258232111":"Geometric ergodicity of the Bayesian lasso","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","226289457":"Stopping Rules for the Stochastic Nested Partitions Method","225613631":"Basic Ideas ofSpatial Statistics","227512257":"Markov Chains and De‐initializing Processes","287461746":"Genomic signal processing","1772109":"Comment: Gibbs Sampling, Exponential Families, and Orthogonal Polynomials","1772108":"Comment: Gibbs Sampling, Exponential Families and Orthogonal Polynomials","2868848":"Markov Chains and De-initialising Processes","251286174":"Fun with Hard Spheres","224176440":"Stochastic Optimization on Continuous Domains With Finite-Time Guarantees by Markov Chain Monte Carlo Methods","227425256":"One-shot coupling for certain stochastic recursive sequences","280104660":"Elementary Bounds On Mixing Times for Decomposable Markov Chains","239917611":"Efficient reversible jump MCMC for Bayesian object recognition","227425255":"Small sets and Markov transition densities","225828638":"Monte Carlo and Quasi-Monte Carlo for Statistics","229009866":"On Convergent Rate of Genetic Algorithms","265188771":"Computable bounds for subgeometric ergodicity","45864661":"Nonasymptotic bounds on the estimation error for regenerative MCMC algorithms","243047951":"Generalization of discrete-time geometric bounds to convergence rate of Markov processes on Rn","38340154":"A Mixture Representation of π with Applications in Markov Chain Monte Carlo and Perfect Sampling","227390457":"Control Techniques for Complex Networks","277708025":"Markov Chain Monte Carlo (MCMC)Based in part on the article “Markov chain Monte Carlo (MCMC)” by Galin L. Jones and James P. Hobert, which appeared in the Encyclopedia of Environmetrics .","226882559":"Bounding convergence rates for Markov chains: An example of the use of computer algebra","221042512":"Survey on Computational Complexity with Phase Transitions and Extremal Optimization","222499134":"Rates of convergence for everywhere-positive Markov chains","246176978":"A review of asymptotic convergence for general state space Markov chains","2864212":"Possible biases induced by MCMC convergence diagnostics","48198751":"Nonasymptotic Bounds on the Mean Square Error for MCMC Estimates via Renewal Techniques","2857641":"Small and Pseudo-Small Sets for Markov Chains","233387883":"Markov chain Monte Carlo for computing rare-event probabilities for a\nheavy-tailed random walk","226284538":"Markov Chain Monte Carlo Algorithms: Theory and Practice","23418348":"Batch Means and Spectral Variance Estimation in Markov Chain Monte Carlo","237819558":"Des R esultats th eoriques sur les algorithmes","2652325":"Applications Of Cheeger\u0027s Constant To The Convergence Rate Of Markov Chains On R n","229701949":"DNA Double Helix Based Hybrid GA for the Gasoline Blending Recipe Optimization Problem","2847909":"Efficient Use of Exact Samples","228778284":"Transformed and parameter-expanded Gibbs samplers for multilevel linear and generalized linear models","225653731":"Additivity, Convexity and Beyond: Application of Minkowski Functionals in Statistical Physics","2859706":"Convergence of Slice Sampler Markov Chains","2715322":"Sufficient Markov Chains","229099827":"General Methods for Monitoring Convergence of Iterative Simulations","2135733":"Harris Recurrence of Metropolis-Within-Gibbs and Trans-dimensional MCMC Algorithms","222575583":"Rigorous confidence bounds for MCMC under a geometric drift condition","38350549":"On The Geometric Ergodicity Of Hybrid Samplers","221497232":"Randomized Approximate Aggregating Strategies and Their Applications to Prediction and Discrimination.","267696979":"A Monte Carlo approach to quantifying model error in Bayesian parameter estimation","263094022":"Auto-configuration of Physical Cell ID in LTE femtocellular systems using Self Organizing Networks","263288090":"Simulated Stochastic Approximation Annealing for Global Optimization With a Square-Root Cooling Schedule","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","2847898":"Shift-Coupling and Convergence Rates of Ergodic Averages","45864462":"Regeneration and Fixed-Width Analysis of Markov Chain Monte Carlo Algorithms","264925564":"Convergence of conditional Metropolis-Hastings samplers","255612292":"CONVERGENCE OF ADAPTIVE MARKOV CHAIN Monte Carlo Algorithms","251762107":"Large-signal modelling of Dual-Gate GaAs MESFETs","29613438":"Exposition aux risques alimentaires et processus stochastiques : le cas des contaminants chimiques","2395290":"A Coupling-Regeneration Scheme for Diagnosing Convergence in Markov Chain Monte Carlo Algorithms","221497331":"A Randomized Approximation of the MDL for Stochastic Models with Hidden Variables.","238866175":"Laws of Large Numbers and Functional Central Limit Theorems for Generalized Semi-Markov Processes","45859454":"Geometric Ergodicity and the Spectral Gap of Non-Reversible Markov Chains","2430690":"Discussion of \"The Art of Data Augmentation\" by van Dyk and Meng","38384771":"Computable convergence rates for sub-geometric ergodic Markov chains","45130367":"Markov Chain Monte Carlo Technology","51691460":"Convergence of the Equi-Energy Sampler and Its Application to the Ising Model.","222469520":"Markov chain convergence: From finite to infinite","226627927":"Data augmentation, frequentist estimation, and the Bayesian analysis of multinomial logit models","38348447":"Convergence and accuracy of Gibbs sampling for conditional distributions in generalized linear models","266060557":"A note on formal constructions of sequential conditional couplings","252812742":"Geometric convergence of the Haar PX-DA algorithm for the Bayesian multivariate regression model with Student t errors","261028694":"Stochastic Multiple-Valued Gene Networks","2745586":"Applied Convergence Diagnostics for the Gibbs Sampler","4742803":"Stochastic Approximation in Monte Carlo Computation","228636543":"On the Containment Condition for Adaptive Markov Chain Monte Carlo Algorithms","2292418":"Extension of Fill\u0027s perfect rejection sampling algorithm to general chains (Extended abstract) in Monte Carlo Methods","256919986":"Geometric ergodicity of the Gibbs sampler for Bayesian quantile regression","45878367":"Orthogonality and probability: mixing times","253441016":"Optimal Proposal Distributions and Adaptive MCMC","270277368":"Markov chain Monte Carlo estimation of quantiles","38322349":"Estimating the Second Largest Eigenvalue of a Markov Transition Matrix","50199565":"Quantitative bounds for Markov chain convergence: Wasserstein and total\nvariation distances","255971761":"Sequential Markov Chain Monte Carlo","254295513":"Hypothesis Tests of Convergence in Markov Chain Monte Carlo","31327020":"Computational complexity of Markov chain Monte Carlo methods for finite Markov random fields","264779580":"An Overview of Stochastic Approximation Monte Carlo","226243460":"Quantitative Non-Geometric Convergence Bounds for Independence Samplers","276316800":"Quantitative bounds of convergence for geometrically ergodic Markov chain in the Wasserstein distance with application to the Metropolis Adjusted Langevin Algorithm","2802387":"Convergence in the Wasserstein Metric for Markov Chain Monte Carlo Algorithms with Applications to Image Restoration","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","2209498":"Generalised linear mixed model analysis via sequential Monte Carlo sampling","257466788":"Generalized Gaussian mixture models as a nonparametric Bayesian approach for clustering using class-specific visual features","2672427":"Parallel computing and Monte Carlo algorithms","283975662":"Fixed point theorems and explicit estimates for convergence rates of continuous time Markov chains","224627813":"Stability of Stochastic Approximation under Verifiable Conditions","241681249":"Stochastic alternating projections","221526067":"On an initial transient deletion rule with rigorous theoretical support.","4986693":"Fixed-Width Output Analysis for Markov Chain Monte Carlo","268018418":"Geometric ergodicity for Bayesian shrinkage models","2830139":"Recent Progress on Computable Bounds and the Simple Slice Sampler","222605911":"Geometric Ergodicity of Gibbs and Block Gibbs Samplers for a Hierarchical Random Effects Model","265528000":"Monte Carlo Standard Errors for Markov Chain Monte Carlo","2633022":"Hierarchical Models: A Current Computational Perspective","23991411":"On the use of stochastic approximation Monte Carlo for Monte Carlo integration","2655031":"Information bounds for Gibbs samplers","228868741":"Convergence Rate of the Nested Partitions Method for Stochastic Optimization","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","2646281":"Simulating The Invariant Measures Of Markov Chains Using Backward Coupling At Regeneration Times","257146993":"Corrigendum to “Bounds on regeneration times and convergence rates for Markov chains” : [Stochastic Processes and their Applications 80 (1999) 211–229]","266497221":"MCMC (ε − α)−APPROXIMATION UNDER DRIFT CONDITION WITH APPLICATION TO GIBBS SAMPLERS FOR A HIERARCHICAL RANDOM EFFECTS MODEL","51928112":"A Gibbs Sampler on the n-Simplex","2866438":"Shift-Coupling and Convergence Rates of Ergodic Averages","2335502":"Rates of convergence of stochastically monotone and continuous time Markov models","1894188":"Subgeometric ergodicity of Markov chains","220286483":"MCMC Sampler Convergence Rates for Hierarchical Normal Linear Models: A Simulation Approach","2604309":"A Maximum Entropy Framework for Higher Order Link Analysis on Directed Graphs","1737000":"Variance bounding Markov chains","2764061":"Bayesian Hierarchical Nonparametric Inference for Change-Point Problems","262951063":"Convergence of independent particle systems","221591049":"What Do We Know about the Metropolis Algorithm ?","2777364":"Bounding Convergence Time of the Gibbs Sampler in Bayesian Image Restoration","222556797":"On Monte Carlo methods for Bayesian multivariate regression models with heavy-tailed errors","221042707":"On the approximate domain optimization of deterministic and expected value criteria","4789110":"Subsample distribution distance and McMC convergence","255588474":"An upper bound on the convergence time of the Gibbs sampler in Ising models","2852713":"A Simulation Approach to Convergence Rates for Markov Chain Monte Carlo Algorithms","2738026":"Theoretical rates of convergence for Markov chain Monte Carlo","2900335":"A Primer on Perfect Simulation","2358116":"Explicit Rates of Convergence of Stochastically Ordered Markov Chains","254287968":"Markov Chain Monte Carlo: 10 Years and Still Running!","254287969":"Empirical Bayes: Past, Present and Future","2136938":"Markov Chain Monte Carlo: Can We Trust the Third Significant Figure?","265628313":"The Empirical KL-Measure of MCMC Convergence","233112233":"Using the gibbs sampler to simulate from the bayes estimate of a decreasing density","1765717":"Bayesian Classification and Regression with High Dimensional Features","226539729":"Convergence assessment techniques for Markov chain Monte Carlo","4772123":"Efficient construction of reversible MCMC proposal distributions","2349940":"Markov Chains: Structure and Applications","2855797":"Quantitative bounds for convergence rates of continuous time Markov processes","227425005":"Geometric ergodicity of Metropolis algorithms","250754966":"Ch. 9. Empirical estimators based on MCMC data","51403894":"Steady-State Analysis of Genetic Regulatory Networks Modelled by Probabilistic Boolean Networks","45855187":"Stochastic optimization on continuous domains with finite-time guarantees by Markov chain Monte Carlo Methods","226936553":"A Pool-Based Model of the Spatial Distribution of Undiscovered Petroleum Resoufrces","2842974":"Geometric Ergodicity and Hybrid Markov Chains","4078920":"A probabilistic approach to inference with limited information in sensor networks","2833756":"A note on convergence rates of Gibbs sampling for nonparametric mixtures","262777040":"Gene perturbation and intervention in context-sensitive stochastic Boolean networks","244479979":"Recent development and biomedical applications of probabilistic Boolean networks","2852694":"Faithful Couplings of Markov Chains: Now Equals Forever","220155488":"On the Convergence Rates of Genetic Algorithms.","220286558":"Efficient Markov chain Monte Carlo with incomplete multinomial data. Stat Comput","2123684":"Computable Convergence Rates for Subgeometrically Ergodic Markov Chains","221618866":"Simulated Annealing: Rigorous finite-time guarantees for optimization on continuous domains","24148216":"Component-Wise Markov Chain Monte Carlo: Uniform and Geometric Ergodicity under Mixing and Composition","2620334":"Error of Kernel Estimator: Monitoring Convergence of Markov Samplers","244492575":"Quantitative Convergence Rates of Markov Chains: A Simple Account","51912840":"Nonasymptotic bounds on the estimation error of MCMC algorithms","227577858":"Markov-chain Monte Carlo: Some practical implications of theoretical results","227003925":"A Gentle Stochastic Thermostat for Molecular Dynamics","38350298":"Convergence properties of perturbed Markov chains","267670113":"Stochastic Approximation in Monte Carlo Computation","48169801":"Exact sampling for intractable probability distributions via a Bernoulli\nfactory","265365064":"Exact Sampling, Regeneration and Minorization Conditions","51933316":"Analysis of Convergence Rates of Some Gibbs Samplers on Continuous State\nSpaces","226551325":"One-Shot CFTP; Application to a Class of Truncated Gaussian Densities","234066542":"The Kendall\u0027s Theorem and its Application to the Geometric Ergodicity of\nMarkov Chains","251381605":"Local Porosity Theory and Stochastic Reconstruction for Porous Media","246406415":"Hypothesis Testing: From p Values to Bayes Factors","2463623":"Convergence of Simulated Annealing using Foster-Lyapunov Criteria","262341633":"Geometric ergodicity for classes of homogeneous Markov chains","253821572":"The data augmentation algorithm: Theory and methodology","2111878":"General state space Markov chains and MCMC algorithms","220220040":"Analyze dynamic value of strategic partners using Markov chain","264960099":"Perfect simulation and backward coupling","227423266":"Ergodicity for SDEs and approximations: Locally Lipschitz vector fields and degenerate noise","1901491":"Forgetting of the initial condition for the filter in general state-space hidden Markov chain: A coupling approach","257940719":"Monte Carlo Methods in Bayesian Statistics","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","5453799":"Simulation study in Probabilistic Boolean Network models for genetic regulatory networks","2763166":"Von Mises type statistics for single site updated local interaction random fields","4996596":"Using a Markov Chain to Construct a Tractable Approximation of an Intractable Probability Distribution","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","34722219":"Tomographic reconstruction of label images using Gibbs priors /","229623317":"Markov Chain Monte Carlo Algorithms","2113436":"Sufficient burn-in for Gibbs samplers for a hierarchical random effects model.The Annals of Statistics, 32(2):784-817","2295197":"The Polar Slice Sampler","220345500":"Exact sampling with couple Markov chains and applications to statistical mechanics","243104706":"Conductance bounds on the L2 convergence rate of Metropolis algorithms on unbounded state spaces","254287511":"Studying Convergence of Markov Chain Monte Carlo Algorithms Using Coupled Sample Paths","46468870":"Computing Densities: A Conditional Monte Carlo Estimator","227423307":"Polynomial ergodicity of Markov transition kernels","2118639":"Baxendale, P.H.: Renewal theory and computable convergence rates for geometrically ergodic Markov chains. Ann. Appl. Probab. 15(1B), 700-738","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","45868905":"Improving SAMC using smoothing methods: theory and applications to Bayesian model selection problems. The Annals of Statistics","51953356":"Issues in Designing Hybrid Algorithms","265239578":"Prediction and Optimal Experimental Design in Systems Biology","271620582":"Assessing convergence of the Markov chain Monte Carlo algorithms: A review","245810545":"Coupling and Ergodicity of Adaptive MCMC","225860268":"Gibbs sampling, conjugate priors and coupling","2729461":"Analysis of the Gibbs sampler for a model related to James-Stein estimators","227771470":"Bayesian density estimation using Bernstein polynomials","267046408":"Convergence rate and concentration inequalities for Gibbs sampling in high dimension","2290631":"Extension of Fill\u0027s perfect rejection sampling algorithm to general chain","261471347":"On an Initial Transient Deletion Rule with Rigorous Theoretical Support","2483138":"Two Convergence Properties of Hybrid Samplers","2868684":"Computable Bounds For Polynomial Ergodicity","272844713":"Privacy for Free: Posterior Sampling and Stochastic Gradient Monte Carlo","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","3318211":"Convergence analyses and comparisons of Markov chain Monte Carlo algorithms in digital communications","2841561":"Convergence of the Monte Carlo EM for Curved Exponential Families","265355810":"Convergence rates of Markov chain Monte Carlo methods","229900871":"Discussion on the paper by Brooks, Giudici and Roberts","251458824":"Explicit control of subgeometric ergodicity","2241494":"Computable Bounds For Subgeometrical And Geometrical Ergodicity","224143018":"A Probabilistic Particle-Control Approximation of Chance-Constrained Stochastic Predictive Control","2728927":"An extension of Fill\u0027s exact sampling algorithm to non-monotone chains","226822269":"Geometric Convergence Rates for Time-Sampled Markov Chains","2213337":"Gibbs Sampling for a Bayesian Hierarchical General Linear Model","265993763":"Gentle. Elements of Computational Statistics","26406507":"On the Markov chain central limit theorem","265099831":"Von Mises type statistics for single site updated local interaction random elds 3 Running title: Von Mises statistics for random","244956002":"Ecient Use of Exact Samples","2487774":"Circularly-Coupled Markov Chain Sampling","41717635":"Convergence Rates to Optimal Distribution of the Boltzmann Machine on Simulated Annealing"},"index":943}