{"abs":"The problem of finding marginal distributions of multidimensional random quantities has many applications in probability and statistics. Many of the solutions currently in use are very computationally intensive. For example, in a Bayesian inference problem with a hierarchical prior distribution, one is often driven to multidimensional numerical integration to obtain marginal posterior distributions of the model parameters of interest. Recently, however, a group of Monte Carlo integration techniques that fall under the general banner of successive substitution sampling (SSS) have proven to be powerful tools for obtaining approximate answers in a very wide variety of Bayesian modeling situations. Answers may also be obtained at low cost, both in terms of computer power and user sophistication. Important special cases of SSS include the “Gibbs sampler” described by Gelfand and Smith and the “IP algorithm” described by Tanner and Wong. The major problem plaguing users of SSS is the difficulty in ascertaining when “convergence” of the algorithm has been obtained. This problem is compounded by the fact that what is produced by the sampler is not the functional form of the desired marginal posterior distribution, but a random sample from this distribution. This article gives a general proof of the convergence of SSS and the sufficient conditions for both strong and weak convergence, as well as a convergence rate. We explore the connection between higher-order eigenfunctions of the transition operator and accelerated convergence via good initial distributions. We also provide asymptotic results for the sampling component of the error in estimating the distributions of interest. Finally, we give two detailed examples from familiar exponential family settings to illustrate the theory.","title":"On the Convergence of Successive Substitution Sampling","id":244475332,"url":"https://www.researchgate.net/publication/244475332_On_the_Convergence_of_Successive_Substitution_Sampling","names":["Mark J. Schervish","Bradley P. Carlin","Journal of Computational and Graphical Statistics"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","239060446":"Estimating the means of several normal populations by estimating the distribution of the means, PhD thesis, Yale University","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","220406375":"How Many Comparisons Does Quicksort Use?","2599041":"How Many Iterations in the Gibbs Sampler?","2554222":"On the Geometric Convergence of the Gibbs Sampler","220026613":"Theory of Linear Operators in Hilbert Space II","245071851":"A single series from the Gibbs sampler provides a false sense of security","221669734":"Equations of State Calculations by Fast Computing Machines","38363224":"Inference From Iterative Simulation Using Multiple Sequences","220695984":"Quicksort","242706958":"Spatial interaction and statistical analysis of lattice systems","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","243386783":"Integral Equation Methods"},"citedIn":{"24065262":"Estimation of a normal mixture model through Gibbs sampling and Prior Feedback","226912900":"Reversible algorithm of simulating multivariate densities with multi-hump","2672427":"Parallel computing and Monte Carlo algorithms","3154743":"Blind turbo equalization in Gaussian and impulse noise","2911269":"Approximation Algorithms for Probabilistic Reasoning:","226235248":"Markov Chain Monte Carlo","238684341":"Estimating Normal Means with a Dirichlet Process Prior","233871585":"An Empirical Study of w-Cutset Sampling for Bayesian Networks","227577858":"Markov-chain Monte Carlo: Some practical implications of theoretical results","239755230":"On the performance of the gibbs sampler for the multivariate normal distribution","4729693":"Conditions for convergence of Monte Carlo EM sequences with an application to product diffusion modeling","222484308":"An Exact Likelihood Analysis of the Multinomial Probit Model","247011232":"On Markov Chain Monte Carlo Acceleration","224342213":"A Bit of Information Theory, and the Data Augmentation Algorithm Converges","51185943":"Language Evolution by Iterated Learning With Bayesian Agents","224342212":"On the Bit Error Probability of Noisy Channel Networks With Intermediate Node Encoding","228550146":"Approximation Algorithms for Probabilistic Reasoning: Sampling and Iterative Inference","38357609":"Markov Chains for Exploring Posterior Distributions","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","268025947":"Convergence of Conditional Metropolis-Hastings Samplers, with an Application to Inference for Discretely-Observed Diffusions","38348782":"On the convergence of the Markov chain simulation method. Ann. Statist., 24: 69-100","4746208":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","237310991":"Asymptotic Variance and Convergence Rates of Nearly-Periodic MCMC Algorithms","224839754":"Explaining the Gibbs sampler. Am Stat","2778374":"Methods for Approximating Integrals in Statistics with Special Emphasis on Bayesian Integration Problems","242966101":"Convergence rate of Gibbs sampler and its application","254296199":"Performance of the Gibbs, Hit-and-Run, and Metropolis Samplers","235172395":"Simulation Approaches for Calculations in Directed Graphical Models","257940719":"Monte Carlo Methods in Bayesian Statistics","33956535":"Exploiting graph cutsets for sampling-based approximations in Bayesian networks /","243763126":"Estimation of Finite Mixture Distributions Through Bayesian Sampling","2847898":"Shift-Coupling and Convergence Rates of Ergodic Averages","2834456":"Outperforming the Gibbs sampler empirical estimator for nearest neighbor random fields","2763166":"Von Mises type statistics for single site updated local interaction random fields","264925564":"Convergence of conditional Metropolis-Hastings samplers","38350206":"Explicit bounds for geometric convergence of Markov chains","2601375":"Estimating Ratios of Normalizing Constants for Densities with Different Dimensions","27526686":"Reduced Complexity Sequential Monte Carlo Algorithms for Blind Receivers","24103380":"An Extreme Value Approach to Estimating Volatility and Value at Risk","246157584":"Facilitating the Gibbs Sampler: The Gibbs Stopper and the Griddy-Gibbs Sampler","4746869":"Analysis of Contaminant Co-Occurrence in Community Water Systems","24065360":"Improper and proper posteriors with improper priors in a Poisson-gamma hierarchical model","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","2738026":"Theoretical rates of convergence for Markov chain Monte Carlo","257169559":"Recovery of hidden information from stock price data: A semiparametric approach","281240839":"Application of survival analysis methods to study under-five child mortality in Uganda.","2306150":"On the Convergence of Monte Carlo Maximum Likelihood Calculations","221666161":"A Spectral Analytic Comparison of Trace-class Data Augmentation Algorithms and their Sandwich Variants","229867642":"Slow convergence of the Gibbs sampler","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","227623232":"Markov Chain Monte Carlo Method and its applications","226539729":"Convergence assessment techniques for Markov chain Monte Carlo","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","38348447":"Convergence and accuracy of Gibbs sampling for conditional distributions in generalized linear models","236177867":"The Effect of Improper Priors on Gibbs Sampling in Hierarchical Linear Mixed Models","265819396":"THEORETICAL AND METHODOLOGICAL DEVELOPMENTS FOR MARKOV CHAIN MONTE CARLO ALGORITHMS FOR BAYESIAN REGRESSION","2729461":"Analysis of the Gibbs sampler for a model related to James-Stein estimators","24095282":"Alternative Computational Approaches to Inference in the Multinomial Probit Model","255610332":"COMPARISON FOR ESTIMATION RISK OF O/S AND IBNR RESERVE USING THE CHAIN LADDER METHOD, THE CREDIBILITY MODEL AND MCMC METHODS","244902905":"Cutset Sampling for Bayesian Networks","250754966":"Ch. 9. Empirical estimators based on MCMC data","266237115":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","227425256":"One-shot coupling for certain stochastic recursive sequences","2261835":"Convergence Rates for Markov Chains","2442825":"Estimating Normalizing Constants and Reweighting Mixtures in Markov Chain Monte Carlo","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","254296152":"A Markov Chain Monte Carlo Convergence Diagnostic Using Subsampling","252069108":"Approximate Conditional Inference in Exponential Families Via the Gibbs Sampler","2855903":"Rates of Convergence for Gibbs Sampling for Variance Component Models","3317701":"Adaptive Bayesian multiuser detection for synchronous CDMA with Gaussian and impulsive noise","23633168":"Connectedness conditions for the convergence of the Gibbs sampler","252416882":"THE INTEGRATED VOLATILITY IMPLIED BY OPTION PRICES A BAYESIAN APPROACH","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","265099831":"Von Mises type statistics for single site updated local interaction random elds 3 Running title: Von Mises statistics for random","226882559":"Bounding convergence rates for Markov chains: An example of the use of computer algebra","274764315":"Bayesian data analysis for agricultural exper","280780736":"Language evolution by iterated learning with Bayesian agents","222499134":"Rates of convergence for everywhere-positive Markov chains","268339584":"BAYESIAN INFERENCE ON DYNAMICS OF INDIVIDUAL AND POPULATION HEPATOTOXICITY VIA STATE SPACE MODELS","277208058":"PARAMETER ESTIMATION FOR LATENT MIXTURE MODELS WITHAPPLICATIONS TO PSYCHIATRY"},"index":945}