{"abs":"This paper considers the effect of stochasticity on the quality of convergence of genetic algorithms (GAs). In many problems, the variance of building-block fitness or so-called collateral noise is the major source of variance, and a population-sizing equation is derived to ensure that average signal-to-collateral-noise ratios are favorable to the discrimination of the best building blocks required to solve a problem of bounded deception. The sizing relation is modified to permit the inclusion of other sources of stochasticity, such as the noise of selection, the noise of genetic operators, and the explicit noise or nondeterminism of the objective function. In a test suite of five functions, the sizing relation proves to be a conservative predictor of average correct convergence, as long as all major sources of noise are considered in the sizing calculation. These results suggest how the sizing equation may be viewed as a coarse delineation of a boundary between what a physicist might call two distinct phases of GA behavior. At low population sizes the GA makes many errors of decision, and the quality of convergence is largely left to the vagaries of chance or the serial fixup of flawed results through mutation or other serial injection of diversity. At large population sizes, GAs can reliably discriminate between good and bad building blocks, and parallel processing and recombination of building blocks lead to quick solution of even difficult deceptive problems. Additionally, the paper outlines a number of extensions to this work, including the development of more refined models of the relation between generational average error and ultimate convergence quality, the development of online methods for sizing populations via the estimation of population-s...","title":"Genetic Algorithms, Noise, and the Sizing of Populations","id":264923669,"url":"https://www.researchgate.net/publication/264923669_Genetic_Algorithms_Noise_and_the_Sizing_of_Populations","names":["David E. Goldberg","Kalyanmoy Deb","James H. Clark","Complex Systems"],"references":{"221271249":"Spurious Correlations and Premature Convergence in Genetic Algorithms.","216300792":"Holland, J.: Genetic algorithms and the optimal allocation of trials. SIAM J. Computing 2, 88-105","235121981":"Hierarchical Descriptions of Universal Spaces and Adaptive Systems"},"citedIn":{"253405978":"GENETIC ALGORITHMS AND OPTIMIZING CHEMICAL OXYGEN-IODINE LASERS","238428215":"Adaptive Population Sizing Schemes in Genetic Algorithms","3418677":"On spanning-tree recombination in evolutionary large-scale network problems - Application to electrical distribution planning","220741417":"A review of adaptive population sizing schemes in genetic algorithms","228670373":"Population sizing for entropy-based model building in genetic algorithms","263766462":"Optimized aperiodic highly directional narrowband infrared emitters","50838784":"Parametric exploration of discrete structures using evolutionary computation","267421175":"Fluctuating Crosstalk, GA Scalability, and the Disruption of Optima","41020536":"Conceptual design of superconducting magnets for the LHC using genetic optimization algorithms","224221014":"Genetic Algorithm Based Path Testing: Challenges and Key Parameters","220743459":"Initial-population bias in the univariate estimation of distribution algorithm","4213839":"Multiobjective simulation optimization using an enhanced genetic algorithm","222754633":"An alternative model of genetic algorithms as learning machines","269568001":"Studies in Aerodynamic Optimization Based on Genetic Algorithms","2467889":"Compressed Introns in a Linkage Learning Genetic Algorithm","265776066":"Modern optimization techniques with applications in electric power systems","228882354":"Towards billion bit optimization via efficient genetic algorithms","24009590":"Cocluster analysis of thalamo-cortical fibre tracts extracted from diffusion tensor MRI","216300285":"Evolutionary algorithms in noisy environments: Theoretical issues and guidelines for practice","277107358":"Examination timetabling with genetic algorithms / Azman Yasin, Nurnasran Puteh and Hatim Mohamad Tahir","221009200":"Where Does the Good Stuff Go, and Why? How Contextual Semantics Influences Program Structure in Simple Genetic Programming.","228917177":"Solving the long-term hydro-thermal coordination problem with a special genetic algorithm","220867381":"The Influence of Population and Memory Sizes on the Evolutionary Algorithm’s Performance for Dynamic Environments","226047833":"Where does the good stuff go, and why? how contextual semantics influences program structure in simple genetic programming","34471471":"Explicit building block multiobjective evolutionary computation : methods and applications /","46424801":"A New Approach to Population Sizing for Memetic Algorithms: A Case Study for the Multidimensional Assignment Problem","228817288":"Diagnosis of Dementing Diseases through the Distribution of Cerebral Atrophy: Development of a Multi-Objective Evolutionary Algorithm Optimiser","3913744":"A new Dynamic Traffic Control System: Performance of Adaptive Control Strategies for Over-saturated Traffic","221009159":"The Role of Population Size in Rate of Evolution in Genetic Programming","243686570":"Genetic-algorithm-based design of ground-water quality monitoring system","227245990":"Evolutionary Paradigms","223929718":"Genetic algorithms – A new technique for solving the neutron spectrum unfolding problem","228689806":"The Evolution of Solid Object Designs Using Genetic Algorithms","225718084":"Population Sizing to Go: Online Adaptation Using Noise and Substructural Measurements","224178029":"Scaling eCGA model building via data-intensive computing","245380753":"Matching Network Design for a Monopole Antenna Using the Micro-Genetic Algorithm","220313874":"A real-coding jumping gene genetic algorithm (RJGGA) for multiobjective optimization","2869784":"Oiling the Wheels of Change: The Role of Adaptive Automatic Problem Decomposition in Non-Stationary Environments","274263659":"Parameter Control in Evolutionary Algorithms: Trends and Challenges","259086148":"Automation and optimisation of Family Mould Cavity and Runner Layout Design (FMCRLD) using genetic algorithms and mould layout design grammars","2366995":"Unobtrusive Workstation Farming Without Inconveniencing Owners: Learning Backgammon with a Genetic Algorithm","251460807":"Using sequential self-calibration and genetic algorithm methods to optimally design tracer test for estimation of conductivity distribution","222712701":"Automatic Tuning of Agent-Based Models Using Genetic Algorithms","3010065":"Genetic Algorithm Optimization Applied To Electromagnetics: A Review","262425497":"A niching scheme for EDAs to reduce spurious dependencies","267307472":"Improving Memory-based Evolutionary Algorithms for Dynamic Environments","229624209":"Evolving sse: A new population‐oriented search scheme based on schemata processing","268594237":"Dynamic Traffic Control System for Over-Saturated Traffic: Comparison of Adaptive Control Strategies","262251495":"Effects of discrete hill climbing on model building forestimation of distribution algorithms","251225777":"End-to-end reliability of service oriented applications","2615407":"A Pareto Frontier for Full Stern Submarines via Genetic Algorithm","251864394":"A New Fuzzy Adaptive Genetic Algorithm Based on Variance and Entropy","262221803":"A block-based evolutionary algorithm for flow-shop scheduling problem","7605816":"Efficient genetic algorithms using discretization scheduling","224645934":"A Study of Adaptation and Random Search in Genetic Algorithms","242817591":"A hybrid genetic algorithm for the estimation of parameters in detailed kinetic models","220180305":"Cross-pollinating parallel genetic algorithms for multiobjective search and optimization","220743015":"Optimal sampling of genetic algorithms on polynomial regression","222429965":"The parameter-less genetic algorithm in practice","2814074":"What Makes a Problem Hard for a Classifier System?","2642552":"Adaptive Techniques for Evolutionary Topological Optimum Design","220702069":"Evolutionary Algorithms with On-the-Fly Population Size Adjustment","272199275":"Modified genetic algorithm using Box Complex method: Application to optimal control problems","226613714":"When Huge Is Routine: Scaling Genetic Algorithms and Estimation of Distribution Algorithms via Data-Intensive Computing","260514772":"Multi-Attribute Partitioning of Power Networks Based on Electrical Distance","220741500":"Conquering hierarchical difficulty by explicit chunking","235080279":"Optimization of Heterogeneous UAV Communications Using the Multiobjective Quadratic Assignment Problem","2499187":"Analysis of Mixing in Genetic Algorithms: A Survey","8997596":"Redundant Representations in Evolutionary Computation","255635307":"NEW HARDWARE ARCHITECTURE FOR BIT-COUNTING","4140647":"Elitist Non-Dominated Sorting GA-II (NSGA-II) as a parameter-less multi-objective genetic algorithm","220862320":"Initial Population for Genetic Algorithms: A Metric Approach.","2460283":"Kalyanmoy Deb","263809511":"Inverse Hydrograph Routing Optimization Model Based on Kinematic Wave Approach","257144588":"How to analyse evolutionary algorithms","225667884":"Reference chromosome to overcome user fatigue in IEC","4279841":"The Harmonious Evolution of Ethnic Group Algorithm","268009370":"ON MUTATION AND CROSSOVER IN THE THEORY OF EVOLUTIONARY ALGORITHMS","220800330":"A Framework for Studying the Effects of Dynamic Crossover, Mutation, and Population Sizing in Genetic Algorithms.","226137881":"Population size reduction for the differential evolution algorithm","229732309":"Coupling recognition of the structure and parameters of non‐linear constitutive material models using hybrid evolutionary algorithms","264032728":"Analysis of Optimal Infiltraction Route using Genetic Algorithm","225240841":"Saw-Tooth Algorithm Guided by the Variance of Best Individual Distributions for Designing Evolutionary Neural Networks","5583923":"An Introduction to Simulated Evolutionary Optimization","2656846":"Software Reliability Engineering: An Evolutionary Neural Network Approach","4340776":"A FPGA Optimization Tool Based on a Multi-island Genetic Algorithm Distributed over Grid Environments","285391208":"Computational Intelligence: Synergies of Fuzzy Logic, Neural Networks and Evolutionary Computing","3418719":"A genetic algorithm for shortest path routing problem and the sizing of populations","268256656":"An Improved Multi-Objective Evolutionary Algorithm with Adaptable Parameters","220697930":"Augmented Compact Genetic Algorithm","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","228921812":"Discovering Building Blocks for Human Based Genetic Algorithms","221547335":"A Dynamic Island-Based Genetic Algorithms Framework","277731065":"КОМБІНОВАНИЙ КОМПЕТЕНТНИЙ ПАРАЛЕЛЬНИЙ ГЕНЕТИЧ-НИЙ АЛГОРИТМ ТА ЙОГО ЗАСТОСУВАННЯ ДЛЯ ЗАДАЧІ ПОБУ-ДОВИ РОЗКЛАДІВ","221929807":"Genetic Algorithms Application to Electric Power Systems","220118884":"A controlled migration genetic algorithm operator for hardware-in-the-loop experimentation","221001558":"A clustering entropy-driven approach for exploring and exploiting noisy functions","223934754":"Control of flow using genetic algorithm for a circular cylinder executing rotary oscillation","223362346":"Genetic evolution of nonlinear material constitutive models","229067741":"Data Mining: A Heuristic Approach","2407002":"On Extended Compact Genetic Algorithm","52009830":"A hybrid analytical-heuristic method for calibrating land-use change models","265423277":"Optimal treatment of structures","223066058":"Efficient parallel genetic algorithms: Theory and practice","2272417":"Automated Design Of Knowledge-Lean Heuristics: Learning, Resource Scheduling, And Generalization","267027822":"Fuzzy adaptation of crossover and mutation rates in genetic algorithms based on population performance","254230434":"Assessing hypermutation operators of a clonal selection algorithm for the unequal area facility layout problem","245136411":"Application of GA in optimal robot selection for bridge restoration","2428589":"Genetic Algorithm Difficulty and the Modality of Fitness Landscapes","225171426":"DNA Starts to Learn Poker","269939359":"Predictive Dialer Intensity Optimization Using Genetic Algorithms","2420399":"Genetic Algorithms, Tournament Selection, and the Effects of Noise","226078196":"Hierarchical Evolutionary Algorithms and Noise Compensation via Adaptation","220403630":"Evolutionary multiobjective optimization in noisy problem environments","46491723":"Income prediction in the agrarian sector using product unit neural networks","12723283":"On the Scalability of Parallel Genetic Algorithms","229886242":"Network‐Wide Optimal Scheduling of Transit Systems Using Genetic Algorithms","1959052":"Revisiting Evolutionary Algorithms with On-the-Fly Population Size Adjustment","220739516":"On the effectiveness of distributions estimated by probabilistic model building","1959048":"On the utility of the multimodal problem generator for assessing the performance of Evolutionary Algorithms","221325735":"A Trade-Off of the Schema Theorem.","232251712":"Clever Algorithms","224330183":"Efficient Evolution of ART Neural Networks","220743088":"Combating user fatigue in iGAs: partial ordering, support vector machines, and synthetic fitness.","2365630":"A Hybrid Multi-Objective Evolutionary Approach to Engineering Shape Design","1956999":"Parameter-Less Optimization with the Extended Compact Genetic Algorithm and Iterated Local Search","227168016":"Using sequential self-calibration method to estimate a correlation length of a log-conductivity field conditioned upon a tracer test and limited measured data","265427273":"Implementation of Shortest Path in Packet Switching Network Using Genetic Algorithm","23753204":"Modeling the Use of Nonrenewable Resources Using a Genetic Algorithm","222861782":"Optimal distribution network expansion planning under uncertainty by evolutionary decision convergence","271137974":"Pipeline optimization via genetic algorithm from theory to practice","2885261":"Designing Competent Mutation Operators Via Probabilistic Model Building of Neighborhoods","2428544":"A Hybrid Algorithm To Compute The Optimal Parameters Of A System Viscoelastic Vibration Neutralisers In A Frequency Band","221608860":"Solving Extremely Difficult MINLP Problems Using Adaptive Resolution Micro-GA with Tabu Search","220773763":"Symmetry at the Genotypic Level and the Simple Inversion Operator","5487357":"Experiments with a Genetic Algorithm for Structural Design of Cemented Doublets with Prespecified Aberration Targets","270459568":"Optimized sensor placement for damage parameter estimation: Experimental results for a cracked plate","235701411":"Adaptive Range Parameter Control","228427058":"The practitioner\u0027s role in competent search and optimization using genetic algorithms","27706646":"On the design and analysis of competent GAs","223582691":"Genetic algorithms and artificial neural networks for loading pattern optimisation of advanced gas-cooled reactors","250719297":"Calibration of the parameters for a hardening–softening constitutive model using genetic algorithms","43292197":"Optimisation globale de systèmes mécaniques","225595843":"Sporadic model building for efficiency enhancement of the hierarchical BOA","252550076":"Population Scalability Analysis of Abstract Population-based Random Search: Spectral Radius","3418754":"Elitism-based compact genetic algorithms","228605207":"A Niched-Penalty Approach for Constraint Handling in Genetic Algorithms","2331796":"Time Complexity of Genetic Algorithms on Exponentially Scaled Problems","283758160":"Large-Scale Biometric Multimedia Processing","220242844":"Building-Block Supply in Real-Coded Genetic Algorithms: A First Step on the Population-Sizing Model.","220742038":"Multiobjective genetic algorithms for multiscaling excited state direct dynamics in photochemistry.","220176288":"Designing multilayer perceptrons using a Guided Saw-tooth Evolutionary Programming Algorithm","246064149":"Implementing Fast and Flexible Parallel Genetic Algorithms","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","4035325":"A \u0027non-model building\u0027 approach to solving hierarchical functions","42387014":"Viewing the Problem from Different Angles: A New Diversity Measure Based on Angular Distances","220696037":"Advances in Evolutionary Algorithms: Theory, Design and Practice.","2804457":"Graphical Interface for Paradigm Oriented Distributed Computing","222840204":"Scalability of the Bayesian optimization algorithm","283483169":"Estimation of Distribution Algorithms","3418865":"Katsaras, C.P.: A saw-tooth genetic algorithm combining the effects of variable population size and reinitialization to enhance performance. IEEE Trans. Evol. Comput. 10(1), 19-27","241103003":"Economic optimization of industrial safety measures using genetic algorithms","220199385":"A systematic comparison of metamodeling techniques for simulation optimization in Decision Support Systems","250993714":"Genetic Programming for Multiscale Modeling","220867053":"A Hierarchical Evolutionary Algorithm with Noisy Fitness in Structural Optimization Problems.","221325817":"Empirical Study: Initial Population Diversity and Genetic Algorithm Performance.","257863063":"Optimization of structural form using a genetic algorithm to search associative parametric geometry","238720755":"Parameter Setting in Evolutionary Algorithms","3010785":"Genetic algorithms as applied to the computation of electromagnetic scattering by weakly nonlinear dielectric cylinders","3421432":"Statistical analysis of the main parameters involved in the design of a genetic algorithm","220176339":"The application of genetic algorithms to optimise the performance of a mine ventilation network: The influence of coding method and population size","238118655":"Hybrid training approach for artificial neural networks using genetic algorithms for rate of reaction estimation: Application to industrial methanol oxidation to formaldehyde on silver catalyst","264688393":"Design of microwave filters using a binary-coded genetic algorithm","3450597":"Elitist nondominated sorting genetic algorithm based RF IC optimizer. IEEE Trans Circuits Syst I Regul Pap","233353017":"Relationship between problem characteristics and the optimal number of genetic algorithm generations","280695919":"The Interactive Effects of Operators and Parameters to GA Performance Under Different Problem Sizes","220313588":"A genetic algorithm calibration method based on convergence due to genetic drift","259752364":"Solving very large optimization problems (up to one billion variables) with a parallel evolutionary algorithm in CPU and GPU","4705936":"Design Space Issues for Intrinsic Evolvable Hardware","27475316":"An adaptive framework for Internet-based distributed genetic algorithms","230825241":"A chemical evolutionary mechanism for instantiating service-based applications","225127819":"Using the Sequential Self-calibration Method and Genetic Algorithm Method to Optimally Design Tracer Test to Estimate Conductivity Distribution","290894774":"The Concept of Confidence for Inheritance-Based Genetic Algorithms","2410182":"Genetic Algorithms With Cluster Analysis For Production Simulation","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","2773705":"Signal-to-noise, Crosstalk and Long Range Problem Difficulty in Genetic Algorithms","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","266863886":"APPLICATION OF EVOLUTIONARY COMPUTATION TO OPEN CHANNEL FLOW MODELLING","220999115":"Dynamic Populations in Genetic Algorithms","222168020":"Genetic algorithm convergence study for sensor network optimization","2491095":"Efficient Discretization Scheduling in Multiple Dimensions","2301143":"Extended Compact Genetic Algorithm in C++","4201654":"Online population size adjusting using noise and substructural measurements","248164914":"Identifying geo-material mechanical parameters of Three Gorges Project permanent shiplock using intelligent displacement back analysis method","220741585":"Population Implosion in Genetic Programming","33400583":"An Experimental Comparative Study for Interactive Evolutionary Computation Problems","238402767":"Elitist Genetic Algorithm Models: Optimization of High Performance Concrete Mixes","225479562":"Efficient resource allocation for genetic algorithm based multi-objective optimization with 1,000 simulations","2493149":"Efficient Genetic Algorithms using Discretization Scheduling","3786949":"A test generator for segment delay faults","2533595":"Time Continuation in Genetic Algorithms","220096995":"Military Antenna Design Using Simple And Competent Genetic Algorithms","2672424":"Polynomial Complexity Search, Problem Difficulty and Genetic Algorithms","225645169":"The Evolutionary Transition Algorithm: Evolving Complex Solutions Out of Simpler Ones","266458343":"Estimation de la Position Angulaire d\u0027un Cube par Analyse d\u0027Image et Algorithmes Génétiques","260219012":"Asynchronous Optimisation with the Use of a Cascade Search Algorithm","220341285":"DoE framework for catalyst development based on soft computing techniques","223380057":"Development of RFID-based Reverse Logistics System","264788674":"Influence of the thickness of matching layers on narrow band transmitter ultrasonic airborne transducers with frequencies \u003c100kHz: Application of a genetic algorithm","220181012":"Population Size Modeling for GA in Time-Critical Task Scheduling.","44849568":"Evolvability and Speed of Evolutionary Algorithms in Light of Recent Developments in Biology","234014434":"Metaheuristics: A Bibliography","12809681":"The Gambler\u0027s Ruin Problem, Genetic Algorithms, and the Sizing of Populations","224472180":"Viral Infection plus Tropism for Improving Small Population Performance under Noisy Environment","274084163":"Structural Health Monitoring of Plates Without Reference Data: Accurate Crack Identification using a Model-Based Bayesian Framework","225154173":"Hierarchical Bayesian Optimization Algorithm","221582882":"Using Statistical Techniques to Predict GA Performance","51932676":"Novel Analysis of Population Scalability in Evolutionary Algorithms","5606729":"Statistical analysis of the parameters of a neuro-genetic algorithm","2558779":"Optimal Sampling and Speed-up for Genetic Algorithms on the Sampled OneMax Problem","220743223":"Towards billion-bit optimization via a parallel estimation of distribution algorithm","2476294":"Probabilistic Model Building and Competent Genetic Programming","220549632":"Genetic Algorithm for Optimization and Specification of a Neuron Model","2910468":"Evaluation of the GAS Algorithm and Proposal of an Adaptive Version (AGAS)","258646592":"A simple method for determining the spatial resolution of a general inverse problem","220702220":"Convergence Models of Genetic Algorithm Selection Schemes.","273397095":"Structure Optimal Design and Performance Test of Airfoil Shear Probes","1957171":"Let\u0027s Get Ready to Rumble: Crossover Versus Mutation Head to Head","228947594":"Comparing advanced genetic algorithms and simple genetic algorithms for groundwater management","1957170":"Efficiency Enhancement of Probabilistic Model Building Genetic Algorithms","220204561":"Compact Unstructured Representations for Evolutionary Design","2643227":"SEARCH, Computational Processes in Evolution, and Preliminary Development of the Gene Expression Messy Genetic Algorithm","220341265":"On the Synthesis and Optimization of Liquid-Liquid Extraction Processes Using Stochastic Search Methods","233812699":"Repr{é}sentations non structur{é}es en optimisation topologique de formes par algorithmes {é}volutionnaires","2880799":"Are Multiple Runs of Genetic Algorithms Better than One?","2371345":"Co-Evolutionary Learning on Noisy Tasks","4294520":"An Incremental Approach for Niching and Building Block Detection via Clustering","254685205":"Optimization of Semiempirical Quantum Chemistry Methods via Multiobjective Genetic Algorithms: Accurate Photodynamics for Larger Molecules and Longer Time Scales","41887553":"Représentations non structurées en optimisation topologique de formes par algorithmes évolutionnaires","2710889":"Learning Gene Linkage to Efficiently Solve Problems of Bounded Difficulty Using Genetic Algorithms","240409364":"Reducing tensile stress concentration in perforated hybrid laminate by genetic algorithm","234385595":"Multi level optimization of burnable poison utilization for advanced PWR fuel management","228744929":"Genetic algorithms and genetic programming for multiscale modeling: Applications in materials science and chemistry and advances in scalability","220743277":"Scalability of Selectorecombinative Genetic Algorithms for Problems with Tight Linkage","223460374":"Parameter Control in Evolutionary Algorithms","225107490":"Scope of stationary multi-objective evolutionary optimization: A case study on a hydro-thermal power dispatch problem","228981486":"Accurate Calculation of Deme Sizes for a Parallel Genetic Scheduling Algorithm","215561618":"Molecular reconstruction of heavy petroleum residue fractions","235050318":"Explicit Building Block Multiobjective Evolutionary Computation: Methods and Applications","251600306":"Model-based SHM: Demonstration of identification of a crack in a thin plate using free vibration data","228751596":"Discovering Deep Building Blocks for Competent Genetic Algorithms Using Chance Discovery via KeyGraphs","221216864":"The Optimal Rule Structure for Fuzzy Systems in Function Approximation by Hybrid Approach in Learning Process","222324241":"Multi-sensor fusion: an Evolutionary algorithm approach","257739789":"An introduction and survey of estimation of distribution algorithms","220949113":"Deciding model of Population Size in time-constrained task scheduling.","221009017":"Comparison of GA and PSO performance in parameter estimation of microbial growth models: A case-study using experimental data","11019773":"A Computationally Efficient Evolutionary Algorithm for Real-Parameter Optimization","221525602":"Genetic Algorithms for Cluster Analysis for Production Simulation.","226176044":"Parameter Selection","9084368":"Effect of experimental error on the efficiency of different optimization methods for bioprocess media optimization","232630406":"A Novel Ecological Competitive Genetic Algorithm","230666977":"Application of Genetic Algorithm for Unknown Parameter Estimations in Cylindrical Fin","220742263":"Self-adaptive simulated binary crossover for real-parameter optimization","220483142":"Population Sizing for Genetic Programming Based Upon Decision Making","201976170":"A Genetic Algorithms Tutorial","3323729":"Narrow-band interference cancellation in spread-spectrum communication systems using chaos","227101930":"Evolutionary Multi-Objective Optimization Without Additional Parameters","223402552":"Dynamic Network Traffic Control","220286025":"Variable population size and evolution acceleration: A case study with a parallel evolutionary algorithm","278721013":"A Genetic Algorithm with Dynamic Population Size","233922203":"Reliability based Optimal Design using Genetic Algorithms in a Competitive Environment","273541926":"Real-Time Production Scheduler for Digital-Print-Service Providers Based on a Dynamic Incremental Evolutionary Algorithm","281277363":"Investigation on Selection Schemes and Population Sizes for Genetic Algorithm in Unmanned Aerial Vehicle Path Planning","2501463":"How Well Does A Single-Point Crossover Mix Building Blocks with Tight Linkage?","215635881":"Population-Based Incremental Learning: A Method for Integrating Genetic Search Based Function Optimization and Competitive Learning","226148878":"Multi-Objective Evolutionary Algorithms for Engineering Shape Design","29601462":"Parameter Space Exploration of Agent-Based Models","266173608":"Design and optimization of multilayered electromagnetic shield using a real-coded genetic algorithm","264789694":"Massively Parallel Evolutionary Computation on GPGPUs","3011413":"Application of microgenetic algorithm (MGA) to the design of broad-band microwave absorbers using multiple frequency selective surface screens buried in dielectric","262219993":"Adapting Scientific Workflow Structures Using Multi-Objective Optimization Strategies","226952445":"Genetic Algorithms","264273595":"Evolutive Approaches for Variable Selection Using a Non-parametric Noise Estimator","233922189":"Competition Among Genetic Algorithms to Improve Robustness In Optimization","2509659":"Monte Carlo Simulation Of Dynamical Systems Of Engineering Interest In A Massively Parallel Computing Environment: Anapplication Of Geneticalgorithms","257356331":"A block mining and re-combination enhanced genetic algorithm for the permutation flowshop scheduling problem","220702296":"A Steady-State Genetic Algorithm with Resampling for Noisy Inventory Control","220742743":"Performance of evolutionary algorithms on NK landscapes with nearest neighbor interactions and tunable overlap","3831224":"Unobtrusive workstation farming without inconveniencing owners:learning Backgammon with a genetic algorithm","2788777":"Genetic Algorithm in Search and Optimization: The Technique and Applications","2873775":"Efficiency Enhancement of Genetic Algorithms via Building-Block-Wise Fitness Estimation","239373762":"Transmission project profitability including reliability optimization of bulk power systems","284076390":"An aerodynamic optimization computational framework using genetic algorithms","220176022":"Exploring dynamic self-adaptive populations in differential evolution","2417071":"Genetic Algorithms, Problem Difficulty, and the Modality of Fitness Landscapes","2255278":"Decision Making In Genetic Algorithms: A Signal-To-Noise Perspective","47715159":"MULTIOBJECTIVE SIMULATION OPTIMIZATION USING ENHANCED EVOLUTIONARY ALGORITHM APPROACHES","32964711":"A Matrix Approach for Finding Extreme: Problems with Modularity, Hierarchy, and Overlap","266070603":"TECHNIQUES AND ALGORITHMS FOR SOLVING THE MULTIOBJECTIVE PATH OPTIMISATION PROBLEM FOR CAR NAVIGATION","2333106":"Simulated Binary Crossover for Continuous Search Space","225766630":"Parameter Setting in Parallel Genetic Algorithms","225667296":"Scalability and Efficiency of Genetic Algorithms for Geometrical Applications","223595719":"An accurate parallel genetic algorithm to schedule tasks on a cluster","277019926":"Genetic Algorithms\u0027 Performance Enhancement in Dynamic Environments","285491858":"Clustering by genetic algorithm- high quality chromosome selection for initial population","233922151":"Genetic Algorithms in Competitive Environments","222667997":"Genetic Algorithm Based Technique for Solving Chance Constrained Problems","257588930":"Solving dual problems using a coevolutionary optimization algorithm","220048519":"Hybrid Metaheuristics","289191590":"Active control and drag optimization for flow past a cylinder at high Reynolds number using genetic algorithms","220740275":"Do not match, inherit: fitness surrogates for genetics-based machine learning techniques.","38975439":"Generación y extracción / selección de características en detección automática de isquemia y deficiencias valvulares sobre registros de la actividad cardíaca.","220741814":"Improving small population performance under noise with viral infection + tropism","3418539":"On the robustness of population-based versus point-based optimization in the presence of noise","220741771":"Dependency Structure Matrix Analysis: Offline Utility of the Dependency Structure Matrix Genetic Algorithm","229745682":"Convergence Variability and Population Sizing in Micro‐Genetic Algorithms","220642946":"Sufficient Conditions for Deceptive and Easy Binary Functions.","2519938":"Situation Awareness for Tactical Driving","3418513":"Evolutionary Computation: Comments on the History and Current State","220176569":"A design for DNA computation of the OneMax problem","238178708":"Propagating behavior of rectangular waveguide loaded with dissipative magnetic slab by using new algorithm","27685900":"Genetic algorithms for map labeling","221231237":"Efficiency Enhancement of ECGA Through Population Size Management","241815491":"Multi-objective Optimization under Uncertain Objectives: Application to Engineering Design Problem","259517145":"Simulating vacuum residue hydroconversion by means of Monte-Carlo techniques","220867226":"Fluctuating Crosstalk as a Source of Deterministic Noise and Its Effects on GA Scalability.","227934759":"Detection and quantification of flaws in structures by the eXtended finite element method and genetic algorithms","221211805":"Linkage Learning, Rule Representation, and the X-Ary Extended Compact Classifier System.","257386212":"Wire Fault Location in Coaxial Cables by Impedance Spectroscopy","229036049":"Optimization of reverse osmosis desalination system using genetic algorithms technique","258166491":"Molecule-based kinetic modeling by Monte Carlo methods for heavy petroleum conversion","225119959":"Building a GA from Design Principles for Learning Bayesian Networks","238718340":"DNA Computing, 7th International Workshop on DNA-Based Computers, DNA7, Tampa, Florida, USA, June 10-13, 2001, Revised Papers","261482538":"A genetic algorithms framework for estimating individual gene contributions in signaling pathways","227939927":"Application of differential evolution algorithm for optimal location and parameters setting of UPFC considering power system security","265287693":"THE PARAMETER-LESS GENETIC ALGORITHM: RATIONAL AND AUTOMATED PARAMETER SELECTION FOR SIMPLIFIED GENETIC ALGORITHM OPERATION","221547254":"Random Search Based on Genetic Operators.","230852613":"The bimodal feature at large population sizes and high selection pressure: implications for directed evolution","220413668":"A Fingerprint Minutiae Recognition System Based on Genetic Algorithms","38092674":"Dependency Structure Matrix, Genetic Algorithms, and Effective Recombination","4089844":"Cellz: a simple dynamic game for testing evolutionary algorithms","51872477":"Neuroevolutionary reinforcement learning for generalized control of simulated helicopters","264441865":"Material parameter optimisation of Ohno-Wang kinematic hardening model using multi objective genetic algorithm","220739811":"Interaction detection by NFE estimation: a practical view of building blocks.","2575338":"The Revolution of Evolution in Design: From Coffee Tables to Hospitals","3810295":"Co-evolutionary learning on noisy tasks","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","250692927":"Random heuristic search: Applications to GAs and functions of unitation","220701929":"Saving Resources with Plagues in Genetic Algorithms.","279676794":"ALT KISMİ MOMENT VE YARI-VARYANS RİSK MODELLERİ KULLANARAK GENETİK ALGORİTMA YARDIMIYLA PORTFÖY OPTİMİZASYONU: İMKB UYGULAMASI","220739834":"Let\u0027s get ready to rumble redux: Crossover versus mutation head to head on exponentially scaled problems","2799608":"Massive Multimodality, Deception, and Genetic Algorithms","221163261":"GA-SVM Based Framework for Time Series Forecasting.","228048451":"Optimization Using Genetic Algorithms with Micropopulations","269843916":"Use of Genetic Algorithms for Optimal Design of Sandwich Panels Subjected to Underwater Shock Loading","3418607":"Markov chain models of parallel genetic algorithms","260621910":"Evolving Team Compositions by Agent Swapping","4074974":"Population size, search space and quality of solution: An experimental study","2941903":"DNA Starts to Learn Poker","226051741":"Fragment as a Small Evidence of the Building Blocks Existence","251969763":"Estimation of distribution algorithms: basic ideas and future directions","237369292":"Chemical laser modeling with genetic algorithms","3121605":"On the application of the micro-genetic algorithm (MGA) to the design of broadband microwave absorbers comprising frequency selective surface (FSS) embedded in multilayered dielectric media","221462232":"Analysis of Selection, Mutation and Recombination in Genetic Algorithms.","220741317":"Population sizing for entropy-based model building in discrete estimation of distribution algorithms","38975423":"Selección efectiva de características wavelet en la identificación de bioseñales 1-D y 2-D usando algoritmos genéticos","2734020":"The Class Of Statically Deceptive Problems Is NP-Turing Complete","251744492":"Robust and Scalable BlackBox Optimization, Hierarchy, and Ising Spin Glasses","268525551":"Genetic Algorithms in Wireless Networking: Techniques, Applications, and Issues","2609109":"Teacher: A Genetics-Based System for Learning and for Generalizing Heuristics","220739803":"Data-intensive computing for competent genetic algorithms: A pilot study using Meandre","220740828":"Linkage learning, overlapping building blocks, and systematic strategy for scalable recombination","238707150":"GAMBLER\u0027S RUIN MODEL AND GA","285391095":"Computational Intelligence: Synergies of Fuzzy Logic, Neural Networks and Evolutionary Computing","3418562":"Parameter control in evolutionary algorithms. — IEEE Trans. Evolutionary Computation, Vol. 3, No. 2, pp. 124-141","222670527":"Evolutionary algorithms in noisy environments: theoretical issues and guidelines for practice","223848108":"An automated hybrid genetic-conjugate gradient algorithm for multimodal optimization problems","220740819":"Empirical Analysis of Ideal Recombination on Random Decomposable Problems","222993079":"The strongest schema learning GA and its application to multilevel thresholding","223195315":"GA performance distributions and randomly generated binary constraint satisfaction problems","216301338":"Design of Modern Heuristics: Principles and Application"},"index":946}