{"abs":"The rate of convergence of various sweep strategies of stochastic relaxation for simulating multivariate Gaussian measures are calculated and compared. Each sweep strategy prescribes a method for chosing which coordinates of the random vector are to be updated. Deterministic sweep strategies in which the coordinates are updated according to a fixed order are compared to random strategies in which the coordinate to be updated is chosen through some random mechanism. In addition block updating, in which a few coordinates are updated simultaneously, is compared to single coordinate updating.","title":"Comparing sweep strategies for stochastic relaxation","id":23630599,"url":"https://www.researchgate.net/publication/23630599_Comparing_sweep_strategies_for_stochastic_relaxation","names":["Yali Amit","U. Grenander","Journal of Multivariate Analysis"],"references":{"243786502":"Stochastic relaxation, Gibbs distrib. Bayesian restoration of img","244446162":"Tutorial in Pattern Theory","243765427":"A Pattern Theoretical Study of Biological Shapes","200622065":"Equation of State Calculations by Fast Computing Machines","200105001":"Equation of State by Fast Computing Machines","50334293":"An Introduction to Numerical Linear Algebra","265428522":"Toeplitz Forms and Their Applications, Berkeley","264959696":"Numerical Methods for Partial Diferential Equations","226423937":"Random walks generated by affine mappings"},"citedIn":{"3318455":"A peak preserving algorithm for the removal of colored noise from signals","2119719":"Accelerating diffusions. Ann Appl Prob","265295453":"Efficient Gaussian Sampling for Solving Large-Scale Inverse Problems using MCMC","2652325":"Applications Of Cheeger\u0027s Constant To The Convergence Rate Of Markov Chains On R n","257147229":"Applications of geometric bounds to the convergence rate of Markov chains on Rn","271952315":"Simulating Large Gaussian Random Vectors Subject to Inequality Constraints by Gibbs Sampling","261289218":"Irreversible Langevin samplers and variance reduction: A large deviations approach","14070086":"Semiparametric Estimation of Major Gene and Family-Specific Random Effects for Age of Onset","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","23644795":"Optimizing random scan Gibbs samplers","239755230":"On the performance of the gibbs sampler for the multivariate normal distribution","3193514":"Graphical Gaussian Shape Models and Their Application to Image Segmentation","238092075":"Nonreversible perturbations accelerate convergence","226090855":"Asymptotic behavior of eigenvalues and random updating schemes","2642998":"Analysis of systematic scan Metropolis algorithms using Iwahori-Hecke algebra techniques","273394159":"Sampling From Gaussian Markov Random Fields Using Stationary and Non-Stationary Subgraph Perturbations","243043930":"Multiple-site updates in maximum a posteriori and marginal posterior modes image estimation","241527245":"Computation Intensive Methods: State of the Art","220785411":"Image Indexing by Focus Map.","251425239":"Bayesian calibration of a large-scale geothermal reservoir model by a new adaptive delayed acceptance Metropolis Hastings algorithm","2778374":"Methods for Approximating Integrals in Statistics with Special Emphasis on Bayesian Integration Problems","2834456":"Outperforming the Gibbs sampler empirical estimator for nearest neighbor random fields","229760130":"Gibbs Sampling","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","48172385":"Discrimination for Two Way Models with Insurance Application","255588474":"An upper bound on the convergence time of the Gibbs sampler in Ising models","266723490":"A Statistical Approach to Identifying Closed Object Boundaries in Images","48167060":"On the Stationary Distribution of Iterative Imputations","260161226":"Convergence Rates of the Gibbs Sampler, the Metropolis Algorithm and Other Single-Site Updating Dynamics","257196313":"Hit-And-Run enables efficient weight generation for simulation-based multiple criteria decision analysis","228781421":"On the Orderings and Groupings of Conditional Maximizations within ECM-Type Algorithms","226755156":"A study of simulated annealing and a revised cascade algorithm for image reconstruction","239756954":"To Center or Not to Center: That is Not the Question — An Ancillarity-Sufficiency Interweaving Strategy (ASIS) for Boosting MCMC Efficiency","227623232":"Markov Chain Monte Carlo Method and its applications","226539729":"Convergence assessment techniques for Markov chain Monte Carlo","222469520":"Markov chain convergence: From finite to infinite","226235688":"Rate of Convergence of the Gibbs Sampler in the Gaussian Case","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","38357534":"On the Rate of Convergence of the ECM Algorithm","243043108":"A note on Markov chain Monte Carlo sweep strategies","286510152":"Surprising Convergence Properties of Some Simple Gibbs Samplers under Various Scans","2729461":"Analysis of the Gibbs sampler for a model related to James-Stein estimators","265623304":"Sampling Gaussian Distributions in Krylov Spaces with Conjugate Gradients","7452716":"Relative focus map estimation using blind deconvolution","263032816":"Attaining the Optimal Gaussian Diffusion Acceleration","220785096":"Use of Human Motion Biometrics for Multiple-View Registration","2756430":"A Simulated Annealing Version of the EM Algorithm for non-Gaussian deconvolution","23631235":"On the Geometrical Convergence of Gibbs Sampler inRd","4109395":"Shuffling by semi-random transpositions","232980748":"Applications of random walks on graphs to Gibbs samplers","242986132":"Use of the Gibbs sampler to invert large, possibly sparse, positive definite matrices","234841099":"sampling krylov spaces","4215351":"Motion-based flexible camera registration","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","225775628":"Implementing random scan Gibbs samplers","222668728":"Jump–diffusion Markov processes on orthogonal groups for object pose estimation"},"index":948}