{"abs":"The main goal of multiobjective optimization is to achieve a set of well-converged and evenly-distributed Pareto optimal points. While evolutionary algorithms have been reported to converge well, their distribution performance might not be as uniform as we expected, especially when the problems to be optimized involve complex Pareto fronts. In this paper, with the aid of a set of uniformly-distributed reference points, multiobjective optimization problems (MOPs) can be handled by minimizing least reference distances (LRD), which measure the proximity of solutions to their nearest reference points. This way, the uniformity of approximated solutions is implicitly controlled by the reference point set, and convergence is in the charge of LRD. The proposed LRD algorithm (LRDA) is tested and compared with several popular algorithms on a number of old and newly-developed MOPs that have complex Pareto fronts, showing that this method is very promising to obtain evenly-distributed Pareto optimal points for the problems considered in this paper.","title":"Approximating Multiobjective Optimization Problems with Complex Pareto Fronts","id":280554681,"url":"https://www.researchgate.net/publication/280554681_Approximating_Multiobjective_Optimization_Problems_with_Complex_Pareto_Fronts","names":["Shouyong Jiang","Shengxiang Yang"],"references":{"233529610":"Generalized Decomposition and Cross Entropy Methods for Many-Objective Optimization","271964468":"An Improved Multiobjective Optimization Evolutionary Algorithm Based on Decomposition for Complex Pareto Fronts","220743499":"Simultaneous Use of Different Scalarizing Functions in MOEA/D","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","2460803":"Normal-Boundary Intersection: A New Method for Generating the Pareto Surface in Nonlinear Multicriteria Optimization Problems","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","239946277":"MOEA/D with adaptive weight adjustment","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","251953199":"T-MOEA/D: MOEA/D with Objective Transform in Multi-objective Problems","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","262605034":"Decomposition of a Multiobjective Optimization Problem Into a Number of Simple Multiobjective Subproblems","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","221228379":"Adaptation of Scalarizing Functions in MOEA/D: An Adaptive Scalarizing Function-Based Multiobjective Evolutionary Algorithm","257153541":"MOEA/D + uniform design: A new version of MOEA/D for optimization problems with many objectives","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","264387359":"An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point-Based Nondominated Sorting Approach, Part I: Solving Problems With Box Constraints","224472028":"The performance of a new version of MOEA/D on CEC09 unconstrained MOP test instances"},"citedIn":{},"index":949}