{"abs":"Adaptive Multilevel Splitting (AMS) is a replica-based rare event sampling method that has been used successfully in high-dimensional stochastic simulations to identify trajectories across a high potential barrier separating one metastable state from another, and to estimate the probability of observing such a trajectory. An attractive feature of AMS is that, in the limit of a large number of replicas, it remains valid regardless of the choice of reaction coordinate used to characterize the trajectories. Previous studies have shown AMS to be accurate in Monte Carlo simulations. In this study, we extend the application of AMS to molecular dynamics simulations and demonstrate its effectiveness using a simple test system. Our conclusion paves the way for useful applications, such as molecular dynamics calculations of the characteristic time of drug dissociation from a protein target.","title":"Adaptive Multilevel Splitting in Molecular Dynamics Simulations","id":276343589,"url":"https://www.researchgate.net/publication/276343589_Adaptive_Multilevel_Splitting_in_Molecular_Dynamics_Simulations","names":["David Aristoff","Tony Lelièvre","Christopher G. Mayne","Ivan Teo"],"references":{"260938253":"Using Collective Variables To Drive Molecular Dynamics Simulations","225092463":"Comparison of Simple Potential Functions for Simulating Liquid Water","49819199":"A multiple replica approach to simulate reactive trajectories","234939543":"Finite representation of an infinite bulk system: Solvent boundary potential for computer simulations","263021460":"Analysis of Adaptive Multilevel Splitting algorithms in an idealized case","262108949":"Analysis of Adaptive Multilevel Splitting algorithms in an idealized case","226031060":"Sequential Monte Carlo for rare event estimation","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","231437735":"Conformational Flexibility of o-Phosphorylcholine and o-Phosphorylethanolamine: A Molecular Dynamics Study of Solvation Effects","230987225":"Position-dependent diffusion coefficients and free energies from Bayesian analysis of equilibrium and replica molecular dynamics simulations","7542956":"Scalable molecular dynamics with NAMD. Comp. Chem. 26, 1781-1802"},"citedIn":{},"index":95}