{"abs":"Various kinds of new engineering technologies have been studied to realize the low-carbon and sustainable power supply systems all over the world. In actual implementation of these technologies, mostly, there are multiple objectives with trade off relationships among each other, and also various constraints in the achievement of these objectives. Therefore, it should be essential to solve multi-objective optimization problems effectively in the applications of these new technologies in power systems. This paper proposes an improved method to realize multi-objective optimization for critical challenges in advanced power systems. To realize that, in an optimal dispersed generation installation problem, that is, one of effective measures for low-carbon power systems, various optimization methods and their combination methods are evaluated and a hybrid method for evolutionary algorithms was developed. The method can provide improved results compared with other state-of-the-art multi-objective optimization methods.","title":"A hybrid multi-objective optimization method considering optimization problems in power distribution systems","id":273298662,"url":"https://www.researchgate.net/publication/273298662_A_hybrid_multi-objective_optimization_method_considering_optimization_problems_in_power_distribution_systems","names":["Ken Kuroda","Hideki Magori","Tomiyasu Ichimura","Ryuichi Yokoyama"],"references":{"3949342":"MOPSO: A proposal for multiple objective particle swarm optimization","224178079":"Efficient Constrained Optimization by the ε Constrained Rank-Based Differential Evolution","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","3418684":"Kennedy, J.: The Particle Swarm: Explosion, Stability and Convergence in a Multi-Dimensional Complex Space. IEEE Trans. on Evolutionary Computation 6, 58-73","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","239434569":"Modified Multi-objective Particle Swarm Optimization Method and its Application to Energy Management System for Factories","3865142":"Comparing inertial weights and Constriction factor in particle swarm optimization","215757874":"The Pareto Archive Evolution Strategy: A New Baseline Algorithm for Multi-Objective Optimization","224579852":"JADE: Adaptive Differential Evolution With Optional External Archive","4284718":"Multiobjective Optimization Challenges in Power System: The Next Step Forward","246648860":"Differential Evolution: A Simple and Efficient Adaptive Scheme for Global Optimization Over Continuous Spaces","229673824":"Modified multiobjective particle swarm optimization method and its application to energy management system for factories","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","224376044":"Newton-Downhill algorithm for distribution power flow analysis","3642851":"Minimizing the Real Functions of the ICEC \u002796 Contest by Differential Evolution","220742045":"Lecture Notes in Computer Science","273453883":"Particle Swarm Optimization","229584213":"Comparative Studies of Particle Swarm Optimization Techniques for Reactive Power Allocation Planning in Power Systems","265021232":"IPESA-II: Improved Pareto Envelope-Based Selection Algorithm II","239062948":"PESA-II: Region-based selection in evolutionary multiobjective optimization"},"citedIn":{"276929281":"Multi-objective component sizing based on optimal energy management strategy of fuel cell electric vehicles"},"index":951}