{"abs":"Wind energy has become the world’s fastest growing energy source. Although wind farm layout is a well known problem, its solution used to be heuristic, mainly based on the designer experience. A key in search trend is to increase power production capacity over time. Furthermore the production of wind energy often involves uncertainties due to the stochastic nature of wind speeds. The addressed problem contains a novel aspect with respect of other wind turbine selection problems in the context of wind farm design. The problem requires selecting two different wind turbine models (from a list of 26 items available) to minimize the standard deviation of the energy produced throughout the day while maximizing the total energy produced by the wind farm. The novelty of this new approach is based on the fact that wind farms are usually built using a single model of wind turbine. This paper describes the usage of multi-objective evolutionary algorithms (MOEAs) in the context of power energy production, selecting a combination of two different models of wind turbine along with wind speeds distributed over different time spans of the day. Several MOEAs variants belonging to the most renowned and widely used algorithms such as SPEA2 NSGAII, PESA and msPEA have been investigated, tested and compared based on the data gathered from Cancun (Mexico) throughout the year of 2008. We have demonstrated the powerful of MOEAs applied to wind turbine selection problem (WTS) and estimate the mean power and the associated standard deviation considering the wind speed and the dynamics of the power curve of the turbines. Among them, the performance of PESA algorithm looks a little bit superior than the other three algorithms. In conclusion, the use of MOEAs is technically feasible and opens new perspectives for assisting utility companies in developing wind farms.","title":"Wind turbine selection for wind farm layout using multi-objective evolutionary algorithms","id":263091997,"url":"https://www.researchgate.net/publication/263091997_Wind_turbine_selection_for_wind_farm_layout_using_multi-objective_evolutionary_algorithms","names":["Francisco G. Montoya","Francisco Manzano-Agugliaro","Sergio López-Márquez","Quetzalcoatl Hernández-Escobedo","Consolación Gil","Expert Systems with Applications"],"references":{"229383468":"Statistical analysis of wind power in the region of Veracruz (Mexico)","224161372":"Uncertainty analysis for wind energy production with dynamic power curves","277401610":"Farm Wide Dynamics: The Next Critical Wind Energy Frontier","223594459":"Placement of wind turbines using genetic algorithms. Renew Energy","239347533":"Jiménez Á, Costa A. Comparative study of the behavior of wind-turbines in a wind farm","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","232406871":"Experimental investigation of wake effects on wind turbine performance","2523573":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimization: NSGA-II","227413012":"Wind power analysis and site matching of wind turbine generators in Kingdom of Bahrain","225794287":"A hybrid method for solving multi-objective global optimization problems","271564212":"Scientific production of renewable energies worldwide: An overview","223413837":"Minimization of voltage deviation and power losses in power networks using Pareto optimization methods","259158766":"A comprehensive review on wind turbine power curve modeling techniques","256473559":"The Potential of Wind Energy to Largely Displace Existing Canadian Fossil Fuel and Nuclear Electricity Generation","276057941":"General Model for Representing Variable Speed Wind Turbines in Power System Dynamics Simulations","264428640":"Iterative non-deterministic algorithms in on-shore wind farm design: A brief survey 372 2.2. Single-objective and multi-objective approaches to the wind farm layout problem","220215427":"The mean-variance cardinality constrained portfolio optimization problem: An experimental evaluation of five multiobjective evolutionary algorithms","268719779":"Metaheuristics: From Design to Implementation","235769509":"Wake effect in Wind Farm Performance: Steady-State and Dynamic Behaviour","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","260215592":"Performance evaluation of wind turbines for energy generation in Niger Delta, Nigeria","225137729":"Implementation of scatter search for multi-objective optimization: A comparative study","227421345":"Is the wind a periodical phenomenon? The case of Mexico","245190063":"Wind turbines type and number choice using combinatorial optimization","257548010":"Modeling and investigation of the wind resource in the gulf of Tunis, Tunisia","273080949":"On-Shore Wind Farm Cable Network Optimisation Utilising a Multiobjective Genetic Algorithm","224209643":"Overview of Multi-MW Wind Turbines and Wind Parks","262914204":"Hybridization of Multi-Objective Evolutionary Algorithms and Artificial Neural Networks for Optimizing the Performance of Electrical Drives","260481852":"Performance evaluation of small wind turbines for off grid applications in Saudi Arabia","229937160":"Towards finding global representations of the efficient set in multiple objective Mathematical Programming","257404778":"Discovering driving strategies with a multiobjective optimization algorithm","222659579":"Optimization of wind turbine energy and power factor with an evolutionary computation algorithm","216300453":"Evolutionary Algorithms for Solving Multi-Objective Problems SE – Genetic and Evolutionary Computation","270985957":"Assessment of wind power generation along the coast of Ghana","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","262240232":"Genetic algorithm for S-transform optimisation in the analysis and classification of electrical signal perturbations","235949146":"A parallel multi-objective algorithm for two-dimensional bin packing with rotations and load balancing","245189975":"Optimization of wind farm turbines layout using an evolutive algorithm","234783157":"NSGA-II-Trained Neural Network Approach to the Estimation of Prediction Intervals of Scale Deposition Rate in Oil \u0026 Gas Equipment","245101008":"Optimization of wind turbine positioning in large wind farms by means of a Genetic algorithm. J Wind Eng Ind Aerody","220551022":"An evolutive algorithm for wind farm optimal design","227421376":"Optimization methods applied to renewable and sustainable energy: a review. Renew Sustain Energy Rev","232274967":"A Simulated Annealing-based parallel multi-objective approach to vehicle routing problems with time windows","275256760":"Wind energy resource in Northern Mexico","260042797":"Renewable energy research progress in Mexico: A review","241113740":"Wind resource evaluation in São João do Cariri (SJC) – Paraiba, Brazil","8400211":"Stabilization Wedges: Solving the Climate Problem for the Next 50 Years with Current Technologies","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","228847095":"Design of wind farm layout for maximum wind energy capture. Renewable Energy","46658204":"Cost Reduction Prospects for Offshore Wind Farms","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","279344455":"International Series in Operations Research \u0026 Management Science","232274994":"Multi-objective Crop Planning using Pareto-based Evolutionary Algorithms","5095459":"Characterization of Pareto Dominance","227421281":"The wind power of Mexico","232274985":"Annealing-tabu PAES: a Multi-objective Hybrid Meta-heuristic","229357529":"New approach on optimization in placement of wind turbines within wind farm by genetic algorithms","256939042":"Pareto-based evolutionary algorithms for the calculation of transformation parameters and accuracy assessment of historical maps","223262904":"100% Renewable energy systems, climate mitigation and economic growth","223337139":"Energy efficiency, security of supply and the environment in South Africa: Moving beyond the strategy documents","257403946":"Evolutionary algorithms for the design of grid-connected PV-systems","271638223":"Review of power curve modeling for wind turbines"},"citedIn":{"286653477":"Impact of Large-Scale Wind Power Integration on Small Signal Stability Based on Stability Region Boundary","282158145":"On the Optimal Design of Airfoils","277563912":"Research on a Small Signal Stability Region Boundary Model of the Interconnected Power System with Large-Scale Wind Power","281361120":"Multi-expert wind energy technology selection using interval-valued intuitionistic fuzzy sets","277818154":"A study of single multiplicative neuron model with nonlinear filters for hourly wind speed prediction","267573332":"Wind power forecast using wavelet neural network trained by improved Clonal selection algorithm","276099010":"Research on the Multi-Period Small-Signal Stability Probability of a Power System with Wind Farms Based on the Markov Chain","279161931":"An interactive decision-support system for multi-objective optimization of nonlinear dynamic processes with uncertainty","276379827":"An Integrated Control and Design Framework for Optimizing Energy Capture and Component Life for a Wind Turbine Variable Ratio Gearbox","287968166":"Combining multi-objective evolutionary algorithms and descriptive analytical modelling in energy scenario design","265644907":"Novel fuzzy logic based sensorless maximum power point tracking strategy for wind turbine systems driven DFIG (doubly-fed induction generator)"},"index":954}