{"abs":"We propose an efficient evolutionary multi-objective optimization approach to the capacitated facility location–allocation problem (CFLP) for solving large instances that considers flexibility at the allocation level, where financial costs and CO2 emissions are considered simultaneously. Our approach utilizes suitably adapted Lagrangian Relaxation models for dealing with costs and CO2 emissions at the allocation level, within a multi-objective evolutionary framework at the location level. Thus our method assesses the robustness of each location solution with respect to our two objectives for customer allocation. We extend our exploration of selected solutions by considering a range of trade-offs for customer allocation.","title":"A hybrid multi-objective approach to capacitated facility location with flexible store allocation for green logistics modeling","id":261186800,"url":"https://www.researchgate.net/publication/261186800_A_hybrid_multi-objective_approach_to_capacitated_facility_location_with_flexible_store_allocation_for_green_logistics_modeling","names":["Irina Harris","Christine Mumford","Mohamed M. Naim","Transportation Research Part E Logistics and Transportation Review"],"references":{"223406034":"Green logistics at Eroski: a case study. Int J Prod Econ","266487905":"Bi-objective supply chain problem using MOPSO and NSGA-II","216545901":"Genetic Algorithms in Search, Optimization, and Machine Learning. Menlo Park, CA: Addison-Wesley","235445120":"Discrete Location Theory","223261893":"A class of multi-objective supply chain networks optimal model under random fuzzy environment and its application to the industry of Chinese liquor","4940762":"An Algorithm for Solving Large Capacitated Warehouse Location Problems","2523573":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimization: NSGA-II","227427223":"A heuristic approach to logistics network design for end-of-lease computer products recovery. Transp Res E","216300536":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimisation: NSGA-II.","220695738":"Facility Location: Applications and Theory","223394893":"Environmental conscious long-range planning and design of supply chain networks","222569818":"A goal programming model for paper recycling system","223805302":"An exact algorithm for the capacitated facility location problem with single sourcing","226735265":"Solving conflicting bi-objective facility location problem by NSGA II evolutionary algorithm","225223496":"A flexible three-level logistic network design considering cost and time criteria with a multi-objective evolutionary algorithm. J Intell Manuf","228697349":"Creating a green supply chain","223398390":"Life cycle assessment of the transmission network in Great Britain","2946698":"Facility Location Under Uncertainty: A Review","227427110":"Integrating inventory impacts into a fixed-charge model for locating distribution centers","222237461":"‘The Relocation of a Hybrid Manufacturing/Distribution Facility from Supply Chain Perspectives: A Case Study’","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","240293756":"An Applications Oriented Guide to Lagrangian Relaxation","226658604":"A cutting plane algorithm for the capacitated facility location problem","4867429":"Strategic Facility Location: A Review","220462355":"Solution methods for the bi-objective (cost-coverage) unconstrained facility location problem with an illustrative example","32036313":"Network and Discrete Location: Models, Algorithms and Applications","285191373":"A Simulated Annealing Algorithm for the Design and Planning of Supply Chains with Economic and Environmental Objectives","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","257403363":"An evolutionary approach for multi-objective optimization of the integrated location–inventory distribution network problem in vendor-managed inventory","46491377":"Solving multiobjective, multiconstraint knapsack problems using mathematical programming and evolutionary algorithms","30873058":"Genetic + Data Structures \u003d Evolution Programs","200035290":"The Lagrangian Relaxation Method for Solving Integer Programming Problem","257404385":"Location and allocation decisions for multi-echelon supply chain network – A multi-objective evolutionary approach","223920367":"Assessing the impact of cost optimization based on infrastructure modelling on CO2 emissions","262352410":"An evolutionary Bi-objective approach to the capacitated facility location problem with cost and CO 2 emissions","4913520":"Designing and evaluating sustainable logistics networks","222800519":"An integrated logistics operational model for green-supply chain management. Transport Res E","4940553":"A new Lagrangian relaxation approach to the generalized assignment problem","225527731":"Designing an integrated multi-echelon agile supply chain network: A hybrid taguchi-particle swarm optimization approach","228901223":"Comparative analysis of the carbon footprints of conventional and online retailing: A “last mile” perspective","235960151":"Strategic analysis of logistics and supply chain management systems using the analytical network process. Transpn Res-E (Logist Transpn Rev)","285851456":"Designing the logistics network","227621981":"Optimal design of sustainable cellulosic biofuel supply chains: multiobjective optimization coupled with life cycle assessment and input-output analysis. AIChE J","245222609":"A bi-objective supply chain design problem with uncertainty. Transp Res Part C","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","233747001":"Environmental supply chain network design using multi-objective fuzzy mathematical programming","236158155":"Application of fuzzy optimization to a supply chain network design: A case study of an edible vegetable oils manufacturer","220197191":"A Multi-Objective Optimization for Green Supply Chain Network Design","50926800":"A simulation-based multi-objective genetic algorithm approach for networked enterprises optimization","3949538":"A simple evolutionary algorithm for multi-objective optimization (SEAMO)","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","223634615":"A genetic algorithm approach for multi-objective optimization of supply chain networks. Comput Ind Eng","223248170":"Incorporating environmental impacts and regulations in a holistic supply chains modeling: An LCA approach","235293026":"Designing green supply chain","257581247":"Multi objective outbound logistics network design for a manufacturing supply chain","221006281":"Comparing algorithms, representations and operators for the multi-objective knapsack problem","220462149":"A multi-objective evolutionary optimization approach for an integrated location-inventory distribution network problem under vendor-managed inventory systems","201976815":"Genetic Algorithms \u0026 Engineering Design","226105111":"An effective heuristic for large-scale capacitated facility location problems","222346413":"A heuristic Lagrangean algorithm for the capacitated plant location problem. Euro J Oper Res","223284770":"An Environmental Life Cycle Optimization Model for the European Pulp and Paper Industry","224301744":"Light beam search based multi-objective optimization using evolutionary algorithms","201976957":"Evolutionary Algorithms in Theory and Practice","228701013":"Reactive GRASP and Tabu Search based heuristics for the single source capacitated plant location problem","222398647":"Facility location models for distribution system design. Eur J Oper Res","224472344":"The multi-objective uncapacitated facility location problem for green logistics","220740945":"Simple Population Replacement Strategies for a Steady-State Multi-objective Evolutionary Algorithm","222795194":"Multiple criteria facility location problems: A survey","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","222534332":"Multi-objective Optimization using Genetic Algorithms: a Tutorial"},"citedIn":{"269037769":"An iterated tabu search heuristic for the Single Source Capacitated Facility Location Problem","270456124":"Design and planning for green global supply chains under periodic review replenishment policies","228901223":"Comparative analysis of the carbon footprints of conventional and online retailing: A “last mile” perspective","287972361":"The opportunities of implementing green technologies for supply chain management","277131394":"A Bi-objective Railroad Track Inspection Planning Problem","273399308":"Location selection of city logistics centers under sustainability","283337738":"Performance comparison of three meta-heuristic algorithms for solving a green supply chain planning problem","273525542":"A Hybrid Simulation Model for Green Logistics Assessment in Automotive Industry","282391769":"Otimização multicritério para o problema de localização de centros de distribuição de uma empresa com unidade produtiva no Polo Industrial de Manaus","282444312":"Review of Green Supply Chain Processes","265846600":"A Modified Particle Swarm Optimization for solving the integrated location and inventory control problems in a two-echelon supply chain network","276093071":"Carbon pricing versus emissions trading: A supply chain planning perspective","277684112":"Sustainable Rent-Based Closed-Loop Supply Chain for Fashion Products","281495161":"The Multi-objective Capacitated Facility Location Problem for Green Logistics","283812757":"Modeling Multi-objective Facility Location Allocation Problem within Green Logistics Network Design"},"index":956}