{"abs":"In the multi-objective approach to constraint-handling, a constrained problem is transformed into an unconstrained one by defining additional optimization criteria to account for the problem constraints. In this paper, this approach is explored in the context of the hydrophobic-polar model, a simplified yet challenging representation of the protein structure prediction problem. Although focused on such a particular case of study, this research work is intended to contribute to the general understanding of the multi-objective constraint-handling strategy. First, a detailed analysis was conducted to investigate the extent to which this strategy impacts on the characteristics of the fitness landscape. As a result, it was found that an important fraction of the infeasibility translates into neutrality. This neutrality defines potentially shorter paths to move through the landscape, which can also be exploited to escape from local optima. By studying different mechanisms, the second part of this work highlights the relevance of introducing a proper search bias when handling constraints by multi-objective optimization. Finally, the suitability of the multi-objective approach was further evaluated in terms of its ability to effectively guide the search process. This strategy significantly improved the performance of the considered search algorithms when compared with respect to commonly adopted techniques from the literature.","title":"Constraint-handling through multi-objective optimization: The hydrophobic-polar model for protein structure prediction","id":265644972,"url":"https://www.researchgate.net/publication/265644972_Constraint-handling_through_multi-objective_optimization_The_hydrophobic-polar_model_for_protein_structure_prediction","names":["Mario Garza-Fabre","Eduardo Rodriguez-Tello","Gregorio Toscano Pulido","Computers \u0026 Operations Research"],"references":{"5968219":"A replica exchange Monte Carlo algorithm for protein folding in the HP model","6937065":"A multi-objective evolutionary approach to the protein structure prediction problem. J R Soc Interface 3:139-151","234070386":"Particle Swarm Optimization Approach for Protein Structure Prediction in the 3D HP Model","220742185":"Investigating Relevant Aspects of MOEAs for Protein Structures Prediction","220742826":"A genetic algorithm with backtracking for protein structure prediction","245076755":"An improved PSO for dynamic load dispatch of generators with valve-point effects","224472041":"A novel EDAs based method for HP model rotein folding","221024165":"An Enhanced Genetic Algorithm for Protein Structure Prediction Using the 2D Hydrophobic-Polar Model","221006629":"A Novel Hybrid Constraint Handling Technique for Evolutionary Optimization","13513541":"On the Complexity of Protein Folding","258246639":"Handling Constraints in the HP Model for Protein Structure Prediction by Multiobjective Optimization","14219476":"From Levinthal to pathways to funnels [J]","4074673":"Study of fitness landscapes for the HP model of protein structure prediction","3418916":"An Immune Algorithm for Protein Structure Prediction on Lattice Models","225973481":"Computational Studies of Peptide and Protein Structure Prediction Problems via Multiobjective Evolutionary Algorithms","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","236987188":"Cross-lattice Behavior of General ACO Folding for Proteins in the HP Model","258795256":"Hydrophobic-Polar Model Structure Prediction with Binary-Coded Artificial Plant Optimization Algorithm","262292791":"Multiobjectivization with NSGA-ii on the noiseless BBOB testbed","225336568":"A Comprehensive Survey on Fitness Landscape Analysis","2316980":"Reducing Local Optima in Single-Objective Problems by Multi-objectivization","3421612":"Search Biases in Constrained Evolutionary Optimization","3419054":"Protein Folding in Simplified Models With Estimation of Distribution Algorithms","249315526":"Multi-Objective Stochastic Search for Sampling Local Minima in the Protein Energy Surface","220739890":"Evolutionary algorithms and multi-objectivization for the travelling salesman problem","242655061":"Customized Evolutionary Optimization Procedure for Generating Minimum Weight Compliant Mechanisms","2881421":"Multimeme Algorithms For Protein Structure","4201577":"Multi-objective approaches in a single-objective optimization environment","220867334":"A Hybrid Immune-Based System for the Protein Folding Problem","263453855":"Helper-Objectives: Using Multi-Objective Evolutionary Algorithms for Single-Objective Optimisation: Evolutionary Computation Combinatorial Optimization (Editors: Jens Gottlieb, Emma Hart, Martin Middendorf, Günter Raidl and Colin Reeves)","261051169":"Niching by multiobjectivization with neighbor information: Trade-offs and benefits","256721528":"A survey of techniques for characterising fitness landscapes and some possible ways forward","19041815":"Principles that Govern the Folding of Protein Chains","221959695":"The Roles of Mutation, Inbreeding, Crossbreeding and Selection in Evolution","51332792":"Protein Folding in the Hydrophobic-Hydrophilic ( HP ) Model is NP-Complete","6256359":"Biopolymer structure simulation and optimization via fragment regrowth Monte Carlo","221583119":"Protein Structure Prediction Using Evolutionary Algorithms Hybridized with Backtracking","260622131":"Multiobjectivization via Helper-Objectives With the Tunable Objectives Problem","220702233":"Multiobjectivization by Decomposition of Scalar Cost Functions","259579207":"A Firefly-Inspired Method for Protein Structure Prediction in Lattice Models","2690838":"On the Complexity of Protein Folding","220867561":"A Class of Pareto Archived Evolution Strategy Algorithms Using Immune Inspired Operators for Ab-Initio Protein Structure Prediction","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","226411194":"Unraveling the Beautiful Complexity of Simple Lattice Model Polymers and Proteins Using Wang-Landau Sampling","258246561":"Comparative Analysis of Different Evaluation Functions for Protein Structure Prediction Under the HP Model","222597761":"Neutrality in fitness landscapes","221008356":"A multiobjectivised memetic algorithm for the Frequency Assignment Problem","2665696":"A Standard GA Approach to Native Protein Conformation Prediction","48416171":"On the Neutrality of Flowshop Scheduling Fitness Landscapes","220199253":"Helper-objective optimization strategies for the Job-Shop Scheduling Problem","48416175":"A Study of Neutrality of Boolean Function Landscapes in Genetic Programming","200622136":"Metaheuristics from Design to Implementation","221009377":"A Comprehensive View of Fitness Landscapes with Neutrality and Fitness Clouds","265500829":"Using multi-objective evolutionary algorithms for single-objective optimization","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","220514421":"Constraint-handling in nature-inspired numerical optimization: past, present and future. Swarm Evol Comput","231691677":"A Lattice Statistical Mechanics Model of the Conformational and Sequence Spaces of Proteins","225767712":"Evolutionary Algorithms for the Protein Folding Problem: A Review and Current Trends","260621916":"Clustered Memetic Algorithm With Local Heuristics for Ab Initio Protein Structure Prediction","2179189":"Protein Structure Prediction as a Hard Optimization Problem: The Genetic Algorithm Approach","221228538":"On Sequential Online Archiving of Objective Vectors","257870088":"Spiral search: A hydrophobic-core directed local search for simplified PSP on 3D FCC lattice","227117023":"Iterated Local Search: Framework and Applications","3418601":"Yao, X.: Stochastic ranking for constrained evolutionary optimization. IEEE Trans. Evol. Comput. 4, 284-294","221007729":"A hybrid evolutionary approach to protein structure prediction with lattice models","19176132":"Theory for the Folding and Stability of Globular Proteins","228704833":"Solving the protein structure prediction problem through a multiobjective genetic algorithm. Nanotech 2:32-35","51881975":"Optimum Oil Production Planning Using Infeasibility Driven Evolutionary Algorithm","8023195":"An ant colony optimisation algorithm for the 2D and 3D hydrophobic polar protein folding problem, BMC","220702022":"Investigations into the Effect of Multiobjectivization in Protein Structure Prediction","221308885":"Differential Evolution for Protein Structure Prediction Using the HP Model","258246402":"An Improved Multiobjectivization Strategy for HP Model-Based Protein Structure Prediction","224472327":"A New Proposal to Hybridize the Nelder-Mead Method to a Differential Evolution Algorithm for Constrained Optimization","254462275":"Locality-based Multiobjectivization for the HP Model of Protein Structure Prediction","220585288":"A Differential Evolution Approach for Protein Folding Using a Lattice Model","220132720":"On discrete models and immunological algorithms for protein structure prediction","220886852":"Simple Feasibility Rules and Differential Evolution for Constrained Optimization","235709948":"Cours D\u0027Economie Politique","221204575":"A parallel multi-objective Ab initio approach for protein structure prediction","259162626":"A multiple minima genetic algorithm for protein structure prediction","225729412":"Novelty-Based Multiobjectivization","226319502":"Tackling Dynamic Problems with Multiobjective Evolutionary Algorithms","221228504":"Improving Computational Mechanics Optimum Design Using Helper Objectives: An Application in Frame Bar Structures","225197716":"Protein Conformation of a Lattice Model Using Tabu Search","201976305":"Genetic Algorithm for 3D Protein Folding Simulations","245028835":"Enhanced hybrid search algorithm for protein structure prediction using the 3D-HP lattice model","2546524":"A Complete and Effective Move Set for Simplified Protein Folding","1766753":"Fitness Landscape of the Cellular Automata Majority Problem: View from the ”Olympus”","2483934":"Constrained Evolutionary Optimization - the penalty function approach","4307900":"Trading on infeasibility by exploiting constraint’s criticality through multi-objectivization: A system design perspective"},"citedIn":{"283943383":"Using multi-objective evolutionary algorithms for single-objective constrained and unconstrained optimization"},"index":957}