{"abs":"Let $A$ be a finite set and $\\phi:A^Z\\to R$ be a locally constant potential. For each $\\beta\u003e0$ (\"inverse temperature\"), there is a unique Gibbs measure $\\mu_{\\beta\\phi}$. We prove that, as $\\beta\\to+\\infty$, the family $(\\mu_{\\beta\\phi})_{\\beta\u003e0}$ converges (in weak-$^*$ topology) to a measure we characterize. It is concentrated on a certain subshift of finite type which is a finite union of transitive subshifts of finite type. The two main tools are an approximation by periodic orbits and the Perron-Frobenius Theorem for matrices \\\u0027a la Birkhoff. The crucial idea we bring is a \"renormalization\" procedure which explains convergence and provides a recursive algorithm to compute the weights of the ergodic decomposition of the limit.","title":"Zero-temperature limit of one-dimensional Gibbs states via renormalization: The case of locally constant potentials","id":24163172,"url":"https://www.researchgate.net/publication/24163172_Zero-temperature_limit_of_one-dimensional_Gibbs_states_via_renormalization_The_case_of_locally_constant_potentials","names":["J. -R. Chazottes","Jean-Marc Gambaudo","Edgardo Ugalde","Ergodic Theory and Dynamical Systems"],"references":{"44725193":"Equilibrium States and the Ergodic Theory of Anosov Diffeomorphism","2327520":"Geometric Barycentres Of Invariant Measures For Circle Maps","233971734":"Thermodynamic Formalism","2110981":"Finite type approximations of Gibbs measures on sofic subshifts","228642566":"A dynamical proof for the convergence of Gibbs measures at temperature zero","264960364":"Regularity properties and pathologies of position-space renormalization-group transformations: Scope and limitations of Gibbsian theory","226233626":"On the Zero-Temperature Limit of Gibbs States","2093592":"Chaotic Temperature Dependence at Zero Temperature","268893194":"Asymptotics of Gibbs measures in one-dimensional lattice models","44478088":"Non-negative matrices and markov chains / E. Seneta","228801427":"Gibbs measures at temperature zero","30495393":"Gibbs Measures and Phase Transitions","242443041":"Non-Negative Matrices and Markov Chains","243075429":"Extensions of Jentzsch\u0027s Theorem","266256167":"Thermodynamic formalism. In: The mathematical structures of equilibrium statistical mechanics, 2nd edn. Cambridge Mathematical Library, Cambridge University Press, Cambridge","44556026":"Equilibrium states and the ergodic theory of Anosov diffeomorphisms / Robert Bowen"},"citedIn":{"281060065":"Sensitive Dependence of Gibbs Measures at Low Temperatures","221659924":"Flatness Is a Criterion for Selection of Maximizing Measures","51947324":"On the general one-dimensional XY Model: positive and zero temperature,\nselection and non-selection","51911804":"Selection of measure and a Large Deviation Principle for the general XY model","225485781":"Zero Temperature Limits of Gibbs Equilibrium States for Countable Markov Shifts","226233626":"On the Zero-Temperature Limit of Gibbs States","232238077":"Entropy and Variational Principle for one-dimensional Lattice Systems with a general a-priori probability: positive and zero temperature","45912368":"Selection of measures for a potential with two maxima at the zero temperature limit","265628920":"Thermodynamic Formalism, Maximizing Probabilities and Large Deviations","268227180":"Sensitive dependence of Gibbs measures","283531732":"Equilibrium states and zero temperature limit on topologically transitive countable Markov shifts","244989513":"Ground States are generically a Periodic Orbit","257201671":"Zero Temperature Limits of Gibbs States for Almost-Additive Potentials","228574763":"Description of Some Ground States by Puiseux Techniques","220403095":"Selection of Ground States in the Zero Temperature Limit for a One-Parameter Family of Potentials","228574761":"Description of some ground states by Puiseux technics","47523020":"Renormalization, Thermodynamic Formalism and Quasi-Crystals in Subshifts","51913697":"On the selection of subaction and measure for a subclass of potentials\ndefined by P. Walters","236683140":"Ergodic optimization, zero temperature limits and the max-plus algebra"},"index":959}