{"abs":"This paper addresses the issue of estimating extreme probability and quantile on the output of complex computer codes. We introduce a new approach to this problem in term of a random walk in the output space. This allows us to derive two main results: (1) the number of samples required to get a realisation of a random variable in a given domain of probability measure p is drastically reduced, following a Poisson law with parameter log 1/p; and (2) we get parallel algorithms for estimating probabilities and quantiles and especially the optimal parallel Multilevel Splitting algorithm where there is indeed no subset to define anymore.","title":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation","id":285321983,"url":"https://www.researchgate.net/publication/285321983_Rare_Event_Simulation_A_Point_Process_Interpretation_With_Application_In_Probability_And_Quantile_Estimation","names":["Clément Walter","Gilles Defaux"],"references":{"245284895":"Efficient Algorithm for Second-Order Reliability Analysis","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","51888191":"Metamodel-based importance sampling for the simulation of rare events","262108949":"Analysis of Adaptive Multilevel Splitting algorithms in an idealized case","264854211":"Combinatorial analysis of the adaptive last particle method","226031060":"Sequential Monte Carlo for rare event estimation","265727384":"Stochastic Simulation: Algorithms and Analysis","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","3086649":"Optimal Watermark Embedding and Detection Strategies Under Limited Detection Resources","41222435":"Monte Carlo Statistical Method","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","262265054":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms"},"citedIn":{"284750937":"Rare event simulation and spliting for discontinuous random variables"},"index":96}