{"abs":"Wireless multihop networks are being increasingly used in military and civilian applications. Advanced applications of wireless multihop networks demand better understanding on their properties. Existing research on wireless multihop networks has largely focused on static networks, where the network topology is time-invariant; and there is comparatively a lack of understanding on the properties of dynamic networks with dynamically changing topology. In this paper, we use and extend a recently proposed graph theoretic model, i.e. evolving graphs, to capture the characteristics of such networks. We extend and develop the concepts of route matrix, connectivity matrix and probabilistic connectivity matrix as convenient tools to characterize and investigate the properties of evolving graphs and the associated dynamic networks. The properties of these matrices are established and their relevance to the properties of dynamic wireless multihop networks are introduced.","title":"Graph theoretic models and tools for the analysis of dynamic wireless multihop networks","id":220972477,"url":"https://www.researchgate.net/publication/220972477_Graph_theoretic_models_and_tools_for_the_analysis_of_dynamic_wireless_multihop_networks","names":["Guoqiang Mao","Brian Anderson"],"references":{"224648675":"Performance Evaluation of Dynamic Networks using an Evolving Graph Combinatorial Model","263875422":"COMPUTING SHORTEST, FASTEST, AND FOREMOST JOURNEYS IN DYNAMIC NETWORKS","3080038":"The capacity of wireless networks. IEEE T Inform Theory","23634721":"The connectivity of a graph on uniform points on [0,1]d","37402515":"Latency of wireless sensor networks with uncoordinated power saving mechanisms","220655050":"Scaling Laws for Ad Hoc Wireless Networks: An Information Theoretic Approach","221207330":"Complexity of Connected Components in Evolving Graphs and the Computation of Multicast Trees in Dynamic Networks","44478088":"Non-negative matrices and markov chains / E. Seneta","220779238":"On the connectivity of dynamic random geometric graphs","220694569":"Ad-hoc Networks: Fundamental Properties and Network Topologies","3965234":"An evaluation of connectivity in mobile wireless ad hoc networks","221932981":"Grossglauser, M.: Tse DNC. Mobility increases the capacity of ad hoc wireless networks. IEEE/ACM Trans. on Networking 10(4), 477-486","3282978":"Building a reference combinatorial model for MANETs","220466390":"Large Connectivity for Dynamic Random Geometric Graphs","242443041":"Non-Negative Matrices and Markov Chains","3156136":"Channel Occupancy Time Distribution in Cellular Radio System","2520190":"Critical Power for Asymptotic Connectivity In Wireless Networks","4165476":"On the critical total power for asymptotic k-connectivity in wireless networks","3421801":"Mobile Network Analysis Using Probabilistic Connectivity Matrices"},"citedIn":{"51932458":"Research on Wireless Multi-hop Networks: Current State and Challenges","261087260":"Improving reliability in lossy wireless networks using network coding","271192745":"Secure and Robust Multi-Constrained QoS aware Routing Algorithm for VANETs","221286548":"On the Information Propagation in Mobile Ad-Hoc Networks Using Epidemic Routing.","271532650":"Energy Efficient Broadcast in Mobile Networks Subject to Channel Randomness","246545622":"An Evolving Graph-Based Reliable Routing Scheme for VANETs","51933058":"On the Quality of Wireless Network Connectivity"},"index":961}