{"abs":"Recent developments in computational imaging and restoration have heralded the arrival and convergence of several powerful methods for adaptive processing of multidimensional data. Examples include Moving Least Square (from Graphics), the Bilateral Filter and Anisotropic Diffusion (from Machine Vision), Boosting and Spectral Methods (from Machine Learning), Non-local Means (from Signal Processing), Bregman Iterations (from Applied Math), Kernel Regression and Iterative Scaling (from Statistics). While these approaches found their inspirations in diverse fields of nascence, they are deeply connected. In this paper • I present a practical and unified framework to understand some of the basic underpinnings of these methods, with the intention of leading the reader to a broad understanding of how they interrelate. I also illustrate connections between these techniques and Bayesian approaches. • The proposed framework is used to arrive at new insights, methods, and both practical and theoretical results. In particular, several novel optimality properties of algorithms in wide use such as BM3D, and methods for their iterative improvement (or non-existence thereof) are discussed. • Several theoretical results are discussed which will enable the performance analysis and subsequent improvement of any existing restoration algorithm. While much of the material discussed is applicable to wider class of linear degradation models (e.g. noise, blur, etc.,) in order to keep matters focused, we consider the problem of denoising here.","title":"A Tour of Modern Image Processing","id":228545412,"url":"https://www.researchgate.net/publication/228545412_A_Tour_of_Modern_Image_Processing","names":["Peyman Milanfar"],"references":{"239382660":"All of Nonparametric Statistics","243772934":"Boosting with the L2Loss: Regression \u0026 Classification","224355038":"Accurate Image Search Using the Contextual Dissimilarity Measure","266962730":"Non-negative matrices and Markov chains. 2nd ed","224890851":"EDA: Exploratory data analysis","7252779":"Unsupervised, information-theoretic, adaptive image filtering for image restoration","244959198":"A New Approach to Low Level Image Processing Tech","3085670":"A monolithic Ka-band 0.25 μm GaAs MESFET transmitter for high volume production","3328440":"Kernel regression for image processing and reconstruction. IEEE Trans Image Process","221024486":"The Sinkhorn–Knopp Algorithm: Convergence and Applications","38363908":"Generalized Iterative Scaling for Log-Linear Models","6773289":"Optimal Spatial Adaptation for Patch-Based Image Denoising","221654200":"Fast Approximate Spectral Clustering","4986754":"Boosting With the L2 Loss: Regression and Classification","3410981":"Computing and Rendering Point Set Surfaces","4156462":"Higher-order image statistics for unsupervised, information-theoretic, adaptive, image filtering","3315110":"Matching Pursuit with Time-Frequency Dictionaries","220660158":"SUSAN- A new approach to low level image processing. Int J Comput Vis","3319912":"K-SVD: An Algorithm for Designing Overcomplete Dictionaries for Sparse Representation, IEEE Trans. Signal Processing, 54, 4311-4322","37425569":"Digital Picture Processing","227389206":"Applied Non-Parametric Regression","224381249":"Bovik, A.C.: Mean squared error: love it or leave it? - A new look at signal fidelity measures. IEEE Sig. Process. Mag. 26, 98-117","242986853":"On the diagonal scaling of Euclidean distance matrices to doubly stochastic matrices","2425210":"The Approximation Power Of Moving Least-Squares","244418126":"An Iterative Regularization Method for Total Variation-Based Image Restoration","38365974":"A Relationship Between Arbitrary Positive Matrices and Doubly Stochastic Matrices","2135297":"Kernel methods in machine learning","247611489":"Spectra of Nearly Hermitian Matrices","6151802":"Image Denoising by Sparse 3-D Transform-Domain Collaborative Filtering","243119700":"Surface Generated by Moving Least Square Methods","239666147":"Normalized and Difierential Convolution Methods for Interpolation and Filtering of Incomplete and Uncertain Data","6289716":"A Short- Time Beltrami Kernel for Smoothing Images and Manifolds","3766290":"Bilateral filtering for gray and color images. In Proc. ICCV","220691339":"Introduction to the Numerical Solution of Markov Chains","44478088":"Non-negative matrices and markov chains / E. Seneta","220320974":"Regularization on Graphs with Function-adapted Diffusion Processes","3309314":"On Iterative Regularization and Its Application","220681174":"Gradient of mutual information in linear vector Gaussian channels","3191811":"Scale-space and edge detection using anisotropic diffusion. IEEE Tran PAMI","228615765":"Diffusion Interpretation of Nonlocal Neighborhood Filters for Signal Denoising","245588053":"Bounds for eigenvalues of certain stochastic matrices. Linear Algebra Appl","6448916":"A New SURE Approach to Image Denoising: Interscale Orthonormal Wavelet Thresholding","41107019":"A Review of Image Denoising Algorithms, with a New One","24392845":"Digital Image Processing, Third Edition","5602025":"On the origin of the bilateral filter and ways to improve it","221619274":"Spectral Clustering with Perturbed Data"},"citedIn":{"257879788":"Robust flash denoising/deblurring by iterative guided filtering","264996911":"SURE Guided Gaussian Mixture Image Denoising"},"index":963}