{"abs":"In this paper, we present a new population-based Monte Carlo method, so-called MOMCMC (Multi-Objective Markov Chain Monte Carlo), for sampling in the presence of multiple objective functions in real parameter space. The MOMCMC method is designed to address the “multi-objective sampling” problem, which is not only of interest in exploring diversified solutions at the Pareto optimal front in the function space of multiple objective functions, but also those near the front. MOMCMC integrates Differential Evolution (DE) style crossover into Markov Chain Monte Carlo (MCMC) to adaptively propose new solutions from the current population. The significance of dominance is taken into consideration in MOMCMC’s fitness assignment scheme while balancing the solution’s optimality and diversity. Moreover, the acceptance rate in MOMCMC is used to control the sampling bandwidth of the solutions near the Pareto optimal front. As a result, the computational results of MOMCMC with the high-dimensional ZDT benchmark functions demonstrate its efficiency in obtaining solution samples at or near the Pareto optimal front. Compared to MOSCEM (Multiobjective Shuffled Complex Evolution Metropolis), an existing Monte Carlo sampling method for multi-objective optimization, MOMCMC exhibits significantly faster convergence to the Pareto optimal front. Furthermore, with small population size, MOMCMC also shows effectiveness in sampling complicated multi-objective function space.","title":"MOMCMC: An efficient Monte Carlo method for multi-objective sampling over real parameter space","id":257313203,"url":"https://www.researchgate.net/publication/257313203_MOMCMC_An_efficient_Monte_Carlo_method_for_multi-objective_sampling_over_real_parameter_space","names":["Yaohang Li","Computers \u0026 Mathematics with Applications"],"references":{"220741544":"Reference Point Based Multi-Objective Optimization Using Evolutionary Algorithms","227633811":"A Survey of General‐Purpose Computation on Graphics Hardware","29626886":"How effective and efficient are multiobjective evolutionary algorithms at hydrologic model calibration? Hydrol Earth Syst Sci","200622065":"Equation of State Calculations by Fast Computing Machines","200105001":"Equation of State by Fast Computing Machines","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","13277506":"Multigrid Monte Carlo method. Conceptual foundations","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","242577766":"Annealing Markov Chain Monte Carlo with Applications to Ancestral Inference","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","221883565":"Borg: An Auto-Adaptive Many-Objective Evolutionary Computing Framework","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","220618929":"DEMCMC-GPU: an efficient multi-objective optimization method with GPU acceleration on the Fermi architecture. New Gener Comput","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","228856761":"Effective and Efficient Algorithm for Multiobjective Optimization of Hydrologic Models","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","1875135":"Introduction to Monte Carlo Simulations and Their Statistical Analysis","227944755":"A Markov Chain Monte Carlo version of the genetic algorithm Differential Evolution: Easy Bayesian computing for real parameter spaces","221372887":"Multiobjective optimization with an asymptotically uniform coverage of Pareto front.","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","1990329":"Simulated Tempering: A New Monte Carlo Scheme","221136454":"Integrating multiple scoring functions to improve protein loop structure conformation space sampling","215446267":"Monte Carlo Strategies in Scientic Computing","10931466":"Multiobjective optimization of combinatorial libraries","215757874":"The Pareto Archive Evolution Strategy: A New Baseline Algorithm for Multi-Objective Optimization","268547438":"Markov Chain Monte Carlo Simulations And Their Statistical Analysis: With Web-Based Fortran Code","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","51247222":"Sampling Multiple Scoring Functions Can Improve Protein Loop Structure Prediction Accuracy","27693016":"Configurational-Bias Monte Carlo: A New Sampling Scheme for Flexible Chains","222889399":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications","6586843":"Improved evolutionary optimization from genetically adaptive multimethod search. Proc Natl Acad Sci U S A"},"citedIn":{"261258143":"Conformational Sampling in Template-Free Protein Loop Structure Modeling: An Overview"},"index":966}