{"abs":"This paper proposes a simple strategy to simulate stochastic differential equations (SDE) arising in constant temperature molecular dynamics. The main idea is to patch an explicit integrator with Metropolis accept or reject steps. The resulting `Metropolized integrator\u0027 preserves the SDE\u0027s equilibrium distribution and is pathwise accurate on finite time intervals. As a corollary the integrator can be used to estimate finite-time dynamical properties along an infinitely long solution. The paper explains how to implement the patch (even in the presence of multiple-time-stepsizes and holonomic constraints), how it scales with system size, and how much overhead it requires. We test the integrator on a Lennard-Jones cluster of particles and `dumbbells\u0027 at constant temperature. Comment: 29 pages, 5 figures","title":"A patch that imparts unconditional stability to certain explicit integrators for SDEs","id":47461044,"url":"https://www.researchgate.net/publication/47461044_A_patch_that_imparts_unconditional_stability_to_certain_explicit_integrators_for_SDEs","names":["Nawaf Bou-Rabee","Eric Vanden-Eijnden"],"references":{"225092206":"Computer Simuation of Liquids","200622065":"Equation of State Calculations by Fast Computing Machines","226959488":"An Ergodic Sampling Scheme for Constrained Hamiltonian Systems with Applications to Molecular Dynamics","13277506":"Multigrid Monte Carlo method. Conceptual foundations","41713393":"Theoretical and numerical comparison of some sampling methods for molecular dynamics. Esaim Math. Model. Numer. Anal. 41, 351-389","2308013":"Backward Error Analysis for Numerical Integrators","31123925":"Generalised Gibbs sampler and multigrid Monte Carlo for Bayesian computation","225092474":"Computer ‘experiment’ on classical fluids. I. Thermodynamical properties of Lennard-Jones molecules","227003925":"A Gentle Stochastic Thermostat for Molecular Dynamics","220044041":"Understanding Molecular Simulation, Second Edition: From Algorithms to Applications","46102825":"Asynchronous Variational Integrators","200175478":"Simulating Hamiltonian Dynamics","228683965":"Second-order integrators for Langevin equations with holonomic constraints","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","237008770":"Understanding Molecular Simulation: From Algorithms to Applications (Academic Press","43611057":"Expansion of the Global Error for Numerical Schemes Solving Stochastic Differential Equations","222440936":"Stochastic boundary conditions for molecular dynamics simulations of ST2 water","225456323":"On the Rate of Convergence to Equilibrium of the Andersen Thermostat in Molecular Dynamics","26238371":"Markovian milestoning with Voronoi tessellations","45925769":"Langevin dynamics with constraints and computation of free energy\ndifferences","251503179":"SPDE Limits of the Random Walk Metropolis Algorithm in High Dimensions","222702204":"GSHMC: An efficient method for molecular simulations. J. Comput. Phys. 227, 4934-4954","220044070":"J Computer Simulation of Liquids","220179491":"Strong Convergence of Euler-Type Methods for Nonlinear Stochastic Di_erential Equations","225092520":"Reversible Multiple Time Scale Molecular-Dynamics","200105001":"Equation of State by Fast Computing Machines","6589857":"Canonical Sampling Through Velocity Rescaling","227524550":"Projection of diffusions on submanifolds: Application to mean force computation","255654903":"Stochastic molecular dynamics in systems with multiple time scales and memory friction","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","29615758":"Simulation and Numerical Analysis of Stochastic Differential Systems: A Review","222439949":"Numerical-Integration of Cartesian Equations of Motion of a System with Constraints – Molecular-Dynamics of N-Alkanes","221669734":"Equations of State Calculations by Fast Computing Machines","45935852":"Non-asymptotic mixing of the MALA algorithm","45907693":"Diffusion limits of the random walk Metropolis algorithm in high dimensions authors. Ann. Appl. Probab. 22, 881-930","260785375":"Thermostats for ``Slow\u0027\u0027 Configurational Modes","1760463":"Stochastic Variational Integrators","225092541":"Numerical Integration of the Cartesian Equations of Motion of a System with Constraints: Molecular Dynamics of $n$-Alkenes","2655871":"Symplectic Numerical Integrators in Constrained Hamiltonian Systems","6796095":"An efficient sampling algorithm for Variational Monte Carlo","258367548":"Exact rate calculations by trajectory parallelization and twisting","252778061":"Stable isotope studies of selected synthetic and pedogenic hydroxyl-bearing minerals and some implications for the environment of the mid-Cretaceous","263673577":"Langevin stabilisation of molecular dynamics","242940826":"The Andersen thermostat in molecular dynamics","45853395":"Pathwise Accuracy and Ergodicity of Metropolized Integrators for SDEs","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","222424493":"Stochastic thermostats: comparison of local and global schemes","266270256":"Lectures on Hamiltonian systems","224877193":"Molecular Dynamics Simulation at Constant Pressure and/or Temperature","226478865":"On the Hamiltonian interpolation of near-to-the identity symplectic mappings with application to symplectic integration algorithms","4257967":"Stability of Asynchronous Variational Integrators","242520197":"Verlet-I/r-RESPA/Impulse is limited by nonlinear instabilities","235539966":"Molecular-Dynamics study of a 3-dimensional one-component model for distortive phase-transitions","25832560":"The computer","220179554":"Numerical Integration of Stochastic Differential Equations with Nonglobally Lipschitz Coefficients","277070078":"Thermostats for \"slow\" configurational modes"},"citedIn":{},"index":967}