{"abs":"For a Poisson process with a change-point, a uniform prior is commonly used for the change-point, but it is more realistic to put a unimodal prior on it, which outlines an important feature of prior beliefs. We consider a couple of unimodal priors on the change-point first and use ML-II approach to obtain the empirical Bayes estimators in this paper. The Bayes factor is used for the selection of a suitable prior. The procedure is applied to the British coal-mining disaster data. Finally, a comparison among these empirical Bayes estimators is made by Monte Carlo integration. It turns out that the ML-II Beta prior fit the data most, which corresponds to the prior belief of unimodality.","title":"Bayesian analysis of a change-point Poisson process","id":228434680,"url":"https://www.researchgate.net/publication/228434680_Bayesian_analysis_of_a_change-point_Poisson_process","names":["Yi-Hsiung Lin","Mei-Mei Zen","Biometrika"],"references":{"243082455":"A Note on the Intervals Between Coal-Mining Disasters","239062083":"Statistical Methods For The Reliability Of Repairable Systems","246334914":"Good Thinking: The Foundations of Probability and Its Applications","31101623":"The Time Intervals Between Industrial Accidents"},"citedIn":{"222543303":"The use of cumulative sums for detection of changepoints in the rate parameter of a Poisson Process","233134189":"Nonparametric estimation in a two change-point model","241604333":"INTERFAILURE DATA WITH CONSTANT HAZARD FUNCTION IN THE PRESENCE OF CHANGE-POINTS","35658540":"Spatial small area analyses of disease risk around sources of environmental pollution : modelling tools for a system using high resolution register data /","222005941":"Bayesian variable window scan statistics","238114720":"Deux procédures de détection de rupture pour des observations poissonniennes groupées","2165680":"Bayesian Blocks: Divide and Conquer, MCMC, and Cell Coalescence Approaches","228996279":"Reference Analysis","2684602":"Continuous-time Estimation of a Change-point in a Poisson Process","225413238":"Bayesian multiple change-point estimation with annealing stochastic approximation Monte Carlo","257642433":"A Bayesian analysis of suicide data","224545149":"Change point detection based on call detail records","14647421":"Modeling and decision making using Bayesian hierarchical models","13713522":"Assessing Placebo Response Using Bayesian Hierarchical Survival Models","264144925":"Bayesian Multiple Change-Point Estimation for Single Quantum Dot Luminescence Intensity Data","250711892":"Analysis of a Simple Debugging Model","222319464":"Activity pattern detection in electroneurographic and electromyogram signals through a heteroscedastic change-point method","46494316":"“Hostage Taking: Understanding Terrorism Event Dynamics.”","222284693":"Baysian analysis of a change-point in exponential families with applications","2590348":"Detecting a Change in School Performance: A Bayesian Analysis for a Multilevel Join Point Problem","245576718":"Approximate simulation free multiple changepoint analysis with Gaussian Markov random field segment models","243103056":"Bayesian Binary Segmentation Procedure for a Poisson Process With Multiple Changepoints","38326886":"Statistical Methods for DNA Sequence Segmentation","215788530":"Wagner, P. J. Likelihood tests of hypothesized durations: determining and accommodating biasing factors. Paleobiology","228402099":"Statistical Methods in Applied Computer Science Lecture Notes Preliminary for course 2D5342, Data Mining, Jan-April 2006.","228495153":"Bayesian Inference from Continuously Arriving Informant Reports, with Application to Crisis","232858190":"Bayesian Analysis of Change-Point Hazard Rate Problem","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","5506661":"A statistical model investigating the prevalence of tuberculosis in New York City using counting processes with two change-points","225432797":"Non-homogeneous Poisson models with a change-point: An application to ozone peaks in Mexico city","24064091":"On Modeling Change Points in Non-Homogeneous Poisson Processes","233072092":"Hybrid regions for post-change mean in a sequence of normal variables","229473300":"Optimal investment and consumption with stochastic dividends","254312852":"Change-Point Problems: Bibliography and Review","253989149":"Bayesian Inference of Structural Breaks in Time-Varying Volatility Models","242383693":"TheJuvenileHomicideEpidemic: Spatio-TemporalDynamicsof HomicideinAmericanCities","263613815":"Bayes factors","2249185":"Bootstrap Confidence Regions For The Intensity Of A Poisson Point Process","2260449":"The Juvenile Homicide Epidemic: Spatio-Temporal Dynamics of Homicide in American Cities","2590692":"A Bayesian On-Line Change Detection Algorithm With Process Monitoring Applications","228984290":"Structural Breaks in Panel Data Models: A New Approach","30862224":"Hybrid Bootstrap for Mapping Quantitative Trait Loci and Change Point Problems.","10943342":"Detection of onset of neuronal activity by allowing for heterogeneity in the change points","252731993":"Inference and Prediction for a General Order Statistic Model With Unknown Population Size","228278992":"Climate Change and Modelling of Extreme Temperatures in Switzerland","24054435":"Statistical Analysis of \"Structural Change\": An Annotated Bibliography.","254771682":"Bayesian Isotonic Estimation for Exponential Family and Beyond","238866673":"On a bayesian approach for the shiftpoint problem","260324170":"CoCITe-Coordinating changes in text","242998569":"Estimation bayésienne pour un processus de Poisson d\u0027intensité discontinue","1764040":"Bayes and empirical Bayes changepoint problems","223526022":"Change-point mle in the rate of exponential sequences with application to Indonesian seismological data","235423324":"Bayesian semi-parametric analysis of Poisson change-point regression models: Application to policy-making in Cali, Colombia","226390187":"Objective Bayesian analysis of the changepoint problem","225101631":"Exact and efficient Bayesian inference for multiple changepoint","225229748":"Statistical Reliability Change-point Estimation Models","237625589":"Spatio-temporal change-point modeling","224224897":"Socioscope: Human Relationship and Behavior Analysis in Social Networks","254331253":"An Improved Bayesian Information Criterion for Multiple Change-Point Models","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","259179180":"Bayesian Multiple Change-Point Estimation and Segmentation","267075595":"Robustness of two-phase regression tests","51974268":"Semiparametric Bayesian approaches to joinpoint regression for population-based cancer survival data","223850556":"Graphically based interval estimation for the change-point","229885279":"Using non‐homogeneous Poisson models with multiple change‐points to estimate the number of ozone exceedances in Mexico City","257337145":"Modeling quality control data using Weibull distributions in the presence of a change point","47633593":"Making Wellness Delicious: Building a Healthier Chicago\u0027s FIT City Program","264058444":"Default Bayesian Method for Detecting the Changes in Sequences of Independent Exponential and Poisson Random Variates","226262920":"Inferring extinction in a declining population","225508998":"Detecting population decline of birds using long-term monitoring data","225682955":"Statistical Analysis of the Completeness of a Seismic Catalogue","243044613":"Estimation of parameters for nonhomogeneous Poisson process: Software reliability with change-point model","222324409":"Multiscale change point analysis in Poisson count data","220516184":"A change‐point perspective on the software failure process","24065171":"Change-point diagnostics in competing risks models: Two posterior predictive p-value approaches","220170339":"Parameter Identification in Degradation Modeling by Reversible-Jump Markov Chain Monte Carlo","12567362":"Are Births Underreported in Rural China? Manipulation of Statistical Records in Response to China\u0027s Population Policies"},"index":97}