{"abs":"In microscopic mechanical systems interactions between elastic structures are often mediated by the hydrodynamics of a solvent fluid. At microscopic scales the elastic structures are also subject to thermal fluctuations. Stochastic numerical methods are developed based on multigrid which allow for the efficient computation of both the hydrodynamic interactions in the presence of walls and the thermal fluctuations. The presented stochastic multigrid approach provides efficient real-space numerical methods for generating the required stochastic driving fields with long-range correlations consistent with statistical mechanics. The presented approach also allows for the use of spatially adaptive meshes in resolving the hydrodynamic interactions. Numerical results are presented which show the methods perform in practice with a computational complexity of O(N log(N)).","title":"Spatially Adaptive Stochastic Multigrid Methods for Fluid-Structure Systems with Thermal Fluctuations","id":45906067,"url":"https://www.researchgate.net/publication/45906067_Spatially_Adaptive_Stochastic_Multigrid_Methods_for_Fluid-Structure_Systems_with_Thermal_Fluctuations","names":["Paul Atzberger"],"references":{"8036026":"Conformation and dynamics of single DNA molecules in parallel-plate slit microchannels","222486688":"An Adaptive Version of the Immersed Boundary Method","232005137":"Peskin, C.S.: The immersed boundary method. Acta Numerica 11, 479-517","13256204":"Multigrid Monte Carlo Method for Lattice Field Theories","3113959":"CIMS Report NYU-501, An Algorithm for Point Clustering and Grid Generation","13277506":"Multigrid Monte Carlo method. Conceptual foundations","26298136":"Charge-based particle separation in microfluidic devices using combined hydrodynamic and electrokinetic effects","30760796":"Accelerated Stokesian dynamics: Brownian motion","220207017":"Spatially adaptive stochastic numerical methods for intrinsic fluctuations in reaction-diffusion systems","23989509":"Micromagnetic selection of aptamers in microfluidic channels","235539143":"Over-relaxation method for the Monte Carlo evaluation of the partition function for multiquadratic actions","2684230":"An Adaptive-Mesh Projection Method For Viscous Incompressible Flow","255890319":"A Projection Method for Locally Refined Grids","26856521":"Oligonucleotide hybridization and free-solution electrokinetic separation in a nanofluidic device","222653044":"A Stochastic Immersed Boundary Method for Fluid-Structure Interactions at Microscopic Length Scales","227541089":"A mathematical framework for stochastic climate models. Commun Pure Appl Math","215458980":"An Algorithm for the Machine Computation of Complex Fourier Series","27276762":"Hydrodynamics of particle-wall interaction in colloidal probe experiments: Comparison of vertical and lateral motion","235455410":"Over-relaxation methods for Monte Carlo simulations of quadratic and multiquadratic actions","265585001":"Adaptive Methods for Partial Differential Equations","238984099":"A Modern Course in Statistical Physics"},"citedIn":{"222650037":"Stochastic Eulerian Lagrangian Methods for Fluid-Structure Interactions with Thermal Fluctuations"},"index":973}