{"abs":"A sampling method for spin systems is presented. The spin lattice is written as the union of a nested sequence of sublattices, all but the last with conditionally independent spins, which are sampled in succession using their marginals. The marginals are computed concurrently by a fast algorithm; errors in the evaluation of the marginals are offset by weights. There are no Markov chains and each sample is independent of the previous ones; the cost of a sample is proportional to the number of spins (but the number of samples needed for good statistics may grow with array size). The examples include the Edwards-Anderson spin glass in three dimensions.","title":"Monte Carlo without Chains","id":1910187,"url":"https://www.researchgate.net/publication/1910187_Monte_Carlo_without_Chains","names":["Alexandre Chorin","Communications in Applied Mathematics and Computational Science"],"references":{"239743115":"The Theory of Critical Phenomena","31976484":"Statistical Physics","248821650":"Hermite expansions in Monte-Carlo computation. J. Comput. Phys. 8, 472-482","2114791":"A maximum likelihood algorithm for the estimation and renormalization of exponential densities","2868716":"Conditional Expectations and Renormalization","13277506":"Multigrid Monte Carlo method. Conceptual foundations","6197527":"Efficient Monte Carlo sampling by parallel marginalization.","233823075":"Mathematical aspects of spin glasses and neural networks","278663699":"Stochastic Tools in Mathematics and Science","1850249":"Universality in three-dimensional Ising spin glasses: A Monte Carlo study","229442107":"Spin glasses (I)","226418921":"Renormalization Multigrid (RMG): Statistically Optimal Renormalization Group Flow and Coarse-to-Fine Monte Carlo Acceleration","259967591":"Statistical Physics: Statics, Dynamics, and Renormalization","222396956":"Optimal prediction with memory","233822065":"Spin Glass Theory and Beyond","10963906":"Inverse Monte Carlo Renormalization Group Transformations for Critical Phenomena","200104459":"Critical Properties from Monte Carlo Coarse Graining and Renormalization","10915776":"Rigorous Decimation-Based Construction of Ground Pure States for Spin-Glass Models on Random Lattices","215446267":"Monte Carlo Strategies in Scientic Computing","248615933":"Spin Glasses: A Challenge for Mathematicians: Cavity and Mean Field Models","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","13352762":"Critical behavior of the three-dimensional Ising spin glass","243770229":"Spin Glasses: a Challenge for Mathematicians","226483145":"Spin Glasses","34909484":"Renormalization methods with applications to spin systems and finance /","46952629":"The Theory of Critical Phenomena : An Introduction to the Renormalization Group","220345624":"Survey propagation: An algorithm for satisfiability","235559222":"Monte Carlo renormalization-group studies of the d\u003d 2 Ising model","1820836":"Critical Behavior of the Three-Dimensional Ising Spin Glass"},"citedIn":{"278701359":"Stochastic Tools in Mathematics and Science","45851358":"Non-Bayesian particle filters","26871325":"Implicit sampling for particle filters","224926912":"Implicit Particle Methods and Their Connection with Variational Data Assimilation","45878886":"Interpolation and Iteration for Nonlinear Filters","45919122":"Implicit particle filters for data assimilation. Communs Appl","45923347":"Conditional path sampling of stochastic differential equations by drift\nrelaxation"},"index":978}