{"abs":"We present fixed domain asymptotic results that establish consistent estimates of the variance and scale parameters for a Gaussian random field with a geometric anisotropic Mat\\\u0027ern autocovariance in dimension $d\u003e4$. When $d\u003c4$ this is impossible due to the mutual absolute continuity of Mat\\\u0027ern Gaussian random fields with different scale and variance (see Zhang \\cite{zhang:2004}). Informally, when $d\u003e4$, we show that one can estimate the coefficient on the principle irregular term accurately enough to get a consistent estimate of the coefficient on the second irregular term. These two coefficients can then be used to separate the scale and variance. We extend our results to the general problem of estimating a variance and geometric anisotropy for more general autocovariance functions. Our results illustrate the interaction between the accuracy of estimation, the smoothness of the random field, the dimension of the observation space, and the number of increments used for estimation. As a corollary, our results establish the orthogonality of Mat\\\u0027ern Gaussian random fields with different parameters when $d\u003e4$. The case $d\u003d4$ is still open.","title":"On the consistent separation of scale and variance for Gaussian random fields","id":45857961,"url":"https://www.researchgate.net/publication/45857961_On_the_consistent_separation_of_scale_and_variance_for_Gaussian_random_fields","names":["Ethan Anderes","The Annals of Statistics"],"references":{"238632696":"Fast and Exact Simulation of Fractional Brownian Surfaces","222704515":"Singularity functions for fractional processes: Application to the fractional Brownian sheet","38364236":"A Bound on Tail Probabilities for Quadratic Forms in Independent Random Variables","38360256":"Asymptotically Efficient Prediction of a Random Field with a Misspecified Covariance Function","23632227":"A simple condition for asymptotic optimality of linear predictions of random fields","38349189":"Fixed-domain asymptotics for a subclass of Matérn-type Gaussian random fields","50335758":"Gaussian random processes.","236736850":"Spline Models of Observational Data","285780441":"On Berman\u0027s Version of the Levy-Baxter Theorem","248728006":"Spline Models for Observational Data","223636674":"Asymptotic properties of a maximum likelihood estimator with data from a Gaussian process","265000467":"A Strong Limit Theorem for Gaussian Processes","265439178":"Convergence en loi des H-variations d’un processus gaussien stationnaire sur ℝ. (Convergence in law of H-variations of a stationary Gaussian process)","35697721":"Estimating deformations of isotropic Gaussian random fields /","238867618":"A Version of the Levy-Baxter Theorem for the Increments of Brownian Motion of Several Parameters","227369107":"Covariance Tapering for Likelihood-Based Estimation in Large Spatial Data Sets","38391447":"Identification of an isometric transformation of the standard Brownian sheet","45870308":"Fixed-domain asymptotic properties of tapered maximum likelihood estimators","268645660":"A New Limit Theorem for Stochastic Processes with Gaussian Increments","224043320":"Handbook of Matematical Functions","38359407":"Uniform Asymptotic Optimality of Linear Predictions of a Random Field Using an Incorrect Second-Order Structure","222539370":"Identification of an isometric transformation of the standard Brownian sheet","4746787":"Inconsistent Estimation and Asymptotically Equal Interpolations in Model-Based Geostatistics","38362469":"On Quadratic Variation of Processes with Gaussian Increments","273545917":"On Berman’s version of the Lévy-Baxter theorem","38348345":"Estimating structured correlation matrices in smooth Gaussian random field models","227424826":"Identification of filtered white noises","200524170":"Matrix Analysis","38362739":"Sample Functions of the Gaussian Process","222494329":"Quadratic variations and estimation of the local Hölder index of a Gaussian process","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","1767847":"Consistent estimates of deformed isotropic Gaussian random fields on the plane","222160323":"Uniform quadratic variation for Gaussian processes","284049489":"Convergence en loi des H-variations d\u0027un processus gaussien stationnaire sur R"},"citedIn":{"268655171":"Advances and challenges in space-time modelling of natural events. Papers based on the presentations at the international spring school, Toledo, Spain, March 2010","228670561":"Interpolation of Spatial Data -- A Stochastic or a Deterministic Problem?","235892548":"High-Frequency Asymptotics for Lipschitz-Killing Curvatures of Excursion Sets on the Sphere","254211723":"On fixed-domain asymptotics and covariance tapering in Gaussian random field models","45881649":"Local likelihood estimation for nonstationary random fields","272378701":"Uncertainty quantification for a climatology of the frequency and spatial distribution of North Atlantic tropical cyclone landfalls","269280638":"Asymptotic analysis of covariance parameter estimation for Gaussian processes in the misspecified case","237054196":"Asymptotic theory with hierarchical autocorrelation: Ornstein-Uhlenbeck tree models","234168781":"Asymptotic analysis of the role of spatial sampling for hyper-parameter estimation of Gaussian processes","51930176":"The Role of the Range Parameter for Estimation and Prediction in\nGeostatistics","260230107":"Tail Estimation of the Spectral Density for a Stationary Gaussian Random Field.","234168780":"Cross Validation and Maximum Likelihood estimation of hyper-parameters of Gaussian processes with model misspecification","253096108":"The Importance of the Range Parameter for Estimation and Prediction in Geostatistics","221662383":"Needlet-Whittle Estimates on the Unit Sphere","235761520":"High-Frequency Tail Index Estimation by Nearly Tight Frames","51946181":"Gaussian Semiparametric Estimates on the Unit Sphere","249964153":"On the Limiting Behaviour of Needlets Polyspectra"},"index":984}