{"abs":"Computer codes simulating physical systems usually have responses that consist of a set of distinct outputs (e.g., velocity and pressure) that evolve also in space and time and depend on many unknown input parameters (e.g., physical constants, initial/boundary conditions, etc.). Furthermore, essential engineering procedures such as uncertainty quantification, inverse problems or design are notoriously difficult to carry out mostly due to the limited simulations available. The aim of this work is to introduce a fully Bayesian approach for treating these problems which accounts for the uncertainty induced by the finite number of observations. Our model is built on a multi-dimensional Gaussian process that explicitly treats correlations between distinct output variables as well as space and/or time. The proper use of a separable covariance function enables us to describe the huge covariance matrix as a Kronecker product of smaller matrices leading to efficient algorithms for carrying out inference and predictions. The novelty of this work, is the recognition that the Gaussian process model defines a posterior probability measure on the function space of possible surrogates for the computer code and the derivation of an algorithmic procedure that allows us to sample it efficiently. We demonstrate how the scheme can be used in uncertainty quantification tasks in order to obtain error bars for the statistics of interest that account for the finite number of observations.","title":"Multi-output separable Gaussian process: Towards an efficient, fully Bayesian paradigm for uncertainty quantification","id":256744084,"url":"https://www.researchgate.net/publication/256744084_Multi-output_separable_Gaussian_process_Towards_an_efficient_fully_Bayesian_paradigm_for_uncertainty_quantification","names":["Ilias Bilionis","Nicholas Zabaras","Bledar A. Konomi","Guang Lin","Journal of Computational Physics"],"references":{"222581573":"Bayesian emulation of complex multi-output and dynamic computer models","226296703":"Modelling of Multiscale Structures in Flow Simulations for Petroleum Reservoirs","224817317":"Matrix Differential Calculus with Applications in Statistics and Econometrics, John Wiley, New York","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","5207179":"Bayesian inference for the uncertainty distribution of computer model outputs. Biometrika","200105001":"Equation of State by Fast Computing Machines","200622065":"Equation of State Calculations by Fast Computing Machines","4772045":"Bayesian Calibration of Computer Models","224839791":"The Linear Coregionalization Model and the Product-Sum Space-Time Variogram","220411369":"High-Order Collocation Methods for Differential Equations with Random Inputs","230873416":"Quadrature and Interpolation formulas for tensor products of certain classes of functions","2837349":"On the Finite Element Solution of the Pure Neumann Problem","226294957":"Multivariable variogram and its application to the linear model of coregionalization","226715991":"A Mixed Finite Element Method for Second Order Elliptic Problems","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","222409879":"An adaptive hierarchical sparse grid collocation algorithm for the solution of stochastic differential equations","213879912":"An overview of the Trilinos Project","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","51991950":"A stochastic collocation method for elliptic partial differential equations with random input data","51991936":"The Wiener--Askey Polynomial Chaos for Stochastic Differential Equations","256744276":"Multi-output local Gaussian process regression: Applications to uncertainty quantification","228642363":"Efficient collocation approach for parametric uncertainty analysis","228396544":"On the low-rank approximation by the pivoted Cholesky decomposition","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","2455557":"Information--Based Objective Functions for Active Data Selection","222652964":"An adaptive multi-element generalized polynomial chaos method for stochastic diffential equations","226007130":"Linear coregionalization model: tools for estimation and choice of cross-variogram matrix. Math Geol 24 (3): 269-286","237067972":"Applied Smoothing Techniques for Data Analysis: The Kernel Approach with S-PLUS Illustrations","220179382":"A Sparse Grid Stochastic Collocation Method for Partial Differential Equations with Random Input Data","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","4742946":"Computer Model Calibration Using High-Dimensional Output","226794920":"Mixed Discontinuous Galerkin Methods for Darcy Flow","265632761":"Uncertainty analysis and other inference tools for complex computer codes. (With discussion)","224839754":"Explaining the Gibbs sampler. Am Stat","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","248065894":"The Wiener-Askey polynomial chaos for stochastic di eren-tial equations","285364218":"Biometrika","216301661":"Screening, Predicting, and Computer Experiments","222223111":"The ubiquitous Kronecker product","45931398":"Cases for the Nugget in modelling computer experiments","281412731":"A comparison of three methods for selecting values of input variables in the analysis of output from a computer code in wsc \u002705: proceedings of the 37th conference on winter simulation","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","31223586":"Some Matrix-Variate Distribution-Theory - Notational Considerations and a Bayesian Application","220179808":"A Stochastic Collocation Method for Elliptic Partial Differential Equations with Random Input Data"},"citedIn":{"265723990":"Multidimensional Adaptive Relevance Vector Machines for Uncertainty Quantification","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","270104828":"Uncertainty propagation using infinite mixture of Gaussian processes and variational Bayesian inference","264466182":"GPS-ABC: Gaussian Process Surrogate Approximate Bayesian Computation","262583040":"Bayesian Treed Multivariate Gaussian Process With Adaptive Design: Application to a Carbon Capture Unit","282514304":"Low-cost multi-dimensional Gaussian process with application to uncertainty quantification","270913282":"A Bayesian mixed shrinkage prior procedure for spatial–stochastic basis selection and evaluation of gPC expansions: Applications to elliptic SPDEs","259695171":"GPS-ABC: Gaussian Process Surrogate Approximate Bayesian Computation","266135607":"Data-driven model for solar irradiation based on satellite observations","262872837":"Solution of inverse problems with limited forward solver evaluations: A Bayesian perspective","273787774":"Uncertainty Quantification and Propagation in Nuclear Density Functional Theory"},"index":985}