{"abs":"This paper studies several different plans for selecting coordinates for updating via Gibbs sampling. It exploits the inherent features of the Gibbs sampling formulation, most notably its neighborhood structure, to characterize and compare the plans with regard to convergence to equilibrium and variance of the sample mean. Some of the plans rely on completely or almost completely random coordinate selection. Others use completely, or almost completely, deterministic coordinate selection rules. We show that neighborhood structure induces idempotency for the individual coordinate transition matrices and commutativity among subsets of these matrices. These properties lead to bounds on eigenvalues for the Gibbs sampling transition matrices corresponding to several of the plans. For a frequently encountered neighborhood structure, we give necessary and sufficient conditions for a commonly employed deterministic coordinate selection plan to induce faster convergence to equilibrium than the random coordinate selection plans do. When these conditions hold, we also show that this deterministic selection rule achieves the same worst-case bound on the variance of the sample mean as arises from the random selection rules as the number of coordinates grows without bound. This last result encourages the belief that faster convergence for the deterministic selection rule may also imply a variance of the sample mean no longer than that arising for random selection rules.","title":"Coordinate Selection Rules for Gibbs Sampling","id":2520884,"url":"https://www.researchgate.net/publication/2520884_Coordinate_Selection_Rules_for_Gibbs_Sampling","names":["George S. Fishman","The Annals of Applied Probability"],"references":{"243762788":"Covariance Structure and Convergence Rate of the Gibbs Sampler with Various Scans","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","260161226":"Convergence Rates of the Gibbs Sampler, the Metropolis Algorithm and Other Single-Site Updating Dynamics","239227933":"Some Metric Inequalities in the Space of Matrices"},"citedIn":{"255588474":"An upper bound on the convergence time of the Gibbs sampler in Ising models","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","23644795":"Optimizing random scan Gibbs samplers","267239705":"On Systematic Scan","250754966":"Ch. 9. Empirical estimators based on MCMC data","243043108":"A note on Markov chain Monte Carlo sweep strategies","2126568":"Systematic scan for sampling colorings, Ann Appl Prob","2103082":"Mixing times of the biased card shuffling and the asymmetric exclusion process","50917253":"Time-to-Coalescence for Interacting Particle Systems: Parallel versus Sequential Updating","2642998":"Analysis of systematic scan Metropolis algorithms using Iwahori-Hecke algebra techniques"},"index":986}