{"abs":"Let F(x) be an absolutely continuous distribution having a density function f(x) with respect to the Lebesgue measure. The Shannon entropy is defined as H(f) \u003d -int f(x) ln f(x) dx . In this correspondence we propose, based on a random sample X_{1}, cdots , X_{n} generated from F , a nonparametric estimate of H(f) given by hat{H}(f) \u003d -(l/n) sum_{i \u003d 1}^{n} In hat{f}(x) , where hat{f}(x) is the kernel estimate of f due to Rosenblatt and Parzen. Regularity conditions are obtained under which the first and second mean consistencies of hat{H}(f) are established. These conditions are mild and easily satisfied. Examples, such as Gamma, Weibull, and normal distributions, are considered.","title":"A Nonparametric Estimation of the Entropy for Absolutely Continuous Distributions","id":3082726,"url":"https://www.researchgate.net/publication/3082726_A_Nonparametric_Estimation_of_the_Entropy_for_Absolutely_Continuous_Distributions","names":["Ibrahim A. Ahmad","Pi-Erh Lin","IEEE Transactions on Information Theory"],"references":{"2992333":"A Survey of Clear-Air Propagation Effects Relevant to Optical Communications","38367114":"Remarks on Some Non-Parametric Estimates of a Density Function","3081450":"Communication under the Poisson Regime","3081512":"“A General Likelihood-Ratio Formula for Random Signals in Gaussian Noise,”","3082535":"The modeling of randomly modulated jump processes","260579675":"Probability theory","247004651":"On estimating of a probability density and mode","243754643":"Measurements of three-parameter log-normally distributed optical-field irradiance fluctuations in a turbulent medium","252718694":"Measurements of Laser-Beam Scintillation in the Atmosphere: Errata","3082520":"Nonlinear Filtering with Counting Observations","243048448":"Some moments of an estimate of shannon\u0027s measure of information","232128360":"On a Statistical Estimate for the Entropy of a Sequence of Independent Random Variables","224731227":"Direct-Detection Optical Communication Receivers","247036103":"On the estimation of a probability density and the mode","3081936":"Filtering and Detection for Doubly Stochastic Poisson Processes"},"citedIn":{},"index":987}