{"abs":"In the cyclic-to-random shuffle, we are given n cards arranged in a circle. At step k, we exchange the kth card along the circle with a uniformly chosen random card. The problem of determining the mixing time of the cyclic-to-random shuffle was raised by Aldous and Diaconis in 1986. Mironov used this shuffle as a model for the cryptographic system known as RC4, and proved an upper bound of O(n log n) for the mixing time. We prove a matching lower bound, thus establishing that the mixing time is indeed of order Θ(n log n). We also prove an upper bound of O(n log n) for the mixing time of any \"semirandom transposition shuffle\", i.e., any shuffle in which a random card is exchanged with another card chosen according to an arbitrary (deterministic or random) rule. To prove our lower bound, we exhibit an explicit complex-valued test function which typically takes very different values for permutations arising from few iterations of the cyclic-to-random-shuffle and for uniform random permutations. Perhaps surprisingly, the proof hinges on the fact that the function e - 1 has nonzero fixed points in the complex plane. A key insight from our work is the importance of complex analysis tools for uncovering structure in nonreversible Markov chains.","title":"Shuffling by semi-random transpositions","id":4109395,"url":"https://www.researchgate.net/publication/4109395_Shuffling_by_semi-random_transpositions","names":["E. Mossel","Yuval Peres","A. Sinclair"],"references":{"226438140":"Random walks on finite groups and rapidly mixing Markov chains, Sèminaire de probabilités XVII 1981/82","2126568":"Systematic scan for sampling colorings, Ann Appl Prob","244520026":"Trailing the dovetail shu e to its lair","2103082":"Mixing times of the biased card shuffling and the asymmetric exclusion process","238281144":"Nonrandom Shuffling with Applications to the Game of Faro","238707382":"Shuffling Cards and Stopping Times","251085401":"Applications of non-commutative fourier analysis to probability problems","23630599":"Comparing sweep strategies for stochastic relaxation","221590970":"Lifting Markov Chains to Speed up Mixing.","226075081":"Generating a random permutation with random transpositions","38362968":"Trailing the Dovetail Shuffle to its Lair","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","243623120":"Some Random Series of Functions","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","2098235":"Mixing times of Lozenge tiling and card shuffling Markov chains","243762809":"RANDOM WALKS ON GROUPS: STRONG UNIFORM TIME APPROACH","2642998":"Analysis of systematic scan Metropolis algorithms using Iwahori-Hecke algebra techniques","2104319":"Mixing Time of the Rudvalis Shuffle","242353101":"Group Representations in Probability and Statistics"},"citedIn":{"227423695":"Convergence of some time inhomogeneous Markov chains via spectral techniques","220586276":"Understanding Science Through the Computational Lens","268670080":"Markov chains and mixing times. With a chapter on “Coupling from the past” by James G. Propp and David B. Wilson","51964735":"Probabilistic and Combinatorial Aspects of the Card-Cyclic to Random\nInsertion Shuffle","47702559":"Time inhomogeneous Markov chains with wave-like behavior","51887034":"Merging for inhomogeneous finite Markov chains, Part II: Nash and log-Sobolev inequalities","243103696":"The overhand shuffle mixes in Θ(n2logn) steps","2117391":"The overhand shuffle mixes in $\\Theta(n^2\\log n)$ steps","223130013":"Cyclic to Random Transposition Shuffles","250389950":"The overhand shuffle mixes in £(n2 log n) steps","45911816":"Merging and stability for time inhomogeneous finite Markov chains","271218302":"Card-cyclic-to-random shuffling with relabeling","221462600":"Robust Mixing.","238497931":"Merging for time inhomogeneous finite Markov chains, Part I: Singular values and stability","229156725":"Mixing time of the Card-Cyclic-to-Random shuffle","2129311":"Biased random-to-top shuffling"},"index":991}