{"abs":"We describe a new computer program that combines evolutionary algorithm methods with a derivative-based, quasi-Newton method to solve difficult unconstrained optimization problems. The program, called GENOUD (GENetic Optimization Using Derivatives), effectively solves problems that are nonlinear or perhaps even discontinuous in the parameters of the function to be optimized. When a statistical model\u0027s estimating function (for example, a log-likelihood) is nonlinear in the model\u0027s parameters, the function to be optimized will usually not be globally concave and may contain irregularities such as saddlepoints or discontinuous jumps. Optimization methods that rely on derivatives of the objective function may be unable to find any optimum at all. Or multiple local optima may exist, so that there is no guarantee that a derivative-based method will converge to the global optimum. We discuss the theoretical basis for expecting GENOUD to have a high probability of finding global optima. We conduct Monte Carlo experiments using scalar Normal mixture densities to illustrate this capability. We also use a system of four simultaneous nonlinear equations that has many parameters and multiple local optima to compare the performance of GENOUD to that of the Gauss-Newton algorithm in SAS\u0027s PROC MODEL.","title":"Genetic Optimization Using Derivatives","id":2371187,"url":"https://www.researchgate.net/publication/2371187_Genetic_Optimization_Using_Derivatives","names":["Jasjeet S. Sekhon","Walter Mebane","Political Analysis"],"references":{"200104934":"Lewis TG, Payne WH (July 1973) Generalized feedback shift register pseudorandom number algorithm. ACM","201976647":"Modeling Simple Genetic Algorithms","2954300":"Genetic-Algorithm Programming Environments","30821765":"Genetic algorithms as function optimizers","44199350":"Legislative Entrepreneurship in the U.S. House of Representatives","3464097":"Practical Optimization","227389205":"The Economic Analysis of Transition Data","44352318":"Multivariate statistical modelling based on generalized linear models / Ludwig Fahrmeir, Gerhard Tutz","220885515":"How Genetic Algorithms Work: A Critical Look at Implicit Parallelism.","220642631":"Modeling Genetic Algorithms with Markov Chains.","38359659":"Exact Mean Integrated Squared Error","2466694":"Markov Chain Models for Rolling Cross-section Data: How Campaign Events and Political Awareness Affect Vote Intentions and Partisanship in the United States and Canada","224839810":"An Introduction to the Boot-Strap","243774370":"Modelling simple genetic algorithms","2250117":"Deception Considered Harmful","44820800":"The Jackknife and The Bootstrap","242356870":"Adaptation In Natural And Artificial Systems","30873058":"Genetic + Data Structures \u003d Evolution Programs","220045412":"Adoption in Natural and Artificial System","30869230":"Handbook Of Genetic Algorithms","2462559":"Congressional Campaign Contributions, District Service and Electoral Outcomes in the United States: Statistical Tests of a Formal Game Model with Nonlinear Dynamics","51992999":"Limited-Dependent And Qualitative Variables In Econometrics","242376908":"An Introduction to The Bootstrap","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","220566426":"Quasi-Random Number Sequences from a Long-Period TLP Generator with Remarks on Application to Cryptography"},"citedIn":{"262454948":"The economic burden of schizophrenia in Germany: A population-based retrospective cohort study using genetic matching","228193624":"Preference Coherence","226036920":"Nitrogen Leaching of Two Forest Ecosystems in a Karst Watershed","263055724":"Higher clinical success in patients with ventilator-associated pneumonia due to methicillin-resistant Staphylococcus aureus (MRSA) treated with linezolid compared to vancomycin: results from the IMPACT-HAP study","277329414":"Building an Algo-Trading Model using Artificial Neural Networks and Genetic Algorithms for Intraday FX Speculation","257335184":"A benchmark of kriging-based infill criteria for noisy optimization","228364059":"Calibration of hydrological models in the spectral domain: An opportunity for scarcely gauged basins","51996306":"Forest floor interception measurements","228295959":"Strategic Interaction and Interstate Crises: A Bayesian Quantal Response Estimator for Incomplete Information Games","257639830":"Tactical Voting and Party Preferences: A Test of Cognitive Dissonance Theory","40103085":"Distributed water storage and local gravity: a field experiment at Moxa (Germany)","257299288":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction","258145133":"Importing the Bomb","287866919":"Continuous Global Optimization in R","227602434":"Criteria Used by a Peer Review Committee for Selection of Research Fellows. A Boolean Probit Analysis","51997451":"Forest floor interception measurements","241361329":"Evaluating UN Peacekeeping with Matching to Improve Causal Inference","225544359":"A Benchmark Test for Ecohydrological Models of Interannual Variability of NDVI in Semi-arid Tropical Grasslands","51138970":"Effect of primary prophylactic G-CSF use on systemic therapy administration for elderly breast cancer patients","259546720":"Dollars on the Sidewalk: Should U.S. Presidential Candidates Advertise in Uncontested States?","262581950":"The economic burden of schizophrenia in Germany: A population-based retrospective cohort study using genetic matching","255652646":"Do UN Interventions Cause Peace? Using Matching to Improve Causal Inference","215992257":"Genetic Optimization Using Derivatives: The rgenoud Package for R","233424203":"Extracorporeal Membrane Oxygenation for Pandemic Influenza A(H1N1) Induced Acute Respiratory Distress Syndrome. A Cohort Study and Propensity-matched Analysis.","231788147":"Exporting the Bomb: Why States Provide Sensitive Nuclear Assistance","258648143":"A shifting hydrological regime: A field investigation of snowmelt runoff processes and their connection to summer base flow, Sunshine Coast, British Columbia","44637390":"Colonyzer: Automated quantification of micro-organism growth characteristics on solid agar","266747403":"Health systems: changes in hospital efficiency and profitability","223352318":"Influence of the temporal resolution of data on the success of indicator species models of species richness across multiple taxonomic groups","262236687":"Noisy kriging-based optimization methods: A unified implementation within the DiceOptim package","234103835":"Sliding hip screw versus IM nail in reverse oblique trochanteric and subtrochanteric fractures. A study of 2716 patients in the Norwegian Hip Fracture Register","281912575":"A new approach to categorising continuous variables in prediction models: Proposal and validation","242101277":"FLOOD RISK ANALYSIS OF THE WARSAW REACH OF THE VISTULA RIVER","263323527":"The economic impact of Marfan syndrome: A non-experimental, retrospective, population-based matched cohort study","257101796":"A taxonomy of site response complexity","277329342":"Building an Algo-Trading Model using Artificial Neural Networks and Genetic Algorithms for Intraday FX Speculation","272844095":"Differential DNA mismatch repair underlies mutation rate variation across the human genome"},"index":995}