{"abs":"Motivated by a computer experiment for the design of a rocket booster, this paper explores nonstationary modeling methodologies that couple stationary Gaussian processes with treed partitioning. Partitioning is a simple but effective method for dealing with nonstationarity. The methodological developments and statistical computing details which make this approach efficient are described in detail. In addition to providing an analysis of the rocket booster simulator, our approach is demonstrated to be effective in other arenas.","title":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","id":2215138,"url":"https://www.researchgate.net/publication/2215138_Bayesian_Treed_Gaussian_Process_Models_With_an_Application_to_Computer_Modeling","names":["Robert B. Gramacy","Herbert K. H. Lee","Journal of the American Statistical Association"],"references":{"227925526":"Bayesian estimation of semi-parametric non-stationary spatial covariance structure","2927976":"Nonstationary Gaussian Processes For Regression And Spatial Modelling","4772045":"Bayesian Calibration of Computer Models","285744973":"Topics in spatial statistics","228597350":"The Practical Implementation of Bayesian Model Selection","2538401":"Infinite Mixtures of Gaussian Process Experts","221933053":"Interpolation of Spatial Data","222316168":"Bayesian partition modelling","2315626":"Spectral Methods for Nonstationary Spatial Processes","243770509":"Model Determination using Sampling-based Methods","2319535":"Objective Bayesian Analysis of Spatially Correlated Data","227661917":"Green, P.J.: On Bayesian analysis of mixtures with an unknown number of components (with discussion). J. Roy. Stat. Soc. B. 59, 731-792","4818693":"Gaussian processes and limiting linear models","237104492":"Marko Chain Monte Carlo in Practice","2365866":"Bayesian Inference for Nonstationary Spatial Covariance Structure via Spatial Deformations","34954629":"Bayesian Treed Gaussian Process Models","2348531":"On Bayesian analysis of mixture with unknown number of components","266597298":"Topics in spatial statistics. (With discussions)","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","23884791":"Automated CFD Parameter Studies on Distributed Parallel Computers","2450683":"Bayesian CART model search","238724762":"Some Aspects of the Spline Smoothing Approach to Non-Parametric Regression Curve Fitting","243637348":"Nonparametric Estimation of Nonstationary Spatial Covariance Structure","2952332":"Parameter space exploration with Gaussian process trees","216301381":"The Design and Analysis Computer Experiments","49256909":"Introduction to algorithms","247442902":"Introduction To Algorithms","2611597":"An introduction to PL algorithms","220688589":"Introduction to Algorithms, Second Edition","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","4741989":"Analyzing Nonstationary Spatial Data Using Piecewise Gaussian Processes","2321171":"Classification of Regression Lines","2817500":"Non-Stationary Spatial Modeling","243655672":"A Bayesian CART algorithm","229703310":"Classification and Regression Trees","4772151":"Bayesian inference for non-stationary spatial covariance structure via spatial deformations"},"citedIn":{},"index":996}