{"abs":"The development of methods for dealing with continuous data with a spike at zero has lagged behind those for overdispersed or zero-inflated count data. We consider longitudinal ecological data corresponding to an annual average of 26 weekly maximum counts of birds, and are hence effectively continuous, bounded below by zero but also with a discrete mass at zero. We develop a Bayesian hierarchical Tweedie regression model that can directly accommodate the excess number of zeros common to this type of data, whilst accounting for both spatial and temporal correlation. Implementation of the model is conducted in a Markov chain Monte Carlo (MCMC) framework, using reversible jump MCMC to explore uncertainty across both parameter and model spaces. This regression modelling framework is very flexible and removes the need to make strong assumptions about mean-variance relationships a priori. It can also directly account for the spike at zero, whilst being easily applicable to other types of data and other model formulations. Whilst a correlative study such as this cannot prove causation, our results suggest that an increase in an avian predator may have led to an overall decrease in the number of one of its prey species visiting garden feeding stations in the United Kingdom. This may reflect a change in behaviour of house sparrows to avoid feeding stations frequented by sparrowhawks, or a reduction in house sparrow population size as a result of sparrowhawk increase. © 2015 The Author. Biometrical Journal published by WILEY-VCH Verlag GmbH \u0026 Co. KGaA, Weinheim.","title":"Bayesian hierarchical modelling of continuous non-negative longitudinal data with a spike at zero: An application to a study of birds visiting gardens in winter","id":273122233,"url":"https://www.researchgate.net/publication/273122233_Bayesian_hierarchical_modelling_of_continuous_non-negative_longitudinal_data_with_a_spike_at_zero_An_application_to_a_study_of_birds_visiting_gardens_in_winter","names":["Ben Swallow","Stephen T. Buckland","Ruth King","Mike P. Toms","Biometrical Journal"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","277425353":"The Role of the Eurasian Sparrowhawk ( Accipiter nisus ) in the Decline of the House Sparrow ( Passer domesticus ) in Britain","26711638":"The use of simple reparameterizations to improve the efficiency of Markov chain Monte Carlo estimation for multilevel models with applications to discrete time survival models","265367507":"Exponential dispersion models","263818042":"Using citizen science to investigate the role of productivity in House Sparrow Passer domesticus population trends","43485139":"Fitting Tweedie\u0027s Compound Poisson Model to Insurance Claims Data: Dispersion Modelling","230295038":"Annual and seasonal trends in the use of garden feeders by birds in winter","6330085":"On Smoothing Trends in Population Index Modeling","227960464":"Size and Trends of the House Sparrow (Passer domesticus) Population in Great Britain","37617720":"Demography and Management of the Invasive Plant Species Hypericum perforatum. I. Using Multi-Level Mixed-Effects Models For Characterizing Growth, Survival and Fecundity in a Long-Term Data Set","254788966":"The Birds of the Western Palearctic: Concise Edition","228021597":"Dealing with overdispersed count data in applied ecology","25454222":"The widespread declines of songbirds in rural Britain do not correlate with the spread of their avian predators. Proc R Soc Lond B","263353017":"Comparative investigation of three Bayesian values","241681386":"Bayesian Model Assessment Using Pivotal Quantities","257665558":"Likelihood-based and Bayesian methods for Tweedie compound Poisson linear mixed models. Stat Comput","233143797":"Some applications of nonlinear and non-Gaussian state–space modelling by means of hidden Markov models","221962666":"Reproductive success of House Sparrows along an urban gradient","221995881":"Bayesian Data Analysis, London","229886049":"Two Tweedie distributions that are near-optimal for modeling monthly rainfall in Australia","246910756":"Multivariate Statistical Inference and Applications","269738119":"The Theory of Dispersion Models","257557647":"A Poisson–Gamma model for analysis of ecological non-negative continuous data","226920337":"Modelling spatial zeroinated continuous data with an exponentially compound Poisson process","216632752":"Taylor LR. Aggregation, Variance and the Mean. Nature","243739482":"Efficient Metropolis Jumping Rules","230693341":"Density Dependence in Time Series Observations of Natural Populations: Estimation and Testing","239384155":"General Methods for Monitoring Convergence of Iterative Simulations","227726896":"Occurrence and quantity of precipitation can be modeled simultaneously","260974825":"A Bayesian X2 test for goodness-of-fit","227509928":"Zero tolerance ecology: improving ecological inference by modelling the source of zero observations. Ecol Lett 8:1235-1246","263843729":"Population Trends in British Breeding Birds","227623801":"Population change of avian predators and grey squirrels in England: Is there evidence for an impact on avian prey populations?","222512745":"Application of the Tweedie distribution to zero-catch data in CPUE analysis","262875648":"Bayesian Analysis in Population Ecology","220286602":"Series evaluation of Tweedie exponential dispersion densities","31186037":"Efficient Parametrisations for Normal Linear Mixed Models","227777532":"Perry M, Hollis DThe generation of monthly gridded datasets for a range of climatic variables over the UK. Int J Climatol 25: 1041-1054","229548481":"On a log-linear approach to detecting ecological interactions in monitored populations. Ibis","2606487":"Model Checking and Model Improvment","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","271205402":"Bayes Factor","226605808":"Sparrowhawk Accipiter nisus and winter bird abundance. J Ornithol","248350904":"A simple Poisson–gamma model for modelling rainfall occurrence and amount simultaneously","273028536":"Survey estimates of king crab (Paralithodes camtschaticus) abundance off Northern Norway using GLMs within a mixed generalized gamma-binomial model and Bayesian inference","229510800":"The recent declines of farmland bird populations in Britain: An appraisal of causal factors and conservation actions","228784476":"Modeling catch and effort data using generalized linear models, the Tweedie distribution, random vessel effects and random stratum-by-year effects"},"citedIn":{"281620752":"Effects of ranger stations on predator and prey distribution and abundance in an Iranian steppe landscape"},"index":999}