{"abs":"This article addresses the problem of derivative-free (single- or multi-objective) optimization subject to multiple inequality constraints. Both the objective and constraint functions are assumed to be smooth, non-linear and expensive to evaluate. As a consequence, the number of evaluations that can be used to carry out the optimization is very limited, as in complex industrial design optimization problems. The method we propose to overcome this difficulty has its roots in the Bayesian and the multiobjective optimization literatures. More specifically, an extended domination rule is used to handle the constraints and a corresponding Bayesian expected hyper-volume improvement sampling criterion is proposed. This new criterion extends existing Bayesian sampling criteria to the multi-objective constrained case, and makes it possible to start the algorithm without an initial feasible point. The calculation and optimization of the criterion are performed using Sequential Monte Carlo techniques. In particular, an algorithm similar to the subset simulation method, which is well known in the field of structural reliability, is used to estimate the expected hyper-volume improvement criterion. The method, which we call BMOO (for Bayesian Multi-Objective Optimization), is compared to state-of-the-art algorithms for single-objective and multi-objective constrained optimization problems.","title":"A Bayesian approach to constrained single- and multi-objective optimization","id":282570552,"url":"https://www.researchgate.net/publication/282570552_A_Bayesian_approach_to_constrained_single-_and_multi-objective_optimization","names":["Paul Féliot","Julien Bect","Emmanuel Vazquez"],"references":{"242922491":"Bayesian Approach to Global Optimization--Theory and Applications","272521912":"Predictive Entropy Search for Bayesian Optimization with Unknown Constraints","227227789":"Sequential Design of Computer Experiments for Constrained Optimization","49458431":"A tutorial on adaptive MCMC","265543262":"A Globally Convergent Augmented Lagrangian Algorithm for Optimization with General Constraints and Simple Bounds","257299288":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction","235709727":"The computation of the expected improvement in dominated hypervolume of Pareto front approximations","269996418":"Gaussian Processes for Machine Learning (Adaptive Computation and Machine Learning)","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","232875897":"Multiobjective design optimization by an evolutionary algorithm","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","265209813":"Faster Computation of Expected Hypervolume Improvement","264936662":"A new integral loss function for Bayesian optimization","248818761":"The application of Bayesian methods for seeking the extremum","216301381":"The Design and Analysis Computer Experiments","216301383":"Exploration of Metamodeling Sampling Criteria for Constrained Global Optimization","237548813":"Choosing the Sample Size of a Computer Experiment: A Practical Guide","4201703":"Efficient global optimization (EGO) for multi-objective problem and data mining","228789130":"Examples of adaptive MCMC","216457295":"On Expected-Improvement Criteria for Model-based Multi-objective Optimization","226031060":"Sequential Monte Carlo for rare event estimation","215446267":"Monte Carlo Strategies in Scientic Computing","247644014":"Interpolation of Spatial Data: Some Theory of Kriging","216301386":"Flexibility and Efficiency Enhancements For Constrainted Global Design Optimization with Kriging Approximations","274553583":"Updating Kriging Surrogate Models Based on the Hypervolume Indicator in Multi-Objective Optimization","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","216301271":"A Direct Search Optimization Method That Models the Objective and Constraint Functions by Linear Interpolation","216301407":"Global versus local search in constrained optimization of computer models","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","254230112":"Non-Stationary Kriging For Design Optimization","244959955":"A New Method of Locating the Maximum Point of an Arbitrary Multipeak Curve in the Presence of Noise","4181106":"Comparison of resampling schemes for particle filtering","285458515":"A General Framework for Constrained Bayesian Optimization using Information-based Search","200806059":"An Analysis of Transformation","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","263244902":"Constrained optimization by radial basis function interpolation for high-dimensional expensive black-box problems with infeasible initial points","41222435":"Monte Carlo Statistical Method","221228406":"Multiobjective Optimization on a Budget of 250 Evaluations","268702047":"On Bayesian methods of optimisation","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","258163201":"Fast calculation of multiobjective probability of improvement and expected improvement criteria for Pareto optimization","228754624":"Optimization of Combustion Chamber for Diesel Engine Using Kriging Model","221025610":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","284219670":"Predictive Entropy Search for Multi-objective Bayesian Optimization","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","261065571":"Bayesian Optimization with Unknown Constraints","232805135":"Deep Gaussian Processes","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","220702165":"Multiobjective Optimization on a Limited Budget of Evaluations Using Model-Assisted $\\mathcal{S}$ -Metric Selection","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","216457235":"A SEQUENTIAL DESIGN FOR APPROXIMATING THE PARETO FRONT USING THE EXPECTED PARETO IMPROVEMENT FUNCTION","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","4993330":"Sequential Monte Carlo Samplers"},"citedIn":{},"index":1}