{"abs":"This paper proposes a novel approach to aircraft conflict resolution where the design of an optimal conflict resolution manoeuvre based on the aircraft intent information is robustified against the uncertainty affecting the aircraft future positions by a randomized stochastic optimization method. The goal is to account for a probabilistic description of the uncertainty affecting the aircraft motion, while avoiding the excessive computational load of a pure Monte Carlo stochastic optimization method.","title":"A two-step approach to aircraft conflict resolution combining optimal deterministic design with Monte Carlo stochastic optimization","id":265035017,"url":"https://www.researchgate.net/publication/265035017_A_two-step_approach_to_aircraft_conflict_resolution_combining_optimal_deterministic_design_with_Monte_Carlo_stochastic_optimization","names":["Maria Prandini","Luigi Piroddi","John Lygeros"],"references":{"220286753":"Marginal Maximum A Posteriori Estimation using Markov Chain Monte Carlo","284776697":"Simulation Based Optimal Design","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","268209561":"M Carlo Statistical Methods","3427985":"Monte Carlo Optimization for Conflict Resolution in Air Traffic Control","221618866":"Simulated Annealing: Rigorous finite-time guarantees for optimization on continuous domains","245433225":"Optimal Coordinated Maneuvers for Three-Dimensional Aircraft Conflict Resolution","220108886":"Monte Carlo Optimization for Conflict Resolution in Air Traffic Control.","221024229":"Air Traffic Conflict Resolution by Genetic Algorithms.","4747012":"Optimal Bayesian Design by Inhomogeneous Markov Chain Simulation","3207458":"Estimation via Markov chain Monte Carlo","3427815":"Conflict Resolution Problems for Air Traffic Management Systems Solved with Mixed Integer Programming","220259124":"Optimal Coordinated Motions of Multiple Agents Moving on a Plane","3427938":"Aircraft Conflict Prediction in the Presence of a Spatially Correlated Wind Field","37997876":"Resolution of Conflicts Involving Many Aircraft via Semidefinite Programming","3427789":"A Review of Conflict Detection and Resolution Modeling Methods","243781021":"Deterministic resolution of two aircraft conflict in free flight","221042707":"On the approximate domain optimization of deterministic and expected value criteria"},"citedIn":{},"index":1000}