{"abs":"We apply a recent methodology, Bayesian stochastic model specification search (SMSS), for the selection of the unobserved components (level, slope, seasonal cycles, trading days effects) that are stochastically evolving over time. SMSS hinges on two basic ingredients: the non-centered representation of the unobserved components and the reparameterization of the hyperparameters representing standard deviations as regression parameters with unrestricted support. The choice of the prior and the conditional independence structure of the model enable the definition of a very efficient MCMC estimation strategy based on Gibbs sampling. We illustrate that the methodology can be quite successfully applied to discriminate between stochastic and deterministic trends, fixed and evolutive seasonal and trading day effects.","title":"Bayesian Stochastic Model Specification Search for Seasonal and Calendar Effects","id":48375878,"url":"https://www.researchgate.net/publication/48375878_Bayesian_Stochastic_Model_Specification_Search_for_Seasonal_and_Calendar_Effects","names":["Tommaso Proietti","Stefano Grassi"],"references":{"254333225":"Forecasting, Structural Time Series and the Kalman Filter","270244127":"Applied Time Series Analysis of Economic Data","254283119":"The Estimation of a Changing Seasonal Pattern","5108678":"The Seasonal Adjustment of Economic Time Series","46494856":"Stochastic model specification search for Gaussian and partial non-Gaussian state space models","254286055":"Calendar Effects in Monthly Time Series: Modeling and Adjustment","222478227":"Dynamic linear models for time series components","216633469":"Markov Chain Monte Carlo: Stochastic Simulation for Bayesian Inference. Chapman \u0026 Hall/CRC: Boca Raton, FL","227459802":"Seasonal Analysis of Economic Time Series","24127653":"An efficient and simple simulation smoother for state space time series analysis","235926677":"Bayesian Forecasting and Dynamic Linear Models","227389591":"The Econometric Analysis of Seasonal Time Series","275627952":"Modelling Seasonality","265520204":"Trading-Day Variations Multiple Regression Models with Random Parameters","268209561":"M Carlo Statistical Methods","31144561":"A Simple and Efficient Simulation Smoother for State Space Time Series Analysis","4749733":"Parameterisation and efficient MCMC estimation of non-Gaussian state space models","31186037":"Efficient Parametrisations for Normal Linear Mixed Models","252515555":"Some Recent Developments and Directions in Seasonal Adjustment","228538542":"Contemporary Bayesian Econometrics and Statistics","224881809":"Approaches for Bayesian Variable Selection","238727682":"Variable Selection Via Gibbs Sampling","222588669":"Seasonal integration and the evolving seasonals model","4747826":"Are Seasonal Patterns Constant Over Time? A Test for Seasonal Stability","254286162":"Modeling Time Series With Calendar Variation","274851871":"Analysis of Economic Time Series: A Synthesis","230483011":"Selection and estimation of component models for seasonal time series"},"citedIn":{"239804655":"Stochastic trends and seasonality in economic time series: new evidence from Bayesian stochastic model specification search","43694435":"Characterizing economic trends by Bayesian stochastic model specification search"},"index":1001}