{"abs":"The Planck satellite, along with ground based telescopes such as the Atacama Cosmology Telescope (ACT) and the South Pole Telescope (SPT), have mapped the cosmic microwave background (CMB) at such an unprecedented resolution as to allow a detection of the subtle distortions due to the gravitational influence of intervening dark matter. This distortion is called gravitational lensing and has become a powerful probe of cosmology and dark matter. Estimating gravitational lensing is important for two reasons. First, the weak lensing estimates can be used to construct a map of dark matter which would be invisible otherwise. Second, weak lensing estimates can, in principle, un-lense the observed CMB to construct the original CMB radiation fluctuations. Both of these maps, the unlensed CMB radiation field and the dark matter field, are deep probes of cosmology and cosmic structure. Bayesian techniques seem a perfect fit for the statistical analysis of lensing and the CMB. One reason is that the priors for the unlensed CMB and the lensing potential are---very nearly---Gaussian random fields. The Gaussianity coming from physically predicted quantum randomness in the early universe. However, challenges associated with a full Bayesian analysis have prevented previous attempts at developing a working Bayesian prototype. In this paper we solve many of these obstacles with a re-parameterization of CMB lensing. This allows us to obtain draws from the Bayesian lensing posterior of both the lensing potential and the unlensed CMB which converges remarkably fast.","title":"Bayesian inference of CMB gravitational lensing","id":269577647,"url":"https://www.researchgate.net/publication/269577647_Bayesian_inference_of_CMB_gravitational_lensing","names":["Ethan Anderes","Benjamin D. Wandelt","Guilhem Lavaux","The Astrophysical Journal"],"references":{"221707604":"Bayesian physical reconstruction of initial conditions from large scale\nstructure surveys","51911291":"Bayesian inference from photometric redshift surveys","47350961":"Local non-Gaussianity in the Cosmic Microwave Background the Bayesian way","232276059":"Efficient Wiener filtering without preconditioning","1761278":"Fast optimal CMB power spectrum estimation with Hamiltonian sampling","230996609":"Julia: A Fast Dynamic Language for Technical Computing","256097316":"A multi-level solver for Gaussian constrained CMB realizations","290888721":"A measurement of the cosmic microwave background B-mode polarization power spectrum at sub-degree scales with POLARBEAR","227537191":"Bayesian non‐linear large‐scale structure inference of the Sloan Digital Sky Survey Data Release 7","231032684":"Mapping the Dark Matter through the Cosmic Microwave Background Damping Tail","237077421":"Methods for Bayesian power spectrum inference with galaxy surveys","31186037":"Efficient Parametrisations for Normal Linear Mixed Models","2214798":"Stability of the Gibbs Sampler for Bayesian Hierarchical Models","1800084":"Power Spectrum Estimation from High‐Resolution Maps by Gibbs Sampling","260126833":"Matrix-free Large Scale Bayesian inference in cosmology","239756954":"To Center or Not to Center: That is Not the Question — An Ancillarity-Sufficiency Interweaving Strategy (ASIS) for Boosting MCMC Efficiency","1762088":"A General Framework for the Parametrization of Hierarchical Models","222839057":"Weak gravitational lensing of the CMB","231150749":"Mass Reconstruction with Cosmic Microwave Background Polarization","241904784":"Efficient cosmological parameter estimation with Hamiltonian Monte Carlo technique","255829091":"A Measurement of Gravitational Lensing of the Microwave Background Using South Pole Telescope Data"},"citedIn":{},"index":1003}