{"abs":"In most examples of inference and prediction, the expression of uncertainty about unknown quantities y on the basis of known quantities x is based on a model M that formalizes assumptions about how x and y are related. M will typically have two parts: structural assumptions S, such as the form of the link function and the choice of error distribution in a generalized linear model, and parameters θ whose meaning is specific to a given choice of S. It is common in statistical theory and practice to acknowledge parametric uncertainty about θ given a particular assumed structure S; it is less common to acknowledge structural uncertainty about S itself. A widely used approach involves enlisting the aid of x to specify a plausible single ‘best’ choice S * , for S, and then proceeding as if S * were known to be correct. In general this approach fails to assess and propagate structural uncertainty fully and may lead to miscalibrated uncertainty assessments about y given x. When miscalibration occurs it will often result in understatement of inferential or predictive uncertainty about y, leading to inaccurate scientific summaries and overconfident decisions that do not incorporate sufficient hedging against uncertainty. I discuss a Bayesian approach to solving this problem that has long been available in principle but is only now becoming routinely feasible, by virtue of recent computational advances, and examine its implementation in examples that involve forecasting the price of oil and estimating the chance of catastrophic failure of the US space shuttle.","title":"Assessment and Propagation of Model Uncertainty (with Discussion)","id":265505742,"url":"https://www.researchgate.net/publication/265505742_Assessment_and_Propagation_of_Model_Uncertainty_with_Discussion","names":[],"references":{},"citedIn":{"277253254":"MMI: Multimodel inference or models with management implications?: Multimodel Inference and Models for Management","248808660":"Practical Identifiability Analysis of Large Environmental Simulation Models","254211877":"Multiple rank tests for pairwise comparisons","14311135":"Applications of a mixture survival model with covariates to the analysis of a depression prevention trial","228133791":"Doing Well and Doing Good: A Multidimensional Puzzle","283324645":"Bayesian model selection methods in modeling small area colon cancer incidence","2311716":"The Variable Selection Problem","222698318":"A Bayesian Predictive Approach to Model Selection.","2625570":"Effects Of Ambient Fine And Coarse Particles On Mortality In Phoenix, Arizona","260031345":"Die Bedeutung der Itemauswahl und der Modellwahl für die längsschnittliche Erfassung von Kompetenzen","238865459":"Bayesian Inference of the Cell Probabilities of a Two-Way Categorical Table Under Non Ignorability","223147356":"Robust Bayesian analysis with partially exchangeable priors","229733795":"Comparison of a single‐model EPS with a multi‐model ensemble consisting of a few operational models","228796853":"Automatic Bayesian model averaging for linear regression and applications in Bayesian curve fitting","228604342":"Bayesian Inference and Decision Theory – A Framework for Decision Making in Natural Resource Management","4730463":"Choosing a Model Selection Strategy","243042916":"The distribution of estimators after model selection: Large and small sample results","2350651":"Regression Models for Decision Making: A Cost-Benefit Analysis of Incentives in Telephone Surveys","228879800":"Modeling and predicting extrapolated probabilities with outlooks. Statistica Sinica 18","231093721":"Interval estimation of global H-mode energy confinement in ITER","226596257":"Gibson, G. J. \u0026 Renshaw, E. Likelihood estimation for stochastic compartmental models using Markov chain methods. Statistics and Computing 11, 347-358","226950052":"Model Selection Uncertainty and Bayesian Model Averaging in Fisheries Recruitment Modeling","7997017":"Multiple Imputation for Model Checking: Completed‐Data Plots with Missing and Latent Data","227369384":"Rao-Blackwellization for Bayesian Variable Selection and Model Averaging in Linear and Binary Regression: A Novel Data Augmentation Approach","222485349":"A Method for Simultaneous Variable Selection and Outlier Identification in Linear Regression;","38326880":"Logicist Statistics I. Models and Modeling","222881636":"Requirements for effective modeling strategies","24312159":"Accounting for uncertainty in health economic decision models using model averaging","228772748":"Bayesian methods for testing the randomness of lottery draws","222506867":"On the Usefulness of Over Parameterized Ecological Models","5001852":"Model Averaging and Value-at-Risk Based Evaluation of Large Multi Asset Volatility Models for Risk Management","46537462":"Likelihood for statistically equivalent models","268148175":"An Investigation of Growth Mixture Models for Studying the Flynn Effect","33400267":"El futuro de los métodos estadísticos","263479683":"A Framework for Expert Judgment to Assess Oil and Gas Resources","4993140":"A Bayesian approach to Markov modelling in cost-effectiveness analyses: Application to taxane use in advanced breast cancer","243103300":"Markov Chain Monte Carlo Methods for Computing Bayes Factors","228735897":"Knowledge and data fusion in probabilistic networks","24142156":"In Search of a Sulphur Dioxide Environmental Kuznets Curve: A Bayesian Model Averaging Approach","264636411":"Population-based epidemiology of amyotrophic lateral sclerosis (ALS) in an ageing Europe - the French register of ALS in Limousin (FRALim register)","37434491":"A note on model uncertainty in linear regression","45114611":"Prequential Analysis of Complex Data with Adaptive Model Reselection.","4899343":"Modelling volatility asymmetries: A Bayesian analysis of a class of tree structured multivariate GARCH models","24171318":"Bayesian model averaging in meta-analysis: Vitamin E supplementation and mortality","243770060":"Model Selection: An Integral Part of Inference","243102774":"A review on linear mixed models for longitudinal data, possibly subject to dropout","227581404":"Combining models in longitudinal data analysis","257800974":"Ecological Prediction With Nonlinear Multivariate Time-Frequency Functional Data Models","4902430":"A full-factor multivariate GARCH model","291294986":"Bayesian Statistics in Quantitative Risk Assessment","220343668":"Population Markov Chain Monte Carlo","225666863":"Bayesian model averaging assessment on groundwater management under model structure uncertainty","281634967":"Estimation of the Impact of Meningococcal Serogroup C Universal Vaccination in Italy and Suggestions for the Multicomponent Serogroup B Vaccine Introduction","222690586":"A Discussion of Parameter and Model Uncertainty in Insurance","235764332":"Orthogonalizations and Priors for Orthogonalized Model Mixing","4720681":"Full bayesian inference for GARCH and EGARCH models","46538914":"Population-based reversible jump Markov chain Monte Carlo methods for Bayesian variable selection and evaluation under cost limit restrictions","2559553":"Finding Overlapping Components with MML","228806085":"Projecting the Biological Condition of Streams Under Alternative Scenarios of Human Land Use","265566131":"Dealing with uncertainty in the economic evaluation of health care technologies","227647478":"Model-Based Geostatistic","4986916":"Regression Modeling and Meta-analysis for Decision Making: A Cost-Benefit Analysis of Incentives in Telephone Surveys.","222551850":"Measuring the Health Effects of Air Pollution: To What Extent Can We Really Say that People Are Dying from Bad Air?","254211916":"CD posterior – combining prior and data through confidence distributions","226524140":"Adjusting AIDS incidence for non-stationary reporting delays: A necessity for country comparisons","4746789":"Methods and Criteria for Model Selection","216633988":"Fitting and testing stochastic models with application in plant epidemiology","265483708":"Orthogonal Data Augmentation for Bayesian Model Averaging","287713608":"Introduction to capture-recapture studies","220451667":"Statistical Themes and Lessons for Data Mining","242916874":"Linearly Combining Density Estimators via Stacking","237444693":"Bayesian Prediction Using Adaptive Ridge Estimators","247246031":"Capture–recapture estimates of the local and national prevalence of problem drug use in Scotland","2244693":"Perfect Simulation for orthogonal model mixing","12703414":"Royston P, Ambler G, Sauerbrei WThe use of fractional polynomials to model continuous risk variables in epidemiology. Int J Epidemiol 28(5): 964-974","4914226":"Local model uncertainty and incomplete-data bias","5168695":"Re-Examining the Consumption-Wealth Relationship: The Role of Model Uncertainty","262221784":"Extending Extreme Learning Machine with Combination Layer","235049086":"A Computer-Aided Diagnosis System for Breast Cancer Combining Mammography and Proteomics","254257498":"Integrated Treatment of Model and Parameter Uncertainties Through a Bayesian Approach","2730071":"Markov Chain Monte Carlo Model Determination for Hierarchical and Graphical Log-linear Models","5303508":"Model Selection and Health Effect Estimation in Environmental Epidemiology","279540781":"Recommendations for the Application of Biostatistical Methods During the Development and Validation of Alternative Toxicological Methods ECVAM Biostatistics Task Force Report 1","4772045":"Bayesian Calibration of Computer Models","4053688":"A Bayesian framework for modeling demand in supply chain simulation experiments","256680395":"A model-based methodology for the analysis and design of atomic layer deposition processes—Part II: Experimental validation and mechanistic analysis","23565805":"Bayesian Averaging over Many Dynamic Model Structures with Evidence on the Great Ratios and Liquidity Trap Risk","290248135":"Maximum likelihood Bayesian averaging of air flow models in unsaturated fractured tuff","6706934":"Model weights and the foundations of multimodel inference. Ecology","258516474":"Classification and Regression Trees: A Powerful Yet Simple Technique for Ecological Data Analysis","250077300":"Identifying Ecological Change and Its Causes: A Case Study on Coral Reefs","12225570":"Estimating deaths from industrial injury by capture-recapture: A cautionary tale","233192319":"Stochastic Search Variable Selection for Log-linear Models","4993237":"Estimates of HIV prevalence and proportion diagnosed based on Bayesian multi-parameter synthesis of surveillance data","34774158":"Nonlinear model evaluation: l-shadowing, probabilistic prediction and weather forecasting","4993233":"A flexible marginal modeling strategy for non-monotone missing data","254425013":"Model Uncertainty in Characterizing Recreation Demand","237623990":"Uncertain reduction and characterization for complex environmental fate and transport models: An empirical Bayesian framework incorporating the stochastic response surface method","2286722":"Posterior Predictive Assessment of Model Fitness Via Realized Discrepancies","251463775":"Chapter 9 Subjective Probability and Bayesian Methodology","13713522":"Assessing Placebo Response Using Bayesian Hierarchical Survival Models","2468993":"Bayesian forecasting and inference in latent structure for the Brazilian GDP and Industrial Production Index","4993256":"Bayes model averaging with selection of regressors. J R Stat Soc B","2471040":"Steps To Implement Bayesian Input Distribution Selection","227646260":"Bayesian inference in ecology. Ecol Lett 7:509-520","281209962":"Finding the right balance between groundwater model complexity and experimental effort via Bayesian model selection","4772065":"Model selection in spline nonparametric regression","222216085":"“Unraveling the Fortune of the Fortunate: An Iterative Bayesian Model Averaging (IBMA) Approach","223771131":"On properties of predictors derived with a two-step bootstrap model averaging approach—A simulation study in the linear regression model","43100223":"Structural and parameter uncertainty in Bayesian cost-effectiveness models","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","242625735":"Probabilistic uncertainty speci…cation: expert judgement of input uncertainties in a mechanistic model of carbon ‡ux","3670666":"Reducing the uncertainty in fluorescent lamp/ballast system compatibility","271530139":"Models and model selection uncertainty in estimating growth rates of endangered freshwater mussel populations","2469009":"Wind Speed Prediction in a Complex Terrain","257929706":"Modelling non-stationary natural mortality in catch-at-age models","253139360":"MATURE HARDWOOD FORESTS OF THE CENTRAL PIEDMONT OF NORTH CAROLINA: LANDSCAPE DISTRIBUTION AND UNDERSTORY CHANGE","49800769":"Risk, Unexpected Uncertainty, and Estimation Uncertainty: Bayesian Learning in Unstable Settings","228203309":"Evidence for Hedge Fund Predictability from a Multivariate Student-T Full-Factor GARCH Model","232986459":"Bayesian Inference and Forecasting in Dynamic Neural Networks with Fully Markov Switching ARCH Noises","2540191":"Bayesian Data Analysis for Data Mining","5162740":"Forecasting in Large Macroeconomic Panels Using Bayesian Model Averaging","255597952":"Bayesian Model Averaging for Multiple Structural Change Models","24119759":"Bayesian Model Averaging in Vector Autoregressive Processes with an Investigation of Stability of the US Great Ratios and Risk of a Liquidity Trap in the USA, UK and Japan.","233259814":"A Criterion for Optimal Predictive Model Selection","277284931":"Predicting and Retrospective Analysis of Soccer Matches in a League","11611253":"Variable selection and Bayesian model averaging in case-control studies","4741774":"Combining Linear Regression Models: When and How?","24132536":"Modeling and Estimation Methods for Household Size in the Presence of Nonresponse Applied to The Norwegian Consumer Expenditure Survey","225128354":"Model Selection for Two View Geometry:A Review","233494305":"Efficient Approximations for the Marginal Likelihood of Bayesian Networks with Hidden Variables","4746883":"Parameterization and Bayesian Modeling","2896615":"Model uncertainty. Stat Sci","10601069":"Strategies to Fit Pattern-Mixture Models","254405605":"Evidence on Features of a DSGE Business Cycle Model from Bayesian Model Averaging","221527525":"Panel discussion on current issues in input modeling: panel on current issues in simulation input modeling.","254063088":"Applying Bayesian Model Averaging for Quantile Estimation in Accelerated Life Tests","2718463":"Stacked Density Estimation","227950401":"Modelling of mantle postglacial relaxation in axisymmetric geometry with a composite rheology and a glacial load interpolated by adjusted spherical harmonics analysis","265273623":"Water Quality Monitoring: Water Quality Monitoring: From River To Reef From River To Reef","235898070":"Biodiversity loss in a changing planet","10606715":"A Local Influence Approach Applied to Binary Data from a Psychiatric Study","229047161":"Bayesian Model Averaging of Dynamic Linear Models","283115070":"Comparison of the Frequentist MATA Confidence Interval with Bayesian Model-Averaged Confidence Intervals","226874212":"Classification with Bayesian MARS","5778106":"Combining data from multiple sources, with applications to environmental risk assessment. Stat Med","254211012":"On hierarchical prior specifications and penalized likelihood","8211097":"Comparison of Bayesian model averaging and stepwise methods for model selection in logistic regression. Stats Med","254211010":"Inadmissible estimators of normal quantiles and two-sample problems with additional information","254211011":"Multiagent estimators of an exponential mean","278231667":"The philosophy of statistics - Comments","254211008":"Reducing data nonconformity in linear models","254211009":"A weak functional framework for applications in statistics","233582854":"Models and model selection uncertainty in estimating growth rates of endangered freshwater mussel populations","2713283":"Prediction Using Orthogonalized Model Mixing","222708653":"Benchmark priors for Bayesian Model Averaging. J Econom 100: 381-427","3997905":"Panel on current issues in simulation input modeling","220136434":"Reducing parameter uncertainty for stochastic systems","227785598":"A Simulation Approach to Nonparametric Empirical Bayes Analysis","266679057":"Multimodel Bayesian analysis of groundwater data worth","226133388":"Modeling Landscape Vegetation Pattern in Response to Historic Land-use: A Hypothesis-driven Approach for the North Carolina Piedmont, USA","4788927":"A Bayesian Non-parametric Comparison of Two Treatments","221526472":"Bayesian Ideas and Discrete Event Simulation: Why, What and How","257466788":"Generalized Gaussian mixture models as a nonparametric Bayesian approach for clustering using class-specific visual features","46475322":"Stochastic Search Variable Selection in Vector Error Correction Models with an Application to a Model of the UK Macroeconomy","220286430":"Option pricing under Model and Parameter Uncertainty using Predictive Densities","254271527":"Hierarchical Models and Statistical Issues in Health Eects of Ambient Airborne Particulate Matter","274450265":"A Skew-Normal Mixture Regression Model","222533191":"Parametric and nonparametric Bayesian model specification: a case study involving models for count data. Comput Stat Data Anal","258358882":"A comparative analysis of different models of aftershock rate decay by maximum likelihood estimation of simulated sequences","236346128":"Brittleness of Bayesian inference and new Selberg formulas","10897838":"Stability of Multivariable Fractional Polynomial Models with Selection of Variables and Transformations","241359722":"IMPUTATION HOT-DECK POUR LE MODÈLE DE RÉPONSE","221994544":"Bayesian enhanced strategic decision making for reliability","227689113":"Generalized additive models for location, scale and shape (GAMLSS). R J Stat Softw","11266471":"A Bayesian analysis of a proportion under non-ignorable non-response","267380963":"Bayesian Model Specification: Heuristics and Examples","238166847":"Guest editorial: The role of sensitivity analysis in the corroboration of models and itslink to model structural and parametric uncertainty","266530541":"Une répartition bayésienne des électeurs indécis","248216539":"An empirical comparison among aftershock decay models","201997083":"Multivariate Regression Trees: A New Technique for Modeling Species-Environment Relationships","24079485":"Some comments on model development and posterior existence","227951749":"A strategy for modelling the effect of a continuous covariate in medicine and epidemiology","227803271":"Fitting copulas to bivariate earthquake data: The seismic gap hypothesis revisited","7059326":"A Local Influence Sensitivity Analysis for Incomplete Longitudinal Depression Data","225950317":"Accounting for Model Uncertainty in the Prediction of University Graduation Rates","226199648":"Bayesian analysis of M/Er/1 and M/H_k/1 queues","228597438":"Does air pollution cause respiratory illness? A new look at Canadian cities","41714524":"Methodological Progress in On-Farm Regional Agronomic Diagnosis: A Review","2504967":"Bayesian Variable Selection Using the Gibbs Sampler","256109665":"Software review","29654758":"Statistical Decision Problems and Bayesian Nonparametric Methods","290408556":"Additional File 3","239591779":"Multimodel Inference for Reserving","4887407":"‘Monetary Policy Analysis in a Small Open Economy Using Bayesian Cointegrated Structural VARs’","267107008":"Birth Defects Registered by Double Sampling: A Bayesian Approach Incorporating Covariates and Model Uncertainty","228780174":"Un enfoque Bayesiano para incorporar pronósticos de la demanda en experimentos por simulación para la administración de inventarios","227663549":"Confessions of a pragmatic statistician","224839755":"Model Uncertainty, Data Mining and Statistical Inference","4741989":"Analyzing Nonstationary Spatial Data Using Piecewise Gaussian Processes","227960505":"The role of model selection in describing stochastic ecological processes. Oikos, 116, 966-974","27349649":"Bayesian estimation of design loads","260651193":"Validation methodology for distribution-based degradation model","2458903":"Confidence Intervals and Prediction Intervals for Feed-Forward Neural Networks","228736151":"… characterization for complex environmental fate and transport models: an empirical Bayesian framework incorporating the stochastic response surface method","4986746":"Markov Chain Monte Carlo Methods for Computing Bayes Factors: A Comparative Review","264233608":"Growth Models for Fisheries: The Effect of Unbalanced Sampling Error On Model Selection, Parameter Estimation, and Biological Predictions","220210204":"Bayesian Simulation and Decision Analysis: An Expository Survey","240792422":"Terminology and methodology in modelling for water quality management - A discussion starter","220499994":"Bayesian Radial Basis Functions of Variable Dimension","4818807":"Bayesian mixture of autoregressive models","38012164":"Bayesian model selection using test statistics","222669317":"Model validation and predictive capability for the thermal challenge problem","268043963":"GESAMAC: Conceptual and Computational Tools to Assess the Long-Term Risk from Nuclear Waste Disposal in the Geosphere","45185008":"Does Ignoring Model Selection When Assessing the Effect of Particulate Matter Air Pollution on Mortality Make Us Too Vigilant?","48872364":"Local model uncertainty and incomplete-data bias","243784641":"AN ASSESSMENT OF BAYESIAN MODEL-AVERAGED LOGISTIC REGRESSION FOR INTENSIVE-CARE PROGNOSIS","11034607":"Deconvolution of detector size effect for output factor measurement for narrow Gamma Knife radiosurgery beams","232380560":"Component metamodel synthesis for the construction of master response surfaces","29654664":"A Bayesian Formulation of Exploratory Data Analysis and Goodness–of–Fit Testing*","5889303":"25 years of Bayesian methods in the pharmaceutical industry: A personal, statistical bummel","232380566":"Computational modeling issues and methods for the “regulatory problem” in engineering – Solutions to the structural dynamics and static frame problems","282629001":"Design of Experiments and Data Analysis Challenges in Calibration for Forensics Applications","222569493":"An investigation of thresholds in air pollution–mortality effects","4899608":"Forecasting in dynamic factor models using Bayesian model averaging","224285709":"Visualizing Uncertainty in Geo-spatial Data","237422965":"BayesianMethodsforTestingtheRandomnessofLott eryDraws","229765346":"A Decision Theoretic Approach to Model Averaging","2625404":"Schwarz, Wallace, and Rissanen: Intertwining Themes in Theories of Model Selection","254610553":"Bayesian inference in modeling recreation demand","6133512":"Bayestan multimodel inference for dose-response studies","228775157":"Piecing together the past: Statistical insights into paleoclimatic reconstructions","254087749":"Recommendations for the Primary Analysis of Continuous Endpoints in Longitudinal Clinical Trials","2407238":"Bayesian Analysis For Simulation Input And Output","228530429":"Bayesian Modeling, Inference and Prediction","2301765":"Bayesian Graphical Models, Intention-to-Treat, and the Rubin Causal Model","2619712":"Multiple Shrinkage and Subset Selection in Wavelets","225762835":"Accounting for threshold uncertainty in extreme value estimation","7865106":"Residential Radon in Canada: An Uncertainty Analysis of Population and Individual Lung Cancer Risk","47713715":"AN INTERVAL BASED APPROACH TO MODEL INPUT UNCERTAINTY IN DISCRETE-EVENT SIMULATION","238699351":"ACCOUNTING FOR INPUT UNCERTAINTY IN DISCRETE-EVENT SIMULATION","3885909":"Bayesian methods for simulation","6342928":"Boosted Trees for Ecological Modeling and Prediction","2785114":"On the Relationship Between Model Uncertainty and Inferential/predictive Uncertainty","241681174":"Bayesian prediction with adaptive ridge estimators","5602081":"Bayesian wavelet networks for nonparametric regression","238016859":"Uncertainty Quantification in Computational Structural Dynamics: A New Paradigm for Model Validation","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","222664755":"Air pollution, economic activity and respiratory illness: Evidence from Canadian cities, 1974–1994","5162806":"Model Uncertainty and Bayesian Model Averaging in Vector Autoregressive Processes","51156085":"A Framework for Addressing Structural Uncertainty in Decision Models","277707249":"Bayes Factors","237093727":"Spatial Prediction of N2O Emissions in Pasture: A Bayesian Model Averaging Analysis","228604639":"Model uncertainty, penalization, and parsimony","2501030":"A comparison of Bayesian and likelihood-based methods for fitting multilevel models","252048005":"Estimating the Effect of a Prognostic or Risk Factor after Selection of an \"Optimal\" Cutpoint","246048559":"Eliciting prior information to enhance the predictive performance of Bayesian graphical models","221526705":"Reducing input parameter uncertainty for simulations.","220554400":"Updating under unknown unknowns: An extension of Bayes’ rule","2468771":"Model Uncertainty and Health Effect Studies for Particulate Matter","250826100":"ENHANCING THE PREDICTIVE PERFORMANCE OF BAYESIAN GRAPHICAL l\\IlODELS","46497613":"Mixed frequency models: Bayesian approaches to estimation and prediction","237680032":"Towards an integrated approach to stochastic process-based modelling: With applications to animal behaviour and spatio-temporal spread","257435859":"An improved code selection algorithm for fault prediction","2468777":"Strategies for Model Mixing in Generalized Linear Models","220674729":"Applying Bayesian ideas in simulation","228435987":"A Bayesian allocation of undecided voters","255659181":"MODELLING TERMINOLOGY AND METHODOLOGY FOR ACTIVATED SLUDGE MODELLING","264873049":"Multiscale Variability and Uncertainty Quantification Based on a Generalized Multiscale Markov Model","263225892":"Treatment comparisons for decision making: Facing the problems of sparse and few data","228756023":"WORKING PAPERS IN ECONOMICS \u0026 ECONOMETRICS Evidence on a Real Business Cycle model with Neutral and Investment-Specific Technology Shocks …","10627383":"Automated detection of informative combined effects in genetic association studies of complex traits","49654624":"A Flexible Approach to Bayesian Multiple Curve Fitting","227140638":"Estimating Risks to the Public Health","225414392":"Maximum likelihood Bayesian averaging of airflow models in unsaturated fractured tuff using Occam and variance windows","40848376":"Bayesian model averaging for evaluation of candidate gene effects","241101769":"Selection of Prior Weights for Weighted Model Averaging","222517979":"Decomposing posterior variance","263350826":"Aggregation of forecasts from multiple simulation models","288905376":"Comparison of Three Statistical Downscaling Methods and Ensemble Downscaling Method Based on Bayesian Model Averaging in Upper Hanjiang River Basin, China","254211775":"A nonparametric Bayesian method for estimating a response function","271942575":"New Uses of Statistics in Retail Banking","254211772":"Accurate approximations to the distribution of a statistic testing symmetry in contingency tables","222571743":"Constructing informative model priors using hierarchical methods","235372956":"Epidemiology of epilepsy in rural Benin: Prevalence, incidence, mortality, and follow-up","228310534":"Determinants of Foreign Direct Investment","237134781":"Bayesian model selection approaches to MIDAS re- gression","4725224":"Benchmark Priors for Bayesian Model Averaging","220286593":"Investigation about a screening step in model selection","229786131":"Editorial: Model selection and efficiency—is ‘Which model …?’ the right question?","225694418":"New Statistical models for long-range forecasting of southwest monsoon rainfall over India","46559589":"Forecast Accuracy and Economic Gains from Bayesian Model Averaging Using Time Varying Weights","46434656":"Evidence on a Real Business Cycle Model with Neutral and Investment-Specific Technology Shocks Using Bayesian Model Averaging","221304469":"Concerning Bayesian Motion Segmentation, Model, Averaging, Matching and the Trifocal Tensor.","242398683":"The practical utility of incorporating model selection uncertainty into prognostic models for survival data Short title: Incorporating model uncertainty into prognostic models","222536425":"Model Averaging in Risk Management with an Application to Futures Markets","228393008":"Forecasting product sales with dynamic linear mixture models","228725263":"Accounting for input-model and input-parameter uncertainties in simulation","263061534":"About the use of rank transformation in sensitivity analysis of model output. Reliab Eng Syst Saf 50: 225-239","238652808":"Bayesian Model Selection in Social Research","2771356":"Statistical Ideas for Selecting Network Architectures","221919884":"Modern Methods of Estimating Biodiversity from Presence-Absence Surveys","8649528":"Bayesian model averaging in EEG/MEG imaging","287810716":"MODEL UNCERTAINTY","51668136":"A new strategy for meta-analysis of continuous covariates in observational studies","227780654":"Comparing the performance of two indices for spatial model selection: application to two mortality data","2661783":"Bayesian Deviance, the Effective Number of Parameters, and the Comparison of Arbitrarily Complex Models","12337533":"When Should Epidemiologic Regressions Use Random Coefficients?","3933182":"Accounting for input model and parameter uncertainty in simulation","2267623":"Population Markov Chain Monte Carlo","227348040":"Comments on \"Forecasting economic and financial variables with global VARs\"","228597350":"The Practical Implementation of Bayesian Model Selection","222533765":"Framework for maintenance and replacement of a network structured system. Int J Prod Econ","229708918":"Model Uncertainty","23690926":"In search of an environmental Kuznets curve in sulphur dioxide concentrations: A Bayesian model averaging approach","239065590":"Input Distribution Selection for Simulation Experiments: Accounting for Input Uncertainty","252868827":"Hot deck imputation for the response model","27452521":"Uncertainty and RIVM\u0027s Environmental Outlooks: Documenting a learning process","40704416":"The practical utility of incorporating model selection uncertainty into prognostic models for survival data","227687007":"Markov Chain Monte Carlo Methods for Fitting Spatiotemporal Stochastic Models in Plant Epidemiology","238288355":"On Measuring and Correcting the Effects of Data Mining and Model Selection","228434508":"Non-linear regression modelling","227016794":"Determinants of foreign direct investment","24123555":"The Population of Finland in 2050 and Beyond","5051291":"Reexamining the consumption-wealth relationship: the role of model uncertainty","285779155":"Forest Management Planning for Maintaining the Viability of Wildlife Populations","229786217":"Model Averaging","234114071":"Does Data Splitting Improve Prediction?","252386031":"Model Uncertainty and Incomplete Data","226351257":"The dynamics of learning about a climate threshold","27248762":"Forecasting in Large Macroeconomic Panels using Bayesian Model Averaging","263557203":"On the overall sensitivity of the posterior distribution to its inputs","220204743":"Progress in Intelligent Data Analysis","230258257":"Bayesian Statistics in Quantitative Risk Assessment","31313973":"Estimating parameters in stochastic compartmental models using Markov Chain methods","227617914":"Extended Bayesian model averaging for heritability in twin studies","286260962":"ON THE COMPARISON OF BAYESIAN INFORMATION CRITERION AND DRAPER\u0027S INFORMATION CRITERION IN SELECTION OF AN ASYMMETRIC PRICE RELATIONSHIP: BOOTSTRAP SIMULATION RESULTS","228421747":"How to be a Bayesian in SAS: model selection uncertainty in PROC LOGISTIC and PROC GENMOD","50903782":"Bayesian estimation for percolation models of disease spread in plant populations","4746663":"Frequentist Model Average Estimators","254087882":"Conceptual Considerations regarding Endpoints, Hypotheses, and Analyses for Incomplete Longitudinal Clinical Trial Data","263533146":"A New Algorithm in Bayesian Model Averaging in Regression Models","232391210":"On the necessity of using imprecise probabilities for modelling environental systems","4791225":"Sensitivity Analysis of Continuous Incomplete Longitudinal Outcomes","228051047":"Simulation in Industrial Statistics","46530871":"Choice Among Hypotheses Using Estimation Criteria","288954061":"Prediction Intervals for Time-Series Forecasting","228368488":"Bayesian Assessment of the Distribution of Insurance Claim Counts Using Reversible Jump MCMC","228673621":"The Attenuation of Seismic Intensity in Italy, Part II: Modeling and Validation","225344152":"Using information theory as a substitute for stepwise regression in ecology and behavior. Behav Ecol Sociobiol","222397112":"The nature of sensitivity in missing not at random models","222885042":"Lolli, B. \u0026 Gasperini, P. Comparing different models of aftershock rate decay: the role of catalog incompleteness in the first times after main shock. Tectonophysics 423, 43-59","24065173":"Bayesian parametric inference in a nonparametric framework","3834305":"Steps to implement Bayesian input distribution selection","2737108":"Space-Time Modelling Without Distance","4111808":"Bayesian methods for discrete event simulation","228763228":"Selecting amongst large classes of models","225542798":"Negative learning"},"index":108}