{"abs":"McCullagh (1980) presented a comprehensive review of regression models for ordinal response variables. In these models, the functional relationship between the covariates and the response categories is dependent on the link function. This paper shows that discrimination between links is feasible when the response variable is ordinal. Using the log-gamma distribution of Prentice (1974), a generalized link function is constructed which allows discrimination between the probit, log-log, and complementary log-log links. Sample-size considerations are noted, and examples are presented.On peut trouver dans McCullagh (1980) une synthèse consciencieuse des modèles de régression conçus pour ľanalyse de variables catégoriques de type ordinal. Dans de tels modèles, la relation fonctionnelle qui existe entre les variables dépendantes et indépendantes s\u0027exprime par la “fonction de lien”. Dans le présent article, nous visons à illustrer comment on peut opérer une distinction entre différents genres de liens lorsque la variable dépendante est ordinale. Pour ce faire, nous construisons une fonction de lien généralisée à ľaide de la loi log-gamma de Prentice (1974). Cette nouvelle fonction de lien permet alors de distinguer entre les liens probit, log-log et log-log complémentaire. Nous insistons en outre sur ľimportance de tenir compte de la taille échantionnalle et nous présentons des exemples.","title":"Goodness‐of‐link testing in ordinal regression models","id":227764760,"url":"https://www.researchgate.net/publication/227764760_Goodness-of-link_testing_in_ordinal_regression_models","names":["Frederic C. Genter","Vernon T. Farewell","Canadian Journal of Statistics"],"references":{"227907701":"The Calculation of the Dosage-Mortality Curve,\u0027\u0027","31409081":"“A Log–Gamma Model and Its Maximum Likelihood Estimation.”","239665490":"Goodness of Link Tets for Generalized Linear Models","22146202":"A Generalization of the Probit and Logit Methods for Dose Response Curves","31102580":"On Two Families of Transformations to Additivity for Binary Response Data","230872748":"Test of Separate Families of Hypothesis"},"citedIn":{"215785181":"The Research Performance of UK Universities: A Statistical Analysis of the Results of the 1989 Research Selectivity Exercise","233223748":"Discrimination between the complementary log-log And logistic model for ordinal data","12826180":"Agresti A. Modelling ordered categorical data: recent advances and future challenges. Stat Med 18: 2191-2207","24065127":"The Analysis of Ordered Categorical Data: An Overview and a Survey of Recent Developments","271931165":"Robust Designs in Generalized Linear Models: A Quantile Dispersion Graphs Approach","4893891":"Bayesian ordinal and binary regression models with a parametric family of mixture links","49185829":"Proportional Odds Models with High-Dimensional Data Structure","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","290492099":"Multilevel random effect and marginal models for longitudinal data","233315006":"Estimation efficiency in lifetime regression models when responses are censored or grouped","2836146":"Pearson\u0027s Goodness of Fit Statistic as a Score Test Statistic","233786292":"On generalized multinomial models and joint percentile estimation","19357594":"Proportional Hazards Models for Current Status Data: Application to the Study of Differentials in Age at Weaning in Pakistan"},"index":110}