{"abs":"In this paper, we present a general formulation of an algorithm, the adaptive independent chain (AIC), that was introduced in a special context in Gåsemyr et al. [Methodol. Comput. Appl. Probab. 3 (2001)]. The algorithm aims at producing samples from a specific target distribution Π, and is an adaptive, non-Markovian version of the Metropolis–Hastings independent chain. A certain parametric class of possible proposal distributions is fixed, and the parameters of the proposal distribution are updated periodically on the basis of the recent history of the chain, thereby obtaining proposals that get ever closer to Π. We show that under certain conditions, the algorithm produces an exact sample from Π in a finite number of iterations, and hence that it converges to Π. We also present another adaptive algorithm, the componentwise adaptive independent chain (CAIC), which may be an alternative in particular in high dimensions. The CAIC may be regarded as an adaptive approximation to the Gibbs sampler updating parametric approximations to the conditionals of Π.","title":"On an adaptive version of the Metropolis-Hastings algorithm with independent proposal distribution","id":4788962,"url":"https://www.researchgate.net/publication/4788962_On_an_adaptive_version_of_the_Metropolis-Hastings_algorithm_with_independent_proposal_distribution","names":["JØRUND GÅSEMYR","Scandinavian Journal of Statistics"],"references":{"38357609":"Markov Chains for Exploring Posterior Distributions","241722073":"Bayesian Inference of Survival Probabilities, Under Stochastic Ordering Constraints","38322172":"Self regenerative Markov chain Monte Carlo with adaption","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","237131317":"On an adaptive version of the Metropolis-Hastings with independent proposal distribution","2430895":"Metropolized Independent Sampling with Comparisons to Rejection Sampling and Importance Sampling","226809823":"A Comparison of Two Sequential Metropolis-Hastings Algorithms with Standard Simulation Techniques in Bayesian Inference in Reliability Models Involving a Generalized Gamma Distribution","38322292":"An Adaptive Metropolis Algorithm","220345500":"Exact sampling with couple Markov chains and applications to statistical mechanics","2657367":"Adaptive Chains"},"citedIn":{"227369231":"Learn From Thy Neighbor: Parallel-Chain and Regional Adaptive MCMC","231073088":"An adaptive Metropolis-Hastings scheme: Sampling and optimization","241756333":"Parallel hierarchical sampling: A general-purpose interacting Markov chains Monte Carlo algorithm","228859874":"How to compare MCMC simulation strategies?","228716583":"Selection of a Metropolis-Hastings simulation strategy via an entropy convergence criterion","49458431":"A tutorial on adaptive MCMC","2131950":"On the ergodic properties of some adaptive MCMC algorithms","228337292":"Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection","265156376":"Bayesian inference for copula models","226809823":"A Comparison of Two Sequential Metropolis-Hastings Algorithms with Standard Simulation Techniques in Bayesian Inference in Reliability Models Involving a Generalized Gamma Distribution","228573826":"On Adaptive Metropolis-Hastings Methods","221749992":"A Bayesian Semiparametric Temporally-Stratified Proportional Hazards Model with Spatial Frailties","43500657":"Adaptive independence samplers","2127878":"Selection of a MCMC simulation strategy via an entropy convergence criterion","282450931":"Inferring the route-use patterns of metro passengers based only on travel-time data within a Bayesian framework using a reversible-jump Markov chain Monte Carlo (MCMC) simulation","257419070":"A general algorithm scheme mixing computational intelligence with Bayesian simulation","23523980":"Adaptive Proposal Construction for Reversible Jump MCMC","4899620":"Adaptive MCMC methods for inference on affine stochastic volatility models with jumps","242469404":"Ergodicity of Adaptive MCMC and its Applications","24148035":"Adaptive independent Metropolis--Hastings","45903114":"A copula based approach to adaptive sampling","1906602":"Adaptive Independent Metropolis-Hastings by Fast Estimation of Mixtures of Normals","225195472":"An Application of Adaptive Independent Chain Metropolis–Hastings Algorithms in Bayesian Hazard Rate Estimation","4924663":"Universality of Bayesian Predictions Rejoinder","280946496":"An adaptive independence sampler MCMC algorithm for infinite-dimensional bayesian inference"},"index":125}