{"abs":"This paper describes and compares various hierarchical mixture prior formulations of variable selection uncertainty in normal linear regression models. These include the authors’ nonconjugate SSVS formulation [J. Am. Statist. Assoc. 88, 881-889 (1993)], as well as conjugate formulations which allow for analytical simplification. Hyperparameter settings which base selection on practical significance, and the implications of using mixtures with point priors are discussed. Computational methods for posterior evaluation and exploration are considered. Rapid updating methods are seen to provide feasible methods for exhaustive evaluation using Gray code sequencing in moderately sized problems, and fast Markov chain Monte Carlo exploration in large problems. Estimation of normalization constants is seen to provide improved posterior estimates of individual model probabilities and the total visited probability. Various procedures are illustrated on simulated sample problems and on a real problem concerning the construction of financial index tracking portfolios.","title":"Approaches for Bayesian Variable Selection","id":224881809,"url":"https://www.researchgate.net/publication/224881809_Approaches_for_Bayesian_Variable_Selection","names":["Edward I. George","Robert E Mcculloch","Statistica Sinica"],"references":{"236901854":"Understanding the Metropolis-Hastings Algorithm","243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","237131111":"Nonparametric regression using Bayesian variable selection","23741295":"Variable Selection in Regression Models","268309687":"Stochastic search variable selection","2469295":"Prediction Via Orthogonalized Model Mixing","246342370":"Gray codes for randomisation procedures","229078314":"Bayesian Variable Section oin linear regression (with discussion)","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","239931544":"Numerial Recipies in C++: The Art of Scientific Computing","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","238655585":"Bayesian Variable Selection in Linear Regression","31471864":"Miscellanea. Peskun\u0027s theorem and a modified discrete-state Gibbs sampler","265360523":"Variable Selection for Regression Models.","238722144":"Elements of Statistical Computing","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","2351555":"Variable Selection and Model Comparison in Regresssion","254287497":"The Bayesian Modeling of Covariates for Population Pharmacokinetic Models","227087466":"Gray codes for randomization procedures","38357612":"Discussion: Markov Chains for Exploring Posterior Distributions","244419636":"Bayesian model comparison via jump diffusion","268841379":"Outliers and influential observations in linear models","2867469":"Bayesian Graphical Models for Discrete Data","222485349":"A Method for Simultaneous Variable Selection and Outlier Identification in Linear Regression;","221936093":"Time Series: Theory and Methods","13543719":"Protein construct storage: Bayesian variable selection and prediction with mixtures.","268664872":"Predictive Inference: An Introduction","2299598":"Model Selection and Accounting for Model Uncertainty in Linear Regression Models","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","271512988":"Markov Chains for exploring posterior distributions (with discussion)","2813202":"Bayesian Variable Selection with Related Predictors","238727682":"Variable Selection Via Gibbs Sampling","2622481":"Accounting for Model Uncertainty in Survival Analysis Improves Predictive Performance","222306169":"Nonparametric Regression using Bayesian Variable Selection","213881156":"Linpack Users Guide","2352607":"Evaluating the Accuracy of Sampling-Based Approaches to the Calculation of Posterior Moments"},"citedIn":{"241817192":"BAYESIAN ORDER RESTRICTED METHODS WITH BIOMEDICAL APPLICATIONS","235355650":"Bayesian adaptive LASSO quantile regression","273685591":"A Bayesian Approach for the Identification of Genes and Gene-level SNP Aggregates in a Genetic Analysis of Cancer Data","250003183":"Joint analysis of occurrence and time to stability after entrance into the Italian labour market: an approach based on a Bayesian cure model with structured stochastic search variable selection","237009450":"Bayesian Models for Integrative Genomics","262088596":"Finite population estimators in stochastic search variable selection","7732347":"Imputation and Variable Selection in Linear Regression Models with Missing Covariates","222647633":"Chapter 10 Forecasting with Many Predictors","265480135":"Fishing Economic Growth Determinants Using Bayesian Elastic Nets","235621918":"Polygenic Modeling with Bayesian Sparse Linear Mixed Models","228796853":"Automatic Bayesian model averaging for linear regression and applications in Bayesian curve fitting","24403285":"A hierarchical Bayesian model for comparing transcriptomes at the individual transcript isoform level","235359779":"Bayesian Ultrahigh-Dimensional Screening Via MCMC","34954801":"Feature selection in DNA microarray analysis [microform] /","227369384":"Rao-Blackwellization for Bayesian Variable Selection and Model Averaging in Linear and Binary Regression: A Novel Data Augmentation Approach","254297856":"Bayesian principal component regression with data-driven component selection","228867471":"Bayesian computation and the linear model","48200433":"A study of variable selection using -prior distribution with ridge parameter","264958949":"Regression: Models, Methods and Applications","270595094":"Robust Determinants of Growth in Asian Developing Economies: A Bayesian Panel Data Model Averaging Approach","3320837":"Gradient Pursuits","38058622":"Bayesian Model Selection for Characterizing Genomic Imprinting Effects and Patterns","1959974":"MDL denoising revisited","23996757":"Modeling disease-state transition heterogeneity through Bayesian variable selection","7605321":"Estimation of the false negative fraction of a diagnostic kit through Bayesian regression model averaging","220320097":"Bayesian Generalized Kernel Models.","251626175":"9319 POSTER A Regional Review of Outcomes of Systemic Therapy in Patients With Metastatic Malignant Melanoma","8427713":"A Bayesian Hierarchical Model for Categorical Data with Nonignorable Nonresponse","2498660":"Regression with Multiple Candidate Models: Selecting or","5144587":"Model Selection Using Information Criteria and Genetic Algorithms","215761044":"Free-Living Marine Nematodes as Bioindicators: Past, Present and Future Perspectives","51934032":"Generalized Direct Sampling for Hierarchical Bayesian Models","46464648":"Parallel hierarchical sampling:a general-purpose class of multiple-chains MCMC algorithms","237107822":"MODELS FOR HETEROGENEOUS VARIABLE SELECTION DISSERTATION Presented in Partial Fulfillment of the Requirements for The Degree Doctor of Philosophy in the Graduate School of The Ohio State University","46547606":"Predicting EU Energy Industry Excess Returns on EU Market Index via a Constrained Genetic Algorithm","251626158":"9243 POSTER Psychosocial Effect and Evaluation of the Health-related Quality of Life in Patients With Non-Hodgkin Lymphoma","268525648":"Functional clustering in nested designs: Modeling variability in reproductive epidemiology studies","30011802":"Monitoring and diagnosis of process faults and sensor faults in manufacturing processes","270585972":"Individual adaptation: an adaptive MCMC scheme for variable selection problems","257135366":"Best Basis Selection Method Using Learning Weights for Face Recognition","262331380":"An approach for identifying and predicting economic recessions in real-time using time–frequency functional models","3343466":"Sparse linear regression in unions of bases via Bayesian variable selection","224529721":"Stagewise Weak Gradient Pursuits","23742775":"Bayesian Modelling of Catch in a Northwest Atlantic Fishery","38326824":"Bayesian Model Averaging: A Tutorial","251795305":"GIBBS SAMPLING APPROACH TO VARIABLE SELECTION IN LINEAR REGRESSION WITH OUTLIER VALUES","281858211":"Fundamental shock selection in DSGE models","7802887":"Bayesian Model Selection and Averaging in Additive and Proportional Hazards Models","221432128":"Automated Modelling in Empirical Social Sciences Using a Genetic Algorithm.","241074731":"Several Types of Contraceptives Safe in Lupus","266918813":"Foreign Exchange Rate Forecasting with Artificial Neural Networks","26883565":"Bayesian Variable Selection for Multivariate Spatially Varying Coefficient Regression","243103236":"Bayesian Variable Selection for Logistic Models Using Auxiliary Mixture Sampling","274012204":"Bayesian Variable Selection for Linear Regression with the $\\kappa$-$G$ Priors","220055964":"Model selection in binary and tobit quantile regression using the Gibbs sampler","45857336":"Variable selection in high-dimensional linear models: partially faithful\ndistributions and the PC-simple algorithm","265851740":"A Bayesian Integrative Model for Genetical Genomics with Spatially Informed Variable Selection","258232291":"Adaptive-modal Bayesian nonparametric regression","233198945":"Elastic Net Regression Modeling With the Orthant Normal Prior","37253809":"Variable selection: empirical Bayes vs. fully Bayes","221901237":"Bayesian Nonparametric Shrinkage Applied to Cepheid Star Oscillations","229238054":"Bayesian Methods for DNA Microarray Data Analysis","224947707":"Integrating biological knowledge into variable selection: an empirical Bayes approach with an application in cancer biology","224218569":"Kalman filtering for compressed sensing","23634431":"Law of iterated logarithm and consistent model selection criterion in logistic regression","44652094":"Nonparametric Bayes Shrinkage for Assessing Exposures to Mixtures Subject to Limits of Detection","271710377":"Last Night a Shrinkage Saved My Life: Economic Growth, Model Uncertainty and Correlated Regressors","253605766":"Focused sampling and its application to nonparametric and robust regression","45897255":"Convex Feasibility Methods for Compressed Sensing","39424709":"Modelos multivariantes para variables ordinales: Aplicaciones en estudios de calidad de servicio","254425013":"Model Uncertainty in Characterizing Recreation Demand","227369261":"Bayesian Variable Selection in Structured High-Dimensional Covariate Spaces With Applications in Genomics","266474306":"BAYESIAN AND SEMI-BAYESIAN REGRESSION APPLIED TO MANUFACTURING WOODEN PRODUCTS","46444133":"Can Disaggregated Indicators Identify Governance Reform Priorities?","4993256":"Bayes model averaging with selection of regressors. J R Stat Soc B","254438287":"Bayesian Model Averaging in the Instrumental Variable Regression Model","223976944":"Supervised Bayesian latent class models for high-dimensional data","235357868":"A Bayesian Nonparametric Meta-Analysis Model","228299056":"Bayesian Analysis of Coefficient Instability in Dynamic Regressions","47713907":"COMPARISON OF SPARSE CODING AND JPEG CODING SCHEMES FOR BLURRED RETINAL IMAGES.","228970766":"Darwinian Evolution in Parallel Universes: A Parallel Genetic Algorithm for Variable Selection","227369250":"Nonparametric Bayes Conditional Distribution Modeling With Variable Selection","38012660":"Predicting residential indoor concentrations of nitrogen dioxide, fine particulate matter, and elemental carbon using questionnaire and geographic information system based data","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","222564848":"Modeling uncertainty in macroeconomic growth determinants using Gaussian graphical models","237065877":"Model Based Segmentation Featuring Simultaneous Segment Level Variable Selection","236455587":"Supervised Heterogeneous Multiview Learning for Joint Association Study and Disease Diagnosis","247837304":"Models for Heterogeneous Variable Selection","51957671":"Incorporating biological information into linear models: A Bayesian approach to the selection of pathways and genes","227618132":"A variable selection approach to monotonic regression with Bernstein polynomials","251529787":"Joint multiple adaptive wavelet regression ensembles","228651369":"Bayesian robust transformation and variable selection: A unified approach","239808128":"High-Dimensional Bayesian Clustering with Variable Selection: The R Package bclus","236038874":"Consistent High-Dimensional Bayesian Variable Selection via Penalized Credible Regions","249882153":"YOUR MEMBERS ARE ALSO YOUR CUSTOMERS: MARKETING FOR INTERNET SOCIAL NETWORKS","50304558":"Methods for Identifying SNP Interactions: A Review on Variations of Logic Regression, Random Forest and Bayesian Logistic Regression","251549224":"Bayesian Regularization and Smoothing Priors for Survival Data","227704136":"Wavelet thresholding for some classes of non–Gaussian noise","6886580":"Morphological correlates to cognitive dysfunction in schizophrenia as studied with Bayesian regression","242519722":"Bayesian Neural Networks and Variable Selection","220322243":"Bayesian Compressive Sensing","2814157":"A Bayesian Variable-Selection Approach for Analyzing Designed Experiments With Complex Aliasing","251760617":"Model weights for model choice and averaging","220699086":"Expectation Propagation for Bayesian Multi-task Feature Selection","51231742":"An Efficient Stochastic Search for Bayesian Variable Selection with High-Dimensional Correlated Predictors","8111240":"Bayesian latent variable models for mixed discrete outcomes","46179891":"A Spatial Dirichlet Process Mixture Model for Clustering Population Genetics Data","228305256":"Hierarchical Shrinkage in Time-Varying Parameter Models","238508738":"BAYESIAN ADDITIVE REGRESSION KERNELS","242074266":"Statistical Principles in Image Modeling","5139641":"Model Uncertainty in Cross-Country Growth Regressions","227716456":"Groupwise Constrained Reconstruction for Subspace Clustering","279166046":"Posterior Model Consistency in Variable Selection as the Model Dimension Grows","224881763":"Bayesian Constrained Variable Selection","254212643":"A Stochastic Partitioning Method to Associate High-dimensional Responses and Covariates Rejoinder","251660806":"Recent Advances in the Statistical Analysis of Count and Survival","276126076":"Inferring causal impact using Bayesian structural time-series models","242126689":"Analysis of Association Studies: Candidate Regions and Quantitative Traits","257486423":"Bayesian variable selection for correlated covariates via colored cliques","259111520":"Hierarchical Adaptive Regression Kernels for Regression With Functional Predictors","7154040":"Longitudinal variable selection by cross-validation in the case of many covariates","257586756":"Can specific policy indicators identify reform priorities?","2504967":"Bayesian Variable Selection Using the Gibbs Sampler","233400525":"Prediction Based on Mean Subset","260716207":"Adaptive Bayesian density regression for high-dimensional data","245286843":"Probabilistic Models for Modulus of Elasticity of Self-Consolidated Concrete: Bayesian Approach","257392240":"Analysis of computationally demanding models with continuous and categorical inputs","4993382":"Bayesian modeling of catch in a northwest Atlantic fishery","38068072":"Bayesian variable selection using an adaptive powered correlation prior","272397587":"Bayesian Variable Selection and Estimation for Group Lasso","242603866":"BAYESIAN NONPARAMETRIC MODELING USING L EVY PROCESS PRIORS WITH APPLICATIONS FOR FUNCTION ESTIMATION, TIME SERIES MODELING AND SPATIO-TEMPORAL MODELING","23528533":"Identifying the Predictors for Financial Crisis Using Gibbs Sampler","224881749":"The choice of variables in multivariate regression : A non-conjugate Bayesian decision theory approach","228031650":"Bayesian Methods for Microarray Data","238548750":"Bayesian Model Selection for Genome-Wide Epistatic QTL Analysis","228621467":"Bayesian adaptive lassos with non-convex penalization","228617371":"Markov Chain Monte Carlo With Mixtures of Mutually Singular Distributions","255622657":"Approximate Predictive Densities and Fully Bayes Variable Selection in Generalized Linear Models","47868903":"Multinomial Inverse Regression for Text Analysis","51963430":"Convergent Expectation Propagation in Linear Models with Spike-and-slab\nPriors","5207408":"Adaptive sampling for Bayesian variable selection","242742071":"SPARSITY MODELING FOR HIGH DIMENSIONAL SYSTEMS: APPLICATIONS IN GENOMICS AND STRUCTURAL BIOLOGY","44709867":"Sélection bayésienne de variables pour les modèles d\u0027état dans le cadre de reconstructions climatiques","24052776":"Detecting stage-wise outliers in hierarchical Bayesian linear models of repeated measures data","51427904":"Simultaneous Analysis of All SNPs in Genome-Wide and Re-Sequencing Association Studies","233795774":"Bayesian variable selection for logistic mixed model with nonparametric random effects","250184638":"Bayesian Methods for Assessing Ordering in Hazard Functions","40754996":"Fast high-dimensional Bayesian classification and clustering","258228798":"Sparse latent factor models with interactions: Analysis of gene expression data","246251505":"From Information Scaling of Natural Images to Regimes of Statistical Models","4993299":"Bayesian variable selection and regularization for time-frequency surface estimation","239786796":"Dilution priors: Compensating for model space redundancy","278316538":"Stochastic Search for Price Insensitive Consumers","12089800":"Bayesian analyses of data using Markov regression models","254904897":"Bayesian model selection with applications in social science","265104059":"Bayesian recursive variable selection","4745534":"Predicting Resource Policy Outcomes via Meta-Regression: Data Space, Model Space, and the Quest for \u0027Optimal Scope\u0027","259138052":"Design of inferential sensors in the process industry: A review of Bayesian methods","251520901":"Bayesian model selection for logistic regression models with random intercept","228660442":"Alternative prior distributions for variable selection with very many more variables than observations","257705511":"Classification of brain activation via spatial Bayesian variable selection in fMRI regression","264816307":"Predicting the Present with Bayesian Structural Time Series","272084299":"Using Bayesian modelling to investigate factors governing antibiotic-induced Candida albicans colonization of the GI tract","226611200":"Feature Selection in Microarray Analysis","5207499":"Variable selection in clustering via Dirichlet process mixture models","221869246":"Analysis of human mini-exome sequencing data using a Bayesian hierarchical mixture model: Genetic Analysis Workshop 17","46497613":"Mixed frequency models: Bayesian approaches to estimation and prediction","230672438":"Bayesian inference on dependence in multivariate longitudinal data","242493438":"Sparse Variational Analysis of Large Longitudinal Data Sets","2469295":"Prediction Via Orthogonalized Model Mixing","251847305":"Bayesian Variable Selection in Logit Models and Hierarchical Bayes Models","266307153":"A simulation study for some biased estimation methods","24079615":"Forecast Combination and Model Averaging Using Predictive Measures","231583833":"Assessing Brain Activity through Spatial Bayesian Variable Selection","228592696":"Bayesian Variable Selection and Estimation of Risk Premiums in the APT model","257194700":"Convex feasibility modeling and projection methods for sparse signal recovery","263556654":"A Comparison of Bayesian Mixed Data Models for Austrian SILC data","237134781":"Bayesian model selection approaches to MIDAS re- gression","4725224":"Benchmark Priors for Bayesian Model Averaging","260643369":"Bayesian hierarchical structured variable selection methods with application to MIP studies in breast cancer","26856507":"Variable Selection in Bayesian Smoothing Spline ANOVA Models: Application to Deterministic Computer Codes","225547475":"Bayesian model averaging and model selection: Two sides of the same coin when identifying the determinants of trade union density?","2134403":"Sure Independence Screening for Ultra-High Dimensional Feature Space","26717236":"Log-Linear Models for Gene Association","23694543":"Meta-Regression and Benefit Transfer: Data Space, Model Space, and the Quest for ‘Optimal Scope’","223171818":"Bayesian stochastic search for VAR model restrictions","23301323":"Bayesian variable selection for the Cox regression model with missing covariates","45648657":"High-Dimensional Variable Selection in Meta-Analysis for Censored Data","279068939":"Bayesian Nonparametric Modeling of Higher Order Markov Chains","51930802":"Bayes Variable Selection in Semiparametric Linear Models","230865006":"A Multinomial Ordinal Probit Model with Singular Value Decomposition Method for a Multinomial Trait","268412494":"Bayesian Model Averaging and Variable Selection in Multivariate Ecological Models","268895667":"Time series forecasting with multiple candidate models: selecting or combining?","266322537":"Variable selection in Bayesian generalized linear-mixed models: An illustration using candidate gene case-control association studies","2469266":"Bayesian Model Averaging and Model Search Strategies","251729597":"Bayesian Modeling in the Wavelet Domain","254401175":"Adaptive Monte Carlo on Multivariate Binary Sampling Spaces","220228766":"A Bayesian Lasso via reversible-jump MCMC","221620469":"Posterior Consistency of the Silverman g-prior in Bayesian Model Choice","5096844":"Computational Efficiency in Bayesian Model and Variable Selection","223261836":"Bayesian variable selection for binary response models and direct marketing forecasting","5096841":"An Embarrassment of Riches: Forecasting Using Large Panels","229708918":"Model Uncertainty","250823487":"References and Bibliography for the Tutorial on MCMC Bayesian Model and Variable Selection","257796752":"Bayesian regression model for seasonal forecast of precipitation over Korea","2354678":"Wavelet-Based Nonparametric Bayes Methods","45932394":"Parametric families on large binary spaces","45916011":"A majorization-minimization approach to variable selection using spike\nand slab priors","263107184":"The Problem of Sparse Image Coding","265773622":"Bayesian variable selection in linear regression and a comparison","12351837":"Sterility due to inhibition of sperm motility by oral administration of benzene chromatographic fraction of the chloroform extract of the seeds of Carica papaya in rats","27248762":"Forecasting in Large Macroeconomic Panels using Bayesian Model Averaging","254329550":"A default Bayesian hypothesis test for ANOVA designs","254297806":"Joint analysis of occurrence and time to stability after entrance into the Italian labour market: an approach based on a Bayesian cure model with structured stochastic search variable selection","236150772":"A censored random coefficients model for the detection of zero willingness to pay","30864446":"Variable Selection for Decision Making.","13543719":"Protein construct storage: Bayesian variable selection and prediction with mixtures.","7460250":"McQSAR: A Multiconformational Quantitative Structure−Activity Relationship Engine Driven by Genetic Algorithms","45527897":"Finding good predictors for inflation by shotgun stochastic search","222612660":"Jointness in Bayesian variable selection with applications to growth regression","277334390":"A Moreau-Yosida approximation scheme for high-dimensional posterior and quasi-posterior distributions","7371141":"Bayesian Inferences on Umbrella Orderings","226335880":"Comparison of Bayesian objective procedures for variable selection in linear regression","266045997":"Contributions to Batch Mode Reinforcement Learning","1770988":"Bayesian variable selection for high dimensional generalized linear models: Convergence rates of the fitted densities","51511570":"Sparse Variational Analysis of Linear Mixed Models for Large Data Sets.","2468385":"Matlab codes BVSGS I, BVSGS G and BVSGS GI","48376039":"Assessing the Transmission of Monetary Policy Using Time-varying Parameter Dynamic Factor Models","2311716":"The Variable Selection Problem","227596184":"A New Heterogeneous Multidimensional Unfolding Procedure","241406058":"Variable Selection in High-dimensional Models with Applications in Marketing","41464951":"Joint Variable Selection for Fixed and Random Effects in Linear Mixed-Effects Models","228652982":"Spike and slab prior distributions for simultaneous Bayesian hypothesis testing, model selection, and prediction, of nonlinear outcomes","2782781":"Deterministic/Stochastic Wavelet Decomposition for Recovery of Signal From Noisy Data","228347781":"Bayesian Adaptive Sampling for Variable Selection and Model Averaging","2814475":"Regression with Multiple Candidate Models: Selecting or Mixing?","7997022":"Bayesian Inferences on Predictors of Conception Probabilities","8373851":"Bayesian Variable Selection in Multinomial Probit Models to Identify Molecular Signatures of Disease Stage","228289471":"Variable Selection and Functional Form Uncertainty in Cross-Country Growth Regressions","267690448":"Spatial Bayesian Variable Selection Models on Functional Magnetic Resonance Imaging Time-Series Data","225133390":"Bayesian regularisation in structured additive regression: A unifying perspective on shrinkage, smoothing and predictor selection","220286724":"Bayesian parsimonious covariance estimation for hierarchical linear mixed models. Statistics and Computing, 18, 1-13","45891718":"MAP model selection in Gaussian regression","228911001":"Bayesian Variable Selection in Regression with Networked Predictors","223617898":"Network-based sparse Bayesian classification. Pattern Recognit","3320438":"Monte Carlo Methods for Adaptive Sparse Approximations of Time-Series","26277845":"A Bayesian Hierarchical Model for Classification with Selection of Functional Predictors","222540548":"Sparse Bayesian hierarchical modeling of high-dimensional clustering problems","45901045":"Evolutionary Stochastic Search for Bayesian model exploration","28056551":"Selección de variables en el modelo de azar proporcional: Una aplicación al Mercado Laboral","228507605":"Bayesian Analysis of Latent Threshold Dynamic Models","46494856":"Stochastic model specification search for Gaussian and partial non-Gaussian state space models","254331258":"A Bayesian Approach for Interpreting Mean Shifts in Multivariate Quality Control","5151259":"Measuring the impact of R\u0026D on Productivity from a Econometric Time Series Perspective","260995542":"A Spatio-Temporal Nonparametric Bayesian Variable Selection Model of fMRI Data for Clustering Correlated Time Courses.","221665135":"A Level-Set Hit-and-Run Sampler for Quasi-Concave Distributions","223919874":"Expectation Propagation for microarray data classification","5859845":"Yi N, Shriner D. Advances in Bayesian multiple quantitative trait loci mapping in experimental crosses. Heredity 100: 240-252","225782548":"Posterior simulation across nonparametric models for functional clustering","260132320":"Bayesian Methods for High Dimensional Linear Models","242045960":"Specifying Spike and Slab Prior Distributions for Bayesian Hypothesis Testing of Nonlinear Models","228562936":"Bayesian Variable Selection for Random Intercept Modeling of Gaussian and Non‐Gaussian Data","221847377":"Bayesian mapping of genome-wide epistatic imprinted loci for quantitative traits","4746789":"Methods and Criteria for Model Selection","265483708":"Orthogonal Data Augmentation for Bayesian Model Averaging","228667343":"An MCMC model search algorithm for regression problems","255959352":"Spiked Dirichlet Process Priors for Gaussian Process Models","225241873":"Kohn R, Smith M, Chan D. Nonparametric regression using linear combinations of basis functions. Stat Comput 11: 313-322","237458599":"BAYESIAN VARIABLE SELECTION IN LINEAR REGRESSION AND A COMPARISON","237093027":"Joint network and node selection for pathway-based genomic data analysis","26286868":"Dobra, A.: Variable selection and dependency networks for genomewide data. Biostatistics 10, 621-639","1924762":"Orthogonalized smoothing for rescaled spike and slab models","263288123":"Enriched Stick-Breaking Processes for Functional Data","235442310":"A Bayesian Hierarchical Model With Spatial Variable Selection: The Effect of Weather on Insurance Claims","2692794":"Aspects of Bayesian Model Choice","239560914":"Special Issue on Bayesian Function Estimation","2372273":"Bayesian Variable Selection and the Swendsen-Wang Algorithm","5233370":"Bayesian Variable and Model Selection Methods for Genetic Association Studies","51384711":"Fixed and Random Effects Selection in Linear and Logistic Models","233192319":"Stochastic Search Variable Selection for Log-linear Models","48194627":"Bayesian Variable Selection for Probit Mixed Models Applied to Gene\nSelection","268794520":"Negotiating Multicollinearity with Spike-and-Slab Priors","267796821":"Bayesian prior distributions for the analysis of screening experiments","48375878":"Bayesian Stochastic Model Specification Search for Seasonal and Calendar Effects","228348730":"Stagewise weak gradient pursuits. Part II: Theoretical properties","228810505":"Advanced Surrogate Models for Multidisciplinary Design Optimization","224633807":"Bayesian noisy ICA for source switching environments","51643833":"Identification of Significant Genes in Genomics Using Bayesian Variable Selection Methods","5800693":"Model selection and Bayesian methods in statistical genetics: Summary of Group 11 contributions to Genetic Analysis Workshop 15","222701547":"Bayesian forecasting using stochastic search variable selection in a VAR subject to breaks","49796186":"Bayesian Variable Selection via Particle Stochastic Search","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","223224826":"Bayesian wavelet denoising and evolutionary calibration","258834905":"Tobit Quantile Regression with the adaptive Lasso penalty","224007149":"Variable selection for dynamic treatment regimes: A reinforcement learning approach","257196515":"Optimal treatments in cost-effectiveness analysis in the presence of covariates: Improving patient subgroup definition","5162740":"Forecasting in Large Macroeconomic Panels Using Bayesian Model Averaging","234412867":"Bayesian Conditional Tensor Factorizations for High-Dimensional\nClassification","23176096":"Bayesian hierarchically weighted finite mixture models for samples of distributions","46819339":"Geoadditive Latent Variable Modeling of Count Data on Multiple Sexual Partnering in Nigeria","241756333":"Parallel hierarchical sampling: A general-purpose interacting Markov chains Monte Carlo algorithm","24052649":"Partition-Weighted Monte Carlo Estimation","257310096":"Variable Selection for Nonparametric Gaussian Process Priors: Models and Computational Strategies","2896615":"Model uncertainty. Stat Sci","26822484":"Modeling Complex Phenotypes: Generalized Linear Models Using Spectrogram Predictors of Animal Communication Signals","226422705":"Model selection in regression under structural constraints","260117847":"Learning Phenotype Densities Conditional on Many Interacting Predictors","264899869":"Sandwich algorithms for Bayesian variable selection","41765028":"Forecasting in vector autoregressions with many predictors","2524924":"Accounting for Model Uncertainty in Prediction of Chlorophyll a in Lake Okeechobee","271908590":"The Network Origins of Economic Growth","272119523":"Model selection in finite mixture of regression models: a Bayesian approach with innovative weighted g priors and reversible jump Markov chain Monte Carlo implementation","26714953":"Spatial–temporal association between fine particulate matter and daily mortality","273523373":"A Bayesian Model for the Identification of Differentially Expressed Genes in Daphnia Magna Exposed to Munition Pollutants","228714307":"Stagewise weak gradient pursuits part i: Fundamentals and numerical studies","267844884":"A Multi-objective Procedure for Efficient Regression Modeling","267080969":"Screening. Methods for experimentation in industry, drug dicovery, and genetics","263194962":"The effect of late onset, short‐term caloric restriction on the core temperature and physical activity in mice","234142480":"Bayesian nonparametric centered random effects models with variable selection","242404504":"Advances and applications in perfect sampling","2713283":"Prediction Using Orthogonalized Model Mixing","223936435":"153 O - In vitro electromotive administration of mitomycin C in human bladder wall","261536103":"Modeling the dynamics of social networks using Bayesian hierarchical blockmodels","227647332":"Polynomial nonlinear spatio‐temporal integro‐difference equation models","26902369":"Bayesian variable selection in clustering via dirichlet process mixture models","225045394":"A Bayesian Mixture of Lasso Regressions with t-Errors","259399798":"Modern Statistical Methods in Oceanography: A Hierarchical Perspective","4991821":"Returns to Schooling and Bayesian Model Averaging: A Union of Two Literatures","235736325":"Multivariate Analysis in the Climate Change Studies and Water Quality of Lake Pátzcuaro (Mexico)","236736788":"Stability Selection","265468122":"Social desire paths: a new theoretical concept to increase the usability of social science research in society","2120494":"Rodeo: Sparse Nonparametric Regression in High Dimensions","279068589":"Scalable Approximations of Marginal Posteriors in Variable Selection","228337292":"Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection","47342016":"Regularization in Regression: Comparing Bayesian and Frequentist Methods in a Poorly Informative Situation","247769554":"Power-Expected-Posterior Priors for Variable Selection in Gaussian Linear Models","4741972":"Bayesian Variable Selection in Clustering High-Dimensional Data","26899129":"Wavelet methods and statistical applications: network security and bioinformatics","220056126":"Bayesian variable selection and model averaging in the arbitrage pricing theory model","46494176":"Bayesian estimation of random effects models for multivariate responses of mixed data","4986749":"Smith M, Kohn R. Parsimonious covariance matrix estimation for longitudinal data. J Am Stat Assoc 97: 1141-1153","261329056":"Uncertainty in Propensity Score Estimation: Bayesian Methods for Variable Selection and Model-Averaged Causal Effects","264624370":"Variational inferences for partially linear additive models with variable selection","7673677":"Estimating Brain Functional Connectivity with Sparse Multivariate Autoregression","223492718":"Bayesian identification, selection and estimation of semiparametric functions in high-dimensional additive models","4744053":"Bayesian Wavelet Regression on Curves With Application to a Spectroscopic Calibration Problem","228825757":"Bayesian Models for Variable Selection that Incorporate Biological Information","227350194":"On the effect of prior assumptions in Bayesian model averaging with applications to growth regression \nThis article was published online on 30 March 2009. An error was subsequently identified. This notice is included in the online and print versions to indicate that both have been corrected \u0026lsqb;6 April 2009\u0026rsqb;.","261020849":"Bayesian Inference of Multiple Gaussian Graphical Models","38012164":"Bayesian model selection using test statistics","227378894":"A Bayesian Variable Selection Approach to Major League Baseball Hitting Metrics","227700437":"Objective Testing Procedures in Linear Models: Calibration of the p‐values","41452850":"Joint Models for the Association of Longitudinal Binary and Continuous Processes With Application to a Smoking Cessation Trial","23478829":"Application of two machine learning algorithms to genetic association studies in the presence of covariates","228337361":"Gibbs posterior for variable selection in high-dimensional classification and data mining","220659307":"Bayesian Analysis of Hierarchical Effects","228769517":"ABCS: Approximate Bayesian compressed sensing","4812569":"On time series model selection involving many candidate ARMA models","221775465":"Hierarchical Bayesian formulations for selecting variables in regression models","262906106":"Screening Procedure for Supersaturated Designs Using a Bayesian Variable Selection Method","4899608":"Forecasting in dynamic factor models using Bayesian model averaging","228629235":"Lévy adaptive regression kernels","221345382":"Sparse Gaussian graphical models with unknown block structure","4742943":"Bayesian Selection and Clustering of Polymorphisms in Functionally Related Genes","221738592":"Bayesian Variable Selection in Searching for Additive and Dominant Effects in Genome-Wide Data","255577186":"BAYESIAN METHODS TO IMPUTE MISSING COVARIATES FOR CAUSAL INFERENCE AND MODEL SELECTION","220270200":"Regulator Discovery from Gene Expression Time Series of Malaria Parasites: a Hierachical Approach.","7829293":"Yi N, Yandell BS, Churchill GA, Allison DB, Eisen EJ, Pomp D. Bayesian model selection for genome-wide QTL analysis. Genetics 170: 1333-1344","23634485":"Some connections between Bayesian and non-Bayesian methods for regression model selection","266477756":"Bayesian variable selection with spherically symmetric priors","260355303":"Sparse Coding From a Bayesian Perspective","51691632":"Two-Level Stochastic Search Variable Selection in GLMs with Missing Predictors","228083442":"Investigating New Product Diffusion Speed: A Semiparametric Approach","248398244":"An Integrative Framework for Bayesian Variable Selection with Informative Priors for Identifying Genes and Pathways","220300878":"Constructing priors based on model size for nondecomposable Gaussian graphical models: A simulation based approach","226753267":"The Bayes Factor Versus Other Model Selection Criteria for the Selection of Constrained Models","258229268":"A Review of Bayesian Variable Selection Methods: What, How and Which.","228679384":"An Adaptive Lasso Method for Dimensionality Reduction in Classification","255613117":"A Bayesian Method for Finding Interactions in Genomic Studies","220286627":"Bayesian fractional polynomials","2523045":"Calibration and Empirical Bayes Variable Selection","275334125":"Air toxics and birth defects: A Bayesian hierarchical approach to evaluate multiple pollutants and spina bifida Children\u0026 146;s Environmental Health","29618757":"Sélection bayésienne de variables en régression linéaire","50376840":"Identification and Quantification of Metabolites in 1H NMR Spectra by Bayesian Model Selection","51650717":"Bayesian Detection of Expression Quantitative Trait Loci Hot Spots","227710489":"Variable selection for high dimensional Bayesian density estimation: Application to human exposure simulation","220288682":"Optimal healthcare decisions: The importance of the covariates in cost-effectiveness analysis","262579255":"Bayesian model selection in linear mixed effects models with autoregressive(p) errors using mixture priors","267954282":"Applications of the Mode Oriented Stochastic Search (MOSS) Algorithm for Discrete Multi-way Data to Genomewide Studies","226535955":"Bayesian Model Uncertainty in Mixed Effects Models","220286642":"Model uncertainty and variable selection in Bayesian lasso regression","228993586":"Model Selection when Multiple Imputation Is Used to Protect Confidentiality in Public Use Data","255656104":"What Belongs Where? Variable Selection for Zero-Inflated Count Models with an Application to the Demand for Health Care","254700729":"Fast Bayesian Matching Pursuit: Model Uncertainty and Parameter Estimation for Sparse Linear Models","8525593":"Selecting Factors Predictive of Heterogeneity in Multivariate Event Time Data","47351113":"A multivariate stochastic search method for dimensionality reduction in classification","8525598":"Bayesian Isotonic Regression and Trend Analysis","253813949":"DIMENSIONALITY REDUCTION FOR CLASSIFICATION WITH HIGH-DIMENSIONAL DATA","33031768":"Bayesian Regularisation in Structured Additive Regression Models for Survival Data","224505536":"A Fast Posterior Update for Sparse Underdetermined Linear Models","228859393":"Bayesian selection of multiresponse nonlinear regression model","23625422":"Parallel hierarchical sampling: a practical multiple-chains sampler for Bayesian model selection","240827901":"Variable Selection in Nonparametric Random Eects Models","1914805":"Rodeo: Sparse, Greedy Nonparametric Regression","31373938":"Calibration and Empirical Bayes Variable Selection","220286604":"Bayesian kernel projections for classification of high dimensional data","228437552":"Efficient Gaussian graphical model determination under G-Wishart distributions","273143786":"A Bayesian Vector Multidimensional Scaling Procedure Incorporating Dimension Reparameterization with Variable Selection","48208240":"Compatibility of Prior Specifications Across Linear Models","229016086":"Bayesian Variable Selection for Multivariate Spatially-Varying Coefficient Regression: Application to Physical Activity in Pregnancy","257940719":"Monte Carlo Methods in Bayesian Statistics","5155839":"A Bayesian methodology for simultaneously detecting and estimating regime change points and variable selection in multiple regression models for marketing research","269935522":"Individual adaptation: an adaptive MCMC scheme for variable selection problems","220286614":"Bayesian estimation and stochastic model specification search for dynamic survival models","5631980":"Markov and Semi-Markov Switching of Source Appearances for Nonstationary Independent Component Analysis","236878245":"Stochastic algorithms for variable selection in the General Linear Model","263080047":"Model uncertainty and aggregated default probabilities: New evidence from Austria","261442644":"The deviance information criterion: 12 years on","235766217":"Penalized Likelihood and Bayesian Function Selection in Regression\nModels","228597350":"The Practical Implementation of Bayesian Model Selection","266679341":"Spatial variable selection methods for investigating acute health effects of fine particulate matter components: Spatial Variable Selection for Effects of PM Components","5386142":"Application of an iterative Bayesian variable selection method in a genome-wide association study of rheumatoid arthritis","23522984":"Fan J, Lv J. Sure independence screening for ultra-high dimensional feature space (with discussion). J R Stat Soc Series B Stat Methodol 70: 849-911","266853416":"Antiretroviral drug distribution routing system in Limpopo province, South Africa. Journal of Mathematics and System Science.","4816793":"Marginal likelihoods for non-Gaussian models using auxiliary mixture sampling","258229431":"Comment on article by Monni and Tadesse","220286708":"Stochastic matching pursuit for Bayesian variable selection","266059777":"A Bayesian framework for statistical inference from gene expression data","263063668":"On Sampling Strategies in Bayesian Variable Selection Problems With Large Model Spaces","271708114":"A systematic evaluation of high-dimensional, ensemble-based regression for exploring large model spaces in microbiome analyses","227700342":"Bayesian subset selection and model averaging using a centered and dispersed prior for the error variance","228634180":"Dependency networks for genome-wide data","23400065":"Finding factors influencing risk: comparing Bayesian stochastic search and standard variable selection methods applied to logistic regression models of cases and controls. Stat Med","6162360":"Imputation-Based Analysis of Association Studies: Candidate Regions and Quantitative Traits","267671570":"Principles of statistical genomics","45935956":"Bayesian Hypothesis Testing for Sparse Representation","46493999":"Sparse seemingly unrelated regression modelling: Applications in finance and econometrics","2441160":"Model Selection and the Principle of Minimum Description Length","27476558":"Informed statistical modelling of habitat suitability for rare and threatened species","228429424":"The Role of the Economy Structure in the US-China Bilateral Trade Deficit","267337758":"Sparse Bayesian Variable Selection for the Identification of Antigenic Variability in the Foot-and-Mouth Disease Virus","240391590":"Variable Selection and Covariance Selection in Multivariate Regression Models","254531800":"Bayesian Benefit Transfer for Choice Experiment Data: preliminary results","240925103":"Ch. 2. Industrial experimentation for screening","237559262":"Forecast Combination and Bayesian Model Averaging","11061086":"Central nervous system activity of Leucas inflata Benth. In mice","46494003":"Bayesian estimation and variable selection for single index models","48198951":"Sequential Monte Carlo on large binary sampling spaces","43694435":"Characterizing economic trends by Bayesian stochastic model specification search","22141611":"[Penalization].","220286687":"An alternative to model selection in ordinary regression","229515856":"Mapping Quantitative Trait Loci in Outbred Pedigrees","228279908":"Predicting the Present with Google Trends","263427148":"Block Hyper-g Priors in Bayesian Regression"},"index":136}