{"abs":"The power-conditional-expected-posterior (PCEP) prior developed for variable selection in normal regression models combines ideas from the power-prior and expected-posterior prior, relying on the concept of random imaginary data, and provides a consistent variable selection method which leads to parsimonious inference. In this paper we discuss the computational limitations of applying the PCEP prior to generalized linear models (GLMs) and present two PCEP prior variations which are easily applicable to regression models belonging to the exponential family of distributions. We highlight the differences between the initial PCEP prior and the two GLM-based PCEP prior adaptations and compare their properties in the conjugate case of the normal linear regression model. Hyper prior extensions for the PCEP power parameter are further considered. We consider several simulation scenarios and one real data example for evaluating the performance of the proposed methods compared to other commonly used methods. Empirical results indicate that the two GLM-PCEP adaptations lead to parsimonious variable selection inference.","title":"Variations of the Power-Conditional-Expected-Posterior Prior for Bayesian Variable Selection in Generalized Linear Models","id":280773293,"url":"https://www.researchgate.net/publication/280773293_Variations_of_the_Power-Conditional-Expected-Posterior_Prior_for_Bayesian_Variable_Selection_in_Generalized_Linear_Models","names":["Konstantinos Perrakis","Dimitris Fouskakis","Ioannis Ntzoufras"],"references":{"266400039":"Inference From Intrinsic Bayes’ Procedures Under Model Selection and Uncertainty","254073455":"Mixtures of g-priors for Bayesian Model Averaging with economic application","259864433":"Pattern Recognition And Neural Networks","1908752":"Fully Bayes factors with a generalized g-prior","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","220286515":"On Bayesian model and variable selection using MCMC","2522677":"Training Samples in Objective Bayesian Model Selection","243081582":"A Statistical Paradox","228750262":"Conjugate Priors for Generalized Linear Models","229100978":"Bayesian Auxiliary Variable Models for Binary and Multinomial Regression","41222432":"Bayesian Core: A Practical Approach to Computational Bayesian Statistics","247769554":"Power-Expected-Posterior Priors for Variable Selection in Gaussian Linear Models","243081761":"A Comment on D. V. Lindley\u0027s Statistical Paradox","247769561":"Power-Conditional-Expected Priors: Using g-priors with Random Imaginary Data for Variable Selection","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","4725224":"Benchmark Priors for Bayesian Model Averaging","24422165":"Bayesian Variable Selection and Computation for Generalized Linear Models with Conjugate Priors","228623812":"Adaptive Bayesian criteria in variable selection for generalized linear models","230996705":"Criteria for Bayesian model choice with application to variable\nselection","47733374":"Bayes and empirical-Bayes multiplicity adjustment in the variable-selection problem","38326830":"Power Prior Distributions for Regression Models","274094335":"Mixtures of g-priors in Generalized Linear Models","222708653":"Benchmark priors for Bayesian Model Averaging. J Econom 100: 381-427","2836359":"Minimum Description Length Model Selection Criteria for Generalized Linear Models","45389656":"An Information Matrix Prior for Bayesian Analysis in Generalized Linear Models with High Dimensional Data.","251803628":"Comments on \"Mixtures of g-priors for Bayesian Variable Selection","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","228092010":"MCMC for doubly-intractable distributions","246997643":"On Bayesian Analysis of Generalized Linear Models Using Jeffreys\u0027s Prior","51871587":"Objective Bayes Model Selection in Probit Models","257665455":"Computation for intrinsic variable selection in normal regression models via expected-posterior prior","236157541":"The Intrinsic Bayes Factor for Model Selection and Prediction","280794507":"The Intrinsic Bayes Factor for Model Selection and Prediction","238727682":"Variable Selection Via Gibbs Sampling","243103236":"Bayesian Variable Selection for Logistic Models Using Auxiliary Mixture Sampling","5207157":"Expected-posterior prior distributions for model selection","4742260":"Objective Bayesian Variable Selection","45933889":"Hyper-g Priors for Generalized Linear Models","4743606":"Clyde MA„ Berger JO: Mixtures of g priors for Bayesian variable selection","225106197":"Posterior Odds Ratios for Selected Regression Hypotheses","5207408":"Adaptive sampling for Bayesian variable selection"},"citedIn":{},"index":145}