{"abs":"this article is to show how the Bayesian graphical framework unifies and greatly simplifies many standard discrete data problems such as Bayesian log linear modeling with either complete or incomplete data, model selection and accounting for model uncertainty, closed population estimation, multinomial estimation with misclassification, double sampling and database error prediction. This list by no means exhausts the possible applications. This is a methodological article. Our objective is to demonstrate the diverse range of potential applications, alert the reader to an exciting new methodology and hopefully stimulate further development","title":"Bayesian Graphical Models for Discrete Data","id":2867469,"url":"https://www.researchgate.net/publication/2867469_Bayesian_Graphical_Models_for_Discrete_Data","names":["David Madigan","Jeremy York","Julian Besag","Kass Augustine Kong Steffen Lauritzen","International Statistical Review"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","260400133":"On the performance of Markov chain Monte Carlo methods in pedigree data and a new algorithm","227776017":"Sequential Updating of Conditional Probabilities on Directed Graphical Structures","2592036":"Strategies for Graphical Model Selection","2761262":"Propagation of Probabilities, Means and Variances in Mixed Graphical Association Models","246048559":"Eliciting prior information to enhance the predictive performance of Bayesian graphical models","11228461":"Some Coverage Error Models for Census Data","262210087":"Probabilistic Reasoning in Expert Systems","21088454":"The effects of model selection on confidence intervals for the size of a closed population","236587666":"Graphical Models for Associations Between Variables, Some of Which Are Qualitative and Some Quantitative","265988306":"Bayesian graphical models for predicting errors in databases","230596020":"Local Computations With Probabilities on Graphical Structures and Their Application to Expert Systems","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","254287396":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","15130091":"Maximum Likelihood Estimation of the Proportion of Congenital Malformations Using Double Registration Systems","21575495":"A review of methods for misclassified categorical data in epidemiology.","269923224":"Covariance Selection","2594870":"Graphical Explanation in Belief Networks","31435595":"Inference for the Binomial N Parameter: A Hierarchical Bayes Approach","220604592":"“Bayesian Networks without Tears.”","228078209":"Common Structure of Smoothing Techniques in Statistics","269893133":"Pedigree Analysis in Human Genetics","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","222789082":"A Bayesian approach to regression selection and estimation, with application to a price index for radio services","243650074":"The chain graph Markov property","231834574":"Recursive Causal Models","236587707":"Linear Dependencies Represented by Chain Graphs","227948852":"Independence properties of directed Markov fields. Networks, 20, 491-505","21318754":"A temporary increase of Down syndrome among births of young mothers in Norway: An effect of risk unrelated to maternal age","267107008":"Birth Defects Registered by Double Sampling: A Bayesian Approach Incorporating Covariates and Model Uncertainty","247932523":"The Multiple Recapture Census for Closed Populations and Incomplete 2 k Contingency Tables","254286362":"Log-Linear Models for Doubly Sampled Categorical Data Fitted by the EM Algorithm","236586272":"On Substantive Research Hypotheses, Conditional Independence Graphs and Graphical Chain Models","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","226157246":"Applications of a General Propagation Algorithm for Probabilistic Expert Systems","220344038":"A Bayesian Method for the Induction of Probabilistic Networks from Data","254331757":"A Double Sampling Scheme for Estimating from Misclassified Multinomial Data with Applications to Sampling Inspection","24056230":"Graphical models in applied multivariate statistics","239063412":"Estimating the Errors Remaining in a Data Set: Techniques for Quality Control","38359812":"Hyper Markov Laws in the Statistical Analysis of Decomposable Graphical Models","239064817":"An Extension of the Results of Asmussen and Edwards on Collapsibility in Contingency Tables","245848936":"Decomposition of Maximum Likelihood in Mixed Graphical Interaction Models","221669734":"Equations of State Calculations by Fast Computing Machines","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","38363676":"Uncertainty, Policy Analysis and Statistics (c/r: P276–291)","220695666":"Probabilistic Reasoning in Expert Systems: Theory and Algorithms, John Wiley, New York","20096485":"The Prevalence of Malaria in Garki, Nigeria: Double Sampling with a Fallible Expert","38363153":"Bayesian Analysis in Expert Systems","216301244":"Probabilistic Reasoning in Intelligent Systems: Networks Of Plausible Inference","248034706":"Propagation of Probabilities, Means, and Variances in Mixed Graphical Association Models","254282231":"Data Base Error Trapping and Prediction","20952543":"Ultrasonic imaging for extracorporeal shockwave lithotripsy: analysis of factors in successful treatment","232901383":"A Bayesian analysis in closed animal populations from capture recapture experiments with trap response","16012190":"Reliability of Basic Patient Data","31327028":"Bayesian methods for estimation of the size of a closed population","38359354":"Correction: Graphical Models for Associations Between Variables, Some of which are Qualitative and Some Quantitative","16525448":"Robust Estimation of Population Size in Closed Animal Populations from Capture-Recapture Experiments","260161143":"Hierarchical Interaction Models","261793645":"Selection of Subsets of Regression Variables","244955489":"A Double Sampling Scheme for Estimating from Binomial Data with Misclassification","16193423":"Use of Bernoulli census and log-linear methods for estimating the prevalence of spina bifida in livebirths and the completness of vital reports in New York State","242504973":"Markov Chains with Stationary Probabilities","233345042":"Bayesian estimation methods for categorical data with misclassification","19729494":"A General Approach to Analyzing Epidemiologic Data that Contain Misclassification Errors","51999462":"Graphical Models in Applied Multivariate Statistics. John Wiley, Chichester"},"citedIn":{"277427331":"Analyzing determinants of bond yield spreads with Bayesian Model Averaging","38348357":"Geometry, moments and conditional independence trees with hidden variables","7732347":"Imputation and Variable Selection in Linear Regression Models with Missing Covariates","228305300":"Forecasting Inflation Using Dynamic Model Averaging","228770227":"Bayesian Clustering with Variable and Transformation Selections","228796853":"Automatic Bayesian model averaging for linear regression and applications in Bayesian curve fitting","46558942":"Determinants of Currency Crises: A Conflict of Generations?","23977333":"The Determinants of Economic Growth in European Regions","281608405":"Dynamic Model Averaging and CPI Inflation Forecasts: A Comparison between the Euro Area and the United States","262855607":"Applications of Multiple Systems Estimation in Human Rights Research","24142162":"Determining Growth Determinants: Default Priors and Predictive Performance in Bayesian Model Averaging","46451424":"Fiscal Decentralisation, Macroeconomic Conditions and Economic Growth in Australia","46558947":"Could Markets Have Helped Predict the Puzzling Exchange Rate Path in CESEE Countries during the Current Crisis?","224761164":"Learning Dynamic Bayesian Networks Using Evolutionary MCMC","45867665":"Bayesian variable selection using cost-adjusted BIC, with application to cost-effective measurement of quality of health care","265107430":"BAYESIAN METHODS FOR NON-STANDARD MISSING DATA PROBLEMS","240967280":"MCMC model determination for discrete graphical models","8149072":"A Bayesian Network Classification Methodology for Gene Expression Data","24312159":"Accounting for uncertainty in health economic decision models using model averaging","264958949":"Regression: Models, Methods and Applications","242412099":"Bayesian and non-Bayesian techniques applied to censored survival data with missing values","3974154":"Learning Bayesian network classifiers for credit scoring using Markov Chain Monte Carlo search","275847241":"The effect of parameter priors on Bayesian relevance and effect size measures","266215399":"Power Intrinsic Variable Selection for Normal Models based on Zellner\u0027s g-Prior: Model Formulation and Preliminary Results Joint work with","234136014":"Leading Indicators of Crisis Incidence: Evidence from Developed Countries","234140104":"Being Bayesian about Network Structure","24142156":"In Search of a Sulphur Dioxide Environmental Kuznets Curve: A Bayesian Model Averaging Approach","7605321":"Estimation of the false negative fraction of a diagnostic kit through Bayesian regression model averaging","250308310":"Physarum Learner: A Novel Structure Learning Algorithm for Bayesian Networks inspired by Physarum Polycephalum","259142479":"Country credit risk determinants with model uncertainty","236457510":"Integrated Systems Approach Identifies Genetic Nodes and Networks in Late-Onset Alzheimer’s Disease","2498660":"Regression with Multiple Candidate Models: Selecting or","251626172":"9316 POSTER Near-Infrared Guided Indocyanine Green (ICG) and Indocyanine Green With Human Serum Albumin (ICG:HAS) Sentinel Lymph Node Biopsy in Melanoma Patients","220343654":"Improving the structure MCMC sampler for Bayesian networks by introducing a new edge reversal move","221066601":"Modeling affordances using Bayesian networks.","222973197":"A Matrix Exponential Spatial Specification","269298762":"Incorporating prior expert knowledge in learning Bayesian networks from genetic epidemiological data","234064315":"Bayesian wavelet-based curve classification via discriminant analysis with Markov random tree priors","243770060":"Model Selection: An Integral Part of Inference","12218612":"Using Bayesian Network to Analyze Expression Data.","2567273":"Bayesian Inference in Incomplete Multi-Way Tables","266870716":"Bayesian causal phenotype network incorporating genetic variation and biological knowledge","220320117":"Exact Bayesian structure learning from uncertain interventions","220343668":"Population Markov Chain Monte Carlo","237071991":"Transdimensional Sampling Algorithms for Bayesian Variable Selection in Classification Problems With Many More Variables Than Observations","49701550":"Grzegorczyk M, Husmeier D. Improvements in the reconstruction of time-varying gene regulatory networks: Dynamic programming and regularization by information sharing among genes","221909350":"Design of Evolutionary Methods Applied to the Learning of Bayesian Network Structures","23742775":"Bayesian Modelling of Catch in a Northwest Atlantic Fishery","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","274838590":"Unveiling covariate inclusion structures in economic growth regressions using latent class analysis","38326824":"Bayesian Model Averaging: A Tutorial","256048930":"Intellectual Property Rights as Development Determinants (Les Droits De Propriété Intellectuelle En Tant Que Facteurs De Développement)","4909097":"Reconstructing Gene Regulatory Networks with Bayesian Networks by Combining Expression Data with Multiple Sources of Prior Knowledge","251371165":"Improved algorithm based on mutual information for learning Bayesian network structures in the space of equivalence classes","255976235":"A Local Poisson Graphical Model for Inferring Networks From Sequencing Data","273389601":"Want export diversification? Educate the kids first","228192759":"Politics, Stock Markets, and Model Uncertainty","4773926":"A Bayesian Approach to Modelling Graphical Vector Autoregressions","229065173":"Efficient Sampling for Bayesian Inference of Conjunctive Bayesian Networks","35660371":"Maschinelles Lernen Bayes\u0027scher Netze für benutzeradaptive Systeme /","2632796":"On the relationship between MCMC model uncertainty methods","221275460":"Feature Selection by Markov Chain Monte Carlo Sampling - A Bayesian Approach.","266918813":"Foreign Exchange Rate Forecasting with Artificial Neural Networks","241074731":"Several Types of Contraceptives Safe in Lupus","6440983":"Bayesian Model Averaging in Time-Series Studies of Air Pollution and Mortality","263063507":"Learning Sparse Causal Gaussian Networks With Experimental Intervention: Regularization and Coordinate Descent","5950500":"Extracting Protein Regulatory Networks with Graphical Models","234135926":"\"Banking, debt and currency crisis: early warning indicators for developed countries\"","257410000":"QuickLexSort: An efficient algorithm for lexicographically sorting nested restrictions of a database","24134136":"Time Varying Determinants of Cross-Country Growth","221165989":"Locating Anomalies Using Bayesian Factorizations and Masks","229238054":"Bayesian Methods for DNA Microarray Data Analysis","224947707":"Integrating biological knowledge into variable selection: an empirical Bayes approach with an application in cancer biology","288986538":"Contagion and Spillover Effects in the Dutch Regional House Prices: A Network Approach","2360497":"Being Bayesian About Network Structure: A Bayesian Approach to Structure Discovery in Bayesian Networks","222719452":"Data mining of association structure to model consumer behavior","254428087":"Three Empirical Essays on the Determinants of Economic Growth","242462444":"Multivariate Applications of Bayesian Model Averaging","228289851":"How to Prioritize Policies for Pro-Poor Growth: Applying Bayesian Model Averaging to Vietnam","4993256":"Bayes model averaging with selection of regressors. J R Stat Soc B","50987950":"[Cystinuria in children: A report of 4 cases.]","2471040":"Steps To Implement Bayesian Input Distribution Selection","254438287":"Bayesian Model Averaging in the Instrumental Variable Regression Model","4790511":"Monetary Policy with a Wider Information Set: A Bayesian Model Averaging Approach","266944334":"Structural Prediction of Dynamic Bayesian Network With Partial Prior Information","278743093":"From genome-scale data to models of infectious disease: A Bayesian network-based strategy to drive model development","221667738":"Uniform random generation of large acyclic digraphs","220907931":"Caveats For Causal Reasoning With Equilibrium Models","222564848":"Modeling uncertainty in macroeconomic growth determinants using Gaussian graphical models","268236616":"Transformation-based model averaged tail area inference","221112730":"An Empirical Study of Encoding Schemes and Search Strategies in Discovering Causal Networks","281374834":"Bayesian Approaches for Large Biological Networks","259553216":"Model Averaging in Economics: An Overview","250750538":"Analyzing Quantitative Trait Loci for the Arabidopsis thaliana using Markov Chain Monte Carlo Model Composition with restricted and unrestricted model spaces","220699039":"Ancestor Relations in the Presence of Unobserved Variables.","243776061":"A Bayesian Approach to Structure Discovery in Bayesian Netw orks","224040422":"Mapping epistemic uncertainty and vague concepts in predictions of species distribution","222422524":"Bayesian graphical model determination using decision theory","234094902":"How different is Africa? A comment on Masanjala and Papageorgiou","234094903":"Drivers of Output Loss during the 2008–09 Crisis: A Focus on Emerging Europe","251529787":"Joint multiple adaptive wavelet regression ensembles","247830019":"Increasing the Power to Detect Causal Associations among Genes and between Genes and Complex Traits by Combining Genotypic and Gene Expression Data in Segregating Populations","228453722":"Fiscal Federalism and Economic Growth in OECD Countries: A Bayesian Model Averaging Approach","221707774":"Bayesian Model Averaging Using the k-best Bayesian Network Structures","228651369":"Bayesian robust transformation and variable selection: A unified approach","221533689":"Quantitative Trait Loci Analysis Using a Bayesian Framework.","222465426":"Probabilistic reasoning and multiple-expert methodology for correlated objective data","227623232":"Markov Chain Monte Carlo Method and its applications","223340957":"Laccase production by Pleurotusostreatus 1804: Optimization of submerged culture conditions by Taguchi DOE methodology","51930061":"Copula Gaussian graphical models and their application to modeling functional disability data","27537777":"A fault diagnosis technique for complex systems using Bayesian data analysis","45128301":"Does it Make a Difference? Comparing Growth Effects of European and North American FDI in Latin America","260428635":"Addendum on the scoring of Gaussian directed acyclic graphical models","264312610":"Banking, Debt, and Currency Crises in Developed Countries: Stylized Facts and Early Warning Indicators","221112776":"MCMC Learning of Bayesian Network Models by Markov Blanket Decomposition","282761276":"An information theoretic approach to pedigree reconstruction","220699087":"Discovery of Regulatory Connections in Microarray Data.","46624302":"The Discrete Acyclic Digraph Markov Model in Data Mining","222410157":"The mode oriented stochastic search (MOSS) algorithm for log-linear models with conjugate priors","228752720":"Computational Aspects Related to Inference in Gaussian Graphical Models With The G-Wishart Prior","51231742":"An Efficient Stochastic Search for Bayesian Variable Selection with High-Dimensional Correlated Predictors","271670469":"Objective Bayesian Model Selection in Generalized Additive Models With Penalized Splines","23775647":"Bayesian Model Averaging and Exchange Rate Forecasts","5139641":"Model Uncertainty in Cross-Country Growth Regressions","49693185":"A multiorganism based method for Bayesian gene network estimation","257412014":"Evaluating explanatory models of the spatial pattern of surface climate trends using model selection and bayesian averaging methods","279636051":"Sources of Asymmetric Shocks: The Exchange Rate or Other Culprits?","2592036":"Strategies for Graphical Model Selection","242375542":"Semi-supervisedL earningofClassif iers:Theory and Algorithmsfor BayesianNetworkC lassifiersandApp lications toHuman-Computer Interaction","224881763":"Bayesian Constrained Variable Selection","1757469":"Alternative parametrizations and reference priors for decomposable discrete graphical models","220350509":"Towards efficient variables ordering for Bayesian networks classifier","8153453":"Semisupervised learning of classifiers: theory, algorithms, and their application to human-computer interaction. IEEE Trans Pattern Anal Mach Intell","254043702":"A novel binary adaptive differential evolution algorithm for Bayesian Network learning","257870410":"Comparing the reconstruction of regulatory pathways with distinct Bayesian networks inference methods","220451893":"Association Models for Web Mining","228934834":"Algorithms for Exact Structure Discovery in Bayesian Networks","220907570":"Probability Density Estimation by Perturbing and Combining Tree Structured Markov Networks","220254267":"Learning Bayesian networks: Approaches and issues","277327259":"The Econometrics of Networks: A Review","46650330":"Learning Bayesian Network Models from Incomplete Data using Importance Sampling","257586756":"Can specific policy indicators identify reform priorities?","220363786":"Bayesian Inference for Categorical Data Analysis","220309515":"Using Bayesian Networks to Analyze Expression Data","4993382":"Bayesian modeling of catch in a northwest Atlantic fishery","2366728":"Learning Bayes net structure from sparse data sets","224839755":"Model Uncertainty, Data Mining and Statistical Inference","47335423":"Analysis of lifestyle and metabolic predictors of visceral obesity with Bayesian Networks","261595814":"Reconstructing Evolving Signalling Networks by Hidden Markov Nested Effects Models","228561069":"An empirical comparison of the efficiency of several local search heuristics algorithms for bayesian network structure learning","2612499":"Bayesian Model Averaging for Linear Regression Models","275363167":"Accounting for uncertainty in confounder and effect modifier selection when estimating average causal effects in generalized linear models: Accounting for Uncertainty in Confounder and Effect Modifier Selection When Estimating ACEs in GLMs","220663824":"Looking at the viewer: Analysing facial activity to detect personal highlights of multimedia contents","228617371":"Markov Chain Monte Carlo With Mixtures of Mutually Singular Distributions","24075346":"Growth, Convergence and Public Investment: A Bayesian Model Averaging Approach","268808507":"Does trust contribute to stock market development?","5207408":"Adaptive sampling for Bayesian variable selection","243785679":"STATISTICAL NOTIONS OF DATA DISCLOSURE AVOIDANCE AND THEIR RELATIONSHIP TO TRADITIONAL STATISTICAL METHODOLOGY: DATA SWAPPING AND LOGLINEAR MODELS","224159764":"Comparison of Co-temporal Modeling Algorithms on Sparse Experimental Time Series Data Sets","259269181":"Bayesian Networks for Clinical Decision Support in Lung Cancer Care","239062900":"A divide-and-conquer algorithm for generating Markov bases of multi-way tables","254073455":"Mixtures of g-priors for Bayesian Model Averaging with economic application","2421096":"Bayesian Model Averaging And Model Selection For Markov Equivalence Classes Of Acyclic Digraphs","222569493":"An investigation of thresholds in air pollution–mortality effects","255244900":"Comparison of Two Gas Selection Methodologies: An Application of Bayesian Model Averaging","45919214":"Bayesian Inference for General Gaussian Graphical Models With Application to Multivariate Lattice Data","228690162":"A computable theory for learning Bayesian networks based on MAP-MDL principles","245581819":"Bayes Factors and Model Uncertainty","35211079":"Regression model search and uncertainty with many predictors /","38327063":"Experiments in Stochastic Computation for High-Dimensional Graphical Models","220451914":"Bayesian Networks for Data Mining","45709266":"Modelling Nonstationary Gene Regulatory Processes","4993312":"Model determination for categorical data with factor level merging","238699351":"ACCOUNTING FOR INPUT UNCERTAINTY IN DISCRETE-EVENT SIMULATION","4798756":"Macroeconomic policy and the distribution of growth rates","242448131":"Causation, Prediction and Search","4725051":"Cromwell\u0027s Rule and the Role of the Prior in the Economic Metric: An Application to the Portfolio Allocation Problem","263865033":"SOFTWARE SYSTEMS FOR TABULAR DATA RELEASES","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","222664755":"Air pollution, economic activity and respiratory illness: Evidence from Canadian cities, 1974–1994","227325172":"Discrimination and Mortgage Lending in Boston: The Effects of Model Uncertainty","273706280":"Recreational Housing and Community Development: A Triple Bottom Line Approach","270906716":"Model-Averaged [Formula: see text] Regularization using Markov Chain Monte Carlo Model Composition","267269778":"Incorporating prior expert knowledge in learning Bayesian networks from genetic epidemiological data","265612969":"Bayesian Network Modelling of the Factors Influencing the Development of Obesity","264633018":"Integrative Genomics Reveals Novel Molecular Pathways and Gene Networks for Coronary Artery Disease","266014299":"Introducing Bayes Factors","220615847":"Modelling Nonstationary Gene Regulatory Processes.","6533600":"Bayesian networks of BI-RADS™ descriptors for breast lesion Classification","220355750":"Modeling the Production of Coverbal Iconic Gestures by Learning Bayesian Decision Networks.","246048559":"Eliciting prior information to enhance the predictive performance of Bayesian graphical models","221787327":"Evolutionary Methods for Learning Bayesian Network Structures","266046044":"Anomaly Detection and Location with an Application to an Energy Management System","241751008":"A Better Approach to Resolving Variable Selection Uncertainty in Meta Analysis for Benefits Transfer","221404347":"Bayesian Model Averaging Using the k-best Bayesian Network Structures.","43792149":"On the Stability of Community Detection Algorithms on Longitudinal Citation Data","2469295":"Prediction Via Orthogonalized Model Mixing","46442312":"The Impact of Institutions on Economic Performance","229010474":"A Bayesian Spatial Model Composition Analysis of Knowledge Production","5281218":"Gene Regulatory Network Reconstruction by Bayesian Integration of Prior Knowledge and/or Different Experimental Conditions","45635375":"Introduction to graphical models with an application in finding coplanar points","48907120":"Modèles Graphiques Probabilistes pour l\u0027Estimation de Densité en grande dimension : applications du principe Perturb \u0026 Combine pour les mélanges d\u0027arbres","229498934":"Determinants of Knowledge Production and Their Effects on Regional Economic Growth","228379648":"Uncertainty of the Liberal Peace","227360786":"The Determinants of Regional Economic Growth By Quantile","4725224":"Benchmark Priors for Bayesian Model Averaging","2854286":"Software Systems for Tabular Data Releases","23694543":"Meta-Regression and Benefit Transfer: Data Space, Model Space, and the Quest for ‘Optimal Scope’","24122587":"Bayesian Model Averaging in the Context of Spatial Hedonic Pricing: An Application to Farmland Values","281800038":"Using multi-step proposal distribution for improved MCMC convergence in Bayesian network structure learning","222815465":"Data augmentation in multi-way contingency tables with fixed marginal totals","2353548":"Nonparametric Convergence Assessment for MCMC Model Selection","284554565":"Bayesian Model Averaging and Jointness Measures for gretl","268412494":"Bayesian Model Averaging and Variable Selection in Multivariate Ecological Models","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","283049327":"Integrative Bayesian Analysis of Neuroimaging-Genetic Data with Application to Cocaine Dependence","220554390":"Bounded rationality and search over small-world models","277236021":"Systematic analysis of time resolved high-throughput data using stochastic network inference methods","237648793":"Estimating Taylor rules in a credit channel environment","268895667":"Time series forecasting with multiple candidate models: selecting or combining?","2771356":"Statistical Ideas for Selecting Network Architectures","220396693":"Learning Object Affordances: From Sensory Motor Coordination to Imitation","230742138":"Bayesian Inference of Signaling Network Topology in a Cancer Cell Line","254440086":"Does Trust Promote Growth?","254401175":"Adaptive Monte Carlo on Multivariate Binary Sampling Spaces","236132268":"Bayesian Model Selection \u0026 Averaging","272393603":"Trade openness and economic growth: Bayesian model averaging estimate of cross-country growth regressions","271227285":"Looking for a Needle in a Haystack: Revisiting the Cross-country Causes of the 2008–9 Crisis by Bayesian Model Averaging","5096844":"Computational Efficiency in Bayesian Model and Variable Selection","2267623":"Population Markov Chain Monte Carlo","2642415":"Decomposable Graphical Gaussian Model Determination","229708918":"Model Uncertainty","239932292":"Bayesian methods for disclosure risk assessment","237776871":"Learning with Hidden Variables: A Parameter Reusing Approach for Tree-Structured Bayesian Networks","250823487":"References and Bibliography for the Tutorial on MCMC Bayesian Model and Variable Selection","237380598":"Improving High-Dimensional Bayesian Network Structure Learning by Exploiting Search Space Information","227016794":"Determinants of foreign direct investment","257635981":"New skeleton-based approaches for Bayesian structure learning of Bayesian networks","50288421":"Structure discovery in Bayesian networks: An analytical tool for analysing complex animal health data","234159144":"Systems Biology Approaches and Applications in Obesity, Diabetes, and Cardiovascular Diseases","228385856":"Adaptive Monte Carlo for Bayesian Variable Selection in Regression Models","2509304":"Bayesian Variable Selection for Proportional Hazards Models","5893561":"Bayesian Integration of Biological Prior Knowledge into the Reconstruction of Gene Regulatory Networks with Bayesian Networks","252062438":"Analysis of Pulse Bursting Phenomenon in Constant-On-Time-Controlled Buck Converter","259099283":"Bayesian Estimation and Model Selection for Spatial Durbin Error Model with Finite Distributed Lags","49733393":"Using Stochastic Causal Trees to Augment Bayesian Networks for Modeling eQTL Datasets","227617914":"Extended Bayesian model averaging for heritability in twin studies","251344663":"Bayesian Graphical Models for STructural Vector Autoregressive Processes","5005730":"Determinants Of Economic Growth: A Bayesian Panel Data Approach","263533146":"A New Algorithm in Bayesian Model Averaging in Regression Models","229441629":"Model selection in canonical correlation analysis (CCA) using Bayesian model averaging","3996110":"Data generation for testing DAG-structured Bayesian networks","224881809":"Approaches for Bayesian Variable Selection","221250760":"A Framework to Learn Bayesian Network from Changing, Multiple-Source Biomedical Data.","4993462":"Bayesian disclosure risk assessment: Predicting small frequencies in contingency tables","3834305":"Steps to implement Bayesian input distribution selection","226916477":"A “Microscopic” Study of Minimum Entropy Search in Learning Decomposable Markov Networks","5098934":"Comparing Forecast Performance of Exchange Rate Models","245323619":"An Empirical Comparison of Methods for Forecasting Using Many Predictors","253180181":"A robust ranking of pro-poor growth policies: the case of Vietnam","24118132":"FORECASTING WITH BAYESIAN VECTOR AUTOREGRESSIONS.","4899407":"Assessment of two approximation methods for computing posterior model probabilities","237134887":"Statistical Inference in Graphical Models","232767448":"The Determinants of Vulnerability to the Global Financial Crisis 2008 to 2009: Credit Growth and Other Sources of Risk","277298831":"Bayesian Model Averaging","226905999":"Learning Network from High-Dimensional Array Data","2888229":"Learning Probabilistic Networks","228623273":"Politics, Stock Markets, and Model Uncertainty","45869234":"Learning networks from high dimensional binary data: An application to genomic instability data","241754213":"Early Warning Indicators of Economic Crises: Evidence from a Panel of 40 Developed Countries","221860662":"Bayesian Effect Estimation Accounting for Adjustment Uncertainty","228652982":"Spike and slab prior distributions for simultaneous Bayesian hypothesis testing, model selection, and prediction, of nonlinear outcomes","242372709":"E-ciency Determinants of Paper Machine Wet-End Performance","228347781":"Bayesian Adaptive Sampling for Variable Selection and Model Averaging","49684719":"Variable Selection for Discriminant Analysis with Markov Random Field Priors for the Analysis of Microarray Data","220775223":"Handling Uncertainty in a Medical Study of Dietary Intake During Pregnancy.","23509830":"A Spatial Bayesian Hedonic Pricing Model of Farmland Values","2814475":"Regression with Multiple Candidate Models: Selecting or Mixing?","220320514":"Exact Bayesian Structure Discovery in Bayesian Networks","228289471":"Variable Selection and Functional Form Uncertainty in Cross-Country Growth Regressions","222485349":"A Method for Simultaneous Variable Selection and Outlier Identification in Linear Regression;","251220177":"Methodology for Bayesian Model Averaging: An Update","260715937":"Scalable Bayesian Model Averaging Through Local Information Propagation","23135053":"Modelling non-stationary gene regulatory processes with a non-homogeneous Bayesian network and the allocation sampler","221585179":"Optimal Tabular Releases from Confidential Data.","46448886":"Forecast Combination and Bayesian Model Averaging - A Prior Sensitivity Analysis","237789206":"Determinants of Sovereign Yield Spreads","260082106":"Nonparametric Bayesian Networks","228735897":"Knowledge and data fusion in probabilistic networks","260174270":"Weighted committee-based structure learning for microarray data","37434491":"A note on model uncertainty in linear regression","251891015":"Incorporating Error-Rate-Controlled Prior in Modelling Brain Functional Connectivity","51211589":"Characterization of cyclic β-glucans of Bradyrhizobium by MALDI-TOF mass spectrometry","220344171":"Non-homogeneous dynamic Bayesian networks for continuous data","45901045":"Evolutionary Stochastic Search for Bayesian model exploration","4282888":"Affordances, development and imitation","234155966":"Model averaging strategies for structure learning in Bayesian networks with limited data","2488937":"Towards an inclusion driven learning of Bayesian Networks","225621820":"Modelling non-stationary dynamic gene regulatory processes with the BGM model","273954330":"Bayesian Network Reconstruction Using Systems Genetics Data: Comparison of MCMC Methods","272244330":"Hierarchical Graphical Models with Application to Systemic Risk","227519453":"Design of follow‐up experiments for improving model discrimination and parameter estimation","237460595":"Supplementary paper on experimental aspects (E): Implementation details and supplementary figures for the article: Modelling non-stationary gene regulatory processes with a non-homogeneous Bayesian network and the allocation sampler","4902430":"A full-factor multivariate GARCH model","3297892":"Improving Bayesian Network Structure Learning with Mutual Information-Based Node Ordering in the K2 Algorithm","221860706":"Rejoinder: Bayesian Effect Estimation Accounting for Adjustment Uncertainty","241086467":"“Determinants of Yield Spreads in the Eurozone: A Bayesian Approach","2427515":"Efficient Model Determination for Discrete Graphical Models","38322216":"Markov bases for decomposable graphical models","46616742":"Mambo: Discovering Association Rules Based on Conditional Independencies","46538914":"Population-based reversible jump Markov chain Monte Carlo methods for Bayesian variable selection and evaluation under cost limit restrictions","228388856":"Shotgun Stochastic Search for “Large p ” Regression","226754533":"Regional Psychological Capital and Its Impact on Regional Entrepreneurship in Urban Areas of the US","235633772":"Bayesian Learning of Loglinear Models for Neural Connectivity","222551850":"Measuring the Health Effects of Air Pollution: To What Extent Can We Really Say that People Are Dying from Bad Air?","6395400":"Increasing the Power to Detect Causal Associations by Combining Genotypic and Expression Data in Segregating Populations","23743232":"Statistical Modeling of Fishing Activities in the North Atlantic","4022871":"Learning Bayesian network classifiers for facial expression recognition using Both Labeled And . . .","4746789":"Methods and Criteria for Model Selection","228667343":"An MCMC model search algorithm for regression problems","220451667":"Statistical Themes and Lessons for Data Mining","237799517":"MODELSELECTIONAND ACCOUNTINGFOR MODEL UNCERTAINTYIN LINEAR REGRESSIONMODELS","224053035":"Stitching together Multiple Data Dimensions Reveals Interacting Metabolomic and Transcriptomic Networks That Modulate Cell Regulation","220320595":"On Inclusion-Driven Learning of Bayesian Networks","243768565":"On the Relationship Between Markov chain Monte Carlo Methods for Model Uncertainty","220344145":"Learning the Structure of Dynamic Bayesian Networks from Time Series and Steady State Measurements","235794552":"Tradeoffs in Constructing and Evaluating Temporal Influence Diagrams","255616329":"Inferring Ecological Networks From Species Abundance Data","233866118":"Non-asymptotic confidence intervals for MCMC","257272098":"An interactive approach for Bayesian network learning using domain/expert knowledge","2497119":"Learning Bayesian Network Classifiers with Labeled and Unlabeled Data","278314732":"Model Averaging for Biological Networks with Prior Information","246340817":"Graphical model search via essential graphs","5140017":"Rough and Lonely Road to Prosperity: A Reexamination of the Sources of Growth in Africa Using Bayesian Model Averaging","232636322":"PROACT: An Ontology-Based Model of Privacy Policies in Ambient Intelligence Environments","51206540":"A Method for Integrating Expert Knowledge When Learning Bayesian Networks From Data","251528319":"Bayesian variable selection using a cost-penalised approach, with application to cost-eective measurement of quality of health care","261925151":"Happiness as a Driver of Risk-avoiding Behaviour: Theory and an Empirical Study of Seatbelt Wearing and Automobile Accidents","49739890":"Causal graphical models in systems genetics: A unified framework for joint inference of causal network and genetic architecture for correlated phenotypes","26286868":"Dobra, A.: Variable selection and dependency networks for genomewide data. Biostatistics 10, 621-639","229078816":"On efficient calculations for Bayesian variable selection","269038212":"The Psychology of Entrepreneurship and the Technological Frontier – a Spatial Eeconometric Analysis of Regional Entrepreneurship in the United States (Ph.D. dissertation, George Mason University)","2599593":"MCMC Methods for Computing Bayes Factors: A Comparative Review","268692112":"Explaining the Czech interbank market risk premium","2372273":"Bayesian Variable Selection and the Swendsen-Wang Algorithm","270603956":"Clustered Bayesian Model Averaging","276139744":"Bayesian network ensemble as a multivariate strategy to predict radiation pneumonitis risk","227359508":"The geography of output volatility. J Dev Econ","3450542":"Learning Object Affordances: From Sensory--Motor Coordination to Imitation","250236017":"Markov Chain Monte Carlo for Structural Inference with Prior Information","223861708":"Use of logistic regression for validation of maps of the spatial distribution of vegetation species derived from high spatial resolution hyperspectral remotely sensed data","24052724":"Nonparametric adaptive detection in fading channels based on sequential Monte Carlo and Bayesian model averaging","284044912":"Bank Lending Determinants of EU Countries: A Bayesian model averaging evidence","227463981":"An Analysis of the Impact of Research and Development on Productivity Using Bayesian Model Averaging with a Reversible Jump Algorithm","228578107":"Bayesian Networks for Genomic Analysis","254415246":"Early Warning Indicators of Crisis Incidence: Evidence from a Panel of 40 Developed Countries","4222695":"Using a Bayesian Posterior Density in the Design of Perturbation Experiments for Network Reconstruction","273706745":"Nicaragua: inflación de umbral, crecimiento económico y la nueva política monetaria después de la crisis internacional","220643212":"Bayesian learning of Bayesian networks with informative priors","222216085":"“Unraveling the Fortune of the Fortunate: An Iterative Bayesian Model Averaging (IBMA) Approach","257561073":"Dynamic Bayesian networks in molecular plant science: Inferring gene regulatory networks from multiple gene expression time series","224156654":"A regression tree-based Gibbs sampler to learn the regulation programs in a transcription regulatory module network","266497366":"ESSAYS ON IMPROVING THE ECONOMETRIC ESTIMATION OF WETLANDS VALUES VIA META","255597952":"Bayesian Model Averaging for Multiple Structural Change Models","229054235":"Determinantes del crecimiento a largo plazo: un enfoque de promedio bayesiano de estimaciones clásicas","224285598":"A Log-Linear Graphical Model for Inferring Genetic Networks from\nHigh-Throughput Sequencing Data","233259814":"A Criterion for Optimal Predictive Model Selection","268650178":"An introduction to MCMC","23502755":"Sparse combinatorial inference with an application in cancer biology","4741774":"Combining Linear Regression Models: When and How?","257310096":"Variable Selection for Nonparametric Gaussian Process Priors: Models and Computational Strategies","2583278":"Bayesian Variable and Transformation Selection in Linear Regression","233494305":"Efficient Approximations for the Marginal Likelihood of Bayesian Networks with Hidden Variables","2896615":"Model uncertainty. Stat Sci","225149862":"A Tutorial on Learning With Bayesian Networks","6970043":"Utility of Correlation Measures in Analysis of Gene Expression","23804857":"The FDI-Growth Nexus in Latin America: The Role of Source Countries and Local Conditions","2255606":"Error Reduction through Learning Multiple Descriptions","272479976":"Bayesian Graphical Models for STructural Vector Autoregressive Processes","5126808":"We Just Averaged Over Two Trillion Cross-Country Growth Regressions","228058945":"Bayesian structure learning using dynamic programming and MCMC","241111176":"PMH46 ADHERENCE RATES OF INJECTABLE VS. ORAL RISPERIDONE FOR PATIENTS WITH SCHIZOPHRENIA","271908590":"The Network Origins of Economic Growth","223686537":"Fault diagnosis for airplane engines using Bayesian networks and distributed particle swarm optimization","228256634":"Product Market Regulation: Extending the Analysis Beyond OECD Countries","254391755":"Bayesian structural learning and estimation in Gaussian graphical models","221529046":"Joint criterion for factor identification and parameter estimation","228448121":"Dissent voting behavior of central bankers: what do we really know?","228342650":"Initial conditions, and post-war growth in sub-Saharan Africa","24017801":"Forecasting U.S. Inflation by Bayesian Model Averaging","31327028":"Bayesian methods for estimation of the size of a closed population","223936435":"153 O - In vitro electromotive administration of mitomycin C in human bladder wall","222708653":"Benchmark priors for Bayesian Model Averaging. J Econom 100: 381-427","261920119":"Variable selection for Fisher linear discriminant analysis using the modified sequential backward selection algorithm for the microarray data","261741940":"Bayesian Regression Modeling with Interactions and Smooth Effects","257665455":"Computation for intrinsic variable selection in normal regression models via expected-posterior prior","250867716":"Evaluation of a cathodically precipitated aluminium hydroxide film at a hydrogen-sorbing palladium electrode as a humidity sensor","26902369":"Bayesian variable selection in clustering via dirichlet process mixture models","2738903":"Estimating Bayes Factors via Posterior Simulation With the Laplace-Metropolis Estimator","265153843":"BAYESIAN SEQUENTIAL LEARNING FROM INCOMPLETE DATA ON DECOMPOSABLE GRAPHICAL MODELS","2765525":"A Comparison of Methods for Learning and Combining Evidence From Multiple Models","4991821":"Returns to Schooling and Bayesian Model Averaging: A Union of Two Literatures","281646024":"Robust Determinants of OECD FDI in Developing Countries: Insights from Bayesian Model Averaging","42425732":"Determinants of investment distribution across Russian regions: a Bayesian averaging of classical estimates (BACE) method application","221404721":"Computing Posterior Probabilities of Structural Features in Bayesian Networks.","2358055":"ATutorial on Learning With Bayesian Networks","220694048":"Bioinformatics","265038020":"Bayesian Model Averaging with BMS","227332736":"MC4: A Tempering Algorithm for Large-Sample Network Inference","227349120":"BAYESIAN MODEL AVERAGING IN THE CONTEXT OF SPATIAL HEDONIC PRICING: AN APPLICATION TO FARMLAND VALUES","221617723":"Non-Stationary Dynamic Bayesian Networks","220270127":"Non-Stationary Continuous Dynamic Bayesian Networks","279386025":"Extensions of the Classical Linear Model","220286515":"On Bayesian model and variable selection using MCMC","283450358":"Probabilistic graphical models in modern social network analysis","227672710":"Bayesian graphical modelling: A case-study in monitoring health outcomes","6940541":"BIOINFORMATICS Comparative Evaluation of Reverse Engineering Gene Regulatory Networks with Relevance Networks, Graphical Gaussian Models and Bayesian Networks","259288160":"Bayesian transformation family selection: Moving toward a transformed Gaussian universe","237435184":"DETERMINANTS OF LONG-TERM GROWTH: A BAYESIAN AVERAGING OF CLASSICAL ESTIMATES (BACE) APPROACH ECONOMICS DEPARTMENT WORKING PAPERS NO. 266","247769554":"Power-Expected-Posterior Priors for Variable Selection in Gaussian Linear Models","227153554":"Bayesian Networks","225950317":"Accounting for Model Uncertainty in the Prediction of University Graduation Rates","4741972":"Bayesian Variable Selection in Clustering High-Dimensional Data","247769561":"Power-Conditional-Expected Priors: Using g-priors with Random Imaginary Data for Variable Selection","228597438":"Does air pollution cause respiratory illness? A new look at Canadian cities","221065741":"Gaussian Mixture Models for Affordance Learning using Bayesian Networks","277781418":"Uncovering distinct protein-network topologies in heterogeneous cell populations","238523666":"Causal analysis for troubleshooting and decision support system","223833713":"Inferring species interaction networks from species abundance data: A comparative evaluation of various statistical and machine learning methods","215721980":"Dynamic Bayesian Networks: Representation, Inference and Learning. Ph.D. thesis","281938921":"Leading indicators of financial stress: New evidence","12218262":"Neural Coding: Higher-Order Temporal Patterns in the Neurostatistics of Cell Assemblies","41139550":"Systems Analysis of EGF Receptor Signaling Dynamics with Micro-Western Arrays","271904517":"Combining Linear Regression Models: When and How?","261329056":"Uncertainty in Propensity Score Estimation: Bayesian Methods for Variable Selection and Model-Averaged Causal Effects","265087225":"REPORT OF THE SCIENTIFIC, TECHNICAL AND ECONOMIC COMMITTEE FOR FISHERIES (STECF) 2013 Assessment of Black Sea stocks (STECF 13-20)","4986746":"Markov Chain Monte Carlo Methods for Computing Bayes Factors: A Comparative Review","264870129":"Bayesian Methodology for Missing Data, Model Selection and Hierarchical Spatial Models with Application to Ecological Data","238717187":"FOCUS ON EUROPEAN ECONOMIC INTEGRATION","4747123":"Classical multilevel and Bayesian approaches to population size estimation using multiple lists","4744053":"Bayesian Wavelet Regression on Curves With Application to a Spectroscopic Calibration Problem","228825757":"Bayesian Models for Variable Selection that Incorporate Biological Information","23755349":"How to prioritise policies for poverty reduction: Applying Bayesian Model Averaging to Vietnam","284705735":"Bayesian Model Averaging Employing Fixed and Flexible Priors: The BMS Package for R","38012164":"Bayesian model selection using test statistics","270289756":"Integrative network analysis of TCGA data for ovarian cancer","282152849":"Inference of regulatory networks with a convergence improved MCMC sampler","221336179":"MCMC Based Bayesian Inference for Modeling Gene Networks","227649236":"Bayesian Model Averaging in Proprtional Hazard Models: Assessing the Risk of a Stroke","265727121":"Bayesian factors","241490211":"Advances in Artificial Intelligence - SBIA 2010","254287968":"Markov Chain Monte Carlo: 10 Years and Still Running!","4788993":"Labelled Graphical Models","220410475":"Distributional Smoothing in Bayesian Fault Diagnosis","254287969":"Empirical Bayes: Past, Present and Future","220320365":"Controlling the False Discovery Rate of the Association/Causality Structure Learned with the PC Algorithm.","227216070":"Spatial Econometric Model Averaging","228688622":"Improving Markov Chain Monte Carlo Model Search for Data Mining","4812569":"On time series model selection involving many candidate ARMA models","221775465":"Hierarchical Bayesian formulations for selecting variables in regression models","227360479":"The Role of Age-Structured Education Data for Economic Growth Forecasts","2460531":"A MCMC approach to Hierarchical Mixture Modelling","255577186":"BAYESIAN METHODS TO IMPUTE MISSING COVARIATES FOR CAUSAL INFERENCE AND MODEL SELECTION","5042988":"Global Inflation","2407238":"Bayesian Analysis For Simulation Input And Output","35231098":"Semisupervised learning of classifiers with application to human-computer interaction /","2301765":"Bayesian Graphical Models, Intention-to-Treat, and the Rubin Causal Model","239580460":"Global Ination","225174016":"MAMBO: Discovering Association Rules Based on Conditional Independencies","4901665":"Determinants of Long-Term Growth: A Bayesian Averaging of Classical Estimates (BACE) Approach","238112092":"Semi-supervised Learning of Classifiers: Theory, Algorith ms for Bayesian Network Classifiers and Application to Human-Comp uter Interaction","50195853":"Mining Protein Kinases Regulation Using Graphical Models","272480074":"Sparse Graphical Vector Autoregression: A Bayesian Approach","271932237":"Bayesian model averaging in longitudinal regression models with AR(1) errors with application to a myopia data set","265732264":"Model Uncertainty in Matrix Exponential Spatial Growth Regression Models","7009259":"Bayesian Graphical Models for Genomewide Association Studies","49762678":"A Bayesian Framework for Inference of the Genotype-Phenotype Map for Segregating Populations","23991020":"Learning Bayesian networks for discrete data","220286627":"Bayesian fractional polynomials","221369010":"Exploiting facial expressions for affective video summarisation","251574648":"A Bayesian feature selection paradigm for text classification","250826100":"ENHANCING THE PREDICTIVE PERFORMANCE OF BAYESIAN GRAPHICAL l\\IlODELS","250661239":"Categorical data squashing by combining factor levels","2370478":"Active Learning of Causal Bayes Net Structure","34539908":"Stochastic algorithms for learning with incomplete data : an application to Bayesian networks /","4165552":"Bayesian indoor positioning systems","2590647":"A Characterization of Markov Equivalence Classes for Acyclic Digraphs","267954282":"Applications of the Mode Oriented Stochastic Search (MOSS) Algorithm for Discrete Multi-way Data to Genomewide Studies","251733139":"Capillary gas chromatography–mass spectrometry of lower oxyethylenated aliphatic alcohols 1 Presented at the 10th International Symposium on Advances and Applications of Chromatography in Industry, Bratislava, June 30–July 4, 1996. 1","4743133":"Learning Causal Bayesian Network Structures From Experimental Data","252943492":"Spatial knowledge spillovers: a regional view of Germany","220554943":"Implicitly preserving semantics during incremental knowledge base acquisition under uncertainty","224943858":"Computing Posterior Probabilities of Structural Features in Bayesian\nNetworks","228310534":"Determinants of Foreign Direct Investment","247769445":"Bayesian Discovery of Multiple Bayesian Networks via Transfer Learning","254452873":"Intellectual Property Rights as Development Determinants","23961286":"What drives euro area break-even inflation rates?","43078975":"Learning Oncogenic Pathways from Binary Genomic Instability Data","223264480":"On the Determinants of Currency Crises: The Role of Model Uncertainty","235395496":"Learning the local Bayesian network structure around the ZNF217 oncogene in breast tumours","257940719":"Monte Carlo Methods in Bayesian Statistics","234412619":"Model Selection Approach for Distributed Fault Detection in Wireless\nSensor Networks","23266007":"Network Inference using Informative Priors","2474898":"Model Averaging with Discrete Bayesian Network Classifiers","6631389":"A graphical approach to relatedness inference","281599858":"Urbanization and Agricultural Structural Adjustments: Some Lessons from European Cities","8649528":"Bayesian model averaging in EEG/MEG imaging","266627160":"Elucidation of Pathways Driving Asthma Pathogenesis: Development of a Systems-Level Analytic Strategy","228659808":"Location estimation in wireless networks: A bayesian approach","46460160":"Consistent Estimation, Model Selection and Averaging of Dynamic Panel Data Models with Fixed Effect","8018879":"Bayesian Model Averaging: Development of an Improved Multi-Class, Gene Selection and Classification Tool for Microarray Data","227119692":"Chapter 7 Machine Learning Techniques for Face Analysis","228597350":"The Practical Implementation of Bayesian Model Selection","23690926":"In search of an environmental Kuznets curve in sulphur dioxide concentrations: A Bayesian model averaging approach","222143226":"Population heterogeneity and growth","220301030":"Parametrizations and reference priors for multinomial decomposable graphical models","237302253":"Statistical Applications in Genetics and Molecular Biology","239065590":"Input Distribution Selection for Simulation Experiments: Accounting for Input Uncertainty","258450606":"Reply to comment by Ming Ye et al. on “Inverse groundwater modeling for hydraulic conductivity estimation using Bayesian model averaging and variance window”","254281956":"Simplex Factor Models for Multivariate Unordered Categorical Data","51612867":"Quantitative utilization of prior biological knowledge in the Bayesian network modeling of gene expression data","257196165":"Bayesian variable selection in generalized linear models using a combination of stochastic optimization methods","278271811":"Bridging the information gap: small-scale nowcasting models of GDP growth for selected CESEE countries","267715618":"Utilizing Global Constraints in Regulatory Network Inference","225153724":"A Bayesian Approach to Causal Discovery","46443795":"Unpleasant surprises : sovereign default determinants and prospects","226027169":"Markov Chain Monte Carlo model selection for DAG models","263063668":"On Sampling Strategies in Bayesian Variable Selection Problems With Large Model Spaces","220836597":"Determining the Direction of Causal Influence in Large Probabilistic Networks: A Constraint-Based Approach.","228634180":"Dependency networks for genome-wide data","220460742":"Learning probabilistic classifiers for human–computer interaction applications","232278591":"Inference of Temporally Varying Bayesian Networks","46493999":"Sparse seemingly unrelated regression modelling: Applications in finance and econometrics","2130892":"The conjugate prior for discrete hierarchical log-linear models","220286675":"Preserving confidentiality of high-dimensional tabular data: Statistical and computational issues","24128133":"Adaptive Learning, Model Uncertainty and Monetary Policy Inertia in a Large Information Environment","220320471":"Model Averaging for Prediction with Discrete Bayesian Networks.","4309945":"Facial Expression Recognition: A Fully Integrated Approach","254392531":"Selecting predictors by Bayesian model averaging in bridge models","1741792":"A conjugate prior for discrete hierarchical log-linear models","284013334":"Systemic event prediction by an aggregate early warning system: An application to the Czech Republic","34044411":"Three essays on the determinants of economic growth /","228392547":"Lecture 6: Matrix Exponential Spatial models","46511418":"Should Legal Empiricists Go Bayesian?"},"index":148}