{"abs":"Metropolis algorithms for approximate sampling of probability measures on infinite dimensional Hilbert spaces are considered and a generalization of the preconditioned Crank-Nicolson (pCN) proposal is introduced. The new proposal is able to incorporate information of the measure of interest. A numerical simulation of a Bayesian inverse problem indicates that a Metropolis algorithm with such a proposal performs independent of the state space dimension and the variance of the observational noise. Moreover, a qualitative convergence result is provided by a comparison argument for spectral gaps. In particular, it is shown that the generalization inherits geometric ergodicity from the Metropolis algorithm with pCN proposal.","title":"On a generalization of the preconditioned Crank-Nicolson Metropolis algorithm","id":275055333,"url":"https://www.researchgate.net/publication/275055333_On_a_generalization_of_the_preconditioned_Crank-Nicolson_Metropolis_algorithm","names":["Daniel Rudolf","Björn Sprungk"],"references":{"239546247":"MCMC methods for diffusion bridges","51931128":"Explicit error bounds for Markov chain Monte Carlo","38357609":"Markov Chains for Exploring Posterior Distributions","221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","268227549":"Dimension-independent likelihood-informed MCMC","230872806":"Linear Operators, Part I: General Theory","264623874":"Algorithms for Kullback-Leibler Approximation of Probability Measures in Infinite Dimensions","233937081":"Positivity of hit-and-run and related algorithms","243052917":"On Majorization, Factorization, and Range Inclusion of Operators on Hilbert Space","245481576":"Inverse problems: A Bayesian perspective","38329826":"Central limit theorem for additive functionals of reversible Markov processes and applications to simple exclusion, Commun. Math. Phys. 106, 1-19","226284214":"Linear estimators and measurable linear transformations on a Hilbert space","247460724":"Second order partial differential equations in Hilbert spaces","245588111":"Bounds on the L2 spectrum for Markov chains and Markov processes: A generalization of Cheeger\u0027s inequality","45863924":"An Introduction to Stochastic PDEs","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","267473441":"A Stochastic Newton MCMC Method for Large-Scale Statistical Inverse Problems with Application to Seismic Inversion","248765575":"Spectrum of the Product of Operators","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","2842974":"Geometric Ergodicity and Hybrid Markov Chains","51969792":"Spectral Gaps for a Metropolis-Hastings Algorithm in Infinite Dimensions","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","267124979":"Proposals which speed up function-space MCMC"},"citedIn":{},"index":162}