{"abs":"We study a method (Extra Chance Generalized Hybrid Monte Carlo) to avoid rejections in the Hybrid Monte Carlo (HMC) method and related algorithms. In the spirit of delayed rejection, whenever a rejection would occur, extra work is done to find a fresh proposal that, hopefully, may be accepted. We present experiments that clearly indicate that the additional work per sample carried out in the extra chance approach clearly pays in terms of the quality of the samples generated.","title":"Extra Chance Hybrid Monte Carlo","id":264385539,"url":"https://www.researchgate.net/publication/264385539_Extra_Chance_Hybrid_Monte_Carlo","names":["Cédric M. Campos","J. M. Sanz-Serna","Journal of Computational Physics"],"references":{"222018937":"Hybrid Monte Carlo","2503712":"On Metropolis-Hastings algorithms with delayed rejection","265852818":"Hamiltonian Monte Carlo Without Detailed Balance","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","227423874":"Hybrid Monte Carlo on Hilbert spaces","41713393":"Theoretical and numerical comparison of some sampling methods for molecular dynamics. Esaim Math. Model. Numer. Anal. 41, 351-389","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","2369980":"Delayed Rejection in Reversible Jump Metropolis-Hastings","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","200175478":"Simulating Hamiltonian Dynamics","233899753":"Reducing the effect of Metropolization on mixing times in molecular dynamics simulations","262192443":"Compressible Generalized Hybrid Monte Carlo","200175474":"Numerical Hamiltonian Problem","262986800":"Numerical Integrators for the Hybrid Monte Carlo Method","265317902":"Markov Chain Monte Carlo and Numerical Differential Equations","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","239667563":"Molecular Modeling: An Interdisciplinary Guide","220206595":"Erratum to \"A comparison of generalized hybrid Monte Carlo methods with and without momentum flip\" [J. Comput. Phys. 228 (2009) 2256-2265] (DOI:10.1016/j.jcp.2008.12.014)","268209561":"M Carlo Statistical Methods","222298073":"Cost of the generalized hybrid Monte Carlo algorithm for free field theory. Nucl. Phys. B 607, 456","51956659":"The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian\nMonte Carlo","225291078":"MCMC using Hamiltonian dynamics","222821802":"A comparison of generalized hybrid Monte Carlo methods with and without momentum flip","246864219":"Molecular dynamics of liquid alkanes","265590564":"Geometric Numerical Integration: Structure-Preserving Algorithm for Ordinary Differential Equations","266991325":"Free Energy Computations: A Mathematical Perspective","5127609":"On Metropolis-Hastings algorithms with delayed rejection","262302298":"Numerical integrators for the Hybrid Monte Carlo method","236572321":"Computationally Efficient Molecular Dynamics Integrators with Improved Sampling Accuracy","222672316":"Shadow hybrid Monte Carlo: An efficient propagator in phase space of macromolecules. J. Comput. Phys. 200, 581-604","29522811":"A generalized guided Monte Carlo algorithm","222702204":"GSHMC: An efficient method for molecular simulations. J. Comput. Phys. 227, 4934-4954"},"citedIn":{"281808439":"A Markov Jump Process for More Efficient Hamiltonian Monte Carlo","287405758":"Hamiltonian Monte Carlo and Borrowing Strength in Hierarchical Inverse Problems"},"index":165}