{"abs":"In this technical note we derive two MCMC (Markov Chain Monte Carlo) samplers for dynamic causal models (DCMs). Specifically, we use (a) Hamiltonian MCMC (HMC-E) where sampling is simulated using Hamilton\u0027s equation of motion and (b) Langevin Monte Carlo algorithm (LMC-R and LMC-E) that simulates the Langevin diffusion of samples using gradients either on a Euclidean (E) or on a Riemannian (R) manifold. Whilst LMC-R requires minimal tuning, the implementation of HMC-E is heavily dependent on its tuning parameters. These parameters are therefore optimised by learning a Gaussian Process model of the time normalised sample correlation matrix. This allows one to formulate an objective function that balances tuning parameter exploration and exploitation, furnishing an intervention-free inference scheme. Using, neural mass models (NMMs) - a class of biophysically motivated DCMs - we find that HMC-E is statistically more efficient than LMC-R (with a Riemannian metric); yet both gradient-based samplers are far superior to the random walk Metropolis algorithm, which proves inadequate to steer away from dynamical instability. Copyright © 2015. Published by Elsevier Inc.","title":"Gradient-based MCMC samplers for Dynamic Causal Modelling","id":280496847,"url":"https://www.researchgate.net/publication/280496847_Gradient-based_MCMC_samplers_for_Dynamic_Causal_Modelling","names":["Biswa Sengupta","Karl J Friston","William Penny","NeuroImage"],"references":{"243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","256498632":"Langevin diffusions and the Metropolis-adjusted Langevin algorithm","6739682":"Variational free energy and the Laplace approximation. NeuroImage","7149160":"Mechanisms of evoked and induced responses in MEG/EEG","5957852":"A Metropolis–Hastings algorithm for dynamic causal models","13255490":"Replica Monte Carlo Simulation of Spin-Glasses","10588329":"Dynamic Causal Modeling","236736791":"A Stochastic Approximation Method","7254882":"Computing Bayes Factors Using Thermodynamic Integration","228280215":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","49458431":"A tutorial on adaptive MCMC","41428087":"Statistically optimal perception and learning: From behavior to neural representations","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","38363224":"Inference From Iterative Simulation Using Multiple Sequences","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","247011232":"On Markov Chain Monte Carlo Acceleration","4772437":"Marginal likelihood estimation via power posteriors","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","261919796":"Efficient Gradient Computation for Dynamical Models.","38363235":"[Practical Markov Chain Monte Carlo]: Rejoinder","26877233":"INVITED ARTICLE Parallel tempering: Theory, applications, and new perspectives","51956659":"The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian\nMonte Carlo","225291078":"MCMC using Hamiltonian dynamics","229157636":"Convergence and asymptotic normality of variational Bayesian\napproximations for exponential family models with missing values","38326887":"Simulating Normalizing Constants: From Importance Sampling to Bridge Sampling to Path Sampling","261289021":"Information-Geometric Markov Chain Monte Carlo Methods Using Diffusions","3985167":"Combining source transformation and operator overloading techniques to compute derivatives for MATLAB programs","236736808":"Stochastic Approximation Algorithms and Recursive Algorithms and Applications","224269799":"Why natural gradient?","239582331":"Stochastic Relaxation, Gibbs Distributions and the Bayesian Resoration of Images","38322292":"An Adaptive Metropolis Algorithm","221345649":"Gaussian Process Optimization in the Bandit Setting: No Regret and Experimental Design","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","222018937":"Hybrid Monte Carlo","234862389":"Smart Darting Monte Carlo","273703579":"Gradient-free MCMC Methods for Dynamic Causal Modelling.","248252416":"User Documentation for CVODES: An ODE Solver with Sensitivity Analysis Capabilities","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","46494228":"Estimating Bayes factor via thermodynamic integration and population MCMC","220343668":"Population Markov Chain Monte Carlo","252106974":"Reducing quasi-ergodic behavior in Monte Carlo simulations by J-walking: Applications to atomic clusters","235216606":"Geodesic Monte Carlo on Embedded Manifolds","243773529":"Markov chain Monte Carlo Maximum Likelihood","200111118":"Markov Chains and Stochastic Stability","243553632":"Using the SIR algorithm to simulate posterior distributions","247442902":"Introduction To Algorithms","38373539":"Exponential Convergence of Langevin Distributions and Their Discrete Approximations","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","220286671":"On population-based simulation for static inference","230873264":"Numerical Optimization Second Edition","241638164":"Information-Theoretic Regret Bounds for Gaussian Process Optimization in the Bandit Setting","220695762":"InformationTheory, Inference, and Learning Algorithms","26646883":"Dynamic Causal Models for phase coupling","240314028":"The Imbedding Problem for Riemannian Manifolds","220416605":"Graphical Models, Exponential Families, and Variational Inference"},"citedIn":{"283330945":"A differential evolution-based approach for fitting a nonlinear biophysical model to fMRI BOLD data","280587872":"Dynamic Causal Modelling of Electrographic Seizure Activity using Bayesian Belief Updating"},"index":171}