{"abs":"A Bayesian statistical model is developed for analysis of the time-evolving properties of infectious disease, with a particular focus on viruses. The model employs a latent semi-Markovian state process, and the state-transition statistics are driven by three terms: (i) a general time-evolving trend of the overall population, (ii) a semi-periodic term that accounts for effects caused by the days of the week, and (iii) a regression term that relates the probability of infection to covariates (here, specifically, to the Google Flu Trends data). Computations are performed using Markov Chain Monte Carlo sampling. Results are presented using a novel data set: daily self-reported symptom scores from hundreds of Duke University undergraduate students, collected over three academic years. The illnesses associated with these students are (imperfectly) labeled using real-time (RT) polymerase chain reaction (PCR) testing for several viruses, and gene-expression data were also analyzed. The statistical analysis is performed on the daily, self-reported symptom scores, and the RT PCR and gene-expression data are employed for analysis and interpretation of the model results.","title":"Bayesian modeling of temporal properties of infectious disease in a college student population","id":263685123,"url":"https://www.researchgate.net/publication/263685123_Bayesian_modeling_of_temporal_properties_of_infectious_disease_in_a_college_student_population","names":["Zhengming Xing","Bradley Nicholson","Monica Jimenez","Timothy Veldman","Lori L Hudson","Joseph Lucas","Journal of Applied Statistics"],"references":{"232275992":"Graph-Coupled HMMs for Modeling the Spread of Infection","222821252":"Modeling individual differences using Dirichlet processes","51824146":"In China, Students in Crowded Dormitories with a Low Ventilation Rate Have More Common Colds: Evidence for Airborne Transmission","49739891":"High-Dimensional Sparse Factor Modeling: Applications in Gene Expression Genomics","51724575":"A Framework for the Joint Modeling of Longitudinal Diagnostic Outcome Data and Latent Infection Status: Application to Investigating the Temporal Relationship between Infection and Disease","224877047":"Bayesian modeling to unmask and predict influenza A/H1N1pdm dynamics in London","24233248":"Does Influenza Transmission Occur from Asymptomatic Infection or Prior to Symptom Onset?","51031324":"Modeling Competing Infectious Pathogens From a Bayesian Perspective: Application to Influenza Studies With Incomplete Laboratory Results","227113488":"Bayesian inference of the number of factors in gene-expression analysis: Application to human virus challenge studies","26726861":"Gene Expression Signatures Diagnose Influenza and Other Symptomatic Respiratory Viral Infections in Humans","235926677":"Bayesian Forecasting and Dynamic Linear Models","26245771":"Geographic Dependence, Surveillance, and Origins of the 2009 Influenza A (H1N1) Virus","228533572":"Collaborative Filtering Ensemble for Ranking","236909443":"Predicting Viral Infection From High-Dimensional Biomarker Trajectories","23484549":"Detecting Influenza Epidemics Using Search Engine Query Data","4920047":"Exact Bayesian Inference and Model Selection for Stochastic Models of Epidemics Among a Community of Households","8211096":"A Bayesian MCMC approach to study transmission of Influenza: application to household longitudinal data","241770625":"Active learning for online bayesian matrix factorization","6013170":"Infections in Confined Spaces: Cruise Ships, Military Barracks, and College Dormitories","8373842":"Bayesian Multivariate Logistic Regression","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","222413297":"A hidden semi-Markov model with missing data and multiple observation sequences for mobility tracking","254281820":"Tracking Epidemics with Google Flu Trends Data and a State-Space SEIR Model","230718197":"Introduction to Modern Virology, 6th Edition","259345679":"The mathematics of infectious diseases. SIAM Rev","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","51760169":"Bayesian modeling to unmask and predict influenza A/H1N1pdm dynamics in London","280757570":"The Mathematics of Infectious Diseases"},"citedIn":{},"index":173}