{"abs":"In spite of the recent surge of interest in quantile regression, joint estimation of linear quantile planes remains a great challenge in statistics and econometrics. We propose a novel parametrization that characterizes any collection of non-crossing quantile planes over arbitrarily shaped convex predictor domains in any dimension by means of unconstrained scalar, vector and function valued parameters. Statistical models based on this parametrization inherit a fast computation of the likelihood function, enabling penalized likelihood or Bayesian approaches to model fitting. We introduce a complete Bayesian methodology by using Gaussian process prior distributions on the function valued parameters and develop a robust and efficient Markov chain Monte Carlo parameter estimation. The resulting method is shown to offer posterior consistency under mild tail and regularity conditions. We present several illustrative examples where the new method is compared against existing approaches and is found to offer better accuracy, coverage and model fit.","title":"Joint estimation of quantile planes over arbitrary predictor spaces","id":280050382,"url":"https://www.researchgate.net/publication/280050382_Joint_estimation_of_quantile_planes_over_arbitrary_predictor_spaces","names":["Yun Yang","Surya Tokdar"],"references":{"228737569":"Towards a Faster Implementation of Density Estimation With Logistic Gaussian Process Priors","26808285":"Gaussian predictive process models for large spatial data sets","51028559":"DPpackage: Bayesian Semi- and Nonparametric Modeling in R","2762543":"Adaptive proposal distribution for random walk Metropolis algorithm. Comput Stat","26539039":"Censored Quantile Regression Redux","235787078":"Bayesian Spatial Quantile Regression","51690456":"Exploratory Quantile Regression With Many Covariates An Application to Adverse Birth Outcomes","49458431":"A tutorial on adaptive MCMC","247598156":"Sparse Gaussian Process Using Pseudo-inputs","222559058":"Posterior consistency of logistic Gaussian process priors in density estimation","254212148":"Simultaneous Linear Quantile Regression: A Semiparametric Bayesian Approach","4746782":"An ANOVA model for dependent random measures","4998548":"Quantile And Probability Curves Without Crossing","229438641":"Noncrossing Quantile Regression Curve Estimation","24404331":"Partially linear censored quantile regression","238724762":"Some Aspects of the Spline Smoothing Approach to Non-Parametric Regression Curve Fitting","254329416":"Influences of Spatial and Temporal Variation on Fish-Habitat Relationships Defined by Regression Quantiles","247312156":"Quantile Curves Without Crossing","24054861":"The effects of demographics and maternal behavior on the distribution of birth outcomes","31179896":"DETERMINANTS OF PLASMA LEVELS OF BETA-CAROTENE AND RETINOL","220019832":"Regression Quantiles","23233989":"The Increasing Intensity of the Strongest Tropical Cyclones","228634120":"Approximate Bayesian inference for quantiles","51213156":"New efficient estimation and variable selection methods for semiparametric varying-coefficient partially linear models","238874769":"Proper Likelihoods for Bayesian Analysis","254286941":"The Logistic Normal Distribution for Bayesian, Nonparametric, Predictive Densities","234824902":"Applied Survival Analysis. Regression Modeling of Time-To-Event Data"},"citedIn":{},"index":174}