{"abs":"We consider a Metropolis-Hastings method with proposal kernel $\\mathcal{N}(x,hG^{-1}(x))$, where $x$ is the current state. After discussing specific cases from the literature, we analyse the ergodicity properties of the resulting Markov chains. In one dimension we find that suitable choice of $G^{-1}(x)$ can change the ergodicity properties compared to the Random Walk Metropolis case $\\mathcal{N}(x,h\\Sigma)$, either for the better or worse. In higher dimensions we use a specific example to show that judicious choice of $G^{-1}(x)$ can produce a chain which will converge at a geometric rate to its limiting distribution when probability concentrates on an ever narrower ridge as $|x|$ grows, something which is not true for the Random Walk Metropolis.","title":"Geometric ergodicity of the Random Walk Metropolis with position-dependent proposal covariance","id":280330526,"url":"https://www.researchgate.net/publication/280330526_Geometric_ergodicity_of_the_Random_Walk_Metropolis_with_position-dependent_proposal_covariance","names":["Samuel Livingstone"],"references":{"256498632":"Langevin diffusions and the Metropolis-adjusted Langevin algorithm","200105001":"Equation of State by Fast Computing Machines","38326862":"Honest Exploration of Intractable Probability Distributions Via Markov Chain Monte Carlo","4920066":"Convergence of Heavy-tailed Monte Carlo Markov Chain Algorithms","38322179":"Necessary conditions for geometric and polynomial ergodicity of random walk-type Markov chains","49458431":"A tutorial on adaptive MCMC","2131950":"On the ergodic properties of some adaptive MCMC algorithms","51912840":"Nonasymptotic bounds on the estimation error of MCMC algorithms","45935852":"Non-asymptotic mixing of the MALA algorithm","47843593":"The Random Walk Metropolis: Linking Theory and Practice Through a Case Study","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","233937258":"A General Metric for Riemannian Manifold Hamiltonian Monte Carlo","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","261065488":"Noisy Monte Carlo: Convergence of Markov chains with approximate transition kernels","274094454":"Stability of Noisy Metropolis-Hastings","38357609":"Markov Chains for Exploring Posterior Distributions","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","260003291":"Non-reversible Metropolis-Hastings","2111878":"General state space Markov chains and MCMC algorithms","228789130":"Examples of adaptive MCMC","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","261289021":"Information-Geometric Markov Chain Monte Carlo Methods Using Diffusions","226460107":"Langevin Diffusions and Metropolis-Hastings Algorithms","2842974":"Geometric Ergodicity and Hybrid Markov Chains","250613960":"Kernel Adaptive Metropolis-Hastings","265617070":"Handbook of Markov Chain Monte Carlo"},"citedIn":{},"index":181}