{"abs":"Many Bayesian inference problems require exploring the posterior distribution of high-dimensional parameters that represent the discretization of an underlying function. This work introduces a family of Markov chain Monte Carlo (MCMC) samplers that can adapt to the particular structure of a posterior distribution over functions. Two distinct lines of research intersect in the methods developed here. First, we introduce a general class of operator-weighted proposal distributions that are well defined on function space, such that the performance of the resulting MCMC samplers is independent of the discretization of the function. Second, by exploiting local Hessian information and any associated low-dimensional structure in the change from prior to posterior distributions, we develop an inhomogeneous discretization scheme for the Langevin stochastic differential equation that yields operator-weighted proposals adapted to the non-Gaussian structure of the posterior. The resulting dimension-independent, likelihood-informed (DILI) MCMC samplers may be useful for a large class of high-dimensional problems where the target probability measure has a density with respect to a Gaussian reference measure. Two nonlinear inverse problems are used to demonstrate the efficiency of these DILI samplers: an elliptic PDE coefficient inverse problem and path reconstruction in a conditioned diffusion.","title":"Dimension-independent likelihood-informed MCMC","id":268227549,"url":"https://www.researchgate.net/publication/268227549_Dimension-independent_likelihood-informed_MCMC","names":["Tiangang Cui","Kody Law","Youssef M Marzouk","Journal of Computational Physics"],"references":{"221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","227522317":"Particle Markov Chain Monte Carlo . . .","263930303":"Optimal Low-rank Approximations of Bayesian Linear Inverse Problems","268337266":"Uncertainty Quantification with Experimental Data and Complex System Models","4772293":"Exact and computationally efficient likelihood-based estimation for discretely observed diffusion processes","2453431":"A Sequential Particle Filter Method for Static Models","261253638":"A Stable Manifold MCMC Method for High Dimensions","261462658":"Extreme-scale UQ for Bayesian inverse problems governed by PDEs","1737229":"On the Ergodicity of the Adaptive Metropolis Algorithm on Unbounded Domains","51969792":"Spectral Gaps for a Metropolis-Hastings Algorithm in Infinite Dimensions","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","220116484":"Finding Structure with Randomness: Probabilistic Algorithms for Constructing Approximate Matrix Decompositions","229065916":"Complexity Analysis of Accelerated MCMC Methods for Bayesian Inversion","51991941":"Inverse Problem Theory and Model Parameter Estimation","267124979":"Proposals which speed up function-space MCMC","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","51992376":"Fast Algorithms for Bayesian Uncertainty Quantification in Large-Scale Linear Inverse Problems Based on Low-Rank Partial Hessian Approximations","246546576":"MAP Estimators and Their Consistency in Bayesian Nonparametric Inverse Problems","243104985":"Coupling and ergodicity of adaptive Markov chain Monte Carlo algorithms. J Appl Probab","227375782":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods","256187243":"A Computational Framework for Infinite-Dimensional Bayesian Inverse Problems, Part II: Stochastic Newton MCMC with Application to Ice Sheet Flow Inverse Problems","221304578":"Lecture Notes in Computer Science","226460107":"Langevin Diffusions and Metropolis-Hastings Algorithms","38322292":"An Adaptive Metropolis Algorithm","239546247":"MCMC methods for diffusion bridges","200105001":"Equation of State by Fast Computing Machines","245481576":"Inverse problems: A Bayesian perspective","50235701":"Optimal scaling and diffusion limits for the Langevin algorithm in high dimensions. Ann. Appl. Probab. 22, 2320-2356","224381459":"Weighted Subspace Distance and Its Applications to Object Recognition and Retrieval With Image Sets","2131950":"On the ergodic properties of some adaptive MCMC algorithms","288518652":"Discussion of \"representations of knowledge in complex systems\" by U. Grenander and I.M. Miller","267473441":"A Stochastic Newton MCMC Method for Large-Scale Statistical Inverse Problems with Application to Seismic Inversion","255484907":"A Computational Framework for Infinite-Dimensional Bayesian Inverse Problems Part I: The Linearized Case, with Application to Global Seismic Inversion","45907693":"Diffusion limits of the random walk Metropolis algorithm in high dimensions authors. Ann. Appl. Probab. 22, 881-930","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","24111924":"An Adaptive Version for the Metropolis Adjusted Langevin Algorithm with a Truncated Drift","246868205":"Monte Carlo sampling using Markov chains and their applications","220244349":"Multilevel Monte Carlo Path Simulation","241475584":"Signal Processing Problems on Function Space: Bayesian Formulation, Stochastic PDEs and Effective MCMC Methods","236124661":"Erratum: Active Subspace Methods in Theory and Practice: Applications to Kriging Surfaces","2608590":"A Metric for Covariance Matrices","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","282494905":"Optimal scaling of discrete approximations to Langevin diffusions","5791016":"Randomized algorithms for the low-rank approximation of matrices","251232649":"Sequential Monte Carlo Methods for High-Dimensional Inverse Problems: A Case Study for the Navier--Stokes Equations","258211729":"A Hierarchical Multilevel Markov Chain Monte Carlo Algorithm with Applications to Uncertainty Quantification in Subsurface Flow","260946552":"Likelihood-informed dimension reduction for nonlinear inverse problems","285364218":"Biometrika","4993330":"Sequential Monte Carlo Samplers","261805284":"Mathematical Modeling of Reaction and Diffusion Systems in a Cell Including Surface Reactions on the Cytoplasmic Membranes"},"citedIn":{"275055333":"On a generalization of the preconditioned Crank-Nicolson Metropolis algorithm","283117906":"Scalable posterior approximations for large-scale Bayesian inverse problems via likelihood-informed parameter and state reduction","280538651":"A multiscale strategy for Bayesian inference using transport maps","263930303":"Optimal Low-rank Approximations of Bayesian Linear Inverse Problems","280946496":"An adaptive independence sampler MCMC algorithm for infinite-dimensional bayesian inference","278733347":"Accelerated dimension-independent adaptive Metropolis"},"index":183}