{"abs":"SUMMARY We consider the speciflcation of prior distributions for Bayesian model comparison, focusing on regression-type models. We propose a particular joint speciflcation of the prior distribution across models so that sensitivity of posterior model probabilities to the dispersion of prior distributions for the parameters of individual models (Lindley\u0027s paradox) is diminished. We illustrate the behavior of inferential and predictive posterior quantities in linear and log-linear regressions under our proposed prior densities with a series of simulated and real data examples.","title":"Speciflcation of prior distributions under model uncertainty","id":241606685,"url":"https://www.researchgate.net/publication/241606685_Speciflcation_of_prior_distributions_under_model_uncertainty","names":["Petros Dellaportas","Jonathan J. Forster","Ioannis Ntzoufras"],"references":{"2592036":"Strategies for Graphical Model Selection","2639852":"Bayesian Information Criterion for Censored Survival Models","31102556":"On the Posterior Odds of Time Series Models","228597350":"The Practical Implementation of Bayesian Model Selection","5664592":"Misinformation in the conjugate prior for the linear model with implications for freeknot spline modelling","243770509":"Model Determination using Sampling-based Methods","2429870":"Predictive Specification of Prior Model Probabilities in Variable Selection","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","268242674":"A note on Jeffreys-Lindley paradox","4771800":"Introduction to Linear Regression Analysis","243081582":"A Statistical Paradox","268844179":"An Alternative to the Standard Bayesian Procedure for Discrimination Between Normal Linear Models","38358303":"‘Estimating the Dimension of A Model,’","243081761":"A Comment on D. V. Lindley\u0027s Statistical Paradox","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","4725224":"Benchmark Priors for Bayesian Model Averaging","239667245":"Asymptotics in Bayesian Computation","228388856":"Shotgun Stochastic Search for “Large p ” Regression","243768225":"A Predictive Approach to Model Selection","2419011":"Predictive Model Selection","19923545":"Incorporating Prior Information into the Analysis of Contingency Tables","4771939":"Prior Elicitation, Variable Selection and Bayesian Computation for Logistic Regression Models","222708653":"Benchmark priors for Bayesian Model Averaging. J Econom 100: 381-427","243767402":"A comment on D","4746789":"Methods and Criteria for Model Selection","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","38357625":"The Risk Inflation Criterion for Multiple Regression","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","222525109":"Prior elicitation for model selection an estimation in generalized linear mixed models","2813202":"Bayesian Variable Selection with Related Predictors","225241873":"Kohn R, Smith M, Chan D. Nonparametric regression using linear combinations of basis functions. Stat Comput 11: 313-322","4743606":"Clyde MA„ Berger JO: Mixtures of g priors for Bayesian variable selection","225106197":"Posterior Odds Ratios for Selected Regression Hypotheses"},"citedIn":{},"index":185}