{"abs":"We describe a novel stochastic search algorithm for rapidly identifying regions of high posterior probability in the space of decomposable, graphical and hierarchical log-linear models. Our approach is based on the Diaconis–Ylvisaker conjugate prior for log-linear parameters. We discuss the computation of Bayes factors through Laplace approximations and the Bayesian iterative proportional fitting algorithm for sampling model parameters. We use our model determination approach in a sparse eight-way contingency table.","title":"The mode oriented stochastic search (MOSS) algorithm for log-linear models with conjugate priors","id":222410157,"url":"https://www.researchgate.net/publication/222410157_The_mode_oriented_stochastic_search_MOSS_algorithm_for_log-linear_models_with_conjugate_priors","names":["Adrian Dobra","Hélène Massam","Statistical Methodology"],"references":{"243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","229708918":"Model Uncertainty","265576028":"Algebraic and Geometric Methods in Statistics","24056230":"Graphical models in applied multivariate statistics","2896615":"Model uncertainty. Stat Sci","38358405":"Conjugate Priors for Exponential Families","254287396":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","37795917":"Three centuries of categorical data analysis: Log-linear models and maximum likelihood estimation","38359812":"Hyper Markov Laws in the Statistical Analysis of Decomposable Graphical Models","242219936":"Disclosure Limitation Methods Based on Bounds for Large Contingency Tables With Applications to Disability","51233247":"Describing disability through individual-level mixture models for multivariate binary data","264933916":"Categorical Data Analysis 2nd Edn","40933482":"Discrete Multivariate Analysis: Theory and Practice","4996626":"Functionally Compatible Local Characteristics for the Local Specification of Priors in Graphical Models","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","38358998":"Additive and Multiplicative Models and Interactions","237127741":"Discretization and MCMC Convergence Assessment","38327063":"Experiments in Stochastic Computation for High-Dimensional Graphical Models","238830243":"Inaugural Article: Bounds for cell entries in contingency tables given marginal totals and decomposable graphs","4788843":"Independence Structure of Natural Conjugate Densities to Exponential Families and the Gibbs\u0027 Sampler","265461425":"Categorial Data Analysis","26717236":"Log-Linear Models for Gene Association","228388856":"Shotgun Stochastic Search for “Large p ” Regression","2867469":"Bayesian Graphical Models for Discrete Data","19923545":"Incorporating Prior Information into the Analysis of Contingency Tables","222665452":"Three centuries of categorical data analysis: Log-linear models and maximum likelihood estimation","31327028":"Bayesian methods for estimation of the size of a closed population","257701431":"Shotgun stochastic search in regression with many predictors","2130892":"The conjugate prior for discrete hierarchical log-linear models","4993312":"Model determination for categorical data with factor level merging","240967280":"MCMC model determination for discrete graphical models","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","38348281":"Prior induction in log-linear models for general contingency table analysis","237706202":"Model selection for categorical data with factor level merging Scelta del modello per dati categoriali attraverso l\u0027aggregazione di livelli di fattori","233896194":"Analysis of Incomplete Data","243768565":"On the Relationship Between Markov chain Monte Carlo Methods for Model Uncertainty","2612499":"Bayesian Model Averaging for Linear Regression Models","224839698":"Discrete Mutivariate Analysis: Theory and Practice","266861393":"Discrete multivariate analysis. Theory and practice. With the collaboration of Richard J. Light and Frederick Mosteller. Reprint of the 1975 edition","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","5285799":"Categorical data analysis","1741792":"A conjugate prior for discrete hierarchical log-linear models","1766310":"Maximum Likelihood Estimation in Latent Class Models For Contingency Table Data","239038211":"A Fast Procedure for Model Search in Multidimensional Contingency Tables","51999462":"Graphical Models in Applied Multivariate Statistics. John Wiley, Chichester"},"citedIn":{"51888277":"Maximum likelihood estimation in log-linear models","267954282":"Applications of the Mode Oriented Stochastic Search (MOSS) Algorithm for Discrete Multi-way Data to Genomewide Studies","290623121":"Exploring dependence between categorical variables: Benefits and limitations of using variable selection within Bayesian clustering in relation to log-linear modelling with interaction terms","51930061":"Copula Gaussian graphical models and their application to modeling functional disability data","220320134":"Convex Structure Learning in Log-Linear Models: Beyond Pairwise Potentials.","259933638":"On the utility of the Dirichlet process for linear model determination: application to graphical log-linear model determination","1741792":"A conjugate prior for discrete hierarchical log-linear models","254281956":"Simplex Factor Models for Multivariate Unordered Categorical Data","224871912":"Marginally Specified Priors for Nonparametric Bayesian Estimation"},"index":188}