{"abs":"Under mild conditions, the Pareto front (Pareto set) of a continuous m-objective optimization problem forms an (m−1)-dimensional piecewise continuous manifold. Based on this property, this paper proposes a self-organizing multiobjective evolutionary algorithm. At each generation, a self-organizing mapping method with (m − 1) latent variables is applied to establish the neighborhood relationship among current solutions. A solution is only allowed to mate with its neighboring solutions to generate a new solution. To reduce the computational overhead, the self-organizing training step and the evolution step are conducted in an alternative manner. In other words, the self-organizing training is performed only one single step at each generation. The proposed algorithm has been applied to a number of test instances, and compared with some state-of the-art multiobjective evolutionary methods. The results have demonstrated its advantages over other approaches.","title":"A Self-Organizing Multiobjective Evolutionary Algorithm","id":291337172,"url":"https://www.researchgate.net/publication/291337172_A_Self-Organizing_Multiobjective_Evolutionary_Algorithm","names":["Hu Zhang","Aimin Zhou","Hu Zhang","Qingfu Zhang","Xiao-Zhi Gao","Jun Zhang","IEEE Transactions on Evolutionary Computation"],"references":{"220045405":"Nonlinear Multiobjective Optimization: A Generalized Homotopy Approach","259179376":"Stable Matching Based Selection in Evolutionary Multiobjective Optimization","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","221900799":"Neural Networks and Learning Machine","270723371":"Learning Value Functions in Interactive Evolutionary Multiobjective Optimization","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","242358078":"The Elements Of Statistical Learning","280940018":"Pattern Recognition and Machine Learning","220199376":"Deriving operating policies for multi-objective reservoir systems: Application of Self-Learning Genetic Algorithm","235709918":"Nonlinear Multiobjective Optimization","220499767":"Dimension Reduction by Local Principal Component Analysis","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","288728417":"A self organizing map based hybrid multi-objective optimization of Water Distribution Networks","282544448":"Adaptive Cross-Generation Differential Evolution Operators for Multi-objective Optimization","282555983":"Constrained Subproblems in Decomposition based Multiobjective Evolutionary Algorithm","4201752":"A model-based evolutionary algorithm for Bi-objective optimization","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","4074983":"Connectedness, regularity and the success of local search in evolutionary multi-objective optimization","262374265":"A general framework for evolutionary multiobjective optimization via manifold learning","285696731":"A multiobjective evolutionary algorithm using dynamic weight design method","263469353":"A multiobjective cellular genetic algorithm based on 3D structure and cosine crowding measurement","220743605":"A Similarity-Based Mating Scheme for Evolutionary Multiobjective Optimization","225304691":"Self-organizing maps for Pareto optimization of airfoils","245310848":"Hybridizing evolutionary strategies with continuation methods for solving multi-objective problems","224089540":"HCS: A New Local Search Strategy for Memetic Multiobjective Evolutionary Algorithms","228341949":"A cellular genetic algorithm for multiobjective optimization","226752738":"A Scalable Multi-objective Test Problem Toolkit","220739530":"Cellular Genetic Local Search for Multi-Objective Optimization.","220701955":"Solving Three-Objective Optimization Problems Using a New Hybrid Cellular Genetic Algorithm.","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","239946277":"MOEA/D with adaptive weight adjustment","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","224579977":"Approximating the Set of Pareto-Optimal Solutions in Both the Decision and Objective Spaces by an Estimation of Distribution Algorithm","277634558":"Are All the Subproblems Equally Important? Resource Allocation in Decomposition Based Multiobjective Evolutionary Algorithms","274263660":"Probabilistic Dominance in Multiobjective Reliability-Based Optimization: Theory and Implementation","2886552":"Self-Organizing Maps for Multi-Objective Optimization","3419010":"RM-MEDA: A Regularity Model-Based Multiobjective Estimation of Distribution Algorithm","264387256":"Multiobjective Estimation of Distribution Algorithm Based on Joint Modeling of Objectives and Variables","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","238218319":"Differential Evolution-A Practical Approach to Global Optimization"},"citedIn":{},"index":191}