{"abs":"This study considers a multi-objective dynamic stochastic districting and routing problem in which the customers of a territory stochastically evolve over several periods of a planning horizon, and where the number of service vehicles, the compactness of the districts, the dissimilarity measure of the districts and an equity measure of vehicles profit are considered as objectives. The problem is modeled and solved as a two-stage stochastic program, where in each period, districting decisions are made in the first stage, and the Beardwood-Halton-Hammersley formula is used to approximate the expected routing cost of each district in the second stage. An enhanced multi-objective evolutionary algorithm (MOEA), i.e., the preference-inspired co-evolutionary algorithm using mating restriction, is developed for the problem. The algorithm is tested on randomly generated instances and is compared with two state-of-the-art MOEAs. Computational results confirm the superiority and effectiveness of the proposed algorithm. Moreover, a procedure for selecting a preferred design for the proposed problem is described.","title":"Solving a multi-objective dynamic stochastic districting and routing problem with a co-evolutionary algorithm","id":283193499,"url":"https://www.researchgate.net/publication/283193499_Solving_a_multi-objective_dynamic_stochastic_districting_and_routing_problem_with_a_co-evolutionary_algorithm","names":["Hongtao Lei","Rui Wang","Gilbert Laporte","Computers \u0026 Operations Research"],"references":{"269334411":"Districting for Arc Routing","259505405":"General framework for localised multi-objective evolutionary algorithms","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","260163089":"Embotelladoras ARCA Uses Operations Research to Improve Territory Design Plans","3949352":"Comparing a coevolutionary genetic algorithm for multiobjectiveoptimization","228919612":"Multiobjective scatter search for a commercial territory design problem","220743605":"A Similarity-Based Mating Scheme for Evolutionary Multiobjective Optimization","239063324":"Jaillet, P.: A Priori Solution of a Traveling Salesman Problem in Which a Random Subset of the Customers Are Visited. Operations Research 36, 929-936","231920631":"The Shortest Path Through Many Points","243776802":"A Tabu Search Heuristic for the Vehicle Routing Problem with Stochastic Demands and Customers","272391705":"Dynamic design of sales territories","251630808":"A bi-objective programming model for designing compact and balanced territories in commercial districting","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","228742806":"Robust Partitioning for Stochastic Multi-Vehicle Routing","235959332":"Decision Support System for the School Districting Problem","260101052":"Geo-Graphs: An Efficient Model for Enforcing Contiguity and Hole Constraints in Planar Graph Partitioning","272846207":"Preference-inspired co-evolutionary algorithms using weight vectors","268645053":"The Traveling Salesman Problem: A Computational Study","216300837":"Mating Scheme for Controlling the Diversity-Convergence Balance for Multiobjective Optimization","222331138":"Solving continuous location–districting problems with Voronoi diagrams","262403040":"Dividing a Territory Among Several Facilities","222561537":"A Tabu Search Heuristic and Adaptive Memory Procedure for Political Districting","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","24065450":"Towards a unified territorial design approach — Applications, algorithms and GIS integration","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","243764033":"A Priori Optimization of the Probabilistic Traveling Salesman Problem","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","264365839":"Multi-Objective Analysis of School District Regionalization Alternatives in Connecticut","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","4754951":"Local Search Algorithms for Political Districting","260621912":"Preference-Inspired Coevolutionary Algorithms for Many-Objective Optimization","262277235":"Dividing a Territory Among Several Vehicles","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","257806091":"Districting for routing with stochastic customers","222518421":"A Reactive GRASP for a Commercial Territory Design Problem with Multiple Balancing Requirements","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","32042928":"Solving a Home-Care Districting Problem in an Urban Setting","271206770":"The iPICEA-g: A new hybrid evolutionary multi-criteria decision making approach using the brushing technique","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","261460596":"Preference-inspired co-evolutionary algorithm using adaptively generated goal vectors","220742475":"Congressional Districting Using a TSP-Based Genetic Algorithm.","262207684":"Designing New Electoral Districts for the City of Edmonton","220391366":"The Consistent Vehicle Routing Problem","222827436":"Designing delivery districts for the vehicle routing problem with stochastic demands. Eur J Oper Res","227447147":"An Optimization Based Heuristic for Political Districting","221025610":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","4074967":"Evolutionary many-objective optimisation: an exploratory analysis","220121333":"A Multiobjective Hybrid Metaheuristic Approach for GIS-based Spatial Zoning Model","220461644":"Multiple criteria districting problems","220470098":"The capacitated vehicle routing problem with stochastic demands and time windows","262212699":"Fast Approximation Methods for Sales Force Deployment","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","223745837":"A Simulated Annealing Approach to Police Districting Design","227352560":"COSTA: Contribution Optimizing Sales Territory Alignment","225518478":"GRASP strategies for a bi-objective commercial territory design problem"},"citedIn":{},"index":197}