{"abs":"This is the first part of a two-part investigation of reliability of non-linear-truss structures with uncertain system parameters under random excitations. The objective is to develop a method of stochastic finite-element analysis for obtaining response statistics. The related reliability problem is considered in the companion paper. In this study, random excitations are modeled as filtered Gaussian white noises and uncertain system parameters are modeled as either random fields or random variables. Structural nonlinear behavior due to both large deflection and inelastic deformation is considered. The structure is discretized via a total Lagrangian finite-element formulation that yields a set of stochastic nonlinear equations of motion. An equivalent linearization method in conjunction with a perturbation method is then developed to solve for the total response statistics. No separate mesh for each random field is necessary in this formulation. Numerical examples indicate that the proposed method yields accurate results with much less computer time compared with the Monte Carlo simulation method. It is found that the system uncertainties contribute significantly to the total response statistics.","title":"Reliability of Uncertain Nonlinear Trusses Under Random Excitation. II","id":245285335,"url":"https://www.researchgate.net/publication/245285335_Reliability_of_Uncertain_Nonlinear_Trusses_Under_Random_Excitation_II","names":["R.-H. Cherng","Y. K. Wen","Journal of Engineering Mechanics"],"references":{},"citedIn":{"263796987":"STOCHASTIC THERMAL POST-BUCKLING RESPONSE OF LAMINATED COMPOSITE CYLINDRICAL SHELL PANEL WITH SYSTEM RANDOMNESS","283673836":"Probability density evolution method for compound random vibration analysis of stochastic structures","223434774":"A comparison between different robust optimum design approaches: application to tuned mass dampers. Probab Eng Mech","39066974":"Response Surface Method for Time-Variant Reliability Analysis","222978886":"Variability response functions for stochastic plate bending problems","222210675":"Explicit solutions in the stochastic dynamics of structural systems","222515596":"Reliability analysis of randomly vibrating structures with parameter uncertainties","221956597":"Vibration and reliability of a rotating beam with random properties under random excitation","245185869":"A State-of-the-Art Report on Computational Stochastic Mechanics","245286219":"New Approximations for Reliability Integrals","239403344":"Linearization in Analysis of Nonlinear Stochastic Systems, Recent Results---Part II: Applications","245425207":"Reliability-Based Optimization of Uncertain Systems in Structural Dynamics","245286015":"Direct Generation of Non-Gaussian Weighted Integrals","222351395":"Uncertainties in Probabilistic Numerical Analysis of Structures and Solids – Stochastic Finite Elements","228519485":"Lifetime reliability based design of an offshore vessel mooring","279560460":"A state-of-the-art report on computational stochastic mechanics","245286072":"Stochastic Finite-Element Analysis for Elastic Buckling of Stiffened Panels","245425222":"Quasi-Failure Analysis on Resonant Demolition of Random Structural Systems","222156116":"Response and eigenvalue analysis of stochastic finite element systems with multiple correlated material and geometric properties","229573533":"Effects of structural uncertainties on TMD design: A reliability‐based approach","261152354":"Finite element vibration and dynamic response analysis of engineering structures","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","32135518":"Info-gap robust design with load and model uncertainties. J. Sound Vib","245285867":"Asymptotic Expansions for Reliability and Moments of Uncertain Systems","257774699":"Vibration reliability sensitivity analysis of general system with correlation failure modes","245286948":"Equivalent Linearization for the Nonstationary Response Analysis of Nonlinear Systems with Random Parameters","223787948":"Robust optimum design of tuned mass dampers devices in random vibrations mitigation. J Sound Vib"},"index":198}