{"abs":"The single objective quadratic multiple knapsack problem (QMKP) is a useful model to formulate a number of practical problems. However, it is not suitable for situations where more than one objective needs to be considered. In this paper, we extend the single objective QMKP to the bi-objective case such that we simultaneously maximize the total profit of the items packed into the knapsacks and the ’makespan’ (the gain of the least profit knapsack). Given the imposing computational challenge, we propose a hybrid two-stage (HTS) algorithm to approximate the Pareto front of the bi-objective QMKP. HTS combines two different and complementary search methods - scalarizing memetic search (first stage) and Pareto local search (second stage). Experimental assessments on a set of 60 problem instances show that HTS dominates a standard multi-objective evolutionary algorithm (NSGA II), and two simplified variants of HTS. We also present a comparison with two state-of-the-art algorithms for the single objective QMKP to assess the quality of the extreme solutions of the approximated Pareto front.","title":"The Bi-Objective Quadratic Multiple Knapsack Problem: Model and Heuristics","id":291186153,"url":"https://www.researchgate.net/publication/291186153_The_Bi-Objective_Quadratic_Multiple_Knapsack_Problem_Model_and_Heuristics","names":["Yuning Chen","Jin-Kao Hao"],"references":{"220471589":"A hybrid TP+PLS algorithm for bi-objective flow-shop scheduling problems","220866793":"A New Grouping Genetic Algorithm for the Quadratic Multiple Knapsack Problem","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","221581170":"A Genetic Algorithm for the Quadratic Multiple Knapsack Problem","222225401":"The Quadratic Knapsack Problem—A Survey","200026091":"Multiobjective Decision Making: Theory And Methodology","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","220669033":"Solution of Large Quadratic Knapsack Problems Through Aggressive Reduction","221138813":"A Swarm Intelligence Approach to the Quadratic Multiple Knapsack Problem","257391490":"Community Detection in Complex Networks: Multi–objective Enhanced Firefly Algorithm","261184006":"An Improved Decomposition-Based Memetic Algorithm for Multi-Objective Capacitated Arc Routing Problem","276075363":"A New Uniform Evolutionary Algorithm Based on Decomposition and CDAS for Many-objective Optimization","273516949":"Iterated responsive threshold search for the quadratic multiple knapsack problem","284017268":"An Evolutionary Path Relinking Approach for the Quadratic Multiple Knapsack Problem","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","3418735":"Jaszkiewicz, A.: Do multiple-objective metaheuristics deliver on their promises? A computational experiment on the set-covering problem. IEEE Transactions on Evolutionary Computation 7(2), 133-143","224211267":"Decomposition-Based Memetic Algorithm for Multiobjective Capacitated Arc Routing Problem","281329563":"Experiments on Local Search for Bi-objective Unconstrained Binary Quadratic Programming","226550943":"Pareto Local Optimum Sets in the Biobjective Traveling Salesman Problem: An Experimental Study","244289453":"Genetic Tabu Search for the Multi-objective Knapsack Problem","281413027":"Indicator Based Ant Colony Optimization for Multi-objective Knapsack Problem","259523293":"A hybrid metaheuristic for multiobjective unconstrained binary quadratic programming","220741645":"The quadratic multiple knapsack problem and three heuristic approaches to it","227444843":"Bicriteria Transportation Problem","228672200":"3 Memetic Algorithms","220288719":"A scatter search method for bi-criteria {0, 1}-knapsack problems","265718887":"Strategic oscillation for the quadratic multiple knapsack problem","222125263":"An exact algorithm for large multiple knapsack problems","220403665":"Teghem, J.: Two-phase Pareto local search for the biobjective traveling salesman problem. Journal of Heuristics 16(3), 475-510","257391652":"A two-stage preference-based evolutionary multi-objective approach for capability planning problems","271615559":"On the structure of multiobjective combinatorial search space: MNK-landscapes with correlated objectives","46497074":"New Genetic Algorithms with Path Relinking for the Minimum Tardiness Permutation Flowshop Problem","4871666":"An exact method based on Lagrangian decomposition for the 0-1 quadratic knapsack problem","220561821":"Dynamic programming based algorithms for the discounted {0-1} knapsack problem","220642972":"Improving the anytime behavior of two-phase local search","270991965":"Tabu-enhanced iterated greedy algorithm: A case study in the quadratic multiple knapsack problem","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II"},"citedIn":{},"index":202}