{"abs":"Wind speed as well as the power output of wind turbine generators (WTGs) have high correlations and may not be normally distributed. In this paper, the method of Zhao\u0027s point estimate method (PEM) combined with Nataf transformation was applied into correlated probabilistic load flow (PLF) calculation. This method can deal with correlated input random variables (RVs) with normal or non-normal probability distributions. Instead of joint probability density functions (PDFs) of multivariate RVs, this method only requires data of the marginal distribution function of each input RV and their correlation coefficients. The effectiveness of the proposed method is demonstrated by the numerical tests on IEEE 14-bus and the IEEE 118-bus systems. Besides, relative average errors compared with correlated Monte Carlo Simulation (CMCS) are analyzed.","title":"Correlated probabilistic load flow using a point estimate method with Nataf transformation","id":268079770,"url":"https://www.researchgate.net/publication/268079770_Correlated_probabilistic_load_flow_using_a_point_estimate_method_with_Nataf_transformation","names":["Can Chen","Wenchuan Wu","Boming Zhang","Hongbin Sun","International Journal of Electrical Power \u0026 Energy Systems"],"references":{"225982141":"Nataf transformation based point estimate method","3268409":"Point Estimate Schemes to Solve the Probabilistic Power Flow","227446046":"Importance Sampling for Stochastic Simulations","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","222660503":"Moment methods for structural reliability[J]","260509589":"Probabilistic Load Flow Modeling Comparing Maximum Entropy and Gram-Charlier Probability Density Function Reconstructions","224137231":"Probabilistic power flow with correlated wind sources","3461863":"Evaluation Methods and Accuracy in Probabilistic Load Flow Solutions","256969990":"Estimation of wind farms aggregated power output distributions","270007886":"New Point Estimates for Probability Moments","3461294":"Probabilistic Load Flow","248560911":"Importance sampling in structural system","245488766":"Probabilistic a.c. load flow","224587520":"Enhancements to the Cumulant Method for Probabilistic Optimal Power Flow Studies","246909972":"Multivariate distribution models with prescribed marginals and covariances","3267474":"Probabilistic Load-Flow Computation Using Point Estimate Method","280887002":"Latin supercube sampling for very high-dimensional simulations","3263705":"New probabilistic power flow analysis method","2239818":"Latin Supercube Sampling for Very High Dimensional Simulations","260509422":"Probabilistic Power Flow Studies for Transmission Systems With Photovoltaic Generation Using Cumulants","260650275":"Probabilistic Load Flow Method Based on Nataf Transformation and Latin Hypercube Sampling","260509421":"Probabilistic Load Flow in Correlated Uncertain Environment Using Unscented Transformation","3267741":"Probabilistic Assessment of Available Transfer Capability Based on Monte Carlo Method With Sequential Simulation","256970557":"A new approach of point estimate method for probabilistic load flow","223864103":"“An ef?cient point estimate method for probabilistic analysis,”","3796174":"Probabilistic load flow calculation using Monte Carlo techniques for distribution network with wind turbines","260622514":"Probabilistic load flow with non-Gaussian correlated random variables using Gaussian mixture models","223912354":"Latin Hypercube Sampling and the Propagation of Uncertainty in Analyses of Complex Systems, Technical Report, SAND2001-0417","223873507":"Probability estimate for multivariate analysis","3267021":"Probabilistic Load Flow Computation Using the Method of Combined Cumulants and Gram-Charlier Expansion"},"citedIn":{"291348908":"A review on the inclusion of wind generation in power system studies"},"index":205}