{"abs":"Evolutionary Algorithm provides a framework that is largely applicable to particular problems including multiobjective optimization problems, basically for the ease of their implementation and their capability to perform efficient parallel search. Indeed, in some cases, expensive multiobjective optimization evaluations might be a challenge to restrict the number of explicit fitness evaluations in multiobjective evolutionary algorithms. Accordingly, this article presents a novel approach that tackles this problem so as to not only decrease the number of fitness evaluations but also to improve the performance. During evolution, our proposed approach selects fit individuals based on the knowledge acquired throughout the search, and performs explicit fitness evaluations on these individuals. A comprehensive comparative analysis of a wide range of well-established test problems, selected from both traditional and state-of-the-art benchmarks, has been presented. Afterward, the effectiveness of the obtained results is compared with some of the state-of-the-art methods using two well-known metrics- i.e. Hypervolume and Inverted Generational Distance (IGD). The experiments of our implemented approach is performed to illustrate that our proposal seems to be promising and would prove more efficient than other approaches in terms of both the performance and the computational cost.","title":"A fuzzy based approach for fitness approximation in multi-objective evolutionary algorithms","id":283685586,"url":"https://www.researchgate.net/publication/283685586_A_fuzzy_based_approach_for_fitness_approximation_in_multi-objective_evolutionary_algorithms","names":["Zahra Pourbahman","Ali Hamzeh","Journal of Intelligent and Fuzzy Systems"],"references":{"223835155":"Evolutionary hidden information detection by granulation-based fitness approximation","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","224330197":"Auto-Tuning Fuzzy Granulation for Evolutionary Optimization","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","227022372":"A Review of Techniques for Handling Expensive Functions in Evolutionary Multi-Objective Optimization","220998589":"Fitness inheritance in genetic algorithms","4307891":"A novel general framework for evolutionary optimization: Adaptive fuzzy fitness granulation","259874798":"Reducing the Computational Cost in Multi-objective Evolutionary Algorithms by Filtering Worthless Individuals","43797807":"A Pareto-Compliant Surrogate Approach for Multiobjective Optimization","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","43797802":"A Mono Surrogate for Multiobjective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","281327709":"Dominance-Based Pareto-Surrogate for Multi-Objective Optimization","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","220739956":"Some comments on GD and IGD and relations to the Hausdorff distance","261131215":"Pareto Rank Learning in Multi-objective Evolutionary Algorithms"},"citedIn":{},"index":206}