{"abs":"A numerical strategy for the efficient estimation of set-valued failure probabilities, coupling Monte Carlo with optimization methods, is presented in this paper. The notion of uncertainty is generalized to include both aleatory and epistemic uncertainties, allowing to capture gaps of knowledge and scarcity of data. The proposed formulation of the generalized uncertainty model allows for sets of probability distribution functions, also known as credal sets, and sets of bounded variables. The developed Advanced Line Sampling method is combined with the generalized uncertainty model, in order to both speed up the reli-ability analysis, and provide a better estimate for the lower and upper bounds of the failure probability. The proposed strategy knocks down the computational barrier of computing interval failure probabilities, and reduces the cost of a robust reliability analysis by many orders of magnitude. The efficiency and applicability of the developed method is demonstrated via numerical examples. The solution strategy is integrated into the open-source software for uncertainty quantification and risk analysis OPENCOSSAN, allowing its application on large-scale engineering problems as well as broadening its spectrum of applications.","title":"Advanced Line Sampling for efficient robust reliability analysis","id":269076474,"url":"https://www.researchgate.net/publication/269076474_Advanced_Line_Sampling_for_efficient_robust_reliability_analysis","names":["Marco de Angelis","Edoardo Patelli","Michael Beer","Structural Safety"],"references":{"245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","223008521":"General multi-dimensional probability integration by directional simulation","222439366":"“Fuzzy Sets,”","241077915":"Correlation analysis of non-probabilistic convex model and corresponding structural reliability technique","216545901":"Genetic Algorithms in Search, Optimization, and Machine Learning. Menlo Park, CA: Addison-Wesley","222712640":"Larman, C.: Applying UML and Patterns: An Introduction to Object-Oriented Analysis and Design and Iterative Development, 3rd edn. Prentice Hall","225573879":"Fuzzy structural analysis using A-level optimization","234014394":"The Monte Carlo method","268651786":"Mathematical theory of reliability","223862685":"A non-probability concept of reliability","220529902":"Interval analysis and fuzzy set theory","5710491":"The Monte Carlo method","254206760":"Random Variables, Distribution Functions, and Copulas - A Personal Look Backward and Forward, Distributions with Fixed Marginals and Related Topics","222289965":"On Computation Methods for Structural Reliability Analysis","222514838":"Using random set theory to propagate epistemic uncertainty through a mechanical system","263047733":"Structural Reliability Methods","222253862":"A survey of non-probabilistic uncertainty treatment in finite element analysis","266076033":"Mathematical theory of reliability: A historical perspective","241269439":"The BOBYQA Algorithm for Bound Constrained Optimization without Derivatives","275188793":"Asymptotic Approximations for Multinormal Integrals","248560911":"Importance sampling in structural system","236468551":"Experimental Uncertainty Estimation and Statistics for Data Having Interval Uncertainty","237395910":"Monte Carlo gradient estimation in high dimensions","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","257101557":"Reliability of structures in high dimensions. Part II. Theoretical validation","222378983":"The role of the design point for calculating failure probabilities in view of dimensionality and structural nonlinearities","222659619":"Analysis of Structural Reliability under Parameter Uncertainty","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","257272121":"Imprecise probabilities in engineering analyses","248240740":"Updating Models and Their Uncertainties. I: Bayesian Statistical Framework","222779702":"Directional simulation in Gaussian processes","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","225805894":"Asymptotic approximations for multinormal domain and surface integrals","242997516":"The naive credal classifier","263732354":"OpenCossan: An Efficient Open Tool for Dealing with Epistemic and Aleatory Uncertainties","257021930":"General purpose software for efficient uncertainty management of large finite element models"},"citedIn":{"291421918":"Reliability analysis with Metamodel Line Sampling","281031572":"RISK ASSESSMENT OF SPENT FUEL PONDS SUBJECT TO THE RISK OF FLOODING","283477133":"Secant Hyperplane Method for Structural Reliability Analysis","270580058":"Uncertainty Management in Multidisciplinary Design of Critical Safety Systems","273456689":"Structural reliability assessment utilizing four metaheuristic algorithms","281863842":"Line sampling approach for extreme case analysis in presence of aleatory and epistemic uncertainties","280489224":"A computational tool for Bayesian networks enhanced with reliability methods","265167329":"The improved FORM for Stochastic Dynamic Analysis"},"index":207}