{"abs":"This article introduces a new general method for genealogical inference that samples independent genealogical histories using importance sampling (IS) and then samples other parameters with Markov chain Monte Carlo (MCMC). It is then possible to more easily utilize the advantages of importance sampling in a fully Bayesian framework. The method is applied to the problem of estimating recent changes in effective population size from temporally spaced gene frequency data. The method gives the posterior distribution of effective population size at the time of the oldest sample and at the time of the most recent sample, assuming a model of exponential growth or decline during the interval. The effect of changes in number of alleles, number of loci, and sample size on the accuracy of the method is described using test simulations, and it is concluded that these have an approximately equivalent effect. The method is used on three example data sets and problems in interpreting the posterior densities are highlighted and discussed.","title":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","id":10652634,"url":"https://www.researchgate.net/publication/10652634_Beaumont_MA_Estimation_of_population_growth_or_decline_in_genetically_monitored_populations_Genetics_164_1139-1160","names":["Mark A Beaumont","Genetics"],"references":{"11499631":"Likelihood-Based Estimation of the Effective Population Size Using Temporal Changes in Allele Frequencies: A Genealogical Approach","14378842":"Coalescents and Genealogical Structure Under Neutrality","11245930":"Estimating Mutation Parameters, Population History and Genealogy Simultaneously From Temporally Spaced Sequence Data","12720579":"Nonequilibrium Migration in Human History","15699884":"Estimating Effective Population Size and Mutation Rate From Sequence Data Using Metropolis-Hastings Sampling","13559565":"Genealogical Inference From Microsatellite Data","13237964":"Coalescent estimates of HIV-1 generation time in vivo","13960915":"Nordborg, M. Structured coalescent processes on different time scales. Genetics 146, 1501-1514","11886642":"Estimation of Admixture Proportions: A Likelihood-Based Approach Using Markov Chain Monte Carlo","18454225":"Lewontin RC, Krakauer J. Distribution of gene frequency as a test of theory of selective neutrality of polymorphisms. Genetics 74: 175-195","6554156":"Allozymic Variation and Linkage Disequilibrium in Some Laboratory Populations of DROSOPHILA MELANOGASTER.","13240262":"Luikart, G, Cornuet, J-M. Estimating the effective number of breeders from heterozygote excess in progeny. Genetics, 151: 1211-1216","14378838":"Frankham R. Conservation genetics. Ann Rev Genet 29: 305-327","12720591":"Detecting Population Expansion and Decline Using Microsatellites","224771432":"Lynch M, Conery J, Bürger R. Mutation accumulation and the extinction of small populations. Am Nat 146: 489-518","243782281":"Introduction to general state-space markov chain theory","12035239":"Sustaining genetic variation in a small population: evidence from the Mauritius kestrel","16690287":"Tavare, S. Line-of-descent and genealogical processes, and their applications in population genetics models. Theor. Popul. Biol. 26, 119-164","10899824":"Wang JL, Whitlock MC. Estimating effective population size and migration rates from genetic samples over space and time. Genetics 163: 429-446","12483622":"STRUCTURE, version 2.3.3, inference of population structure using multilocus genotype data","6557374":"Pollak E. A new method for estimating the effective population size from allele frequency changes. Genetics 104: 531-548","23026309":"Langley CH, Smith DB, Johnson FM. Analysis of linkage disequilibria between allozyme loci in natural populations of Drosophila melanogaster. Genet Res 32: 215-229","11495861":"Wang JL. A pseudo-likelihood method for estimating effective population size from temporally spaced samples. Genet Res 78: 243-257","12627739":"“Ghost” alleles of the Mauritius Kestrel","12226406":"Monte Carlo Evaluation of the Likelihood for Ne From Temporally Spaced Samples","12045608":"Beerli P, Felsenstein J.. Maximum likelihood estimation of a migration matrix and effective population sizes in subpopulations by using a coalescent approach. Proc Natl Acad Sci USA 98: 4563-4568","11450188":"Testing for Genetic Evidence of Population Expansion and Contraction: An Empirical Analysis of Microsatellite DNA Variation Using a Hierarchical Bayesian Model","11936084":"Distinguishing Migration From Isolation: A Markov Chain Monte Carlo Approach","14479226":"Gene genealogies within mutant allelic classes","15385472":"Developments in the Prediction of Effective Population Size","20423963":"Waples, R. S. A generalized approach for estimating effective population size from temporal changes in allele frequency. Genetics 121, 379-391","13847101":"Miller LM, Kapuscinski AR. Historical analysis of genetic variation reveals low effective populations size in a northern pike (Esox lucius) population. Genetics 147: 1249-1258","13240248":"Inbreeding of bottlenecked butterfly populations: Estimation using the likelihood of changes in marker allele frequencies","11743169":"Gene genealogies in a metapopulation","25455152":"Genetic divergence and units for conservation in the Komodo Dragon Varanus komodoensis.","15397917":"Sampling Theory for Neutral Alleles in a Varying Environment","11627078":"Estimating Recombination Rates from Population Genetic Data","12944828":"Using Maximum Likelihood to Estimate Population Size From Temporal Changes in Allele Frequencies","6554328":"Nei M, Tajima F. Genetic drift and estimation of effective population size. Genetics 98: 625-640","12069318":"Estimating Mutation Rate and Generation Time from Longitudinal Samples of DNA Sequences","13443762":"Austerlitz, F. \u0026 Heyer, E. Social transmission of reproductive behavior increases frequency of inherited disorders in a young-expanding population. Proc. Natl Acad. Sci. USA 95, 15140-15144"},"citedIn":{"279309732":"Efficiency of delayed-acceptance random walk Metropolis algorithms","277959058":"Gradient-free Hamiltonian Monte Carlo with Efficient Kernel Exponential Families","47634898":"Minimal models of growth and decline of microbial populations","233402348":"Scientific Review of the Draft Northern Spotted Owl Recovery Plan and Reviewer Comments","225035119":"Single base errors in PCR products from avian museum specimens and their effect on estimates of historic genetic diversity","51417879":"Okello JBA, Wittemyer G, Rasmussen HB, Arctander P, Nyakaana S, Douglas-Hamilton I et al.. Effective population size dynamics reveal impacts of historic climatic events and recent anthropogenic pressure in African elephants. Mol Ecol 17: 3788-3799","7696498":"Wang JL. Estimation of effective population sizes from data on genetic markers. Philos Trans R Soc Lond B 360: 1395-1409","38085709":"Composite likelihood estimation of demographic parameters","279864742":"A Three-Dimensional Map of Milky-Way Dust","257299295":"Exact-Approximate Bayesian Inference for Gaussian Processes","242997874":"Bayesian inference for circular distributions with unknown normalising constants","233385701":"Palstra FP, Fraser DJ.. Effective/census population size ratio estimation: a compendium and appraisal. Ecol Evol 2: 2357-2365","229684414":"Conservation Genetics","23231596":"Coyer J, Hoarau G, Kjersti S, Olsen J. Being abundant is not enough: a decrease in effective population size over 8 generations in a Norwegian population of the seaweed, Fucus serratus. Biol Lett 4: 755-757","6994555":"On the expected relationship between inbreeding, fitness, and extinction","286227230":"Bayesian Inference for Gaussian Process Classifiers with Annealing and Pseudo-Marginal MCMC","256499037":"Efficient Continuous-Time Markov Chain Estimation","280059814":"Exact likelihood-free Markov chain Monte Carlo for elliptically contoured distributions","256073307":"Comparison of historical bottleneck effects and genetic consequences of re-introduction in a critically endangered island passerine","7903330":"An Efficient Monte Carlo Method for Estimating Ne From Temporally Spaced Samples Using a Coalescent-Based Likelihood","51119895":"Detecting strong positive selection in the genome","221972260":"Microsatellite genotyping reveals end-Pleistocene decline in mammoth autosomal genetic variation","258882417":"Nonlinear Time Series: Theory, Methods and Applications with R Examples","257028465":"On non-negative unbiased estimators","274094454":"Stability of Noisy Metropolis-Hastings","225249612":"Small effective population sizes of two remnant ocelot populations (Leopardus pardalis albescens) in the United States","227180201":"Buzan EV, Krystufek B, Bryja J.. Microsatellite markers confirm extensive population fragmentation of the endangered Balkan palaeoendemic Martino’s vole (Dinaromys bogdanovi). Conserv Gen 11: 1783-1794","269998132":"Particle Metropolis adjusted Langevin algorithms","265687538":"Bayesian inference for Markov jump processes with informative observations","266399941":"Estimating Ocean Circulation: An MCMC Approach With Approximated Likelihoods via the Bernoulli Factory","264899565":"Optimal Scaling for the Pseudo-Marginal Random Walk Metropolis: Insensitivity to the Noise Generating Mechanism","228104895":"Genetic Variability Characterization of the Moroccan Houbara Bustard (Chlamydotis undulata undulata) Inferred from Pedigree Analysis.","267269577":"Spatial genetic architecture of the critically- endangered Maui Parrotbill (Pseudonestor xanthophrys): management considerations for reintroduction strategies","261952439":"Establishing some order amongst exact approximations of MCMCs","228549813":"Reproduction in the Wild: The Effect of Individual Life History Strategies on Population Dynamics and Persistence","233637056":"Large effective population size and temporal genetic stability in Atlantic cod (Gadus morhua) in the southern Gulf of St. Lawrence","225079879":"Reliability of genetic bottleneck tests for detecting recent population declines","279155085":"Generalized correlation integral vectors: A distance concept for chaotic dynamical systems","6127981":"Becquet C, Przeworski M. A new approach to estimate parameters of speciation models with application to apes. Genome Res 17: 1505-1519","288179485":"Pseudo-Marginal MCMC for Parameter Estimation in α-Stable Distributions**The first author acknowledges partial funding from EPSRC-DTG- 2013/EU, while the second and third authors were supported by the EPSRC BTaRoT project EP/K020153/1; the third author was also funded by the Learning of complex dynamical systems project (Contract number: 637-2014-466) from the Swedish Research Council.","45861000":"Adaptive Multiple Importance Sampling","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","51224890":"Statistical inference for stochastic simulation models? Theory and application","233946566":"Barker (2011) Mol Ecol","256548723":"IS^2 for Bayesian inference in latent variable models","272185091":"Statistical Inference on Genetic Data Reveals the Complex Demographic History of Human Populations in Central Asia","8469693":"Comparative evaluation of a new effective population size estimator based on approximate Bayesian computation. Genetics 167: 977-988","271855369":"Bayesian computation: a perspective on the current state, and sampling backwards and forwards","262954130":"Pseudo-Marginal Bayesian Inference for Gaussian Processes","225372752":"Phylogeographic Ancestral Inference Using the Coalescent Model on Haplotype Trees","23974226":"Approximate Bayesian Computation Without Summary Statistics: The Case of Admixture","51402543":"Pavlidis P, Hutter S, Stephan W. A population genomic approach to map recent positive selection in model species. Mol Ecol 17: 3585-3598","264160764":"Perfect simulation using atomic regeneration with application to Sequential Monte Carlo","260393926":"Bayesian Inference for Hybrid Discrete-Continuous Stochastic Kinetic Models","233946549":"Pertoldi pinemarten 2008","258247200":"Second-order Particle MCMC for Bayesian Parameter Inference","5989149":"Fraser DJ, Hansen MM, Østergaard S, Tessier N, Legault M, Bernatchez L. Comparative estimation of effective population sizes and temporal gene flow in two contrasting population systems. Mol Ecol 16: 3866-3889","270514008":"Inferring Epidemiological Dynamics with Bayesian Coalescent Inference: The Merits of Deterministic and Stochastic Models","6388264":"Estimation of the number of individuals founding colonized populations","51623256":"Bayesian inference of a historical bottleneck in a heavily exploited marine mammal","232697237":"Variance bounding and geometric ergodicity of Markov chain Monte Carlo for approximate Bayesian computation","291353622":"Bayesian model comparison with un-normalised likelihoods","232062873":"Efficient implementation of Markov chain Monte Carlo when using an unbiased likelihood estimator","45951987":"The Confounding Effects of Population Structure, Genetic Diversity and the Sampling Scheme on the Detection and Quantification of Population Size Changes","283344812":"Bayesian Inference in multivariate stable distributions using ABC: Extensions to stochastic volatility and dynamic factor models","233990818":"Spatio-temporal population genetics of the Danish pine marten (Martes martes). Biol J Linn Soc","273640222":"Light and Widely Applicable MCMC: Approximate Bayesian Inference for Large Datasets","226646480":"Boessenkool S, Star B, Seddon PJ, Waters JM.. Temporal genetic samples indicate small effective population size of the endangered yellow-eyed penguin. Conserv Genet 11: 539-546","267429282":"Population characteristics and estimates of effective population size in a house sparrow metapopulation","260367062":"Annealed Important Sampling for Models with Latent Variables","259783208":"Delayed acceptance particle MCMC for exact inference in stochastic kinetic models","256441117":"Conservation Genetics of an Undescribed Species of Dionda (Teleostei: Cyprinidae) in the Rio Grande Drainage in Western Texas","224859952":"Barker, J.S.F. (2011). Effective population size of natural populations of Drosophila buzzatii, with a comparative evaluation of nine methods of estimation. Molecular Ecology 20: 4452-4471","254311285":"Genetic Divergence and Effective Size among Lane Snapper in U.S. Waters of the Western Atlantic Ocean","284218797":"The iterated auxiliary particle filter","265609866":"Population Genetics Inference for Longitudinally-Sampled Mutants Under Strong Selection","233889199":"Wilkinson, D.J.: Bayesian Parameter Inference for Stochastic Biochemical Network Models Using Particle Markov Chain Monte Carlo. Interface Focus 1(6), 807-820","279458248":"Evaluating methods for estimating local effective population size with and without migration","8573411":"Beaumont MA, Rannala B. The Bayesian revolution in genetics. Nat Rev Genet 5: 251-261","230496468":"Lack of genetic polymorphism among peregrine falcons Falco peregrinus of Fiji","229026762":"Monte Carlo methods for Bayesian palaeoclimate reconstruction","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","47413949":"Testing temporal changes in allele frequencies: A simulation approach","49795225":"Inference on the strength of balancing selection for epistatically interacting loci","225081349":"Coupled MCMC with a randomized acceptance probability","5387296":"Hoffmann AA, Willi Y. Detecting genetic responses to environmental change. Nat Rev Genet 9: 421-432","255970354":"Backward Simulation Methods for Monte Carlo Statistical Inference","260039179":"Particle Metropolis adjusted Langevin algorithms for state space models","235221373":"AABC: approximate approximate Bayesian computation when simulating a\nlarge number of data sets is computationally infeasible","260957174":"Importance Sampling Squared for Bayesian Inference in Latent Variable Models","51970149":"Catastrophic Floods May Pave the Way for Increased Genetic Diversity in Endemic Artesian Spring Snail Populations","229308887":"Evaluating the demographic history of the Seychelles kestrel (Falco araea): Genetic evidence for recovery from a population bottleneck following minimal conservation management","7014933":"Natural selection and population dynamics","228331804":"Diversifying Selection Underlies the Origin of Allozyme Polymorphism at the Phosphoglucose Isomerase Locus in Tigriopus californicus","258350310":"Robust Demographic Inference from Genomic and SNP Data","262286115":"Unsupervised Bayesian Part of Speech Inference with Particle Gibbs","227522317":"Particle Markov Chain Monte Carlo . . .","227644434":"On the Flexibility of Metropolis–Hastings Acceptance Probabilities in Auxiliary Variable Proposal Generation","23306983":"Inferring population history with DIY ABC: a user-friendly approach to Approximate Bayesian","233672297":"Hansen MM, Nielsen EE, Mensberg KLD. Underwater but not out of sight: genetic monitoring of effective population size in the endangered North Sea houting (Coregonus oxyrhynchus). Can J Fish Aquat Sci 63: 780-787","259119094":"Simulation-based Bayesian inference for epidemic models","258066406":"Effective Population Size, Genetic Variation, and Their Relevance for Conservation: The Bighorn Sheep in Tiburon Island and Comparisons with Managed Artiodactyls","285648009":"Bayesian non-parametric inference for $\\Lambda$-coalescents: consistency and a parametric method","231609430":"Convergence properties of pseudo-marginal Markov chain Monte Carlo\nalgorithms","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","259933410":"Tempering by Subsampling","264562265":"Forward Simulation Markov Chain Monte Carlo with Applications to Stochastic Epidemic Models: Forward simulation MCMC","282524235":"A unified framework for multilevel uncertainty quantification in Bayesian inverse problems","221707689":"Bayesian Parameter Estimation for Latent Markov Random Fields and Social\nNetworks","261065488":"Noisy Monte Carlo: Convergence of Markov chains with approximate transition kernels","51666613":"Effective population size of natural populations of Drosophila buzzatii, with a comparative evaluation of nine methods of estimation","264123679":"A transdimensional approximate Bayesian computation using the pseudo-marginal approach for model choice","276259541":"Bayesian Multilevel Model Calibration for Inverse Problems Under Uncertainty with Perfect Data","23770822":"Correcting for ascertainment bias in the inference of population structure","8228817":"Major histocompatibility complex and microsatellite variation in two populations of wild gorillas","6505933":"Demographic and Genetic Estimates of Effective Population and Breeding Size in the Amphibian Rana temporaria","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","8660534":"Beaumont, M. A. Recent developments in genetic data analysis: what can they tell us about human demographic history? Heredity 92, 365-379","284096861":"The Correlated Pseudo-Marginal Method","264636275":"Investigating Population History Using Temporal Genetic Differentiation","40851929":"Major histocompatibility complex and microsatellite variation in two populations of wild gorillas","266147947":"AABC: Approximate approximate Bayesian computation for inference in population-genetic models","226711867":"Estimation of census and effective population sizes: The increasing usefulness of DNA-based approaches","288479627":"Evolutionary distinctiveness and historical decline in genetic diversity in the Seychelles Black Parrot Coracopsis nigra barklyi","33711544":"Conservation biology of the Cross River gorilla (Gorilla gorilla diehli) /","223978979":"Short-Term Genetic Changes: Evaluating Effective Population Size Estimates in a Comprehensively Described Brown Trout (Salmo trutta) Population","7605704":"Waples RS.. Genetic estimates of contemporary effective population size: to what time periods do the estimates apply? Mol Ecol 14: 3335-3352","274730206":"The Metropolis—Hastings Algorithm","38058235":"ABC: A useful Bayesian tool for the analysis of population data","236264661":"A Monte Carlo Metropolis-Hastings Algorithm for Sampling from Distributions with Intractable Normalizing Constants","259572152":"Uniform Ergodicity of the Particle Gibbs Sampler","227640914":"Effects of habitat fragmentation, population size and demographic history on genetic diversity: The Cross River gorilla in a comparative context","5357460":"Estimation of 2Nes From Temporal Allele Frequency Data","259010234":"Bayesian Inference for Gaussian Process Classifiers with Annealing and Exact-Approximate MCMC","7150499":"Aspi J, Roininen E, Ruokonen M, Kojola I, VilÀ C. Genetic diversity, population structure, effective population size and demographic history of the Finnish wolf population. Mol Ecol 15: 1561-1576","228739696":"Bayesian Inference for Irreducible Diffusion Processes Using the Pseudo-Marginal Approach","45910632":"Constructing Summary Statistics for Approximate Bayesian Computation:\nSemi-automatic ABC","262767485":"Lazy ABC","265076505":"Modern Computational Statistics: Alternatives to MCMC","230547813":"Genetic Consequences of Reintroductions and Insights from Population History","232689924":"Leberg P. Genetic approaches for estimating the effective size of populations. J Wildl Manage 69: 1385-1399","230858014":"Rise and fall of a wolf population: Genetic diversity and structure during recovery, rapid expansion and drastic decline","264834090":"Static-parameter estimation in piecewise deterministic processes using particle Gibbs samplers","260395360":"Simultaneous reconstruction of evolutionary history and epidemiological dynamics from viral sequences with the birth–death SIR model","257795770":"Development and characterization of eight polymorphic tetra-nucleotide microsatellite markers for the threatened leopard darter (Percina pantherina)","267865371":"Introduction to On the use of Markov chain Monte Carlo methods for the sampling of mixture models by R. Douc, F. Maire, J. Olsson","231743009":"Birds in space and time: Genetic changes accompanying anthropogenic habitat fragmentation in the endangered black-capped vireo (Vireo atricapilla)","7658374":"Detecting historical bottlenecks using temporal genetic data.","260232570":"Sequential Quasi-Monte Carlo","257076137":"Particle Metropolis Hastings using Langevin dynamics","38098878":"Saving Darwin\u0027s muse: evolutionary genetics for the recovery of the Floreana mockingbird","234000143":"The Effective Population Size of Malaria Mosquitoes: Large Impact of Vector Control","51140083":"Coombs JA, Letcher BH, Nislow KH. CREATE: software to create input files from diploid genotypic data for 52 genetic software programs. Mol Ecol Resour 8: 578-580"},"index":21}