{"abs":"For mixed uncertainties of random variables and fuzzy variables in engineering, three indices, that is, interval reliability index, mean reliability index, and numerical reliability index, are proposed to measure safety of structure. Comparing to the reliability membership function for measuring the safety in case of mixed uncertainties, the proposed indices are more intuitive and easier to represent the safety degree of the engineering structure, and they are more suitable for the reliability design in the case of the mixed uncertainties. The differences and relations among three proposed indices are investigated, and their applicability is compared. Furthermore, a technique based on the probability density function evolution method is employed to improve the computational efficiency of the proposed indices. At last, a numerical example and two engineering examples are illustrated to demonstrate the feasibility, reasonability, and efficiency of the computational technique of the proposed indices.","title":"Reliability Analysis in Presence of Random Variables and Fuzzy Variables","id":276393837,"url":"https://www.researchgate.net/publication/276393837_Reliability_Analysis_in_Presence_of_Random_Variables_and_Fuzzy_Variables","names":["Cui Lijie","Lü Zhenzhou","Li Guijie","Journal of Applied Mathematics"],"references":{"245186078":"A note on the principle of preservation of probability and probability density evolution equation","238362738":"Uncertainty Propagation Using Possibility Theory and Function Approximations","257391583":"Alternative representations of epistemic uncertainty","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","235963778":"Mean Flow time minimization with given bounds of processing times","260489683":"Nondeterministic \"Possibilistic\" Approaches for Structural Analysis and Optimal Design","253141248":"Optimized Vertex Method and Hybrid Reliability","223038481":"Fuzzy Weighted Averages andImplementation of the Extension Principle","245424060":"Structural System Reliability Quantification Using Multipoint Function Approximations","241716277":"The dominance digraph as a solution to the two-machine flow-shop problem with interval processing times","226389792":"The Number Theoretical Method in Response Analysis of Nonlinear Stochastic Structures","248560911":"Importance sampling in structural system","265710665":"Applications of Number Theory to Numerical Analysis","245151678":"Confidence bounds on component reliability in the presence of mixed uncertain variables","250697109":"Safety assessment of structures in view of fuzzy randomness","245211768":"System reliability analysis for mixed uncertain variables","223030637":"Reliability engineering: old problems and new challenges. Reliab Eng Syst Saf","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","223791793":"Subset simulation for structural reliability sensitivity analysis","290484707":"The probability density evolution analysis of stochastic dynamic systems","20899978":"The Concept of Probability if Safety Assessments of Technological Systems","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","237076951":"Fuzzy Sets","222136330":"The equivalent extreme-value event and evaluation of the structural system reliability","221994624":"Higher-Order Fa ilure Probability Calculation Using Nonlinear Approximations","268022086":"Probability density evolution analysis of nonlinear dynamical systems"},"citedIn":{},"index":211}