{"abs":"The region around Taiwan is known for high seismicity. Under the circumstances, seismic hazard assessments and proper earthquake-resistant designs are essential to the region. From a well-studied earthquake catalog, this paper presents the statistics of major earthquakes (i.e., moment magnitude Mw≥5.5 and distance ≤200km) around the most important city in Taiwan (i.e., Taipei). The analysis shows that the mean annual rate of the major earthquakes is 2.79 around the city, with mean magnitude and SD equal to Mw 6.12 and 0.68, respectively, and mean source-to-site distance and SD equal to 129 and 39 km, respectively. With the earthquake statistics and local ground motion models, a seismic hazard assessment was conducted with Monte Carlo simulations (MCSs). The analysis shows the mean rate for peak ground acceleration ≥0.23g (where g is gravitational acceleration) should be around 0.013 per year, indicating that the current design peak ground acceleration in Taipei. From this paper, the current seismic design in Taipei might not be as conservative as expected, and a review and revision could be needed for assuring the city\u0027s seismic safety against high seismicity in the region.","title":"Major Earthquakes around Taipei and a Seismic Hazard Assessment with Monte Carlo Simulation","id":283240777,"url":"https://www.researchgate.net/publication/283240777_Major_Earthquakes_around_Taipei_and_a_Seismic_Hazard_Assessment_with_Monte_Carlo_Simulation","names":["Jp Wang","Y. M. Wu","Duruo Huang","Natural Hazards Review"],"references":{"265629877":"A Monte Carlo Approach in Estimating Uncertainty for a Seismic Hazard Assessment of Los Angeles, Ventura, and Orange Counties, California","233824078":"Seismic Quiescence before the 1999 Chi-Chi, Taiwan, Mw 7.6 Earthquake","256939026":"Seismic hazard analyses for Taipei city including deaggregation, design spectra, and time history with excel applications","257940410":"Probability Concepts in Engineering: Emphasis on Applications in Civil \u0026 Environmental Engineering","245130842":"Seismic hazard model for loss estimation and risk management in Taiwan","235237282":"Earthquakes Cannot Be Predicted","222417321":"Equivalent linearization and Monte Carlo simulation in stochastic dynamics","222566607":"Seismicity characteristics before the 2003 Chengkung, Taiwan Mw6.8 earthquake","236456212":"Prehistoric earthquakes along the Shanchiao Fault, Taipei Basin, northern Taiwan","257102175":"Probability-based PGA estimations using the double-lognormal distribution: Including site-specific seismic hazard analysis for four sites in Taiwan","256938748":"Deterministic seismic hazard map for Taiwan developed using an in-house Excel-based program","228684368":"A Comprehensive Relocation of Earthquakes in Taiwan from 1991 to 2005","276964817":"New Evidence and Perspective to the Poisson Process and Earthquake Temporal Distribution from 55,000 Events around Taiwan since 1900","26547494":"Development of an Earthquake Early Warning System Using Real-Time Strong Motion Signals","222685398":"Seismic reversal pattern for the 1999 Chi-Chi, Taiwan, MW 7.6 earthquake","226085292":"The distribution of annual maximum earthquake magnitude around Taiwan and its application in the estimation of catastrophic earthquake recurrence probability","222204713":"A new prototype system for earthquake early warning in Taiwan","228411591":"Response Spectral Attenuation Relations for Shallow Crustal Earthquakes in Taiwan","253464448":"A Catalog of Taiwan Earthquakes (1900-2006) with Homogenized Mw Magnitudes","228637532":"Study on probabilistic seismic hazard maps of Taiwan after Chi-Chi earthquake. J GeoEng","221678251":"Geotechnical Earthquke Engineering","248560911":"Importance sampling in structural system"},"citedIn":{},"index":212}