{"abs":"This short note is a self-contained and basic introduction to the Metropolis-Hastings algorithm, this ubiquitous tool used for producing dependent simulations from an arbitrary distribution. The document illustrates the principles of the methodology on simple examples with R codes and provides references to the recent extensions of the method.","title":"The Metropolis—Hastings Algorithm","id":274730206,"url":"https://www.researchgate.net/publication/274730206_The_Metropolis-Hastings_Algorithm","names":["Christian P. Robert"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","227522317":"Particle Markov Chain Monte Carlo . . .","200622065":"Equation of State Calculations by Fast Computing Machines","2762543":"Adaptive proposal distribution for random walk Metropolis algorithm. Comput Stat","273157850":"Accelerating Metropolis-Hastings algorithms by Delayed Acceptance","227197084":"Langevin-Type Models II: Self-Targeting Candidates for MCMC Algorithms*","231609430":"Convergence properties of pseudo-marginal Markov chain Monte Carlo\nalgorithms","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","38357609":"Markov Chains for Exploring Posterior Distributions","229738641":"Parameterization and inference for nonparametric regression problems","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","2358401":"Exponential Convergence of Langevin Diffusions and Their Discrete Approximations","226046683":"Langevin-Type Models I: Diffusions with Given Stationary Distributions and their Discretizations*","259334992":"Parallel MCMC via Weierstrass Sampler","228789130":"Examples of adaptive MCMC","264960099":"Perfect simulation and backward coupling","227375782":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods","225291078":"MCMC using Hamiltonian dynamics","243783980":"Fully Exponential Laplace Approximations of Expectations and Variances of Non-Positive Functions","41222616":"Introducing Monte Carlo Methods with R (Use R!)","271512988":"Markov Chains for exploring posterior distributions (with discussion)","267157208":"The Geometric Foundations of Hamiltonian Monte Carlo","27468515":"An efficient MCMC method for distributions with intractable normalising constants","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","2852713":"A Simulation Approach to Convergence Rates for Markov Chain Monte Carlo Algorithms","234014394":"The Monte Carlo method","222688524":"Perfect sampling from independent Metropolis-Hastings chains","221618815":"Nested sampling for Potts models","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","4812038":"AMCMC: An R interface for adaptive MCMC","246868729":"Monte Carlo Calculations of the Radial Distribution Functions for a Proton?Electron Plasma","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","220423678":"A Spectral Method for Confidence Interval Generation and Run-Length Control in Simulations","269339241":"Testing hypotheses via a mixture estimation model","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","228092010":"MCMC for doubly-intractable distributions","38340154":"A Mixture Representation of π with Applications in Markov Chain Monte Carlo and Perfect Sampling","48182441":"SMC2: An efficient algorithm for sequential analysis of state space models","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","261683938":"Parallel Markov chain Monte Carlo Simulation by Pre-Fetching","2352607":"Evaluating the Accuracy of Sampling-Based Approaches to the Calculation of Posterior Moments","4993330":"Sequential Monte Carlo Samplers"},"citedIn":{},"index":217}