{"abs":"Asymptotic approximations and importance sampling methods are presented for evaluating a class of probability integrals with multiple design points that may arise in the calculation of the reliability of uncertain dynamical systems. An approximation based on asymptotics is used as a first step to provide a computationally efficient estimate of the probability integral. The importance sampling method utilizes information of the integrand at the design points to substantially accelerate the convergence of available importance sampling methods that use information from one design point only. Implementation issues related to the choice of importance sampling density and sample generation for reducing the variance of the estimate are addressed. The computational efficiency and improved accuracy of the proposed methods is demonstrated by investigating the reliability of structures equipped with a tuned mass damper for which multiple design points are shown to contribute significantly to the value of the reliability integral.","title":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","id":228589716,"url":"https://www.researchgate.net/publication/228589716_Reliability_of_Uncertain_Dynamical_Systems_with_Multiple_Design_Points","names":["Siu-Kui Au","C Papadimitriou","J.L. Beck","Structural Safety"],"references":{"222165116":"Observations on applications of importance sampling in structural reliability analysis","245285335":"Reliability of Uncertain Nonlinear Trusses Under Random Excitation. II","247258992":"Probabilistic Theory of Structural Dynamics","225900475":"Generalized Trajectory Methods for Finding Multiple Extrema and Roots of Functions","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","243007092":"Uniform asymptotic expansions of double integrals","38336219":"A Theorem on the Asymptotic Behavior of a Multiple Integral","275188793":"Asymptotic Approximations for Multinormal Integrals","28784873":"Asymptotic Expansions for Reliabilities and Moments of Uncertain Dynamic Systems","223307920":"Multiple design points in first and second-order reliability","248560911":"Importance sampling in structural system","239065374":"Probabilistic Theories of Structural Dynamics","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","236660920":"Methods of Structural Safety","245301372":"Basic Analysis of Structural Safety","265794417":"Method of Structural Safety","256421487":"Asymptotic importance sampling","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","273800443":"Second‐Order Reliability Approximations","273800355":"Probability Integration by Directional Simulation","225805894":"Asymptotic approximations for multinormal domain and surface integrals","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","222790897":"On fast integration for time variant structural reliabiity","222945716":"Optimization algorithms for structural reliability","223891815":"Adaptive hybrid conditional expectation approaches for reliability estimation"},"citedIn":{"267334762":"Reliability analysis of structures with complex limit state functions using probability density evolution method","225328104":"Uncertainty estimation of reliability redundancy in complex systems based on the Cross-Entropy method","222297911":"A multi-point univariate decomposition method for structural reliability analysis","283669473":"Confidence Bounds on Failure Probability Using MHDMR","264358861":"Authors\u0027 reply to discussion of the paper ‘Multi-criteria optimal structural design under uncertainty’","251320565":"FINITE ELEMENT RESPONSE SENSITIVITY, PROBABILISTIC RESPONSE AND RELIABILITY ANALYSES","222395601":"Updating robust reliability using structural test data. Probabilist Eng Mech","245425207":"Reliability-Based Optimization of Uncertain Systems in Structural Dynamics","223106779":"Important sampling in high dimensions","245276934":"Approche non-probabiliste de fiabilité basée sur les modèles convexes","245425337":"Design Strategy with a Class of Structural Reliability Models of High Dimension","223269332":"Computational methods for accounting of structural uncertainties, applications to dynamic behavior prediction of piping systems","245287045":"A New Multidimensional Visualization Technique for Limit-State Surfaces in Nonlinear Finite Element Reliability Analysis","252871436":"Lecture Notes on Stochastic System Analysis","221911077":"Practical Monte Carlo Based Reliability Analysis and Design Methods for Geotechnical Problems","282132593":"A Review of Model Updating Methods for Civil Infrastructure Systems","227878324":"Structural damage detection and assessment by adaptive Markov chain Monte Carlo simulation","228519485":"Lifetime reliability based design of an offshore vessel mooring","264175381":"Ambient modal identification of structures equipped with tuned mass dampers using parallel factor blind source separation","223937897":"Reliability-based optimal design of linear dynamical systems under stochastic stationary excitation and model uncertainty","267487808":"A Filter-Based Sample Average SQP for Optimization Problems With Highly Nonlinear Probabilistic Constraints","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","264349943":"Passive systems failure probability estimation by the meta-AK-IS2 algorithm","222780925":"A new adaptive importance sampling scheme","270979226":"A novel adaptive importance sampling algorithm based on Markov chain and low-discrepancy sequence","229979402":"Analytical Approximation for Stationary Reliability of Certain and Uncertain Linear Dynamic Systems with Higher Dimensional Output","227528395":"Reliability‐based robust control for uncertain dynamical systems using feedback of incomplete noisy response measurements","269777234":"Spectral representation-based neural network assisted stochastic structural mechanics","279211885":"An active learning Kriging model for hybrid reliability analysis with both random and interval variables","222515596":"Reliability analysis of randomly vibrating structures with parameter uncertainties","228667891":"A NEW HYBRID RELIABILITY ANALYSIS METHOD: THE DESIGN POINT-RESPONSE SURFACE-SIMULATION METHOD","245286221":"Closure to “New Approximations for Reliability Integrals” by David C. Polidori, James L. Beck, and Costas Papadimitriou","260938327":"Decentralized modal identification of structures using parallel factor decomposition and sparse blind source separation","261134031":"Multicut-High Dimensional Model Representation for Structural Reliability Bounds Estimation Under Mixed Uncertainties","238179410":"Reliability-Based Performance Objectives and Probabilistic Robustness in Structural Control Applications","282010414":"A Review of Model Updating Methods for Civil Infrastructure Systems","222875823":"An efficient simulation method for reliability analysis using simple additive rules of probability","264560163":"Efficient approach for reliability-based optimization based on weighted importance sampling approach","270006896":"Dealing with uncertainty in model updating for damage assessment: A review","228661833":"FRAMEWORK FOR FINITE ELEMENT RESPONSE SENSITIVITY AND RELIABILITY ANALYSES OF STRUCTURAL AND GEOTECHNICAL SYSTEMS","227335524":"Application of saddlepoint approximation in reliability analysis of dynamic systems","263989712":"Membership function of failure probability using multicut-high dimensional model representation","276995436":"On the long-term fatigue assessment of mooring and riser systems","263666649":"An improved adaptive kriging-based importance technique for sampling multiple failure regions of low probability","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","222675510":"First excursion probability for linear systems by very efficient algorithm","222317364":"Robust Reliability-based Design of Liquid Column Mass Dampers under Earthquake Excitation using an Analytical Reliability Approximation","259313164":"Bayesian Methods for Structural Dynamics and Civil Engineering","264436920":"Reliability analysis using a \u0027Taylor expansion-expected value\u0027 saddlepoint approximation"},"index":22}