{"abs":"The use of unbiased estimators within the Metropolis--Hastings has found numerous applications in Bayesian statistics. The resulting so-called pseudo-marginal algorithm allows us to substitute an unbiased Monte Carlo estimator of the likelihood for the true likelihood which might be intractable or too expensive to compute. Under regularity conditions, it has been established that an efficient implementation of this algorithm requires the variance of the estimator of the log-likelihood ratio appearing in the acceptance probability of the pseudo-marginal algorithm to be of order 1 for $T$ data points as $T\\rightarrow\\infty$, which in turn typically requires scaling the number $N$ of Monte Carlo samples linearly with $T$. We propose a simple and widely applicable modification of the pseudo-marginal algorithm, termed the correlated pseudo-marginal algorithm, which relies on an estimator of the log-likelihood ratio whose variance is shown to be of order $1$ as $N,T\\rightarrow\\infty$ whenever $N/T\\rightarrow0$. Experimentally, the efficiency of computations is increased relative to the standard pseudo-marginal algorithm by up to 180-fold in our simulations.","title":"The Correlated Pseudo-Marginal Method","id":284096861,"url":"https://www.researchgate.net/publication/284096861_The_Correlated_Pseudo-Marginal_Method","names":["George Deligiannidis","Arnaud Doucet","Michael K. Pitt","Robert Kohn"],"references":{"1993692":"A Noisy Monte Carlo Algorithm","3361206":"Novel Approach to Nonlinear/Non-Gaussian Bayesian State Estimation","221667313":"On Disturbance State-Space Models and the Particle Marginal Metropolis-Hastings Sampler","41219902":"Using systematic sampling selection for Monte Carlo solutions of Feynman-Kac equations","232062873":"Efficient implementation of Markov chain Monte Carlo when using an unbiased likelihood estimator","243963611":"A Lognormal Central Limit Theorem for Particle Approximations of Normalizing Constants","23566004":"Bayesian inference based only on simulated likelihood: Particle filter analysis of dynamic economic models","231609430":"Convergence properties of pseudo-marginal Markov chain Monte Carlo\nalgorithms","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","2179960":"The Penalty Method for Random Walks with Uncertain Energies","275981329":"Convergence of Probability Measures","239059228":"A Course in Large Sample Theory","259571985":"Particle Gibbs with Ancestor Sampling","232844234":"Almost sure weak convergence of random probability measures","38329826":"Central limit theorem for additive functionals of reversible Markov processes and applications to simple exclusion, Commun. Math. Phys. 106, 1-19","215446267":"Monte Carlo Strategies in Scientic Computing","6676042":"Inference for nonlinear dynamical systems","230779571":"Bayesian inference for nonlinear structural time series models","48182441":"SMC2: An efficient algorithm for sequential analysis of state space models","229392026":"Particle filters for continuous likelihood evaluation and maximisation","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","236853542":"Inference in Hidden Markov Models","260232570":"Sequential Quasi-Monte Carlo","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","284675338":"Particle Markov chain Monte Carlo methods (with discussion)","277772787":"Towards Smooth Particle Filters for Likelihood Estimation with Multivariate Latent Variables"},"citedIn":{"284219590":"Accelerating pseudo-marginal Metropolis-Hastings by correlating auxiliary variables"},"index":220}