{"abs":"The role of past climatic change in shaping the distributions of tropical rain forest vertebrates is central to long-standing hypotheses about the legacy of the Quaternary ice ages. One approach to testing such hypotheses is to use genetic data to infer the demographic history of codistributed species. Population genetic theory that relates the structure of allelic genealogies to historical changes in effective population size can be used to detect a past history of demographic expansion or contraction. The fruit bats Cynopterus sphinx and C. brachyotis (Chiroptera: Pteropodidae) exhibit markedly different distribution patterns across the Indomalayan region and therefore represent an exemplary species pair to use for such tests. The purpose of this study was to test alternative hypotheses about historical patterns of demographic expansion and contraction in C. sphinx and C. brachyotis using a coalescent-based analysis of microsatellite variation. Specifically, we used a hierarchical Bayesian model based on Markov chain Monte Carlo simulations to estimate the posterior distribution of genealogical and demographic parameters. The results revealed strong evidence for population contraction in both species. Evidence for a population contraction in C. brachyotis was expected on the basis of biogeographic considerations. However, similar evidence for population contraction in C. sphinx does not support the hypothesis that this species underwent a pronounced range expansion during the late Quaternary. Genetic evidence for population decline may reflect the consequences of habitat destruction on a more recent time scale.","title":"Testing for Genetic Evidence of Population Expansion and Contraction: An Empirical Analysis of Microsatellite DNA Variation Using a Hierarchical Bayesian Model","id":11450188,"url":"https://www.researchgate.net/publication/11450188_Testing_for_Genetic_Evidence_of_Population_Expansion_and_Contraction_An_Empirical_Analysis_of_Microsatellite_DNA_Variation_Using_a_Hierarchical_Bayesian_Model","names":["Jay F Storz","Mark A Beaumont","Evolution"],"references":{"12720579":"Nonequilibrium Migration in Human History","14378842":"Coalescents and Genealogical Structure Under Neutrality","271241512":"The Mammals of the Indomalayan Region: A Systematic Review","223995741":"FSTAT (Version 1.2): A computer program to calculate F-Statistics","14082387":"The Effective Size of a Subdivided Population","235234061":"The Refugial Debate","283603950":"Conservation planning for the Western Ghats of Kerala: II. Assessment of habitat loss and degradation","11867839":"Genetic Consequences of Polygyny and Social Structure in an Indian Fruit Bat, Cynopterus sphinx . I. Inbreeding, Outbreeding, and Population Subdivision","12720591":"Detecting Population Expansion and Decline Using Microsatellites","231846236":"Microsatellite analysis of genetic diversity in fragmented South African buffalo populations","228779181":"Dispersion and site fidelity in a tent-roosting population of the short-nosed fruit bat (Cynopterus sphinx) in southern India","271689150":"The Effective Size of a Hierarchically Structured Population","20009504":"Hudson RR, Kaplan NL.. The coalescent process in models with selection and recombination. Genetics 120: 831-840","247604305":"The Distribution of Vertebrate Animals in India, Ceylon, and Burma","226673681":"Climate Change and Tropical Forests in India","51331611":"Heterogeneity of microsatellite mutations within and between loci, and implications for human demographic history","229099827":"General Methods for Monitoring Convergence of Iterative Simulations","229639972":"The Asian Colobinae (Mammalia: Cercopithecidae) as indicators of Quaternary climate change","225782371":"Evolutionary dynamics of microsatellite DNA","4752593":"Inference in Molecular Population Genetics","12318884":"Microsatellites can be misleading: An empirical and simulation study","239384155":"General Methods for Monitoring Convergence of Iterative Simulations","216613702":"Beaumont MA, Nichols RA. Evaluating loci for use in the genetic analysis of population structure. Proc R Soc Lond Ser B-Biol Sci 263: 1619-1626","20543115":"The “Hitchhiking effect” revisited","242876751":"A δ13C record of late Quaternary climate change from tropical peats in southern India","27669009":"Onset of an arid climate at 3.5 ka in the tropics: Evidence from monsoon upwelling record","277749945":"Late Quaternary vegetational and climatic changes from tropical peats in southern India-An extended record up to 40,000 years B.P. Curr Sci","13765998":"Genetic traces of ancient demography. Proc Natl Acad Sci USA","227610451":"Social structure of a polygnous tent-making bat, Cynopterus sphinx (Mega-chiroptera)","13559565":"Genealogical Inference From Microsatellite Data","271241065":"Bats of Indian Subcontinent","267026473":"Fluctuating Population Size and the Ratio of Effective to Census Population Size","12457723":"Thomson R, Pritchard JK, Shen P, Oefner PJ, Feldman MW. Recent common ancestry of human Y chromosomes: evidence from DNA sequence data. Proc Natl Acad Sci USA 97: 7360-7365","246912625":"Mutation and migration in models of microsatellite evolution","18454225":"Lewontin RC, Krakauer J. Distribution of gene frequency as a test of theory of selective neutrality of polymorphisms. Genetics 74: 175-195","12224755":"Ellegren, H. Microsatellite mutations in the germline: implications for evolutionary inference. Trends Genet. 16, 551-558","14230035":"Testing Differentiation in Diploid Populations","12594315":"Perspectives: paleoecology. The refugial debate.","13362695":"The Use of Microsatellite Variation to Infer Population Structureand Demographic History in a Natural Model System","15575457":"Goldstein DB, Ruiz LA, Cavalli-Sforza LL, Feldman MW. Genetic absolute dating based on microsatellites and the origin of modern humans. Proc Natl Acad Sci USA 92: 6723-6727","12254455":"Evolutionary dynamic of microsatellite DNA","12696590":"Population growth of human Y chromosomes: A study of Y chromosome microsatellites","227623232":"Markov Chain Monte Carlo Method and its applications","221995881":"Bayesian Data Analysis, London","221957999":"A less humid climate since ca. 3500yr BP from marine cores off Karwar, western India. Palaegeogr. Palaeoclim. Palaeoecol 109, 371-384","225137084":"Climatic implications of δ13C and δ18O ratios from C3 and C4 plants growing in a tropical montane habitat in southern India","223338008":"Estimates of Holocene precipitation for Rajesthan, India, based on pollen and lake-level data. Quat Res","230892436":"Monsoon variability over the past 150,000 years. J Geophys Res","13720840":"Kimmel, M. et al. Signatures of population expansion in microsatellite repeat data. Genetics 148, 1921-1930","12438500":"Hewitt GM.. The genetic legacy of the Quaternary ice ages. Nature 405: 907-913","14822969":"The Effect of Deleterious Mutations on Neutral Molecular Variation","227502801":"Microsatellites can be misleading: an empirical and simulation study. Evolution","19751410":"Avise JC, Ball RM, Arnold J.. Current versus historical population sizes in vertebrate species with high gene flow-a comparison based on mitochondrial-DNA lineages and inbreeding theory for neutral mutations. Mol Biol Evol 5: 331-344","273054758":"Climate Change and Its Impact on Tropical Montane Ecosystems in Southern India","232786817":"Wang JL, Caballero A. Developments in predicting the effective size of subdivided populations. Heredity 82: 212-226","12204505":"Variation at tri- and tetranucleotide repeat microsatellite loci in the fruit bat genus Cynopterus (Chiroptera: Pteropodidae)","15038977":"Mutational processes of simple-sequence repeat loci in human populations. Proc Nat Acad Sci USA","275623947":"Atlas of Paleoclimates and Paleoenvironments of the Northern Hemisphere: Late Pleistocene-Holocene","229270594":"Sharp Decrease in Summer Monsoon Strength 4000–3500 cal yr B.P. in the Central Higher Himalaya of India Based on Pollen Evidence from Alpine Peat","12574422":"Ellegren H. Heterogeneous mutation processes in human microsatellite DNA sequences. Nat Genet 24: 400-402","14140218":"Inferring Coalescence Times From DNA Sequence Data","38348711":"Local Likelihood Density Estimation","13631935":"Genetic Evidence for a Paleolithic Human Population Expansion in Africa","12217038":"A Power Analysis of Microsatellite-Based Statistics for Inferring Past Population Growth","13697700":"Mutation Rate in Human Microsatellites: Influence of the Structure and Length of the Tandem Repeat","11867840":"Genetic Consequences of Polygyny and Social Structure in an Indian Fruit Bat, Cynopterus sphinx . II. Variance in Male Mating Success and Effective Population Size","227643750":"Clinal variation in body size and sexual dimorphism in an Indian fruit bat, Cynopterus sphinx (Chiroptera: Pteropodidae). Biol J Linn Soc","14598052":"Deleterious background selection with recombination","216300830":"R: A Language for Data Analysis and Graphics","274341153":"Cynopterus sphinx","259105549":"On the ecological history of the Western Ghats. Curr Sci","12569410":"Microsatellite mutations and inferences about human demography","246823371":"Microsatellite mutations in the germline","200102162":"Gene Genealogies and the Coalescent Process"},"citedIn":{"235883022":"Phylogenetic and Demographic Insights into Kuhl’s Pipistrelle, Pipistrellus kuhlii, in the Middle East","233402348":"Scientific Review of the Draft Northern Spotted Owl Recovery Plan and Reviewer Comments","51417879":"Okello JBA, Wittemyer G, Rasmussen HB, Arctander P, Nyakaana S, Douglas-Hamilton I et al.. Effective population size dynamics reveal impacts of historic climatic events and recent anthropogenic pressure in African elephants. Mol Ecol 17: 3788-3799","276852877":"Ex situ seed collections will benefit from considering spatial sampling design and species’ reproductive biology","280734383":"Genetic diversity is maintained in the endangered New Zealand long-tailed bat (Chalinolobus tuberculatus) despite a closed social structure and regular population crashes","230723541":"Signature of a Pre-Human Population Decline in the Critically Endangered Reunion Island Endemic Forest Bird Coracina newtoni","51119888":"Waples RS. Spatial-temporal stratifications in natural populations and how they affect understanding and estimate of population size. Mol Ecol Resour 10: 785-796","40268353":"Diversité génétique et taille efficace chez les populations de poissons sauvages : le cas du saumon atlantique un poisson migrateur amphihalin menacé","275383874":"Inferring past demographic changes in a critically endangered marine fish after fishery collapse","228018110":"Modeling human genetic history","225347908":"Endangered species in small habitat patches can possess high genetic diversity: The case of the Tana River red colobus and mangabey","263894416":"Optimal sampling of seeds from plant populations for ex-situ conservation of genetic biodiversity, considering realistic population structure","280736912":"Genetic Signatures of Demographic Changes in an Avian Top Predator during the Last Century: Bottlenecks and Expansions of the Eurasian Eagle Owl in the Iberian Peninsula","234061250":"Genetic evidence of reproductive isolation in a remote enclave of Quercus pubescens in the presence of cross-fertile species","51872548":"Impact of Human Management on the Genetic Variation of Wild Pepper, Capsicum annuum var. glabriusculum","260379569":"Combining genetic and demographic data for prioritizing conservation actions: Insights from a threatened fish species","264241031":"So, you want to use next-generation sequencing in marine systems? Insight from the Pan-Pacific Advanced Studies Institute","6478427":"Beyond the point of no return? A comparison of genetic diversity in captive and wild populations of two nearly extinct species of Goodeid fish reveals that one is inbred in the wild","264984562":"Phylogeographic structure, demographic history and morph composition in a colour polymorphic lizard","43099818":"Likelihood-Free Inference of Population Structure and Local Adaptation in a Bayesian Hierarchical Model","262046629":"Greece: A Balkan Subrefuge for a Remnant Red Deer (Cervus Elaphus) Population","283907281":"Phylogeography and demographic history of Shaw\u0027s Jird (Meriones shawii complex) in North Africa","274732639":"Fine-scale genetic analysis of the exploited Nile monitor (Varanus niloticus) in Sahelian Africa","288933242":"Genetic consequences of human forest exploitation in two colobus monkeys in Guinea Bissau","230603260":"Population structure and landscape genetics in the endangered subterranean rodent Ctenomys porteousi","259452722":"Yannic et al supplementary material","236664925":"Pujolar JM, Jacobsen MW, Frydenberg J, Als TD, Larsen PF, Maes GE et al.. A resource of genome-wide single-nucleotide polymorphisms generated by RAD tag sequencing in the critically endangered European eel. Mol Ecol Res 113: 706-714","223995669":"Genetic structure of an isolated population of mantled howler monkeys (Alouatta palliata) on Barro Colorado Island, Panama","26741719":"Why the Indian Subcontinent Holds the Key to Global Tiger Recovery","259204391":"Mitochondrial introgressive hybridization following a demographic expansion in the tomato frogs of Madagascar, genus Dyscophus","256441116":"Population structure, long-term connectivity, and effective size of mutton snapper (Lutjanus analis) in the Caribbean Sea and Florida Keys","256441117":"Conservation Genetics of an Undescribed Species of Dionda (Teleostei: Cyprinidae) in the Rio Grande Drainage in Western Texas","271922285":"Population structure and conservation genetic assessment of the endangered Pugnose Shiner, Notropis anogenus","280579808":"Contrasting demographic history and gene flow patterns of two mangrove species on either side of the Central American Isthmus","11052787":"Genetic Evidence for Long-Term Population Decline in a Savannah-Dwelling Primate: Inferences from a Hierarchical Bayesian Model","235967564":"The consequences of the unlikely but critical assumption of stepwise mutation in the population genetic software, MSVAR","50347868":"Inferring Population Decline and Expansion From Microsatellite Data: A Simulation-Based Evaluation of the Msvar Method","254311285":"Genetic Divergence and Effective Size among Lane Snapper in U.S. Waters of the Western Atlantic Ocean","50265760":"Microsatellite DNA analyses of a highly disjunct New Zealand tree reveal strong differentiation and imply a formerly more continuous distribution. Mol Ecol","259627302":"Genetic Status and Timing of a Weevil Introduction to Santa Cruz Island, Galpagos","235897445":"Effective size and genetic composition of two exploited, migratory whitefish (Coregonus lavaretus lavaretus) populations","225577752":"Substantial molecular variation and low genetic structure in Kenya\u0027s black rhinoceros: Implications for conservation","225154308":"Looking backwards to look forwards: Conservation genetics in a changing world","44805848":"Population dynamics of American horseshoe crabs-historic climatic events and recent anthropogenic pressures. Mol Ecol","51857760":"Population divergence with or without admixture: Selecting models using an ABC approach","241054758":"Genetic diversity, population genetic structure and demographic history of Przewalski\u0027s gazelle (Procapra przewalskii): Implications for conservation","47554222":"Genetic variation and structure in Norwegian red deer","234090383":"Historical and Contemporary DNA Indicate Fisher Decline and Isolation Occurred Prior to the European Settlement of California","5848281":"Type 2 NF1 Deletions Are Highly Unusual by Virtue of the Absence of Nonallelic Homologous Recombination Hotspots and an Apparent Preference for Female Mitotic Recombination","267395954":"Genetic depletion at adaptive but not neutral loci in an endangered bird species","227201801":"Beyond FST: Analysis of population genetic data for conservation","237644461":"Conservation Genetics of Gray Snapper (Lutjanus griseus) in U.S. Waters of the Northern Gulf of Mexico and Western Atlantic Ocean","258066406":"Effective Population Size, Genetic Variation, and Their Relevance for Conservation: The Bighorn Sheep in Tiburon Island and Comparisons with Managed Artiodactyls","279915559":"Population structure of red snapper (Lutjanus campechanus) in U.S.waters of the western Atlantic Ocean and the northeastern Gulf ofMexico","236068504":"Recent Demographic History and Present Fine-Scale Structure in the Northwest Atlantic Leatherback (Dermochelys coriacea) Turtle Population","227739394":"Conservation genetics of threatened Mexican axolotls (Ambystoma)","220034956":"Genetic signatures of population change in the British Golden eagle (Aquila chrysaetos)","234128229":"The uncertainty of Late Pleistocene range expansions in the western Mediterranean: A case study of the colonization of south-eastern Spain by the spur-thighed tortoise, Testudo graeca","267627873":"Challenges in analysis and interpretation of microsatellite data for population genetic studies","270217358":"Changes in population size and genetic diversity of a raptor species occurring in the boreal forest of Saskatchewan","229462324":"Genetic data in population viability analysis: Case studies with ambystomatid salamanders","45827105":"Peter BM, Wegman D, Excoffier L.. Distinguishing between population bottleneck and population subdivision by a Bayesian model choice procedure. Mol Ecol 19: 4648-4660","43246089":"Conservation Implications of Drastic Reductions in the Smallest and Most Isolated Populations of Giant Pandas","226108896":"Historical and recent genetic bottlenecks in European Graylings, Thymallus thymallus","38077150":"Rapid radiation in spiny lobsters (Palinurus spp) as revealed by classic and ABC methods using mtDNA and microsatellite data","223783882":"Influence of forest fragmentation on an endangered large-bodied lemur in northwestern Madagascar. Biol Conserv","8923156":"The population genetics of a biological control introduction: mitochondrial DNA and microsatellie variation in native and introduced populations of Aphidus ervi, a parisitoid wasp.","261997312":"Revisiting the phylogeography and demography of European badgers (Meles meles) based on broad sampling, multiple markers and simulations","230265639":"Effect of oceanographic barriers and overfishing on the population genetic structure of the European spiny lobster (Palinurus elephas)","225285582":"Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities - Discussion","51728305":"Reproductive synchrony in a recovering bottlenecked sea turtle population","8077535":"An analysis of genetic diversity across the maize genome using microsatellites. Genetics","51798962":"Islands are not sinks of biodiversity in spore-producing plants","225285578":"Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities - Discussion","233739081":"Primate DNA suggests long-term stability of an African rainforest","7402715":"Phylogeographic summary statistics for testing simultaneous vicariance","8660534":"Beaumont, M. A. Recent developments in genetic data analysis: what can they tell us about human demographic history? Heredity 92, 365-379","264240394":"Signature of post-glacial expansion and genetic structure at the northern range limit of the speckled wood butterfly","263604481":"Conservation genetics and management of yellowtail snapper, Ocyurus chrysurus, in the US Caribbean and South Florida","8347842":"Conservation genetics and demographic history of the endangered Cape Fear shiner (Notropis mekistocholas)","225414610":"Rodrigues fruit bats (Pteropus rodricensis, Megachiroptera: Pteropodidae) retain genetic diversity despite population declines and founder events","7402702":"Comparative population structure of Cynopterus fruit bats in peninsula Malaysia and southern Thailand","38058235":"ABC: A useful Bayesian tool for the analysis of population data","236611802":"Hadly 2004","49722427":"MTML-msBayes: Approximate Bayesian comparative phylogeographic inference from multiple taxa and multiple loci with rate heterogeneity. BMC Bioinformatics 12:1","227397954":"Human influence on the population decline and loss of genetic diversity in a small and isolated population of Sichuan snub-nosed monkeys (Rhinopithecus roxellana","26883915":"Cibrian-Jaramillo A, Bacon CD, Garwood NC, Bateman RM, Thomas MM, Russell S et al.. Population genetics of the understory fishtail palm Chamaedorea ernesti-augusti in Belize: high genetic connectivity with local differentiation. BMC Genet 10: 65","233762623":"Timing and Pattern of Molt in Kuhl\u0027s Bat, Pipistrellus kuhlii, in Saudi Arabia","4771483":"Wilson IJ, Weale ME, Balding DJ. Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities. J Roy Stat Soc Ser A 166: 155-188","260399954":"Environmental factors to population structure in mobile marine organisms: a combined genetic-oceanographic approach in coastal cetaceans","232066824":"Low genetic variation support bottlenecks in Scandinavian red deer","276134059":"The Phylogeography and Population Demography of the Yunnan Caecilian (Ichthyophis bannanicus): Massive Rivers as Barriers to Gene Flow","227933557":"Conservation genetics of a critically endangered Iberian minnow: Evidence of population decline and extirpations","267240716":"HABITAT FRAGMENTATION, FUNCTIONAL LANDSCAPE CONNECTIVITY, AND METAPOPULATION PROCESSES IN AMPHIBIANS","242687632":"This submission is intended as Research Article","257924528":"The consequences of the unlikely but critical assumption of stepwise mutation in the population genetic software, MSVAR","233919744":"SPECIAL ISSUE: Genetic evidence of Quaternary demographic changes in four rain forest tree species sampled across the Isthmus of Panama","11016794":"Contrasting patterns of divergence in quantitative traits and neutral DNA markers: analysis of clinal variation","264165707":"Mixed Fortunes: Ancient Expansion and Recent Decline in Population Size of a Subtropical Montane Primate, the Arunachal Macaque Macaca munzala","282229799":"Evolutionary Dynamics of the Short-Nosed Fruit Bat, Cynopterus sphinx (Pteropodidae): Inferences from the Spatial Scale of Genetic and Phenotypic Differentiation","260995963":"Understanding population structure and historica demography in a conservation context: Population genetics of the endangered Kirengeshoma palmata (Hydrangeaceae)","233794838":"Population structure and landscape genetics in the endangered subterranean rodent Ctenomys porteousi","23267737":"Origin, Spread and Demography of the Mycobacterium tuberculosis Complex","279519827":"Genetic diversity and structure of Pinus dabeshanensis revealed by expressed sequence tag-simple sequence repeat (EST-SSR) markers","236966687":"The demographic history of populations experiencing asymmetric gene flow: Combining simulated and empirical data","256708680":"The genetic legacy of the 19th-century decline of the British polecat: Evidence for extensive introgression from feral ferrets","49947639":"Ecologie évolutive d\u0027un genre d\u0027acarien hématophage : approche phylogénétique des délimitations interspécifiques et caractérisation comparative des populations de cinq espèces du genre Dermanyssus (Acari : Mesostigmata)","26693766":"Sequencing Primate Genomes: What Have We Learned?","280846254":"Effects of Forest Fragmentation on Genetic Diversity of the Critically Endangered Primate, the Pied Tamarin (Saguinus bicolor): Implications for Conservation","230056613":"Genetic structure and evidence for recent population decline in Eurasian otter populations in the Czech and Slovak Republics: Implications for conservation","232252611":"Immigration as a possible rescue of a reduced population of a long-distance migratory bird: Reed warblers in the Azraq Oasis, Jordan The Royal Society for the Conservation of Nature","24441441":"Hansen MM, Fraser DJ, Meier K, Mensberg KLD. Sixty years of anthropogenic pressure: a spatio-temporal genetic analysis of brown trout populations subject to stocking and population declines. Mol Ecol 18: 2549-2562","8993168":"Roderick GK, Navajas M. Genes in new environments: genetics and evolution in biological control. Nat Rev Gen 4: 889-899","233796852":"Does mating behaviour affect connectivity in marine fishes? Comparative population genetics of two protogynous groupers (Family Serranidae)","241217404":"Pearse D, Crandall KA. Beyond FST: Analysis of population genetic data for conservation. Conserv Genet 5: 585-602","7454573":"Bayesian inference of evolutionary history from chloroplast microsatellites in the cosmopolitan weed Capsella bursa-pastoris (Brassicaceae). Mol Ecol","225268337":"Population structure and genetic variation of lane snapper (Lutjanus synagris) in the northern Gulf of Mexico","41397586":"An examination of genetic diversity and effective population size in Atlantic salmon","281809376":"Implications of genetics and current protected areas for conservation of 5 endangered primates in China","8061782":"Estimation of effective population size and detection of a recent population decline coinciding with habitat fragmentation in a round beetle","225079879":"Reliability of genetic bottleneck tests for detecting recent population declines","225394782":"Genetic discontinuities in a continuously distributed and highly mobile ungulate, the Norwegian moose","227547300":"INVITED REVIEW: using genome scans of DNA polymorphism to infer adaptive population divergence","233397468":"Genetic consequences of fragmentation in “arbor vitae,” eastern white cedar (Thuja occidentalis L.), toward the northern limit of its distribution range","261190311":"White NE, Bunce M, Mawson PR, Dawson R, Saunders DA, Allentoft ME.. Identifying conservation units after large‐scale land clearing: a spatio‐temporal molecular survey of endangered white‐tailed black cockatoos (Calyptorhynchus spp.). Divers Distrib 20: 1208-1220","236849445":"The relative roles of contemporary and ancient processes in shaping genetic variation of a generalist fish in a catchment dominated by agriculture","229927560":"The distribution of nuclear genetic variation and historical demography of sea otters","8070973":"Beaumont, M. A. and D. J. Balding. Identifying adaptive genetic divergence among populations from genome scans. Mol. Ecol. 13: –. doi: 10.1111/j.1365-294X.2004.02125.x","286637650":"Genetic Diversity, Population Size, and Conservation of the Critically Endangered Perrier’s Sifaka (Propithecus perrieri)","227827935":"The use of molecular tools in invasion biology: An emphasis on freshwater ecosystems","45951987":"The Confounding Effects of Population Structure, Genetic Diversity and the Sampling Scheme on the Detection and Quantification of Population Size Changes","222220911":"From genetic diversity and structure to conservation: Genetic signature of recent population declines in three mouse lemur species (Microcebus spp.)","49648038":"Hu YB, Qi DW, Wang HJ, Wei FW.. Genetic evidence of recent population contraction in the southernmost population of giant pandas. Genetica 138: 1297-1306","8197417":"Phylogeny and phylogeography of Old World fruit bats in the Cynopterus brachyotis complex","263423210":"Overground versus underground: A genetic insight into dispersal and abundance of the Cape dune mole-rat","26902208":"Population structure of the gray snapper, Lutjanus griseus, in the U.S. waters of the Gulf of Mexico","44625395":"Gompert Z, Forister ML, Fordyce JA, Nice CC, Williamson RJ, Buerkle CA.. Bayesian analysis of molecular variance in pyrosequences quantifies population genetic structure across the genome of Lycaeides butterflies. Mol Ecol 19: 2455-2473","51766862":"Evaluating ring-tailed lemurs (Lemur catta) from Southwestern Madagascar for a genetic population bottleneck","221819491":"Spatial and temporal patterns of neutral and adaptive genetic variation in the endangered African wild dog ( Lycaon pictus )","261477065":"Influence of drift and admixture on population structure of American black bears (Ursus americanus) in the Central Interior Highlands, USA 50 years after translocation","215619463":"Combining genetic and ecological data to assess the conservation status of the endangered Ethiopian Walia ibex","267816619":"High genetic structure of the Cozumel Harvest mice, a critically endangered island endemic: Conservation implications","23784500":"Heller RE, Lorenzen D, Okello JBA, Masembe C, Siegismund HR.. Mid-Holocene decline in African buffalos inferred from Bayesian coalescent-based analyses of microsatellites and mitochondrial DNA. Mol Ecol 17: 4845-4858","44625399":"When North and South don\u0027t mix: Genetic connectivity of a recently endangered oceanic cycad, Cycas micronesica, in Guam using EST-microsatellites","8573411":"Beaumont MA, Rannala B. The Bayesian revolution in genetics. Nat Rev Genet 5: 251-261","8352539":"Genetic Response to Climatic Change: Insights from Ancient DNA and Phylochronology","233725577":"Effective Population Size Dynamics and the Demographic Collapse of Bornean Orang-Utans","229519046":"Genetic structure of Danish red deer Cervus elaphus","232679094":"Effective Population Size Dynamics of Myotis vivesi During the Pleistocene and Holocene Climatic Changes","225590299":"Sousa V, Penha F, Collares-Pereira MJ, Chikhi L, Coelho MM. Genetic structure and signature of population decrease in the critically endangered freshwater cyprinid Chondrostoma lusitanicum. Conserv Genet 9: 791-805","253807692":"A Bayesian Hierarchical Approach to Regional Frequency Analysis of Extremes","248383906":"Pyrenean ptarmigans decline under climatic and human influences through the Holocene","268875112":"Island survivors: population genetic structure and demography of the critically endangered giant lizard of La Gomera, Gallotia bravoana","5380896":"Reproductive isolation, evolutionary distinctiveness and setting conservation priorities: The case of European lake whitefish and the endangered North Sea houting (Coregonus spp.)","230798515":"History of expansion and anthropogenic collapse in a top marine predator of the Black Sea estimated from genetic data","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","49670031":"The role of humans in the diversification of a threatened island raptor","224967699":"Current and Historical Drivers of Landscape Genetic Structure Differ in Core and Peripheral Salamander Populations","267932291":"Recent divergences and size decreases of eastern gorilla populations","51174512":"Genetic diversity, structure, and demographic change in tanoak, Lithocarpus densiflorus (Fagaceae), the most susceptible species to sudden oak death in California","225475599":"Divergence in an archipelago and its conservation consequences in Aleutian Island rock ptarmigan","238085040":"MAINTENANCE OF GENETIC DIVERSITY IN FOUR TAIGA SPECIALISTS","283347296":"Genetic Structuration, Demography and Evolutionary History of Mycobacterium tuberculosis LAM9 Sublineage in the Americas as Two Distinct Subpopulations Revealed by Bayesian Analyses","236179351":"Human-induced changes on fine-scale genetic structure in Ulmus laevis Pallas wetland forests at its SW distribution limit","237046703":"Natural and anthropogenic influences on population dynamics in butternut (Juglans cinerea L.)","281849155":"Phylogeography and population genetics of black alder (Alnus glutinosa (L.) Gaertn.) in Ireland: putting it in a European context","26791436":"The effect of landscape features on population genetic structure in Yunnan snub-nosed monkeys (","26800654":"Correction: Why the Indian Subcontinent Holds the Key to Global Tiger Recovery","7080949":"Adaptation and speciation: What can FST tell us?","277310746":"Genetic approaches to the conservation of migratory bats: A study of the eastern red bat (Lasiurus borealis)","256539370":"Large-scale pattern of genetic differentiation within African rainforest trees: Insights on the roles of ecological gradients and past climate changes on the evolution of Erythrophleum spp (Fabaceae)","51666613":"Effective population size of natural populations of Drosophila buzzatii, with a comparative evaluation of nine methods of estimation","258204353":"Climate, not Aboriginal landscape burning, controlled the historical demography and distribution of fire-sensitive conifer populations across Australia","226089180":"Demographic and genetic status of an isolated population of bog turtles (Glyptemys muhlenbergii): Implications for managing small populations of long-lived animals","228664839":"Genetic variation and spatial autocorrelation among young-of-the-year red snapper (Lutjanus campechanus) in the northern Gulf of Mexico","225218754":"Lopes JS, Boessenkool S. The use of approximate Bayesian computation in conservation genetics and its application in a case study on yellow-eyed penguins. Conserv Genet 11: 421-433","10788107":"Decline of North Atlantic eels: A fatal synergy?","260203064":"Population Decline in a Long-Lived Species: The Wood Turtle in Michigan","7355850":"Genetic Signature of Anthropogenic Population Collapse in Orang-utans","222827253":"Optimum maintenance strategy for deteriorating bridge structures based on lifetime functions","221758707":"Islands and streams: Clusters and gene flow in wild barley populations from the Levant","233731106":"Conservation genetics and phylogeography of the poorly known Middle Eastern terrapin Mauremys caspica (Testudines: Geoemydidae)","7150499":"Aspi J, Roininen E, Ruokonen M, Kojola I, VilÀ C. Genetic diversity, population structure, effective population size and demographic history of the Finnish wolf population. Mol Ecol 15: 1561-1576","261924942":"Integrating molecular tools into freshwater ecology: Developments and opportunities","256703135":"Recommendations for using msBayes to incorporate uncertainty in selecting an ABC model prior: A response to Oaks et al.","235775959":"Dybowski\u0027s Sika Deer (Cervus nippon hortulorum): Genetic Divergence Between Natural Primorian and Introduced Czech Populations","249443072":"The population genetics of a biological control introduction: mitochondrial DNA and microsatellie variation in native and introduced populations ofAphidus ervi, a parisitoid wasp: POPULATION GENETICS OF BIOLOGICAL CONTROL","230531677":"Effects of landscape features and demographic history on the genetic structure of Testudo marginata populations in the southern Peloponnese and Sardinia","267810323":"Extensive population decline in the Tasmanian devil predates European settlement and devil facial tumour disease","268234773":"Prioritizing Tiger Conservation through Landscape Genetics and Habitat Linkages","272818601":"Ancient and Contemporary DNA Reveal a Pre-Human Decline but No Population Bottleneck Associated with Recent Human Persecution in the Kea (Nestor notabilis)","256985789":"Gene flow and demographic history of leopards (Panthera pardus) in the central Indian highlands","235801059":"Population genetic structure of a threatened tortoise across the south-eastern United States: Implications for conservation management","259576981":"Correlates and evolutionary consequences of population genetic structure in bats","283511574":"Genetic models reveal historical patterns of sea lamprey population fluctuations within Lake Champlain","7658374":"Detecting historical bottlenecks using temporal genetic data.","6318484":"Genetic Viability and Population History of the Giant Panda, Putting an End to the \"Evolutionary Dead End\"?","237175767":"Population subdivision and genetic signatures of demographic changes in Arctic grayling (Thymallus arcticus) from an impounded watershed","230591050":"A range-wide genetic bottleneck overwhelms contemporary landscape factors and local abundance in shaping genetic patterns of an alpine butterfly (Lepidoptera: Pieridae: Colias behrii )","51139833":"Genetic structuring and recent demographic history of red pandas (Ailurus fulgens) inferred from microsatellite and mitochondrial DNA","10850642":"Strong Founder Effect in Drosophila pseudoobscura Colonizing New Zealand from North America","225667720":"Genetic monitoring and effects of stocking practices on small Cyprinus carpio populations","263860294":"Maximum-Likelihood Inference of Population Size Contractions from Microsatellite Data","8997236":"Luikart, G. et al. The power and promise of population genomics: from genotyping to genome typing. Nature Rev. Genet. 4, 981-994"},"index":225}