{"abs":"Genealogical or coalescent methods have proved very useful in interpreting and understanding a wide range of population genetic data. Our aim is to illustrate some of the central ideas behind this approach. The primary focus is genealogy in neutral genetic models, for which the effects of demography can be separated from those of mutation. We describe the coalescent for panmictic populations of fixed size, and its extensions to incorporate various assumptions about variation in population size and nonrandom mating caused by geographical population subdivision. The effects of such genealogical structure on patterns and correlations in genetic data are discussed. An urn model is useful for simulating samples at loci with complex mutation mechanisms. We give two applications of the genealogical approach. The first concerns methods for estimating the mutation rate from infinitely-many-sites data, and the second relates to inference about recent common ancestors and population history.","title":"Coalescents and Genealogical Structure Under Neutrality","id":14378842,"url":"https://www.researchgate.net/publication/14378842_Coalescents_and_Genealogical_Structure_Under_Neutrality","names":["Peter Donnelly","Simon Tavare","Annual Review of Genetics"],"references":{"14748067":"Allelic genealogy and human evolution","15464047":"Griffith, R.C. \u0026 Tavaré, S. Unrooted genealogical tree probabilities in the infinitely-many-sites model. Math. Biosci. 127, 77-98","38363077":"Ancestral Inference in Population Genetics","16567312":"Evolutionary Relationship of DNA-Sequences in Finite Populations","22009153":"Watterson GA. Number of segregating sites in genetic models without recombination. Theor Popul Biol 7: 256-276","240241982":"Simulating Probability Distributions in the Coalescent","16690287":"Tavare, S. Line-of-descent and genealogical processes, and their applications in population genetics models. Theor. Popul. Biol. 26, 119-164","21411284":"Genealogy of neutral genes and spreading of selected mutations in a geographically structured population. Genetics","20543115":"The “Hitchhiking effect” revisited","21881502":"Variability in the amount of heterozygosity maintained by neutral mutations","15372796":"Likehood methods for locating disease genes in nonequilibrium populations","223115706":"The Coalescent","15397917":"Sampling Theory for Neutral Alleles in a Varying Environment","21156379":"Branching Pattern in the Evolutionary Tree for Human Mitochondrial DNA","18499361":"Ewens WJ. The Sampling Theory of Selectively Neutral Alleles. Theoret Popul Biol 3: 87-112","239052708":"On the Genealogy of Large Populations","243740187":"Exchangeability and the evolution of large populations","200102162":"Gene Genealogies and the Coalescent Process","21473304":"Extensive mitochondrial DNA diversity within a single Amerindian tribe"},"citedIn":{"28764086":"American Indian Demographic History and Cultural Affiliation: A Discussion on Certain Limitations of the Use of mtDNA and Y chromosome Data","11920055":"Mutation and recombination with tight linkage","277227652":"1 cornelllect Mathematical Population Genetics: Lecture Notes","231587278":"A logistic branching process for population genetics","23180130":"Phylogenetic reconstruction of HCV genotype 1b dissemination in a small city centre: The Camporeale model","221666098":"Principal components analysis in the space of phylogenetic trees","238583869":"Quantitative Genetics Genomics and the Future of Plant Breeding","13960915":"Nordborg, M. Structured coalescent processes on different time scales. Genetics 146, 1501-1514","220286771":"Computational methods for complex stochastic systems: A review of some alternatives to MCMC","251457775":"Hydrodynamic Analysis of a Novel Photocatalytic Reactor Using Computational Fluid Dynamics","237457457":"POPULATION GENETIC APPLICATIONS USING A COALESCENT SIMULATION INCLUDING SELECTION, RECOMBINATION, AND VARIABLE POPULATION SIZE","12031137":"The Coalescent in an Island Model of Population Subdivision with Variation among Demes","6291014":"Coalescent Size Versus Coalescent Time with Strong Selection","6271045":"Incorporating Experimental Design and Error Into Coalescent/Mutation Models of Population History","41562725":"The sequence and de novo assembly of the giant panda genome. Nature","233391051":"Consistency of the Adaptive Multiple Importance Sampling","1952312":"Biological evolution through mutation, selection, and drift: An introductory review","5642352":"Population genetic inference using a fixed number of segregating sites: A reassessment","12318867":"Chloroplast evolution in the Pinus montezumae complex: A coalescent approach to hybridization","228018110":"Modeling human genetic history","281847008":"Phylodynamic Analysis of Ebola Virus in the 2014 Sierra Leone Epidemic","44608152":"Topologies of the Conditional Ancestral Trees and Full-Likelihood-Based Inference in the General Coalescent Tree Framework","230225288":"Oliver, J. C. Population genetic effects of humanmediated plant range expansions on native phytophagous insects. Oikos","12930294":"Kruglyak, L. Prospects for whole-genome linkage disequilibrium mapping of common disease genes. Nat. Genet. 22, 139-144","227947424":"Issues concerning association studies for fine mapping a susceptibility gene for a complex gene","14003426":"The coalescent process with selfing","51040061":"Ho SYW, Shapiro B. Skyline-plot methods for estimating demographic history from nucleotide sequences. Mol Ecol Resour 11: 423-434","13994221":"“A Coalescent Approach to the Polymerase Chain Reaction,”","227425207":"The coalescent in population models with time-inhomogeneous environment","251219653":"The genealogy of a neutral mutation","26748836":"Holsinger KE, Weir BS. Genetics in geographically structured population: defining, estimating and interpreting FST. Nat Rev Genet 10: 639-650","12583678":"Evidence for Variable Selective Pressures at MC1R","11021975":"Statistical Properties of New Neutrality Tests Against Population Growth","6574116":"How to compute the effective size of spatiotemporally structured populations using separation of time scales","11652337":"Kreitman M. Methods to detect selection in populations with applications to the human. Annu Rev Genom Hum Genet 1: 539-559","6811686":"Marjoram P, Tavaré S. Modern computational approaches for analysing molecular genetic variation data. Nat Rev Genet 7: 759-770","11096302":"Genealogical process on a correlated fitness landscape","13487749":"Kraft T, Sall T, Magnusson-Rading I, Nilsson NO, Hallden C. Positive correlation between recombination rates and levels of genetic variation in natural populations of sea beet (Beta vulgaris subsp. maritima). Genetics 150: 1239-1244","13526660":"On the Probability of Neanderthal Ancestry","221674365":"Evolutionary History and Phylogeography of Human Viruses","259448637":"Detecting and Measuring Selection from Gene Frequency Data","13526658":"Maternal Uniparental Disomy of Chromosome 1 with No Apparent Phenotypic Effects","23940384":"Guan W, Liang K, Boehnke M, Abecasis CR. Genotype-based matching to correct for population stratification in large-scale case-control genetic association studies. Genet Epidemiol 33: 508-517","7617082":"Likelihoods From Summary Statistics: Recent Divergence Between Species","238885996":"Fine-scale mapping of disease loci","261757390":"Phylodynamic Inference for Structured Epidemiological Models","12344554":"The age of a unique event polymorphism","35486282":"A comparison of coalescent estimation software /","11052787":"Genetic Evidence for Long-Term Population Decline in a Savannah-Dwelling Primate: Inferences from a Hierarchical Bayesian Model","14141577":"A gene tree for beta-globin sequences from Melanesia.","258516744":"Contrasting demographic histories of two species in the lichen-forming fungal genus Xanthomendoza (Teloschistaceae, Ascomycota)","221667154":"Genealogies in simple models of evolution","8462566":"A Case of Recent Long-Distance Dispersal in the Piriqueta caroliniana Complex","26658302":"Paraphyly of organelle DNAs in Cycas Sect. Asiorientales due to ancient ancestral polymorphisms","267680671":"TIME TO COALESCENCE FOR A CLASS OF NONUNIFORM ALLOCATION PROCESSES","8988391":"Coalescent process with fluctuating population size and its effective size","201996389":"Gene trees, Species trees \u0026 systematics: a cladistic perspective","227425278":"Forward and backward diffusion approximations for haploid exchangeable population models","5506598":"Multilocus Phylogeography of a Holarctic Duck: Colonization of North America from Eurasia by Gadwall (Anas strepera)","289767734":"Gene Flow in Fungi","233558941":"Phylogeography of Homalothecium sericeum (Hedw.) Br. Eur.; toward a reconstruction of glacial survival and postglacial migration","266332583":"Ancestral Inference in Molecular Biology","5442095":"Population genetic analysis of shotgun assemblies of genomic sequences from multiple individuals","238282419":"A gene tree for β-globin sequences from Melanesia","227701524":"Perspective: gene divergence, population divergence, and the variance in coalescence time in phylogeographic studies. Evol Int J Org Evol","265169220":"Sampling through time and phylodynamic inference with coalescent and birth-death models","246861885":"Evolutionary inference from genomic data","281226831":"A new method for estimating the demographic history from DNA sequences: an importance sampling approach","2907321":"Compositions of Random Functions on a Finite Set","4752593":"Inference in Molecular Population Genetics","10951228":"Demography, Recombination Hotspot Intensity, and the Block Structure of Linkage Disequilibrium","26246925":"Two Decades of Hepatitis B Infections Among Drug Users in Amsterdam: Are They Still a High-Risk Group?","225285582":"Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities - Discussion","47702129":"A Generic Coalescent-based Framework for the Selection of a Reference Panel for Imputation","14110321":"Harding, R.M. et al. Archaic African and Asian lineages in the genetic ancestry of modern humans. Am. J. Hum. Genet. 60, 772−789","234149202":"Statistical Phylogeography","238865051":"Simulation algorithms for integrals of a class of sampling distributions arising in population genetics","38039789":"The Maintenance of Genetic Variation Due to Asymmetric Gene Flow in Dendritic Metapopulations","14395506":"Origin and evolution of Native American mtDNA variation","269116576":"Demographic inference using genetic data from a single individual: Separating population size variation from population structure","12121109":"Edwards, S. V. \u0026 Beerli, P. Gene divergence, population divergence, and the variance in coalescence time in phylogeographic studies. Evolution 54, 1839-1854","261374778":"On Coalescence Analysis Using Genealogy Rooted Trees","281078385":"Biogeography of the Phalaenopsis amabilis species complex inferred from nuclear and plastid DNAs","8660534":"Beaumont, M. A. Recent developments in genetic data analysis: what can they tell us about human demographic history? Heredity 92, 365-379","23301072":"Model fitting and inference under Latent Equilibrium Processes.","226303430":"Temporal-method estimates of Ne from highly polymorphic loci","232789853":"The sequence and de novo assembly of the giant panda genome","11499631":"Likelihood-Based Estimation of the Effective Population Size Using Temporal Changes in Allele Frequencies: A Genealogical Approach","12598787":"On the Genealogy of a Population of Biparental Individuals","265577744":"MODELS AND METHODS FOR GENOME-WIDE ASSOCIATION STUDIES","230827783":"Miocene and Pliocene dominated diversification of the lichen-forming fungal genus Melanohalea (Parmeliaceae, Ascomycota) and Pleistocene population expansions","254634475":"STOCHASTIC MODELS FOR THE TIME TO THE MOST RECENT COMMON ANCESTOR","6315180":"Molecular epidemiology of acute hepatitis B in the Netherlands in 2004: Nationwide survey","11788413":"The Effective Size of Fluctuating Populations","262006093":"Delimiting species without monophyletic gene trees","5820554":"Delimiting Species without Monophyletic Gene Trees","4771483":"Wilson IJ, Weale ME, Balding DJ. Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities. J Roy Stat Soc Ser A 166: 155-188","255679976":"A Brief Introduction to the Phylogenetic Analysis Library Version 1.5","265046297":"The accumulation of microsatellite mutations in a novel model of colonic crypt dynamics","50594257":"Statistical inference to advance network models in epidemiology","50269736":"Evolution and Population Genetics of Exotic and Re-Emerging Pathogens: Novel Tools and Approaches","24416174":"Mlcoalsim: Multilocus Coalescent Simulations","6469821":"The propagation of a cultural or biological trait by neutral genetic drift in a subdivided population","11933801":"Yusim, K. et al. Using human immunodeficiency virus type 1 sequences to infer historical features of the acquired immune deficiency syndrome epidemic and human immunodeficiency virus evolution. Phil. Trans. R. Soc. Lond. B 356, 855-866","6485181":"Exact Solution of the Multi-Allelic Diffusion Model","5890182":"Neutral theory: A historical perspective","12638752":"A Coalescent Approach to Study Linkage Disequilibrium between Single-Nucleotide Polymorphisms","44651595":"Unifying Vertical and Nonvertical Evolution: A Stochastic ARG-based Framework","221970398":"FTEC: A Coalescent Simulator for Modeling Faster than Exponential Growth","12860451":"Fu, Y.-X. \u0026 Li, W.-H. Coalescing into the 21st century: an overview and prospects of coalescent theory. Theor. Popul. Biol. 56, 1-10","12685352":"The Probability of Duplicate Gene Preservation by Subfunctionalization","38351011":"Coalescent theory for seed bank models","11577948":"Estoup A, Wilson IJ, Sullivan C, Cornuet J-M, Moritz C. Inferring population history from microsatellite and enzyme data in serially introduced cane toads, Bufo marinus. Genetics 159: 1671-1687","228581747":"The Effects of Genetic and Geographic Structure on Neutral Variation","8123029":"The extent and importance of intragenic recombination","226836854":"The Genealogical Tree of a Chromosome","12437579":"An Integrated Framework for the Inference of Viral Population History From Reconstructed Genealogies","6660755":"The hepatitis C virus epidemic in Cameroon: Genetic evidence for rapid transmission between 1920 and 1960","11627078":"Estimating Recombination Rates from Population Genetic Data","234149134":"Analysis of selection on enzyme polymorphisms Ann","228580707":"Genetics of human origins and diversity","226830201":"Present-day genetic composition suggests contrasting demographic histories of two dominant chaetognaths of the North-East Atlantic, Sagitta elegans and S. setosa","7995524":"Phylogenetics of wigeons and allies (Anatidae: Anas): The importance of sampling multiple loci and multiple individuals","23474585":"Chapter 1 Common Genetic Variation and Human Disease","220125723":"Accurate and fast methods to estimate the population mutation rate from error prone sequences","12531642":"Identity by descent genome segmentation based on single nucleotide polymorphism distributions.","5671760":"Crandall ED, Frey MA, Grosberg RK, Barber PH. Contrasting demographic history and phylogeographical patterns in two Indo-Pacific gastropods. Mol Ecol 17: 611-626","283658735":"On the importance of being structured: instantaneous coalescence rates and a re-evaluation of human evolution","8250740":"The effect of unequal migration rates on F-ST","229684414":"Conservation Genetics","8325998":"Recent Trends in Population Genetics: More Data! More Math! Simple Models?","10788277":"Dynamics and Genealogy of Strains in Spatially Extended Host-Pathogen Models","10603442":"On the use of star-shaped genealogies in inference of coalescence times","51331611":"Heterogeneity of microsatellite mutations within and between loci, and implications for human demographic history","225052287":"Multiple merger gene genealogies in two species: Monophyly, paraphyly, and polyphyly for two examples of Lambda coalescents","38350686":"Convergence to the coalescent in populations of substantially varying size","12485540":"Ancestral Processes in Population Genetics—the Coalescent","12910047":"Meyer, S., Weiss, G. \u0026 von Haeseler, A. Pattern of nucleotide substitution and rate heterogeneity in the hypervariable regions I and II of human mtDNA. Genetics 152, 1103-1110","229664939":"COALFACE: A graphical user interface program for the simulation of coalescence","252006937":"American Indian Demographic History and Cultural Affiliation: A Discussion of Certain Limitations on the Use of mtDNA and Y Chromosome Testing","49283566":"Bayesian Analysis in Molecular Anthropology","236692741":"Asymptotic Distributions of Coalescence Times and Ancestral Lineage Numbers for Populations with Temporally Varying Size","6196033":"On the length distribution of external branches in coalescence trees: Genetic diversity within species","6378826":"Comparisons of Site- and Haplotype-Frequency Methods for Detecting Positive Selection","38086505":"Molecular Sequence Data of Hepatitis B Virus and Genetic Diversity After Vaccination","227996857":"Population Genetics: Overview","11479967":"Out of Africa Again and Again","51206715":"Semerikov VL, Lascoux M. Nuclear and cytoplasmic variation within and between Eurasian Larix (Pinaceae) species. Am J Bot 90: 1113-1123","44607903":"Viral phylodynamics and the search for an ‘effective number of infections’","2316564":"A Classification Of Coalescent Processes For Haploid Exchangeable Population Models","267179733":"FLUX GÉNIQUES CHEZ LES ARBRES FORESTIERS SYNTHÈSE BIBLIOGRAPHIQUE AUTEURS","11619722":"Understanding forms of genetic diversity in the oak gall wasp Biorhiza pallida: demographic history or a Wolbachia selective sweep","23967312":"The role of weak selection and high mutation rates in nearly neutral evolution","6648667":"Inference of Bacterial Microevolution Using Multilocus Sequence Data","12167673":"Regions of Low Single-Nucleotide Polymorphism Incidence in Human and Orangutan Xq: Deserts and Recent Coalescences","12756867":"Conditional Genealogies and the Age of a Neutral Mutant","265247371":"Efficient methods for analysis of genome scale data","286445143":"On the importance of being structured: instantaneous coalescence rates and human evolution-lessons for ancestral population size inference?","8070973":"Beaumont, M. A. and D. J. Balding. Identifying adaptive genetic divergence among populations from genome scans. Mol. Ecol. 13: –. doi: 10.1111/j.1365-294X.2004.02125.x","224541221":"Molecular Population Genetics: Coalescent Methods Based on Summary Statistics","236106069":"Viral Phylodynamics","269333829":"Peijnenburg2005 PhDThesis","10821612":"Estoup A, Clegg SM. Bayesian inferences on the recent island colonization history by the bird Zosterops lateralis lateralis. Mol Ecol 12: 657-674","11505637":"Prospects for Association-Based Fine Mapping of a Susceptibility Gene for a Complex Disease","225622072":"Topological properties of phylogenetic trees in evolutionary models","11523556":"Fine-Scale Mapping of Disease Loci via Shattered Coalescent Modeling of Genealogies","49758650":"Statistical test of neutrality in the age of weak selection","11071975":"Pfenninger M, Posada D. Phylogeographic history of the land snail Candidula unifasciata (Poiret 1801) (Helicellinae, Stylommatophora): fragmentation, corridor migration and secondary contact. Evolution 56: 1776-1788","30758532":"Studies on the population genetics of Euphausiids: a comparison of patterns in plagic taxa displaying different distributions and life-histories.","23231027":"A Composite-Conditional-Likelihood Approach for Gene Mapping Based on Linkage Disequilibrium in Windows of Marker Loci","4993311":"Stopping-time resampling for sequential Monte Carlo methods","247085551":"Analysis of variation in the human β-globin gene cluster using a novel DHPLC technique","8067374":"Inference of demographic history from genealogical trees using reversible jump Markov chain Monte Carlo","281043352":"Genetic analysis of complex demographic scenarios: Spatially expanding populations of the cane toad, Bufo marinus","5839619":"GWAsimulator: A rapid whole-genome simulation program","23767094":"Iwata H, Ebana K, Fukuoka S, Jannink J-L, Hayashi T. Bayesian multilocus association mapping on ordinal and censored traits and its application to the analysis of genetic variation among Oryza sativa L. germplasms. Theor Appl Genet 118: 865-880","14292871":"Optimal sequencing strategies for surveying molecular genetic diversity. Genetics","225957909":"17 Population Biology and Population Genetics of Pleistocene Hominins","286035567":"Past population dynamics in Northwest Patagonia: An estimation using molecular and radiocarbon data","11635157":"Exploring the Demographic History of DNA Sequences Using the Generalized Skyline Plot","38339885":"The ages of mutation in gene trees","255619673":"Inferences about the structure and history of populations: coalescents and intraspecific phylogeography","8199963":"Estoup A, Beaumont M, Sennedot F, Moritz C, Cornuet J-M.. Genetic analysis of complex demographic scenarios: spatially expanding populations of the cane toad, Bufo marinus. Evolution 58: 2021-2036","265074346":"American Indian mtDNA and Y Chromosome Genetic Data: A Comprehensive Report of their Use in Migration and Other Anthropological Studies","24198166":"Maximum tree: A consistent estimator of the species tree","12600743":"Nesbø CL, Rueness EK, Iversen SA, Skagen DW, Jakobsen KS. Phylogeography and population history of Atlantic mackerel (Scomber scombrus L.): a genealogical approach reveals genetic structuring among the eastern Atlantic stocks. Proc R Soc Lond B Biol Sci 267: 281-292","26236151":"Hepatitis B vaccination targeted at behavioural risk groups in the Netherlands: Does it work?","6839042":"Perfect Simulation From Nonneutral Population Genetic Models: Variable Population Size and Population Subdivision","234019992":"Bayesian non-parametrics and the probabilistic approach to modelling","11743169":"Gene genealogies in a metapopulation","287202412":"Estimating time to the most recent common ancestor (TMRCA): comparison and application of eight methods","4067144":"Improving data availability using hybrid replication technique in peer-to-peer environments","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","6258467":"Fast and Accurate Estimation of the Population-Scaled Mutation Rate, , From Microsatellite Genotype Data","13830062":"Diversity and Age of the Four Major mtDNA Haplogroups, and Their Implications for the Peopling of the New World","270706015":"Can the Site-Frequency Spectrum Distinguish Exponential Population Growth from Multiple-Merger Coalescents?","267872392":"Inference of Epidemiological Dynamics Based on Simulated Phylogenies Using Birth-Death and Coalescent Models","12524351":"Times on Trees, and the Age of an Allele","227170825":"Part I: Ancestral Inference in Population Genetics","51782802":"Isolation and gene flow: Inferring the speciation history of European house mice","47157579":"Pacific Salmon and the Coalescent Effective Population Size","8180730":"Gene Genealogy and Properties of Test Statistics of Neutrality Under Population Growth","12660038":"Nordborg, M. Linkage disequilibrium, gene trees and selfing: an ancestral recombination graph with selfing. Genetics 154, 923-929","12226355":"Origins of the Coalescent: 1974–1982","11220256":"Gene Mapping via the Ancestral Recombination Graph","11892516":"PAL: an object-oriented programming library for molecular evolution and phylogenetics","34173338":"Composite likelihood and regression based methods for inferring population genetic parameters from DNA sequences /","229064244":"Evolutionary and convergence stability for continuous phenotypes in finite populations derived from two-allele models","26690562":"Burney CW, Brumfield RT.. Ecology predicts levels of genetic differentiation in Neotropical birds. Am Nat 174: 358-368","51329690":"Human genome diversity—a Project?","259529967":"The Impact of Accelerating, Faster than Exponential Population Growth on Genetic Variation.","12262695":"The effects of rate variation on ancestral inference in the coalescent","10957626":"Intra-Deme Molecular Diversity in Spatially Expanding Populations","263100976":"Estimation of the ancestral effective population sizes of African great apes under different selection regimes","10760974":"Sampling Strategies for Delimiting Species: Genes, Individuals, and Populations in the Liolaemus elongatus-kriegi Complex (Squamata: Liolaemidae) in Andean-Patagonian South America","11858712":"Sequence variation within the Fragile X locus","14124408":"Out of Africa Again... and Again?","4914149":"Approximate likelihood methods for estimating local recombination rates","12052743":"Allelic association in the FRAX region","10681617":"Coalescence in a Metapopulation with Recurrent Local Extinction and Recolonization","11220254":"Wright–Fisher Revisited: The Case of Fertility Correlation","5434343":"Thuillet A-C, Bataillon T, Sourdille P, David JL. Factors affecting polymorphism at microsatellite loci in bread wheat [Triticum aestivum (L.) Thell]: effects of mutation processes and physical distance from the centromere. Theor Appl Genet 108: 368-377","270001570":"Adaptive Combination of P-Values for Family-Based Association Testing with Sequence Data","37764088":"Selection and linkage desequilibrium tests under complex demographies ans ascertainment bias","7400906":"Haplotype Trees and Modern Human Origins","221118102":"A Brief Introduction to the Phylogentics Analysis Library V1.5.","8030150":"Bayesian Coalescent Inference of Past Population Dynamics from Molecular Sequences","10777371":"Inferring population history from genealogical trees","13634320":"Inference of Population History Using a Likelihood Approach","233770541":"Improving Bayesian Population Dynamics Inference: A Coalescent-Based Model for Multiple Loci","13559565":"Genealogical Inference From Microsatellite Data","5357465":"Statistical Power Analysis of Neutrality Tests Under Demographic Expansions, Contractions and Bottlenecks With Recombination","225295525":"The distribution of the coalescence time and the number of pairwise nucleotide differences in a model of population divergence or speciation with an initial period of gene flow","237302253":"Statistical Applications in Genetics and Molecular Biology","268428854":"Coalescent-based inference from DNA sequence data us- ing MCMC","2218475":"Expected Coalescence Time for a Nonuniform Allocation Process","8091057":"The hepatitis C virus epidemic among injecting drug users, Infection","267869756":"Estimating the Relative Rate of Recombination to Mutation in Bacteria from Single-Locus Variants using Composite Likelihood Methods","237619175":"Presented in Partial Fulfillment of the Requirements for the Degree Doctor of Philosophy in the Graduate School of The Ohio State University","227701829":"Genetic population structure and distribution of a fungal polypore, Datronia caperata (Polyporaceae), in mangrove forests of Central America","220244215":"Applied Probability in Great Britain","277699409":"Population Genetics","14450433":"How rapidly does the human mitochondrial genome evolve? Am J Hum Genet","2168830":"Modelling Stochastic Clonal Interference","41623450":"The Null Distributions of Test Statistics in Genomewide Association Studies","11450188":"Testing for Genetic Evidence of Population Expansion and Contraction: An Empirical Analysis of Microsatellite DNA Variation Using a Hierarchical Bayesian Model","11936085":"Walsh B.. Estimating the time to the most recent common ancestor for the Y chromosome or mitochondrial DNA for a pair of individuals. Genetics 158: 897-912","268789729":"Models of Selection, Isolation, and Gene Flow in Speciation","13996861":"Phylogenies and the origin of species","11381061":"Genealogical Trees, Coalescent Theory and the Analysis of Genetic Polymorphisms","2166730":"Optimal adaptive performance and delocalization in NK fitness landscapes","14140219":"The genealogy of samples in models with selection","14140218":"Inferring Coalescence Times From DNA Sequence Data","257648822":"A Whole-Genome Simulator Capable of Modeling High-Order Epistasis for Complex Disease","38351288":"A Classification of Coalescent Processes for Haploid Exchangeable Population Models","256201911":"The Current Hepatitis C Virus Prevalence in China May Have Resulted Mainly from an Officially Encouraged Plasma Campaign in the 1990s: a Coalescence Inference with Genetic Sequences","255651023":"The eect of hitch-hiking on neutral genealogies","264433718":"Misperceived invasion: The Lusitanian slug (Arion lusitanicus auct. non-Mabille or Arion vulgaris Moquin-Tandon 1855) is native to Central Europe","51337467":"Theoretical studies on the mobility-shift assay of protein-DNA complexes","6369176":"GENOME: A rapid coalescent-based whole genome simulator","228017773":"Coalescent Theory","236230638":"Progress and Prospects for the Ecological Genetics of Mycoheterotrophs","260834934":"Climate Change and an Australian Rainforest Conifer","7701902":"Analysis of Recombination in Campylobacter jejuni from MLST Population Data","8997234":"Estimating recombination rates from population-genetic data","12569410":"Microsatellite mutations and inferences about human demography"},"index":234}