{"abs":"The particle filtering field has seen an upsurge in interest over recent years, and accompanying this upsurge several enhancements to the basic techniques have been suggested in the literature. In this paper we collect a group of these developments that seem to be particularly important for time series applications and give a broad discussion of the methods, showing the relationships between them. We firstly present a general importance sampling framework for the filtering/smoothing problem and show how the standard techniques can be obtained from this general approach. In particular, we show that the auxiliary particle filtering methods of (Pitt and Shephard: this volume) fall into the same general class of algorithms as the standard bootstrap filter of (Gordon et al. 1993). We then develop the ideas further and describe the role of MCMC resampling as proposed by (Gilks and Berzuini: this volume) and (MacEachern, Clyde and Liu 1999). Finally, we present a generalisation of our own in which MCMC resampling ideas are used to traverse a sequence of ‘bridging’ densities which lie between the prediction density and the filtering density. In this way it is hoped to reduce the variability of the importance weights by attempting a series of smaller, more manageable moves at each time step.","title":"Sequential Monte Carlo Methods in Practice","id":243600328,"url":"https://www.researchgate.net/publication/243600328_Sequential_Monte_Carlo_Methods_in_Practice","names":["S.J. Godsill","T. C. Clapp"],"references":{"242937272":"Evaluation and Comparison of EEG Traces: Latent Structure in Nonstationary Time Series","246868500":"Monte Carlo filter and smoother for non-Gaussian state space models","3358960":"Bayesian approach to parameter estimation and interpolation of time-varying autoregressive processes using the Gibbs sampler","3361206":"Novel Approach to Nonlinear/Non-Gaussian Bayesian State Estimation","243615712":"Partial Non-Gaussian State Space","2612288":"On-Line Bayesian Modelling and Enhancement of Speech Signals","229100911":"Markov Chain Monte Carlo in Pratice","243675117":"Digital Audio Restoration-A Statistical Model-Based Approach","237104492":"Marko Chain Monte Carlo in Practice","238671894":"Smoothness Prior Analysis of Time Series","257702035":"Multi-channel EEG analyses via dynamic regression models with time-varying lag/lead structure","2672600":"Fixed-Lag Smoothing using Sequential Importance Sampling","227763715":"Bayesian Enhancement of Speech and Audio Signals Which Can Be Modelled as ARMA Processes","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","2306327":"Annealed Importance Sampling","247644468":"Statistical methods for the processing of communications data","229025840":"Building robust simulation-based filters for evolving data sets","2469117":"Sequential Importance Sampling for Nonparametric Bayes Models: The Next Generation","2590205":"Sequential Monte Carlo Methods for Dynamic Systems","235926677":"Bayesian Forecasting and Dynamic Linear Models","243767612":"Blind Deconvolution via Sequential Imputations","243767611":"Methodology for Monte Carlo smoothing with application to time-varying autoregressions","263450188":"Annealed importance sampling. Statist"},"citedIn":{"269308172":"A particle-based search strategy for improved Space Situational Awareness","4346688":"Time-varying system identification via maximum a posteriori estimation and its application to driver steering models","239553221":"Knowledge-Based Speech Enhancement","227627155":"The soft‐output principle—reminiscences and new developments","227522317":"Particle Markov Chain Monte Carlo . . .","250409071":"ON-LINE BAYESIAN METHODS FOR ESTIMATION OF NON-LINEAR NON-GAUSSIAN SIGNALS","271466406":"An effective proposal distribution for sequential Monte Carlo methods-based wildfire data assimilation","224633834":"An alternative approach for the resampling in the bootstrap filter","228365205":"Monte Carlo Filtering of Piecewise Deterministic Processes","24052579":"Maximum a Posteriori Sequence Estimation Using Monte Carlo Particle Filters","45929776":"A Machine Learning Approach to Recovery of Scene Geometry from Images","268189937":"Particle flow inspired by Knothe-Rosenblatt transport for nonlinear filters","51064453":"Bayesian estimation of semiparametric nonlinear dynamic factor analysis models using the Dirichlet process prior","27535147":"A Particle Filtering-based Framework for On-line Fault Diagnosis and Failure Prognosis","227516446":"Importance sampling: A review","224165966":"Auxiliary Particle Implementation of Probability Hypothesis Density Filter","254043952":"Unscented Particle Filter algorithm based on artificial fish swarm algorithm","250332018":"Auxiliary Variable Sequential Monte Carlo Methods","241959541":"Dynamic Bayesian Models via Monte Carlo - An Introduction with Examples -","224321479":"Dynamic Proposal Variance and Optimal Particle Allocation in Particle Filtering for Video Tracking","1825409":"Sequential monte carlo samplers","249011788":"On-line Bayesian parameter estimation in general non-linear state-space models: A tutorial and new results","242396140":"My list of references","257407735":"On simultaneous on-line state and parameter estimation in non-linear state-space models","215465205":"Efficient Markov Network Discovery Using Particle Filters","222655456":"A Bayesian approach to joint tracking and identification of geometric shapes in video sequences","255650970":"An Ensemble-Based Smoother with Retrospectively Updated Weights for Highly Nonlinear Systems","3320085":"A Particle Filtering Approach for Joint Detection/Estimation of Multipath Effects on GPS Measurements","258716353":"Zero curvature particle flow for nonlinear filters","35942281":"Architectures for efficient implementation of particle filters /","261346877":"Robust particle filters via sequential pairwise reparameterized Gibbs sampling","2605320":"Adapting the Sample Size in Particle Filters Through KLD-Sampling","230327562":"Flood Risk Science and Management","268189900":"Fourier transform particle flow for nonlinear filters","260014413":"Fight sample degeneracy and impoverishment in particle filters: A review of intelligent approaches","278005281":"بررسی مسئله تخمين از ديدگاه بهينه‌سازی مقيد و طراحی تخمين‌گر تکاملی","4772221":"Approximating hidden Gaussian Markov random fields","2986264":"Real-Time Particle Filters","37996788":"Recovering sample diversity in Rao-Blackwellized particle filters for simultaneous localization and mapping","220542098":"A Penalty-Logic Simple-Transition Model for Structured Sequences.","263091734":"Approximations of the Optimal Importance Density using Gaussian Particle Flow Importance Sampling","222545402":"Swarm-supported outdoor localization with sparse visual data","50842556":"Partial Linear Gaussian Models for Tracking in Image Sequences Using Sequential Monte Carlo Methods","3320969":"Identification of Time-Varying Autoregressive Systems Using Maximum a Posteriori Estimation","258716630":"Friendly rebuttal to Chen and Mehra: Incompressible particle flow for nonlinear filters","220326046":"A tutorial on particle filters for online nonlinear/non-Gaussian Bayesian tracking.","255201654":"Bayesian based design of real-time sensor systems for high-risk indoor contaminants","4746760":"Monte Carlo Smoothing for Nonlinear Time Series","2998252":"Models and Algorithms for Tracking of Maneuvering Objects Using Variable Rate Particle Filters","259695288":"The Progressive Proposal Particle Filter: Better Approximations to the Optimal Importance Density","228623464":"A Tutorial on Particle Filtering and Smoothing: Fifteen Years Later","4914183":"On–line inference for hidden Markov models","252289606":"Sequential Monte Carlo Methods for Stochastic Volatility Models with Jumps","224136715":"Generative Model for Maneuvering Target Tracking","2998263":"An Overview of Existing Methods and Recent Advances in Sequential Monte Carlo","259474861":"Particle filtering for state and parameter estimation in gas turbine engine fault diagnostics","4343193":"Nonlinear State Estimation Using A Particle Filter with Likelihood Proposal Distributions","229444598":"Integer‐valued time series","4993299":"Bayesian variable selection and regularization for time-frequency surface estimation","26532468":"Sequential Parameter Estimation of Time-Varying Non-Gaussian Autoregressive Processes","3318227":"A particle algorithm for sequential Bayesian parameter estimation and model selection","4291748":"Auxiliary Particle Implementation of the Probability Hypothesis Density Filter","261433459":"Particle filtering with progressive Gaussian approximations to the optimal importance density","4221224":"Unified framework for sampling/importance resampling algorithms","224595723":"Fault Diagnosis of High Voltage Direct Current System Based on Particle Filter","224572427":"Bayesian image analysis with on-line confidence estimates and its application to microtubule tracking","2503247":"Monte Carlo Smoothing for Nonlinear Time Series","5140004":"Sequential numerical integration in nonlinear state space models for microeconometric panel data","262344009":"Rethinking soil carbon modelling: A stochastic approach to quantify uncertainties","228740681":"Nonlinear estimation by particle filters and Cramér-Rao bound","51625592":"Conditional predictive inference for online surveillance of spatial disease incidence","51035749":"Sequential trans-dimensional Monte Carlo for range-dependent geoacoustic inversion","242153246":"Random Finite Sets in Multi-Object Filtering","262254929":"Knowledge-Based Cooperative Particle Filter","265243581":"Trans-dimensional finite-fault inversion","221469248":"Scalable Near-Optimal Recursive Structure from Motion","274407592":"A new network approach to Bayesian inference in partial differential equations: A New Network Approach to Bayesian Inference in Partial Differential Equations","4797117":"Volatility, Jumps, and Predictability of Returns: A Sequential Analysis","3318218":"A Tutorial on Particle Filters for Online Nonlinear/Non-Gaussian Bayesian Tracking","224226596":"Mutiswarm particle filter for robust tracking under observation ambiguity","241141667":"Feature point tracking based on a recursive Bayesian method","23635988":"A note on auxiliary particle filters","220322652":"On-line Bayesian estimation of signals in symmetric α-stable noise","252241269":"Numerical experiments for nonlinear filters with exact particle flow induced by log-homotopy","4993330":"Sequential Monte Carlo Samplers","51962726":"Error Bounds and Normalizing Constants for Sequential Monte Carlo in\nHigh Dimensions","224241954":"Set-Membership Constrained Particle Filter: Distributed Adaptation for Sensor Networks","221471948":"Particle-Based Belief Propagation for Structure from Motion and Dense Stereo Vision with Unknown Camera Constraints"},"index":238}