{"abs":"In this paper, the most common methods of model updating are reviewed. Model updating techniques can be categorized into two general types of deterministic model updating methods and probabilistic methods. Here residual minimization, Bayesian model updating and error domain model falsification methods are presented and reviewed. Each methods features and disadvantages are investigated and discussed. With the emerging need for more realistic and accurate models for real life structures, the importance of better calibrated models is apparent. There are several methods to help reach this goal and each of them has their own benefits and capabilities. The results from this paper should help researchers in the field of finite element model updating to have better understanding of the methods. This study can help researchers to choose a method which is appropriate to their needs.","title":"A Review of Model Updating Methods for Civil Infrastructure Systems","id":282010414,"url":"https://www.researchgate.net/publication/282010414_A_Review_of_Model_Updating_Methods_for_Civil_Infrastructure_Systems","names":["Mehrdad Aghagholizadeh","Necati Catbas"],"references":{"239655370":"Bayesian Model Choice: Asymptotics and Exact Calculations","4772045":"Bayesian Calibration of Computer Models","223090379":"Computational Methods in Optimization Considering Uncertainties -- An Overview","11951806":"Maximum entropy approach for modeling random uncertainties in transient elastodynamics","200472186":"The Future Of Distributed Models—Model Calibration And Uncertainty Prediction","220022167":"Information Theory and Statistical Mechanics I","256800581":"On prediction error correlation in Bayesian model updating","251600372":"Model selection in finite element model updating using the Bayesian evidence statistic","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","223751641":"Comparison of dynamic response of structures with uncertain non-probabilistic interval analysis method and probabilistic approach","267836518":"Bayesian Linear Structural Model Updating using Gibbs Sampler with Modal Data","222395601":"Updating robust reliability using structural test data. Probabilist Eng Mech","2704953":"A Gaussian Prior for Smoothing Maximum Entropy Models","269083545":"Overcoming the Limitations of Traditional Model-Updating Approaches","220286515":"On Bayesian model and variable selection using MCMC","239061034":"Model Updating In Structural Dynamics: A Survey","49459559":"Multimodel Structural Performance Monitoring","223589317":"Structural identification based on optimally weighted modal residuals","222253862":"A survey of non-probabilistic uncertainty treatment in finite element analysis","225786862":"Bridge health monitoring system based on vibration measurements","51991941":"Inverse Problem Theory and Model Parameter Estimation","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","245286591":"Transitional Markov Chain Monte Carlo Method for Bayesian Model Updating, Model Class Selection, and Model Averaging","228890245":"Variational Bayesian model selection for mixture distribution","222389216":"Model uncertainty and Bayesian updating in reliability-based inspection","274705526":"Predicting the Usefulness of Monitoring for Identifying the Behavior of Structures","234829906":"Review: Non-probabilistic finite element analysis for parametric uncertainty treatment in applied mechanics: Recent advances","248240740":"Updating Models and Their Uncertainties. I: Bayesian Statistical Framework","239590120":"UNCERTAINTY ANALYSIS FOR COMPUTER SIMULATIONS THROUGH VALIDATION AND CALIBRATION","276167877":"Comparison and Implementation of Multiple Model Structural Identification Methods","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","267079262":"Markov Chain Monte Carlo - Stochastic Simulation for Bayesian Inference","236441120":"Concepts of Model Verification and Validation","239066504":"Monte Carlo sampling of solutions to inverse problems. J Geophys Res","228439591":"Recent developments of Bayesian model class selection and applications in civil engineering","38322292":"An Adaptive Metropolis Algorithm","230667139":"Hybrid probabilities and error-domain structural identification using ambient vibration monitoring","229737356":"Monitoring Structural Health Using a Probabilistic Measure","245285982":"Updating Models and Their Uncertainties. II: Model Identifiability","38363784":"Memoir on the Probability of Causes of Events","245381986":"New Bayesian Model Updating Algorithm Applied to a Structural Health Monitoring Benchmark","46641920":"Defining Uncertainty: A Conceptual Basis for Uncertainty Management in Model-Based Decision Support","38358405":"Conjugate Priors for Exponential Families","238179452":"Ambient Vibration Data Analysis for Structural Identification and Global Condition Assessment","265921928":"Finite-Element-Model Updating Using Computational Intelligence Techniques: Applications to Structural Dynamics","262166897":"Structural identification with systematic errors and unknown uncertainty dependencies","46537493":"Approximate Bayesian Inference for Latent Gaussian Models by Using Integrated Nested Laplace Approximations","276080684":"Structural Identification for Performance Prediction Considering Uncertainties: Case Study of a Movable Bridge","264743326":"Nonlinear finite element model updating of an infilled frame based on identified time-varying modal parameters during an earthquake","222559514":"On the treatment of uncertainties in structural mechanics and analysis","228612986":"Bayesian Updating and Model Class Selection for Hysteretic Structural Models Using Stochastic Simulation","222599192":"Models, Prior Information, and Bayesian Analysis","220373503":"Structural Model Updating and Health Monitoring with Incomplete Modal Data Using Gibbs Sampler","229559244":"Efficient Model Updating and Health Monitoring Methodology Using Incomplete Modal Data without Mode Matching","227885431":"Construction of probability distributions in high dimension using the maximum entropy principle: Applications to stochastic processes, random fields and random matrices","224877317":"Equation of State Calculations by Fast Computing Machines","245423938":"Nonprobabilistic, convex-theoretic modeling of scatter in material properties","30771505":"Unified Probabilistic Approach for Model Updating and Damage Detection","30771632":"Bayesian Model Updating Using Hybrid Monte Carlo Simulation with Application to Structural Dynamic Models with Many Uncertain Parameters","270006896":"Dealing with uncertainty in model updating for damage assessment: A review","223450041":"Engineering computation under uncertainty – Capabilities of non-traditional models","243764334":"Convex Models of Uncertainty in Applied Mechanics","245367243":"Bayesian Approach for Structural Reliability Analysis and Optimization Using the Kriging Dimension Reduction Method","245358578":"Non-Probabilistic Models of Uncertainty in the Nonlinear Buckling of Shells With General Imperfections: Theoretical Estimates of the Knockdown Factor","3810772":"A Bayesian Probabilistic Approach to Structural Health Monitoring","245285867":"Asymptotic Expansions for Reliability and Moments of Uncertain Systems","24083737":"Bayesian validation assessment of multivariate computational models","259313164":"Bayesian Methods for Structural Dynamics and Civil Engineering","238504527":"A comprehensive Bayesian approach for model updating and quantification of modeling errors","243366648":"Finite element model updating taking into account the uncertainty on the modal parameters estimates","275182108":"Predictive Analysis by Incorporating Uncertainty through a Family of Models Calibrated with Structural Health-Monitoring Data","251372161":"Bayesian Finite Element Model Updating Using Static and Dynamic Data","245304418":"Structural Identification: Analytical Aspects"},"citedIn":{},"index":239}