{"abs":"An adaptive importance sampling methodology is proposed to compute the multidimensional integrals encountered in reliability analysis. It is based on a Markov simulation algorithm due to Metropolis et al. (Metropolis, Rosenbluth, Rosenbluth and Teller, Equations of state calculatons by fast computing machines. Journal of Chemical Physics, 1953;21(6): 1087-1092). In the proposed methodology, samples are simulated as the states of a Markov chain and are distributed asymptotically according to the optimal importance sampling density. A kernel sampling density is then constructed from these samples which is used as the sampling density in an importance sampling simulation. The Markov chain samples populate the region of higher probability density in the failure region and so the kernel sampling density approximates the optimal importance sampling density for a large variety of shapes of the failure region. This adaptive feature is insensitive to the probability level to be estimated. A variety of numerical examples demonstrates the accuracy, efficiency and robustness of the methodology.","title":"A new adaptive importance sampling scheme","id":222780925,"url":"https://www.researchgate.net/publication/222780925_A_new_adaptive_importance_sampling_scheme","names":["Siu-Kui Au","J.L. Beck","Structural Safety"],"references":{"245285982":"Updating Models and Their Uncertainties. II: Model Identifiability","38367114":"Remarks on Some Non-Parametric Estimates of a Density Function","200105001":"Equation of State by Fast Computing Machines","225900475":"Generalized Trajectory Methods for Finding Multiple Extrema and Roots of Functions","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","221985142":"An efficient computational scheme to calculate structural failure probabilities. Probabilistic Engineering Mechanics 4(1):10-18","224817256":"An Alternative Method of Cross-Validation for the Smoothing of Density Estimate","221669734":"Equations of State Calculations by Fast Computing Machines","224817268":"Non-Parametric Estimation of a Multivariate Probability Density","247440364":"Safety and the Probability of Structural Failure","246972205":"Nonparametric Estimation of a Multidimensional Probability Density","224817392":"On Estimation of Probability Density Function and Mode","224817400":"Empirical Choice of Histograms and Kernel Density Estimators","28784873":"Asymptotic Expansions for Reliabilities and Moments of Uncertain Dynamic Systems","35561856":"Kernel method in Monte Carlo importance sampling /","248560911":"Importance sampling in structural system","223307920":"Multiple design points in first and second-order reliability","239387109":"Optimal Importance-Sampling Density Estimator","225828439":"Monte Carlo Methods","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","223239917":"An efficient sampling method for probability of failure calculations. Structural Safety 3:109-115","245301372":"Basic Analysis of Structural Safety","248240740":"Updating Models and Their Uncertainties. I: Bayesian Statistical Framework","273800355":"Probability Integration by Directional Simulation","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","38358909":"On Bandwidth Variation in Kernel Estimates-A Square Root Law","245285867":"Asymptotic Expansions for Reliability and Moments of Uncertain Systems","24051734":"Nonparametric Estimation in Markov Processes","222945716":"Optimization algorithms for structural reliability","243763194":"Variable Kernel Estimates of Multivariate Densities"},"citedIn":{"276061556":"Ambient Vibration Test, Modal Identification and Structural Model Updating Following Bayesian Framework","245366953":"A Modified Efficient Global Optimization Algorithm for Maximal Reliability in a Probabilistic Constrained Space","264358861":"Authors\u0027 reply to discussion of the paper ‘Multi-criteria optimal structural design under uncertainty’","273272903":"Sensitivity of a reinforced concrete protective gallery under a snow avalanche load","257335129":"An adaptive dimension decomposition and reselection method for reliability analysis","259123040":"Reliability-based optimization using bridge importance sampling","222542935":"An efficient framework for optimal robust stochastic system design using stochastic simulation","281765852":"A decoupling method of reliability optimization based on sensitivity","283470333":"Advances in System Reliability Analysis Under Uncertainty","266972915":"An efficient reliability method combining Adaptive Importance Sampling and Kriging metamodel","228876479":"A Bayesian Approach to Reliability-Based Optimization With Incomplete Information","245281920":"Time-Dependent Reliability of PSC Box-Girder Bridge Considering Creep, Shrinkage and Corrosion","264172958":"A comparative study of three collocation point methods for odd order stochastic response surface method","225386830":"A nonlinear interval-based optimization method with local-densifying approximation technique","227878324":"Structural damage detection and assessment by adaptive Markov chain Monte Carlo simulation","268186591":"Review of Metamodeling Techniques for Product Design with Computation- intensive Processes","256918136":"The encounter of interval and probabilistic approaches to structural reliability at the design point","275844957":"Use of Relevance Vector Machine in Structural Reliability Analysis","282546937":"Non-parametric stochastic subset optimization for design problems with reliability constraints","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","251508174":"A probabilistic approach for estimating the behavior of railway tracks","280498317":"The generalization of Latin hypercube sampling","270920208":"Non-parametric stochastic subset optimization for optimal-reliability design problems","264349943":"Passive systems failure probability estimation by the meta-AK-IS2 algorithm","225144924":"Saddlepoint approximation based structural reliability analysis with non-normal random variables","272639351":"A Method for Damage Detection Based on Correlation Characteristic of Acceleration Response","241164644":"Support Vector Machine Response Surface Method Based on Fast Markov Chain Simulation","245286623":"Probabilistic Failure Analysis by Importance Sampling Markov Chain Simulation","282632859":"Non-parametric stochastic subset optimization utilizing multivariate boundary kernels and adaptive stochastic sampling","268752448":"A generalized Subset Simulation approach for estimating small failure probabilities of multiple stochastic responses","251544505":"An adaptive directional importance sampling method for structural reliability","245366742":"Failure Surface Frontier for Reliability Assessment on Expensive Performance Function","46269323":"Robust Stochastic Design of Linear Controlled Systems for Performance Optimization","264700044":"Structural Reliability Assessment by Local Approximation of Limit State Functions Using Adaptive Markov Chain Simulation and Support Vector Regression","250693053":"Reliability Estimation for Dynamical Systems Subject to Stochastic Excitation using Subset Simulation with Splitting","258177327":"A new stochastic analysis method for mechanical components","226829259":"Conditional probability Markov chain simulation based reliability analysis method for nonnormal variables","262983676":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","228667891":"A NEW HYBRID RELIABILITY ANALYSIS METHOD: THE DESIGN POINT-RESPONSE SURFACE-SIMULATION METHOD","241614645":"A comparative study of reliability estimation procedures for high dimensions using FE-analysis","264031208":"A new high-order response surface method for structural reliability analysis","267331002":"The applications of an importance sampling method to reliability analysis of the inside flap of an aircraft","262110154":"A novel method for importance measure analysis in the presence of epistemic and aleatory uncertainties","257775364":"Reliability-based design optimization via high order response surface method","259118123":"The estimation of failure probabilities as a false optimization problem","259118125":"Discussion of paper: “A new efficient simulation method to approximate the probability of failure and most probable point”: M. Rashki, M. Miri and M.A. Moghaddam, Structural Safety 39 (2012) 22–29","257507591":"Reliability Analysis of a Composite Wind Turbine Blade Section Using the Model Correction Factor Method: Numerical Study and Validation","267488430":"Response Surface Method Using Sequential Sampling for Reliability-Based Design Optimization","251993700":"A novel reliability evaluation method for large dynamic engineering systems","269298284":"Venice: Reliable virtual data center embedding in clouds","245366776":"A Clustering-Based Surrogate Model Updating Approach to Simulation-Based Engineering Design","265853620":"Sample-based evaluation of global probabilistic sensitivity measures","263666649":"An improved adaptive kriging-based importance technique for sampling multiple failure regions of low probability","263802838":"Efficient method for reliability assessment under high-cycle fatigue","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","266146733":"Uncertainty, Sensitivity, and Reliability for Inserts in Sandwich Composites","222675510":"First excursion probability for linear systems by very efficient algorithm","223287356":"Filtered importance sampling with support vector margin: A powerful method for structural reliability analysis","245366995":"An Indicator Response Surface Method for Simulation-Based Reliability Analysis","48925586":"Reliability-Based Design Using Two-Stage Stochastic Optimization with a Treatment of Model Prediction Errors","229356754":"Asymmetric dimension-adaptive tensor-product method for reliability analysis","223183920":"An efficient SFE method using Lagrange polynomials: Application to nonlinear mechanical problems with uncertain parameters","242102032":"Monotonicity and Active Set Strategies in Probabilistic Design Optimization","251516547":"Modified subset simulation method for reliability analysis of structural systems","262265054":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","281312187":"A surrogate accelerated multicanonical Monte Carlo method for uncertainty quantification","260914185":"Wavelet density-based adaptive importance sampling method","228578327":"Modified Reduced Gradient With Realization Sorting for Hard Equality Constraints in Reliability-Based Design Optimization","271608250":"Dimensionality reduction and visualization of structural reliability problems using polar features","253584270":"Reliability Assessment Using Discriminative Sampling and Metamodeling","288725409":"تخمین میزان قابلیت اطمینان به روش واریانس زمانی در صنایع فراساحل مورد مطالعاتی سکو نفتی رشادت","263858222":"Adaptive importance sampling for optimization under uncertainty problems","257392066":"A support vector density-based importance sampling for reliability assessment","223106779":"Important sampling in high dimensions","255994331":"Equivalent target probability of failure to convert high-reliability model to low- reliability model for efficiency of sampling- based RBDO","222273189":"Evaluation of accuracy and efficiency of some simulation and sampling methods in structural reliability analysis","241259464":"Iterative projection on critical states for reliability-based design optimization","256918009":"Accelerated subset simulation with neural networks for reliability analysis","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","38975992":"Life-cycle cost optimal design of passive dissipative devices","245185836":"An optimization method for learning statistical classifiers in structural reliability","271602310":"Importance sampling based algorithm for efficient reliability analysis of axially loaded piles","235973290":"Reliability optimization using probabilistic sufficiency factor and correction response surface","270979226":"A novel adaptive importance sampling algorithm based on Markov chain and low-discrepancy sequence","277650993":"SFRs-based numerical simulation for the reliability of highly-coupled DFTS","245304865":"Classification Approach for Reliability Analysis with Stochastic Finite-Element Modeling","270481375":"Moment methods for C/SiC woven composite components reliability and sensitivity analysis","279070817":"MCMC algorithms for Subset Simulation","232645147":"Performance optimization for linear stochastic systems with probabilistic parametric uncertainties","281898501":"Bayesian model updating of a coupled-slab system using field test data utilizing an enhanced Markov chain Monte Carlo simulation algorithm","47383576":"Vibrational spectra of bis(maltolato)oxovanadium(IV): A potent insulin mimetic agent","237551076":"Extension of the DP-RS-Sim Hybrid Method to Time-Variant Structural Reliability Analysis","228850030":"An Adaptive Sequential Linear Programming Algorithm for Optimal Design Problems With Probabilistic Constraints","251509042":"Optimal probabilistic design of seismic dampers for the protection of isolated bridges against near-fault seismic excitations","223711623":"Adaptive radial-based importance sampling method for structural reliability","270987507":"Efficient structural reliability analysis method based on advanced Kriging model","222231783":"Estimation of failure probabilities by local approximation of the limit state function","51890126":"Metamodel-based importance sampling for structural reliability analysis","256917899":"“SFE method using Hermite Polynomials: an approach for solving nonlinear problems with uncertain parameters”","267439660":"Surrogate Based Method for Evaluation of Failure Probability under Multiple Constraints","257335179":"Integrating subset simulation with probabilistic re-analysis to estimate reliability of dynamic systems","223325330":"Hybrid Subset Simulation Method for Reliability Estimation of Dynamical Systems Subject to Stochastic Excitation","222814884":"Application of line sampling simulation method to reliability benchmark problems","239539874":"Bayesian Updating of Structural Models and Reliability using Markov Chain Monte Carlo Simulation","237453504":"Review of Metamodeling Techniques in Support of Engineering Design Optimization","257007030":"A response surface method based on support vector machines trained with an adaptive experimental design","259097238":"Impact of modeling and excitation uncertainties on operational and structural reliability of tension Leg platforms","264560163":"Efficient approach for reliability-based optimization based on weighted importance sampling approach","222417321":"Equivalent linearization and Monte Carlo simulation in stochastic dynamics","227335524":"Application of saddlepoint approximation in reliability analysis of dynamic systems","223170981":"Stochastic Subset Optimization for reliability optimization and sensitivity analysis in system design","283542543":"Assessment of polynomial correlated function expansion for high-fidelity structural reliability analysis","222380456":"Evaluation of Failure Probability via Surrogate Models","221676250":"Meta-models for Structural Reliability and Uncertainty Quantification","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","282543143":"An adaptive reliability method combining relevance vector machine and importance sampling","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","271601858":"On the Pareto optimality of variance reduction simulation techniques in structural reliability","241187992":"Reliability Analysis for Close Position Accuracy of Gear Door Mechanism Based on Importance Sampling","256688564":"Efficient sampling methods for global reliability sensitivity analysis","223473579":"Optimization of sheet metal forming processes by adaptive response surface based on intelligent sampling method. J Mater Process Technol","44319327":"Calculation of Posterior Probabilities for Bayesian Model Class Assessment and Averaging from Posterior Samples Based on Dynamic System Data","257007023":"Interval importance sampling method for finite element-based structural reliability assessment under parameter uncertainties"},"index":240}