{"abs":"In applications of Gaussian processes where quantification of uncertainty is a strict requirement, it is necessary to accurately characterize the posterior distribution over Gaussian process covariance parameters. Normally, this is done by means of Markov chain Monte Carlo (MCMC) algorithms. Focusing on Gaussian process regression where the marginal likelihood is computable but expensive to evaluate, this paper studies algorithms based on importance sampling to carry out expectations under the posterior distribution over covariance parameters. The results indicate that expectations computed using Adaptive Multiple Importance Sampling converge faster per unit of computation than those computed with MCMC algorithms for models with few covariance parameters, and converge as fast as MCMC for models with up to around twenty covariance parameters.","title":"Adaptive Multiple Importance Sampling for Gaussian Processes","id":280773011,"url":"https://www.researchgate.net/publication/280773011_Adaptive_Multiple_Importance_Sampling_for_Gaussian_Processes","names":["Xiaoyu Xiong","Vasek Smidl","Maurizio Filippone"],"references":{"1759003":"Convergence of adaptive mixtures of importance sampling schemes","50402307":"Gaussian Processes for Machine Learning (GPML) toolbox","2566243":"Population Monte Carlo","200622065":"Equation of State Calculations by Fast Computing Machines","234113968":"Probabilistic prediction of neurological disorders with a statistical\nassessment of neuroimaging data modalities","2762543":"Adaptive proposal distribution for random walk Metropolis algorithm. Comput Stat","4772045":"Bayesian Calibration of Computer Models","257618460":"A comparative evaluation of stochastic-based inference methods for Gaussian process models","278332447":"MCMC for Variationally Sparse Gaussian Processes","41781429":"Assessing Approximate Inference for Binary Gaussian Process Classification","2136938":"Markov Chain Monte Carlo: Can We Trust the Third Significant Figure?","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","271218362":"Enabling scalable stochastic gradient-based inference for Gaussian processes by employing the Unbiased LInear System SolvEr (ULISSE)","4788953":"On Block Updating in Markov Random Field Models for Disease Mapping","40498233":"Gaussian Processes for Classification: Mean-Field Algorithms","2836794":"Population Monte Carlo","38363224":"Inference From Iterative Simulation Using Multiple Sequences","234140128":"Adaptive Importance Sampling for Estimation in Structured Domains","221662690":"INLA or MCMC? A Tutorial and Comparative Evaluation for Spatial\nPrediction in log-Gaussian Cox Processes","41781800":"Approximations for Binary Gaussian Process Classification","3192933":"Bayesian classification with Gaussian processes","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","2574717":"Controlled MCMC for optimal sampling","261198282":"Predicting Continuous Conflict Perception with Bayesian Gaussian Processes","243739482":"Efficient Metropolis Jumping Rules","45624295":"Minimum variance importance sampling via Population Monte Carlo","226385182":"Componentwise adaptation for high dimensional MCMC. Comput Stat","239666344":"Regression and Classification Using Gaussian Process Priors","233391051":"Consistency of the Adaptive Multiple Importance Sampling","2241728":"Safe and Effective Importance Sampling","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","243553632":"Using the SIR algorithm to simulate posterior distributions","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","271512969":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","51956659":"The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian\nMonte Carlo","45861000":"Adaptive Multiple Importance Sampling","38322172":"Self regenerative Markov chain Monte Carlo with adaption","225657227":"Primal-dual Subgradient Methods for Convex Problems","271749195":"Efficient Sequential Monte Carlo Sampling for Continuous Monitoring of a Radiation Situation","38322292":"An Adaptive Metropolis Algorithm","262954130":"Pseudo-Marginal Bayesian Inference for Gaussian Processes","243773113":"Adaptive importance sampling in Monte Carlo integration","220320094":"Sparse Log Gaussian Processes via MCMC for Spatial Epidemiology."},"citedIn":{},"index":256}