{"abs":"We consider the general problem of sampling from a sequence of distributions that is defined on a union of sub-spaces. We will illustrate the general approach on the problem of sequential radial basis function (RBF) regression where the number of kernels is variable and unknown. Our approach, which we term trans-dimensional sequential Monte Carlo (TD-SMC), is based on a generalisation of importance sampling to spaces of variable dimension. In the spirit of P. Del Moral and A. Doucet (2002) we augment the target parameter space at the current time step with an auxiliary space corresponding to the parameters at the previous time step. This facilitates the design of efficient proposal distributions, which can then be formulated as moves from the auxiliary parameter space to the target parameter space, lending our algorithm its sequential character. These proposals are very general, and may include within model moves to update parameters, and trans-dimensional birth or death moves to add or remove parameters when appropriate. From this perspective our approach is reminiscent of the reversible jump Markov Chain Monte Carlo (RJ-MCMC) algorithm [P.J. Green, 1995].","title":"Radial basis function regression using trans-dimensional sequential Monte Carlo","id":224747646,"url":"https://www.researchgate.net/publication/224747646_Radial_basis_function_regression_using_trans-dimensional_sequential_Monte_Carlo","names":["J. Vermaak","S.J. Godsill","A. Doucet"],"references":{"2413122":"Sparse Bayesian Learning and the Relevance Vector Machine","224881774":"Variational Relevance Vector Machines","200707517":"Sequential Monte Carlo Samplers for Rare Events","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","224881814":"Tipping, M.E.: Sparse bayesian learning and the relevance vector machine. JMLR 1","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","221619171":"The Relevance Vector Machine","45622657":"Statistical Learning Theory","1825409":"Sequential monte carlo samplers","221345675":"Sparse Bayesian Learning for Regression and Classification using Markov Chain Monte Carlo.","239546749":"Statistical Learning Theory","2869104":"Sequential Bayesian Kernel Regression","2538552":"Adaptive Sparseness Using Jeffreys Prior","220694713":"Statistical Learning Theory"},"citedIn":{"220785096":"Use of Human Motion Biometrics for Multiple-View Registration","7483794":"MCMC-based particle filtering for tracking a variable number of interacting targets","2998252":"Models and Algorithms for Tracking of Maneuvering Objects Using Variable Rate Particle Filters","26532309":"Joint Tracking of Manoeuvring Targets and Classification of Their Manoeuvrability","241527245":"Computation Intensive Methods: State of the Art","220785411":"Image Indexing by Focus Map.","242559960":"SUBCELLULAR STRUCTURE MODELING AND TRACKING FOR CELL DYNAMICS STUDY","224642157":"Optimal Filtering For Partially Observed Point Processes Using Trans-Dimensional Sequential Monte Carlo","221414877":"Sparse Bayesian Learning for Ranking","220785625":"Video-Based Facial Expression Hallucination: A Two- Level Hierarchical Fusion Approach","224352750":"Online Bayesian Kernel Regression from Nonlinear Mapping of Observations","5512102":"Bayesian Inference for Improved Single Molecule Fluorescence Tracking","250412127":"MODELS AND ALGORITHMS FOR TRACKING USING VARIABLE DIMENSION PARTICLE FILTERS","224750870":"Models and algorithms for tracking using trans-dimensional sequential Monte Carlo","4215351":"Motion-based flexible camera registration","29621332":"A Sparse Nonlinear Bayesian Online Kernel Regression","3357871":"Sequential Monte Carlo framework for extended object tracking","7452716":"Relative focus map estimation using blind deconvolution"},"index":269}