{"abs":"We investigate two new proposals for the numerical solution of optimal stopping problems within the Regression Monte Carlo (RMC) framework of Longstaff and Schwartz. First, we propose the use of stochastic kriging (Gaussian process) meta-models for fitting the continuation value. Kriging offers a flexible, nonparametric regression model that quantifies fit uncertainty and approximation quality. Second, we focus on the experimental design aspect of RMC, making connections to the Design of Experiments literature. We compare the performance of space-filling vs.~empirical density designs, and advocate the use of batching with replicated simulations at design sites to improve the signal-to-noise ratio. Numerical case studies for valuing Bermudan Puts under a variety of asset dynamics illustrate that our methods are competitive with existing approaches.","title":"Kriging Metamodels for Bermudan Option Pricing","id":281671347,"url":"https://www.researchgate.net/publication/281671347_Kriging_Metamodels_for_Bermudan_Option_Pricing","names":["Michael Ludkovski"],"references":{"44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","255637821":"Pricing American-Style Options by Monte Carlo Simulation: Alternatives to Ordinary Least Squares","227390276":"Multiscale Stochastic Volatility for Equity, Interest Rate, and Credit Derivatives","279830310":"Adaptive importance sampling in least-squares Monte Carlo algorithms for backward stochastic differential equations","272290358":"The Stochastic Grid Bundling Method: Efficient Pricing of Multidimensional Bermudan Options and the Greeks","228620720":"A Review on Regression-based Monte Carlo Methods for Pricing American Options","222504913":"Neural Network Exploration Using Optimal Experiment Design","228928880":"Variance Reduction Techniques for Pricing American Options using Function Approximations","24086200":"Enhanced policy iteration for American options via scenario selection","255796968":"Snell Envelope with Small Probability Criteria","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","272300902":"An Iterative Simulation Approach for Solving Stochastic Control Problems in Finance","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","228290758":"Pricing and Hedging American-Style Options: A Simple Simulation-Based Approach","235784851":"Pricing American options via multi-level approximation methods","256606229":"Sequential Design for Optimal Stopping Problems","5216848":"“Valuing American Options by Simulation: A Simple Least-Square Approach”","281123425":"American options under stochastic volatility: control variates, maturity randomization \u0026 multiscale asymptotics","2455557":"Information--Based Objective Functions for Active Data Selection","235765935":"Local Gaussian Process Approximation for Large Computer Experiments","228677251":"Pricing of American Options in Discrete Time Using Least Squares Estimates with Complexity Penalties","225734295":"The Elements of Statistical Learning, Second Edition: Data Mining, Inference, and Prediction","232877506":"Bias Reduction for Pricing American Options by Least-Squares Monte Carlo","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","24053060":"A Regression-Based Smoothing Spline Monte Carlo Algorithm for Pricing American Options","262873540":"Pricing Bermudan options using low-discrepancy mesh methods","256018738":"Refining the Least Squares Monte Carlo Method by Imposing Structure","5156734":"Assessing the Least Squares Monte-Carlo Approach to American Option Valuation","221966156":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","5602284":"Regression Methods for Pricing Complex American Style Options","220244382":"Stochastic Kriging for Simulation Metamodeling","267468686":"A Nonstationary Space-Time Gaussian Process Model for Partially Converged Simulations"},"citedIn":{},"index":272}