{"abs":"Gaussian random field (GRF) conditional simulation is a key ingredient in many spatial statistics problems for computing Monte-Carlo estimators and quantifying uncertainties on non-linear functionals of GRFs conditional on data. Conditional simulations are known to often be computer intensive, especially when appealing to matrix decomposition approaches with a large number of simulation points. This work studies settings where conditioning observations are assimilated batch sequentially, with one point or a batch of points at each stage. Assuming that conditional simulations have been performed at a previous stage, the goal is to take advantage of already available sample paths and by-products to produce updated conditional simulations at minimal cost. Explicit formulae are provided, which allow updating an ensemble of sample paths conditioned on \\(n\\ge 0\\) observations to an ensemble conditioned on \\(n+q\\) observations, for arbitrary \\(q\\ge 1\\) . Compared to direct approaches, the proposed formulae prove to substantially reduce computational complexity. Moreover, these formulae explicitly exhibit how the \\(q\\) new observations are updating the old sample paths. Detailed complexity calculations highlighting the benefits of this approach with respect to state-of-the-art algorithms are provided and are complemented by numerical experiments.","title":"Fast Update of Conditional Simulation Ensembles","id":269420296,"url":"https://www.researchgate.net/publication/269420296_Fast_Update_of_Conditional_Simulation_Ensembles","names":["Clément Chevalier","Xavier Emery","David Ginsbourger","Mathematical geosciences"],"references":{"248806866":"Spatial Variability and Uncertainty in Ground-water Flow Parameters: A Geostatistical Approach","230837892":"The Intrinsic Random Functions and Their Applications","261652191":"Geostatistical Reservoir Modeling","266703842":"Geostatistical Simulation: Models and Algorithms","267437693":"Geostatistic: Modeling Spatial Uncertainty","281015536":"Fast uncertainty reduction strategies relying on Gaussian process models","227110553":"Production of Conditional Simulations via the LU Decomposition of the Covariance Matrix","245285450":"Kriging and Conditional Simulation of Gaussian Field","274819062":"Mining Geostatistic","278619330":"Bayesian Adaptive Reconstruction of Profile Optima and Optimizers","225843631":"The Updated Kriging Variance and Optimal Sample Design","216301381":"The Design and Analysis Computer Experiments","240468086":"Reminders on the Conditioning Kriging","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","222545768":"TBSIM: A computer program for conditional simulation of three-dimensional Gaussian random fields via the turning bands method","226757289":"The Bayesian bridge between simple and universal kriging. Math Geol","238354904":"Efficient Updating of Kriging Estimates and Variances","272891057":"Quantifying uncertainty on Pareto fronts with Gaussian Process conditional simulations","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","243768499":"A Bayesian Analysis of Kriging","221966156":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","225331924":"The kriging update equations and their application to the selection of neighboring data","237151710":"A geostatistical approach to optimize sampling designs for local forest inventories","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","278821472":"DiceKriging, DiceOptim: two R packages for the analysis of computer experiments by kriging-based metamodelling and optimization"},"citedIn":{"272891057":"Quantifying uncertainty on Pareto fronts with Gaussian Process conditional simulations"},"index":275}