{"abs":"This work deals with the geostatistical simulation of mineral grades whose distribution exhibits spatial trends within the ore deposit. It is suggested that these trends can be reproduced by using a stationary random field model and by conditioning the realizations to data that incorporate the available information on the local grade distribution. These can be hard data (e.g., assays on samples) or soft data (e.g., rock-type information) that account for expert geological knowledge and supply the lack of hard data in scarcely sampled areas. Two algorithms are proposed, depending on the kind of soft data under consideration: interval constraints or local moment constraints. An application to a porphyry copper deposit is presented, in which it is shown that the incorporation of soft conditioning data associated with the prevailing rock type improves the modeling of the uncertainty in the actual copper grades.","title":"Simulation of mineral grades with hard and soft conditioning data: Application to a porphyry copper deposit","id":226798104,"url":"https://www.researchgate.net/publication/226798104_Simulation_of_mineral_grades_with_hard_and_soft_conditioning_data_Application_to_a_porphyry_copper_deposit","names":["Xavier Emery","Lucía N. Robles","Computational Geosciences"],"references":{"227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","226407357":"Constrained interpolation and qualitative information—The soft kriging approach","40883980":"Geostatistical estimation of mineral resources with soft geological boundaries: A comparative study","284193523":"The late Miocene to early Pliocene Rio Blanco-Los Bronces copper deposit, Central Chilean Andes","226763008":"The Donoso copper-rich, tourmaline-bearing breccia pipe in central Chile: Petrologic, fluid inclusion and stable isotope evidence for an origin from magmatic fluids","222923854":"Using the Gibbs sampler for conditional simulation of Gaussian-based random fields","266703842":"Geostatistical Simulation: Models and Algorithms","233648357":"Multivariate Geostatistics – An Introduction With Applications","258516259":"Mineralogical and Isotopic Zonation in the Sur-Sur Tourmaline Breccia, Rio Blanco-Los Bronces Cu-Mo Deposit, Chile: Implications for Ore Genesis","240338872":"The Theory of Regionalized Variables and Its Application","228077459":"Geostatistics: Modeling Spatial Uncertainty. Wiley, New York","227110553":"Production of Conditional Simulations via the LU Decomposition of the Covariance Matrix","226478572":"The Practice of Fast Conditional Simulation Through the LU Decomposition of the Covariance Matrix","226235688":"Rate of Convergence of the Gibbs Sampler in the Gaussian Case","40882971":"Incorporating the uncertainty in geological boundaries into mineral resources evaluation","224839794":"GSLIB. Geostatistical Software Library and User\u0027s guide, 2nd ed.","35078733":"Stochastic imaging of spatial distributions using hard and soft information /","261652099":"Plurigaussian Simulations in Geosciences","226936957":"When do we need a trend model in kriging?, Math. Geol. 21(7): 715-739","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","247861883":"Geostatistics for Conditional Simulation of Ore Bodies"},"citedIn":{"257785692":"Simulation of mineral grades and classification of mineral resources by using hard and soft conditioning data: Application to Sungun porphyry copper deposit","283624787":"Integrating deterministic lithostratigraphic models in stochastic realizations of subsurface heterogeneity. Impact on predictions of lithology, hydraulic heads and groundwater fluxes","221966156":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","272040385":"Construction and Efficient Implementation of Adaptive Objective-Based Designs of Experiments","259975225":"Collocated cokriging of iron deposit based on a model of magnetic susceptibility: a case study in Morvarid mine, Iran","268814296":"Combination of geostatistical simulation and fractal modeling for mineral resource classification"},"index":278}