{"abs":"We construct binary codes for fingerprinting. Our codes for n users that are ϵ-secure against c pirates have length O(c 2 log(n/ϵ)). This improves the codes proposed by D. Boneh and J. Shaw [IEEE Trans. Inf. Theory 44, 1897–1905 (1998; Zbl 0931.94051)] whose length is approximately the square of this length. Our codes are probabilistic. By proving matching lower bounds we establish that the length of these codes is best within a constant factor for reasonable error probabilities. This lower bound generalizes the bound found independently by C. Peikert, A. Shelat and A. Smith [in: Proceedings of the fourteenth annual ACM-SIAM symposium on discrete algorithms, Baltimore, MD, USA, January 12–14, 2003. New York, NY: Association for Computing Machinery; Philadelphia, PA: Society for Industrial and Applied Mathematics. 472–479 (2003; Zbl 1092.68605)] that applies to a limited class of codes. Our results also imply that randomized fingerprint codes over a binary alphabet are as powerful as those over an arbitrary alphabet, and also the equal strength of two distinct models for fingerprinting.","title":"Optimal Probabilistic Fingerprint Codes","id":2864441,"url":"https://www.researchgate.net/publication/2864441_Optimal_Probabilistic_Fingerprint_Codes","names":["Gabor Tardos","Journal of the ACM"],"references":{"262165280":"Guessing secrets","225156426":"Tracing Traitors","3080362":"Combinatorial properties of frameproof and traceability codes","3080073":"Tracing Traitors","221348217":"Optimum Traitor Tracing and Asymmetric Schemes.","220342472":"Guessing Secrets.","220479080":"Low Bandwidth Dynamic Traitor Tracing Schemes","1960396":"On the Fingerprinting Capacity Under the Marking Assumption","2611541":"Resistance of Digital Watermarks to Collusive Attacks","3084733":"Sequential traitor tracing","221355522":"An Efficient Public Key Traitor Tracing Scheme","220779228":"Lower Bounds for Collusion-Secure Fingerprinting","220713488":"Fingerprinting.","3079606":"Collusion-secure fingerprinting for digital data","220478972":"Dynamic Traitor Tracing","220722235":"Error- and Collusion-Secure Fingerprinting for Digital Data","221355021":"Fingerprinting Long Forgiving Messages","225127798":"Improved Boneh-Shaw Content Fingerprinting","2383546":"Fingerprinting Digital Documents"},"citedIn":{"221523765":"Secure Video Multicast Based on Desynchronized Fingerprint and Partial Encryption.","221223214":"A study of traceability of CDMA-based fingerprinting scheme","48200414":"Asymptotically false-positive-maximizing attack on non-binary Tardos\ncodes","238346806":"Robust fingerprinting codes: A near optimal construction","221307190":"Amun: Automatic Capturing of Malicious Software.","48200408":"Asymptotic Fingerprinting Capacity for Non-binary Alphabets","221307191":"On Security Protocols for Desktop Sharing.","241630817":"Use of turbo codes with low-rate convolutional constituent codes in fingerprinting scenarios","220678956":"Tardos Fingerprinting is Better Than We Thought","220942117":"Watermill: an Optimized Fingerprinting Tool for Highly Constrained Data","220271918":"Improving the Round Complexity of Traitor Tracing Schemes","221307172":"A Transparent Bridge for Forensic Sound Network Traffic Data Acquisition.","224176456":"A Detection Theoretic Approach to Digital Fingerprinting With Focused Receivers Under Uniform Linear Averaging Gaussian Attacks","263163834":"Tracing and Revoking Leaked Credentials Accountability in Leaking Sensitive Outsourced Data","224174409":"A Family of Asymptotically Good Binary Fingerprinting Codes","220240182":"Fingerprinting Codes for Internet-Based Live Pay-TV System Using Balanced Incomplete Block Designs","228018048":"Robust track‐and‐trace video watermarking","221420842":"Novel Algebraic Structure for Cyclic Codes.","220780339":"High rate fingerprinting codes and the fingerprinting capacity","221420841":"On the Key-Privacy Issue of McEliece Public-Key Encryption","261563273":"Asymptotics of Fingerprinting and Group Testing: Capacity-Achieving Log-Likelihood Decoders","221307153":"State Transfer for Hypervisor-Based Proactive Recovery of Heterogeneous Replicated Services.","241638980":"Toward Practical Joint Decoding of Binary Tardos Fingerprinting Codes","257555322":"Binary and q-ary Tardos codes, revisited","224621382":"Attacks and Forensic Analysis for Multimedia Content Protection","220481281":"On the Saddle-point Solution and the Large-Coalition Behavior of Fingerprinting Games","260604334":"Simplified MAP Detector for Binary Fingerprinting Code Embedded by Spread Spectrum Watermarking Scheme","249583815":"Multimedia Fingerprinting","221307159":"Iterative präzisionsbewertende Signaturgenerierung.","225047361":"Hierarchical Traceability Of Multimedia Documents","225225536":"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys","252223269":"Ensuring security of H.264 videos by using watermarking","221273856":"On the systematic generation of Tardos\u0027s fingerprinting codes","277207221":"Random Codes and Graphs for Secure Communication","270665234":"Riding the Saddle Point: Asymptotics of the capacity-achieving simple decoder for bias-based traitor tracing","260647869":"Bias Equalizer for Binary Probabilistic Fingerprinting Codes","276282947":"A Security Mechanism for Video Data Hiding","273392255":"Kernelized Neighborhood Preserving Hashing for Social-Network-Oriented Digital Fingerprints","221420804":"Subcodes of Reed-Solomon Codes Suitable for Soft Decoding.","251849531":"NUROV: The Network-controlled Underwater Remote Observation Vehicle","220784914":"Experimental Assessment of Probabilistic Fingerprinting Codes over AWGN Channel","265753069":"False Positive probabilities in q-ary Tardos codes: comparison of attacks","221011218":"Group-based joint coding and embedding technique for multimedia fingerprinting","236965920":"Enhanced Blind Decoding of Tardos Codes with New Map-Based Functions","243184700":"H.264/AVC video watermarking for active fingerprinting based on Tardos code","228442075":"Fast detection of Tardos Codes with Boneh-Shaw Types","48168089":"Short Collusion-Secure Fingerprint Codes against Three Pirates","225413927":"Iterative list decoding of LDPC codes","238048888":"Performance and code length optimization of joint decoding tardos fingerprinting","250856634":"Fingerprinting and the Marking Assumption","263036385":"Tuple decoders for traitor tracing schemes","220639083":"Improved versions of Tardos’ fingerprinting scheme","221307232":"Towards Secure Deletion on Smartphones.","221420897":"A Survey of Recent Attacks on the Filter Generator.","261248449":"On the Fingerprinting Capacity Games for Arbitrary Alphabets and Their Asymptotics","221307238":"Quantitative Model-Based Safety Analysis: A Case Study","221420901":"Bounds on the Number of Users for Random 2-Secure Codes","252659031":"Protecting multimedia content by digital watermarking","221307242":"A Parallel Computing System with Specialized Coprocessors for Cryptanalytic Algorithms.","265388939":"TTP-Free Asymmetric Fingerprinting Based on Client Side Embedding","262290942":"An asymmetric fingerprinting code for collusion-resistant buyer-seller watermarking","1905731":"On the Robustness of the Delay-Based Fingerprint Embedding Scheme","224203580":"Considering Security and Robustness Constraints for Watermark-based Tardos Fingerprinting","225190670":"An Error-Tolerant Variant of a Short 2-Secure Fingerprint Code and Its Security Evaluation","241623554":"Fast and adaptive tracing strategies for 3-secure fingerprint watermarking codes","281597600":"Tardos codes for real","251862379":"On the security of the delay-based fingerprint embedding scheme","221651806":"Tracing and Revoking Pirate Rebroadcasts","3297880":"WATERMILL: An optimized fingerprinting system for databases under constraints","42252009":"Properties and evaluation of fingerprinting codes","221307229":"Lineare Zeilen- und Spaltenprädiktoren zur Erkennung von Bildskalierungen.","47397025":"An Asymmetric Fingerprinting Scheme Based on Tardos Codes","221307206":"CAPTCHAs: The Good, the Bad, and the Ugly","51956079":"Dynamic Tardos Traitor Tracing Schemes","4187720":"Boneh-Shaw fingerprinting and soft decision decoding","220177255":"High-rate random-like spherical fingerprinting codes with linear decoding complexity.","259195659":"Dynamic Traitor Tracing Schemes, Revisited","1960038":"Optimization of Memory Usage in Tardos\u0027s Fingerprinting Codes","228578788":"Renewable Traitor Tracing: A Broadcast, Tracing and Revoke System for Anonymous Attack","262244829":"Message-Based Traitor Tracing with Optimal Ciphertext Rate","282372777":"Secure Anonymously Authenticated and Traceable Enterprise DRM System","243963918":"Dynamic Traitor Tracing Schemes, Revisited","38278853":"Un schéma complet de traçage de documents multimédia reposant sur des versions améliorées des codes de Tardos et de la technique de tatouage \"Broken Arrows\"","1913491":"Blind Fingerprinting","225366004":"An improvement of discrete Tardos fingerprinting codes","252040600":"An effective and efficiency anti-collusion fingerprint scheme for multimedia","228083513":"Dynamic Traitor Tracing for Arbitrary Alphabets: Divide and Conquer","224258556":"On the Saddle-Point Solution and the Large-Coalition Asymptotics of Fingerprinting Games","221307282":"Collusion-Secure Fingerprint Watermarking for Real World Applications.","38278891":"Décodage EM du code de Tardos pour le fingerprinting","262257925":"Asymptotic Fingerprinting Capacity in the Combined Digit Model","221420948":"Traitor Tracing Against Powerful Attacks Using Combinatorial Designs","221420955":"Joint Source-Cryptographic-Channel Coding Based on Linear Block Codes","262807296":"Digital fingerprinting for color images based on the quaternion encryption scheme","257694199":"Video watermark application for embedding recipient ID in real-time-encoding VoD server","275719364":"Tally-Based Simple Decoders for Traitor Tracing and Group Testing","265116513":"On collusion-secure codes for copyright protection","226031060":"Sequential Monte Carlo for rare event estimation","220496777":"Tracing Pirated Content on the Internet: Unwinding Ariadne\u0027s Thread.","221631899":"Renewable Traitor Tracing: A Trace-Revoke-Trace System For Anonymous Attack","234832204":"Experimental Assessment of the Reliability for Watermarking and Fingerprinting Schemes","221307270":"Real-Time Fault-Tolerant Routing in High-Availability Multicast-Aware Video Networks.","280530958":"Secure and Robust Enterprise Digital Rights Management Protocol with Efficient Storage","225113565":"A Public-Key Traitor Tracing Scheme with an Optimal Transmission Rate","232624997":"Multimedia Content Tracing Scheme Based on Tardos\u0027 Fingerprint Codes","221307275":"State-of-the-Art Kryptoverfahren für drahtlose Sensornetze - Eine Krypto-Bibliothek für MantisOS.","221506958":"Trace and revoke systems with short ciphertexts","254056858":"Interference Removal Operation for Spread Spectrum Fingerprinting Scheme","260299580":"Impacts of Watermarking Security on Tardos-Based Fingerprinting","220333542":"Accusation probabilities in Tardos codes: the Gaussian approximation is better than we thought.","262994280":"Watermarking textures in video games","24165813":"Worst case attacks against binary probabilistic traitor tracing codes","273128577":"journal.pone.0105613","221420533":"Secure Cross-Realm Client-to-Client Password-Based Authenticated Key Exchange Against Undetectable On-Line Dictionary Attacks","262371684":"Near-Optimal Collusion-Secure Fingerprinting Codes for Efficiently Tracing Illegal Re-distribution","29601545":"Rare event simulation for a static distribution","220722154":"Iterative Detection Method for CDMA-Based Fingerprinting Scheme.","264558858":"Preventing False Discovery in Interactive Data Analysis Is Hard","220335603":"Copyrighting Public-key Functions and Applications to Black-box Traitor Tracing.","224576947":"Compressed video stream watermarking for peer-to-peer based content distribution network","221420513":"On the Structure of Inversive Pseudorandom Number Generators","257555338":"False Negative probabilities in Tardos codes","273128593":"journal.pone.0105613","220798451":"Forgery Attack to an Asymptotically Optimal Traitor Tracing Scheme.","35632324":"On cryptographic techniques for digital rights management /","273106587":"A method of H.264 video watermarking robust to attack on I and P frames by removal","267047221":"Framework for preserving security and privacy in peer-to-peer content distribution systems","224754053":"Random coding technique for digital fingerprinting codes: Fighting two pirates revisited","224557959":"Fingerprinting Compressed Multimedia Signals","4361380":"1 Universal Fingerprinting: Capacity and Random-Coding Exponents","270820553":"Matrix-based robust joint fingerprinting and decryption method for multicast distribution of multimedia","260542312":"Fingerprinting With Equiangular Tight Frames","221420480":"Space-Time Codes from Crossed Product Algebras of Degree 4","220405719":"Group-oriented and Collusion Secure Fingerprint for Digital Images","263252805":"A new fingerprinting scheme using social network analysis for majority attack","249656854":"Privacy-aware peer-to-peer content distribution using automatically recombined fingerprints","221609421":"Traitor Tracing with Constant Size Ciphertext","260647797":"A Simple Tracing Algorithm for Binary Fingerprinting Code under Averaging Attack","220848599":"Obtaining Asymptotic Fingerprint Codes Through a New Analysis of the Boneh-Shaw Codes.","221420593":"On the Computation of Non-uniform Input for List Decoding on Bezerra-Garcia Tower.","251956736":"Robust parent-identifying codes","262174372":"Optimal suspicion functions for Tardos traitor tracing schemes","221038635":"Watermarking for Adaptive Streaming Protocols","51955218":"Optimal symmetric Tardos traitor tracing schemes","247769550":"Efficient Probabilistic Group Testing Based on Traitor Tracing","290110016":"Identity-Based Traitor Tracing with Short Private Key and Short Ciphertext","258442349":"Fingerprinting Codes and the Price of Approximate Differential Privacy","220722230":"Optimization of Tardos’s Fingerprinting Codes in a Viewpoint of Memory Amount","221210683":"Binary forensic code for multimedia signals: resisting minority collusion attacks.","224602229":"High-Rate Random-Like Spherical Fingerprinting Codes With Linear Decoding Complexity","34175248":"Cryptographic error correction /","221420587":"Homomorphic Encryptions of Sums of Groups.","261490828":"DNA-inspired anonymous fingerprinting for efficient peer-to-peer content distribution","254047800":"Trust in a cloud-based healthcare environment","220722232":"Capacity of Collusion Secure Fingerprinting - A Tradeoff between Rate and Efficiency - (Extended Abstract of Invited Talk).","220905482":"Traitor Tracing with Optimal Transmission Rate","224647234":"On Watermarking/Fingerprinting for Copyright Protection","3455250":"The Boneh–Shaw Fingerprinting Scheme is Better Than We Thought","224219770":"Tardos Fingerprinting Codes in the Combined Digit Model","220905474":"Traitor Tracing without A Priori Bound on the Coalition Size.","238594832":"Cooperation and Coalition in Multimedia Fingerprinting Colluder Social Networks","259195482":"Efficient Probabilistic Group Testing Based on Traitor Tracing","220722190":"Optimization and Evaluation of Randomized c-Secure CRT Code Defined on Polynomial Ring","259845207":"Capacities and Capacity-Achieving Decoders for Various Fingerprinting Games","220225038":"Query-preserving Watermarking of Relational Databases and XML Documents","221210653":"Better security levels for \u0027Broken Arrows\u0027","261424806":"Notice of Violation of IEEE Publication PrinciplesTwo-level Tardos fingerprinting code","280314240":"A Novel Block-Based Selective Embedding Type Video Data Hiding Using Encryption Algorithms","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","261121192":"Decoding Fingerprinting Using the Markov Chain Monte Carlo Method","221210647":"Robust fingerprinting codes and applications","277348287":"A Capacity-Achieving Simple Decoder for Bias-Based Traitor Tracing Schemes","268029123":"Security, privacy and trust in modern data management","221348365":"Traitors Collaborating in Public: Pirates 2.0","226231873":"Copy Protection Systems","262367971":"Capacity of collusion secure fingerprinting: a tradeoff between rate and efficiency","220990574":"On the Security of Pseudorandomized Information-Theoretically Secure Schemes","251839559":"A Tracing Algorithm for Short 2Secure Probabilistic Fingerprinting Codes Strongly Protecting Innocent Users","220484717":"Tardos fingerprinting is better than we thought","41440561":"Encryption mechanisms for digital content distribution","220722285":"On the Design and Optimization of Tardos Probabilistic Fingerprinting Codes","220479080":"Low Bandwidth Dynamic Traitor Tracing Schemes","261336287":"The holey grail A special score function for non-binary traitor tracing","220990563":"An Improvement of Pseudorandomization against Unbounded Attack Algorithms – The Case of Fingerprint Codes","221420643":"Iterative List Decoding of LDPC Codes.","220460658":"On error-correcting fingerprinting codes for use with watermarking","261050588":"Rebound on Symmetric Tardos Codes","220990584":"A General Conversion Method of Fingerprint Codes to (More) Robust Fingerprint Codes against Bit Erasure","4365591":"On the joint audio fingerprinting and decryption scheme","220722290":"Tardos’s Fingerprinting Code over AWGN Channel","221355623":"Pirate Evolution: How to Make the Most of Your Traitor Keys","220990587":"Efficient Traitor Tracing from Collusion Secure Codes","220333173":"Robust Parent-Identifying Codes and Combinatorial Arrays","50894943":"Towards Joint Tardos Decoding: The \u0027Don Quixote\u0027 Algorithm","220776048":"Equal-Weight Fingerprinting Codes","237843824":"Collusion-Resistant Audio Fingerprinting System in the Modulated Complex Lapped Transform Domain","50894934":"Iterative single Tardos decoder with controlled probability of false positive","26898116":"Collusion-resistant fingerprinting for multimedia in a broadcast channel environment","220587131":"Improved Tracing Algorithm for Random-Error-Resilient Collusion-Secure Fingerprinting Codes","221662825":"Secure Frameproof Code Through Biclique Cover","220722240":"An Improvement of Short 2-Secure Fingerprint Codes Strongly Avoiding False-Positive","254869593":"Accusation probabilities in Tardos codes: Beyond the Gaussian approximation","221420633":"An Improvement of Tardos’s Collusion-Secure Fingerprinting Codes with Very Short Lengths","258407434":"Information Theoretic Security","4349228":"Randomized Frameproof Codes: Fingerprinting Plus Validation Minus Tracing","220144753":"Traitor tracing over YouTube video service - Proof of concept","264896698":"Subjective evaluation of Video DNA Watermarking under bitrate conservation constraints","224246316":"Group testing meets traitor tracing","221210715":"Expectation Maximisation decoding of Tardos probabilistic fingerprinting code","261512931":"Asymptotics of Fingerprinting and Group Testing: Tight Bounds From Channel Capacities","221523522":"Attack Analysis for He \u0026 Wu’s Joint Watermarking/Fingerprinting Scheme","26543341":"Novel Attacks on Spread-Spectrum Fingerprinting","224678936":"Random Binary Fingerprinting Codes for Arbitrarily Sized Coalitions","31597727":"Dense MIMO Matrix Lattices a Meeting Point for Class Field Theory and Invariant Theory","220776022":"On the Effects of Pirate Evolution on the Design of Digital Content Distribution Systems.","221010604":"Identity-Based Traitor Tracing","224198876":"A Privacy-Preserving Buyer–Seller Watermarking Protocol Based on Priced Oblivious Transfer","220793515":"H.264/AVC digital fingerprinting based on content adaptive embedding","272193983":"Optimal sequential fingerprinting: Wald vs. Tardos","220766881":"Worst-Case Optimal Fingerprinting Codes for Non-threshold Collusion","221170343":"On the Secure Multimedia Distribution Scheme Based on Partial Encryption","232625751":"Coded Fingerprinting Codes Based on Delay Embedding","243184627":"it Invited Paper - Tutorial: Ensuring Security of H.264 Videos by Using Watermarking","230570028":"Answering n^{2+o(1)} Counting Queries with Differential Privacy is Hard","232639561":"A Novel Concatenated Fingerprint Code for Multimedia","250968419":"Bandwidth efficient asymmetric fingerprinting based on one-out-of-two oblivious transfer","224436983":"Hierarchical Construction of Tardos Code","224436985":"A Group Testing Based Deterministic Tracing Algorithm for a Short Random Fingerprint Code","45340970":"Le traçage de traîtres","45340968":"EM Decoding of Tardos Traitor Tracing Codes","224182471":"Tracing Pirated Content on the Internet: Unwinding Ariadne\u0027s Thread","45340972":"Estimating the Minimal Length of Tardos Code","220722305":"Combining Tardos Fingerprinting Codes and Fingercasting","220638336":"Fully collusion-resistant traitor tracing scheme with shorter ciphertexts","220166327":"Recent Advances in Multimedia Information System Security.","261038119":"A scheme of betrayal checking and traitor tracing for confidential image in Internet","224578763":"Saddle-point Solution of the Fingerprinting Capacity Game Under the Marking Assumption","220335247":"Making Collusion-Secure Codes (More) Robust against Bit Erasure.","261017121":"H.264/AVC Digital Fingerprinting Based on Spatio-Temporal Just Noticeable Distortion","46119692":"Anti-Collusion Fingerprinting for Multimedia Content Protection","224213225":"Identifying Traitors Using the Koetter–Vardy Algorithm","51955885":"Fingerprinting with Equiangular Tight Frames","257428704":"Black-Box Trace\u0026Revoke Codes","224142054":"Group-Oriented Anti-Collusion Fingerprint Based on BIBD Code","45813511":"Efficient Coalition Detection in Traitor Tracing","220437661":"Hierarchical Spread Spectrum Fingerprinting Scheme Based on the CDMA Technique","277094203":"Multimedia Protection using Content and Embedded Fingerprints","228573791":"Probabilistic Fingerprinting Codes Used To Detect Traitor Zero-bit Watermark","220234467":"Soft Decision Decoding of Boneh-Shaw Fingerprinting Codes","220598498":"Robust Video Data Hiding Using Forbidden Zone Data Hiding and Selective Embedding","220237031":"A Trade-off Traitor Tracing Scheme","221420795":"On Generalized Hamming Weights and the Covering Radius of Linear Codes","225259169":"The Marriage of Cryptography and Watermarking — Beneficial and Challenging for Secure Watermarking and Detection","1960396":"On the Fingerprinting Capacity Under the Marking Assumption","224101513":"Blind decoder for binary probabilistic traitor tracing codes","224101512":"Tardos fingerprinting codes in the combined digit model","220242676":"Systematic Generation of Tardos\u0027s Fingerprint Codes","221420775":"A Short Random Fingerprinting Code Against a Small Number of Pirates","275033009":"Communication Optimal Tardos-Based Asymmetric Fingerprinting","220336891":"On the Security of Pseudorandomized Information-Theoretically Secure Schemes.","224101510":"Capacity-achieving fingerprint decoding","1912318":"Randomized Frameproof Codes: Fingerprinting Plus Validation Minus Tracing","220784844":"A New Soft Decision Tracing Algorithm for Binary Fingerprinting Codes","264273447":"A watermarking scheme for High Efficiency Video Coding (HEVC)","3455452":"Lookup-Table-Based Secure Client-Side Embedding for Spread-Spectrum Watermarks","258407567":"Information Hiding","220307663":"Collusion-Resistant Fingerprinting Systems: Review and Recent Results.","235360744":"Discrete Distributions in the Tardos Scheme, Revisited","268694515":"Joint fingerprinting and encryption in hybrid domains for multimedia sharing in social networks","280530763":"Efficient Robust and Secure E-DRM with Encrypted Content Search","29621302":"Tracing Malicious Proxies in Proxy Re-Encryption","221420741":"Normalized Minimum Determinant Calculation for Multi-block and Asymmetric Space-Time Codes","251191552":"Collusion Resistance of Digital Fingerprinting Schemes","271547862":"A watermarking system for adaptive streaming","224218279":"Security and Robustness Constraints for Spread-Spectrum Tardos Fingerprinting","224200871":"Spread Spectrum-Based Watermarking for Tardos Code-Based Fingerprinting for H.264/AVC Video","266509848":"Information security and cryptology. Second SKLOIS conference, Inscrypt 2006, Beijing, China, November 29–December 1, 2006. Proceedings","260408446":"SVM-based anti-forensic method for spread-spectrum fingerprinting","228628061":"Performance study and improvement on ECC-based binary anti-collusion forensic code for multimedia"},"index":28}