{"abs":"A general method is presented for computation of radial distribution functions for plasmas over a wide range of temperatures and densities. The method uses the Monte Carlo technique applied by Wood and Parker, and extends this to long-range forces using results borrowed from crystal lattice theory. The approach is then used to calculate the radial distribution functions for a proton-electron plasma of density 1018 electrons/cm3 at a temperature of 104 OK. The results show the usefulness of the method if sufficient computing facilities are available.","title":"Monte Carlo Calculations of the Radial Distribution Functions for a Proton?Electron Plasma","id":246868729,"url":"https://www.researchgate.net/publication/246868729_Monte_Carlo_Calculations_of_the_Radial_Distribution_Functions_for_a_ProtonElectron_Plasma","names":["A. A. Barker","Australian Journal of Physics"],"references":{},"citedIn":{"246566064":"Iterative and Non-iterative Simulation Algorithms","44185761":"The T-shaped anisotropic molecule model: a unique perspective of the glass transition and gelation in low valence, directional, network forming liquids","232707290":"Simulated Annealing","243118712":"The Evolution of Markov Chain Monte Carlo Methods","276461948":"Improving the acceptance in Monte Carlo simulations: Sampling through intermediate states","222923854":"Using the Gibbs sampler for conditional simulation of Gaussian-based random fields","248257604":"Using all Metropolis-Hastings proposals to estimate mean values","220093847":"The Monte Carlo Method in Science and Engineering","249357526":"Characteristics and Their Intelligent Control of Nanostructured Materials","228733352":"Markov Chain Monte Carlo Calculations Allowing Parallel Processing Using a Variant of the Metropolis Algorithm","4791234":"The Candy model: Properties and inference","252927006":"Selective evolutionary generation systems: Theory and applications","258753506":"Geometrically Constructed Markov Chain Monte Carlo Study of Quantum Spin-phonon Complex Systems","231247832":"A Benchmark Test Set for Alchemical Free Energy Transformations and Its Use to Quantify Error in Common Free Energy Methods","266017871":"Sampling Unnormalized Probabilities: An Alternative to the Metropolis--Hastings Algorithm","220059528":"Adaptive Search with Stochastic Acceptance Probabilities for Global Optimization","223822273":"Iterative simulation methods","257697605":"Optimal search efficiency of Barker’s algorithm with an exponential fitness function","261661955":"On the Sampling Method for Grand Canonical Monte Carlo Simulations","225105014":"Waste-Recycling Monte Carlo","38357609":"Markov Chains for Exploring Posterior Distributions","226734498":"Uses and Abuses of Statistical Simulation","266709447":"Computational Physics","243043807":"Reconstruction of polygonal images","221617809":"Markov Chain Monte Carlo with People.","280570910":"Orthogonal parallel MCMC methods for sampling and optimization","232128380":"Generalized Monte Carlo Significance Tests","279388045":"Monte Carlo: Choosing Which Game to Play","260946727":"A rigorous sequential update strategy for parallel kinetic Monte Carlo simulation","231217251":"A Guide to Monte Carlo for Statistical Mechanics: Byways","279633412":"Locally weighted Markov chain Monte Carlo","3625735":"Using Bayesian networks for incorporating probabilistic a priori knowledge into Boltzmann machines","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","271759872":"A History of the Metropolis–Hastings Algorithm","223755374":"Metropolis–Hastings from a stochastic population dynamics perspective","264122756":"A rigorous sequential update strategy for parallel kinetic Monte Carlo simulation","23767633":"Simulated Mutagenesis of the Hypervariable Loops of a Llama VHH Domain for the Recovery of Canonical Conformations","267258963":"Some Non-Standard Sequential Monte Carlo Methods and Their Applications","229202836":"General-purpose distributed software for Monte Carlo simulations in materials design","51912101":"Geometric Allocation Approach for Transition Kernel of Markov Chain","274730206":"The Metropolis—Hastings Algorithm","256531082":"Electrostatic potentials in periodic boundary conditions","3077870":"A Theoretical Analysis of Monte Carlo Algorithms for the Simulation of Gibbs Random Field Images","46215937":"Marked point processes for statistical and morphological analysis of astronomical data","29489024":"Methods in Percolation","262319329":"Classification of Acceptance Criteria for the Simulated Annealing Algorithm","224253844":"Selective Evolutionary Generation: A model for optimally efficient search in biology","273204504":"A bi-stable neuronal model of Gibbs distribution","26763849":"Uncovering mental representations with Markov chain Monte Carlo","34488287":"Mapping Bayesian networks to stochastic neural networks : a foundation for hybrid Bayesian-neural systems /","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","236854474":"Monte Carlo Simulation Methods for Computing Liquid-Vapor Saturation Properties of Model Systems","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","48205193":"CLTs and Asymptotic Variance of Time-Sampled Markov Chains","266920754":"Modeling and spatial statistics","2337400":"Mapping Bayesian Networks to Boltzmann Machines","51969475":"On the flexibility of the design of Multiple Try Metropolis schemes","233094456":"Integral Transforms and Bayesian Inference in the Identification of Variable Thermal Conductivity in Two-Phase Dispersed Systems","242084528":"A jackknife-derived visual approach for sample size determination","223025301":"General Hit-and-Run Monte Carlo sampling for evaluating multidimensional integrals","4746390":"A History of the Metropolis-Hastings Algorithm","252306902":"Multidimensional Integration of a Positive Function Using Markov Chain Monte Carlo","279435256":"Selection of a simulation method","264899755":"Understanding the Hastings Algorithm","220204609":"Massively Parallel Probabilistic Reasoning with Boltzmann Machines","220146042":"Optimal closed boundary identification in gray-scale imagery","279347776":"The Monte Carlo Method","258515456":"Identifying representations of categories of discrete items using Markov chain Monte Carlo with People","277287918":"Mapping Bayesian Networks to Boltzmann Machines","253255667":"On the Potential of Monte Carlo Methods for Simulating Macromolecular Assemblies","253224059":"Markov Chain Monte Carlo Algorithms Allowing Parallel Processing -II","4996640":"Control Variates for the Metropolis-Hastings Algorithm","263943374":"Review of Monte Carlo Methods for the Prediction of Distributed Molecular and Morphological Polymer Properties","37616843":"A Generalized Markov Sampler","239814716":"Approximation Algorithms for NP-problems","283407004":"Molecular Dynamics Calculations on Molten Ionic Salts","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?"},"index":287}