{"abs":"A number of criteria based on kriging variance calculations may be used for infill sampling design in geologic site characterization. Searching for the best new sample locations from a set of candidate locations can result in excessive computation time if these criteria and the naive rekriging are used. The relative updated kriging estimate and variance for universal kriging estimation are demonstrated as a simple kriging estimate and variance, respectively. The updated kriging variance is demonstrated as the multiplication of two kriging variances. Using these updated kriging variance equations can increase the computational speed for selecting the best new sample locations. The application results for oil rock thickness in an oilfield indicate that minimizing the average relative updated kriging variance is a useful alternative to the other criteria based on kriging variance in optimal infill sampling design for geologic site characterization.","title":"The Updated Kriging Variance and Optimal Sample Design","id":225843631,"url":"https://www.researchgate.net/publication/225843631_The_Updated_Kriging_Variance_and_Optimal_Sample_Design","names":["Haiyu Gao","Jiahua Wang","Pengda Zhao","Mathematical Geology"],"references":{"226432894":"Orthonormal residuals In geostatistics–Model criticism and parameter-estimation","257042833":"Solving the kriging problem by using the Gram-Schmidt orthogonalization","225314922":"Infill-sampling design and the Cost of classification errors","240488896":"Network Design for the Estimation of Areal Mean of Rainfall Events","238342681":"Principles of geostatistics. Econ Geol (Lancaster)"},"citedIn":{"224367676":"A cooperative deployment strategy for optimal sampling in spatiotemporal estimation","260975050":"Groundwater","257800953":"A Model-Based Approach to Designing a Fishery-Independent Survey","269420296":"Fast Update of Conditional Simulation Ensembles","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","226936553":"A Pool-Based Model of the Spatial Distribution of Undiscovered Petroleum Resoufrces","252702592":"Groundwater Dynamics in Hard Rock Aquifers","258772419":"A geostatistical approach for groundwater head monitoring network optimisation: Case of the Sfax superficial aquifer (Tunisia)","44230994":"On Experimental Designs for Derivative Random Fields","251945460":"Optimization of large scales ocean sampling for minimization of the Kriging variance","230661710":"Field Sampling for Environmental Science and Management","221966156":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","270516841":"A new method for 3D designing of complementary exploration drilling layout based on ore value and objective functions","227314939":"Spatial Assessment and Redesign of a Groundwater Quality Monitoring Network Using Entropy Theory, Gaza Strip, Palestine","241174071":"Near-optimal collecting data strategy based on ordinary Kiriging variance","29626814":"Assessment of spatial structure of groundwater quality variables based on the entropy theory","225331924":"The kriging update equations and their application to the selection of neighboring data","220274010":"A spatial sampling optimization package using MSN theory","237151710":"A geostatistical approach to optimize sampling designs for local forest inventories","226213125":"Geostatistical Estimation Variance Approach to Optimizing an Air Temperature Monitoring Network"},"index":288}