{"abs":"We consider a new type of traitor tracing scheme, called sequential traitor tracing, that protects against rebroadcasting of decrypted content. Sequential traceability (TA) schemes trace all up to c traitors and remove the shortcomings of dynamic tracing schemes. We give two general constructions and show the relationship between c-TA codes and sequential tracing schemes.","title":"Sequential traitor tracing","id":3084733,"url":"https://www.researchgate.net/publication/3084733_Sequential_traitor_tracing","names":["Reihaneh Safavi-Naini","Yejing Wang","IEEE Transactions on Information Theory"],"references":{"5567414":"Secure spread spectrum watermarking for multimedia","3080362":"Combinatorial properties of frameproof and traceability codes","221609344":"Collusion Secure q-ary Fingerprinting for Perceptual Content","220617395":"Efficient Dynamic Traitor Tracing","220478972":"Dynamic Traitor Tracing","264457915":"Secure Spread Spectrum Watermarking for Multimedia","3079606":"Collusion-secure fingerprinting for digital data","221355098":"Dynamic Traitor Tracing","220681180":"Combinatorial properties of frameproof and traceability codes.","247493131":"Sequential Traitor Tracing Advances in Cryptology-CRYPTO 2000","237607924":"algebraic-geometric codes","221355327":"Broadcast Encryption"},"citedIn":{"260383751":"New secret key traitor tracing scheme with dispute settlement from bilinear maps","226254072":"A Multi-Key Pirate Decoder Against Traitor Tracing Schemes","221046696":"Unifying Broadcast Encryption and Traitor Tracing for Content Protection","267436282":"A Generic View on Trace-and-Revoke Broadcast Encryption Schemes","263230651":"Design of Self‐Healing Key Distribution Schemes: Proceedings of the Third Pythagorean Conference","228862260":"Efficient traitor tracing","2864441":"Optimal Probabilistic Fingerprint Codes","220201010":"A tree-based scheme for security of many-to-many communications","221540903":"Trade-Off Traitor Tracing.","256498013":"Deterring Traitor Using Double Encryption Scheme","221434794":"Practical Scenarios for the Van Trung-Martirosyan Codes.","226265959":"Trade-Off Traitor Tracing","221239603":"New Traceability Codes Against a Generalized Collusion Attack for Digital Fingerprinting.","221410349":"Threat analysis of online health information system.","220905482":"Traitor Tracing with Optimal Transmission Rate","221347856":"Extracting Group Signatures from Traitor Tracing Schemes","221609491":"A fully collusion resistant broadcast, trace, and revoke system","220905474":"Traitor Tracing without A Priori Bound on the Coalition Size.","220919937":"Privacy, traceability, and anonymity for content protection","257694199":"Video watermark application for embedding recipient ID in real-time-encoding VoD server","225225536":"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys","3338910":"Digital Rights Management in Ubiquitous Computing","3086339":"Achievable Error Exponents for the Private Fingerprinting Game","221631899":"Renewable Traitor Tracing: A Trace-Revoke-Trace System For Anonymous Attack","257487991":"Toward tracing and revoking schemes secure against collusion and any form of secret information leakage","2955933":"Protecting cryptographic keys: The trace-and revoke approach","3085343":"On the Capacity Game of Private Fingerprinting Systems Under Collusion Attacks","286354979":"Broadcast yourself securely: enhanced transmission scheme for sharing digital creations","221436417":"Traitor Tracing for Anonymous Attack in Content Protection.","259742543":"Deterring Traitor Using Double Encryption Scheme","220271893":"A Traitor Tracing Scheme Based on RSA for Fast Decryption","4248953":"Collusion-Resistant Dynamic Fingerprinting for Multimedia","45110026":"Sequential and Dynamic Frameproof Codes","45110027":"Sliding-window dynamic frameproof codes","220945808":"New Traceability Codes and Identification Algorithm for Tracing Pirates","221051024":"Randomised Dynamic Traitor Tracing.","45813511":"Efficient Coalition Detection in Traitor Tracing","224127899":"Network-Based Traitor-Tracing Technique Using Traffic Pattern","222828168":"Content adaptive watermarking for multimedia fingerprinting","286354903":"Towards Analyzing Traceability of Data Leakage by Malicious Insiders","220237031":"A Trade-off Traitor Tracing Scheme","220725743":"Practical Forensic Analysis in Advanced Access Content System","262371684":"Near-Optimal Collusion-Secure Fingerprinting Codes for Efficiently Tracing Illegal Re-distribution","221135079":"Traitor tracing for prerecorded and recordable media","41440561":"Encryption mechanisms for digital content distribution","220739431":"Identification of Traitors Using a Trellis.","221263208":"Hybrid Traitor Tracing.","4138214":"A traceable content-adaptive fingerprinting for multimedia","35632324":"On cryptographic techniques for digital rights management /","256498217":"Traitor Tracing Scheme to Counter Piracy Strategies","262241728":"Traffic Pattern-Based Content Leakage Detection for Trusted Content Delivery Networks","221285074":"Traitor Tracing Technology of Streaming Contents Delivery using Traffic Pattern in Wired/Wireless Environments.","226103577":"Tracing Traitors by Guessing Secrets. The q-Ary Case","221000271":"Efficient traitor tracing for clone attack in content protection","287365444":"Traitor tracing for multimedia forensics","4319016":"Digital Rights Management system design and implementation issues","225414046":"Piracy Protection for Streaming Content in Home Networks","226986997":"Dynamic subtree tracing and its application in pay-TV systems","256498106":"A Review on Traitor Tracing Schemes","221540940":"Identification Algorithms for Sequential Traitor Tracing.","221609421":"Traitor Tracing with Constant Size Ciphertext","228578788":"Renewable Traitor Tracing: A Broadcast, Tracing and Revoke System for Anonymous Attack","3086160":"On Self-Healing Key Distribution Schemes","220696408":"Encryption for Digital Content"},"index":293}