{"abs":"We give cryptographic schemes that help trace the source of leaks when sensitive or proprietary data is made available to a large set of parties. A very relevant application is in the context of pay television, where only paying customers should be able to view certain programs. In this application, the programs are normally encrypted, and then the sensitive data is the decryption keys that are given to paying customers. If a pirate decoder is found, it is desirable to reveal the source of its decryption keys. We describe fully resilient schemes which can be used against any decoder which decrypts with nonnegligible probability. Since there is typically little demand for decoders which decrypt only a small fraction of the transmissions (even if it is nonnegligible), we further introduce threshold tracing schemes which can only be used against decoders which succeed in decryption with probability greater than some threshold. Threshold schemes are considerably more efficient than fully resilient schemes","title":"Tracing Traitors","id":3080073,"url":"https://www.researchgate.net/publication/3080073_Tracing_Traitors","names":["Benny Chor","Amos Fiat","Moni Naor","Benny Pinkas","IEEE Transactions on Information Theory"],"references":{"222466434":"New hash functions and their use in authentication and set equality","220687910":"Data Structures and Algorithms 1","220533734":"Combinatorial Properties and Constructions of Traceability Schemes and Frameproof Codes","226226622":"Lecture Notes in Computer Science","2995754":"The theory of error-correcting codes","221355327":"Broadcast Encryption","2788347":"Digital Signets: Self-Enforcing Protection of Digital Information","4355284":"Storing a Sparse Table with 0(1) Worst Case Access Time","3079606":"Collusion-secure fingerprinting for digital data","220478972":"Dynamic Traitor Tracing","222457947":"Universal classes of hash functions","225124554":"Families of finite sets in which no set is covered by the union ofr others","5567414":"Secure spread spectrum watermarking for multimedia","234796317":"Key Management for Multicast: Issues and Architectures","2399040":"Tamper Resistance --- a Cautionary Note","266354758":"Advances in cryptology - CRYPTO ’99. 19th annual international cryptology conference Santa Barbara, CA, USA, August 15–19, 1999. Proceedings","258239683":"The Theory of Error-Correcting Codes, Part I","3077956":"Construction of asymptotically good low-rate error-correcting codes through pseudo-random graphs","220431496":"How to construct random functions. J ACM","221355522":"An Efficient Public Key Traitor Tracing Scheme","242371333":"The Theory of Error Correcting Codes","222390008":"Families of finite sets in which no set is covered by the union of two others","2269851":"Differential Fault Analysis of Secret Key Cryptosystems","221355466":"Threshold Traitor Tracing.","3790021":"Multicast security: A taxonomy and some efficient constructions","220722201":"Trials of Traced Traitors.","2409434":"On the Importance of Checking Computations","2848532":"The Probabilistic Method","220695960":"The Probabilistic Method"},"citedIn":{"221348145":"Traitor Tracing with Constant Transmission Rate","3334704":"Key management for restricted multicast using broadcast encryption","238346806":"Robust fingerprinting codes: A near optimal construction","3338801":"A dual watermark-fingerprint system","220080921":"A Hypergraph Approach to the Identifying Parent Property: The Case of Multiple Parents","242370170":"Binary Collusion-Secure Codes: Comparison and Improvements","247928015":"Zero false positive 2-secure fingerprinting watermarking based on combining hamming distance conditions and parent pair search","249837805":"A Fully Public Key Tracing and Revocation Scheme Provably Secure Against Adaptive Adversary","2355753":"Towards Making Broadcast Encryption Practical","220678956":"Tardos Fingerprinting is Better Than We Thought","220898597":"Fully Collusion Resistant Black-Box Traitor Revocable Broadcast Encryption with Short Private Keys","220271918":"Improving the Round Complexity of Traitor Tracing Schemes","221571366":"Multimedia content screening using a dual watermarking and fingerprinting system","221609254":"Breaking and Repairing Asymmetric Public-Key Traitor Tracing","3338791":"Soft-decision tracing in fingerprinted multimedia content","238009402":"Document Tracking - On the Way to a New Security Service","226888593":"FUNCTION FIELDS OVER FINITE FIELDS AND THEIR APPLICATIONS TO CRYPTOGRAPHY","2937403":"Scalable Public-Key Tracing and Revoking","220334906":"On the Security of Fully Collusion Resistant Traitor Tracing Schemes.","221523758":"Fingerprinting Schemes. Identifying the Guilty Sources Using Side Information","226265959":"Trade-Off Traitor Tracing","247928027":"The advanced access content system\u0027s use of digital watermarking","221239603":"New Traceability Codes Against a Generalized Collusion Attack for Digital Fingerprinting.","226932635":"A Code for Sequential Traitor Tracing","4136993":"Linear Combination Collusion Attack and its Application on an Anti-Collusion Fingerprinting","221327150":"A Revocation Scheme with Minimal Storage at Receivers","224621382":"Attacks and Forensic Analysis for Multimedia Content Protection","245569668":"Video Fingerprinting System through Zero-based Code Modulation Technique","225047361":"Hierarchical Traceability Of Multimedia Documents","282497790":"On the measurement complexity of differentially private query answering","221135109":"Public-key traitor tracing from efficient decoding and unbounded enrollment: extended abstract.","3086339":"Achievable Error Exponents for the Private Fingerprinting Game","225225536":"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys","220722442":"On the IPP properties of Reed-Solomon codes","3085343":"On the Capacity Game of Private Fingerprinting Systems Under Collusion Attacks","221406470":"An Efficient Group Key Management Scheme for Secure Multicast with Multimedia Applications.","220271893":"A Traitor Tracing Scheme Based on RSA for Fast Decryption","260647869":"Bias Equalizer for Binary Probabilistic Fingerprinting Codes","259742543":"Deterring Traitor Using Double Encryption Scheme","221327110":"A Traceable Block Cipher","222561148":"Generalized hashing and parent-identifying codes","2800659":"On the Limitations of Digital Watermarks: A Cautionary Note","227627435":"Constructions of 2‐cover‐free families and related separating hash families","242281547":"Large Scale and Mobile Group Communication Systems","241630813":"Lower bounds on almost-separating binary codes","220271900":"Fighting Pirates 2.0","220271903":"Bayesian Methods for Practical Traitor Tracing.","221433101":"A Practical Solution for Distribution Rights Protection in Multicast Environments","221355376":"Self Protecting Pirates and Black-Box Traitor Tracing","225736496":"Efficient broadcast encryption scheme based on number theory research unit","221651825":"Improved Algebraic Traitor Tracing Scheme.","220292966":"Wireless broadcast encryption based on smart cards","221348217":"Optimum Traitor Tracing and Asymmetric Schemes.","238048888":"Performance and code length optimization of joint decoding tardos fingerprinting","220639083":"Improved versions of Tardos’ fingerprinting scheme","251817805":"A Traitor Tracing Scheme Based on the RSA Scheme","220335469":"Privacy-Aware Attribute-Based Encryption with User Accountability","237665913":"Fully Collusion-Resilient Traitor Tracing Scheme","220458871":"A tau-Restricted Key Agreement Scheme.","3901551":"Information hiding for EC: public key traitor tracing for digital copyright protection","3080827":"Asymptotic bounds on frameproof codes","221263208":"Hybrid Traitor Tracing.","3188329":"Key establishment in large dynamic groups using one-way function trees","221348715":"Public Traceability in Traitor Tracing Schemes","225108272":"Aspects of Digital Rights Management and the Use of Hardware Security Devices","224083719":"Audio watermarking in compressed domain","4215837":"Efficient Traitor Tracing Scheme Based On NTRU","242101808":"Construction of Multi-dimension Plateaued Functions","226103577":"Tracing Traitors by Guessing Secrets. The q-Ary Case","241623554":"Fast and adaptive tracing strategies for 3-secure fingerprint watermarking codes","2629197":"Reports In Informatics","2351686":"Number-Theoretic Constructions of Efficient Pseudo-Random Functions","221208394":"How to Construct Multicast Cryptosystems Provably Secure Against Adaptive Chosen Ciphertext Attack","221017418":"An Asymmetric Traceability Scheme for Copyright Protection without Trust Assumptions.","238566480":"On the Complexity of Differentially Private Data Release","279720132":"Practical “Traitor Tracing”","221651806":"Tracing and Revoking Pirate Rebroadcasts","221010781":"A Public-Key Traitor Tracing Scheme with Revocation Using Dynamic Shares","226986997":"Dynamic subtree tracing and its application in pay-TV systems","4187720":"Boneh-Shaw fingerprinting and soft decision decoding","250237591":"Information Flow in the Peer-Reviewing Process (Extended Abstract)","221046696":"Unifying Broadcast Encryption and Traitor Tracing for Content Protection","269318793":"Video Game Watermarking","3080362":"Combinatorial properties of frameproof and traceability codes","228725546":"On the design of a secure multimedia archive","221056935":"The Key Establishment Problem.","227781405":"On optimal superimposed codes","224630252":"A Scalable Multi-service Group Key Management Scheme","3480740":"Tracing illegal redistribution using errors-anderasures and side information decoding algorithms","221056952":"Cryptographic Algorithms for Multimedia Traffic.","222369751":"Constructions of generalized superimposed codes with applications to group testing and conflict resolution in multiple access channels","225461223":"A Note on the Limits of Collusion-Resistant","2940091":"Key-Insulated Public Key Cryptosystems","221434794":"Practical Scenarios for the Van Trung-Martirosyan Codes.","225191414":"Fair Identification","45825575":"A Traitor Tracing Scheme Based on the RSA System","220796852":"Efficient Broadcast Encryption Scheme with Log-Key Storage","221326764":"A Public-Key Black-Box Traitor Tracing Scheme with Sublinear Ciphertext Size Against Self-Defensive Pirates","30513486":"Courbes elliptiques et applications cryptographiques à la diffusion numérique sécurisée","220334982":"A New Joint Fingerprinting and Decryption Scheme based on a Lattice Problem.","243681827":"On Generalized Greedy Algorithms in Broadcast Key Distribution Schemes","4251877":"Information Flow in the Peer-Reviewing Process","221420948":"Traitor Tracing Against Powerful Attacks Using Combinatorial Designs","221631899":"Renewable Traitor Tracing: A Trace-Revoke-Trace System For Anonymous Attack","44795397":"Improving the Boneh-Franklin Traitor Tracing Scheme","2955933":"Protecting cryptographic keys: The trace-and revoke approach","225151963":"Efficient Trace and Revoke Schemes","255365514":"A Flexibly Revocable Key-Distribution Scheme for Efficient BlackBox Tracing","267660097":"On the relationship between the traceability properties of Reed-Solomon codes","225113565":"A Public-Key Traitor Tracing Scheme with an Optimal Transmission Rate","220945808":"New Traceability Codes and Identification Algorithm for Tracing Pirates","4311293":"Copyright Protection in Overlay Multicast Communication","221506958":"Trace and revoke systems with short ciphertexts","228951834":"Attribute-based encryption with key cloning protection","224127899":"Network-Based Traitor-Tracing Technique Using Traffic Pattern","220533734":"Combinatorial Properties and Constructions of Traceability Schemes and Frameproof Codes","3085036":"Upper Bounds on Separating Codes","221052904":"Identity-Based Authenticated Broadcast Encryption and Distributed Authenticated Encryption","2495715":"Internet as a Business Place: Logistics and Challenges","220725743":"Practical Forensic Analysis in Advanced Access Content System","262371684":"Near-Optimal Collusion-Secure Fingerprinting Codes for Efficiently Tracing Illegal Re-distribution","221608958":"Data collection with self-enforcing privacy","232625430":"Traitor Tracing Scheme Based on Luc Public-key Cryptosystem","48602665":"A set theoretic approach to broadcast encryption","238475001":"Design of Fair Tracing E-cash System based on Blind Signature","7771303":"Anti-collusion forensics of multimedia fingerprinting using orthogonal modulation","220798456":"Privacy against Piracy: Protecting Two-Level Revocable P-K Traitor Tracing","220335603":"Copyrighting Public-key Functions and Applications to Black-box Traitor Tracing.","221655525":"SiRiUS: Securing remote untrusted storage","220478972":"Dynamic Traitor Tracing","4138214":"A traceable content-adaptive fingerprinting for multimedia","220798451":"Forgery Attack to an Asymptotically Optimal Traitor Tracing Scheme.","35632324":"On cryptographic techniques for digital rights management /","239545497":"P4P: A Practical Framework for Privacy-Preserving Distributed Computation","221326831":"An Efficient Public Key Trace and Revoke Scheme Secure against Adaptive Chosen Ciphertext Attack","267047221":"Framework for preserving security and privacy in peer-to-peer content distribution systems","255588827":"Tracing Precept against Self-Protective Tortious Decoder","224754055":"Good ternary 2-traceability codes exist","224754054":"Fighting three pirates with scattering codes","226123161":"Linear Code Implies Public-Key Traitor Tracing","224679296":"Practical Construction Against Theoretical Approach in Fingerprinting","247926818":"The privacy of tracing traitors","228852044":"A fully public-key traitor-tracing scheme.","224183732":"Comments on \"New Results on Frame-Proof Codes and Traceability Schemes\"","3904722":"On some efficient constructions of frameproof codes","220066807":"Redistributing time-based rights between consumer devices for content sharing in DRM system","220725700":"Traitor Tracing against Public Collaboration","220722122":"A Collusion-Secure Fingerprinting Code Reduced by Chinese Remaindering and Its Random-Error Resilience","260542312":"Fingerprinting With Equiangular Tight Frames","221116381":"Mediated Traceable Anonymous Encryption","222697911":"Lecture Notes in Computer Science","220798424":"Adaptively Secure Traitor Tracing Against Key Exposure and Its Application to Anywhere TV Service.","225414046":"Piracy Protection for Streaming Content in Home Networks","252419065":"Security and Efficiency Tradeoffs in Multicast Group Key Management","220593617":"Data Collection with Self-Enforcing Privacy","221609421":"Traitor Tracing with Constant Size Ciphertext","2962133":"Turning Teenagers into Stores","225387413":"Coding Constructions for Blacklisting Problems without Computational Assumptions","221355466":"Threshold Traitor Tracing.","220798421":"TTS without Revocation Capability Secure Against CCA2","4365503":"Generalized traitor tracing for nested codes","220725718":"A Practical Clumped-Tree Multicast Encryption Scheme.","251956736":"Robust parent-identifying codes","258713198":"Ranking Search for Probabilistic Fingerprinting Codes","250396651":"Codes for Digital Fingerprinting","2865442":"Asymptotic Overview on Separating Codes","263230651":"Design of Self‐Healing Key Distribution Schemes: Proceedings of the Third Pythagorean Conference","221149729":"Remote Revocation of Smart Cards in a Private DRM System.","2864441":"Optimal Probabilistic Fingerprint Codes","228937911":"Maintaining Information Security in E-Government through Steganology","220201010":"A tree-based scheme for security of many-to-many communications","221199932":"Randomized Traitor Tracing Algorithms for Broadcast Security.","3318566":"Anti-Collusion Fingerprinting for Multimedia","221291556":"Accountable Privacy","224710770":"Scalable Secure Bidirectional Group Communication","238669088":"Group-Oriented Encryption and Signature","34175248":"Cryptographic error correction /","220722750":"Broadcast Encryption for Differently Privileged","220722235":"Error- and Collusion-Secure Fingerprinting for Digital Data","220195329":"Secure multicast protocol with copyright protection","225166453":"An Efficient Single-Key Pirates Tracing Scheme Using Cover-Free Families","221521428":"Large Scale Distributed Watermarking Of Multicast Media Through Encryption","220905482":"Traitor Tracing with Optimal Transmission Rate","221347856":"Extracting Group Signatures from Traitor Tracing Schemes","224647234":"On Watermarking/Fingerprinting for Copyright Protection","226578597":"Fingerprinting Text in Logical Markup Languages","221609491":"A fully collusion resistant broadcast, trace, and revoke system","3455250":"The Boneh–Shaw Fingerprinting Scheme is Better Than We Thought","221169158":"Security Flaws in Kuribayashi-Tanaka Fingerprinting Protocol","220905474":"Traitor Tracing without A Priori Bound on the Coalition Size.","2873089":"Practical Pay TV Schemes","221632031":"New Considerations about the Correct Design of Turbo Fingerprinting Codes","223373435":"Intersecting codes and partially identifying codes","257487991":"Toward tracing and revoking schemes secure against collusion and any form of secret information leakage","4068111":"On gossip codes and traceability schemes","221355522":"An Efficient Public Key Traitor Tracing Scheme","3319041":"Identification of Traitors in Algebraic-Geometric Traceability Codes","220337174":"Traitor tracing scheme with constant ciphertext rate against powerful pirates","234818762":"Broadcast encryption with short keys and transmissions","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","45923211":"Advanced Software Protection Now","224724575":"Soft-decision decoding of traceability codes","4021511":"A generalization of traceability codes using ideal-based codes","220639261":"New constructions for IPP codes","220335641":"Fully Resilient Traitor Tracing Scheme using Key Update.","220639258":"On a Class of Traceability Codes","221348365":"Traitors Collaborating in Public: Pirates 2.0","45849594":"Two-Level Fingerprinting Codes","220337248":"Efficient Traitor Tracing Algorithms using List Decoding.","220990574":"On the Security of Pseudorandomized Information-Theoretically Secure Schemes","225561138":"Uniqueness of some optimal superimposed codes","220461158":"Multimedia Security in Group Communications: Recent Progress in Key Management, Authentication, and Watermarking","220897391":"Generic Construction of Hybrid Public Key Traitor Tracing with Full-Public-Traceability","221208169":"Shared Generation of Pseudo-Random Functions with Cumulative Maps","221648496":"On the Detection of DDoS Attackers for Large-Scale Networks.","220725871":"Defending against the Pirate Evolution Attack","221521532":"Perturbing and Protecting a Traceable Block Cipher","237332333":"Intellectual Property Protection System for a Workstation using Policy based Watermarking Scheme","220479080":"Low Bandwidth Dynamic Traitor Tracing Schemes","226564303":"Multi-recipient Public-Key Encryption with Shortened Ciphertext","221208160":"Fault Tolerant and DistributedBroadcast Encryption.","220990563":"An Improvement of Pseudorandomization against Unbounded Attack Algorithms – The Case of Fingerprint Codes","220390514":"Guessing secrets efficiently via list decoding","255669868":"On large scale real time music distribution: security, reliability and heterogeneity","220460658":"On error-correcting fingerprinting codes for use with watermarking","2293104":"Protocols for Collusion-Secure Asymmetric Fingerprinting (Extended Abstract)","228707570":"Bounds and Combinatorial Structure of (k, n) Multi-receiver A-codes","7852835":"Forensic analysis of nonlinear collusion attacks for multimedia fingerprinting","238795118":"Algorithms and Architectures for Multiuser, Multiterminal, Multi-layer Information Theoretic Security","237664636":"FOR-PROFIT ORGANIZATION SMALL BUSINESS MINORITY BUSINESS WOMAN-OWNED BUSINESS NAME OF PERFORMING ORGANIZATION, IF DIFFERENT FROM ABOVE ADDRESS OF PERFORMING ORGANIZATION, IF DIFFERENT, INCLUDING 9 DIGIT ZIP CODE","221355623":"Pirate Evolution: How to Make the Most of Your Traitor Keys","224574516":"A New Class of Pseudo-random Functions","220990587":"Efficient Traitor Tracing from Collusion Secure Codes","220776048":"Equal-Weight Fingerprinting Codes","220776050":"Separation and Witnesses","222619673":"A Class of I.p.p. Codes With Efficient Identification","26898116":"Collusion-resistant fingerprinting for multimedia in a broadcast channel environment","226243618":"Codes for Copyright Protection: The Case of Two Pirates","256498217":"Traitor Tracing Scheme to Counter Piracy Strategies","242540816":"Title of Dissertation: Multimedia Fingerprinting for Multiuser Forensics and Security","220833870":"Property-Based Broadcast Encryption for Multi-level Security Policies.","222469674":"Secure and lightweight advertising on the Web","242256152":"Fingerprinting Schemes for the Protection of Multimedia Distribution Rights","221208158":"Efficient Asymmetric Public-Key Traitor Tracing Without Trusted Agents","4015951":"Secret handshakes from pairing-based key agreements","2611541":"Resistance of Digital Watermarks to Collusive Attacks","3960142":"Decoding codes with the identifiable parent property","2919768":"Overview of Traitor Tracing Schemes","225180701":"Breaking Two k-Resilient Traitor Tracing Schemes with Sublinear Ciphertext Size","221540940":"Identification Algorithms for Sequential Traitor Tracing.","224067107":"Inherently large traceability of broadcast encryption scheme","220798547":"Fingercasting—Joint Fingerprinting and Decryption of Broadcast Messages","224067105":"Traitor traceable signature scheme","3080529":"New results on frame-proof codes and traceability schemes","220776022":"On the Effects of Pirate Evolution on the Design of Digital Content Distribution Systems.","3086160":"On Self-Healing Key Distribution Schemes","247015224":"On Perfect Traitor Tracing","220079263":"Traceability Codes","220333216":"An Attack on A Traitor Tracing Scheme","226254072":"A Multi-Key Pirate Decoder Against Traitor Tracing Schemes","2565550":"Multimedia Security In Group Communications: Recent Progress in Wired and Wireless Networks","221609151":"A general model of probabilistic packet marking for IP traceback","220348590":"Gossip Codes for Fingerprinting: Construction, Erasure Analysis and Pirate Tracing.","220905125":"RSA Accumulator Based Broadcast Encryption","220205233":"Efficient broadcast key distribution with dynamic revocation","220905144":"Systematic Treatment of Collusion Secure Codes: Security Definitions and Their Relations","220571830":"Defending against the pirate evolution attack","220617395":"Efficient Dynamic Traitor Tracing","224157892":"Two-level Fingerprinting: Stronger Definitions and Code Constructions","3084727":"Applications of list decoding to tracing traitors","3079606":"Collusion-secure fingerprinting for digital data","224719101":"SAMcast - A Scalable, Secure and Authenticated Multicast Protocol for Large Scale P2P Networks","4047780":"An illegal contents tracing system based on Web robot and fingerprinting scheme","223221975":"Identity-based broadcast signcryption","262204473":"Hardness Preserving Reductions via Cuckoo Hashing","224182471":"Tracing Pirated Content on the Internet: Unwinding Ariadne\u0027s Thread","226762264":"Efficient Traitor Tracing Algorithms Using List Decoding","254007996":"Efficiency of Optimistic Fair Exchange Using Trusted Devices","220962996":"Separating and Intersecting Properties of BCH and Kasami Codes.","221609642":"Building efficient fully collusion-resilient traitor tracing and revocation schemes","2835337":"Fault Tolerant and Distributed Broadcast Encryption","3086217":"Combinatorial Properties for Traceability Codes Using Error Correcting Codes","220638336":"Fully collusion-resistant traitor tracing scheme with shorter ciphertexts","261148214":"3D watermarking in the context of video games","221571731":"SCOTT: set cover tracing technology.","224723661":"Generalized hashing and applications to digital fingerprinting","220638860":"Upper bounds for parent-identifying set systems","224615112":"The digital fingerprint coding based on LDPC","220919937":"Privacy, traceability, and anonymity for content protection","224578767":"Two-Level Fingerprinting Codes","220797062":"Robustness and Security of Digital Watermarks.","221590148":"On the complexity of differentially private data release :Efficient algorithms and hardness results","221355139":"Collusion-Secure Fingerprinting for Digital Data (Extended Abstract).","220336272":"From Non-Adaptive to Adaptive Pseudorandom Functions.","224213225":"Identifying Traitors Using the Koetter–Vardy Algorithm","35701140":"Architectural techniques for enabling secure cryptographic processing /","220990613":"Upper Bounds for Set Systems with the Identifiable Parent Property","221243542":"Live Baiting for Service-Level DoS Attackers.","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","2388895":"A General Description of Pirate Strategies in a Binary Fingerprinting System","2631059":"Efficient Watermark Detection and Collusion Security","45110027":"Sliding-window dynamic frameproof codes","45813511":"Efficient Coalition Detection in Traitor Tracing","221420687":"Partially Identifying Codes for Copyright Protection.","221160686":"Key Management for Multicast Fingerprinting","248453900":"Winnowing, a Document Fingerprinting Algorithm","220333286":"Recursive Constructions of Secure Codes and Hash Families Using Difference Function Families.","3282932":"Key Management Approaches to Offer Data Confidentiality for Secure Multicast","221239529":"Practical Pay-TV Scheme Using Traitor Tracing Scheme for Multiple Channels","220237031":"A Trade-off Traitor Tracing Scheme","221135079":"Traitor tracing for prerecorded and recordable media","227067457":"Defending against Key Abuse Attacks in KP-ABE Enabled Broadcast Systems","221348600":"Converting Pairing-Based Cryptosystems from Composite-Order Groups to Prime-Order Groups","221135076":"Broadcast encryption versus public-key cryptography in content protection systems","255639792":"Asymmetric Public-key Traitor Tracing Based on Bilinear Map","225259169":"The Marriage of Cryptography and Watermarking — Beneficial and Challenging for Secure Watermarking and Detection","220335343":"Traitor-Tracing on Binary Strings.","252030164":"Authentication and Privacy on the Internet","221171450":"Tracing Stateful Pirate Decoders.","221135094":"Adaptive traitor tracing for large anonymous attack","220881648":"Swarm Intelligence Approach of Leaker Identification in Secure Multicast.","220335298":"Revocation and Tracing Schemes for Stateless Receivers","220739273":"Hierarchical Key Assignment for Black-Box Tracing with Efficient Ciphertext Size","224621703":"Traitor tracing against powerful attacks","229358159":"Broadcast encryption schemes based on RSA","224621702":"A secure traitor tracing scheme against key exposure","221609695":"On Crafty Pirates and Foxy Tracers","263533151":"On a Bound of Cover-Free Families","261478014":"Fragile Watermarking Scheme for Image Authentication","220307663":"Collusion-Resistant Fingerprinting Systems: Review and Recent Results.","220833990":"A Note About the Traceability Properties of Linear Codes","224332463":"Flexible-Pay-Per-Channel: A New Model for Content Access Control in Pay-TV Broadcasting Systems","220334291":"Reducing Trust in the PKG in Identity Based Cryptosystems","220779228":"Lower Bounds for Collusion-Secure Fingerprinting","4044233":"Copyright protection based on transaction watermarks","220905183":"Characteristics of Some Binary Codes for Fingerprinting","29621302":"Tracing Malicious Proxies in Proxy Re-Encryption","251852021":"A Scalable Trace and Revoke Scheme with Security Enhancements","221591757":"Digital Signets: Self-Enforcing Protection of Digital Information (Preliminary Version).","251191552":"Collusion Resistance of Digital Fingerprinting Schemes","225138835":"Pirate decoder for the broadcast encryption schemes from Crypto 2005","224218279":"Security and Robustness Constraints for Spread-Spectrum Tardos Fingerprinting","220680412":"Applications of list decoding to tracing traitors.","221354698":"Collusion Resistant Broadcast Encryption with Short Ciphertexts and Private Keys","224320165":"Broadcast Control Channel Jamming: Resilience and Identification of Traitors","2406874":"the requirements for the degree of Doctor of Philosophy (Computer Sciences) at the","226755706":"Agent based Video Contents Identification and Data Mining Using Watermark based Filtering"},"index":306}