{"abs":"The main challenges that arise when adopting Gaussian process priors in probabilistic modeling are how to carry out exact Bayesian inference and how to account for uncertainty on model parameters when making model-based predictions on out-of-sample data. Using probit regression as an illustrative working example, this paper presents a general and effective methodology based on the pseudo-marginal approach to Markov chain Monte Carlo that efficiently addresses both of these issues. The results presented in this paper show improvements over existing sampling methods to simulate from the posterior distribution over the parameters defining the covariance function of the Gaussian Process prior. This is particularly important as it offers a powerful tool to carry out full Bayesian inference of Gaussian Process based hierarchic statistical models in general. The results also demonstrate that Monte Carlo based integration of all model parameters is actually feasible in this class of models providing a superior quantification of uncertainty in predictions. Extensive comparisons with respect to state-of-the-art probabilistic classifiers confirm this assertion.","title":"Pseudo-Marginal Bayesian Inference for Gaussian Processes","id":262954130,"url":"https://www.researchgate.net/publication/262954130_Pseudo-Marginal_Bayesian_Inference_for_Gaussian_Processes","names":["Maurizio Filippone","Mark Girolami","IEEE Transactions on Pattern Analysis and Machine Intelligence"],"references":{"243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","45921723":"Slice sampling covariance hyperparameters of latent Gaussian models","265369049":"Slice sampling. (With discussions and rejoinder)","7641981":"Sparse Bayesian learning for efficient visual tracking","3302847":"Variational Gaussian process classifiers. IEEE Trans Neural Netw","45893043":"Elliptical Slice Sampling.","4788953":"On Block Updating in Markov Random Field Models for Disease Mapping","38363224":"Inference From Iterative Simulation Using Multiple Sequences","271407033":"Getting It Right","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","272623654":"Libsvm","4772437":"Marginal likelihood estimation via power posteriors","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","228364221":"Skilling, J.: Nested sampling for general Bayesian computation. Bayesian Anal. 1(4), 833-860","221345940":"Healing the relevance vector machine through augmentation.","46773615":"Scene Classification Using a Hybrid Generative/Discriminative Approach","226662186":"Learning Interpretable SVMs for Biological Sequence Classification","227375782":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods","239065361":"Bayesian Methods for Backpropagation Networks","221997066":"The Nature of Satistical Learning Theory","1762088":"A General Framework for the Parametrization of Hierarchical Models","2306327":"Annealed Importance Sampling","41781320":"Healing the Relevance Vector Machine through Augmentation","4747007":"Getting It Right: Joint Distribution Tests of Posterior Simulators","222018937":"Hybrid Monte Carlo","234113968":"Probabilistic prediction of neurological disorders with a statistical\nassessment of neuroimaging data modalities","257618460":"A comparative evaluation of stochastic-based inference methods for Gaussian process models","215721756":"Lecture Notes in Computer Science","41781429":"Assessing Approximate Inference for Binary Gaussian Process Classification","229100911":"Markov Chain Monte Carlo in Pratice","220320873":"Gaussian Processes for Ordinal Regression.","41781559":"Gaussian Process for Machine Learning","259010234":"Bayesian Inference for Gaussian Process Classifiers with Annealing and Exact-Approximate MCMC","220343922":"Support Vector Network","234108836":"Expectation Propagation for Approximate Bayesian Inference","40498233":"Gaussian Processes for Classification: Mean-Field Algorithms","239756954":"To Center or Not to Center: That is Not the Question — An Ancillarity-Sufficiency Interweaving Strategy (ASIS) for Boosting MCMC Efficiency","200033852":"UCI Machine Learning Repository Irvine","46537493":"Approximate Bayesian Inference for Latent Gaussian Models by Using Integrated Nested Laplace Approximations","221662690":"INLA or MCMC? A Tutorial and Comparative Evaluation for Spatial\nPrediction in log-Gaussian Cox Processes","3192933":"Bayesian classification with Gaussian processes","41781800":"Approximations for Binary Gaussian Process Classification","228715647":"LIBSVM: A library for support vector machines","227701452":"Log Gaussian Cox Processes","289221213":"On block updating in Markov random field models for disease mapping","12429532":"A Discriminative Framework for Detecting Remote Protein Homologies","239666344":"Regression and Classification Using Gaussian Process Priors","221055308":"Cautious Classifiers.","7059848":"Learning Interpretable SVMs for Biological Sequence Classification","220320580":"Approximate Marginals in Latent Gaussian Models","2704064":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","224881814":"Tipping, M.E.: Sparse bayesian learning and the relevance vector machine. JMLR 1","220181996":"Scene Classification Using a Hybrid Generative/Discriminative Approach.","2795225":"Variational Gaussian Process Classifiers","224514581":"Sparse Bayesian Learning and Relevance Vector Machine","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","243763580":"The Nature Of Statistical Learning Theory"},"citedIn":{"271218362":"Enabling scalable stochastic gradient-based inference for Gaussian processes by employing the Unbiased LInear System SolvEr (ULISSE)","286227230":"Bayesian Inference for Gaussian Process Classifiers with Annealing and Pseudo-Marginal MCMC","282310289":"Unbiased Bayesian Inference for Population Markov Jump Processes via Random Truncations","277959058":"Gradient-free Hamiltonian Monte Carlo with Efficient Kernel Exponential Families","264899565":"Optimal Scaling for the Pseudo-Marginal Random Walk Metropolis: Insensitivity to the Noise Generating Mechanism","250613960":"Kernel Adaptive Metropolis-Hastings","260295272":"Fast matrix computations for functional additive models","261198282":"Predicting Continuous Conflict Perception with Bayesian Gaussian Processes","286227172":"Pseudo-Marginal Bayesian Multiple-Class Multiple-Kernel Learning for Neuroimaging Data","258247482":"Analysis of the Gibbs Sampler for Hierarchical Inverse Problems","280773011":"Adaptive Multiple Importance Sampling for Gaussian Processes"},"index":307}