{"abs":"Particle swarm optimization (PSO) algorithm is introduced in Kriging modeling process to overcome the limits of pattern search method’s single-point search scheme as well as its heavy dependence on the initial guess solution when obtaining the optimal correlation parameters. PSO-Kriging is proved to give better simulation by interpolating and extrapolating the unobserved points. In reliability analysis, cumulative formation of repeatedly using sampling points in previous iterations is introduced into PSO-Kriging and classic response surface method (RSM). Cumulative formation can take full advantage of available sampling information and avoid reciprocating oscillation in iterative process. One explicit nonlinear limit state function example demonstrated that cumulative scheme can make both PSO-Kriging and RSM much more effective, no matter Latin hypercube sampling (LHS) or iteratively interpolating sampling (IIS) approach is utilized. Cumulative PSO-Kriging seems to be even more stable and efficient. Two slope reliability analysis examples including a practical nuclear plant breakwater’s reliability analysis problem proved that the proposed cumulative PSO-Kriging is very suitable for the reliability analysis of real engineering structures.","title":"Cumulative PSO-Kriging model for slope reliability analysis","id":269777947,"url":"https://www.researchgate.net/publication/269777947_Cumulative_PSO-Kriging_model_for_slope_reliability_analysis","names":["Ping Yi","Kaitao Wei","Xianjing Kong","Zuo Zhu","Probabilistic Engineering Mechanics"],"references":{"245293789":"Search Algorithm for Minimum Reliability Index of Earth Slopes","245293946":"Closure to “Factors of Safety and Reliability in Geotechnical Engineering” by J. M. Duncan","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","273751126":"Search Algorithm for Minimum Reliability Index of Earth Slopes","245893283":"Designs for Computer Experiments","246160032":"Factors of safety and reliability in geotechnical engineering. J Geotech Geoenviron Eng ASCE","271292103":"Non-Gradient–Based Algorithm for Structural Reliability Analysis","222165872":"Reliability analysis—A review and some perspectives","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","2752581":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","273800355":"Probability Integration by Directional Simulation","251516555":"A Kriging-based hybrid optimization algorithm for slope reliability analysis","280008102":"The construction and optimization of Kriging metamodel based on genetic algorithms","261291205":"Assessment of the Efficiency of Kriging Surrogate Models for Structural Reliability Analysis","245294279":"Probabilistic Stability Analyses of Embankments Based on Finite-Element Method","222809246":"A response surface method based on weighted regression for structural reliability analysis","220132932":"A review of particle swarm optimization. Part I: background and development. Natural Computing: An International Journal","229328945":"Cumulative formation of response surface and its use in reliability analysis","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","223906278":"Application of Kriging method to structural reliability"},"citedIn":{"273181342":"Simplified approach for locating the critical probabilistic slip surface in limit equilibrium analysis","282459967":"Response surface methods for slope reliability analysis: Review and comparison"},"index":310}