{"abs":"The load-carrying system of each construction should fulfill several conditions which represent reliable criteria in the assessment procedure. It is the theory of structural reliability which determines probability of keeping required properties of constructions. Using this theory, it is possible to apply probabilistic computations based on the probability theory and mathematic statistics. Development of those methods has become more and more popular; it is used, in particular, in designs of load-carrying structures with the required level or reliability when at least some input variables in the design are random. The objective of this paper is to indicate the current scope which might be covered by the new method-Direct Optimized Probabilistic Calculation (DOProC) in assessments of reliability of load-carrying structures. DOProC uses a purely numerical approach without any simulation techniques. This provides more accurate solutions to probabilistic tasks, and, in some cases, such approach results in considerably faster completion of computations. DOProC can be used to solve efficiently a number of probabilistic computations. A very good sphere of application for DOProC is the assessment of the bolt reinforcement in the underground and mining workings. For the purposes above, a special software application-\"Anchor\"-has been developed.","title":"The Use of the Direct Optimized Probabilistic Calculation Method in Design of Bolt Reinforcement for Underground and Mining Workings","id":255736695,"url":"https://www.researchgate.net/publication/255736695_The_Use_of_the_Direct_Optimized_Probabilistic_Calculation_Method_in_Design_of_Bolt_Reinforcement_for_Underground_and_Mining_Workings","names":["Martin Krejsa","Petr Janas","Isik Yilmaz","Marian Marschalko","Tomas Bouchal","The Scientific World Journal"],"references":{"228745154":"Assessment of Flooding Risk to Cultural Heritage in Historic Sites","232382463":"Seismic analysis of reinforced concrete frame-wall systems considering ductility effects in accordance to Eurocode","245210900":"Proban - Probabilistic analysis","233322467":"Structural reliability theory in the context of structural safety","259526933":"Using the Direct Determined Fully Probabilistic Method (DDFPM) for determination of failure","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","233157098":"Structural assessment and reliability analysis for existing engineering structures, theoretical background","222543308":"Probabilistic engineering analysis using the NESSUS software","273800355":"Probability Integration by Directional Simulation","245562838":"Performance Evaluation of Concrete Bridge Deck Affected by Chloride Ingress: Simulation-Based Reliability Assessment and Finite Element Modeling","266078792":"Seismic analysis of reinforced concrete frame-wall systems considering ductility effects in accordance to Eurocode","225408600":"ATENA — A tool for engineering analysis of fracture in concrete","245097154":"Sensitivity analysis of the stability problems of thin-walled structures","264154407":"Performance-based design of concrete structures: durability aspects","283613181":"Performance-based design of concrete structures: Durability aspects","2425017":"A Genetic Algorithm Tutorial","245284547":"A Response Surface Approach for Reliability Analysis","256733107":"Non-linear closed-form computational model of cable trusses","222206944":"Response surface augmented moment method for efficient reliability analysis","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{"287064317":"Software application of the DOProC method","269113608":"Advanced Numerical Method used in Computer Fluid Dynamics Modellings of Loading on Buildings","287373763":"DOProC-Based Reliability Assessment of Steel Structures Exposed to Fatigue","290210191":"Application of the DOProC Method in Solving Reliability Problems","259507523":"ProbCalc - účinný nástroj pro pravděpodobnostní výpočty","272049729":"ProbCalc - An Efficient Tool for Probabilistic Calculations","259526511":"Measured Data Processing in Civil Structure Using the DOProC Method","260341788":"Validating a Computational Model of a Rooflight Steel Structure by Means of a Load Test","271715880":"Surface Condensation Assessment Using Probabilistic Calculation","272007117":"Foundation Slab in Interaction with Subsoil","286401545":"Probabilistic Computational Methods in Structural Failure Analysis","259506473":"Application of the Direct Optimised Probabilistic Calculation Method"},"index":317}