{"abs":"Tree models are valuable tools for predictive modeling and data mining. Traditional tree-growing methodologies such as CART are known to suffer from problems including greediness, instability, and bias in split rule selection. Alternative tree methods, including Bayesian CART (Chipman et al., 1998; Denison et al., 1998), random forests (Breiman, 2001a), bootstrap bumping (Tibshirani and Knight, 1999), QUEST (Loh and Shih, 1997), and CRUISE (Kim and Loh, 2001), have been proposed to resolve these issues from various aspects, but each has its own drawbacks.Gray and Fan (2003) described a genetic algorithm approach to constructing decision trees called tree analysis with randomly generated and evolved trees (TARGET) that performs a better search of the tree model space and largely resolves the problems with current tree modeling techniques. Utilizing the Bayesian information criterion (BIC), Fan and Gray (2005) developed a version of TARGET for regression tree analysis. In this article, we consider the construction of classification trees using TARGET. We modify the BIC to handle a categorical response variable, but we also adjust its penalty component to better account for the model complexity of TARGET. We also incorporate the option of splitting rules based on linear combinations of two or three variables in TARGET, which greatly improves the prediction accuracy of TARGET trees. Comparisons of TARGET to existing methods, using simulated and real data sets, indicate that TARGET has advantages over these other approaches.","title":"Classification tree analysis using TARGET","id":222427290,"url":"https://www.researchgate.net/publication/222427290_Classification_tree_analysis_using_TARGET","names":["J. Brian Gray","Guangzhe Fan","Computational Statistics \u0026 Data Analysis"],"references":{"38326856":"Statistical Modeling: The Two Cultures (with comments and a rejoinder by the author)","2393893":"Split Selection Methods for Classification Trees","4744128":"Classification Trees With Unbiased Multiway Splits","222221363":"Genetic algorithms and their statistical applications: an introduction","38348679":"Heuristics of Instability and Stabilization in Model Selection.” The Annals of Statistics, 24(6), 2350-2383","235665541":"An Introduction to Recursive Partitioning Using the RPART Routine Technical Report 61","226270700":"Bagging Predictors","2806398":"Boosting a Weak Learning Algorithm By Majority","38358303":"‘Estimating the Dimension of A Model,’","247866270":"The elements of statistical learning: data mining, inference, and prediciton","2450683":"Bayesian CART model search","225734295":"The Elements of Statistical Learning, Second Edition: Data Mining, Inference, and Prediction","236952762":"Random Forests","2838414":"Classification Trees With Bivariate Linear Discriminant Node Models","271690135":"An Exploratory Technique for Investigating Large Quantities of Categorical Data, Applied Statistics, 29(2), 119-127","216301134":"Problems in the Analysis of Survey Data and a Proposal","239060114":"Cancer diagnosis via linear programmin","243103055":"Regression tree analysis using TARGET","242356870":"Adaptation In Natural And Artificial Systems","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","222968242":"Genetic algorithms for the identification of additive and innovation outliers in time series","238680641":"A Genetic Algorithm for Best Subset Selection in Linear Regression","245413145":"Comment on “Hot, wet, cold or toxic? Revisiting the ecological significance of leaf cuticular micromorphology” by M. Haworth and J. McElwain","220045412":"Adoption in Natural and Artificial System","2646163":"Model Search and Inference By Bootstrap \"bumping\"","229703310":"Classification and Regression Trees","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"223217998":"Enhancing the classification accuracy by scatter-search-based ensemble approach","272825856":"KEEL Data-Mining Software Tool: Data Set Repository, Integration of Algorithms and Experimental Analysis Framework","49805426":"Extracellular Trypanosoma cruzi calreticulin in the host–parasite interplay","241756333":"Parallel hierarchical sampling: A general-purpose interacting Markov chains Monte Carlo algorithm","222283704":"Mining data with random forests: A survey and results of new tests","224243034":"A Survey of Evolutionary Algorithms for Decision-Tree Induction","234784438":"Evolutionary model tree induction","220547629":"KEEL Data-Mining Software Tool: Data Set Repository, Integration of Algorithms and Experimental Analysis Framework.","220176597":"Parameter determination and feature selection for C4.5 algorithm using scatter search approach","265397146":"Inductive Learning for Continuous Classes and the Effect of RULES Family","227266311":"Segmentation applied to weather-disease relationships in South American leaf blight of the rubber tree","265397148":"Continuous Features in Inductive Learning and the Effect of RULES Family","259702388":"A new clustering-based approach for modeling fuzzy rule-based classification systems","222156210":"Evolutionary model trees for handling continuous classes in machine learning","231833054":"Increasing the value of bird-habitat studies in tropical forests: Choice of approach and habitat measures","220998845":"Evolutionary model tree induction.","260232147":"A novel approach for designing adaptive fuzzy classifiers based on the combination of an artificial immune network and a memetic algorithm","251938583":"A high diversity hybrid ensemble of classifiers","43181505":"Forest classification trees and forest support vector machines algorithms: Demonstration using microarray data","222251820":"A comparison of different rule-based statistical models for modeling geogenic groundwater contamination","266320523":"Kernel multilogit algorithm for multiclass classification","233763067":"Comparison of automated classification techniques for predicting benthic biological communities using hydroacoustics and video observations","269309851":"Fuzzy rule weights optimization based on Imperialist Competitive Algorithm","228876733":"Detection of rare items with TARGET","274232706":"An Improved Random Forest Algorithm for Class-Imbalanced Data Classification and its Application in PAD Risk Factors Analysis","235994701":"Combining angular response classification and backscatter imagery segmentation for benthic biological habitat mapping","281999121":"A Data Mining Software Package Including Data Preparation and Reduction: KEEL","263671703":"Fifty Years of Classification and Regression Trees","224148093":"Genetics-Based Machine Learning for Rule Induction: State of the Art, Taxonomy, and Comparative Study","220392195":"Mining sustainability indicators to classify hydrocarbon development","259515539":"Loss Given Default for Leasing: Parametric and Nonparametric Estimations","235949369":"Evaluation of Four Supervised Learning Methods for Benthic Habitat Mapping Using Backscatter from Multi-Beam Sonar","263457177":"Soft Classification Trees","256721212":"Application of hybrid case-based reasoning for enhanced performance in bankruptcy prediction","282631404":"A hybrid data mining model of feature selection algorithms and ensemble learning classifiers for credit scoring","228966288":"Enhancing Ensemble Performance through Feature Selection and Hybridization","269272441":"Using decision tree classification to assist in the prediction of Alzheimer\u0027s disease","239807856":"evtree: Evolutionary Learning of Globally Optimal Classification and Regression Trees in R","232614560":"Application of wavelets to acoustic resonance-elastic targets surrounded by biologics","282623333":"Identification of the parameters of fuzzy approximators and classifiers based on the cuckoo search algorithm","273400244":"Sample re-weighting hyper box classifier for multi-class data classification"},"index":319}