{"abs":"Computer experiments are often performed to allow modeling of a response surface of a physical experiment that can be too costly or difficult to run except using a simulator. Running the experiment over a dense grid can be prohibitively expensive, yet running over a sparse design chosen in advance can result in obtaining insufficient information in parts of the space, particularly when the surface calls for a nonstationary model. We propose an approach that automatically explores the space while simultaneously fitting the response surface, using predictive uncertainty to guide subsequent experimental runs. The newly developed Bayesian treed Gaussian process is used as the surrogate model, and a fully Bayesian approach allows explicit measures of uncertainty. We develop an adaptive sequential design framework to cope with an asynchronous, random, agent--based supercomputing environment, by using a hybrid approach that melds optimal strategies from the statistics literature with flexible strategies from the active learning literature. The merits of this approach are borne out in several examples, including the motivating computational fluid dynamics simulation of a rocket booster. Comment: 42 pages, 8 Figures, 2 tables, to appear in Technometrics","title":"Adaptive Design and Analysis of Supercomputer Experiments","id":1733357,"url":"https://www.researchgate.net/publication/1733357_Adaptive_Design_and_Analysis_of_Supercomputer_Experiments","names":["Robert B. Gramacy","Herbert K. H. Lee","Technometrics"],"references":{"5142988":"tgp: An R Package for Bayesian Nonstationary, Semiparametric Nonlinear Regression and Design by Treed Gaussian Process Models","227925526":"Bayesian estimation of semi-parametric non-stationary spatial covariance structure","2609572":"Monte Carlo Implementation of Gaussian Process Models for Bayesian Regression and Classification","4772045":"Bayesian Calibration of Computer Models","2329902":"Space and Space-Time Modeling Using Process Convolutions","2365866":"Bayesian Inference for Nonstationary Spatial Covariance Structure via Spatial Deformations","34954629":"Bayesian Treed Gaussian Process Models","221619109":"Training Connectionist Networks with Queries and Selective Sampling.","222504913":"Neural Network Exploration Using Optimal Experiment Design","225513703":"Sequential kriging optimization using multiple-fidelity evaluations","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","241063113":"A Bayesian coregionalization approach to multivariate pollutant data","23884791":"Automated CFD Parameter Studies on Distributed Parallel Computers","2455557":"Information--Based Objective Functions for Active Data Selection","223035626":"Consructing and fitting models for cokriging and multivariable spatial prediction","2952332":"Parameter space exploration with Gaussian process trees","216301381":"The Design and Analysis Computer Experiments","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","228864523":"Integrated Analysis of Computer and Physical Experiments","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","216301661":"Screening, Predicting, and Computer Experiments","220907156":"Gaussian Processes for Active Data Mining of Spatial Aggregates.","41896000":"Bayesian Wombling: Curvilinear Gradient Assessment Under Spatial Process Models.","246781322":"Matrix Methods for Engineers and Scientists","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","2927976":"Nonstationary Gaussian Processes For Regression And Spatial Modelling","4771982":"Maximum Entropy Sampling and Optimal Bayesian Experimental Design","233373487":"Maximum Entropy Sampling","4760591":"Van Beers, W.C.M.: Application-driven sequential designs for simulation experiments: Kriging metamodeling. J. Oper. Res. Soc. 55(9), 876-883","2852195":"A New Class of Nonstationary Spatial Models","230872587":"Experimental Design and Observation for Large Systems","234102591":"An Algorithm for the Construction of “D-Optimal” Experimental Designs","4747012":"Optimal Bayesian Design by Inhomogeneous Markov Chain Simulation","4818693":"Gaussian processes and limiting linear models","246930297":"Neural network exploration using optimal experiment","228007110":"Maximum Entropy Sampling","2944241":"Gaussian Processes for Active Data Mining of Spatial Aggregates","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","2450683":"Bayesian CART model search","38363031":"Bayesian Experimental Design: A Review","243637348":"Nonparametric Estimation of Nonstationary Spatial Covariance Structure","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","220344008":"Queries and Concept Learning","31303344":"Predicting the Output from a Complex Computer Code When Fast Approximations Are Available","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","2817500":"Non-Stationary Spatial Modeling","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","243655672":"A Bayesian CART algorithm","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","4772151":"Bayesian inference for non-stationary spatial covariance structure via spatial deformations"},"citedIn":{"49708407":"Liquorice and glycyrrhetinic acid increase DHEA and deoxycorticosterone levels by inhibiting adrenal SULT2A1 activity","261045006":"Inadequacies of Traditional Exploration Methods in Systems-of-Systems Simulations","5142988":"tgp: An R Package for Bayesian Nonstationary, Semiparametric Nonlinear Regression and Design by Treed Gaussian Process Models","260317958":"The mesh adaptive direct search algorithm with treed Gaussian process surrogates","258905835":"ASK: Adaptive Sampling Kit for Performance Characterization","281776076":"Beyond Corroboration: Strengthening Model Validation by Looking for Unexpected Patterns","235932824":"Dynamic sensitivity analysis of long-running landslide models through basis set expansion and meta-modelling","45849138":"Classification and Categorical Inputs with Treed Gaussian Process Models","257924310":"ASRSM: A Sequential Experimental Design for Response Surface Optimization","236985261":"Can Small Islands Protect Nearby Coasts From Tsunamis? An Active Experimental Design Approach","233450235":"Advances in the Sequential Design of Computer Experiments Based on Active Learning","45416610":"Dealing with asynchronicity in parallel Gaussian Process based global optimization","265252310":"Speeding up neighborhood search in local Gaussian process prediction","256744276":"Multi-output local Gaussian process regression: Applications to uncertainty quantification","233004793":"Sequential measurement strategy for wafer geometric profile estimation","234061935":"Comparing sampling strategies for aerodynamic Kriging surrogate models","228404797":"Process modelling for quality improvement in annealing process","235765935":"Local Gaussian Process Approximation for Large Computer Experiments","261430583":"Active-learning-based surrogate models for empirical performance tuning","257550842":"Reduced order models for many-query subsurface flow applications","51948989":"Requirements for a New Detector at the South Pole Receiving an\nAccelerator Neutrino Beam","266658625":"Improving parallel I/O autotuning with performance modeling","259163220":"Bayesian optimal sequential design for nonparametric regression via inhomogeneous evolutionary MCMC","262583040":"Bayesian Treed Multivariate Gaussian Process With Adaptive Design: Application to a Carbon Capture Unit","45888917":"Dynamic Trees for Learning and Design","271511557":"Computer emulation with non-stationary Gaussian processes","270597515":"A Weighted Sequential Sampling Method Considering Influences of Sample Qualities in Input and Output Parameter Spaces for Global Optimization","45919505":"The Role of the Nugget Term in the Gaussian Process Method","228443315":"Multi-Fidelity Aerodynamic Optimization Using Treed Meta-Models","273093737":"Wind power curve modeling in complex terrain using statistical models","220198576":"Trellis display for modeling data from designed experiments","224441173":"Uncertainty Analysis for a Large-Scale Transient Simulation of a Notional All-Electric Ship Pulse Load Charging Scenario","245529108":"Adaptive sequential experiment methodology for response surface optimisation","281946744":"Quantifying and reducing uncertainties on excursion sets under a gaussian random field prior","257930087":"An Efficient Adaptive Sequential Methodology for Expensive Response Surface Optimization","45931398":"Cases for the Nugget in modelling computer experiments","260560317":"Reduced order modeling in iTOUGH2","44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","277977174":"Sequential Design of Computer Experiments for the Assessment of Fetus Exposure to Electromagnetic Fields","262412405":"Model guided adaptive design and Analysis in computer experiment","273193753":"Large-scale Impact of CO2 Storage Operations: Dealing with Computationally Intensive Simulations for Global Sensitivity Analysis","270905718":"Quantifying uncertainties on excursion sets under a Gaussian random field prior","266376755":"Sequential Design with Mutual Information for Computer Experiments (MICE): Emulation of a Tsunami Model","220384497":"Kriging metamodel with modified nugget-effect: The heteroscedastic variance case","282514304":"Low-cost multi-dimensional Gaussian process with application to uncertainty quantification","271511799":"Computer emulation with non-stationary Gaussian processes","221526125":"A Novel Sequential Design Strategy for Global Surrogate Modeling.","268452958":"Sequential design for achieving estimated accuracy of global sensitivities","258082179":"Massively Parallel Approximate Gaussian Process Regression","242094091":"Designing and analyzing a circuit device experiment using treed Gaussian processes","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","258905605":"Adaptive Sampling for Performance Characterization of Application Kernels","273404448":"Variable selection via a multi-stage strategy","216075149":"Design of computer experiments: Space filling and beyond","220411853":"A Novel Hybrid Sequential Design Strategy for Global Surrogate Modeling of Computer Experiments","46586550":"Gaussian Process Single-Index Models as Emulators for Computer Experiments","258926749":"Response Surface Methods for Efficient Aerodynamic Surrogate Models","266562708":"On the Bayesian treed multivariate Gaussian process with linear model of coregionalization","220164327":"Global sensitivity analysis of large-scale numerical landslide models based on Gaussian-Process meta-modeling","281928503":"Commentary: Simulation-aided inference in cosmology","282127274":"New computational methods in tsunami science","227342321":"Efficient Response Surface Methods Based on Generic Surrogate Models","262938961":"Bayesian treed response surface models","241707670":"Optimisation of interacting particle systems for rare event estimation"},"index":321}