{"abs":"The aim of an experiment is often to enable discrimination between competing forms for a response model. We investigate the selection of a continuous design for a non-sequential strategy when there are two competing generalized linear models for a binomial response, with a common link function and the linear predictor of one model nested within that of the other. A new criterion, TE-optimality, is defined, based on the difference in the deviances from the two models, and comparisons are made with T-, Ds- and D-optimality. Issues are raised through the study of two examples in which designs are assessed using simulation studies of the power to reject the null hypothesis of the smaller model being correct, when the data are generated from the larger model. Parameter estimation for discrimination designs is also discussed and a simple method is investigated of combining designs to form a hybrid design in order to achieve both model discrimination and estimation. This method has a computational advantage over the use of a compound criterion and the similar performance of the designs obtained from the two approaches is illustrated in an example.","title":"Design selection criteria for discrimination/estimation for nested models and a binomial response","id":229350788,"url":"https://www.researchgate.net/publication/229350788_Design_selection_criteria_for_discriminationestimation_for_nested_models_and_a_binomial_response","names":["Timothy Waterhouse","David Christopher Woods","J. A. Eccleston","S.M. Lewis","Journal of Statistical Planning and Inference"],"references":{"228728226":"Criterion-robust optimal designs for model discrimination and parameter estimation: Multivariate polynomial regression case","230873158":"Discrimination Between Two Binary Data Models: Sequentially Designed Experiments","37434492":"Statistical Models","227688856":"Parameter Neutral Optimum Design for Non‐linear Models","223126400":"DT-optimum designs for model discrimination and parameter estimation","51992084":"Numerical Methods for Unconstrained Optimization and Nonlinear Equations. SIAM, Philadelphia","230873103":"Experimental Design in a Class of Models","227662175":"T‐optimum designs for discrimination between two multiresponse dynamic models","243083052":"Amendments and Corrections: Bias Reduction of Maximum Likelihood Estimates","31186056":"Bias Reduction of Maximum Likelihood Estimates","264933916":"Categorical Data Analysis 2nd Edn","259482208":"Model-Oriented Design of Experiments","260406237":"Nonparametric Regression and Spline Smoothing, Second Edition","265681805":"Categorical Data Analysis","265374730":"The Design of Experiments to Discriminate Between Two Rival Generalized Linear Models","265894908":"Nonparametric Regression and Spline Smoothing","225986654":"Optimal Design for Models Incorporating the Richards Function","202880304":"Random Number Generation and Monte Carlo Methods","31102899":"Optimum Experimental Design for Discriminating Between Two Rival Models in the Presence of Prior Information","46247848":"Optimal Design of an Experiment in Economics","4808992":"Optimal Design of an Experiment in Economics","247624815":"Spline Smoothing and Nonparametric Regression. Marcel Dekker, New York, NY","230872562":"Optimal Design: Experiments for Discriminating Between Several Models","230872560":"Planning experiments for discriminating between models","230872561":"The Design of Experiments for Discriminating Between Two Rival Models","228693908":"Designing experiments under random contamination with application to polynomial spline regression","246844928":"Model-oreinted design of experiments","5285799":"Categorical data analysis","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","43453487":"Designs for Generalized Linear Models With Several Variables and Model Uncertainty","263072663":"Generalized Linear Model","216301469":"Introduction to Stochastic Search and Optimization","278948057":"Bias Reduction of Maximum Likelihood Estimates","5207283":"A comparison of sequential and non-sequential designs for discrimination between nested regression models","24003923":"Optimal Design Criteria for Discrimination and Estimation in Nonlinear Models","264913332":"Introduction to Stochastic Search and Optimization Estimation, Simulation and Control","262873557":"A nonsequential design procedure for parameter estimation and model discrimination in nonlinear regression models"},"citedIn":{"220097711":"Inference procedures for stable-Paretian stochastic volatility models","254358673":"M-Procedures for Detection of Changes for Dependent Observations","233022554":"Continuous Optimal Designs for Generalized Linear Models under Model Uncertainty","4729107":"Optimal designs for both model discrimination and parameter estimation","45867264":"Optimal discrimination designs","256703152":"Robust T-optimal discriminating designs","223126400":"DT-optimum designs for model discrimination and parameter estimation","220056225":"Bayesian optimum designs for discriminating between models with any distribution"},"index":327}