{"abs":"Asymmetrical designs are now widely used in the industrial world. However, the traditional methods to construct them are very poor and difficult to handle. To construct experimental design in ‘non-standard’ occurrences, algorithmic methods, such as Fedorov\u0027s or Mitchell\u0027s algorithms, are broadly used. But in case of high dimensionality, this class of algorithms cannot be used. In this paper, a new technique based on the genetic algorithm for constructing experimental designs is described.","title":"Genetic algorithm as a tool for selection of D-optimal design","id":245152663,"url":"https://www.researchgate.net/publication/245152663_Genetic_algorithm_as_a_tool_for_selection_of_D-optimal_design","names":["Anne Broudiscou","Riccardo Leardi","Roger Phan-Tan-Luu","Chemometrics and Intelligent Laboratory Systems"],"references":{"6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","216300596":"Theory of Optimal Experiments Designs","201976155":"Genetic Algorithms and Simulated Annealing: An Overview","223348772":"Genetic algorithm in chemistry","30873058":"Genetic + Data Structures \u003d Evolution Programs","229494955":"Genetic Algorithms as a Strategy for Feature Selection","222125610":"Understanding and using genetic algorithms part 1. Concepts, properties and context. Chemom Intell Lab Syst","220569004":"Genetic Local Search in Combinatorial Optimization.","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"255711932":"Genetic algorithms in chemometrics","7609110":"Study of formulation variables influencing the drug release rate from matrix tablet by experimental design","271947184":"Genetic Algorithms in Analytical Chemistry","262468140":"Genetic algorithm in Chemistry","7933904":"Tackling Calibration Problems of Spectroscopic Analysis in High-Throughput Experimentation","222402248":"Multi-period steam turbine network optimisation. Part I: Simulation based regression models and an evolutionary algorithm for finding D-optimal designs","265908976":"Application of genetic algorithms for pixel selection in multivariate image analysis for a QSAR study of trypanocidal activity for quinone compounds and design new Quinone compounds","272925679":"A New Concept Evaluating Welding Deformation and Residual Stresses by Image Processing for Structural Design \u0026 Maintenance (2nd Report, Development of Image Processing Algorithm)","270764239":"Amidated pectin-based wafers for econazole buccal delivery: Formulation optimization and antimicrobial efficacy estimation","245154001":"Evolutionary experiments for self-assembling amphiphilic systems","23435530":"Optimising mobile phase composition, its flow-rate and column temperature in HPLC using taboo search","249982647":"Evolving the experimental design for self-assembling amphiphilic systems","229344762":"Extraction of Representative Subsets by Potential Functions Method and Genetic Algorithms","5286018":"Optimization of Formulation Variables of Benzocaine Liposomes using Experimental Design","227756615":"Genetic Algorithms in Chemometrics and Chemistry: A Review","225547492":"Evolutionary Computing in Statistical Data Analysis","260307222":"Using Genetic Algorithms to Design Experiments: A Review","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","225458153":"D-optimality of non-regular design spaces by using a Bayesian modification and a hybrid method","266646590":"D-Optimal Design Applied to Calibration of Strapdown Three-axis Magnetometer","27516318":"A Systematic Procedure for Analysis and Design of Energy Systems","284712102":"A Genetic Algorithm for Selection of Fixed-Size Subsets with Application to Design Problems"},"index":332}