{"abs":"We apply the splitting method to three well-known counting problems, namely 3-SAT, random graphs with prescribed degrees, and binary contingency tables. We present an enhanced version of the splitting method based on the capture-recapture technique, and show by experiments the superiority of this technique for SAT problems in terms of variance of the associated estimators, and speed of the algorithms.","title":"Counting with Combined Splitting and Capture-Recapture Methods","id":50908649,"url":"https://www.researchgate.net/publication/50908649_Counting_with_Combined_Splitting_and_Capture-Recapture_Methods","names":["Paul Dupuis","Bahar Kaynar","Ad Ridder","Reuven Rubinstein","Radislav Vaisman","Stochastic Models"],"references":{"227992404":"Rare Event Simulation and Counting Problems","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","239902752":"Model Counting","38413158":"A Sequential Importance Sampling Algorithm for Generating Random Graphs with Prescribed Degrees","236628854":"Computational Complexity","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","221606680":"Approximate Counting by Sampling the Backtrack-free Search Space.","4741702":"Sequential Monte Carlo Methods for Statistical Analysis of Table","220944484":"A New Approach to Model Counting","271899621":"The Effects of Trap Response on Tag Recapture Estimates","41035459":"The splitting method in rare event simulation","38363224":"Inference From Iterative Simulation Using Multiple Sequences","222808307":"The Complexity of Computing the Permanent","225130001":"Randomized Algorithms with Splitting: Why the Classic Randomized Algorithms Do Not Work and How to Make them Work","221525992":"On the Efficiency of the Splitting and Roulette Approach for Sensitivity Analysis.","243104929":"A Two-Step branching splitting model under cost constraint for rare event analysis","220136450":"Rare events, splitting, and quasi-Monte Carlo","220286431":"Efficient Monte Carlo simulation via the generalized splitting method"},"citedIn":{},"index":337}