{"abs":"Genetic algorithms (GA) are stochastic optimization tools that work on “Darwinian” models of population biology and are capable of solving for near-optimal solution for multivariable functions without the usual mathematical requirements of strict continuity, differentiability, convexity and other properties. The algorithm begins by choosing a large number of candidate solutions which propagate themselves through a “selection criteria” and are changed by the application of well-developed genetic operators. GAs are applied to problems in statistical estimation and the results are compared to the output of standard software. It is argued that many statistical and mathematical restrictions that usually restrict modeling and analysis can be dispensed with by employing the GA as an optimization technique. The use of GAs for solving discrete optimization problems with applications in statistics for the variable selection problem in regression and other multivariate statistical methods are also discussed.","title":"Genetic algorithms and their statistical applications: an introduction","id":222221363,"url":"https://www.researchgate.net/publication/222221363_Genetic_algorithms_and_their_statistical_applications_an_introduction","names":["Sangit Chatterjee","Matthew Laudato","Lucy A. Lynch","Computational Statistics \u0026 Data Analysis"],"references":{"38363114":"Titterington, D.M.: Neural Networks: A Review from a Statistical Perspective. Statistical Science 9(1), 2-54","223326856":"Genetic algorithms and traveling salesman problems","237005513":"The Quark and the Jaguar: Adventures in the Simple and the Complex","242642207":"Fitting Equations To Data","31593416":"Genetic Algorithms for Timetabling and Traveling Salesman Problems","269859614":"Linear Statistical Models and Related Methods","268547181":"Genetic algorithms in statistics: Procedures and applications","14853740":"Forrest, S. Genetic algorithms: principles of natural selection applied to computation. Science","239341782":"A Robust Method for Multiple Linear Regression","242356870":"Adaptation In Natural And Artificial Systems","240310918":"Classification and Regression Trees (CART)","201976029":"The Performance of Genetic Algorithms on Walsh Polynomials: Some Anomalous Results and Their Explanation","229091441":"Genetic Programming","265166265":"Applied Logistic Regressio","220045412":"Adoption in Natural and Artificial System","261659875":"Applied Logistic Regression","229703310":"Classification and Regression Trees","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"259124211":"Utilizing variant differentiation to mitigate manufacturing complexity in mixed-model assembly systems","26865946":"Variable selection method for quantitative trait analysis based on parallel genetic algorithm","272026289":"Prediction of Aromatase Inhibitory Activity using the Efficient Linear Method (ELM)","279572256":"A posterior predictive approach to multiple response surface optimization","235307148":"Automated tongue area detection for computer-aided diagnosis based on ASM and GA","221163554":"Application of Genetic Algorithms in a surface deformation measurement technique.","215505237":"Multi–regime models for nonlinear nonstationary time series","287541934":"LS-SVR method of ore grade estimation in Solwara 1 region with missing data","289043252":"Orthogonal least trimmed absolute deviation estimator for multiple linear errors-in-variables model","261040927":"Feed-forward neural network modeling and optimization using genetic algorithm: Enzymatic hydrolysis of xylose production","12720720":"Modeling of biological processes using self-cycling fermentation and genetic algorithms","228743985":"Feature selection and classification in the diagnosis of cervical cancer","232620105":"Evolutionary approaches for statistical modelling","5182299":"Genetic algorithms, pseudo-random number generators and Markov Chain Monte Carlo methods","252389279":"MCMC algorithm, integrated four-dimensional seismic reservoir characterization and uncertainty analysis in a Bayesian framework","225547492":"Evolutionary Computing in Statistical Data Analysis","24349669":"Estimating the kinetic parameters of activated sludge storage using weighted non-linear least-squares and accelerating genetic algorithm","261583757":"Variable Selection in Linear Regression With Many Predictors","241057088":"Multivariate Mixture Models Estimation: A Genetic Algorithm Approach","233032061":"Genetic algorithms in parameter estimation for nonlinear regression models: An experimental approach","228542143":"A multivariate regional test for detection of trends in extreme rainfall: The case of extreme daily rainfall in the French Mediterranean area","242447314":"An Evolutionary Algorithm With Applications to Statistics","229809552":"Subset ARMA Model Identification Using Genetic Algorithms","245391620":"Fault correction of an airflow signal in a gasoline engine system using a neural fuzzy scheme and genetic algorithm","242075208":"Accounting for Model Uncertainty via Trans-dimensional Genetic Algorithms","222256791":"Applications of optimization heuristics to estimation and modelling problems","243102677":"Generating Data with Identical Statistics but Dissimilar Graphics","263998741":"Design of Diffractive Optical Element for Improving Jitter Characteristics of Optical Pickup","222011409":"Clustering financial time series: An application to mutual funds style analysis","228970766":"Darwinian Evolution in Parallel Universes: A Parallel Genetic Algorithm for Variable Selection","2634246":"Detection of Malignancy Associated Changes in Cervical Cells Using Statistical and Evolutionary Computation Techniques","290134373":"Feature Extraction and Feature Selection: A Survey of Methods in Industrial Applications","291099126":"Genetic Algorithms and Clustering: an Application to Fisher’s Iris Data","272742005":"UrsuTurkman JTSA","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","4993787":"Break Detection for a Class of Nonlinear Time Series Models","228455077":"Genetic algorithms in partitional clustering: a comparison","4750193":"A new genetic algorithm in proteomics: Feature selection for SELDI-TOF data","4993397":"Forecasting composite indicators with anticipated information: An application to the industrial production index","221316367":"Decimal-Integer-Coded Genetic Algorithm for Trimmed Estimator of the Multiple Linear Errors in Variables Model","222932086":"Comparison of selection methods of explanatory variables in PLS regression with application to manufacturing process data","5182223":"Estimating threshold subset autoregressive moving-average models by genetic algorithms","260873166":"Using mixtures in seemingly unrelated linear regression models with non-normal errors","243042879":"An evolutionary algorithm for A-optimal incomplete block designs","220963944":"Standard Additive Fuzzy System for Stock Price Forecasting.","223859091":"Fitting Piecewise Linear Threshold Autoregressive Models by Means of Genetic Algorithms","254237666":"The viability of the genetic algorithm geodemographic modelling in the case of Korean DIF zoning","222664066":"Technological modelling for graphical models: An approach based on genetic algorithms","220175700":"Genetic algorithms for outlier detection and variable selection in linear regression models","243103153":"Multiresolution Genetic Algorithms and Markov chain Monte Carlo","2348909":"Genetic Algorithms For Outlier Identification Of Additive And Innovational Type In Time Series","241168784":"Intensifying the Performance of Nonlinearity Approximation by an Optimal Fuzzy System","239767962":"Periodic autoregressive model identification using genetic algorithms","257196165":"Bayesian variable selection in generalized linear models using a combination of stochastic optimization methods","265201437":"A Genetic Algorithm Approach to Optimize Planning of Food Fortification","33052203":"Semi-mechanistic modelling in nonlinear regression: A case study","251346728":"Evolving Regression Models","288932590":"Genetic Algorithm Based Microscale Vehicle Emissions Modelling","240939269":"STATISTICAL APPLICATIONS OF NEURAL NETWORKS","222427290":"Classification tree analysis using TARGET","269577933":"RandGA: injecting randomness into parallel genetic algorithm for variable selection","267062965":"Evolutionary statistical procedures. An evolutionary computation approach to statistical procedures designs and applications","2527865":"Multi-resolution Genetic Algorithms and Markov Chain Monte Carlo","227907786":"A new MCMC algorithm for seismic waveform inversion and corresponding uncertainty analysis","257428155":"GA: A Package for Genetic Algorithms in R","289699874":"Trimmed estimator of multiple linear errors in variables model based on decimal integer encoding genetic algorithm","227356772":"Time‐varying multi‐regime models fitting by genetic algorithms","226382869":"Genetic algorithms for building double threshold generalized autoregressive conditional heteroscedastic models of time series","223519679":"Selection of artificial neural network models for survival analysis with Genetic Algorithms","226266381":"A multi-objective optimization model of the partner selection problem in a virtual enterprise and its solution with genetic algorithms","223638176":"Genetic clustering of social networks using random walks","280288962":"A review of recent variable selection methods in industrial and chemometrics applications","222968242":"Genetic algorithms for the identification of additive and innovation outliers in time series","220182887":"Fitting Optimal Piecewise Linear Functions Using Genetic Algorithms.","257490593":"An analysis of global warming in the Alpine region based on nonlinear nonstationary time series models","250692107":"A new parameter identification method of soft biological tissue combining genetic algorithm with analytical optimization","228403297":"Regression model selection using genetic algorithms","52009830":"A hybrid analytical-heuristic method for calibrating land-use change models","227863787":"Data Mining and Knowledge Discovery in Databases - An Overview"},"index":339}