{"abs":"We present a new approach for tracking roads from satellite images, and thereby illustrate a general computational strategy (“active testing”) for tracking 1D structures and other recognition tasks in computer vision. Our approach is related to recent work in active vision on “where to look next” and motivated by the “divide-and-conquer” strategy of parlour games. We choose “tests” (matched filters for short road segments) one at a time in order to remove as much uncertainty as possible about the “true hypothesis” (road position) given the results of the previous tests. The tests are chosen online based on a statistical model for the joint distribution of tests and hypotheses. The problem of minimizing uncertainty (measured by entropy) is formulated in simple and explicit analytical terms. At each iteration new image data are examined and a new entropy minimization problem is solved (exactly), resulting in a new image location to inspect, and so forth. We report experiments using panchromatic SPOT satellite imagery with a ground resolution of ten meters","title":"An Active Testing Model for Tracking Roads in Satellite Images","id":3192490,"url":"https://www.researchgate.net/publication/3192490_An_Active_Testing_Model_for_Tracking_Roads_in_Satellite_Images","names":["Donald Geman","Bruno Jedynak","IEEE Transactions on Pattern Analysis and Machine Intelligence"],"references":{"225338470":"A method for the construction of minimum-redundancy codes","3191929":"Optimal partitioning for classification and regression trees. IEEE Trans. PAMI 13, 340-354","268762318":"On an Optimal Search Procedure","224377811":"Analysis and Design of a Decision Tree Based on Entropy Reduction and Its Application to Large Character Set Recognition","220660011":"Promising directions in active vision","228057818":"Combinatorial Optimiation: Networks and Matroids","3477627":"Line Detection in Satellite Imagery","220329711":"Criteria for Selecting a Variable in the Construction of Efficient Decision Trees","224377677":"Locating Structures in Aerial Images","243772944":"A Survey of Some Results in Stochastic Adaptive Control","23888693":"Three-dimensional object recognition using similar triangles and decision trees","216300670":"Multi-Armed Bandit Allocation Indices, 2nd Edition","226222944":"Induction of Decision Trees","238831527":"Optimal Binary Identification Procedures","268538714":"Correction to: The optimal strategy of a tree classifier","3521705":"Detection Of Roads In Satellite Images","215721349":"Computer and Robot Vision, Vol. 1","3471530":"A Method for the Construction of Minimum-Redundancy Codes","2425722":"Decision Trees For Geometric Models","3027121":"Pattern classification and scene analysis","247608673":"Special purpose automatic programming for 3D model-based vision","220111293":"Constructing Optimal Binary Decision Trees is NP-Complete","256590189":"An optimal search procedure","2395907":"Promising Directions in Active Vision","3083719":"Application of Information Theory to the Construction of Efficient Decision Trees","2249737":"A Curvature-Dependent Energy Function for Detecting Lines in Satellite Images","224377714":"Application of a Multilayer Decision Tree in Computer Recognition of Chinese Characters","220659734":"Control of selective perception using Bayes nets and decision theory","220197484":"Performance Bounds for Binary Testing with Arbitrary Weights.","2627739":"Shape Recognition and Twenty Questions","3692747":"Towards The Automatic Generation Of Recognition Strategies","222253513":"Detection of roads and linear structures in low-resolution aerial imagery using a multisource knowledge integration technique","222771263":"Pattern recognition as a quest for minimum entropy","3200522":"A Knowledge-Based System for Highway Network Extraction","222741051":"Automatic classification of cervical cells using a binary tree classifier","229703310":"Classification and Regression Trees","226704892":"Performance bounds on the splitting algorithm for binary testing"},"citedIn":{"242432630":"No Author Given No Institute Given Abstract. A","220599584":"A Polyline Process for Unsupervised Line Network Extraction in Remote Sensing","265289672":"Information and Decision Theoretic Approaches to Problems in Active Diagnosis","221112614":"Level Learning Set: A Novel Classifier Based on Active Contour Models","3919915":"All-integer Hough transform: performance evaluation","260191122":"Use of the neuronal net for road extraction from satellite images , Application in the city of Laghouat(Algeria)","4004910":"A level set method for the extraction of roads from multispectral imagery","2494514":"Scalable Information-Driven Sensor Querying and Routing for Ad Hoc Heterogeneous Sensor Networks","228728244":"Higher order active contours and their application to the detection of line networks in satellite imagery","2401340":"A Generative Model of Curve Images with a Completely-Characterized Non-Gaussian Joint Distribution","45886112":"Group-based Query Learning for rapid diagnosis in time-critical situations","228864442":"Robust and efficient road tracking in aerial images","250747602":"Computational Models for Object Detection and Recognition","225167691":"Continuous Lunches Are Free Plus the Design of Optimal Optimization Algorithms","2741249":"Context-Supported Road Extraction","4119572":"A Bayesian Network Framework for Real-Time Object Selection","259483485":"On Decentralized Estimation With Active Queries","279439499":"Adaptive sequential feature selection for pattern classification","255635216":"Detecção automática de estradas não pavimentadas em imagens de média resolução","221120768":"Dark Line Detection with Line Width Extraction","4119565":"Efficient Computation of Closed Contours using Modified Baum-Welch Updating","7640128":"A stochastic method for Bayesian estimation of hidden Markov random field models with application to a color model","45130374":"Recursive Partitioning and Tree-based Methods","267985871":"Semi-Automatic Extraction of Information from Satellite Images","260456378":"Detecting Curvilinear Structure using Ridge Distribution Feature and Layer Growth Method","220387680":"Semi-Automated Extraction of Rivers from Digital Imagery","237350502":"PÓS-PROCESSAMENTO USANDO TÉCNICAS DE SUAVIZAÇÃO DO CONTORNO PARA O MELHORAMENTO DE FEIÇÕES EXTRAÍDAS POR METODOLOGIAS DE ANÁLISE DE IMAGEM","261479377":"A Statistical Model for Recreational Trails in Aerial Images","283719852":"Asynchronous Decentralized 20 Questions for Adaptive Search","4138106":"GAP closure in (road) networks using higher-order active contours","4073595":"Line pattern segmentation using morphological probing","259617599":"Linear feature detection using multiresolution wavelet filters","251857736":"A Systematic Method for Illusory Contour","228569546":"Unsupervised localization of shapes using statistical models","224646452":"Vision-based path-planning in unstructured environments","220728689":"Bayesian A* Tree Search with Expected O(N) Convergence Rates for Road Tracking.","7528494":"Point processes for unsupervised line network extraction in remote sensing","222999830":"Localisation et détection de stents sur des images rayons-X bas contraste","228911609":"Parsing Images into Regions, Curves, and Curve Groups","7452716":"Relative focus map estimation using blind deconvolution","220373372":"Segmentation of Pipe Images for Crack Detection in Buried Sewers","4138079":"Novel aircraft type recognition with learning capabilities in satellite images","4239396":"Underwater acoustic image segmentation using neural deformable template","221361495":"Fundamental Bounds on Edge Detection: An Information Theoretic Evaluation of Different Edge Cues.","3834962":"Automated analysis and detection of cracks in underground scanned pipes","221619548":"Common-Frame Model for Object Recognition.","221259098":"Segmentation of Curvilinear Objects Using a~Watershed-Based Curve Adjacency Graph.","4374569":"Statistical Models for Skin Detection","265345980":"Global calibration and equation reconstruction methods of a three dimensional curve generated from a laser plane in vision measurement","252786558":"Linear feature detection of rural imagery using multiresolution filters","4241457":"Root Detection By Hierarchical Seed Expansion","242080287":"Linear Feature Extraction Based On Grouping Factors","221363522":"Order Parameters for Minimax Entropy Distributions: When Does High Level Knowledge Help?","26532323":"Fast Road Network Extraction in Satellite Images Using Mathematical Morphology and Markov Random Fields","281059515":"Automated Extraction of the Intestinal Parasite in the Microscopic Images Using Active Contours and the Hough Transform","228921819":"Extraction of Lakes from Satellite Imagery","6977769":"Pulmonary fissure segmentation on CT","2679980":"Road Detection in Panchromatic SPOT Satellite Images","220443045":"Reconfiguration methods for mobile sensor networks","3761330":"Communication networks recognition from SPOT images","222072241":"3D coordinates measurement based on structured light sensor","221619643":"Extensions of Generalized Binary Search to Group Identification and Exponential Costs.","220728743":"Bayesian Models for Finding and Grouping Junctions.","224342477":"Three-Dimensional LiDAR Data Classifying to Extract Road Point in Urban Area","228810032":"Road network extraction by hierarchical grouping","220728766":"On Solutions to Multivariate Maximum α-Entropy Problems","5608643":"Classification of underground pipe scanned images using feature extraction and neuro-fuzzy algorithm","221305254":"Volterra Filtering of Noisy Images of Curves","224744953":"Evolving roads in IKONOS multispectral imagery","220134846":"Efficient Deformable Template Detection and Localization without User Initialization","51724212":"Unified Detection and Tracking in Retinal Microsurgery","280590365":"Self-Similar Solutions of Rényi’s Entropy and the Concavity of Its Entropy Power","3766417":"Signfinder: Using color to detect, localise and identify informational signs","220387723":"Detecting Roads in Stabilized Video with the Spatio-Temporal Structure Tensor","45902358":"Query Learning with Exponential Query Costs","228652298":"Extraction of main and secondary roads in VHR images using a higher-order phase field model","233460032":"Object-oriented classification of multi-resolution images for the extraction of narrow linear forest disturbance","220728728":"Twenty Questions, Focus of Attention, and A*: A Theoretical Comparison of Optimization Strategies.","261422884":"Urban road information extraction from high resolution remotely sensed image based on semantic model","220728730":"Active Sampling Strategies for Multihypothesis Testing","254466974":"Optimization-based Method for Automated Road Network Extraction","267103018":"Stochastic Extraction of Elongated Curvilinear Structures With Applications","275074212":"An Efficient and Accurate Method for Real-Time Processing of Light Stripe Images","220146140":"Higher-Order Active Contour Energies for Gap Closure","223134088":"Combining Multiple Algorithms for Road Network Tracking from Multiple Source Remotely Sensed Imagery: a Practical System and Performance Evaluation","251668420":"133 Role of Abcb1 (P-glycoprotein) and Abcg2 (Bcrp1) in the brain penetration of the novel PI3K Inhibitor GDC0941 and efficacy in orthotopic xenograft models of glioblastoma and metastasis","3193078":"Fundamental limits of Bayesian inference: Order parameters and phase transitions for road tracking","3949819":"A fuzzy multi-local method to detect specific shapes","2389229":"Efficient Interpretation Policies","271585530":"Roadmap Generation in Urban Tracking Using Google Earth Image","269318339":"The development of road information extraction from remote sensing images","37256936":"Optimal visual search strategies using natural scene statistics","221362660":"Contour Grouping with Strong Prior Models.","227025232":"Coarse-to-Fine Face Detection","242370223":"AN INFORMATION-BASED APPROACH TO SENSOR RESOURCE ALLOCATION","220785096":"Use of Human Motion Biometrics for Multiple-View Registration","30519600":"Extraction d\u0027éléments curvilignes guidée par des mécanismes attentionnels pour des images de télédétection: approche par fusion de données","224358846":"Automated Geospatial Conflation of Vector Road Maps to High Resolution Imagery","2525378":"Bayesian Correlation","3816671":"Object localization by Bayesian correlation","233588996":"Joint detection of roads in multifrequency SAR images based on a particle filter","2446542":"A Recursive Algorithm for the Complete Representation of Salient Contour Paths in a Graph","228831567":"Automatic road extraction from IRS satellite images in agricultural and desert areas","242407071":"ON MULTI-SCALE DIFFERENTIAL FEATURES AND THEIR REPRESENTATIONS FOR IMAGE RETRIEVAL AND RECOGNITION","11207771":"Bayesian A* Tree Search with Expected O(N) Node Expansions: Applications to Road Tracking","224739730":"A method of automatic finding airport runways in aerial images","228767066":"Automatic extraction of road networks in urban areas from IKONOS imagery based on spatial reasoning","39674532":"Un enfoque bayesiano para la extracción de características y agrupamiento en visión artificial","257014696":"State of the art on automatic road extraction for GIS update: a novel classification. Pattern Recogn Lett 24(16):30373058","224562584":"Markov random field based image segmentation with adaptive neighborhoods to the detection of fine structures in SAR data","257672101":"SLEDGE: Sequential Labeling of Image Edges for Boundary Detection","222687674":"Dynamic quantization for belief propagation in sparse spaces","3887410":"Road detection in panchromatic SPOT satellite images","221362238":"High-Level and Generic Models for Visual Search: When Does High Level Knowledge Help?","272361770":"Non-Rigid Graph Registration Using Active Testing Search","220602420":"Robust detection of straight and circular road segments in noisy aerial images","253776435":"Obstacle detection algorithms for rotorcraft navigation","3981609":"Road network detection from SPOT satellite image using Hough transform and optimal search","40505202":"Modélisation automatique de zones urbaines","223509582":"A robust approach for automatic detection and segmentation of cracks in underground pipeline images","221281325":"Energy-based Method for Road Extraction from Satellite Images.","222402655":"Characterizing the performance of automatic road detection using error propagation","220914699":"Definition of a Model-Based Detector of Curvilinear Regions","3820825":"Classification and representation of networks from satellite images","228633732":"Choix d\u0027un espace de représentation image adapté a la détection de réseaux routiers","258381376":"Automatic Road Pavement Assessment with Image Processing: Review and Comparison","3660063":"Information fusion in a Markov random field-based image segmentation approach using adaptive neighbourhoods","2445582":"A Perceptual Organization Approach to Contour Estimation Via Composition, Compression and Pruning of Contour Hypotheses","241384271":"ACTIVE TESTING AND EDGE ANALYSIS FOR ROAD CENTRELINE EXTRACTION","8255826":"A statistical model for contours in images","2881796":"Image Statistics and Anisotropic Diffusion","224179310":"Variable Length Open Contour Tracking Using a Deformable Trellis","222549113":"A survey of video processing techniques for traffic applications","2914578":"Discriminative Techniques for the Recognition Of Complex-Shaped Objects","224680027":"Path Planning for Autonomous Driving Based on Stereoscopic and Monoscopic Vision Cues","3820923":"Detection of roads from satellite image using optimal search","220135518":"Tracking Deformable Templates Using a Shortest Path Algorithm","224303132":"Identification of expensive-to-simulate parametric models using Kriging and Stepwise Uncertainty Reduction","228368606":"Unsupervised detection and semi-automatic extraction of contours using a statistical model and dynamic programming","225105960":"Tracking with the EM Contour Algorithm","5613846":"Two Bayesian methods for junction classification","44608484":"Active Testing for Face Detection and Localization","221589624":"Road extraction from motion cues in aerial video","51769922":"Rapid and accurate developmental stage recognition of C. elegans from highthroughput image data","228722936":"Unsupervised line network extraction from remotely sensed images by polyline process","2854256":"Harmonic Decomposition of Audio Signals with Matching","261422793":"Urban road information extraction from high resolution remotely sensed image based on semantic model","220465217":"Assessing the condition of a plant","268473705":"Mapping frazil and pancake sea ice from SAR imagery","250694557":"Using self-organizing map for road network extraction from IKONOS imagery","222646315":"Finding a needle in a haystack: Conditions for reliable detection in the presence of clutter","221602884":"Prediction and Change Detection In Sequential Data for Interactive Applications","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","281687485":"A Fast and Robust Detection Algorithm for Extraction of the Centre of a Structured Light Stripe","228545767":"Computational Vision: Principles of Perceptual Inference","269304181":"On Modeling and Testing Security Properties of Vehicular Networks","221126739":"Fourier Shape Descriptors of Pixel Footprints for Road Extraction from Satellite Images.","5802456":"Probabilistic fiber tracking using particle filtering.","261253654":"Active Testing Search for Point Cloud Matching","2922922":"Statistical Strategy for Object Class Recognition Using Part Detectors","277751047":"Blood Vessel Segmentation and shape analysis for quantification of Coronary Artery Stenosis in CT Angiography","224794859":"Road Detection in Dense Urban Areas Using SAR Imagery and the Usefulness of Multiple Views","252222087":"Remote Sensing Applications in Transportation Modeling","220649662":"A feature-based approach to conflation of geospatial sources","220359865":"Detection of Tracks in Aerial Photos by the Gibbs Sampler.","224713920":"Stochastic Scheme to Street Detection in Remote Sensing Images","220135609":"Object recognition with uncertain geometry and uncertain part detection","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","222948576":"Condition assessment of underground sewer pipes using a modified digital image processing paradigm","221474973":"Analysis and Synthesis of Structural Textures.","221363358":"Statistical cues for Domain Specific Image Segmentation with Performance Analysis.","221121695":"Road network extraction in remote sensing by a Markov object process","221551750":"Semi-Automatic Road Extraction Algorithm for High Resolution Images Using Path Following Approach.","227281976":"Higher Order Active Contours","220649628":"Numerical experiments with cooperating multiple quadratic snakes for road extraction.","225835209":"Road network extraction in classified SAR images using genetic algorithm","254706323":"Boundary profile representation for objects and their surroundings in outdoor videos","242456502":"Information-Driven Dynamic Sensor Collaboration for Tracking Applications","237428719":"Automated Extraction of Control Points for High Spatial Resolution Satellite Images","237787109":"Statistical cues for Domain Specic Image Segmentation with Performance Analysis. Proc. CVPR\u00272000","4183531":"Applying a wavelet method and LINDA for extracting detailed cartographic features from high resolution images","221140215":"Active Contour with Neural Networks-Based Information Fusion Kernel","220494073":"GPS- und Kamera-basierte Fahrzeugführung durchs Gelände - ION im Grand Challenge (GPS- and Camera-based Off-Road Vehicle Control - ION in the Grand Challenge).","2241020":"Coarse-to-Fine Visual Selection","240620425":"Gap Detection in Road Networks With Linear and Polynomial Models","2599360":"An Expert System Approach For Detection Of Roads From Remote Sensing Data","225366174":"Road network extraction from high-resolution satellite image for GIS applications","221305025":"Finding Deformable Shapes Using Loopy Belief Propagation","220843227":"Graph Cuts Approach to MRF Based Linear Feature Extraction in Satellite Images","221110484":"Optimal Polyline Tracking for Artery Motion Compensation in Coronary Angiography.","240527279":"A reliable and fast road detector using profile analysis and model-based verification","282184405":"Nonlinear Subspace Clustering Using Curvature Constrained Distances","265889245":"Modified Group Generalized Binary Search with Near-Optimal Performance Guarantees","2828847":"Semantic Objects and Context for Finding Roads","221161256":"A computation model for orientation similarity","257786197":"Road Detection from Optical Remote Sensing Imagery Using Circular Projection Matching and Tracking Strategy","221275962":"Understanding Human-Computer Interactions in Map Revision","220600106":"An automation system: Generation of digital map data from pictorial map resources","221111075":"Hierarchical Learning for Tubular Structure Parsing in Medical Imaging: A Study on Coronary Arteries Using 3D CT Angiography","4302414":"Heuristic Road Extraction","229036980":"SUB-PIXEL UNPAVED ROADS DETECTION IN LANDSAT IMAGES","247926996":"Segmentation of crystalline lens in photorefraction video","221618982":"Noisy Generalized Binary Search.","26880908":"Spatial-temporal modeling of interactive image interpretation","234783718":"Stroke extraction in cartoon images using edge-enhanced isotropic nonlinear filter","3193388":"A new pattern representation scheme using data compression","3205653":"Road Network Extraction and Intersection Detection From Aerial Images by Tracking Road Footprints","228615045":"Numerical experiments with cooperating multiple quadratic snakes for road extraction","220785411":"Image Indexing by Focus Map.","265528831":"Extraction of Seismic Risk Related Base Data from Multi Source Remote Sensing Imagery","251914540":"Particle filter based approach to road detection in multiband SAR images","235379763":"A Rank-Based Approach to Active Diagnosis","224755548":"Shape Matching with Belief Propagation: Using Dynamic Quantization to Accomodate Occlusion and Clutter","228936606":"Semi-automatic detection and enhancement of linear features to update GIS files","221284108":"Multi-target Sensor Management Using Alpha-Divergence Measures","3883525":"A scheme for road extraction in rural areas and its evaluation","49849543":"Estimation of Local Orientations in Fibrous Structures With Applications to the Purkinje System","3222128":"Automated Extraction of the Cortical Sulci Based on a Supervised Learning Approach","251517119":"AUTOMATIC EXTRACTION OF MAIN ROAD FROM IKONOS SATELLITE IMAGERY BASED ON FUZZY REASONING","27609059":"Étude d\u0027une nouvelle classe de contours actifs pour la détection de routes dans des images de télédétection","3819133":"Emotions as forms of consciousness","267790783":"TRANSFORMÉE DE HOUGH ET DÉTECTION DE LINÉAMENTS SUR IMAGES SATELLITAIRES ET MODÈLES NUMÉRIQUES DE TERRAIN","228743147":"Remotely sensed images fusion for linear planimetric features extraction","4210187":"A comparison of active-contour models based on blurring and on marginalization","224323343":"Finding trails","220611444":"FoSA: F* Seed-growing Approach for crack-line detection from pavement images","222021480":"A comparison between feature-based and EM-based contour tracking","290893570":"Fast Road Network Extraction from Remotely Sensed Images","220601200":"Old and new straight-line detectors: Description and comparison","5249542":"Probabilistic white matter fiber tracking using particle filtering and von Mises-Fisher sampling","283794108":"Real-time Continuous Feature Extraction in Large Size Satellite Images","223013674":"Contour tracking based on marginalized likelihood ratios","221620055":"Human and Ideal Observers for Detecting Image Curves.","228979654":"Information based sensor management for multitarget tracking","225708816":"Stereo vision system for precision dimensional inspection of 3D holes","220488527":"A Computational Focus of Attention Mechanism to Process Shapes Efficiently: Theory","39087163":"Blocking Adult Images Based on Statistical Skin Detection","265225662":"Detection of an Abnormal Cluster in a Network","3321408":"Information-driven dynamic sensor collaboration","2499157":"Multiscale Document Segmentation","224503572":"Road and Linear Structure Automatic Extraction from Remote Sensing Images Using Marked Point Process","4215351":"Motion-based flexible camera registration","245180646":"Active-testing surveillance systems, or playing Twenty Questions with a radar","3637835":"Global minimum for active contour models: A minimal path approach","7801352":"From Projection Pursuit and CART to Adaptive Discriminant Analysis?","3193524":"Sketches with curvature: The curve indicator random field and Markov processes","3201719":"Synthetic aperture radar image segmentation by a detail preserving Markov random field approach","3906227":"Learning Image Statistics for Bayesian Tracking","252096911":"Introduction of a wavelet transform based on 2D matched filter in a Markov Random Field for fine structure extraction: Application on road crack detection","220685228":"Group-Based Active Query Selection for Rapid Diagnosis in Time-Critical Situations","3919536":"Real time image processing with reconfigurable hardware","232647510":"A Min-Cover Approach for Finding Salient Curves","3845814":"Towards knowledge-based extraction of roads from 1 m-resolution satellite images","228551439":"USING A GUIDED VIRTUAL GAZE FOR THE ANALYSIS OF LOW RESOLUTION REMOTE SENSING IMAGES","220981177":"Semi-automatic Road Extraction from High-Resolution Remote Sensing Image: Review and Prospects","234917011":"International Symposium on Remote Sensing","50948508":"Cluster Detection in Networks using Percolation","247485527":"Semi-automatic road extraction from high-resolution satellite image","241274102":"Structural description of water basins from Landsat imagery using multiscale image relevance function","4038306":"Image statistics and anisotropic diffusion","222528476":"A statistical approach to multi-scale edge detection","3906212":"JetStream: probabilistic contour extraction with particles","267708757":"Bayesian Modeling Using Latent Structures","221415312":"Multi-resolution Approach for Fine Structure Extraction - Application and Validation on Road Images.","4246244":"Supervised Learning of Edges and Object Boundaries","225204169":"Bayesian Object Localisation in Images","252011936":"Detection of stationary aircrafts from satelitte images","224340984":"Energy-Efficient Distributed Adaptive Multisensor Scheduling for Target Tracking in Wireless Sensor Networks","283841091":"Linear street extraction using a Conditional Random Field model","229358337":"Recognizing marbling in dry-cured Iberian ham by multiscale analysis. Phys Rev Lett","224748495":"The research of road extraction for high resolution satellite image","3193499":"Statistical edge detection: Learning and evaluating edge cues","280784407":"A Point Process for Fully Automatic Road Network Detection in Satellite and Aerial Images","222304236":"Beyond the Uniqueness Assumption: Ambiguity Representation and Redundancy Elimination in the Computation of a Covering Sample of Salient Contour Cycles","224572364":"Estimation of multimodal orientation distribution functions from cardiac MRI for tracking Purkinje fibers through branchings","221104002":"Asymmetric Inexact Matching of Spatially-Attributed Graphs","220393363":"Novel Classification and Segmentation Techniques with Application to Remotely Sensed Images","233004885":"Techniques for Automated Extraction of Roadway Inventory Features from High‐Resolution Satellite Imagery","238432384":"Automated condition assessment of buried sewer pipes based on digital imaging techniques","220744607":"Learning Parameter Tuning for Object Extraction","3202696":"A model-based approach to the automatic extraction of linear features from airborne images","226054081":"Morphology-Based Method for Reconstruction of Invisible Road Parts on Remote Sensing Imagery and Digitized Maps","265753962":"Adapting to Intra-Class Variations using Incremental Retraining with Exploratory Sampling","260308285":"The Geometry of Generalized Binary Search","268372287":"GPU-based normalized cuts for road extraction using satellite imagery","221124591":"New Higher-order Active Contour Energies for Network Extraction","225770417":"Bayesian A* Tree Search with Expected O(N) Convergence Rates for Road Tracking","243482693":"Contextual clustering for image segmentation","3192569":"Automatic finding main roads in aerial images by using geometric-stochastic models and estimation","236882132":"Extraction automatique des réseaux linéiques à partir d’images satellitaires et aériennes par processus Markov objets","228922222":"Stochastic Tractography in 3-D Images via Nonlinear Filtering and Spherical Clustering","36175083":"Automatische Extraktion von Strassen aus digitalen Luftbildern /","43350105":"Bayesian Maximal Paths for Coronary Artery Segmentation from 3D CT Angiograms","2317038":"Survey of Work on Road Extraction in Aerial and Satellite Images","235349192":"Junction detection and grouping with probabilistic edge models and Bayesian A∗","222572438":"Simple summation rule for optimal fixation selection in visual search","242282662":"Wire Detection Algorithms for Navigation","29639452":"A Multi-points Criterion for Deterministic Parallel Global Optimization based on Kriging","226280356":"On shape detection in noisy images with particular reference to ultrasonography","236072179":"Unified Detection and Tracking of Instruments during Retinal Microsurgery","3193558":"Contour grouping with prior models","3318485":"Harmonic Decomposition of Audio Signals with Matching Pursuit","263415128":"Automatic Road Defect Detection by Textural Pattern Recognition Based on AdaBoost","220181485":"Automatic Finding of Main Roads in Aerial Images by Using Geometric-Stochastic Models and Estimation.","215721518":"Probabilistic Coarse-To-Fine Object Recognition","3887820":"RoadFinder Front End: An automated road extraction system","4074182":"A detection algorithm for road feature extraction using EO-1 hyperspectral images","29609787":"Global optimization of expensive-to-evaluate functions: An empirical comparison of two sampling criteria","252012028":"Comparison of feature extraction and feature selection approaches to decide whether a face image belongs to a male or a female","220744660":"Extraction of Main Urban Roads from High Resolution Satellite Images by Machine Learning","3359436":"Aircraft type recognition in satellite images","228662110":"Narrow-linear and small-area forest disturbance detection and mapping from high spatial resolution imagery: A framework","2896686":"The Kalman-EM Contour Tracker","281835464":"Multiple Manifold Clustering Using Curvature Constrained Path","221623870":"Nonlinear filtering for extracting orientation and tracing tubular structures in 2-D medical images","3719989":"Generalized Kalman filter using fully and partially occluded models","27411117":"Detecting Wide Lines Using Isotropic Nonlinear Filtering","230055589":"Probabilistic fiber tacking using particle filtering and von Mises-Fisher sampling","4044584":"Pattern matching using morphological probing","220660272":"A Gibbs Point Process for Road Extraction from Remotely Sensed Images","268018912":"From exact to approximate maximum common subgraph","221305360":"Simultaneous Detection and Registration for Ileo-Cecal Valve Detection in 3D CT Colonography","3201816":"Detection of Linear Features in SAR Images: Application to Road Network Extraction","252837944":"Automatic road extraction based on cross detection in suburb","262352014":"An Approach to Extract Straight Lines with Subpixel Accuracy","4235119":"Particle filter based road detection in SAR image","45896077":"Detection of an anomalous cluster in a network","220845595":"Superpixel Analysis for Object Detection and Tracking with Application to UAV Imagery","228702873":"Self-diagnosis within automatic road network extraction","271918863":"The Ignorant Led by the Blind: A Hybrid Human–Machine Vision System for Fine-Grained Categorization","3202831":"The line segment match method for extracting road network from high-resolution satellite images","220270177":"Convergence Rates of Algorithms for Visual Search: Detecting Visual Contours.","227077836":"An information theory perspective on computational vision","228827878":"Visual search: Fundamental bounds, order parameters, and phase transitions","224237078":"Use of Salient Features for the Design of a Multistage Framework to Extract Roads From High-Resolution Multispectral Satellite Images","238437757":"Multi-Scale Detection of Curvilinear Structures with High Contour Accuracy","226738902":"Bayesian Models for Finding and Grouping Junctions","262250743":"An algorithm for automatic detection of runways in aerial images","221512300":"A Statistical Approach for Detecting Tubular Structures in Myocardial Infarct Scars","238337391":"The Curve Indicator Random Field","226235943":"Spectral Information Content of Remote Sensing Imagery","221304427":"Learning to Detect Roads in High-Resolution Aerial Images","224072199":"Efficient car recognition policies","228904697":"Image processing for high resolution satellite and aerial data","220745290":"A Family of Quadratic Snakes for Road Extraction.","226850540":"Efficient Geospatial Analysis of Remotely Sensed Images by Means of Linear Feature Extraction and Combination","226526956":"Order Parameters for Detecting Target Curves in Images: When Does High Level Knowledge Help?","7587613":"An information maximization model of eye movements.","30515873":"Extraction de réseaux linéiques à partir d\u0027images satellitaires et aériennes par processus ponctuels marqués","253532269":"Line extraction in SAR images","3854158":"Statistical cues for domain specific image segmentation withperformance analysis","245306858":"Developing an Automated Procedure for Extraction of Road Data from High-Resolution Satellite Images for Geospatial Information Systems","220146278":"On Straight Line Segment Detection","227746541":"Computer Vision Techniques for Automatic Structural Assessment of Underground Pipes","226716412":"Kriging Is Well-Suited to Parallelize Optimization","225197804":"Learning the Statistics of People in Images and Video","7491574":"Contrast statistics for foveated visual systems: fixation selection by minimizing contrast entropy. J. Opt. Soc. Am. A 22, 2039-2049","2538415":"Statistical Foreground Modelling for Object Localisation","238981555":"Extracting straight road structure in urban environments using IKONOS satellite imagery","225722084":"Extended Phase Field Higher-Order Active Contour Models for Networks","49844586":"Automated kymograph analysis for profiling axonal transport of secretory granules","13241180":"Segmentation and interpretation of MR brain images: An improved active shape model","2408380":"A Markov Process Using Curvature for Filtering Curve Images","228795961":"Road updating from high resolution aerial imagery using road intersection model","228862527":"From maximum entropy to belief propagation: an application to skin detection","290478835":"Directional Segmentation Based on Shear Transform and Shape Features for Road Centerlines Extraction from High Resolution Images","222522086":"An A∗ perspective on deterministic optimization for deformable templates","228876803":"An artificial intelligence application for architectural textures analysis","241527245":"Computation Intensive Methods: State of the Art","250320199":"A flood disaster area extraction using KOMPSAT-1 EOC satellite image data","7961557":"Optimal eye movement strategies in visual search","3202974":"Contextual clustering for image labeling: an application to degraded forest assessment in Landsat TM images of the Brazilian Amazon","226800171":"Global Minimum for Active Contour Models: A Minimal Path Approach","7961558":"Plusa, B. et al. The first cleavage of the mouse zygote predicts the blastocyst axis. Nature 434, 391-395","45366555":"Dynamic Programming and Graph Algorithms in Computer Vision","2998175":"Systems for Safety and Autonomous Behavior in Cars: The DARPA Grand Challenge Experience","51929249":"Hypothesize and Bound: A Computational Focus of Attention Mechanism for\nSimultaneous N-D Segmentation, Pose Estimation and Classification Using Shape\nPriors","260631627":"Road extraction from SAR imagery based on an improved particle filtering and snake model","228590180":"Road extraction in urban areas supported by context objects","221710066":"Feature Extraction and Grouping for Robot Vision Tasks","4087798":"Bayesian geometric model for line network extraction from satellite images","2714597":"Graded Learning for Object Detection","237405672":"EXTRAÇÃO SEMI-AUTOMÁTICA DE FEIÇÕES EM IMAGENS DIGITAIS USANDO A ESTRATÉGIA DE TESTE ATIVO Antônio Juliano Fazan1 Tatiana Sussel Gonçalves Mendes2 Aluir Porfírio Dal Poz3","3192808":"An unbiased detector of curvilinear structures. IEEE Trans Pattern Anal Mach Intell","234755618":"Efficient virtualization of scientific data","255574246":"ROAD EXTRACTION FROM HIGH RESOLUTION REMOTE SENSING IMAGE BASED ON MATHEMATICS MORPHOLOGY AND SEED GROWTH","26467952":"METODOLOGIA MODIFICADA DE PROGRAMAÇÃO DINÂMICA PARA A EXTRAÇÃO ACURADA DO EIXO DE RODOVIA EM IMAGENS DIGITAIS","221400785":"Shape-Based Curve Growing Model and Adaptive Regularization for Pulmonary Fissure Segmentation in CT","277072736":"MULTIPLES MÉTAMODÈLES POUR L\u0027APPROXIMATION ET L\u0027OPTIMISATION DE FONCTIONS NUMÉRIQUES MULTIVARIABLES","3203029":"Road detection in dense urban areas using SAR imagery and the usefulness of multiple views","36419022":"Automatische Extraktion von Straßen aus digitalen Luftbildern","226205341":"Probabilistic contour extraction based on shape prior model","220182264":"Sketches with Curvature: The Curve Indicator Random Field and Markov Processes.","228620872":"Efficient Boundary Tracking Through Sampling","2240462":"Graded Learning for Object Detection","230755890":"Active search for multiple targets is inefficient","2490321":"Application of Mathematical Morphology and Markov Random Field Theory to the Automatic Extraction of Linear Features in Airborne Images","4282295":"An Efficient and Universal Security Architecture of Implementing IPSec in Broadband Router","220277465":"A survey on information processing technologies in wireless sensor networks","250360085":"TRACKING WATER COURSES IN SATELLITE IMAGES","236166639":"Using fuzzy logic path tracking for an autonomous robot"},"index":348}