{"abs":"We propose a new problem formulation which is similar to, but more informative than, the binary multiple-instance learning problem. In this setting, we are given groups of instances (described by feature vectors) along with estimates of the fraction of positively-labeled instances per group. The task is to learn an instance level classifier from this information. That is, we are trying to estimate the unknown binary labels of individuals from knowledge of group statistics. We propose a principled probabilistic model to solve this problem that accounts for uncertainty in the parameters and in the unknown individual labels. This model is trained with an efficient MCMC algorithm. Its performance is demonstrated on both synthetic and real-world data arising in general object recognition.","title":"Learning about individuals from group statistics","id":228333621,"url":"https://www.researchgate.net/publication/228333621_Learning_about_individuals_from_group_statistics","names":["Hendrik Kuck","Nando de Freitas"],"references":{"243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","2428196":"Multiple-Instance Learning for Natural Scene Classification","221305331":"A Constrained Semi-supervised Learning Approach to Data Association","229157614":"From Fields to Trees","239029977":"On assessing Prior Distributions and Bayesian Regression Analysis with g-Prior Distributions","4815105":"A Method of Simulated Moments for Estimation of Discrete Choice Response Models Without Numerical Integration","2948837":"SVM-Based Generalized Multiple-Instance Learning via Approximate Box Counting","2869189":"Multi-Instance Kernels","2493096":"EM-DD: An Improved Multiple-Instance Learning Technique","2870939":"A Two-Level Learning Method for Generalized Multi-instance Problems","240821800":"Bayesian Formulations of Multiple Instance Learning with Applications to General Object Recognition","243766293":"Solving the multiple instance learning with axis-parallel rectangles","221995881":"Bayesian Data Analysis, London","2477494":"\"Normalized cuts and image segmentation\", IEEE Trans","222503383":"The Use of the Area Under the ROC Curve in the Evaluation of Machine Learning Algorithms","221345675":"Sparse Bayesian Learning for Regression and Classification using Markov Chain Monte Carlo.","2869073":"Multiple Instance Learning via Disjunctive Programming Boosting","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741"},"citedIn":{"220485253":"MIML: A Framework for Learning with Ambiguous Objects","262805771":"On Classification with Bags, Groups and Sets","221346163":"Multiple Instance Learning for Sparse Positive Bags","220659393":"Learning to Recognize Objects with Little Supervision","262334981":"Estimation Based on RBM from Label Proportions in Large Group Case","275321550":"An error that I can\u0027t seem to delete from this website","262490764":"Learning a generative classifier from label proportions","220699818":"Learning from Label Proportions by Optimizing Cluster Model Selection","262157261":"Learning Bayesian network classifiers from label proportions","51958902":"Self-Avoiding Random Dynamics on Integer Complex Systems","1771508":"Multi-Instance Multi-Label Learning","268226988":"Deep Multi-Instance Transfer Learning","221275104":"Learning Naive Bayes Models for Multiple-Instance Learning with Label Proportions","220875358":"A Semi-supervised Learning Approach to Object Recognition with Spatial Integration of Local Features and Segmentation Cues","220626610":"Privacy-Preserving Data Publishing","43647183":"A Review of Multi-Instance Learning Assumptions","220321046":"Estimating Labels from Label Proportions","260340988":"On Learning with Label Proportions","221213685":"Attacks on privacy and deFinetti\u0027s theorem","220320286":"Learning from Partial Labels"},"index":356}