{"abs":"We are interested in bounding probabilities of rare events in the context of computer experiments. These rare events depend on the output of a physical model with random input variables. Since the model is only known through an expensive black box function, standard efficient Monte Carlo methods designed for rare events cannot be used. We then propose a strategy to deal with this difficulty based on importance sampling methods. This proposal relies on Kriging metamodeling and is able to achieve sharp upper confidence bounds on the rare event probabilities. The variability due to the Kriging metamodeling step is properly taken into account. The proposed methodology is applied to a toy example and compared to more standard Bayesian bounds. Finally, a challenging real case study is analyzed. It consists of finding an upper bound of the probability that the trajectory of an airborne load will collide with the aircraft that has released it.","title":"Bounding rare event probabilities in computer experiments","id":51890330,"url":"https://www.researchgate.net/publication/51890330_Bounding_rare_event_probabilities_in_computer_experiments","names":["Yves Auffray","Pierre Barbillon","Jean-Michel Marin","Computational Statistics \u0026 Data Analysis"],"references":{"245428385":"Conditions for safe separation of external stores","277294854":"DACE: A Matlab kriging toolbox","4772045":"Bayesian Calibration of Computer Models","4772685":"Estimating percentiles of uncertain computer code outputs","228077459":"Geostatistics: Modeling Spatial Uncertainty. Wiley, New York","245893283":"Designs for Computer Experiments","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","227413790":"Mechanism-based emulation of dynamic simulation models: Concept and application in hydrology","38293466":"Generalized Latin Hypercube Design for Computer Experiments","1911433":"Controlled stratification for quantile estimation","243102952":"Latin Hyperrectangle Sampling for Computer Experiments","256917959":"A Bayesian calibration approach to the thermal problem","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","246170164":"Fast Simulation of rare event in queuing and Reality Models","216756595":"Uniform Design: Theory and Application","232396354":"Gaussian process emulation for second-order Monte Carlo simulations","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","220136450":"Rare events, splitting, and quasi-Monte Carlo","216301381":"The Design and Analysis Computer Experiments","250754768":"9 Computer experiments","241055101":"Maximin design on non-hypercube domain and kernel interpolation","226763682":"Probabilistic Inference for Future Climate Using an Ensemble of Climate Model Evaluations","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","222490346":"Minimax and Maximin Distance Designs","38363490":"[Design and Analysis of Computer Experiments]: Comment","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","2126101":"Genealogical particle analysis of rare events","3619855":"Rare event simulation in stochastic models","234168780":"Cross Validation and Maximum Likelihood estimation of hyper-parameters of Gaussian processes with model misspecification","228348453":"Analysis of Computer Experiments Using Penalized Likelihood in Gaussian Kriging Models","222548735":"Bayesian analysis of computer code outputs: A tutorial","46103168":"Adaptive particle techniques and rare event estimation","260278602":"Design and Modeling for Computer Experiments","41781559":"Gaussian Process for Machine Learning","228475851":"Limit Kriging","222135261":"Exploratory Designs for Computational Experiments","268556901":"Safe Separation Modeling for Aerial Launched Weapon Systems","264857903":"Blind Kriging: A New Method for Developing Metamodels","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","232405682":"Adaptive directional stratification for controlled estimation of the probability of a rare event","216756612":"Orthogonal-Maximin Latin Hypercube Designs","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","238002265":"Quantification of margins and uncertainties: Example analyses from reactor safety and radioactive waste disposal involving the separation of aleatory and epistemic uncertainty","229304790":"A Bayesian analysis of the thermal challenge problem","4749622":"An efficient methodology for modeling complex computer codes with Gaussian processes","248301107":"Variable Selection for Gaussian Process Models in Computer Experiments"},"citedIn":{},"index":358}