{"abs":"Gene transcription is regulated by interactions between transcription factors and their target binding sites in the genome. A motif is the sequence pattern recognized by a transcription factor to mediate such interactions. With the availability of high-throughput genomic data, computational identification of transcription factor binding motifs has become a major research problem in computational biology and bioinformatics. In this chapter, we present a series of Bayesian approaches to motif discovery. We start from a ba-sic statistical framework for motif finding, extend it to the identification of cis-regulatory modules, and then discuss methods that combine motif find-ing with phylogenetic footprinting, gene expression or ChIP-chip data, and nucleosome positioning information. Simulation studies and applications to biological data sets are presented to illustrate the utility of these methods.","title":"Regulatory Motif Discovery: from Decoding to Meta-Analysis","id":228878888,"url":"https://www.researchgate.net/publication/228878888_Regulatory_Motif_Discovery_from_Decoding_to_Meta-Analysis","names":["Qing Zhou","Mayetri Gupta"],"references":{"8187132":"Interacting models of cooperative gene regulation","242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","246122665":"Evolutionary Monte Carlo: Application to Cp model sampling and change point problem","20982984":"Sequence Logos: A New Way to Display Consensus Sequences","7300323":"PhyloGibbs: A Gibbs Sampling Motif Finder That Incorporates Phylogeny","20972493":"An Expectation Maximization (EM) Algorithm for the Identification and Characterization of Common Sites in Unaligned Biopolymer Sequences","2984124":"Rabiner, L.: A Tutorial on Hidden Markov Models and Selected Applications in Speech Recognition. Proc. IEEE 77(2), 257-286","221995817":"Maximum Likelihood from Incomplete Data Via EM Algorithm","15092341":"Hidden Markov Models in Computational Biology","8206565":"PhyME: a probabilistic algorithm for finding motifs in sets of orthologous sequences. BMC Bioinformatics 5, 170","15909992":"Evolutionary Trees from DNA Sequences: A Maximum Likelihood Approach","7271794":"Dynamic nucleosomes","8681370":"Phylogenetic motif detection by expectation-maximization on evolutionary mixtures. Pac. Symp. Biocomput. 324-335","2364420":"Bioprospector: Discovering Conserved Dna Motifs In Upstream Regulatory Regions Of Co-Expressed Genes","8249948":"Decoding Human Regulatory Circuits","12376989":"Building a Dictionary for genomes: Identification of presumptive regulatory sites by statistical analysis","7654609":"Combining phylogenetic motif discovery and motif clustering to predict co-regulated genes","7761246":"Samping motifs on phylogenetic trees","12709608":"TRANSFAC: An integrated system for gene expression regulation","215721461":"Maximum Likelihood From Incomplete Data Via The EM algorithm","237044495":"Biological Sequence Analysis","12069783":"Liu, X., Brutlag, D.L. \u0026 Liu, J.S. BioProspector: discovering conserved DNA motifs in upstream regulatory regions of co-expressed genes. Pac. Symp. Biocomput. 6, 127-138","6015466":"Generalized Hierarchical Markov Models for the Discovery of Length‐Constrained Sequence Features from Genome Tiling Arrays","1762603":"Coupling hidden Markov models for the discovery of CIS-regulatory modules in multiple species","8412723":"Zhou, Q. \u0026 Wong, W.H. CisModule: De novo discovery of cis-regulatory modules by hierarchical mixture modeling. Proc. Natl. Acad. Sci. USA 101, 12114-12119","45578882":"Identification of Regulatory Elements Using A Feature Selection Method","229078814":"Bayesian Models for Multiple Local Sequence Alignment and Gibbs Sampling Strategies","237492253":"Supplemental Data Core Transcriptional Regulatory Circuitry in Human Embryonic Stem Cells","13221492":"Bayesian inference on biopolymer models","8954952":"Sandelin, A., Alkema, W., Engström, P., Wasserman, W.W. \u0026 Lenhard, B. JASPAR: an open-access database for eukaryotic transcription factor binding profiles. Nucleic Acids Res. 32, D91-D94","243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","7858484":"De novo cis-regulatory module elicitation for eukaryotic genomes","10757728":"Kellis M, Patterson N, Endrizzi M, Birren B, Lander ES. Sequencing and comparison of yeast species to identify genes and regulatory elements. Nature 423: 241-254","8895554":"Modeling within-motif dependence for transcription factor binding site predictions","12154354":"Regulatory Element Detection Using Correlation with Expression","4746503":"Discovery of Conserved Sequence Patterns Using a Stochastic Dictionary Model","258228792":"BART: Bayesian additive regression trees","6218115":"Discovery of Novel Transcription Factor Binding Sites by Statistical Overrepresentation","15615537":"Bailey, T.L. \u0026 Elkan, C. Fitting a mixture model by expectation maximization to discover motifs in biopolymers. Proc. Int. Conf. Intell. Syst. Mol. Biol. 2, 28-36","14896130":"Hidden Markov Models of Biological Primary Sequence Information","7608469":"Core Transcriptional Regulatory Circuitry in Human Embryonic Stem Cells","10864839":"Integrating regulatory motif discovery and genome-wide expression analysis. Proc Natl Acad Sci USA","5688629":"Wang, T. \u0026 Stormo, G. D. Combining phylogenetic data with co-regulated genes to identify regulatory motifs. Bioinformatics 19, 2369-2380","14988418":"Detecting Subtle Sequence Signals: A Gibbs Sampling Strategy for Multiple Alignment","5299510":"Extracting sequence features to predict protein - DNA interactions: A comparative study","7651482":"Finding Short DNA Motifs Using Permuted Markov Models","14677808":"Gibbs motif sampling: Detecting bacterial outer membrane protein repeats","20450634":"Algorithms for the optimal identification of segment neighborhoods","2918872":"Modeling Dependencies in Protein-DNA Binding Sites","2986072":"Genomewide Motif Identification Using a Dictionary Model","38359473":"Multi-Variate Adaptive Regression Splines (with Discussion)","7781002":"Yuan, G.-C. Genome-scale identification of nucleosome positions in S. cerevisiae. Science 309, 626-630"},"citedIn":{},"index":362}