{"abs":"In various industrial contexts, estimating the distribution of unobserved random vectors Xi from some noisy indirect observations H(Xi) + Ui is required. If the relation between Xi and the quantity H(Xi), measured with the error Ui, is implemented by a CPU-consuming computer model H, a major practical difficulty is to perform the statistical inference with a relatively small number of runs of H. Following Fu et al. (2014), a Bayesian statistical framework is considered to make use of possible prior knowledge on the parameters of the distribution of the Xi, which is assumed Gaussian. Moreover, a Markov Chain Monte Carlo (MCMC) algorithm is carried out to estimate their posterior distribution by replacing H by a kriging metamodel build from a limited number of simulated experiments. Two heuristics, involving two different criteria to be optimized, are proposed to sequentially design these computer experiments in the limits of a given computational budget. The first criterion is a Weighted Integrated Mean Square Error (WIMSE). The second one, called Expected Conditional Divergence (ECD), developed in the spirit of the Stepwise Uncertainty Reduction (SUR) criterion, is based on the discrepancy between two consecutive approximations of the target posterior distribution. Several numerical comparisons conducted over a toy example then a motivating real case-study show that such adaptive designs can significantly outperform the classical choice of a maximin Latin Hypercube Design (LHD) of experiments. Dealing with a major concern in hydraulic engineering, a particular emphasis is placed upon the prior elicitation of the case-study, highlighting the overall feasibility of the methodology. Faster convergences and manageability considerations lead to recommend the use of the ECD criterion in practical applications.","title":"An adaptive kriging method for solving nonlinear inverse statistical problems","id":281262360,"url":"https://www.researchgate.net/publication/281262360_An_adaptive_kriging_method_for_solving_nonlinear_inverse_statistical_problems","names":["Shuai fu","Mathieu Couplet","Nicolas Bousquet"],"references":{"245033946":"A random imputation principle : the stochastic EM algorithm","4772045":"Bayesian Calibration of Computer Models","268820739":"Bayesian gamma processes for optimizing condition-based maintenance under uncertainty","265315030":"Bayesian inference for inverse problems occurring in uncertainty analysis","239667584":"A Framework for Validation of Computer Models","274902571":"Overall Objective Priors","233303150":"The development of a hybridized particle swarm for kriging hyperparameter tuning","24083812":"Diagnostics of prior-data agreement in applied Bayesian analysis","220118677":"Optimization by Simulated Annealing","226608714":"Inadmissibility of the usual estimator for the variance of a normal distribution with unknown mean, Ann. Inst. Statist. Math. 16","226672277":"Compared regression methods for inferring ammonium nitrogen concentrations in running freshwaters from aquatic bryophyte assemblages","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","224407609":"Divergence Estimation for Multidimensional Densities Via -Nearest-Neighbor Distances","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","248818761":"The application of Bayesian methods for seeking the extremum","222135261":"Exploratory Designs for Computational Experiments","245314877":"Identifying intrinsic variability in multivariate systems through linearized inverse methods","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","224773133":"Elements of Information Theory. Wiley","222490346":"Minimax and Maximin Distance Designs","31140209":"The ECME algorithm: a simple extension of EM and ECM with faster convergence","240338872":"The Theory of Regionalized Variables and Its Application","245211952":"TELEMAC: A new numerical model for solving shallow water equations","253748464":"Kriging Hyperparameter Tuning Strategies","220056297":"Non linear methods for Inverse Statistical Problems","234168780":"Cross Validation and Maximum Likelihood estimation of hyper-parameters of Gaussian processes with model misspecification","245296228":"Uncertainty in Flood Estimates Associated with Roughness Coefficient","228339939":"Diagnostics for Gaussian Process Emulators"},"citedIn":{},"index":367}