{"abs":"Many real-world manufacturing problems are too complex to be modelled analytically. For these problems, simulation can be a powerful tool for system analysis and optimisation. While traditional optimisation methods have been unable to cope with the complexities of many problems approached by simulation, evolutionary algorithms have proven to be highly useful. This paper describes how simulation and evolutionary algorithms have been combined to improve a manufacturing cell at Volvo Aero in Sweden. This cell produces high-technology engine components for civilian and military airplanes, and also for space rockets. Results from the study show that by using simulation and evolutionary algorithms, it is possible to increase the overall utilisation of the cell and at the same time decrease the number of overdue components.","title":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","id":229344627,"url":"https://www.researchgate.net/publication/229344627_Multi-objective_evolutionary_simulation-optimisation_of_a_real-world_manufacturing_problem","names":["Anna Syberfeldt","Amos H.C. Ng","Robert John","Philip Moore","Robotics and Computer-Integrated Manufacturing"],"references":{"3301905":"Approximation Capability in by Multilayer Feedforward Networks and Related Problems","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","3933083":"Future of simulation optimization","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","3302979":"Some queries on “Comments on `Approximation capability in C(R¯n) by multilayer feedforward networks and related problems\u0027”","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","221527431":"New Advances and Applications for Marrying Simulation and Optimization.","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","235709562":"A Reduced-Cost Multi-Objective Optimization Method Based on the Pareto Front Technique, Neural Networks and PVM","2922005":"Evolution Strategies assisted by Gaussian Processes with Improved Pre-Selection Criterion","228824281":"Elements of Artificial Neural Nets","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","233870892":"A Framework for Evolutionary Optimization with Approximate Fitness Functions","238319435":"Simulation-Based Optimization: Parametric Optimization Techniques and Reinforcement Learning"},"citedIn":{"260521317":"Multi-response simulation optimization approach for the performance optimization of an Alarm Monitoring Center","283327286":"MULTI-OBJECTIVE SIMULATION OPTIMIZATION USING GREY-BASED TAGUCHI METHOD WITH FUZZY AHP WEIGHTING","275528426":"Optimum electrode path generation for EDM manufacturing of aerospace components","269133052":"Control of Physical Consistency in Metamodel Building by Genetic Programming","23723390":"Does devaluation hurt private investment? The Indonesian case","277049012":"On the Optimization of Schedules of a Multitask Production Cell","220142055":"Recent trends in metaheuristics for stochastic combinatorial optimization","257516631":"Stochastic multi-objective optimization: A survey on non-scalarizing methods","261169822":"A simulation optimization approach to un-paced assembly line balancing problem-II with additional reworking issue"},"index":37}