{"abs":"Verification and validation of numerical models of natural systems is impossible. This is because natural systems are never closed and because model results are always nonunique. Models can be confirmed by the demonstration of agreement between observation and prediction, but confirmation is inherently partial. Complete confirmation is logically precluded by the fallacy of affirming the consequent and by incomplete access to natural phenomena. Models can only be evaluated in relative terms, and their predictive value is always open to question. The primary value of models is heuristic.","title":"Verification, Validation, and Confirmation of Numerical Models in the Earth Science","id":6092073,"url":"https://www.researchgate.net/publication/6092073_Verification_Validation_and_Confirmation_of_Numerical_Models_in_the_Earth_Science","names":["Naomi Oreskes","Kristin Shrader-Frechette","Kenneth Belitz","Science"],"references":{"18585624":"Polypeptide Bound to the Host RNA Polymerase is Specified by T4 Control Gene 33","249722215":"Manufacturing Certainty: Testing and Program* Management for the F-4 Phantom II","248525941":"It probably is a valid experimental result: A Bayesian approach to the epistemology of experiment","227082606":"Philosophical aspects of program verification","245212058":"Comment on ‘Ground-water models cannot be validated’, by L.F. Konikow \u0026 J.D. Bredehoeft","248526071":"Philosophy of Science and the Persistent Narratives of Modernity","247311642":"Bacteriophage T4 transcriptional control gene 55 codes for a protein bound to Escherichia coli RNA polymerase*1","227769050":"Predictive Accuracy of a Ground–Water Model — Lessons from a Postaudit","222084950":"Ground-water models cannot be validated. Adv Water Res","248806968":"Assessment of Long-Term Salinity Changes in an Irrigated Stream-Aquifer System","227661404":"The Modeling Process and Model Validation","222205386":"Development of reaction models for groundwater system","222270820":"The Role of the Postaudit in Model Validation","220424504":"Program Verification: The Very Idea."},"citedIn":{"241069658":"Chapter 12 The relation between ozone, NO x and hydrocarbons in urban and polluted rural environments","227675542":"Calibration of a discrete element model for intact rock up to its peak strength","222813519":"Eutrophication model for Lake Washington (USA): Part II - Model calibration and system dynamics analysis","38326849":"Sensitivity Anaysis as an Ingredient of Modeling","224255319":"Software Testing and Verification in Climate Model Development","278315165":"Trace Elements in Soils","37790285":"Exposure and ecological effects of toxic mixtures at field-relevant concentrations : model validation and integration of the SSEO programme","220605750":"Geo-Pragmatics for the Geospatial Semantic Web","259538796":"Reduced-complexity modeling of braided rivers: Assessing model performance by sensitivity analysis, calibration, and validation","269512708":"Paleoecology grand challenge","254377791":"The Fidelity of Ocean Models With Explicit Eddies","237362738":"UTILIZING HIGH-PERFORMANCE COMPUTING TO IMPROVE PERFORMANCE AND INVESTIGATE SENSITIVITY OF AN INVERSION MODEL FOR HYPERSPECTRAL REMOTE SENSING OF SHALLOW CORAL ECOSYSTEMS","249843443":"11 Integration of GIS and Simulation Models","11268284":"A field validation of two sediment-amphipod toxicity tests","238685728":"\"To be or not to be? That is (not) the question\": Justifying critical pluralism as a philosophy of complexity","228851128":"GKSS School of Environmental Research","254848812":"Measuring the performance of geosimulation models by map comparison \u003d Het beoordelen van geosimulatiemodellen op basis van kaartvergelijking","255913821":"The Future “Golden Age” of Predictive Models for Surface Water Quality and Ecosystem Management","2854922":"Virtual Science","227003813":"Fusion of hydrologic and geophysical tomographic surveys","241127037":"Thermochemistry of Mixing Strontianite [SrCo3(s)] and Aragonite [CaCO3(s)] to form CaxSr1-xCO3(s) Solid Solutions","40702543":"Surface Process Models and the links between tectonics and topography","248413931":"Contrasting outcomes of spatially implicit and spatially explicit models of vegetation dynamics in a forest-shrubland mosaic","277143724":"TROPHIC CASCADES SCENARIO OF A DETRITUS-BASED STAGE-STRUCTURED MODEL IN MARINE ECOLOGY","257666929":"The perils of tweaking: How to use macrodata to set parameters in complex simulation models","227663292":"Dynamic Interactions of Life and its Landscape: Feedbacks at the Interface of Geomorphology and Ecology","41136733":"A general Cluster data and global MHD simulation comparison","232685040":"Using Multicriteria Analysis of Simulation Models to Understand Complex Biological Systems","282247420":"Human Immunomodulation and Initial HIV Spread.","235638331":"A network model shows the importance of coupled processes in the microbial N cycle in the Cape Fear River Estuary","262729628":"Uncertainty in emission inventories: What do we mean and how could we assess it?","222498164":"Large Simulation Models: Calibration, Uniqueness and Goodness of fit","255975286":"Clarity versus complexity: Land-use modeling as a practical tool for decision-makers","220110114":"A case study on qualitative model evaluation using data about river water quality","226319673":"A framework and methods for simplifying complex landscapes to reduce uncertainty in predictions","227073472":"Minimum Acceptance Criteria for Geostatistical Realizations","268406710":"Osäkerhetsanalys av kväveretention i HBV-NP- modellen","240778768":"Longshore Drift: Trapped in an Expected Universe","225963324":"The Role of Multiphase Chemistry in the Oxidation of Dimethylsulphide (DMS). A Latitude Dependent Analysis","229621217":"Building better wildlife‐habitat models","236584535":"Fauna data integration and species distribution modelling as two major advantages of geoinformatics-based phytobiodiversity study in today’s fast changing climate","257564437":"Microparameter Prediction for a Triaxial Compression PFC3D Model of Rock Using Full Factorial Designs and Artificial Neural Networks","276959442":"Sustainable Exploitation of Renewable Resources","263233504":"Reactive transport modeling of natural systems: Preface","7868456":"A Regression-Based Equivalence Test for Model Validation: Shifting the Burden of Proof","243527379":"A stochastic representation of environmental uncertainty and its coupling to acoustic wave propagation in ocean waveguides","228396495":"Modeling Habitat Suitability and Population Demographics of the Eastern Massasauga Rattlesnake in Managed Lands in Southwestern Michigan","262209523":"Thermovision in the Validation Process of Numerical Simulation of Braking","264122344":"Studying, Teaching and Applying Sustainability Visions Using Systems Modeling","250764965":"Data-Based Mechanistic and Top-Down Modelling","264576923":"Testing probabilistic seismic hazard estimates by comparison with observations: An example in Italy","227790320":"Doing flood risk science differently: An experiment in radical scientific method","263294932":"Fostering assumption-based stress-test thinking in managing groundwater systems: learning to avoid failures due to basic dynamics","263102406":"How significant (p \u003c 0.05) is geomorphic research?","254832475":"Scales in single root water uptake models: A review, analysis and synthesis","222395693":"The role of expertise in governance processes","43262712":"Modeling Pesticide Fate and Nonideal Transport From Seeds Treated with a Slow-Release Pesticide in a Laboratory Soil Column.","228556265":"Individual-Based Models for Ecosystem Simulations","38089277":"Towards an understanding of the link between environmental emissions and human body burdens of PCBs using CoZMoMAN","236981849":"Delusions in Habitat Evaluation: Measuring Use, Selection, and Importance","272642105":"Estimating the effects of seawater intrusion on an estuarine nitrogen cycle by comparative network analysis","220605789":"Simulating forest and habitat change in south-east Alaska with the landscape model PAYSAGE","226221317":"The conceptualization model problem - Surprise","257548070":"Climategate: The role of the social sciences","251768704":"AUC: a misleading measure of the predictive distribution models. Global Ecol Biogeogr","222420418":"Tillage effect on macroporosity and herbicide transport in percolate","251461241":"Supercritical Fluid Extraction","259543037":"Using System Dynamics for Grand Challenges: The ESDMA Approach","265232201":"DYNAMICS OF THE THERMOHALINE CIRCULATION -cko Lectures","277704709":"Gravel-Bed Rivers: Processes, Tools, Environments","225496573":"A Simple Model for Forecasting the Effects of Nitrogen Loads on Chesapeake Bay Hypoxia","230821199":"Raman and infrared spectra of minerals from ab initio molecular dynamics simulations: The spodumene crystal","225652221":"Fossils, sediments, tectonics","260398858":"Evaluating integrated assessment models of global climate change","257335239":"Detecting mistakes in engineering models: The effects of experimental design","272199848":"On the effect of inverse modelling and compensation effects in computational pyrolysis for fire scenarios","281555034":"How well must climate models agree with observations?","251805590":"Models in Ecosystem Science","223530436":"Description and sensitivity analysis for the LESV model: Water quality variables and the balance of organisms in a fjordic region of restricted exchange","264908626":"Bolliger EcMod2000","248516169":"What does it mean when climate models agree? A case for assessing independence among general circulation models","229616949":"An approach to quantifying spatial components of exposure for ecological risk assessment","228498690":"Models and scales for cross-shore sandbar migration","248798794":"Controls on post-mid-Cretaceous landscape evolution in the southeastern highlands of Australia: Insights from numerical surface process models","222580187":"Systematic testing of an integrated systems model for coastal zone management using sensitivity and uncertainty analyses","228617472":"Ying, C. C. and A. D. Yanchuk. The development of British Columbia\u0027s tree seed transfer guidelines: purpose, concept, methodology, and implementation. Forest Ecology and Management","225217997":"Interdisciplinary Research at the Urban-Rural Interface: The WestGa Project","223186415":"Modeling survival in juvenile and mature loblolly pine plantations","222821859":"The impact of climate change on spatially varying groundwater recharge in the Grand River watershed (Ontario)","253669305":"Mountain Pine Beetle Epidemic and Flood Risk in the Fraser River Basin","222150036":"Inadmissible evidence: Knowledge and prediction in land and riverscapes","268255056":"Critical loads -assessment of uncertainty","227638590":"Regional application of an ecosystem production model for studies of biogeochemistry in Brazilian Amazonia","261291808":"Merging validation and evaluation of ecological models to ‘evaludation’: A review of terminology and a practical approach","223841760":"Molecular sensors based on the photoelectric effect of bacteriorhodopsin: Origin of differential responsivity","245435926":"Bayesian Framework for Calibration of Gas Turbine Simulator","222891504":"Comparing models for tree distributions: Concept, structures, and behavior","226757946":"‘Agent-based integrated assessment modelling: The example of climate change’","238501622":"Chapter 15 Hydrogeology of major peat basins in North America","264302337":"Sensitivity analysis of a process-based ecosystem model: Pinpointing parameterization and structural issues","228679011":"Vegetation-hydrology dynamics in complex terrain of semiarid areas. I. A mechanistic approach to modeling dynamic feedbacks","261181271":"When do aquatic system models provide useful predictions, what is changing, and what is next?","260398925":"Long-term climate policy implications of phasing out fossil fuel subsidies","274395283":"Feedbacks and landscape-level vegetation dynamics","258625441":"Prediction under change: invariant model parameters in a varying environment","27648362":"Numerical Forward Modeling of Carbonate Platform Dynamics: An Evaluation of Complexity and Completeness in Carbonate Strata","232946992":"Interpreting the unknown: Uncertainty and the management of transboundary groundwater","13426719":"Evaluation (not validation) of quantitative models","27451764":"Beslissen over bagger op bodem. Deel 1. Systeembenadering, model en praktijkvoorbeelden","248815107":"Analytical solution for flow of gelling solutions in porous media","222076390":"Emergency planning and mitigation at Vesuvius: a new evidence-based approach. J Volcanol Geotherm Res 178(3):454","268295974":"2 Equifinality and Uncertainty in Geomorphological Modelling","235089628":"Proceedings of the Fourth Annual U.S. Army Conference on Applied Statistics, 21-23 October 1998","232910080":"Uncertainty analysis of the rainfall runoff model LisFlood within the Generalized Likelihood Uncertainty Estimation (GLUE)","272752800":"Reply to comment by Flewelling and Sharma on “Hydraulic fracturing in faulted sedimentary basins: Numerical simulation of potential contamination of shallow aquifers over long time scales”","241049272":"Integrating Archaeological Theory and Predictive Modeling: A Live Report from the Scene","13426730":"Integrated exposure uptake biokinetic model for lead in children: Empirical comparisons with epidemiologic data","226282903":"Modeling and complexity: the control engineering point of view","229858648":"A model approach to radioactive waste disposal at Sellafield","251092484":"Canopy reflectance model benchmarking: RAMI and the ROMC","229875008":"Post-Palaeozoic uplift history of southeastern Australia revisited: Results from a process-based model of landscape evolution","7151774":"Predicted effects of toxicant mixtures are confirmed by changes in fish assemblages in Ohio, USA, Rivers. Environ Toxicol Chem","223477157":"A model of bluegill-largemouth bass interactions in relation to aquatic vegetation and its management","277696633":"Modeling Flood Dynamics along the Super-elevated Channel Belt of the Yellow River over the Last 3000 years: Modeling Historical Flood Dynamics","281735625":"Using Bayesian analysis to compare the performance of three evapotranspiration models for rainfed jujube (Ziziphus jujuba Mill.) plantations in the Loess Plateau","222960718":"Software quality assurance in the 1996 performance assessment for the Waste Isolation Pilot Plant","238710578":"4 UTILISATION DE MODELES NUMERIQUES POUR SIMULER LES PROCESSUS D\u0027ECOULEMENT ET DE TRANSPORT DANS LES EAUX SOUTERRAINES","264937152":"Fundamental mismatches between measurements and models in aeolian sediment transport prediction: The role of small-scale variability","291520622":"Larocque, G.R., A. Komarov, O. Chertov, V. Shanin, J. Liu, J.S. Bhatti, W. Wang, C. Peng, H.H. Shugart, W. Xi and J.A. Holm, 2016. Process-based models: A synthesis of models and applications to address environmental and management issues. In: G.R. Larocque (Editor). Ecological Forest Management Handbook, CRC Press, Boca Raton, FL, USA. Pp. 223-266.","281813468":"Sensitivity analysis with the regional climate model COSMO-CLM over the CORDEX-MENA domain","251494380":"Enriching Policy Analysis: The Role of Agent-Based Models","251424744":"Inference of field-scale fracture transmissivities in crystalline rock using flow log measurements","260742802":"Improving the Contribution of Climate Model Information to Decision Making: The Value and Demands of Robust Decision Framework","237723403":"Bibleography of Public Policy Related Complexity Articles and Books in Author Alpha-Order","229309582":"Analysis of Pattern-Process Interactions Based on Landscape Models – Overview, General Concepts, Methodological Issues","251424724":"Snow Surface energy exchanges and snowmelt at a continental, midlatitude Alpine site","235695909":"Thermal anomalies associated with forced and free ground-water convection in the Dead Sea rift valley. Geol Soc Am Bull","241647438":"V \u0026 V: What\u0027s the Difference?","222415978":"A synthesis of literature on evaluation of models for policy applications, with implications for forest carbon accounting","200043231":"Geosemiosis","236982035":"Animal Home Ranges and Territories and Home Range Estimators","273899876":"Computational Foot Modeling: Scope and Applications","1732896":"A General Strategy for Physics-Based Model Validation Illustrated with Earthquake Phenomenology, Atmospheric Radiative Transfer, and Computational Fluid Dynamics","223837291":"Parameters, prediction, post-normal science and the precautionary principle - A roadmap for modelling for decision-making","237117214":"GEOTHERMAL RESERVOIR SIMULATION TO ENHANCE CONFIDENCE IN PREDICTIONS FOR NUCLEAR WASTE DISPOSAL","236162862":"On the propagation of drought. How climate and catchment characteristics influence hydrological drought development and recovery","226106436":"Integrated Assessment","2244962":"Science And Policy Interaction In The Air Quality Decision Process","251412409":"The EUROTRAC Contribution to the Development of Tools for the Study of Environmentally Relevant Trace Constituents","241020699":"Principles of Environmental Modeling","261406430":"Comparison of eight published static finite element models of the intact lumbar spine: Predictive power of models improves when combined together","223968274":"Linking Quantitative Microbial Risk Assessment and Epidemiological Data: Informing Safe Drinking Water Trials in Developing Countries","228830447":"A Plea for (Good) Simulations: Nudging Economics Toward an Experimental Science","272834831":"Sustainability. Prediction, precaution, and policy under global change","248795033":"Introduction to Special Section on Tectonics and Topography","237260660":"ON THE EVALUATION OF REGIONAL-SCALE PHOTOCHEMICAL AIR QUALITY MODELING SYSTEMS","7008569":"Challenges in Validating CFD-Derived Inhaled Aerosol Deposition Predictions","240488194":"Modeling regional haze during the BRAVO study using CMAQ-MADRID: 2. Source region attribution of particulate sulfate compounds","223628301":"On the ALARP approach to risk management","278651329":"SpringerBriefs in Earth Sciences","237272952":"Belfer Center for Science \u0026 International Affairs","235196248":"Visualization, Identification and Scaling of Complex Ecotoxicological Dynamics at Varying Physical and Temporal Scales","243351519":"Interfacial photochemistry of retinal proteins","4202782":"Least-squares support vector machines for DOA estimation: A step-by-step description and sensitivity analysis","267419311":"Fighting the Curse of Dimensionality: A method for model validation and uncertainty propagation for complex simulation models","253926977":"The role of nonequilibrium thermo-mechanical statistics in modern technologies and industrial processes: An overview","234073232":"A quantitative review of ecosystem service studies: Approaches, shortcomings and the road ahead.","232402111":"Contemporary kinematics of the Upper Rhine Graben: A 3D finite element approach","220015736":"RAMI4PILPS: An intercomparison of formulations for the partitioning of solar radiation in land surface models","228560121":"Using the continuum approach to model unsaturated flow in fractured rock","223943729":"Registration of abrupt climate changes within fluvial systems: Insights from numerical modelling experiments","289824814":"Climate Change Impact Modelling Cascade – Benefits and Limitations for Conservation Management","257105471":"Introduction to the Modelling of Marine Ecosystems, W. Fennel, T. Neumann. Elsevier (2004), 330 pp., ISBN: 0-444-51702-2","275648795":"Evaluation of the Structural Integrity of Corroding Oil and Gas Pipes","228633819":"Evaluation of the National Weather Service Operational Hydrologic Model and Forecasts for the American River Basin","252108410":"User experience with model validation exercises","277291513":"Tekijä(t) – Author(s) Toimeksiantaja(t) – Commissioned by","215608664":"Modeling landscape evolution","46723913":"In press: Hydrologists, bring out shovels and garden hoses and hit the dirt!","266501729":"The use of ontologies in peer reviews of Integrated Assessment Models","266022488":"Review of three-dimensional ecological modeling related to the North Sea shelf system. Part II: Model validation and data needs","269463947":"Flow pathways and nutrient transport mechanisms drive hydrochemical sensitivity to climate change across catchments with different geology and topography","266497639":"COMPUTATIONAL MODELING OF HIP JOINT MECHANICS","228895778":"Sensitivity analysis of an infectious disease model","34694038":"Water residence time and runoff generation in the western cascades of Oregon /","222473427":"Pattern-Oriented Modelling in Population Ecology","222657748":"Modelling Guidelines - Terminology and Guiding Principles","231820357":"Experimenting on Theories","34460564":"Evolutionary history and genetic conservation of fraser fir (Abies fraseri [Pursh] Poir.) [electronic resource] /","227658762":"Long-term landscape evolution: Linking tectonics and surface processes","229055548":"Correlation and process in species distribution models: Bridging a dichotomy","6173123":"Modeling Pesticide Leaching and Dissipation in a Mediterranean Littoral Greenhouse","256921294":"Physics of stamp-collecting? Thoughts on ecosystem model design","226405586":"Uncertainty analysis in ecological studies: An overview","227654719":"Spatial variation of overbank aggradation rate and its influence on avulsion frequency","224333035":"Complexity and its measures in cognitive and other complex systems","231033968":"Predicting, deciding, learning: Can one evaluate the \u0027success\u0027 of national climate scenarios?","46404466":"Advantages of toxicokinetic and toxicodynamic modeling in aquatic ecotoxicology and risk assessment","222575868":"Biogeochemical controls on metal behavior in freshwater environments","248508277":"Modelling hygro-thermo-mechanical behaviour of engineered clay barriers - Validation phase","248598379":"Chapter Fourteen Computational Air Quality Modelling","258506450":"Framing and reframing the emerging \u0027planetary crisis\u0027: A plea to avoid, and for increasing critique of, neoenvironmental determinism","242024400":"Sorting out river channel patterns","227601455":"Complexity science and human geography","223603948":"A new approach to testing an integrated water systems model using qualitative scenarios","222059774":"Combining spatial data in landslide reactivation susceptibility mapping: A likelihood ratio-based approach in W Belgium","6078873":"A Hybrid Artificial Neural Network-Numerical Model for Ground Water Problems","257588882":"Simulating Long-Term Impacts of Winter Rye Cover Crop on Hydrologic Cycling and Nitrogen Dynamics for a Corn-Soybean Crop System","224935076":"Araujo MB, Guisan A. Five (or so) challenges for species distribution modelling. Journal of Biogeography","227626076":"All Models Are Wrong: Reflections on Becoming a System Scientist","234089534":"Simulating effects of environmental factors on biological control of Tetranychus urticae by Typhlodromus pyri in apple orchards","222571668":"Climate change and malaria: Analysis of the SRES climate and socio-economic scenarios","248819460":"Putting the geology back into Earth models","242126781":"Validation, Proof-of-Concept, and Postaudit of the Groundwater Flow and Transport Model of the Project Shoal Area","232582159":"A Dynamic Systems Model of Basic Developmental Mechanisms: Piaget, Vygotsky, and Beyond","233188405":"A “monster” that made the SMAR conceptual model “right for the wrong reasons”","288669921":"The Diversity of Model Tuning Practices in Climate Science","257449600":"Diurnal grazing pattern: Its physiological basis and strategic management","265477640":"Model-Based Assessment of the Effects of Acidic Deposition on Sensitive Watershed Resources in the National Forests of North Carolina, Tennessee, and South Carolina","47932160":"Soil carbon modelling as a tool for carbon balance studies in forestry","226802791":"Impacts of Demographic and Socioeconomic Factors on Spatio-temporal Dynamics of Panda Habitat","37376991":"Indicators of Economic and Social Progress: An Assessment and an Alternative","248799037":"Role of anthropogenic NO x and VOC as ozone precursors: A case study from the SOS Nashville/Middle Tennessee Ozone Study","222612655":"The Future is not What it Used to be: Participatory Integrated Assessment in the Georgia Basin","277766501":"Verification and Validation of the Coastal Modeling System. Report 1: Summary Report","260341353":"Jackson Cornell Social Science and Risk Chapter 2012","271573459":"A successive steady-state model for simulating freshwater discharges and saltwater wedge profiles at Baffin Bay, Texas","263806534":"Letter to the Editor","274960998":"When does Operational Risk cause Supply Chain Enterprises to Tip? A Simulation of Intra-Organizational Dynamics","232882151":"When Modeling Social Systems, Models ≠ the Modeled: Reacting to Wolfram\u0027s A New Kind of Science","245099676":"Comment on “STAND, a dynamic model for sediment transport and water quality” by W. Zeng and M. Beck, 2003. Journal of Hydrology 277, 125–133","237550653":"The critique of modelling and sensitivity analysis in the scientiflc discourse. An overview of good practices Transatlantic Uncertainty Colloquium (TAUC) Washington, October 10-11 http://www.modeling.uga.edu/tauc","26776462":"Recent developments in Life Cycle Assessment","225427319":"Evolutionary Approaches in Archaeology","226062181":"Trace element complexation by humic substances: Issues related to quality assurance","222453597":"Towards a standard for documentation of mathematical models in ecology","254737713":"Identification, verification and validation of process models in wastewater engineering: a critical review","229023623":"Tracking multiple pathways of human exposure to persistent multimedia pollutants: Regional, continental, and global-scale models","271335951":"Barriers to progress in distributed hydrological modelling: Invited Commentary","248798449":"Fault Linkage: Three-dimensional mechanical interaction between echelon normal faults","226693030":"Expert Panel Opinion and Global Sensitivity Analysis for Composite Indicators","281297646":"Ecohydrology modeling: Tools for management","242367577":"Amultiplecriteriadecisionsupportsystemfortestingintegrated environmentalmodels","229719965":"Vulnerability of South African animal taxa to climate change","237403157":"A Protocol for the Development, Evaluation and Application of Environmental Models in Decision Making","3494406":"Fundamental Dark Surface Waves At A Nonlinear Interface","262958489":"Predicting post-fire hillslope erosion in forest lands of the western United States","227291067":"Modelling water and nutrient dynamics in soil–crop systems: a comparison of simulation models applied on common data sets","228863900":"A Bayesian calibration of a simple carbon cycle model: The role of observations in estimating and reducing uncertainty","6066786":"On-Road Vehicle Emissions: Regulations, Costs, and Benefits","223411984":"A spreadsheet-based biogeochemical model to simulate nutrient cycling processes in forest ecosystems","222658311":"Integrating research results into decision making about natural resource management at a catchment scale","11195112":"Review: Calibration of pesticide-leaching models: Critical review and guidance for reporting","249724065":"Computer tools for science communication and education","222048127":"Uncertainty in natural resource decision support systems: Sources, interpretation, and importance","7340596":"Operational seasonal forecasting of crop performance","252382528":"Reply [to“ Comment on ‘Flank uplift and topography at the central Baikal Rift (SE Siberia): A test of kinematic models for continental extension’”]","234504113":"Calculating the Climatic Impacts of Increased CO2: the Issue of Model Validation","248880281":"Runoff Quality Analysis of Urban Catchments with Analytical Probabilistic Models","258374955":"Research on Coupled Human and Natural Systems (CHANS): Approach, Challenges, and Strategies","260767192":"Quantifiable effectiveness of experimental scaling of river- and delta morphodynamics and stratigraphy","4731420":"Assessment of the adequacy of mathematical models","49844397":"Application of recent approaches in modelling for Animal Health Preface","287216459":"Data-Based Mechanistic Modelling and the Emulation of Large Environmental System Models","220274554":"A method for the analysis of assumptions in model-based environmental assessments","280625893":"Validation of a density dependent groundwater transport model using mass recovery rate","223653684":"Investigating short-term dynamics and long-term trends of SO4 in the runoff of a forested catchment using artificial neural networks","227500014":"Towards reduced uncertainty in conceptual rainfall-runoff modelling: Dynamic identifiability analysis","226316062":"Application of Artificial Neural Networks to Complex Groundwater Management Problems","225914644":"Dynamic Spatio-temporal Landscape Models","43278590":"Approaches to Predicting Broad-Scale Regime Shifts Using Changing Pattern-Process Relationships Across Scales","258247950":"Estimating the effects of sea level rise on coupled estuarine nitrogen cycling processes through comparative network analysis","225353477":"Ecosystem Manipulation Experimentation as a Means of Testing a Biogeochemical Model","225541917":"Flood Risk Analysis: Uncertainties and Validation","223092514":"Sensitivity analysis of an environmental model: An application of different analysis methods","229572568":"Assessing the fate of new and existing chemicals: a five-stage process. Environ Toxicol Chem","216301214":"Computer simulation through an error-statistical lens","228646877":"A new approach to modelling frameworks","254295467":"Landscape fate of nitrate fluxes and emissions in Central Europe","237038756":"Development and evaluation of a nutrient cycling extension for the LANDIS-II landscape simulation model","226385913":"Agent-based modeling of socio-economic processes related to the environment: Example of land-use change","248982622":"Integrating Uncertainty Theories with GIS for Modeling Coastal Hazards of Climate Change","225791999":"Boundedness and legitimacy in public planning","287175564":"Explanatory Models Versus Predictive Models: Reduced Complexity Modeling in Geomorphology","13587037":"Gaia and natural selection","256642527":"Zooming through the evolutionary window of opportunity created at the Kondratiev IV/V interface","237079736":"Alternative Silvicultural Regimes in the Pacific-Northwest - Simulations of Ecological and Economic-Effects","227602229":"Anthropogenic Climate Change: A Reason for Concern Since the 18th Century and Earlier","228675334":"An Exploratory System Dynamics Model of Strategic Manufacturing Capabilities","229928732":"Assessment of hydrodynamic simulation results for eco-hydraulic and eco-hydrological applications: A spatial semivariance approach","270197427":"An Arctic Disaster and its Policy Implications","228007742":"Urban Remote Sensing: Monitoring, Synthesis and Modeling in the Urban Environment","282866295":"Corn stover harvest increases herbicide movement to subsurface drains – Root Zone Water QualityModel simulations","235891872":"Validation of Landscape-Scale Decision Support Models That Predict Vegetation and Wildlife Dynamics","273523452":"The lexicon of Geomorphology","233467736":"Perspective: Design considerations and a suggested approach for regional and comparative ecological risk assessment","221118360":"Using Model Replication to Improve the Reliability of Agent-Based Models.","223420392":"Coupled reactive mass transport and fluid flow: Issues in model verification","227684143":"Icons, straw men and precision: Reflections on demographic theories of fertility decline","233045801":"A Contribution to the Uncertainty Analysis of Distributed Hydrological Models","265063687":"Complex Systems Thinking and Its Implications for Policy Analysis","45572218":"Contrasting approaches: the ozone layer, climate change, and resolving the Kyoto dilemma","225361827":"Air quality model performance evaluation. Meteorol Atmos Phys","228347729":"Reducing uncertainty in projections of extinction risk from climate change. Glob Ecol Biogeogr","236686548":"Models, validation, and applied geochemistry: Issues in science, communication, and philosophy","221687783":"Modelling in-stream temperature and dissolved oxygen at sub-daily time steps: An application to the River Kennet, UK","225116089":"Validation of biophysical models: Issues and methodologies. A review","271643364":"Data-Based Mechanistic Modelling: Natural Philosophy Revisited?","227180369":"Personal Reflections on an Unfinished Journey through Global Environmental Problems of Long Timescale","256335257":"Letter to the editor: Comments on Measurements and Models for Total Solar Irradiance on Inclined Surface in Athens, Greece","3134156":"Radiation-induced displacement damage in silicon carbide blue light-emitting diodes","289514407":"Testing Models of Natural Systems: Can It be Done?","222674851":"Effects of Distribution-Based Parameter Aggregation on a Spatially Distributed Agricultural Nonpoint Source Pollution Model","225214337":"Validation and Verification in Social Simulation: Patterns and Clarification of Terminology","275251847":"Simulation of injector dynamics during steady inductive helicity injection current drive in the HIT-SI experiment","47697955":"A Dynamic Model of the Fate of Organic Chemicals in a Multilayered Air/Soil System: Development and Illustrative Application","240413857":"Gibbs energies of formation of metal-carbonate solid solutions: Part 3. The CaxMn1-xCO3 system at 298 K and 1 bar","235699451":"A modelling approach for evaluating phenology and adaptation of two congeneric weeds (Bidens frondosa and Bidens tripartita)","223903649":"On modelling the effects of reafforestation in a heterogenous catchment at different spatial and temporal scales","251682298":"Multiple Organ Toxicities in 1006 Prostate Brachytherapy Patients With Long-Term Followup","232914714":"Evaluation of ocean and climate models using present‐day observations and forcing","6316699":"Dynamics of dissolved oxygen isotopic ratios: A transient model to quantify primary production, community respiration, and air-gas exchange in aquatic ecosystems","29627076":"Cosby, B. J., R. C. Ferrier, A. Jenkins, and R. F. Wright. Modelling the effects of acid deposition: refinements, adjustments and inclusion of nitrogen dynamics in the MAGIC model. Hydrology and Earth System Sciences","226930307":"On the Limits of Quantitative Genetics for the Study of Phenotypic Evolution","31994592":"Prediction of ligand-promoted dissolution rates from the reactivities of aqueous complexes. Nature 375, 44-47","229662399":"Climate models and modeling: An editorial essay","262286515":"Aesthetics, Art, Evolution","249081291":"Hydrogeology and Framing Questions Having Policy Consequences","263330980":"A Practice‐based Approach to Ecosystem Management","223624780":"A case study simulation of DBCP groundwater contamination in Fresno County, California 1. Leaching through the unsaturated subsurface","258612339":"Causal models as multiple working hypotheses about environmental processes","280884132":"Lefebvre et al 2015 WRR reply to comment by Flewelling and Sharma","2294591":"A Pragmatic Approach to Model Validation","47444431":"The Social Status of Climate Change Knowledge","5153644":"A Paradigm for Practice","50999336":"Imagining flood futures: Risk assessment and management in practice","11768720":"Agent-based computer simulation and SIRS: Building a bridge between basic science and clinical trials","51855411":"The philosophy of modelling or does the philosophy of biology have any use?","228343482":"The ShakeOut earthquake scenario: Verification of three simulation sets","222076442":"Exploring Ecological Patterns with Structural Equation Modeling and Bayesian Analysis","281891819":"Modelling and Model Building","6533956":"Varying the time delay of an action potential elicited with a neural-electronic stimulator.","227417764":"Validation and forecasting accuracy in models of climate change. Int J Forecast","258448460":"Numerical simulation of magmatic hydrothermal systems","252783649":"Reference solar spectra: how do they compare in the UV?","227794593":"A Systematic Uncertainty Analysis of an Evaluative Fate and Exposure Model","225865288":"Using robots to model biological behaviour","242240847":"Seismic Hazard Assessment: Management of Uncertainty and Validation","225648179":"Estimating hydraulic conductivity using grain-size analyses, aquifer tests, and numerical modeling in a riverside alluvial system in South Korea","220556902":"A Trajectory for Validating Computational Emulation Models of Organizations","46641548":"Philosophy of Earth Science - Just Sloppy Physics?","260410574":"Falsification and corroboration of conceptual hydrological models using geophysical data","222072435":"From Meso- to Macro-Scale Dynamic Water Quality Modelling for the Assessment of Land Use Change Scenarios","251575718":"A robust well-balanced finite volume model for shallow water flows with wetting and drying over irregular terrain","201998160":"Eagleson\u0027s optimality theory of an ecohydrological equilibrium: quo vadis?","7865123":"Combining Quantitative and Qualitative Measures of Uncertainty in Model-Based Environmental Assessment: The NUSAP System","229895918":"Carrying and assimilative capacities: The ACExR-LESV model for sea-loch aquaculture","235994480":"Introduction to the special issue on uncertainty quantification and risk assessment","8610787":"Modelling radionuclide distribution and transport in the environment","29627044":"The prediction and management of aquatic nitrogen pollution across Europe: An introduction to the Integrated Nitrogen in European Catchments project (INCA)","8610786":"Radioactive contamination: State of the science and its application to predictive models","8610791":"The evolution of mass balance models of persistent organic pollutant fate in the environment. Environ Pollut","229129934":"Age and recharge area of thermal waters in Ladek Spa (Sudeten, Poland) deduced from environmental isotope and noble gas data. J. Hydrol. 167, 327-349","12751780":"Priors and Prejudice","223981119":"On validation of multibody musculoskeletal models","46559657":"Agent-based model validation using Bayesian networks and vector spatial data","29627056":"Internal evaluation of a physically-based distributed model using data from a Mediterranean mountain catchment","5395237":"Estimating Long-term Effectiveness of Lung Cancer Screening in the Mayo CT Screening Study 1","51871855":"Predicting concentrations of trace organic compounds in municipal wastewater treatment plant sludge and biosolids using the PhATE™ model","26804963":"Evaluation of a Generic Multisurface Sorption Model for Inorganic Soil Contaminants","235994478":"Temporal Moments revisited: Why there is there no better way for physically-based model reduction in time","34070904":"A Dynamic Theory of Service Delivery: Implications for Managing Service Quality","222539457":"Modeling stream water nutrient concentrations and loadings in response to weather condition and forest harvesting","263474225":"Agent-Based Modeling in Coupled Human and Natural Systems (CHANS): Lessons from a Comparative Analysis","281461571":"Conformity assessment of monitoring and simulation of CO2 storage: A case study from the Ketzin pilot site","280884026":"Lefebvre et al 2015 WRR reply to comment by Flewelling and Sharma","278639378":"Handbook of Risk Theory","277963544":"Can citizen science assist digital soil mapping?","239390152":"Performance Analysis for Disposal of Mixed Low-Level Waste. I: Methodology","230981205":"An Introduction to the Practice of Ecological Modeling","248434010":"Contested H2O: Science, Policy and Politics in Water Resources Management in Chile","51212442":"On the inference of function from structure using biomechanical modelling and simulation of extinct organisms","254508211":"The Role of Geology in Stochastic Reservoir Modelling: The Future Trends","229592628":"The Social Status of Climate Change Knowledge: an editorial essay","222650075":"Agent-based services for the validation and calibration of multi-agent models","242462163":"4 USO DE MODELOS NUMÉRICOS PARA SIMULAR EL FLUJO Y EL TRANSPORTE SUBTERRÁNEO","266476608":"Bibliography","283353924":"Chapter I: Adaptation and Congestion in a Multi-Agent System to Analyse Empirical Traffic Problems: Concepts and a Case Study of the Road User Charging Scheme at the Upper Derwent Valley, Peak District National Park","266284152":"THE INFLUENCE OF VARYING INPUT DATA AND MODEL PARAMETERS ON MODEL OUTPUT, EXAMPLES OF THE FLUVER 2 MODEL","252476580":"Cellular modeling as a tool for interpreting historic braided river evolution","51683519":"Approaches for evaluating veterinary epidemiological models: Verification, validation and limitations","4871142":"Model calibration as a testing strategy for system dynamics models","226332364":"Implications of considering metal bioavailability in estimates of freshwater ecotoxicity: Examination of two case studies","283845466":"A priori prediction of an extreme crash in 2015 for a population network of the alpine butterfly, Parnassius smintheus","275891139":"Swiftness of biomorphodynamics in Lilliput- to Giant-sized rivers and deltas","267455557":"An investigation of stimulation mechanisms in Enhanced Geothermal Systems","249290094":"A Comparison of Two Approaches for Modelling Cassava ( Manihot esculenta Crantz.) Crop Growth","244157752":"Numerical study of pleated fabric cartridges during pulse-jet cleaning","51200179":"Validation of a Novel Air Toxic Risk Model with Air Monitoring","251460924":"Chapter 13 Simplicity out of complexity","232410648":"Back-trajectory-based source apportionment of airborne sulfur and nitrogen concentrations at Rocky Mountain National Park, Colorado, USA","242187692":"Measuring the Predictive Capability of Computational Methods: Principles and Methods, Issues and Illustrations","251460927":"Chapter 17 Probing the shores of ignorance","23794338":"Cyclicality of capital-intensive industries: A system dynamics simulation study of the paper industry","239926659":"Evaluierungsstrategie für Chemie-Transport-Modellsysteme mit Anwendung im Leitthema 1 des Förderschwerpunkts \"Troposphärenforschung","234130983":"Review: Where systems biology meets postharvest","242605462":"Evaluating hazard results for Switzerland and how not to do it: A discussion of bProblems in the application of the SSHAC probability method for assessing earthquake hazards at Swiss nuclear power plantsQ by JU Klugel","260529250":"Some philosophical issues in modeling corrosion of oil and gas pipelines","228445819":"Simulating the impacts of disturbances on forest carbon cycling in North America: processes, data, models, and challenges. J Geophys Res 116:G00K08","226168466":"System Complexity and Its Measures: How Complex Is Complex","283763458":"Representing Human Decision-Making in Environmental Modelling","223014567":"Using a paired-catchment manipulation experiment to evaluate a catchment-scale biogeochemical model","240922033":"Long wave radiation regime in vegetation-parameterisations for climate research","267979796":"Quantifying the uncertainty of non-point source attribution in distributed water quality models: A Bayesian assessment of SWAT’s sediment export predictions","280585047":"Corn stover harvest increases herbicide movement to subsurface drains – RZWQM simulations","287376078":"A model of milk production in lactating dairy cows in relation to energy and nitrogen dynamics","9888609":"From Models to Performance Assessment: The Conceptualization Problem","239410618":"Mathematical modelling of alluvial rivers: Reality and myth. Part II: Special issues","233757166":"Model-data fusion: Using observations to understand and reduce uncertainty in hydrological models","256756559":"Runoff conditions in the upper Danube basin under an ensemble of climate change scenarios","277693582":"Modelling Landscape Evolution","233757158":"AWRA Technical Report 4. Evaluation Against Observations","42100369":"Construyendo explicaciones: el uso de modelos en la sociología","26592646":"Pesticide transport and transformation modeling in soil column and groundwater contamination prediction","252209948":"Using Scientific Uncertainty to Shape Environmental Policy1","49608417":"Confirmation of ACRU model results for applications in land use and climate change studies","220666175":"Spatio-temporal uncertainty in Spatial Decision Support Systems: A case study of changing land availability for bioenergy crops in Mozambique.","7853164":"Characterization of model error in the simulation of PM2.5 exposure distributions of the working age population in Helsinki, Finland","216844535":"Quantitative comparison of canopy conductance models using a Baysian approach","6403199":"Algorithm for Model Validation: Theory and Applications","49608427":"Why hydrological predictions should be evaluated using information theory","264555495":"A review of validation methodologies and statistical performance indicators for modeled solar radiation data: Towards a better bankability of solar projects","248908531":"Spatial modelling of succession-disturbance dynamics in forest ecosystems: Concepts and examples","283243723":"Appropriate complexity for the prediction of coastal and estuarine geomorphic behaviour at decadal to centennial scales","248961789":"Franklin, Holmes, and the Epistemology of Computer Simulation","222656875":"Testing a marine ecosystem model: Sensitivity analysis and parameter optimization","264440813":"Investigation of contaminant transport in groundwater from the tailings pond of uranium mine: a case study","240777846":"Increasing the reliability of ecological models using modern software engineering techniques","260746169":"The new world screwworm: Prospective distribution and role of weather in eradication","236771880":"Plot-scale studies of vegetation, overland flow and erosion interactions: Case studies from Arizona and New Mexico","262462365":"Application of agent-based modeling to the study of gender stereotypes","227670483":"Chuck, A., Tyrrell, T., Totterdell, I. J. \u0026 Holligan, P. M. The oceanic response to carbon emissions over the next century: investigation using three ocean carbon cycle models. Tellus B 57, 70-86","226060605":"A General Strategy for Physics-Based Model Validation Illustrated with Earthquake Phenomenology, Atmospheric Radiative Transfer, and Computational Fluid Dynamics","283546796":"Risk analysis in maritime transportation: principles frrameworks and evaluation","227682783":"Dispersal in Spatially Explicit Population Models","231123349":"Energetics of Jet Interactions with the Intracluster Medium","235223638":"Using a Bayesian framework and global sensitivity analysis to identify strengths and weaknesses of two process-based models differing in representation of autotrophic respiration","276292643":"Combining state-and-transition simulations and species distribution models to anticipate the effects of climate change","277849306":"Sediment Risk Assessment Workshop","230271471":"Soil Carbon in Sensitive European Ecosystems: From Science to Land Management","220690800":"Probabilistic modelling (2. ed.).","48326326":"HESS Opinions On the use of laboratory experimentation: \"Hydrologists, bring out shovels and garden hoses and hit the dirt\"","8045603":"Bond-Lamberty, B. et al. Reimplementation of the BIOME-BGC model to simulate successional change. Tree Physiol. 25, 413-424","11543789":"Effects of zinc contamination on a natural nematode community in outdoor soil mesocosms. Arch Environ Contam Toxicol 42:205-216","232991107":"Phosphorus Retention in Streams and Wetland: A Review","222259548":"Validation of an agent-based model for spatial planning: A role-playing approach","228461051":"Predicting the time of tree death using dendrochronological data","222710070":"Digital mapping of three-dimensional structures of the Chimney Rock fault system, central Utah","271856708":"Nitrogen limitation on land: How can it occur in Earth system models?","220649815":"Introduction to the Special Issue on Spatial modeling to explore land use dynamics","272294990":"Modelling preference and diet selection patterns by grazing ruminants.","35640936":"Multiple representations of elevation for dynamic process modeling [electronic resource] /","257411884":"Basis of a formal language for facilitating communication among climate modelers","240486952":"A statistical method for testing a general circulation model with spectrally resolved satellite data","279655469":"Water quality modeling for environmental management: Lessons from the policy sciences","267574132":"Exact analytical solution of the convolution integral for classical hydrogeological lumped-parameter models and typical input tracer functions in natural gradient systems","259673075":"Fusion of active and passive hydrologic and geophysical tomographic surveys: The future of subsurface characterization","241060564":"Multicomponent reactive transport modeling of acid neutralization reactions in mine tailings","8676372":"Application of the Root Zone Water Quality Model (RZWQM), to pesticide fate and transport: An overview","261540609":"Cascading uncertainty in climate change models and its implications for policy","8676377":"Herbicide leaching as affected by macropore flow and within-storm rainfall intensity variation: A RZWQM simulation","3851418":"A high-accuracy pedestrian positioning information system using pico cell techniques","3851415":"On estimating the coverage length of toll collection area andclient-server response time","230746480":"The resilience and functional role of moss in boreal and artic ecosystems","8893492":"Benchmark Criteria: A Tool for Selecting Appropriate Models in the Field of Water Management","264969087":"Numerical modeling of discrete multi-crack growth applied to pattern formation in geological brittle media","290604517":"Philosophy of Earth Science (revised and updated)","224242145":"Confidence estimation in the application of simulation in the development of aircraft self-protection measures","277890092":"Combine operations research with molecular biology to stretch pharmacogenomics and personalized medicine—A case study on HIV/AIDS","225487282":"Application of the 3PG forest growth model to a Eucalyptus globulus plantation in Northwest Spain","227658068":"The problems of markets: Science, norms and the commodification of carbon","226331066":"Is Earthquake Seismology a Hard, Quantitative Science?","227600727":"Application of the RHESSys model to a California semiarid shrubland watershed","11400293":"“Principles for the Justification of Public Health Intervention,”","225765816":"Human Toxicity Potential InLCA: Selected Papers InLCA: Selected Papers The Human Toxicity Potential and a Strategy for Evaluating Model Performance in Life Cycle Impact Assessment","51992535":"Quantification of Uncertainty in Computational Fluid Dynamics. Ann. Rev. Fluid Mech. 29","222394773":"Challenges of simulating complex environmental systems at the landscape scale: A controversial dialogue between two cups of espresso","232663300":"Discussion of: Brøker et al., 2007. Morphological modelling: A tool for optimisation of coastal structures. Journal of Coastal Research, 23, 1148-1158","222570916":"Stochastic simulation modeling of southern Great Barrier Reef green turtle population dynamics","229882199":"Bayesian network models for environmental flow decision making in the Daly River, Northern Territory, Australia","286291444":"Can the distribution of sal (Shorea robusta Gaertn. f.) shift in the northeastern direction in India due to changing climate?","222235098":"Modelling change in state of complex ecological systems in space and time: An application to sustainable grazing management","257588145":"Bi-national and regional issues in air quality science and policy","227854713":"Anisotropic transport rates in heterogeneous porous media","12104776":"Modelling instream nitrogen variability in the Dee catchment, NE Scotland","230738225":"Uses and misuses of bioclimatic envelope models","242334338":"Post-Normal Science in Practice at the Netherlands Environmental Assessment Agency","236919530":"Genetic Toxicity of High-Boiling Petroleum Substances.","266222375":"IMPLEMENTATION PLAN FOR LIBRARY OF TOOLS FOR UNCERTAINTY EVALUATION","24090003":"Is It Possible To Solve The Nuclear Waste Problem? Innovations Case Discussion: Siting of Eurajoki Nuclear Waste Facility","41571975":"Sensitivity analysis of a catchment-scale nitrogen model","232696097":"The flavors and colors of facts in wildlife science","2307360":"Mobile Robot Simulation By Means Of Acquired Neural Network Models","226338937":"Looking for some reference solutions for the reactive transport benchmark of MoMaS with SPECY","257055323":"Model testing and assessment: Perspectives from a swarm intelligence, agent-based model of forest insect infestations","262769317":"Geological Disposal of Nuclear Waste: II. From laboratory data to the safety analysis - addressing societal concerns","237407025":"Discussion of Implications of lower mantle structural heterogeneity for existence and nature of whole mantle plumes","232691908":"Testing expert groups for a habitat suitability model for the lynx Lynx lynx in the Swiss Alps. Wildl Biol","51177004":"How to make predictions about future infectious disease risks","251423710":"A Bayesian network approach to knowledge integration and representation of farm irrigation: 2. Model validation","289633386":"Comparison of predictions and observations to assess model performance: a method of empirical validation","233609413":"Systems and scenarios for a philosophy of engineering","248880096":"Engineering Water Quality Models and TMDLs","281990648":"An IV-based method for non-linear continuous-time Hammerstein model identification. Application to rainfall-flow modelling","221730830":"Characterisation of major component leaching and buffering capacity of RDF incineration and gasification bottom ash in relation to reuse or disposal scenarios","243755965":"Modeling reality. Practice, knowledge, and uncertainty in atmospheric transport simulation","272385287":"Modelling preference and diet selection patterns by grazing ruminants: A development in a mechanistic model of a grazing dairy cow, MINDY","270107941":"Is the present the key to the future?","235322171":"Remarks on: Testing ecological models: the meaning of validation (Rykiel E.J., Ecol. Mod. 90, 229-244,1996)","11515375":"On modelling the flow controls on macrophyte and epiphyte dynamics in a lowland permeable catchment: The River Kennet, southern England","242715446":"Title of Document: A SPATIALLY-EXPLICIT FRAMEWORK FOR INVESTIGATING PATCHINESS EFFECTS IN AQUATIC ECOSYSTEMS","229615854":"Hydrological understanding and societal action","249486226":"Development, Application and Place of Neutral Theory in Ecology and Biogeography","282785175":"Patch and Landscape Models of Arctic Tundra: Potentials and Limitations","272577902":"Population Cycles Revisited","51869252":"A diachronic view of the net longshore sediment drift during the Late Holocene at the Jequitinhonha River delta, Brazil, using numerical modeling","275514687":"MACRO (V5.2): Model use, calibration, and validation","222492693":"Decades of change: Contributions of geomorphology to fluvial and coastal engineering and management","254511733":"Numerical Simulation Model of Highly Faulted Reservoir Based on an Integrated Approach in Lake Maracaibo","229918934":"Comparison of the toxicity of dimethoate and cypermethrin in the laboratory and the field when applying the same bioassay","257194546":"Multi-objective optimization in variably saturated fluid flow","6075700":"Calibration and validation of a dynamic water model in agricultural scenarios","226625774":"Modelling Nitrogen and Phosphorus Cycling in Agricultural Systems at Field and Regional Scales","221612121":"Advanced Data Mining Method for Discovering Regions and Trajectories of Moving Objects: \"Ciconia Ciconia\" Scenario.","237529926":"What happens to facts after their construction?: characteristics and functional roles of facts in the dissemination of knowledge across modelling communities","281646503":"Human immunomodulation and initial HIV spread","276923892":"Approaches to evaluating model quality across different regime types in environmental and public health governance","221116501":"Do Empirical Models of Robot-Environment Interaction Have a Meaning?","37594947":"Adjusting to policy expectations in climate change modeling : an interdiciplinary study of flux adjustments in coupled atmosphere-ocean general circulation models","240729051":"Uncertainty in Regional Climate Modelling: A Review","287851681":"Developing a Planning-Level System-Wide Model using SWMM","40740835":"Hindcasting of decadal-timescale estuarine bathymetric change with a tidal-timescale model. J Geophys Res 114:F04019","260315664":"The precautionary principle as a provisional instrument in environmental policy: The Montreal Protocol case study","282858826":"Quantitative Modeling of Geomorphology","8664338":"Validation of Numerical Ground Water Models Used to Guide Decision Making","226240747":"Scales, Tools and Reminiscences","229267507":"Multi-objective parameter estimation for simulating canopy transpiration in forested watersheds","251476839":"Raman micro-spectroscopic investigation of the interaction of cultured HCT116 colon cancer cells with alpha-difluoromethylornithine (DFMO), an irreversible inhibitor of ornithine decarboxylase","41572326":"Parameter Sensitivity and Predictive Uncertainty in a New Water Quality Model, Q2","225147127":"Diagnostic hydrogeologic characteristics of a karst aquifer (Kentucky, USA)","245099270":"Stagnant aquifer concept part 1. Large-scale artesian systems — Great Artesian Basin. Aust. J. Hydrol. 173: 219-240","225089738":"NARSTO critical review of photochemical models and modeling","286201006":"Evaluation of Mathematical Models with Utility Index: A Case Study from Hydrology","232364158":"Evaluating hazard results for Switzerland and how not to do it: A discussion of “Problems in the application of the SSHAC probability method for assessing earthquake hazards at Swiss nuclear power plants” by J-U Klügel","238783378":"Diplôme d\u0027habilitation à diriger des recherches","26539069":"Climate Change and Biodiversity: Some Considerations in Forecasting Shifts in Species\u0027 Potential Distributions","236329916":"Evaluation of a phenological model for strategic decisions for hemp (Cannabis Sativa L.) biomass production across European sites","8545583":"A Methodology for Validating Numerical Ground Water Models","222242961":"The ‘stochastic river’: The use of budget-capacity modelling as a basis for predicting long-term properties of stratigraphic successions","245300017":"Stream Temperature Simulation of Forested Riparian Areas: II. Model Application","229378078":"Exploring currents and heat within the North Sea using a numerical model","223561959":"A Forest Nutrient Cycling and Biomass Model (ForNBM) based on year-round, monthly weather conditions","3667329":"Route learning in mobile robots through self-organisation","8160714":"Screening Analysis of Human Pharmaceutical Compounds in U.S. Surface Waters","265288308":"The Role of Models in Prediction for Decision","13632876":"Multiple attractors in immunology: Theory and experiment","8496445":"The Precautionary Principle: Implications for Risk Management Strategies","265136653":"The challenges and opportunities when integrating animal models into grazing system models for evaluating productivity and environmental impact","277763404":"Procedures for Testing Deterministic Scheduling Models: A Dakota Case Study.","220416225":"Semantic Integration of Environmental Models for Application to Global Information Systems and Decision-Making.","255003385":"Multiphase inverse modeling: An Overview","230287475":"Predictive models in spatially and temporally variable freshwater systems","285693132":"Characterising performance of environmental models","2315752":"Constraining a North Atlantic Ocean General Circulation Model with Chlorofluorocarbon Observations","27452521":"Uncertainty and RIVM\u0027s Environmental Outlooks: Documenting a learning process","263809652":"Modeling Biology Spanning Different Scales: An Open Challenge","251464496":"Electron Collision Data for Plasma Chemistry Modeling","228943979":"Lifting up the flap or why beach behaviour predictive modelling can\u0027t work","248167193":"Integrating knowledges for climate change","40138679":"Effects of zinc contamination on a natural nematode community in outdoor soil mesocosms","268883410":"Modelling risk and risking models: The diffusive boundary between science and policy in volcanic risk management","264981020":"Influence of grain-size distribution on the dynamics of underexpanded volcanic jets","236059597":"An integrated approach for addressing uncertainty in the delineation of groundwater management areas","230688797":"Tuning the climate of a global model","14394629":"Computer simulation of landing movement in downhill skiing: Anterior cruciate ligament injuries","12047702":"Chesapeake Bay Eutrophication: Scientific Understanding, Ecosystem Restoration, and Challenges for Agriculture","222263511":"Building comparable global change vulnerability assessments: The vulnerability scoping diagram","236329976":"Evaluation of a phenological model for strategic decisions for hemp (Cannabis Sativa L.) biomass production across European sites","274572713":"Using an Atlantis model of the southern Benguela to explore the response of ecosystem indicators for fisheries management","261257834":"Experiments in Computing: A Survey","228878429":"Methods and uncertainties in bioclimatic modelling under climate change","233941000":"The Development of Statistical Models to Determine the Relationship between Aromatic-Ring Class Profile and Repeat-Dose and Developmental Toxicities of High-Boiling Petroleum Substances.","273597877":"Modeling and Monitoring Terrestrial Primary Production in a Changing Global Environment: Toward a Multiscale Synthesis of Observation and Simulation","252607218":"Working Paper on Hydrologic Models in the Courtroom","227518579":"Heuristic numerical and analytical models of the hydrologic controls over vertical solute transport in a domed peat bog, Jura Mountains, Switzerland","229095514":"Characterization and in vitro antioxidation of papain hydrolysate from black-bone silky fowl (Gallus gallus domesticus Brisson) muscle and its fractions","237865939":"Release episodes at the periphery of gaps: A modeling assessment of gap impact extent","222042943":"A Strategy to Improve the Contribution of Complex Simulation Models to Ecological Theory","267708912":"On the need for a theory of wildland fire spread","222120761":"Modelling nitrogen fluxes from the land to the coastal zone in European systems: A perspective from the INCA project","237303853":"Assessing goodness of fit for CSTT model (ECASA internal paper) Napier University","264849856":"The Validity Tests Used by Social Scientists and Decision Makers","222927683":"A lattice Boltzmann-based model of plankton–flow interaction around a mussel cluster","257984876":"An evaluation of WRF\u0027s ability to reproduce the surface wind over complex terrain based on typical circulation patterns","237406250":"Governmental Responses to Global Climate Change","228068233":"Management Options for Reducing CO2 Concentrations in the Atmosphere by Increasing Carbon Sequestration in the Soil","222522203":"A Method for Representing and Developing Process Models","14194369":"On the Dangers of Adjusting the Parameter Values of Mechanism-Based Mathematical Models","227789709":"Modelling long-term in situ soil profile evolution: Application to the genesis of soil profiles containing stone layers","282941181":"Seascape features, rather than dispersal traits, predict spatial genetic patterns in co-distributed reef fishes","23525190":"Growth and Inequality: Model Evaluation Based on an Estimation-Calibration Strategy","216373956":"Ecosystem network analysis indicators are generally robust to parameter uncertainty in a phosphorus model of Lake Sidney Lanier, USA","228264895":"Which Science? Whose Science? How Scientific Disciplines Can Shape Environmental Law","275646027":"PHILOSOPHICAL ASPECTS OF MODELING CORROSION OF OIL AND GAS PIPELINES","226057040":"A Comparison of Predictive Phosphorus Load-Concentration Models for Lakes","11875999":"Uncertainty Management in Integrated Assessment Modeling: Towards a Pluralistic Approach","228547505":"Global sensitivity analysis: An introduction","250919130":"Comparison and validation of finite element analysis with a servo-hydraulic testing unit for a biodegradable fixation system in a rabbit model","23541591":"Challenges in evaluating models of geographic complexity","228981648":"Visualized system dynamics models as information and planning tools","248944877":"The 3MRA Risk Assessment Framework—A Flexible Approach for Performing Multimedia, Multipathway, and Multireceptor Risk Assessments Under Uncertainty","227634132":"Landscape Models and Explanation in Landscape Ecology—A Space for Generative Landscape Science?","229903345":"Can abundance of geomorphological features be predicted using presence–absence data?","248944784":"Application of Perturbation Simulations in Population Risk Assessment for Different Life History Strategies and Elasticity Patterns","259184955":"Numerical Modeling of River Flow for Ecohydraulic Applications: Some Experiences with Velocity Characterization in Field and Simulated Data","235976794":"Simulating winter wheat yields using input data with different spatial resolutions","228735976":"Woldwide electricity use in data centers","23283497":"Should we believe model predictions of future climate change? Philos T R Soc A","256981279":"Three-dimensional numerical modeling of deltas","222776073":"The Role of Sensitivity Analysis in Ecological Modelling","216373949":"Environ indicator sensitivity to flux uncertainty in a phosphorus model of Lake Sidney Lanier, USA","229559286":"Critical perspectives on the evaluation and optimization of complex numerical models of estuary hydrodynamics and sediment dynamics","216332991":"Users\u0027 perspectives on validity of a simulation model for natural resource management","235239512":"Is Weather Event Attribution Necessary for Adaptation Funding?","230693792":"Field Validation and Sensitivity Analysis of a Mechanistic Model for Tree Seed Dispersal by Wind","251734371":"Migration Algorithm for Mobile Agents","237590602":"Physical, Chemical, and Biological Characteristics of the Charlotte Harbor Basin and Estuarine System in Southwestern Florida–A Summary of the 1982-89 U.S. Geological Survey Charlotte Harbor Assessment and Other Studies, U.S. Geological Survey Water-Supply Paper 2486","262195651":"Towards the development of integrated modelling systems in aquatic biogeochemistry: A Bayesian approach","248936626":"Modeling Primary Productivity of the Terrestrial Biosphere in Changing Environments: Toward a Dynamic Biosphere Model","7833106":"A tiered risk-based approach for predicting diffuse and point source phosphorus losses in agricultural areas","241076270":"Forecasting local scale precipitation under scenarios of global climate change: A literature review","233147285":"Validation of probabilistic models","225684227":"Exploring the Gap Between Water Managers and Researchers: Difficulties of Model-Based Tools to Support Practical Water Management","224942874":"Modelling forest management within a global vegetation model-Part 2: Model validation from a tree to a continental scale","23455505":"McMahon PM, Kong CY, Weinstein MC, et al. Adopting helical CT screening for lung cancer: potential health consequences during a 15-year period","10901210":"Development and evaluation of an environmental multimedia fate model CHEMGL for the Great Lakes region","240687141":"Challenges in Combining Projections from Multiple Climate Models","282855007":"Full 2D hydrodynamic modelling of rainfall-induced flash floods","280614460":"Resolving the integral connection between pedogenesis and landscape evolution","243112181":"Comparing Simulated and Measured Values Using Mean Squared Deviation and Its Components","277284365":"Adjusting to Policy Expectations in Climate Change Modeling: An Interdisciplinary Study to Flux Adjustments","10569259":"Ethical issues in international environmental health research","222686158":"Parameterized transmittance model for direct beam and circum-solar irradiance","228735790":"Jet Interactions with Magnetized Clouds. Preliminary Results from PIC Code and Large-Scale Hydrodynamic Simulations for AGN Jets","268376434":"Constructing Sustainability A Study of Emerging Scientific Research Trajectories","223800280":"An Application of the Distributed Hydrologic Model CASC2D to a Tropical Montane Watershed","279561787":"Combining neural networks with kriging for stochastic reservoir modeling","225647590":"Acidification and Prognosis for Future Recovery of Acid-Sensitive Streams in the Southern Blue Ridge Province","229567288":"Ecosystem Service Valuation Concepts and Methods","223275993":"On model validation for meso/submesoscale currents: Metrics and application to ROMS off Central California","225913814":"Review on Regional Water Resources Assessment Models under Stationary and Changing Climate","281646690":"The future of computational biomedicine: Complex systems thinking","253749683":"Hydrochemistry of Forested Catchments","228391730":"The 2007 Composite Learning Index: Robustness Issues and Critical Assessment","226458577":"Uncertainty in the Specification of Surface Characteristics, Part ii: Hierarchy of Interaction-Explicit Statistical Analysis","13629024":"Evaluation of resilient abutment components on measured strain using dynamic loading conditions","29685621":"Models for the representation of ecological systems? The validity of experimental model systems and of dynamical simulation models as to the interaction with ecological systems","226261966":"Forecasting and Assessing the Large-Scale and Long-Term Impacts of Global Environmental Change on Terrestrial Ecosystems in the United States and China","243652656":"Automated Vegetation Mapping Using Digital Orthophotography","32032607":"An agent-based model of the impact of computer-mediated communication on organizational culture and performance: An example of the application of complex systems analysis tools to the study of CIS","258685404":"Multiscale Modeling of Astrophysical Jets","40117469":"Assessing uncertainty propagation through physically based models of soil water flow and solute transport","235632823":"Paleohydrology of hydrocarbon maturation, migration and accumulation in the Dead Sea Rift","279250531":"Development index: analysis of the basic instrument of Croatian regional policy","234076980":"Neighbourhood rules make or break spatial scale invariance in a classic model of contagious disturbance","235632844":"Hydrogeological modeling of the saline hot springs at the Sea of Galilee, Israel. Water Res Res","223873951":"Wurster, C. M. \u0026 Patterson, W. P. Late Holocene climate change for the eastern interior United States: evidence from high-resolution 18O values of sagittal otoliths. Palaeogeogr. Palaeoclimat. Palaeoecol. 170, 81-100","11978367":"Modeling and remodeling in a developing artiodactyl calcaneus: A model for evaluating Frost\u0027s Mechanostat hypothesis and its corollaries","221993974":"Recent advances in under water acoustic modelling and simulation","251590707":"Application of the Soil and Water Assessment Tool for six watersheds of Lake Erie: Model parameterization and calibration","235632837":"Basin-scale migration of continental-rift brines: Paleohydrologic modeling of the Dead Sea basin","223763328":"Simple spatially-distributed models for predicting flood inundation: A review","222272487":"Evaluating modeling uncertainty for model selection","250083391":"Rejoinder to: Cowell, P.J. and Thom, B.G., 2006. Reply to: Pilkey, O.H. and Cooper, A.G., 2006. Discussion of: Cowell et al., 2006. Management of Uncertainty in Predicting Climate-Change Impacts on Beaches. Journal of Coastal Research, 22(1), 232–245; Journal of Coastal Research, 22(6), 1577–1579; Journal of Coastal Research, 22(6), 1580–1584","242387115":"Geocomputing with Geological Field Data: Is there a \u0027ghost in the machine\u0027?","234494756":"Philosophy of Climate Science","269575922":"Science as Storytelling","27535168":"Regional Air Quality: Photochemical Modeling for Policy Development and Regulatory Support","255076818":"Pay for performance in the natural gas industry","15627782":"Summary and recommendations for session B: activity classification and structure-activity relationship modeling for human health risk assessment of toxic substances","5318328":"Over-parameterised, uncertain ‘mathematical marionettes.’ How can we best use catchment water quality models? An example of an 80 year catchment-scale nutrient balance","251914729":"Spatial and Temporal Variability in the R-5 Infiltration Data Set: Déjà vu and Rainfall-Runoff Simulations","236914928":"The Relationship between Developmental Toxicity and Aromatic-Ring Class Profile of High-Boiling Petroleum Substances.","224082868":"Engineering the Software for Understanding Climate Change","255273432":"A Validation Process for the Groundwater Flow and Transport Model of the Faultless Nuclear Test at Central Nevada Test Area","255580611":"Ecological paradigms, change detection and prediction","234150665":"Sustainable Exploitation of Renewable Resources","227580781":"Cellular modeling in fluvial geomorphology. ESEX Commentary","229690191":"Numerical modelling of landscape evolution on geological time-scales: A parameter analysis and comparison with the south-eastern highlands of Australia","226949766":"Global Ocean Data Assimilation and Geoid Measurements","50836484":"Room for climate debate : perspectives on the interaction between climate politics, science and the media","227691158":"Validation of species-climate impact models under climate change. Glob Chang Biol","222140986":"Useful techniques of validation for spatially explicit land-change models","226732682":"Evaluating and Managing Cumulative Effects: Process and Constraints","39425360":"Relaciones aire agua en sustratos de cultivo como base para el control del riego. Metodología de laboratorio y modelización","264313032":"Effects of depth on transport of 129I in crystalline rock","228879023":"Towards policy relevant environmental modeling: contextual validity and pragmatic models","269498140":"Inferencing Component Maps of Gas Turbine Engine Using Bayesian Framework","282015681":"Approaches in Highly Parameterized Inversion: PEST++ Version 3, A Parameter ESTimation and Uncertainty Analysis Software Suite Optimized for Large Environmental Models","235256074":"A New Hypothesis Concerning the Nature of Small Pelagic Clusters: An Individual-Based Modelling Study of Sardinella Aurita Dynamics off West Africa","237599033":"Benchmarking variable-density groundwater flow and solute transport models: Approaches, Resolutions and Future Challenges","259549288":"Managing the uncertain earth: Geophysical hazards in the risk society","46380497":"Invited review: Modeling within-herd transmission of Mycobacterium avium subspecies paratuberculosis in dairy cattle: A review","236226818":"The Role of Pattern Recognition in Creative Problem Solving: A Case Study in Search of New Mathematics for Biology.","258144373":"Ground Truth","228096641":"Long-term Measurements of Free-Tropospheric Sulfate at Mauna Loa: Comparison with Global Model Simulations.","248580557":"The “Short Cut” Approach for the Reality of Enhanced Groundwater Contamination","242076019":"QUALITY ASSURANCE OF MULTIMEDIA MODEL FOR PREDICTIVE SCREENING TASKS","6813511":"Use of models to assess the reduction in contamination of water bodies by agricultural pesticides through the implementation of policy instruments: A case study of the Voluntary Initiative in the UK","220269060":"Simulating of Emergent and Self-Organizing Features in Fluvial-Deltaic Dynamic System","260724896":"A database and tool for boundary conditions for regional air quality modeling: Description and evaluation","240609634":"FEMA Reorganization and the Response to Hurricane Disaster Relief","222493300":"A Three-Dimensional Model of Forest Development and Competition","273897234":"Brittleness and Bureaucracy: Software as a Material for Science","229616365":"Rainfall‐induced landslides and debris flows","270903137":"MISSISSIPPI RIVER HYDRODYNAMICS AND DELTA MANAGEMENT STUDY (MRHDM): MODELS PERFORMANCE ASSESSMENT METRICS AND UNCERTAINTY ANALYSIS","223578649":"Salinity and the discharge of salts from catchments in Australia","225294881":"From steady-state to synchronized yeast glycolytic oscillations II: Model validation","222657035":"A Manifesto for the Equifinality Thesis","248056216":"Modeling climate change in the absence of climate change data - Editorial Comment","225712672":"Two-criteria model assessment shows that foliage maintenance in old-growth Pseudotsuga menziesii requires both delayed and sequential reiteration","228768502":"Modelling Forest Growth and Yield: Applications to Mixed Tropical Forests","279738357":"Modéliser pour comprendre, modéliser pour prévoir : apports de la modélisation pour l’évaluation environnementale des filières de gestion de déchets","248056232":"Comments on R. D. Brunner (Climatic Change 32 , 121–147 ) and P. N. Edwards (Climatic Change 32 , 149–161 )","225704466":"Metamorphism and metallogeny in the Eastern Alps","237611339":"Phase 2 - Development of a Population Model for the Southern Great Barrier Reef Green Turtle Stock","49812890":"Randomised controlled trials in oncology closed early for benefit: Trends in methodology, results, and interpretation","228625091":"Computing the Perfect Model: Why Do Economists Shun Simulation?","42370533":"A decision support system for water quality issues in the Manzanares River (Madrid, Spain)","261376241":"Evaluating balanced section restoration with thermochronology data: A case study from the Central Pyrenees","236771698":"An Examination of the Fluxes of Nitrogen and Phosphorus in Temperate and Tropical Estuaries: Current Estimates and Uncertainties","239597876":"Perspectives on the interaction between climate politics, science and the media","233720473":"Social studies of volcanology: Knowledge generation and expert advice on active volcanoes","223287863":"A Bonded-Particle Model for Rock","242071828":"Modeling species distribution with GIS","227052041":"GIS Modelling of Sea-Level Rise Induced Shoreline Changes Inside Coastal Re-Rntrants – Two Examples from Southeastern Australia","281319238":"Computer Simulations and Computational Models in Science (invited review article)","249899363":"Illite Polytype Quantification using WILDFIRE© Calculated X-Ray Diffraction Patterns","258644194":"A new approach for linking event-based upland sediment sources to downstream suspended sediment transport","226491123":"On some methodological problems in the use of environmental tracers to estimate hydrogeologic parameters and to calibrate flow and transport models","281671493":"Time scale interactions and the coevolution of humans and water","223795909":"Discrete element representation of manure products","7423973":"Inverse and predictive modeling of seepage into underground openings","230734425":"Bayesian assessment of the expected data impact on prediction confidence in optimal sampling design","7636974":"Intercomparison of the Community Multiscale Air Quality Model and CALGRID Using Process Analysis","230734430":"A hypothesis-driven approach to optimal site investigation","269850507":"A simple model to separately simulate point and diffuse nutrient signatures in stream flows","263796761":"A NONEQUILIBRIUM STATISTICAL ENSEMBLE FORMALISM MaxEnt–NESOM: Basic Concepts, Construction, Application, Open Questions and Criticisms","12551963":"Performance Assessments of Nuclear Waste Repositories: A Dialogue on Their Value and Limitations","269637562":"Hydropower Suitability Analysis on a Large Scale Level: Inclusion of a Calibration Phase to Support Determination of Model Parameters","12470036":"Hypothesis based research: the maturation of orthopaedic science.","251562324":"Modelling soil carbon development in Swedish coniferous forest soils—An uncertainty analysis of parameters and model estimates using the GLUE method","291522253":"Larocque, G.R., A. Komarov, O. Chertov, V. Shanin, J. Liu, J.S. Bhatti, W. Wang, C. Peng, H.H. Shugart, W. Xi and J.A. Holm, 2016. Process-based models: A synthesis of models and applications to address environmental and management issues. In: G.R. Larocque (Editor). Ecological Forest Management Handbook, CRC Press, Boca Raton, FL, USA. Pp. 223-266.","226753070":"Uncertainty, Complexity and Concepts of Good Science in Climate Change Modeling: Are GCMs the Best Tools?","251562321":"Establishment patterns in a secondary tree line ecotone","6236136":"Analytic Element Ground Water Modeling as a Research Program (1980 to 2006)","223460070":"Comparing models of debris-flow susceptibility in the alpine environment","45352204":"Vers une amélioration d\u0027un modèle global pluie-débit au travers d\u0027une approche comparative","229435920":"A Monte Carlo approach to the inverse problem of diffuse pollution risk in agricultural catchments","223660777":"ADINA applied toward simulation of progressive failure in underground mine structures","248781077":"New evidence for long-distance fluid migration within the Eath\u0027s crust","245434722":"Guide to credible computer simulations of fluid flows","44565867":"End-to-end foodweb control of fish production on Georges Bank","243055039":"Geostatistics with Location-Dependent Statistics","274560920":"Towards a Robust Realism?","265103368":"Global-Scale Modelling of the Land-Surface Water Balance Development and Analysis of WASMOD-M","225979070":"Avian Spatial Responses to Forest Spatial Heterogeneity at the Landscape Level: Conceptual and Statistical Challenges","239667584":"A Framework for Validation of Computer Models","253843695":"Recent advances in watershed modeling","220650230":"Applying time-dependent variance-based global sensitivity analysis to represent the dynamics of an agent-based model of land use change","222431889":"Modeling linkages between sediment resuspension and water quality in a shallow, eutrophic, wind-exposed lake","222911133":"Recent climate change in the Canadian Arctic and its impact on contaminant pathways","260266071":"Molecular modelling techniques in environmental research","228936307":"The use of system dynamics simulation in integrated water resources management","250140991":"Preliminary uncertainty analysis ? A prerequisite for assessing the predictive uncertainty of hydrologic models","262678655":"A review of methods to match building energy simulation models to measured data","248781070":"U.S. science in a changing context: A perspective","222218979":"Issues in Computational Fluid Dynamics Code Verification and Validation","228358723":"Terra Incognita : Explanation and Reduction in Earth Science","237447623":"Uncertainty in Regional-Scale Assessments of NonPoint Source Pollutants","228063863":"Predicted mixture toxic pressure relates to observed fraction of benthic macrofauna species impacted by contaminant mixtures","255609042":"On the Meaning of Computer Models of Robot-Environment Interaction","255609038":"Uncertainty in Integrated Assessment Modelling A bridge over troubled water","29619760":"A nitrogen model for European catchments: INCA, new model structure and equations","23541396":"Analysing the visual dynamics of spatial morphology","245029228":"Prediction of fracture healing under axial loading, shear loading and bending is possible using distortional and dilatational strains as determining mechanical stimuli","271660998":"The GAIA theory: from Lovelock to Margulis. From a homeostatic to a cognitive autopoietic worldview","6051748":"Prehistoric Extinctions of Pacific Island Birds: Biodiversity Meets Zooarchaeology","272238530":"Using JABOWA-3 for forest growth and yield predictions under diverse forest conditions of Nova Scotia, Canada","27711064":"Reconstructing Late Quaternary fluvial process controls in the upper Aller Valley (North Germany) by means of numerical modeling","248580398":"Model Computations on Sequestration of Carbon in Managed Forests and Wood Products under Changing Climatic Conditions in Finland","260532110":"The Fourth Dimension of Interdisciplinary Modeling","283199726":"Geological Realism in Hydrogeological and Geophysical Inverse Modeling: a Review","227829122":"Metapopulation dynamics: Indirect effects and multiple distinct outcomes in ecological risk assessment","248526539":"The development of general circulation models of climate","248526541":"Connections between simulations and observation in climate computer modeling. Scientist’s practices and “bottom-up epistemology” lessons","248923893":"Erring with high-level nuclear waste disposal: A case study of the precautionary principle","249054972":"Evaluating the performance of cryospheric models","251451097":"Chapter 22 Entropy, the Lorenz energy cycle, and climate","236267059":"Challenges for exposure prediction in Ecological Risk Assessment.","277297312":"Validating Simulations with Historical Data: The State Similarity Measure","252839739":"Modeled response of photochemical oxidants to systematic reductions in anthropogenic volatile organic compound and NOx emissions","236647984":"Impact of climate change on the stream flow of lower Brahmaputra: Trends in high and low flows based on discharge-weighted ensemble modeling","229062029":"Century-Scale Responses of Ecosystem Carbon Storage and Flux to Multiple Environmental Changes in the Southern United States","241567307":"Application of Fuzzy Grade-of-Membership Clustering to Analysis of Remote Sensing Data","6580297":"SENEQUE: A multi-scaling GIS interface to the Riverstrahler model of the biogeochemical functioning of river systems","223925611":"Process-response modelling of fluvio-deltaic stratigraphy","236586543":"Modeling Low-Temperature Geochemical Processes","40110686":"Field weed population dynamics: A review of model approaches and applications","221529352":"Validation of Trace-Driven Simulation Models: Regression Analysis Revisited.","229344663":"Simulating the impact of small-scale extrinsic disturbances over forest species volumetric light environment","235947600":"Analyzing ranch profitability from varying cow sales and heifer replacement rates for beef cow-calf production using system dynamics","222549249":"A Framework for Dealing with Uncertainty Due to Model Structure Error","264386437":"Situating technological and societal futures. Pragmatist engagements with computer simulations and social dynamics","253351760":"Verification of Codes and Calculations","258869031":"A Model of Spatially Constrained Social Network Dynamics","286411075":"Philosophy of Climate Science Part II: Modelling Climate Change","260851672":"Reply [to \"Comments on `Constant-concentration boundary condition: Lessons from the HYDROCOIN variable-density groundwater benchmark problem\u0027 by L. F. Konikow, W. E. Sanford, and P. J. Campbell\"]","3786862":"A framework for assessing confidence in simulation-based design under uncertainty","273238033":"A Robust Test of Spatial Predictive Models: Geographic Cross-Validation","263530476":"Methods for spatial and temporal land use and land cover assessment for urban ecosystems and application in the greater Baltimore-Chesapeake region","286206294":"Modelling Climate Change Impacts, Adaptation Strategies and Mitigation Potential in Horticultural Crops","230765980":"Long-Term Climate Trends and Northern Bobwhite Populations in South Texas","229574128":"A spatio‐temporal comparison of water balance modelling in an Alpine catchment","40147460":"The development of FOCUS scenarios for assessing pesticide leaching to groundwater in EU registration","250640019":"Explicating the Epistemological Role of Simulation in the Development of Theories of Cognition","222528800":"Model Validation Using Equivalence Tests","267958173":"USING A SPATIALLY EXPLICIT STREAM TEMPERATURE MODEL TO ASSESS POTENTIAL EFFECTS OF CLIMATE WARMING ON BULL TROUT HABITATS","8206363":"Modeling the fate of polychlorinated biphenyls in the Inner Oslofjord, Norway","239167017":"Verification and Validation of CFD Models and Dynamic Similarity for Fluidized Beds","267958163":"MODELL ZUR BESCHREIBUNG DES EINDRINGENS VON CHLORID IN BETON VON VERKEHRSBAUWERKEN","222315819":"Inferring the location of catchment characteristic soil moisture monitoring sites. Covariance structures in the temporal domain","237397590":"Riverine transport and its alternation by human activities","257550125":"Characterising Performance of Environmental Models","254039889":"Nonparametric Multiplicative Regression for Habitat Modeling","283764892":"Simulation Modeling of Forest Landscape Disturbances: Where Do We Go from Here?","7882766":"Simulation of vegetation dynamics and management strategies on south Texas, semi-arid rangeland","227780075":"Invariant geodynamical information in geometric geodetic measurements","48188065":"The construction of a palaeodischarge time series for use in a study of fluvial system development of the Middle to Late Pleistocene Upper Thames","52009830":"A hybrid analytical-heuristic method for calibrating land-use change models","282273874":"Integrated watershed modeling for simulation of spatiotemporal redistribution of post-fallout radionuclides: Application in radiocesium fate and transport processes derived from the Fukushima accidents","276932611":"A study of the influence exerted by the spectral sensitivity of photoelectric units based on c-Si and α-Si/μc-Si and by operating conditions on their working efficiency","276207857":"Combining state-and-transition simulations and species distribution models to anticipate the effects of climate change","283940966":"Environmental Modelling: Finding Simplicity in Complexity","225052132":"On integrating experimental and theoretical models to determine physical mechanisms of morphogenesis","235914910":"Generating reliable meteorological data in mountainous areas with scarce presence of weather records: the performance of MTCLIM in interior British Columbia, Canada. Environ Model Softw","257439690":"Static Frame Model Validation with Small Samples Solution Using Improved Kernel Density Estimation and Confidence Level Method","259827688":"How Enhancing Atmospheric Monitoring and Modeling Can Be Effective for the Stockholm Convention on POPs?","268458140":"Calibration of Computer Simulator with Non-Gaussian Prior using Dynamically Bi-orthogonal Field Equations","279955506":"FUNDAMENTALS OF GROUNDWATER MODELLING","238003888":"When antecedents diverge: Exploring novelty and value as dimensions of creativity","233735502":"Pmodels, comparison","284067918":"Greenhouse Gases and Global Warming","235992754":"Taking the Plunge: An Introduction to Undertaking Seascape Genetic Studies and Using Biophysical Models What\u0027s in a Bit of Water?","227984691":"Useless Arithmetic: Ten Points to Ponder When Using Mathematical Models in Environmental Decision Making","264898402":"It\u0027s Complicated: Corporate Sustainability and the Uneasiness of Life Cycle Assessment","11442178":"Evaluation in health informatics: Computer simulation","223106529":"Three-dimensional physical benchmark experiments to test variable-density flow models","262412042":"Position Paper11Position papers aim to synthesise some key aspect of the knowledge platform for environmental modelling and software issues. The review process is twofold - a normal external review process followed by extensive review by EMS Board members. See the Editorial in this issue.: Ten iterative steps in development and evaluation of environmental models","253126565":"Bayesian Network Modelling for assessing the biophysical and socio-economic impacts of dryland salinity management","248526435":"From sunspots to the Southern Oscillation: confirming models of large-scale phenomena in meteorology","285895101":"Multi-agent systems for the simulation of land-use and land-cover change: a review","220607889":"Technology and the possibility of global environmental science","263300879":"Simulation of observed types of dynamics of plants and plant communities","238503561":"Photo-induced formation of size-selective Ag nanoparticles and their interactions with Escherichia coli","253241305":"Model Systems in Computational Systems Biology","276985921":"DGVM responses to the latest IPCC future climate scenarios","229266784":"Bayesian analysis for uncertainty estimation of a canopy transpiration model","264492808":"Characterizing uncertainty in expert assessments: Ozone depletion and the West Antarctic ice sheet","237831905":"Assessing Simulated Ecosystem Processes for Climate Variability Research at Glacier National Park, USA","233080105":"Methods for the external validation of continuous system simulation models: A review","258643898":"Bifurcation modelling in a meandering gravel-sand bed river","262772600":"A strategy for diagnosing and interpreting hydrological model nonstationarity","5212318":"Multiple objectives and perceptions of optimal management: The Danish industrial fishery in the North Sea","276334766":"A reduced-complexity model for river delta formation – Part 2: Assessment of the flow routing scheme","223450505":"Practical global ocean state estimation","15681588":"Propositions in genetic toxicology and their erasure","259803040":"Verification of WRF modelled fire weather in the 2009-10 New Zealand fire season","226276768":"Application of a checklist for quality assistance in environmental modelling to an energy model","267044660":"Assessing Recovery from Acidification of European Surface Waters in the Year 2010: Evaluation of Projections Made with the MAGIC Model in 1995","29624621":"STRATAQ: A three-dimensional Chemical Transport Model of the stratosphere","281778210":"Methadone Recycling Sustains Drug Reservoir in Tissue","227636605":"Dispersal, edaphic fidelity and speciation in species-rich Western Australia shrublands: evaluating a neutral model of biodiversity","242153091":"Defining Uncertainty and Variability in Environmental Fate Models","236902125":"Radiation Transfer Model Intercomparison (RAMI) exercise. J. Geophys. Res","259868558":"Modeling low-temperature geochemical processes","242448005":"10 Model Validation and Testing: Past Lessons, Present Concerns, Future Prospects","285567483":"Applying Bayesian model averaging for uncertainty estimation of input data in energy modelling","228770978":"Spatial Extrapolation: The Science of Predicting Ecological Patterns and Processes","223532119":"Statistical aspects of Parkfield earthquake sequence and Parkfield prediction experiment","231290062":"Reactive Solute Transport in an Acidic Stream:  Experimental pH Increase and Simulation of Controls on pH, Aluminum, and Iron","238212922":"DATA-BASED MECHANISTIC MODELLING AND VALIDATION OF RAINFALL-FLOW PROCESSES","228717741":"A critical reflection of computational fluid dynamics applications to fluvial sedimentary systems","11393443":"Thermochemistry and Aqueous Solubilities of Hydrotalcite-Like Solids","266581740":"AIR QUALITY MODELS","5286209":"Air Pollution and Public Health: A Guidance Document for Risk Managers","226321518":"Hydrological Alteration Along the Missouri River Basin: A Time Series Approach","40147824":"Inverse optimization, calibration and validation of simulation models at the field scale","27347124":"Procedures for parameter estimates of computational models for localized failure","227980419":"Eagleson’s optimality theory of an ecohydrological equilibrium: Quo Vadis?","46271444":"Validation of computational models in biomechanics","233227519":"Global Climate Science, Uncertainty And Politics: Data-Laden Models, Model-Filtered Data","51808783":"Use of omental pedicles in mycotic abdominal aortic aneurysm repair","277637525":"Translating Science to Benefit Diverse Publics: Engagement Pathways for Linking Climate Risk, Uncertainty, and Agricultural Identities","228107396":"A 1-D vertical multiple grain size model of suspended particulate matter in combined currents and waves in shelf seas","236980028":"The Indispensable Role of Social Science in Energy Research","51808776":"A submucosal fecal mass as the complication of stapled hemorrhoidopexy: A case report","257427014":"Behavioral models as a common framework to predict impacts of environmental change on seabirds and fur seals","3422507":"The physical basis of computability","29456609":"Modeling dimethylsulphide production in the upper ocean","229110918":"Revisiting Kappa to Account for Change in the Accuracy Assessment of Land-Use Change Models","281410022":"Statistical Methods for Geomorphic Distribution Modeling","263591570":"An operationalized post-normal science framework for assisting in the development of complex science policy solutions: The case of nanotechnology governance","228521147":"Testing and evaluating large-scale agricultural simulation models","35658501":"Probabilistic modelling of PM[sup2.5] exposures in the working age population of Helsinki metropolitan area /","6510918":"Evaluation of a torque-driven model of jumping for height","248944638":"Dynamics of Horizontal Gene Transfer and the Ecological Risk Assessment of Genetically Engineered Organisms","11446662":"Evaluating a Model of the Historical Behavior of Two Hexachlorocyclohexanes in the Baltic Sea Environment","223253604":"Teaching geomorphology through spreadsheet modelling","237532930":"Seductive Simulations? Uncertainty Distribution Around Climate Models","222573686":"Formation and evolution of multiple intertidal bars on macrotidal beaches: Application of a morphodynamic model","223368293":"Design and implementation of a program to monitor ocean health","259278401":"Prediction in Geomorphology","259278402":"How should mathematical models of geomorphic processes be judged?","260970166":"Nonlinear Resonance in Basin Portraits of Two Coupled Swings Under Periodic Forcing","227603630":"Exploring Complexity in a Human-Environment System: An Agent-Based Spatial Model for Multidisciplinary and Multiscale Integration","238634758":"On the use of specific publication criteria for papers on process-based modelling in plant science","227595439":"Models that Talk Back","275286359":"Environmental chemistry: A discipline standing on two shoulders","223278094":"An advanced physical model of cometary activity","268043963":"GESAMAC: Conceptual and Computational Tools to Assess the Long-Term Risk from Nuclear Waste Disposal in the Geosphere","227542232":"Mind, the gap in landscape-evolution models","227988701":"Assessing Uncertainty Propagation through Physically Based Models of Soil Water Flow and Solute Transport","260355784":"A guide to good practice in modeling semantics for authors and referees","233133227":"What Is Complexity Science? Postmodernist or Psotpositivist?","222065772":"SESAR safety decision-making: Lessons from environmental, nuclear and defense modeling","225633315":"Creating Brain-Like Intelligence","259020322":"Validating human decision making in an agent-based land-use model","12569064":"Predictive accuracy of Population Viability Analysis in conservation biology","256804375":"Cooling of Shell Eggs with Cryogenic Carbon Dioxide: a Finite Element Analysis of Heat Transfer","278694341":"NATO Science for Peace and Security Series C: Environmental Security","222983190":"A coefficient of restitution of rock materials","260724461":"Advancing catchment hydrology to deal with predictions under change","227726586":"Sensitivity analysis of the tree distribution model PHENOFIT to climatic input characteristics","257549872":"Software for hydrogeologic time series analysis, interfacing data with physical insight","228009214":"Science and the Understanding of Science: A Reply to Schneider","264038102":"Calibration of detailed building energy simulation models to measured data using uncertainty analysis","281348526":"Christopher P. Weaver, Robert J. Lempert, Casey Brown, John A. Hall, David Revell, Daniel Sarewitz (2013) Improving the contribution of climate model information to decision making: the value and demands of robust decision frameworks, WIREs Climate Change, Volume 4, Issue 1, pages 39–60, January/February 2013.","253167226":"Quality Assurance for Chemistry and Environmental Science","277006831":"Problems of Defining and Validating Traditional Knowledge: A Historical Approach","227046630":"Relationships of longitudinal dispersivity and scale developed from fuzzy least-square regressions","225883136":"Verburg PH. Simulating feedbacks in land use and land cover change models. Landscape Ecology","226755836":"Science and the Climate Change Regime","228590808":"Functional responses for zooplankton feeding on multiple resources: A review of assumptions and biological dynamics","40000286":"STS.436 Cold War Science, Spring 2004","222213185":"Chapter One Modelling and Software as Instruments for Advancing Sustainability","222471363":"Prediction in science and policy","279607597":"Progress, Limitations, and Challenges in Modeling the Effects of Elevated CO2 on Plants and Ecosystems","229520420":"Checking a process‐based catchment model by artificial neural networks","251250549":"Footnotes, Bibliographies, and the Good Life","224859370":"Simulating the impacts of disturbances on forest carbon cycling in North America: Processes, data, models, and challenges","225318142":"Present State and Prospects of Ice Sheet and Glacier Modelling","222401749":"Hydrological models are so good, do we still need data?","235685786":"Model histories: Narrative explanation in generative simulation modelling","48339833":"A complex ethics : critical complexity, deconstruction, and implications for business ethics","228865084":"Ecology, Conservation, and Public Policy","254355125":"Hydroinformatics and urban drainage: an agenda for the beginning of the 21st century","235153305":"Six Myths About Mathematical Modeling in Geomorphology","258246395":"A framework for testing the ability of models to project climate change and its impacts","29636699":"Analysis of non-linear relationships between catch per unit effort and abundance in a tuna purse-seine fishery simulated with artificial neural networks","268400223":"Hochwasser in bewaldeten Einzugsgebieten – Eine Bestandsaufnahme","232391806":"Predicting the effect of a Current Deflecting Wall on harbour siltation","229741589":"Fuzzy modelling and the prediction of porosity and permeability from the compositional and textural attributes of sandstone","274909641":"Multimodel simulations of forest harvesting effects on long-term productivity and CN cycling in aspen forests","248809339":"Climatic and ecological controls of equilibrium drainage density, relief, and channel concavity in dry lands","277203248":"Iberian peninsula ecosystem carbon fluxes: a model-data integration study","239351794":"Errors and uncertainty in physically-basedrainfall-runoff modeling of catchment change effects","265578089":"Topographical control of groundwater flow","272513411":"Evaluation of the Current State of Distributed Watershed Nutrient Water Quality Modeling.","3422708":"Building PDE codes to be verifiable and validatable","27240537":"BENCHMARKING AND VERIFICATION OF BIPOLAR JUNCTION TRANSISTOR TCAD SIMULATION PROGRAMS","258467503":"Bridging groundwater models and decision support with a Bayesian Network","14301462":"Biokinetics and biokinetic models in risk assessment","12212598":"The Politics of Participation in Watershed Modeling","225846459":"From Hierarchical to Network-Like Integration: A Revolution of Modeling Style in Computer-Simulation","244959062":"A modelling study of ecosystem dynamics and nutrient cycling in the Humber plume, UK","237668344":"Predicting Water Quality at","236935113":"Examination of model uncertainty and parameter interaction in a global carbon cycling model (GLOCO)","49625890":"Adrenocortical stem and progenitor cells: Unifying model of two proposed origins","233391166":"What do I make of your Latinorum? Sensitivity auditing of mathematical\nmodelling","35937277":"Simulating the effects of urban growth and frequent fire on southern California coastal shrublands /","223831182":"Sensitivity analysis practices: Strategies for model-based inference. Reliability Eng. Syst. Safety","11053427":"Can robots make good models of biological behavior?","247715615":"Testing and validating environmental models","51997380":"Climate Prediction for Adaptation: Who Needs What?","248809226":"Evaluation of aquifer heterogeneity effects on river flow loss using a transition probability framework","226464928":"Testing, Improvement, and Confirmation of a Watershed Model of Acid-Base Chemistry","51722954":"A Rare Cause of Ear Pain in a Young Boy","225125517":"On the problem of model validation for predictive exposure assessments","267511318":"Northern Australian pasture and beef systems. 2. Validation and use of the Sustainable Grazing Systems (SGS) whole-farm biophysical model","255526610":"Sensitivity of soil acidification model to deposition and forest growth","6277558":"Verification, validation and sensitivity studies in computational biomechanics","229385285":"Modelling groundwater flow and advective contaminant transport in the Bou-Areg unconfined aquifer (NE Morocco)","223483070":"Polar ice sheets and global sea level: How well can we predict the future?","235624422":"Costs, ecosystem benefits and policy implications of remedial measures to combat coastal eutrophication - a framework for analyses and a practical example related to the Gulf of Riga.","31500302":"Planktonic ecosystem models: perplexing parameterizations and a failure to fail","251471625":"Chapter 9 An overview of radiation-matter interactions","250730246":"The art and science of mapping: computing geological categories from field data. Comput Geosci","224781471":"Numerical slope stability simulations of the northern wall of eastern Candor Chasma (Mars) utilizing a distinct element method","252839187":"Coupled physical-biological models in oceanography","248153288":"Diagnóstico das características hidrogeológicas de um aquífero cársico (Kentucky, USA)","47347920":"Automated continuous verification for numerical simulation","227583895":"Climate prediction for adaptation: Who needs what?","233322467":"Structural reliability theory in the context of structural safety","227637149":"Ecosystem Management and the Arrogance of Humanism","228636592":"Dealing with uncertainty and sensitivity issues in process-based models of carbon and nitrogen cycles in northern forest ecosystems","234092513":"Subpermafrost groundwater systems: Dealing with virtual reality while having virtually no data","272251438":"Philosophy of science: A practical tool for applied geologists in the minerals industry","258102649":"A novel use of the caesium-137 technique to estimate human interference and historical water level in a Mediterranean Temporary Pond","51996932":"Comparison of surface energy exchange models with eddy flux data in forest and grassland ecosystems of Germany","221943589":"Multi-Criteria Assessment of Ecological Process Models","260658600":"Comment on ``Convergent radial dispersion in a double-porosity aquifer with fracture skin: Analytical solution and application to a field experiment in fractured chalk\u0027\u0027 by Allen F. Moench","6445633":"Application of a Regional Hurricane Wind Risk Forecasting Model for Wood-Frame Houses","225089357":"The Construction of Global Warming and the Politics of Science","248911102":"Better simulation modelling to support farming systems innovation: Review and synthesis","223950698":"Simulating complex landscapes with a generic model: Sensitivity to qualitative and quantitative classifications","248816864":"Model estimates of nitrous oxide emissions from agricultural lands in the United States. Global Biogeochem Cycles","4299380":"The validation of models in an imaging infrared simulation","242881613":"Room for doubt","222672764":"Lidar remote sensing of forest biomass: A scale-invariant estimation approach using airborne lasers","230250370":"Mixed methods in land change research: Towards integration","256849264":"Glacial-Geological/Geomorphological Research in West Greenland Used to Test an Ice-Sheet Model","281315973":"Statistical Methods for Geomorphic Distribution Modeling","232707988":"HYDRUS: model use, calibration, and validation","277703367":"Simulation and Modeling of Systems of Systems","258237737":"Use of population viability analysis models for Atlantic and Pacific salmon recovery planning","232707984":"STANMOD: Model Use, Calibration, and Validation","14318267":"Computer simulation of human blood flow and vascular resistance","267683222":"Managing Complex Organizations: Complexity Thinking and the Science and Art of Management","230774691":"Land Use Dynamic Simulator (LUDAS): A multi-agent system model for simulating spatio-temporal dynamics of coupled human-landscape system 2. Scenario-based application for impact assessment of land-use policies","256492842":"Performance analysis of statistical spatial measures for contaminant plume characterization toward risk-based decision making","276453916":"Do higher data frequency and Bayesian auto-calibration lead to better model calibration? Insights from an application of INCA-P, a process-based river phosphorus model","223156005":"Reference solar spectra: Their evolution, standardization issues, and comparison to recent measurements","238691411":"Policy and Model Characterization: The Other Parable of Daisyworld","225400581":"Geochemistry and the Understanding of Ground-Water Systems","248427711":"Evaluation of models for branch characteristics of Scots pine in Finland","224524051":"The UVic Earth System Climate Model: Model description, climatology, and applications to past, present and future climates","222033851":"Controversies in water management: Frames and mental models","264619332":"Is climate change the number one threat to humanity?","226424828":"Toward understanding the human dimensions of the rapidly changing arctic system: Insights and approaches from five HARC projects","200032615":"Evaluation of the current state of mechanistic aquatic biogeochemical modeling.","279296553":"Land cover and water yield: Inference problems when comparing catchments with mixed land cover","223549405":"Three-dimensional projection of curvilinear geological features through direction cosine interpolation of structural field observations","260658457":"The Affect Dilemma for Artificial Agents: Should We Develop Affective Artificial Agents?","51399041":"Basin-Scale Transmissivity and Storativity Estimation Using Hydraulic Tomography","40691961":"Predicting avian distributions to evaluate spatiotemporal overlap with locust control operations in eastern Australia","227874563":"Cosmogenic 21Ne analysis of individual detrital grains: Opportunities and Limitations","288824225":"A simplified analytical approach for coupled injection of colloidal silica with time dependent properties","232957813":"POMI: A Model Intercomparison exercise over the Po valley","228300544":"Intangibles, Buy-Sell Spread and the Book to Market Ratio: Some Evidence from the Johannesburg Stock Exchange","278313523":"Drug Metabolism Prediction","31103869":"\"LAND-WATER.\"","251647061":"Methods for assessing costs and effects of antiretroviral therapies in HIV: The impact of using an extended study period","274344689":"TOUGH: Model Use, Calibration, and Validation","3885718":"Intelligent management of processes in a ICU telemedicine system","264639860":"Testing for ontological errors in probabilistic forecasting models of natural systems","226793264":"Come play","235959461":"Spatio-temporal Mechanistic Modeling of Hydrodynamic, Transport, and Phosphorus Cycling Processes in Large-scale Constructed Treatment Wetlands","229713673":"The Sociology of the Future: Tracing Stories of Technology and Time","47413355":"Upscaling Sorption/Desorption Processes in Reactive Transport Models To Describe Metal/Radionuclide Transport: A Critical Review","252962218":"Climate prediction: a limit to adaptation?","228951839":"Empiricism and model-building in stratigraphy: Around the hermeneutic circle in the pursuit of stratigraphic correlation","240436373":"Mathematical aspects of inverse problems, model calibration, and parameter identification","240436374":"The limits of splitting: Hydrology","223578000":"Implications of ecological data constraints for integrated policy and livelihoods modelling: An example from East Kalimantan, Indonesia","229050211":"Validation of a watershed model without calibration","249603110":"An Experimental Field Dataset with Buoyant, Neutral, and Dense Gas Atmospheric Releases and Model Comparisons in Low-Wind Speed (Diffusion) Conditions","250209326":"Aufschlüsselung statistischer Beziehungen zwischen dem Nadelverlust von Fichten und anderen Informationen dreier Forstmonitoring-Programme Nordrhein-Westfalens | Itemisation of statistical relationships between needle loss in spruce and other information from three forest monitoring programmes in North-Rhine Westphalia","274680469":"A framework to resolve spatio-temporal misalignment in component-based modelling","12352113":"Seven characteristics of medical evidence","228050776":"Integrated Assessment","263300454":"Validation of a Predictive Model for Fish Tissue Mercury Concentrations","225089463":"The Relation between Ozone, NOx and Hydrocarbons in Urban and Polluted Rural Environments","251556897":"Ecology after 100 years: Progress and pseudo-progress","251721186":"Selection of groundwater sites in Egypt, using geographic information systems, for desalination by solar energy in order to reduce greenhouse gases. J Adv Res 3:11-19","248808498":"Role of sospende-sediment particle size in modifying velocity profiles in open canne flows","237487296":"Course Syllabus: GEOG531/EVPP531/CSS643: Land-Use Modeling Techniques and Applications","24337306":"Verification, Validation, and Solution Quality in Computational Physics: CFD Methods Applied to Ice Sheet Physics","223172513":"Description and test of a simple process-based model of forest growth for mixed-species stands. Ecol Model","248796217":"Use of microwave brightness temperatures with a general circulation model","229390147":"Development and study of metal foam heat-exchanging tubular reactor: Catalytic combustion of methane combined with methane steam reforming","264586549":"Topmodel: A Critique","273144503":"Evaluation of the Current State of Distributed Watershed Nutrient Water Quality Modeling","235984098":"Assessment of modelling protocols\u0027 application in papers about rainfall-runoff modelling","223250362":"An Integrated Assessment Modeling Tool","225183641":"Towards a public, standardized, diagnostic benchmarking system for land surface models","260314481":"Overcoming the challenges of data scarcity in mapping marine ecosystem service potential","259892613":"Validation and Calibration of Models for Reaction-Diffusion Systems","236147947":"Can simple phosphorus mass balance models guide management decisions? A case study in the Bay of Quinte, Ontario, Canada","225142679":"Separating spatial and temporal sources of variation for model testing in precision agriculture","274680483":"Sensitivity analysis for comparison, validation and physical legitimacy of neural network-based hydrological models","51406865":"Effects of external loads on balance control during upright stance: Experimental results and model-based predictions","248493513":"Flood hazard science, policy, and values: A pragmatist stance","235656461":"DGVM responses to the latest IPCC future climate scenarios.","222582349":"Integrated assessment of ecosystem-scale carrying capacity in shelfish growing areas","227604121":"Reconciling Theory with Observations: Elements of a Diagnostic Approach to Model Evaluation","32045799":"Electron pairs shed light on frustrated percolation","222697040":"Coupled processes in rock mass performance with emphasis on nuclear waste isolation","228542083":"Fluvial aggradation in Vedder River, British Columbia: testing a one-dimensional sedimentation model","228697790":"Seasonal water flow trends in conjunction with phytoplankton biovolume in Phetchaburi River, Thailand","222885482":"Reactive transport modelling in fractured rock: a state-of-the-science review. Earth-Sci Rev","258757710":"Modeling Subsurface Heterogeneity of Irrigated and Drained Fields. II: Multivariate Stochastic Analysis of Root-Zone Hydrosalinity and Crop Yield","6597453":"Application of a calibration method provides more realistic results for a finite element model of a lumbar spinal segment","3201820":"Raytran: A Monte Carlo ray-tracing model to compute light scattering in three-dimensional heterogeneous media","253215802":"Statistics of ``Synoptic Circulation Weather\u0027\u0027 in the North Sea as Derived from a Multiannual OGCM Simulation","225621570":"Three-dimensional isodyne stress analysis—Present state, trends, theoretical problems","229398173":"The importance of high frequency data in ecological modelling","229570207":"Qualitative modelling and indicators of exploited ecosystems","249140714":"Stunted Growth and Stepwise Die-Off in Animal Cohorts","229774977":"Editorial: Deadening environmental space","236897578":"Star and Linear Dunes on Mars","239928699":"Validating Models of Ecosystem Response to Global Change","237761810":"Gesellschaft als Kontext für Forschung","227677864":"Knowledge, uncertainty and physical geography: Towards the development of methodologies for questioning belief","34523443":"A Simulation Model of Wood Dynamics in Pacific Northwest Streams","3885828":"The measurement of three dimensional dose distribution of a ruthenium-106 ophthalmological applicator using magnetic resonance imaging of BANG polymer gels","261297360":"A finite volume method designed for error analysis","7334692":"Application of a new calibration method for a three-dimensional finite element model of a human lumbar annulus fibrosus","230426352":"Comparison of the prediction efficiency of two pedotransfer functions for soil cation‐exchange capacity","40106287":"Quality Assurance of the modelling process","250078633":"Quantifying foodweb interactions with simultaneous linear equations: Stable isotope models of the Truckee River, USA","283290541":"Protection of Groundwater Resources: Worldwide Regulations and Scientific Approaches","251667536":"Understanding and misunderstanding computer simulation: The case of atmospheric and climate science—An introduction","236873038":"Modeling nutrient retention at the watershed scale: Does small stream research apply to the whole river network?","283503542":"A scenario discovery study of the impact of uncertainties in the global container transport system on European ports","280558575":"Climate Change and Wheat Production in Pakistan: Calibration, Validation and Application of CERES-Wheat Model","228050637":"Philosophy of Earth Science","272296801":"Future agriculture with minimized phosphorus losses to waters: Research needs and direction","254858349":"A methodology for validation of integrated systems models with an application to coastal-zone management in South-West Sulawesi","242332975":"Perspectives to Performance of Environment and Health Assessments and Models-From Outputs to Outcomes?","253129846":"Results of modelling and mapping of critical loads of lead, cadmium and mercury and critical concentrations of mercury in precipitation and their exceedances in Europe","250144136":"Evaluating the Predictive and Explanatory Value of Atmospheric Numerical Models: Between Relativism and Objectivism","236262770":"Comparison of aquifer characterization approaches through steady state groundwater model validation: A controlled laboratory sandbox study","270166898":"Sediment Trend Analysis (STA ® ): Kinematic vs . Dynamic Modeling","271739738":"Simulation as Narrative: Contingency, Dialogics, and the Modeling Conundrum","223159844":"On the validation of high-resolution atmospheric mesoscale models","248497573":"Predictions and policy decisions","251229587":"Modeling postbreakup landscape development and denudational history of the Southeast African (Drakensberg Escarpment) margin","11656157":"Validating a model that predicts daily growth and feed quality of New Zealand dairy pastures","224011819":"Models, data mechanisms: Quantifying wildfire regimes","255591503":"The effect of Family Inertia on the Value Creation Process in Family Firms: New Insights from a Simulation Study1","11590596":"Application of an ecosystem model for ecological risk assessment of chemicals for a Japanese lake","227636969":"Sharp Interface Models of Salt Water Intrusion and Wellhead Delineation on Nantucket Island, Massachusetts","222164549":"Validation of a dynamic stem diameter variation model and the resulting seasonal changes in calibrated parameter values","256939050":"Project APhiD: A Lorenz-gauged A-ΦΦ decomposition for parallelized computation of ultra-broadband electromagnetic induction in a fully heterogeneous Earth","285674106":"Morphological impact of a storm can be predicted three days ahead","2538406":"On the Limits of Bottom-Up Computer Simulation: Towards a Nonlinear Modeling Culture","227993108":"Modeling the Dynamics of Stable‐Isotope Ratios for Ecosystem Biogeochemistry","264631367":"Simulating Population Genetics of Pathogen Vectors in Changing Landscapes: Guidelines and Application with Triatoma brasiliensis","222426821":"The data-based mechanistic approach to the modelling, forecasting and control of environmental systems","222410437":"Parameter estimation in flow through partially saturated porous materials","247940427":"A transport-distance approach to scaling erosion rates: 3. Evaluating scaling characteristics of MAHLERAN","37456309":"Comparing Two Methods for Addressing Uncertainty in Risk Assessments","229574207":"Further perspectives on the evolution of bed material waves in alluvial rivers","252376219":"Geological Models","7900137":"\"Extracting clinically relevant data from finite element simulations Clin,\"","223889098":"Does a Large Number of Parameters Enhance Model Performance? Comparative Assessment of Common Catchment Model Structures on 429 Catchments","285698707":"AUC: A misleading measure of the performance of predictive distribution models","265049176":"R Software Intensive Science","282495808":"Semianalytical solutions for transport in aquifer and fractured clay matrix system","264668254":"Towards multi-system sociotechnical transitions: why simulate","259634405":"Towards a diagnostic approach to climate adaptation for fisheries","242079219":"Validation, Verification, and Calibration: Using Standardized Terminology When Describing Ecological Models1","227161621":"Policy and global change research","248018284":"Skill and uncertainty in climate models","249722181":"Soothsaying or Science?: Falsification, Uncertainty and Social Change in Macroeconomic Modelling","266372169":"4 Limitations on Predictive Modeling in Geomorphology","228009531":"Physics-Based Hydrologic-Response Simulation: Seeing Through the Fog of Equifinality","230934127":"Understanding Risk: Informing Risk in a Democratic Society","45377817":"Testing numerical models in geomorphology: How can we ensure critical use of model predictions?","282119011":"GENIE Version 2, A General Model-Independent TCP/IP Run Manager","228476457":"Small-scale variability and model error in tropical Pacific sea level","285547198":"Hybridizable discontinuous Galerkin projection methods for Navier-Stokes and Boussinesq equations","251307334":"Mathematical Modeling of Beach Behavior Doesn\u0027t Work","223622805":"Criteria for Publishing Papers on Crop Modelling","258397358":"Generalized Likelihood Uncertainty Estimation Method in Uncertainty Analysis of Numerical Eutrophication Models: Take BLOOM as an Example","276327346":"Scoring and Testing Procedures Devoted to Probabilistic Seismic Hazard Assessment","282151709":"Toward a transparent and consistent quality control procedure for tree biomass allometric equations","271993851":"Validation of simulation models","276413364":"A review of performance criteria to validate simulation models","6257553":"‘Probabilistic Climate Forecasts and Inductive Problems.’","225986220":"Adjusting to Policy Expectations in Climate Change Modeling","44579197":"Growth and Inequality: Model . . .","238396899":"A Simplified Basin Model For Simulating Runoff: The Struma River GIS","242357672":"AN EXPERIMENTAL EXAMINATION OF CULTURE AND DYNAMIC CAPABILITIES: INSIGHTS FROM A SIMULATION STUDY ON FAMILY FIRMS","237680113":"Prediction of the Impact of Increasing Frequency of Bushfire on the Water Resources of the Forested Upland","229045882":"Permeability within basaltic ocean crust","231290391":"Modeling Non-point Source Pollutants in the Vadose Zone With GIS","226592350":"Assessing ecological implications of climatic change: Can we rely on our simulation models?","223639221":"Belowground processes in forest-ecosystem biogeochemical simulation models","7080846":"Simulation as experiment: A philosophical reassessment for biological modeling","23788173":"Regulatory Models and the Environment: Practice, Pitfalls, and Prospects","245409098":"Hydrodynamic modelling in support of flash flood warning","276114306":"On the credibility of engineering models and meta-models","12344134":"Evaluating and Managing Cumulative Effects: Process and Constraints.","27351646":"Process-based modelling of turbidity-current hydrodynamics and sedimentation","222347588":"Modeling for ecosystem management in Minnesota pine forests","223588697":"Shallow water hydrodynamic models for hyperconcentrated sediment-laden floods over erodible bed","221790516":"How Does Subsurface Characterization Affect Simulations of Hyporheic Exchange?","252424987":"Defensible Methods Of Assessing Fish Habitat: Lacustrine Habitats In The Great Lakes Basin - Conceptual Basis And Approach Using A Habitat Suitability Matrix (HSM) Method","233492976":"Testing the performance of a forest ecosystem model (FORECAST) against 29 years of field data in a Pseudotsuga menziesii plantation","253702975":"Fluid flow in metamorphic environments","7601242":"Performance assessment model development and parameter acquisition for analysis of the transport of natural radionuclides in a Mediterranean watershed","257885044":"Population level risk assessment: Practical considerations for evaluation of population models from a risk assessor\u0027s perspective","222646634":"Single Species Conservation in a Multispecies Fishery: The Case of the Australian Eastern Gemfish","227500479":"Effect of Expert Opinion on the Predictive Ability of Environmental Models of Bird Distribution","239592054":"NORTHERN BOBWHITE ABUNDANCE IN RELATION TO CLIMATE, WEATHER, AND LAND USE IN ARID AND SEMIARID AREAS: A NEURAL NETWORK APPROACH","277146805":"A Spatially-Explicit Framework for Investigating Patchiness in Aquatic Ecosystems","277028027":"Prediction under uncertainty as a boundary problem: A general formulation using Iterative Closed Question Modelling","230760836":"Evaluating RSFs","229040620":"Don\u0027t stop \u0027til you get enough–sensitivity testing of Monte Carlo iterations for model calibration","26897876":"An integrated approach to predict ettringite formation in sulfate soils and identifying sulfate damage along SH 130","252109640":"Advances in Social Computing","225345825":"A systems-based framework for managing leaking underground fuel tank sites","250270395":"Simulation Analysis of Crop Rotation Effects on Weed Seedbanks","251986769":"Development of a dual robotic arm system to evaluate intelligent system for advanced construction machinery","268342185":"Uncertainty in Model Predictions–Plausible Outcomes from Estimates of Input Ranges","251519658":"Tradeoffs between economic and ecosystem services in Argentina during 50 years of land-use change. Agric Ecosyst Environ, 154: 68-77","200472490":"TOPMODEL: A critique","2174073":"Celebrating the Physics in Geophysics","228544965":"HORMESIS IN PRECAUTIONARY REGULATORY CULTURE","268178337":"Informing Indicators for Sustainable Development","11287754":"Sensitivity Analysis for Importance Assessment,\u0027\u0027","264274854":"Ontology Spectrum for Geological Data Interoperability. PhD Dissertation","277810406":"Fusion of Tomography Tests for DNAPL Source Zone Characterization: Technology Development and Validation","231281063":"Critical Loads of Metals and Other Trace Elements to Terrestrial Environments","263566279":"Radicalization under deep uncertainty: A multi-model exploration of activism, extremism, and terrorism","237036116":"Modelos de simulación para la elaboración y evaluación de los programas de servicios ambientales hídricos","254886726":"Communicating uncertainty in spatial decision support systems - a case study of bioenergy-crop potentials in Mozambique","233746837":"Mesoscale fluvial erosion parameters deduced from modeling the Mediterranean sea level drop during the Messinian (late Miocene)","2583714":"The Effect Of Randomly Spaced Observations On Field Forecast Error Scores","237290147":"Quantification Makes Sense Even When Empirical Data Is Limited - A Model of the Bhopal Crisis","38108876":"HESS Opinions \"Crash tests for a standardized evaluation of hydrological models\"","229368121":"Simulation of the effect of irrigation on the hydrologic cycle in the highly cultivated Yellow River Basin","226353636":"Integrating Multiple Spatial Controls and Temporal Sampling Schemes To Explore Short- and Long-Term Ecosystem Response to Fire in an Everglades Wetland","248771145":"Towards a Coherent Philosophy for Modeling the Environment","13790287":"The Importance of Anatomical Realism for Validation of Physiological Models of Disposition of Inhaled Toxicants","237519496":"Perspectives of Research Into the Human Dimension of Global Change","222814694":"Does hydrological connectivity improve modeling of coarse sediment delivery in upland environment?","223048169":"A test and application of the model ForNBM in a northeastern Ontario jack pine (Pinus banksiana lamb.) stand","222953966":"Error quantification of a high-resolution coupled hydrodynamic-ecosystem coastal-ocean model: Part 2. Chlorophyll-a, nutrients and SPM","227672375":"A quantitative review of ecosystem service studies: Approaches, shortcoming and the road ahead","46636652":"Analysis of Field Data of Coastal Morphological Evolution over Yearly and Decadal Timescales. Part 2: Non-Linear Techniques","265532287":"A study of hydrodynamic mass-consistent models","7355584":"Development of a Dynamic Aquatic Model (DynA Model): Estimating Temporal Emissions of DDT to Lake Maggiore (N. Italy)","257807340":"Selective Ignorance and Multiple Scales in Biology: Deciding on Criteria for Model Utility","251257423":"Models for the marine environment","51949476":"Contaminant remediation decision analysis using information gap theory","262214428":"Analyzing ranch profitability from varying cow sales and heifer replacement rates for beef cow-calf production using system dynamics","200472397":"The impact of climate change on spatially varying groundwater recharge in the grand river watershed (Ontario)","232608030":"Towards a comprehensive assessment of model structural adequacy","230158707":"‘Truth or Consequences’ for the practicing hydrologist: on scientific certainty and ethics","210182208":"Into Complexity: A Pattern-oriented Approach to Stakeholder Communications","222491019":"Evaluating forest growth models","241455785":"Workshop on Modeling the Southern Ocean Ecosystem","237765346":"Hydrological Modelling and River Basin Management Doctoral Thesis","12045410":"Simulated Limnological Effects of the Shasta Lake Temperature Control Device","226210222":"Multiple Point Metrics to Assess Categorical Variable Models","227234129":"Analysis of factors regulating ecosystemdevelopment on Mauna Loa using the Century model","226574683":"Uncertainty in Integrated Assessment Modelling: A Labyrinthic Path","227541325":"Hydrological aspects of meteorological verification","237707977":"SARF012 Assimilative Capacity Models incomplete Milestone 5 report on the ACExR and LESV models","227447146":"Validation in Simulation: Various Positions in the Philosophy of Science","200472350":"Parameterization, Calibration, and Validation of Distributed Hydrological Models","265556792":"Simulation based calibration using extended balanced empirical likelihood","12786734":"Enzymes, Energy, and the Environment: A Strategic Perspective on the U.S. Department of Energy\u0027s Research and Development Activities for Bioethanol","226034057":"Sustainable Health Risk Management and the Role of Cross-Disciplinary Professionals in Developing Countries: Mexican Experience","229560668":"GIS Modeling of an Accelerated Rate of Sea Level Rise on Coastal Inlets and Deeply Embayed Shorelines","265757475":"CHOOSING STREAMS FOR SEA LAMPREY CONTROL: USING ALTERNATIVE MODELS OF METAMORPHOSIS TO OPTIMIZE THE STREAM SELECTION PROCESS","229749062":"Numerical Models of Groundwater Flow and Transport","268301060":"The Computation of Nature, Or: Does the Computer Drive Science and Technology?","267227885":"The critique of modeling and what sensitivity analysis has to do with it","242393968":"Environment and Planning B: Planning and Design 2007, volume 34, pages 245^260","234164478":"Methological developments in geophysical assimilation modeling","277675399":"Hierarchical Sensor Placement Using Joint Entropy and the Effect of Modeling Error","200472318":"Ignorance Is Bliss: Or Seven Reasons Not to Use Uncertainty Analysis","256938588":"Benchmark hydrogeophysical data from a physical seismic model","238166847":"Guest editorial: The role of sensitivity analysis in the corroboration of models and itslink to model structural and parametric uncertainty","220164112":"Error handling strategies in multiphase inverse modeling","223404101":"Identification and classification of uncertainties in the application of environmental models","258724477":"Assessment of hydrological model predictive ability given multiple conceptual geological models","235569938":"Assessing the effect of initial vapor-phase concentrations on inhalation risks of disinfection-by-products (DBP) in multi-use shower facilities","249623547":"The Everyday World of Simulation Modeling","279666103":"Prospects for large-scale financial systems simulation","259129938":"Relevant model complexity for non-charring polymer pyrolysis. Fire Saf J 61:36-44, ISSN 0379-7112","267928284":"What has been accomplished twenty years after the Oreskes et al. (1994) critique? Current state and future perspectives of environmental modeling in the Great Lakes","226775201":"Ecosystem Integrity and Sustainability: The Foundational Value of the Wild","237732621":"Towards an Alternative Blueprint for a Physically Based Digitally Simulated Hydrologic Response Modeling System","254853655":"Impact of toxicants on species composition of aquatic communities : concordance of predictions and field","222470249":"Misuse of regression for empirical validation of models","260309679":"An assessment of key model parametric uncertainties in projections of Greenland Ice Sheet behavior","265077472":"RIVER HYDRO-AND MORPHODYNAMICS: RESTORATION, MODELING, AND UNCERTAINTY by","227672227":"Problem‐Dependence of Ground‐Water Model Identification: Significance, Extent, and Treatment","272239885":"A calibration procedure for two-dimensional laboratory-scale hybrid finite–discrete element simulations","228483239":"Long-term nutrient cycling patterns in Douglas-fir and red alder stands: a simulation study. For Ecol Manage","265061004":"WATER DATA MANAGEMENT SYSTEMS INTEGRATIONS WITH MODELS by","256176642":"Imagine complexity: The past, present and future potential of complex thinking","234819765":"Short Note: Nonmonotone chemotactic invasion: High-resolution simulations, phase plane analysis and new benchmark problems","227201217":"Evaluating Integrated Assessment Tools for Policy Support","229417185":"A Bayesian synthesis of predictions from different models for setting water quality criteria","257110531":"Traditional and novel approaches to palaeoclimate modelling","258662975":"Objective calibration of regional climate models","231366803":"Life Cycle Regulation of Transportation Fuels: Uncertainty and its Policy Implications","230142188":"Modeling carbon dynamics in subsoils using simple models","252609135":"DATA-BASED MECHANISTIC MODELLING OF ENVIRONMENTAL SYSTEMS","241885963":"Groundwater System Identification through Time Series Analysis","269372783":"Applying the delta tool to support the Air Quality Directive: evaluation of the TCAM chemical transport model","248153006":"Estimación de la conductividad hidráulica usando análisis granulométricos, ensayos de acuíferos y modelación numérica en un sistema ribereño aluvial en Corea del Sur","240489264":"Reply [to “Comment on ‘Helium Isotope Fluxes and Groundwater Ages in the Dogger Aquifer, Paris Basin’ by B. Marty, T. Torgersen, V. Meynier, R. K. O\u0027Nions, and G. de Marsily”]","7859472":"Contaminant transport models under random sources","42373098":"Structuring expert input for a knowledge-based approach to watershed condition assessment for the Northwest Forest Plan. USA. Environ Monit Assess","257479221":"An assessment of optimal waste load allocation and assimilation characteristics in the Arroyo Colorado River watershed, TX along the US–Mexico border","7134466":"Looking for a general for some modern major models","11234778":"Quantitative Assessment of Agricultural Runoff and Soil Erosion Using Mathematical Modeling","259047938":"Effects of global change on carbon storage in tropical forests of South America","254865986":"Microbial Experimental Systems in Ecology","275725595":"A Well-Balanced and Fully Coupled Noncapacity Model for Dam-Break Flooding","256197181":"What Is the True Value of Forecasts?","40099611":"Critical loads of metals and other trace elements to terrestrial environments.","238756675":"Scope paper Scope of and Scientific Framework for the CALCAS Concerted Action - Final Version Deliverable 1 of work Package 2 of the CALCAS project","223871013":"Slip distributions on intersecting normal faults. J Struct Geol 21:259e271","235414390":"Discontinuous Steady-State Analytical Solutions of the Boussinesq Equation and Their Numerical Representation by Modflow","242349041":"Introducing a transdisciplinary approach in studies regarding risk assessment and management in educational programs for environmental engineers and planners","237794221":"SEASONAL AND INTER-ANNUAL CLIMATE FORECASTING: THE NEW TOOL FOR INCREASING PREPAREDNESS TO CLIMATE VARIABILITY AND CHANGE IN AGRICULTURAL","226230525":"Water quality modeling for environmental management: Lessons from the policy sciences","225374444":"Uncertainty: Climate Models at Their Limit?","285596800":"Supporting the adoption of smart grid appliances in city districts - A quantitative evaluation of policy options using agent-based modelling and scenario discovery","258331369":"Validating the Prediction of Unobserved Quantities","260698628":"The Meaning of Models","245371694":"Controversy Associated With the So-Called ``Follower Forces\u0027\u0027: Critical Overview","268157557":"Resolving the gap between laboratory and field rates of feldspar weathering","248808260":"On a test case for density-dependent groundwater flow and solute transport models: The Salt Lake Problem","222519505":"Evaluating Resource Selection Functions","222163114":"Estimation of model parameters in nonlocal damage theories by inverse analysis techniques","3202474":"Snow crystal orientation effects on the scattering of passive microwave radiation","222523615":"Theoretical analysis of the worthiness of Henry and Elder problems as benchmarks of density-dependent groundwater flow models","228687932":"The limits of simplicity: toward geocomputational honesty in urban modeling","26450957":"Ozone production and hydrocarbon reactivity in Hong Kong, Southern China","220725384":"Virtual Science: Virutality and Knowledge Acquisition in Science and Cognition.","240636918":"Citation: Burgman, M. \u0026 Possingham, H. P. 2000. Population viability analysis for conservation: the good, the bad and the undescribed. Pages 97-112 in: Genetics, Demography and Viability of Fragmented Populations. Eds Young, A.G \u0026 Clarke, G.M","229351427":"Models of low temperature and high irradiance and their application to explaining the risk of seedling mortality","237732742":"The Australian water resources assessment system","226218185":"Assessing integrated assessments","229748739":"Constructing climate knowledge with computer models","252678843":"Reactive Solute Transport in Streams: 2. Simulation of a p H Modification Experiment","32894016":"The third RAdiation transfer Model Intercomparison (RAMI) exercise: documenting progress in canopy reflectance modelling. J. Geophys. Res. 112 (D9):D09111","274271724":"Application of an Urban Fire Simulation Model","282217834":"!!!papaer end","225419476":"A sociological approach to the state of stochastic hydrogeology","263655945":"Benefits of the use of natural user interfaces in water simulations","258724527":"Alam, M. J., and J. L. Goodall. Toward disentangling the effect of hydrologic and nitrogen source changes from 1992 to 2001 on incremental nitrogen held in the contiguous United States. Water Resources Research","222486663":"Testing ecological models: the meaning of validation. Ecol Model","272375291":"In silico science for climate policy: How policy-makers process and use carbon storage simulation data","227278914":"Modelling pesticides transfer to surface water at the catchment scale: A multi-criteria analysis","11205989":"Biomechanics or necromechanics? Or how to interpret biomechanical studies.","238244860":"Hybrid Approach for Addressing Uncertainty in Risk Assessments","262812261":"The Flash Environmental Assessment Tool: Worldwide first aid for chemical accidents response, pro action, prevention and preparedness","239555479":"\"TO BE OR NOT TO BE? THAT IS (NOT) THE QUESTION\": COMPLEXITY THEORY AND THE NEED FOR CRITICAL THINKING","253686479":"The prospects for governing biotechnology in Canada","273636765":"Dealing with Uncertainty in Agent-Based Simulation: Farm-Level Modeling of Adaptation to Climate Change in Southwest Germany","239788953":"The use of complexity-based models in international relations: A technical overview and discussion of prospects and challenges","252555993":"Downscaling European species atlas distributions to a finer resolution","9088339":"The fluxes and transformations of suspended particles, carbon and nitrogen in the Humber estuarine system (UK) from 1994 to 1996: Results from an integrated observation and modelling study","225394866":"Underdetermination, Model-ensembles and Surprises: On the Epistemology of Scenario-analysis in Climatology","9088340":"Modelling solute transport in the Tweed Estuary, UK using ECoS","226934873":"Recommended practices in global sensitivity analysis","36200392":"The ends of uncertainty : air quality science and planning in Central California /","221896920":"Navigating the Perfect Storm: Research Strategies for Socialecological Systems in a Rapidly Evolving World","233529347":"Review of the effects of protection in marine protected areas: Current knowledge and gaps","248992574":"High‐level radioactive waste management in the USA","291257520":"Geographische Informationssysteme (GIS) und raumbezogene Prozeßmodellierung in der Angewandten Landschaftsökologie","258724486":"A hypothesis-driven approach to optimize field campaigns","287464658":"Ontologies in Modeling and Simulation: An Epistemological Perspective","235712525":"Hypothesis Testing for Validation and Certification","236314644":"Validation and Ranking Methodologies for Solar Radiation Models","241098847":"Evaluation of the objective functions to improve production history matching performance based on fluid flow behaviour in reservoirs","40111200":"A portfolio approach to analyzing complex human-environment interactions: Institutions and land change","223740753":"Chapter Eighteen Uncertainty and Sensitivity Issues in Process-based Models of Carbon and Nitrogen Cycles in Terrestrial Ecosystems","270052873":"Quantifying the economic importance of irrigation water reuse in a Chilean watershed using an integrated agent-based model","284131070":"Modelling systemic change in coupled socio-environmental systems","240410695":"Use of objective criteria for the assessment of biogeochemical ecosystem models","235192343":"Viscous Effects in Pore Scale Modeling of Immiscible Fluid Flow Through Porous Media","222143272":"A qualitative simulation model for cotton growth and development","254824745":"Essays on integrated modelling with applications to marine ecosystem management","223875911":"Modeling the response of river systems to environmental change: Progress, problems and prospects for palaeo-environmental reconstructions","257913215":"BALTSEM—A marine model for the decision support within the Baltic Sea Region","223949688":"A new method for assessing the sustainability of land-use systems (I): Identifying the relevant issues, Ecol. Econ. 68, 1275-1287","265433589":"AVIAN-LOCUST INTERACTIONS IN EASTERN AUSTRALIA AND THE EXPOSURE OF BIRDS TO LOCUST CONTROL PESTICIDES","233796550":"The rapid disintegration of projections: The West Antarctic Ice Sheet and the Intergovernmental Panel on Climate Change","242384984":"Information Technology, Science, and Public Policy A dissertation submitted in partial fulfillment of the requirements for the degree of Doctor of Philosophy at George Mason University","2268686":"Computers, Reasoning and Mathematical Practice","227234747":"Applicative limitations of sediment transport on predictive modeling in geomorphology","265470437":"Uniformitarianism, earth system science, and geology","26816416":"Extension of sensitivity and uncertainty analysis for long term dose assessment of high level nuclear waste disposal sites to uncertainties in the human behaviour","226866116":"Seasonal and Inter-Annual Climate Forecasting: The New Tool for Increasing Preparedness to Climate Variability and Change In Agricultural Planning And Operations","240906268":"Hochwasserrisikoanalysen: Unsicherheiten und Validierung","232743832":"A Generalized Polynomial Chaos-Based Method for Efficient Bayesian\nCalibration of Uncertain Computational Models","6143509":"Regional Air Quality: Local and Interstate Impacts of NO x and SO 2 Emissions on Ozone and Fine Particulate Matter in the Eastern United States","25100087":"Response To Commentators.","229196775":"On the Use of Demographic Models of Population Viability in Endangered Species Management","227005385":"Large-eddy simulation of pyroclastic density currents","222835472":"Catastrophic Regime Shifts in Ecosystems: Linking Theory to Observation","236847175":"Distributed Hydrological Modelling","256684309":"Knowledge Infrastructures: Intellectual Frameworks and Research Challenges","260420063":"Applying Cellular Automata for Simulating and Assessing Urban Growth Scenario Based in Nairobi, Kenya","200557999":"An Analysis of the History of Marine Animal Diversity","277704406":"Agent-Based Urban Modeling: Simulating Urban Growth and Subsequent Landscape Change in Suzhou, China","253714814":"SIMULATION SUPPORTING THE MANAGEMENT OF SURGICAL WAITING LISTS","14274225":"The NIEHS Predictive-Toxicology Evaluation project","281521839":"A Study of Permeability Changes Due to Cold Fluid Circulation in Fractured Geothermal Reservoirs","258310414":"Towards an inventory of methane emissions from manure management that is responsive to changes on Canadian farms","286932843":"Situated with Infrastructures: Interactivity and Entanglement in Sensor Data Interpretation.","277868284":"A Plant Process Economic Model for Weed Management Decisions in Irrigated Onion","49634438":"A synergic simulation-optimization approach for analyzing biomolecular dynamics in living organisms","4746800":"Some issues in the design of agricultural Decision Support Systems","259080457":"Statistical downscaling of daily temperatures in the NW Iberian Peninsula from global climate models: Validation and future scenarios","242429962":"NOTE: this PDF version does not reproduce original pagination","274013740":"Practical Use of Computationally Frugal Model Analysis Methods: M.C. Hill et al. Ground Water xx, no. x: xx-xx","228836313":"A framework for classifying and comparing distributed hillslope and catchment hydrologic models","263905728":"The emerging challenge: The validity of computational organization model and methodology","255590845":"Solid Earth deformation and gravity changes due to surface loading: Status and scientific problems","236314775":"SMARTS, A Simple Model of the Atmospheric Radiative Transfer of Sunshine: Algorithms and Performance Assessment","222204860":"Reliability and input-data induced uncertainty of the EPIC model to estimate climate change impact on sorghum yields in the U.S. Great Plains","227644181":"Multi‐Agent Systems for the Simulation of Land‐Use and Land‐Cover Change: A Review","49757296":"Bad ecology leads to bad public policy","36445348":"VARIETIES OF POSSIBILITY: HOW ITERATED MODALITIES SOLVE A METHODOLOGICAL DILEMMA OF SIMULATING UNDER UNCERTAINTY","46668866":"A Method for the Analysis of Assumptions in Assessments Applied to Two Indicators in the Fifth Dutch Environmental Outlook","290119616":"EURORISK/PREVIEW Report on the technical quality, functional quality and forecast value of meteorological and hydrological forecasts","223429594":"Evaluation of photochemical grid models (UAM-IV, UAM-V, and the ROM/UAM-IV couple) using data from the lake michigan ozone study (LMOS)","265433439":"Methods And Techniques for Rigorous Model Calibration Methods And Techniques for Rigorous Calibration of a Cellular Automaton Model of Urban Growth","242712807":"A Semi-Lagrangian Water Temperature Model for Rivers and Reservoirs 1","266047819":"Calculation of zinc transport in a soil contaminated by a brass foundry","255275430":"Remediation of the Faultless Underground Nuclear Test: Moving Forward in the Face of Model Uncertainty","222688211":"On the sudden disappearance of Egeria densa from a Ramsar wetland site of Southern Chile: A climatic event trigger model","3641007":"Scenario planning, the interpretation of uncertainty andvalue-focused decision making: a case study of a radioactive waste siteremediation","222122917":"A Multi-Model Framework for Simulating Wildlife Population Response to Land-Use and Climate Change","225469417":"Uncertainty from Model Calibration: Applying a New Method to Transport Energy Demand Modelling","223237079":"Morphology and kinematic of a very large, deep-seated structural rock slide located in the Fusch Valley, Eastern Alps, Austria","276365016":"Context-oriented model validation of individual-based models in ecology: A hierarchically structured approach to validate qualitative, compositional and quantitative characteristics","236904638":"Early abyssal- and late SSZ-type vestiges of the Rheic oceanic mantle in the Variscan basement of the Sakarya Zone, NE Turkey: Implications for the sense of subduction and opening of the Paleotethys","226517797":"Modeling urban landscape dynamics: A case study in Phoenix, USA","232883019":"What Is Complexity Science? Toward an \"Ecology of Ignorance\"","42441772":"A Management Tool for Assessing Aquaculture Environmental Impacts in Chilean Patagonian Fjords: Integrating Hydrodynamic and Pellets Dispersion Models","230126363":"Approaches to Modelling Long‐term Landscape Evolution: Lessons from Ice Sheet Modelling","23539671":"Complexity theory in the study of space and place","222700535":"Evaluation of Ecological Network Analysis: Validation of Output","229077780":"A Bayesian synthesis inversion of carbon cycle observations: How do observations reduce uncertainties about future sinks?","2793105":"Route Learning in Mobile Robots through Self-Organisation","238710919":"4 USE OF NUMERICAL MODELS TO SIMULATE GROUNDWATER FLOW AND TRANSPORT","221950855":"Modeling longitudinal-profile development in response to Late Quaternary tectonics, climate and sea-level changes: The River Meuse","251465795":"Chapter 4.0 A review of uncertainty and sensitivity analyses of atmospheric transport and dispersion models","220607457":"Modeling Reality","222409615":"Calibration, validation, and sensitivity analysis: What\u0027s what","24194978":"Evaluation of the difference of eight model applications to assess diffuse annual nutrient losses from agricultural land","234242850":"Lateral Turbulence Intensity and Plume Meandering During Stable Conditions","271634157":"Cooling of Shell Eggs with Cryogenic Carbon Dioxide: a Finite Element Analysis of Heat Transfer","237736140":"Numerical modelling of remedial actions for a uranium mill tailings in Spain: from model construction to predicting uncertainties","223835056":"Mental model mapping as a new tool to analyse the use of information in decision-making in integrated water management","7671442":"Joint contact stress: A reasonable surrogate for biological processes?","270495476":"Will tree species experience increased frost damage due to climate change because of changes in leaf phenology?","6917791":"Strength of evidence for density dependence in abundance time series of 1198 species. Ecology","232469281":"Read-React-Respond: An Integrative Model for Understanding Sexual Revictimization","234779397":"Impacts of disturbance on the terrestrial carbon budget of North America","40795280":"Effective approaches for predicting environmental concentrations of pesticides: the APECOP project","223916634":"The next generation of integrated air quality modeling: EPA\u0027s Models-3","251425272":"Influence of subcritical fracture growth on the connectivity of fracture networks","236118294":"The Joy of Interactive Modelling","254201889":"Draft Guidance on the Development, Evaluation, and Application of Regulatory Environmental Models","228524693":"The application of COSMIC data to global change research","261030019":"The assimilation of satellite-derived data into a one-dimensional lower trophic level marine ecosystem model","258658404":"A mechanistic ecohydrological model to investigate complex interactions in cold and warm water-controlled environments: 2. Spatiotemporal analyses","228700849":"Yucca Mountain: Earth-Science Issues at a Geologic Repository for High-Level Nuclear Waste","236335367":"The Fallacy of Ratios and the Testability of Models in Biology","227730054":"Martínez-Meyer E, Peterson AT, Hargrove WW.. Ecological niches as stable distributional constraints on mammal species, with implications for Pleistocene extinctions and climate change projections for biodiversity. Global Ecol Biogeogr 13: 305-314","229745319":"Comparing the performance of 2-D finite element and finite volume models of floodplain inundation using airborne ASAR imagery","232534722":"From home range dynamics to population cycles: Validation and realism of a common vole population model for pesticide risk assessment","249606655":"Sensitivity of Regional Oxidant Model Predictions to Prognostic and Diagnostic Meteorological Fields","228934276":"Assessing the Degree of Unsteadiness in Flow Modeling: From Physics to Numerical Solution","278183861":"Model Relevance Frameworks for Exploring the Complexity-Sensitivity-Uncertainty Trilemma","251437535":"Three-dimensional seismic models of the Earth\u0027s mantle","232956615":"Treatise on Estuarine and Coastal Science","237175051":"Numerical modelling of the Laurentide Ice Sheet in the Baffin Island region: The role of a Cumberland Sound ice stream","225776221":"The Use of System Dynamics Simulation in Water Resources Management","257130618":"Choice of study area and predictors affect habitat suitability projections, but not the performance of species distribution models of stream biota","251621844":"Ice dynamics near Antarctic marginal mountain ranges: Implications for interpreting the glacial-geological evidence","264909029":"Bolliger EcMod2000","227283646":"Bayesian Hierarchical/Multilevel Models for Inference and Prediction Using Cross-System Lake Data","228909719":"Ettringite Formation in Lime-Treated Soils: Establishing Thermodynamic Foundations for Engineering Practice","222892669":"On the assimilation of uncertain physical knowledge bases: Bayesian and non-Bayesian techniques","249823698":"Prospects for the open treatment of uncertainty in environmental research","259661901":"Volcanic activity: Frontiers and challenges in forecasting, prediction and risk assessment","262148248":"Distributed sediment yield modelling: Importance of initial sediment conditions","39730532":"Evaluating a growth model for forest management using continuous forest inventory data","263684237":"Integrated assessment modeling of global climate change: transparent rational tool for policy making or opaque screen hiding value-laden assumptions? Environ Model Assess 2:229-249","245383580":"Accounting for water storage effects in landfill leachate modelling","228926105":"The development of a farming systems model (APSIM) - A disciplined approach","225124950":"Calibration of a Wetlands Rapid Assessment Method: Application of EPA\u0027s Level 1-2-3 Framework for Method Testing and Refinement","264630522":"Evaluation of the WEPP model and digital elevation grid size, for simulation of stream flow and sediment yield in a heterogeneous catchment","266088675":"Challenges and Social Learning at the Climate Science-Policy Interface: The “Long Strange Trip” of the Model Evaluation Consortium for Climate Assessment (MECCA)","225153577":"Introduction: The Coming of the Knowledge Society and the Challenges for the Future of Europe","238764409":"A FIELD AND SIMULATION STUDY OF THE INITIATION PHASE IN DOUGLAS-FIR PLANTATIONS","242774332":"Measurements, Models, and Hypotheses in the Atmospheric Sciences","229008098":"Modeling Environmental Impacts of Urban Expansion: A Systematic Method for Dealing with Uncertainties","2879341":"Modelling Studies on Soil-Mediated Response to Acid Deposition and Climate Variability","29654658":"Statistical Assessment of Numerical Models","251425207":"Transport and retention from single to multiple fractures in crystalline rock at Äspö (Sweden): 2. Fracture network flow and generic retention parameters","222003831":"An acidification model (MAGIC) with organic acids evaluated using whole-catchment manipulations in Norway","225964602":"Alternate corrections for estimating actual wetland evapotranspiration from potential evapotranspiration. Wetlands","3960684":"A comparison of CMOS and BJT RF-LNAs","227910341":"Leaf phenology in 22 North American tree species during the 21st century. Glob Chang Biol","279371772":"Groundwater Flow and Solute-Transport Modeling","50273696":"Modelled encounters with public health risks: how do we predict the \u0027unpredictable\u0027?","232608445":"A Dynamic Bi-orthogonality based Approach for Uncertainty Quantification\nof Stochastic Systems with Discontinuities","240505136":"Decision Rules for Water Resources Management under Uncertainty","225882653":"Fractal fragmentation of rocks within sturzstroms: Insight derived from physical experiments within the ETH geotechnical drum centrifuge","249958794":"Distributed Hydrological Modelling and Application of Remote Sensing Data","235975036":"Modelling of fractured carbonate reservoirs: Outline of a novel technique via a case study from the Molasse Basin, southern Bavaria, Germany","279404490":"Salience, credibility and legitimacy in land use change modeling","266563735":"What good are abstract and what-if models? Lessons from the Gaïa hypothesis","237285714":"This syllabus provides a overview of the timing and content for the 11 \"policy lectures\" of GCCS. Additional readings will be distributed as the term progresses","259690747":"The geographic scaling of biotic interactions","2535330":"Agents with or without Emotions?","45096244":"Ecological Models Supporting Environmental Decision Making: A Strategy for the Future","242258423":"Credulous Modellers and Suspicious Experimentalists? Comparison of Model Output and Data in Meteorological Simulation Modelling","226448119":"Calibration of Large Spatial Models: A Multistage, Multiobjective Optimization Technique","36224420":"Evaluation and Use of Stream Temperature Prediction Models for Instream Flow and Fish Habitat Management","229904952":"Severe drought effects on ecosystem CO2 and H2O fluxes at three Mediterranean evergreen sites: Revision of current hypotheses?","223003358":"Modelling successional patterns of high elevation forests under changing herbivore pressure - responses at the landscape level. For Ecol Manage","259260640":"Guisan A, Zimmermann NE. Predictive habitat distribution models in ecology. Ecological Modeling","226873874":"A Review of Forest Gap Models","259285225":"Evaluation of biospheric components in Earth system models using modern and palaeo observations: the state-of-the-art","13999988":"Microcirculation in pancreatic function","271200142":"Was leisten Klimamodelle?","7872466":"Recent climate change in the Arctic and its impact on contaminant pathways and interpretation of temporal trend data. Sci Total Environ","271650714":"Misconceptions About the Relation Between Plant Growth and Respiration","263049217":"Spatially distributed characterization of hyporheic solute transport during baseflow recession in a headwater mountain stream using electrical geophysical imaging","228327984":"Thinking about knowing: Conceptual foundations for interdisciplinary environmental research","251482448":"929 ROBOT ASSISTED RADICAL PROSTATECTOMY IN PATIENTS WITH A HISTORY OF ENDOSCOPIC TREATMENT FOR BENIGN HYPERPLASIA OF PROSTATE","265179232":"Laboratory research on modeling of the Romanian black sea seashore waves interaction with energy capturing devices","233693763":"Unsicherheiten bei der Erfassung und Modellierung von Wasser-, Stoff- und Energieflüssen im Kontinuum Boden-Pflanze-Atmosphäre","248820068":"Predicting Climate Change: Lessons From Reductionism, Emergence, and the Past","252793001":"Use of 3 H/ 3 He Ages to evaluate and improve groundwater flow models in a complex buried-valley aquifer","29601403":"The RAMI On-line Model Checker (ROMC): A web-based benchmarking facility for canopy reflectance models","274956250":"Testing competing models of the temperature hiatus: assessing the effects of conditioning variables and temporal uncertainties through sample-wide break detection","7258068":"Knight LV, Mattick K. “When I first came here, I thought medicine was black and white”: Making sense of medical students’ ways of knowing","229274129":"A Multiple Criteria Decision Support System for Testing Integrated Environmental Models","6266851":"Issues in the Interpretation of Climate Model Ensembles to Inform Decisions","269062069":"A Review of Calibration under Uncertainty within the Environmental Design Space","6266850":"Confidence, Uncertainty and Decision Support Relevance in Climate Predictions","247255298":"Probabilistic Aquatic Exposure Assessment for Pesticides. I: Foundations","223388398":"Effects of error in model input: Experiments with a forest patch model","230806143":"Participatory evaluation of agent-based land-use models","230846978":"The search for orthogonal hydrological modelling metrics: A case study of 20 monitoring stations in Colombia","267255855":"Review of \"Assessment of the effects of acidic deposition on aquatic and forest resources in the Southern Appalachian Mountains\" by Sullivan et al","254824690":"Simulating Nature: A Philosophical Study of Computer-Simulation Uncertainties and Their Role in Climate Science and Policy Advice","10710887":"Advances in real-time flood forecasting","223060621":"Modelling streamwater quality under varying hydrological conditions at different scales","5140361":"\"Methodological Implications of Complex Systems Approaches to Sociality\": Some Further Remarks","242577852":"Validation and applicability of distributed hydrological models","256778375":"Uncertainty analysis in the application of multi-criteria decision-making methods in Australian strategic environmental decisions","228831848":"Performance evaluation of environmental models","258429111":"Spatially-varying surface roughness and ground-level air quality in an operational dispersion model","229892706":"Internal catchment process simulation in a snow-dominated basin: Performance evaluation with spatiotemporally variable runoff generation and groundwater dynamics","225747621":"A unified approach to environmental systems modeling","257130631":"Interannual climate variability and population density thresholds can have a substantial impact on simulated tree species’ migration","12525414":"Endy D, You L, Yin J, Molineux IJ. Computation, prediction, and experimental tests of fitness for bacteriophage T7 mutants with permuted genomes. Proc Natl Acad Sci USA 97: 5375-5380","227127894":"The Role of Paleoecology in Whole-Ecosystem Science","222646948":"Landscape fate of nitrate fluxes and emissions in Central Europe: A critical review of concepts, data, and models for transport and retention","223576752":"The Nutrient Cycling Model (NuCM): Lessons learned","228704836":"Climate Change Simulation Guiding Policy or Policy Driven?","235704804":"Spatio-temporal uncertainty in Spatial Decision Support Systems: A case study of changing land availability for bioenergy crops in Mozambique","241729921":"Measuring and Modeling the Hydraulic Environment for Assessing Instream Flows","223949493":"An analysis of landslide susceptibility zonation using a subjective geomorphic mapping and existing landslides. Comput Geosci","228819534":"Landscape evolution models","250032394":"Simulation of a Swiss Wood Fuel and Roundwood Market: An Explorative Study in Agent-Based Modeling","235926013":"ENSEMBLE and AMET: Two systems and approaches to a harmonized, simplified and efficient facility for air quality models development and evaluation","227607139":"Error analysis for the evaluation of model performance: Rainfall-runoff event summary variables","251482382":"1144 CONTINENT CUTANEOUS URINARY RESERVOIR USING THE SEROUS LINED EXTRAMURAL VALVE; LONG TERM OUTCOME","227328632":"Uncertainty in Integrated Assessment Modelling: From Positivism to Pluralism","267427844":"Scientific Models and Adequacy-for-Purpose","256475324":"Population Dynamics of the Beet Leafhopper (Hemiptera: Cicadellidae) in the Columbia Basin as Influenced by Abiotic Variables","233689617":"A validation and evaluation of the Prognosis individual-tree basal area increment model","236585447":"Nine Considerations for Constructing and Running Geomorphological Models","225542798":"Negative learning"},"index":370}