{"abs":"We consider the simple technique of making independent and probabilistically identical simulation replications to estimate the steady-state mean of a stochastic process. For a fixed total sample size, using a first-order autoregressive model with high autocorrelation and time-dependent distributions, we analytically quantify and investigate the effects of the number of replications and of initial deletions of output on several different measures of point estimator and confidence interval quality. This analysis leads to general recommendations on the choice of replications and deletion. In particular, we conclude that deletion of some amount of the initial output in a replication can be an effective and efficient method of dealing with initialization bias; this conclusion differs from several previous studies on the efficacy of deletion.","title":"An Analytical Evaluation of Alternative Strategies in Steady-State Simulation","id":242501738,"url":"https://www.researchgate.net/publication/242501738_An_Analytical_Evaluation_of_Alternative_Strategies_in_Steady-State_Simulation","names":["David Kelton","Averill M. Law","Operations Research"],"references":{"239010831":"Batch Size Effects in the Analysis of Simulation Output","242558452":"Bias Considerations in Simulation Experiments","239554500":"Detecting Initialization Bias in Simulation Output","242924457":"Toward Guidelines for Designing Experiments in Queueing Simulation","268244441":"The Power of Student\u0027s t-Test","227444778":"Grouping Observations in Digital Simulation","227445243":"Confidence Intervals for Steady-State Simulations II: A Survey of Sequential Procedures","227442776":"Some Tactical Problems in Digital Simulation","242586667":"A Sequential Procedure for Determining the Length of a Steady-State Simulation"},"citedIn":{"261241234":"Supporting Flexible Processes with Adaptive Work?ow and Case Handling","235014147":"Exploring Posterior Distributions Using Markov Chains","222488192":"Coverage of confidence intervals in sequential steady-state simulation","4868745":"Bias and variance reduction in computer simulation studies","234831866":"A replication approach to interval estimation in simulation","222848718":"Impact of management information systems on decisions","3528179":"A replication approach to interval estimation in simulation","233344494":"A principal-components approach to assign confidence intervals in steady-state simulation","2684128":"A Global Plan Policy for Coherent Cooperation in Distributed Dynamic Load Balancing Algorithms","286494490":"The design, analysis, and evaluation of simulation experiments","221528702":"Standardized time series methods: variance estimation using replicated batch means.","221524901":"Experimental Evaluation of Confidence Interval Procedures in Sequential Steady-State Simulation.","227446301":"The Efficiency of One Long Run Versus Independent Replications in Steady-State Simulation","238094434":"Issues in Simulation and Modelling of Communication Systems","222294890":"Antithetic-variate splitting for steady-sate simulations","221529826":"Finite-time behavior of two simulation optimization algorithms.","222998044":"“Dynamic Job Shop Scheduling: A Survey of Simulation Research”","221157048":"Steady state simulations on queuing processes in parallel time streams: Problems and potentialities.","231150621":"A global plan policy for coherent co-operation in distributed dynamic load balancing algorithms","222438687":"Replication splitting and variance for simulating discrete-parameter stochastic processes","224209152":"The initial transient in steady-state point estimation: Contexts, a bibliography, the MSE criterion, and the MSER statistic","233186361":"Variance Reduction in the Presence of Initial-Condition Bias","229751121":"A new approach for dealing with the startup problem in discrete event simulation","38357609":"Markov Chains for Exploring Posterior Distributions","221527638":"Evaluation of Tests for Initial-Condition Bias","235107431":"Identification of the Initial Transient in Discrete-Event Simulation Output Using the Kalman Filter","229885977":"Replicated batch means for steady‐state simulations","242931990":"Confidence Intervals for Steady-State Simulations: I. A Survey of Fixed Sample Size Procedures","262346898":"Steady-State Simulation with Replication-Dependent Initial Transients: Analysis and Examples","268365071":"SEQUENTIAL PROCEDURES IN SIMULATION STUDIES OF SA TEUJTE COMMUNICA nON PROTOCOLS","220136430":"Time-Segmentation Parallel Simulation of Networks of Queues with Loss or Communication Blocking.","220610324":"Quantification of interacting runtime qualities in software architectures: Insights from transaction processing in client–server architectures","220136236":"To batch or not to batch?","220566227":"Steady-State Simulation of Queuing Processes: A Survey of Problems and Solutions.","2489426":"SCHOOL OF COMPUTER STUDIES RESEARCH REPORT SERIES Report 97.17 Simulation and Prototyping of a Coherent Distributed Dynamic Load Balancing Algorithm","3933195":"Variance estimation using replicated batch means","238662144":"ConstruÁªo de Metamodelos de Regressªo Nªo Linear para SimulaÁªo de Acontecimentos Discretos","283955735":"Scheduling of a computer integrated manufacturing system: A simulation study","224103911":"Integrated Manufacturing Modeling System","3772423":"Detecting truncation point in steady-state simulation using chaos theory"},"index":374}