{"abs":"Devaluation affects investment because of its effect on the real supply price of capital goods; the real price of imported inputs, w???????????????hich together with capital goods are used to produce output; the real product wage and thereby profitability and investment; real income, which affects the demand for domestically produced goods; and nominal and real interest rates, which in turn affect investment. This paper discusses the channels between devaluation and private investment and sets out the error correction growth-investment model. It also describes the trends in Indonesia\u0027s key macroeconomic variables and policy changes that have driven investment behavior. The estimates of the model are presented with a set of simulations that look at the short- versus long-run implications of devaluation on private investment.","title":"Does devaluation hurt private investment? The Indonesian case","id":23723390,"url":"https://www.researchgate.net/publication/23723390_Does_devaluation_hurt_private_investment_The_Indonesian_case","names":["Ajay Chhibber","Nemat Shafik"],"references":{"243644934":"‘Distribution of the Estimators For Autoregressive Time Series With a Unit Root’","220136343":"Variable-Sample Methods for Stochastic Optimization","38985306":"Change and Challenge in the World Economy","220403630":"Evolutionary multiobjective optimization in noisy problem environments","4213839":"Multiobjective simulation optimization using an enhanced genetic algorithm","226211700":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","220590902":"Asymptotic distribution of law-invariant risk functionals","245386681":"Solving a multi-objective multi-depot stochastic location-routing problem by a hybrid simulated annealing algorithm","2341433":"From Stochastic Dominance to Mean-Risk Models: Semideviations as Risk Measures","220470719":"The bi-objective stochastic covering tour problem.","228773689":"Dual stochastic dominance and related mean-risk models","4855766":"Spurious Regressions in Economics","4871787":"Stochastic approach versus multiobjective approach for obtaining efficient solutions in stochastic multiobjective programming problems","3933080":"Multi-objective simulation optimization for a cancer treatment center","233322573":"Risk-adjusted budget allocation models with application in homeland security","227614132":"Coherent Measures of Risk","226569511":"Linear Programming Under Uncertainty","4939236":"Multi-objective stochastic programming for portfolio selection","220403475":"A provably convergent heuristic for stochastic bicriteria integer programming","225554118":"Optimization with Multivariate Stochastic Dominance Constraints","222831625":"An efficient, adaptive parameter variation scheme for metaheuristics based on the Epsilon-constraint method","233060645":"Stochastic Multi-Objective Generation Dispatch","4777737":"Error Correction, Partial Adjustment and All That: An Expository Note","225572147":"A stochastic bi-objective location model for strategic reverse logistics","222707586":"Uniform laws of large numbers for set-valued mappings and subdifferentials of random functions","220290150":"Two-stage stochastic optimization problems with stochastic ordering constraints on the recourse","245222609":"A bi-objective supply chain design problem with uncertainty. Transp Res Part C","227470018":"Contractionary Devaluation in Developing Countries: An Analytical Overview","46491786":"Supply chain design under uncertainty using sample average approximation and dual decomposition","242503084":"On Stability of Multistage Stochastic Programs","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","50926800":"A simulation-based multi-objective genetic algorithm approach for networked enterprises optimization","4776724":"Optimization with Stochastic Dominance Constraints","4777769":"‘Testing Neo-Classical Theories of Labour Demand: An Application of Cointegration Techniques’","228912070":"Handling Uncertainty in Indicator-Based Multiobjective Optimization","220133501":"A Cutting-Surface Method for Uncertain Linear Programs with Polyhedral Stochastic Dominance Constraints","222133086":"Multi-objective optimization for inventory control in two-level assembly systems under uncertainty of lead times","232877061":"Bi-objective project portfolio selection and staff assignment under uncertainty","228014322":"Exploring Equilibrium Relationships in Econometrics Through Static Models: Some Monte Carlo Evidence","223844400":"Cutting plane method for multiple objective stochastic integer linear programming","5109546":"Devaluation and Imported Inputs: The Large Economy Case","220290250":"Ben: F. Solution approaches for the multiobjective stochastic programming. Eur. J. Oper. Res","23750017":"Error Correction Mechanisms","51724409":"Runtime Analysis of an Evolutionary Algorithm for Stochastic Multi-Objective Combinatorial Optimization","4814759":"The Likelihood Ratio Statistics For Autoregressive Time Series With a Unit Root","225575964":"On consistency of stochastic dominance and mean–semivariance models","4777767":"Development in the Study of Co-Integrated Economic Variables","228231914":"Preface to Modeling, Measuring and Managing Risk","220462034":"Pardalos, P.M.: A survey of recent developments in multiobjective optimization. Ann. Oper. Res. 154, 29-50","259792398":"Parametric Objective Function (Part 1)","220133736":"A Distance For Multistage Stochastic Optimization Models","2723166":"On Optimal Allocation of Indivisibles under Uncertainty","220142055":"Recent trends in metaheuristics for stochastic combinatorial optimization","24086165":"Mean-risk models using two risk measures: A multi-objective approach","4891829":"Some Long Run Features of Dynamic Time Series Models"},"citedIn":{"5057853":"Exchange Rate Depriciation, Budget Deficit and Inflation - The Nigerian Experience.","228384190":"Private capital formation and macroeconomic policies in Sudan: application of a simple cointegrated vector autoregressive model","5130637":"Private investment and public policy in sub-Saharan Africa : an empirical analysis","23691148":"Private Investment: Trends and Determinants in Thailand","23723852":"Adjustment and private investment in Kenya","46507292":"“Private Investment and Financial Sector Policies in India and Malaysia.”","23723429":"Modeling investment behavior in developing countries : an application to Egypt","229424770":"Exchange Rate Depreciation and Inflation in Nigeria (1986–2008)","238066879":"PRIVATE INVESTMENT AND FINANCIAL SECTOR POLICIES IN DEVELOPING COUNTRIES"},"index":384}