{"abs":"Nowadays the trend of using monolithic parts on aerospace industry has suffered a considerable increase due to the benefits they provide. However, their complex shape and the low machinability of the materials used to manufacture them make their manufacturing by conventional methods difficult or even impossible. Electro discharge machining is an alternative to manufacture this kind of parts. Existing solutions do not offer a generic method that guarantees the smoothness of the erosion path, independently of the workpiece geometry and “user-dependent” features. With the aim to solve the problem, a new objective function has been proposed and a hybrid optimization method (Genetic Algorithm+Trust Region Reflective method) has been implemented. Results obtained by a single variable problem show that the proposed objective function generates a smooth path regardless of machined shape and available degrees of freedom. Therefore, the implemented optimization method combines a low computational cost together with the obtaining of the largest possible electrode. The optimized algorithm has been applied to an industrial case-study, the erosion of a shrouded blisk, to check its adequacy. The lack of instabilities during the erosion of the part proves the best performance of the developed work.","title":"Optimum electrode path generation for EDM manufacturing of aerospace components","id":275528426,"url":"https://www.researchgate.net/publication/275528426_Optimum_electrode_path_generation_for_EDM_manufacturing_of_aerospace_components","names":["I. Ayesta","Borja Izquierdo","J. A. Sanchez","J.M. Ramos","S. Plaza","I. Pombo","Robotics and Computer-Integrated Manufacturing"],"references":{"222701892":"Interior-point methods","229377032":"Study of the White Layer of a Surface Machined by Die-Sinking Electro-Discharge Machining","233617288":"EDMing turbopump blisks","257745369":"Modern Machining of Advanced Aerospace Alloys - Enabler for Quality and Performance","222150490":"Workpiece surface roughness and integrity after WEDM of Ti–6Al–4V and Inconel 718 using minimum damage generator technology","225575285":"A special CAD/CAM software for electro-discharge machining of shrouded turbine blisks","257745748":"Electrode Feeding Path Searching for 5-Axis EDM of Integral Shrouded Blisks","253517968":"Path Optimization for EDM of Rimed Turbine Blisks","257337784":"Electrode feed path planning for multi-axis EDM of integral shrouded impeller","263171713":"Nature-Inspired Optimization Algorithms","222562987":"A novel hybrid immune algorithm for global optimization in design and manufacturing","2330323":"V-collide: accelerated collision detection for vrml","226179402":"Approximate solution of the trust region problem by minimization over two-dimensional subspaces","291994806":"Chapter 4 - simulated annealing","2433655":"Analysis of generalized pattern searches. SIAM J Optim","230873264":"Numerical Optimization Second Edition","257745417":"Technological and Economical Comparison of Roughing Strategies via Milling, EDM and ECM for Titanium- and Nickel-based Blisks","257745803":"Overview on Five-Axis Precision EDM Techniques","245190762":"Application of genetic algorithm to computer-aided process planning in distributed manufacturing environments","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","245379036":"Analysis of generalized search patterns","267948261":"Market-oriented blisk manufacturing A challenge for production engineering","272056328":"High Performance Cutting of Aerospace Materials"},"citedIn":{},"index":394}