{"abs":"Optimization for complex systems in engineering often involves the use of expensive com- puter simulation. By combining statistical emulation using treed Gaussian processes with pat- tern search optimization, we are able to perform robust local optimization more ecien tly and eectiv ely than using either method alone. Our approach is based on the augmentation of lo- cal search patterns with location sets generated through improvement prediction over the input space. We further develop a computational framework for asynchronous parallel implementation of the optimization algorithm. We demonstrate our methods on two standard test problems and our motivating example of calibrating a circuit device simulator.","title":"Bayesian Guided Pattern Search for Robust Local Optimization","id":241216681,"url":"https://www.researchgate.net/publication/241216681_Bayesian_Guided_Pattern_Search_for_Robust_Local_Optimization","names":["Matthew A. Taddy","Herbert K. H. Lee","Genetha A Gray","Joshua D. Grin","Technometrics"],"references":{"5142988":"tgp: An R Package for Bayesian Nonstationary, Semiparametric Nonlinear Regression and Design by Treed Gaussian Process Models","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","4772045":"Bayesian Calibration of Computer Models","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","260278602":"Design and Modeling for Computer Experiments","2385583":"A Rigorous Framework for Optimization of Expensive Functions by Surrogates","224352142":"A Statistical Framework for the Sensitivity Analysis of Radiative Transfer Models","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","243102952":"Latin Hyperrectangle Sampling for Computer Experiments","220133385":"Revisiting Asynchronous Parallel Pattern Search for Nonlinear Optimization","2738802":"Uncertainty Analysis and other Inference Tools for Complex Computer Codes","220133059":"On the Convergence of Asynchronous Parallel Pattern Search","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","2450683":"Bayesian CART model search","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","220492812":"Algorithm 856: APPSPACK 4.0: asynchronous parallel pattern search for derivative-free optimization.","222896801":"Comparison of derivative-free optimization methods for groundwater supply and hydraulic capture community problems","222403818":"Tabu Search directed by direct search methods for nonlinear global optimization","225466652":"Improved Strategies for Radial basis Function Methods for Global Optimization","265632761":"Uncertainty analysis and other inference tools for complex computer codes. (With discussion)","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","222402096":"Making best use of model evaluations to compute sensitivity indices. Comput Phys Commun","220521168":"Selection of a Representative Sample","216300945":"T.G. Kolda, R.M. Lewis, V. Torczon: Optimization by direct search: New perspectives on some classical and modern methods. SIAM Review 45, 385-482","216301407":"Global versus local search in constrained optimization of computer models","227266999":"A Trust Region Framework for managing the use of approximation models in optimization","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments"},"citedIn":{"241557157":"SAMSI 2006-07 Program on Development, Assessment and Utilization of Complex Computer Models Final Report","260317958":"The mesh adaptive direct search algorithm with treed Gaussian process surrogates","45904702":"A Computationally Stable Approach to Gaussian Process Interpolation of\nDeterministic Computer Simulation Data","271295791":"Finding and Choosing among Multiple Optima","225904882":"Computer experiments: A review","51932830":"Variable selection and sensitivity analysis via dynamic trees with an application to computer code performance tuning","263454963":"Comment: On Advances in Expected Improvement","265013708":"Development and validation of a dynamic metamodel based on stochastic radial basis functions and uncertainty quantification","269300869":"Foundry technology for RF and high performance analog applications","260562698":"Amplitude and Directional of Arrival Estimation: Comparison Between Different Techniques","233866237":"Optimisation via Slice Sampling","279045804":"Sequential process convolution Gaussian process models via particle learning","268819530":"An Efficient Computational Intelligence Approach for solving Fractional order Riccati Equations using ANN and SQP","263172350":"Computational Optimization, Methods and Algorithms","228628276":"Asynchronous parallel hybrid optimization combining DIRECT and GSS","45416610":"Dealing with asynchronicity in parallel Gaussian Process based global optimization","268452958":"Sequential design for achieving estimated accuracy of global sensitivities","283115201":"Multivariate Stochastic Process Models for Correlated Responses of Mixed Type","242094091":"Designing and analyzing a circuit device experiment using treed Gaussian processes","228572280":"Derivative-Free Optimization Via Evolutionary Algorithms Guiding Local Search","225165068":"Traditional and Hybrid Derivative-Free Optimization Approaches for Black Box Functions","262583041":"Bayesian Inference for Sensitivity Analysis of Computer Simulators, With an Application to Radiative Transfer Models","45888917":"Dynamic Trees for Learning and Design","263172614":"Computational Optimization and Applications in Engineering and Industry","270081267":"Null placement and sidelobe suppression in failed array using symmetrical element failure technique and hybrid heuristic computation","273404448":"Variable selection via a multi-stage strategy","262294223":"Simultaneous optimization and uncertainty quantification","276510026":"Classic Kriging versus Kriging with bootstrapping or conditional simulation: Classic Kriging\u0027s robust confidence intervals and optimization","258380244":"Solution of Fractional Order System of Bagley-Torvik Equation Using Evolutionary Computational Intelligence","46515760":"Categorical Inputs, Sensitivity Analysis, Optimization and Importance Tempering with tgp Version 2, an R Package for Treed Gaussian Process Models","45913547":"Optimization Under Unknown Constraints","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","45931398":"Cases for the Nugget in modelling computer experiments","271753928":"Optimization Under Constraints by Applying an Asymmetric Entropy Measure","260945654":"Modeling an Augmented Lagrangian for Improved Blackbox Constrained Optimization","269520620":"Convex Combination of Gaussian Processes for Bayesian Analysis of Deterministic Computer Experiments","267145425":"Optimization Subject to Hidden Constraints via Statistical Emulation","262938961":"Bayesian treed response surface models"},"index":399}