{"abs":"This paper discusses a novel strategy for simulating rare events and an associated Monte Carlo estimation of tail probabilities. Our method uses a system of interacting particles and exploits a Feynman-Kac representation of that system to analyze their fluctuations. Our precise analysis of the variance of a standard multilevel splitting algorithm reveals an opportunity for improvement. This leads to a novel method that relies on adaptive levels and produces, in the limit of an idealized version of the algorithm, estimates with optimal variance. The motivation for this theoretical work comes from problems occurring in watermarking and fingerprinting of digital contents, which represents a new field of applications of rare event simulation techniques. Some numerical results show performance close to the idealized version of our technique for these practical applications. KeywordsRare event–Sequential importance sampling–Feynman-Kac formula–Metropolis-Hastings–Fingerprinting–Watermarking","title":"Sequential Monte Carlo for rare event estimation","id":226031060,"url":"https://www.researchgate.net/publication/226031060_Sequential_Monte_Carlo_for_rare_event_estimation","names":["Frédéric Cérou","Pierre Del Moral","Teddy Furon","Arnaud Guyader","Statistics and Computing"],"references":{"200033900":"Equation of state calculations for fast computing machines","226058616":"Rare-Event Simulation","3318576":"Performance analysis of existing and new methods for data hiding with known-host information in additive channels","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","200105001":"Equation of State by Fast Computing Machines","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","200707517":"Sequential Monte Carlo Samplers for Rare Events","242386046":"Estimation of Particle Transmission by Random Sampling","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","2864441":"Optimal Probabilistic Fingerprint Codes","248115483":"Topics in Sequential Monte Carlo Samplers","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","3086649":"Optimal Watermark Embedding and Detection Strategies Under Limited Detection Resources","224678908":"Optimal Watermark Embedding and Detection Strategies Under Limited Detection Resources","29596955":"Genetic Genealogical Models in Rare Event Analysis","1825409":"Sequential monte carlo samplers","38357609":"Markov Chains for Exploring Posterior Distributions","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","227199776":"A Sequential Particle Algorithm that Keeps the Particle System Alive","231743804":"Rare event simulation","246868698":"Rosenbluth, M. N. \u0026 Rosenbluth, A. W. Monte Carlo calculation of the average extension of molecular chains. J. Chem. Phys. 23, 356","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","226592753":"The Gibbs Cloner for Combinatorial Optimization, Counting and Sampling","200744518":"Sequential Monte-Carlo Methods in Practice","41035459":"The splitting method in rare event simulation","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","244955309":"A First Course in Order Statistics","244424743":"Editors: Sequential Monte Carlo Methods in Practice","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","4993330":"Sequential Monte Carlo Samplers","234000716":"Branching and interacting particle interpretation of rare event probabilities."},"citedIn":{"283810285":"Recent advances in various fields of numerical probability","262108949":"Analysis of Adaptive Multilevel Splitting algorithms in an idealized case","264854211":"Combinatorial analysis of the adaptive last particle method","282381146":"Fast statistical analysis of rare circuit failure events via subset simulation in high-dimensional variation space","275167977":"Some Recent Results in Rare Event Estimation","279261622":"An Effective Heuristic for Adaptive Importance Splitting in Statistical Model Checking","281185365":"Rare Event Simulation Using Reversible Shaking Transformations","283622271":"The Alive Particle Filter and Its Use in Particle Markov Chain Monte Carlo","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","260563996":"Improvement of satellite conflict prediction reliability through use of the adaptive splitting technique","281157084":"An island particle Markov chain Monte Carlo algorithm for safety analysis","283454458":"Rare event simulation related to financial risks: efficient estimation and sensitivity analysis","284750937":"Rare event simulation and spliting for discontinuous random variables","272027281":"Distributed Verification of Rare Properties with Lightweight Importance Splitting Observers","281629792":"Some ideas for bias and variance reduction in the splitting algorithm for diffusion processes","269417762":"Statistical behavior of adaptive multilevel splitting algorithms in simple models","280243098":"Computing transition rates for the 1-D stochastic Ginzburg--Landau--Allen--Cahn equation for finite-amplitude noise with a rare event algorithm","287422354":"On the Convergence of Quantum and Sequential Monte Carlo Methods","256081136":"Conflict probability estimation between aircraft with dynamic importance Splitting","285310904":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation","263021460":"Analysis of Adaptive Multilevel Splitting algorithms in an idealized case","260498876":"A New Measure of Watermarking Security: The Effective Key Length","265753069":"False Positive probabilities in q-ary Tardos codes: comparison of attacks","282380905":"Fast statistical analysis of rare failure events for memory circuits in high-dimensional variation space","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation","233996210":"On the Concentration Properties of Interacting Particle Processes","257665561":"Bayesian Parameter Inference for Partially Observed Stopped Processes","279070817":"MCMC algorithms for Subset Simulation","267046446":"Convergence properties of weighted particle islands with application to the double bootstrap algorithm","265127940":"Fluctuation Analysis of Adaptive Multilevel Splitting","269876959":"Point Process-based Monte Carlo Estimation","255994504":"Twisting the Alive Particle Filter","279808481":"Rare Event Simulation and Splitting for Discontinuous Random Variables","262215532":"Importance Splitting for Statistical Model Checking Rare Properties","262209134":"On the use of a class of interior point algorithms in stochastic structural optimization","284900779":"An island particle algorithm for rare event analysis","262983676":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","51915982":"On the Concentration Properties of Interacting Particle Processes","266943935":"A survey of rare event simulation methods for static input-output models","221664622":"The Effective Key Length of Watermarking Schemes","257207310":"An Overview of Probabilistic Performance Analysis Methods for Large Scale and Time-Dependent Systems","233065791":"On the Use of Smoothing to Improve the Performance of the Splitting Method","276343589":"Adaptive Multilevel Splitting in Molecular Dynamics Simulations","265416246":"Recommendations for the tuning of rare event probability estimators","51958902":"Self-Avoiding Random Dynamics on Integer Complex Systems","282570552":"A Bayesian approach to constrained single- and multi-objective optimization","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","267606684":"Application of a Particle Filter-Based Subset Simulation Method to the Reliability Assessment of a Marine Structure","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","261357028":"Adapting Particle Filter Algorithms to Many-Core Architectures","267448713":"Central Limit Theorem for Adaptive Multilevel Splitting Estimators in an Idealized Setting","276211339":"Unbiasedness of some generalized Adaptive Multilevel Splitting algorithms","234412805":"Advanced Interacting Sequential Monte Carlo Sampling for Inverse\nScattering","285321983":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation","281312187":"A surrogate accelerated multicanonical Monte Carlo method for uncertainty quantification","262265054":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms"},"index":4}