{"abs":"Optimization of complex functions, such as the output of computer simulators, is a difficult task that has received much attention in the literature. A less studied problem is that of optimization under unknown constraints, i.e., when the simulator must be invoked both to determine the typical real-valued response and to determine if a constraint has been violated, either for physical or policy reasons. We develop a statistical approach based on Gaussian processes and Bayesian learning to both approximate the unknown function and estimate the probability of meeting the constraints. A new integrated improvement criterion is proposed to recognize that responses from inputs that violate the constraint may still be informative about the function, and thus could potentially be useful in the optimization. The new criterion is illustrated on synthetic data, and on a motivating optimization problem from health care policy. Comment: 19 pages, 8 figures, Valencia discussion paper","title":"Optimization Under Unknown Constraints","id":45913547,"url":"https://www.researchgate.net/publication/45913547_Optimization_Under_Unknown_Constraints","names":["Robert B. Gramacy","Herbert K. H. Lee"],"references":{"216301381":"The Design and Analysis Computer Experiments","239666344":"Regression and Classification Using Gaussian Process Priors","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","241216681":"Bayesian Guided Pattern Search for Robust Local Optimization","45888917":"Dynamic Trees for Learning and Design","4742982":"Inference for a Proton Accelerator Using Convolution Models","34954629":"Bayesian Treed Gaussian Process Models","227369145":"Bayesian Emulation and Calibration of a Stochastic Computer Model of Mitochondrial DNA Deletions in Substantia Nigra Neurons","46515760":"Categorical Inputs, Sensitivity Analysis, Optimization and Importance Tempering with tgp Version 2, an R Package for Treed Gaussian Process Models","47663330":"Particle Learning and Smoothing","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","245577748":"Fourteen new stationary points in the scalar potential of SO(8)-gauged N \u003d 8, D \u003d 4 supergravity","216301407":"Global versus local search in constrained optimization of computer models","2738802":"Uncertainty Analysis and other Inference Tools for Complex Computer Codes"},"citedIn":{"263194960":"Fast linked analyses for scenario‐based hierarchies","260317958":"The mesh adaptive direct search algorithm with treed Gaussian process surrogates","257335184":"A benchmark of kriging-based infill criteria for noisy optimization","233818821":"Spatial sampling design by means of spectral approximations to the error process","261065571":"Bayesian Optimization with Unknown Constraints","257299288":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction","46586550":"Gaussian Process Single-Index Models as Emulators for Computer Experiments","276919024":"Incorporating covariance estimation uncertainty in spatial sampling design for prediction with trans-Gaussian random fields","254331259":"Quantile-Based Optimization of Noisy Computer Experiments With Tunable Precision","258388885":"Controlling Cyclic Epidemics on the Crops of the Agroecosystems: Articulate all the Dimensions in the Formalisation, but Look for a Local Solution","221921475":"Spatial Sampling Design and Soil Science","277560498":"A Taxonomy of Constraints in Simulation-Based Optimization","221663052":"Active Bayesian Optimization: Minimizing Minimizer Entropy","284086160":"Global optimization of general constrained grey-box models: new method and its application to constrained PDEs for pressure swing adsorption"},"index":402}