{"abs":"A recent approach to surrogate modelling, called dynamic trees, uses regression trees to partition the input space, and fits simple constant or linear models in each \" leaf \" (region of the input space). This article aims to investigate the applicability of dynamic trees in sensitivity analysis, in particular on high dimensional problems at low sample size, to see whether they can be applied to dimen-sionalities usually out of the range of surrogate models. Comparisons are made with Gaussian processes, as well as three measures based on a radial sampling scheme: the Monte Carlo estimator of the total sensitivity index, an elementary effects measure, and a derivative-based sensitivity measure. The results show that the radial sampling measures generally outperform the surrogate models tested here, with the exception of response surfaces that feature discontinuities. Uncertainty analysis (UA) and sensitivity analysis (SA) are now widely acknowledged as essential components of model-based engineering design and risk analysis. However, there are still many practical difficulties associated with accurately quantifying and propagating uncertainties through a model. Not the least of these problems is that of computational expense: given that most complex models cannot be represented in a closed form, UA and SA must be performed by sampling the model by running it a number of times at different values of its input variables. If it is possible to run the model a fairly large number of times, the Monte Carlo method can be used to estimate the variance of the model output and measures of sensitivity to a reasonable degree of precision.","title":"Applications of Dynamic Trees to Sensitivity Analysis","id":281440800,"url":"https://www.researchgate.net/publication/281440800_Applications_of_Dynamic_Trees_to_Sensitivity_Analysis","names":["William Edward Becker"],"references":{"5142988":"tgp: An R Package for Bayesian Nonstationary, Semiparametric Nonlinear Regression and Design by Treed Gaussian Process Models","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","253041072":"Analysis of Variance Designs for Model Output","220348228":"Derivative based global sensitivity measures and their link with global sensitivity indices","222705706":"Multiple predictor smoothing methods for sensitivity analysis: description of techniques. Reliab Eng Syst Saf","222526449":"Global sensitivity analysis using polynomial chaos expansion","220257077":"From screening to quantitative sensitivity analysis. A unified approach","234882741":"Study of the Sensitivity of Coupled Reaction Systems to Uncertainties in Rate Coefficients. I. Theory","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","51887919":"Ratings and rankings: Voodoo or Science?","280757799":"Bayesian CART model search","245078917":"Importance Measures in Global Sensitivity Analysis of Nonlinear Models","268637053":"Monte Carlo, Quasi-Monte Carlo, and Randomized Quasi-Monte Carlo","226258786":"General Foundations of High Dimensional Model Representations"},"citedIn":{},"index":403}