{"abs":"Dynamic regression trees are an attractive option for automatic regression and classification with complicated response surfaces in on-line application settings. We create a dynamic tree model whose state changes in time with the accumulation of new data, and provide particle learning algorithms that allow for the efficient on-line posterior filtering of tree-states. A major advantage of tree regression is that it allows for the use of very simple models within each partition. We consider both constant and linear mean functions at the tree leaves, along with multinomial leaves for classification problems, and propose default prior specifications that allow for prediction to be integrated over all model parameters conditional on a given tree. Inference is illustrated in some standard nonparametric regression examples, as well as in the setting of sequential experiment design, including both active learning and optimization applications, and in on-line classification. Throughout, we demonstrate that the proposed algorithms are able to provide better results compared to commonly used methods at a fraction of the cost. Comment: 37 pages, 8 figures, 3 tables; revised","title":"Dynamic Trees for Learning and Design","id":45888917,"url":"https://www.researchgate.net/publication/45888917_Dynamic_Trees_for_Learning_and_Design","names":["Matthew A. Taddy","Robert B. Gramacy","Nicholas G. Polson","Journal of the American Statistical Association"],"references":{"2455557":"Information--Based Objective Functions for Active Data Selection","228451484":"Classification and Regression by RandomForest","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","265681840":"Sequential Imputations and Bayesian Missing Data Problems","241216681":"Bayesian Guided Pattern Search for Robust Local Optimization","45849138":"Classification and Categorical Inputs with Treed Gaussian Process Models","2321171":"Classification of Regression Lines","228983830":"Particle learning for general mixtures","259073152":"Electrons and Phonons in Semiconductor Multilayers","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","222504913":"Neural Network Exploration Using Optimal Experiment Design","244275933":"Purification of recombinant plant-made proteins from corn extracts by ultrafiltration","216756632":"Sequential Design of Computer Experiments to Minimize Integrated Response Functions","31002186":"Posterior Probabilities for Choosing a Regression Model","47663330":"Particle Learning and Smoothing","2369650":"“Filtering Via Simulation: Auxiliary Particle Filter”","2817500":"Non-Stationary Spatial Modeling","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","38359473":"Multi-Variate Adaptive Regression Splines (with Discussion)","216301407":"Global versus local search in constrained optimization of computer models","258228792":"BART: Bayesian additive regression trees","229703310":"Classification and Regression Trees","2450683":"Bayesian CART model search"},"citedIn":{"221660022":"Dynamic trees for streaming and massive data contexts","260317958":"The mesh adaptive direct search algorithm with treed Gaussian process surrogates","269730262":"Evaluation of machine learning interpolation techniques for prediction of physical properties","51932830":"Variable selection and sensitivity analysis via dynamic trees with an application to computer code performance tuning","263454963":"Comment: On Advances in Expected Improvement","277677317":"Variable selection for BART: An application to gene regulation","280837815":"Constrained problem formulations for power optimization of aircraft electro-thermal anti-icing systems","278066329":"Parallel Bayesian Additive Regression Trees","275890684":"Statistical Surrogate Formulations for Simulation-Based Design Optimization","279045804":"Sequential process convolution Gaussian process models via particle learning","269466112":"Empirical performance modeling of GPU kernels using active learning","235766108":"Top-down particle filtering for Bayesian decision trees","256744276":"Multi-output local Gaussian process regression: Applications to uncertainty quantification","285524703":"Online detection and modeling of safety boundaries for aerospace applications using active learning and Bayesian statistics","256606229":"Sequential Design for Optimal Stopping Problems","274830527":"Bayesian Sequential Experimental Design for Binary Response Data with Application to Electromyographic Experiments","272195302":"Bayesian and empirical Bayesian forests","263671703":"Fifty Years of Classification and Regression Trees","51950393":"The partition problem: case studies in Bayesian screening for\ntime-varying model structure","261430583":"Active-learning-based surrogate models for empirical performance tuning","272241694":"Living Standards and Plague in London, 1560-1665","265687283":"Raiders of the Lost Architecture: Kernels for Bayesian Optimization in Conditional Parameter Spaces","259163220":"Bayesian optimal sequential design for nonparametric regression via inhomogeneous evolutionary MCMC","227172192":"Measuring Political Sentiment on Twitter: Factor Optimal Design for Multinomial Inverse Regression","263012120":"Mondrian Forests: Efficient Online Random Forests","227450808":"Particle filters and Bayesian inference in financial econometrics","45913547":"Optimization Under Unknown Constraints","276035274":"Information-Theoretic Data Discarding for Dynamic Trees on Data Streams","259211721":"Efficient Metropolis-Hastings Proposal Mechanisms for Bayesian Regression Tree Models","258105822":"Variable Selection Inference for Bayesian Additive Regression Trees","262938961":"Bayesian treed response surface models"},"index":406}