{"abs":"The developing field of probabilistic design has matured to the point where several classes of analysis methods have been proven to be useful for engineering analysis of large high fidelity structures with uncertain parameters. However, several barriers still stand in the way of widespread acceptance of probabilistic methods into the design practice. These include lack of data for characterizing probabilistic inputs, lack of understanding of analysis methodologies and associated limitations, lack of commercially available tools for performing probabilistic analysis, and lack of verification and validation examples. As a first step towards developing more computationally robust tools for performing probabilistic analysis and improving user understanding of analysis assumptions and limitations, this paper identifies the various types of error that can be encountered when performing probabilistic analysis and offers some suggestions for mitigating or eliminating them from the analysis.","title":"ERRORS AND UNCERTAINTIES IN PROBABILISTIC ENGINEERING ANALYSIS","id":238764714,"url":"https://www.researchgate.net/publication/238764714_ERRORS_AND_UNCERTAINTIES_IN_PROBABILISTIC_ENGINEERING_ANALYSIS","names":["Ben H. Thacker","David Riha","Harry Millwater","Michael P. Enright"],"references":{"37427434":"Probability Concepts in Engineering Planning and Design, Vol. II. Decision, Risk, and Reliability","236660920":"Methods of Structural Safety","268465315":"Issues in utilizing response surface methodologies for accurate probabilistic design","243657714":"Numerical Optimization Techniques for Engineering Design: With Application","256379905":"Structural Reliability Under Combined Random Load Sequences","23594337":"Structural system reliability calculation using a probabilistic fault tree analysis method","237128265":"Estimation of Total Uncertainty in Modeling and Simulation","245284547":"A Response Surface Approach for Reliability Analysis","222543308":"Probabilistic engineering analysis using the NESSUS software","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{"242289905":"ROBUST MOST PROBABLE POINT SEARCH ALGORITHM FOR DIFFICULT PERFORMANCE FUNCTIONS","24293554":"Needs and Opportunities for Uncertainty-Based Multidisciplinary Design Methods for Aerospace Vehicles","30011721":"A univariate decomposition method for higher-order reliability analysis and design optimization","37598324":"Exploration and assessment of the environmental design space for commercial aircraft and future technologies","228436310":"Risk Assessment for Vessels Affected by Corrosion","272167862":"Reliability of Semi-active Control Devices to Seismic Impact","222543308":"Probabilistic engineering analysis using the NESSUS software","23581237":"Application of Non-Deterministic Methods to Assess Modeling Uncertainties for Reinforced Carbon-Carbon Debris Impacts","228849904":"The role of nondeterminism in model verification and validation","228770679":"Efficient robust design via Monte Carlo sample reweighting","238662177":"Probabilistic Approach to Damage Tolerance Design of Aircraft Composite Structures","4678811":"Application of Probabilistic Analysis to Aircraft Impact Dynamics","242567720":"Analyzing \u0027Noisy\u0027 Structural Problems with LS-OPT: Probabilistic and Deterministic Fundamentals","242406255":"Uncertainty in Structural Dynamic Models","27523262":"Use of Probability of Success as an Independent Variable for Decision-Making","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","229305268":"Verification and validation for a penetration model using a deterministic and probabilistic design tool","222132323":"Efficient structural computations with parameters uncertainty for composite applications","226779419":"A Comparison of Methods in Probabilistic Design Based on Computational and Modelling Issues","51157740":"A numerically validated probabilistic model of a simplified total hip replacement construct","271595986":"Seismic wave propagation in basins under uncertainties in material properties","268426204":"The Effect of Nondeterministic Parameters on Shock-Associated Noise Prediction Modeling","251733349":"The Role of Nondeterminism in Verification and Validation of Computational Solid Mechanics Models","227509610":"Stochastic analysis of highly non-Linear structures","245528260":"Uncertain reliability index in finite element reliability analysis","250697368":"Reliability-based design optimization for elastoplastic mechanical structures","260355959":"Probabilistic Modeling of Aerothermal and Thermal Protection Material Response Uncertainties","255582669":"Vibroacoustic finite elements using a probabilistic approach. Promises with troubles","34024831":"Probabilistic modeling of microelectromechanical systems (MEMS) /","228949277":"On probabilistic approaches for reliability-based design optimization (RBDO)","232292704":"Uncertainty quantification for structural dynamics and model validation problems","235030011":"A Risk-Based Approach for Aerothermal/TPS Analysis and Testing","285236474":"Adaptive Probability Analysis Using Performance Measure Approach","237276638":"RECENT ADVANCES OF THE NESSUS® PROBABILISTIC ANALYSIS SOFTWARE FOR ENGINEERING APPLICATIONS","41477954":"Propagating and mitigating uncertainty in the design of complex multidisciplinary systems","267995332":"Title: Modeling Impact and Penetration using a Deterministic and Probabilistic Design Tool","228949275":"Adaptive Probability Analysis Using Performance Measure Approach","223250545":"A semi-analytical Monte Carlo simulation method for system\u0027s reliability with load sharing and damage accumulation"},"index":413}