{"abs":"Algorithms are described for computing the Gaussian likelihood or restricted likelihood corresponding to a general linear mixed model. Included are arbitrary covariance structures for both the random effects and errors. Formulas are also given for the first and second derivatives of the likelihoods, thus enabling a Newton-Raphson implementation. The algorithms make heavy use of the Cholesky decomposition, the sweep operator, and the W-transformation. Also described are the modifications needed for variance profiling, Fisher scoring, and MIVQUE(0), as well as the computational order of the procedures.","title":"Computing Gaussian Likelihoods and Their Derivatives for General Linear Mixed Models","id":242913395,"url":"https://www.researchgate.net/publication/242913395_Computing_Gaussian_Likelihoods_and_Their_Derivatives_for_General_Linear_Mixed_Models","names":["Russ Wolfinger","Randy Tobias","John Sall","SIAM Journal on Scientific Computing"],"references":{"265589461":"Newton-Raphson and EM Algorithms for Linear Mixed-Effects Models for Repeated-Measures Data","16029877":"Laird NM, Ware JHRandom-effects Models for Longitudinal Data. Biometrics 38:963-974","19346662":"Unbalanced Repeated Measures Models with Structured Covariance Matrices","261573909":"Computing Maximum Likelihood Estimates for the Mixed A.O.V. Model Using the W Transformation","243764162":"A Random Field Approach to the Analysis of Field-Plot Experiments and Other Spatial Experiments","242648282":"Application of Linear Models in Animal Breeding","247868663":"The Estimation of Environmental and Genetic Trends from Records Subject to Culling","237885471":"Estimation of Variance and Covariance Components in Linear Models","19497754":"Efficient Inference for Random-Coefficient Growth Curve Models with Unbalanced Data","260406161":"Transformation and Weighting in Regression","267472105":"Statistical and Computational Aspects of Mixed Model Analysis","235726165":"An Efficient Method of Estimating Seemingly Unrelated Regressions and Tests of Aggretion Bias","243713791":"Maximum Likelihood Approaches to Variance Component Estimation and to Related Problems: Rejoinder","38363346":"That EBLUP is a good thing: The estimation of random effects","254332149":"A Simplified Algorithm for the W Transformation in Variance Component Estimation","239356602":"A tutorial on the SWEEP operator"},"citedIn":{"266882283":"SMALL AREA ESTIMATION WITH LINEAR MIXED MODELS FROM UNIT-LEVEL PANEL AND ROTATING PANEL DATA","243048312":"Covariance structure selection in general mixed models. Commun. Statist","250055392":"Sustained Acceleration of Achievement in Reading Comprehension: The New Zealand Experience","225332455":"A variance-covariance structure to take into account repeated measurements and heteroscedasticity in growth modeling","12289969":"Numerical methods for the evaluation of individual bioequivalence","215990100":"Implementing Basel II in retail banking: A simple statistical approach ∗","228258070":"Using Hierarchical Models to Shrink Alphas and Interpret Residual Covariance in Mutual Fund Returns","264469326":"APPROACH OF LINEAR MIXED MODEL IN LONGITUDINAL DATA ANALYSIS USING SAS Pankaj Tiwari and Gaurav Shukla","233285993":"Recursive linear mixed models: Some results on shared parameter estimation","264629329":"The inter-trial effect of prepared but not executed antisaccades","238162471":"A review of multilevel modelling in SPSS","223453892":"Spatial dependence and individual-tree growth models: II. Modelling spatial dependence","229936941":"Analysis of Variance Concepts and Computations","254332594":"Joint Estimation of Location, Dispersion, and Random Effects in Robust Design","273026264":"Heterogeneity of error variance and its influence on genotype comparison in multi-location trials","236857662":"Assessing Uncertainty of Regression Estimates in a Response Surface Model for Repeated Measures","34738738":"Métodos de diagnóstico para modelos lineares mistos.","242449489":"(1981). \"Discussion of superpopulati on models.\" Current Topics in Survey Sampling 293-302. ES 2560 \"Chi-Square Tests.\" Encyclopedia of Statistics 442-472. ES3138 Abdoulkhani, A. (2002). Comparison of two hypothesis testing methods for pre-posttest randomized design. Amherst, Ma, Dept of BioEpi, UMASS: 1. ES 2825 Abraham, E. H","229944471":"Bioequivalence and the pharmaceutical industry","220955016":"Using a Generalized Linear Mixed Model to Study the Configuration Space of a PCA+LDA Human Face Recognition Algorithm","233428813":"General-class of covariance-structures for 2 or more repeated factors in longitudinal data-analysis","236159413":"Sensitivity of forest plan value to parameters of simulated annealing","258150347":"Multidimensional Assessment of Value Added by Teachers to Real-World Outcomes","4773089":"A Longitudinal Data Analysis Interpretation of Credibility Models","225945180":"Modelling effects of spatial variability of saturated hydraulic conductivity on autocorrelated overland flow data: Linear mixed model approach","282655092":"Small-scale spatial and temporal variation in the demographic processes underlying the large-scale decline of eiders in the Baltic Sea","216300488":"Spatial Regression Models, Response Surfaces, and Process Optimization","51214755":"IL-6 and IL-10 in post-transplant lymphoproliferative disorders development and maintenance: A longitudinal study of cytokine plasma levels and T-cell subsets in 38 patients undergoing treatment","235432892":"Juvenile growth of hybrid poplars on acidic boreal soil determined by environmental effects of soil preparation, vegetation control, and fertilization","268268490":"APPROACH OF LINEAR MIXED MODEL IN LONGITUDINAL DATA ANALYSIS USING SAS","6602335":"Quantitative genetics of secondary hip joint osteoarthritis in a Labrador Retriever-Greyhound pedigree","26725802":"Treatment of PTLD with Rituximab and CHOP Reduces the Risk of Renal Graft Impairment after Reduction of Immunosuppression","234016332":"Estimation, Testing, and Prediction Regions of the Fixed and Random Effects by Solving the Henderson\u0027s Mixed Model Equations","4729334":"Efficient Estimation of Hedonic Inverse Input Demand Systems","6907990":"The Bovine Fatty Acid Binding Protein 4 Gene Is Significantly Associated With Marbling and Subcutaneous Fat Depth in Wagyu × Limousin F2 Crosses","12511873":"Precision of Measurement of Tissue Concentrations by RLG","226906809":"A composite Latin rectangle and nonstandard strip block design","47430550":"Surface Covering of Downed Logs: Drivers of a Neglected Process in Dead Wood Ecology","266347687":"Analyzing Genotype-Environment Data by Mixed Models with Multiplicative Terms","13871899":"An example of using mixed models and PROC MIXED for longitudinal data","267854270":"Analysis of Recognition Algorithms using Linear, Generalized Linear, and Generalized Linear Mixed Models","253086684":"Wavelet-based functional mixed model analysis: Computation considerations","233195180":"A Comparison of Noniterative Generalized Least Squares and Iterative Maximum Likelihood Estimators When Testing Hypotheses in Random Coefficient Growth Curve Models","7510329":"Familial Aggregation of Airway Responsiveness: A Community-based Study","47160451":"Restricted Maximum Likelihood Estimation of Covariances in Sparse Linear Models","26817493":"RJ: Wavelet-Based Functional Mixed Models","241277741":"Considering Spatial Correlations Between Binary Response Variables in Forestry: An Example Applied to Tree Harvest Modeling","232281109":"Norway maple displays greater seasonal growth and phenotypic plasticity to light than native sugar maple","51635421":"Between-Patient and Within-Patient (Site-to-Site) Variability in Estrogen Receptor Binding, Measured In Vivo by F-18-Fluoroestradiol PET","237769982":"A TUTORIAL ON SIMPLICITY AND COMPUTATIONAL DIFFERENTIATION FOR STATISTICIANS","29866001":"Modelling Loss-Given-Default: A “Point-in-Time“-Approach","254113651":"The Consequences of Ignoring Individuals\u0027 Mobility in Multilevel Growth Models: A Monte Carlo Study","242997932":"Information attainable in some randomly incomplete multivariate response models","257017352":"Efficient maximum likelihood estimation of multiple membership linear mixed models, with an application to educational value-added assessments","5508237":"A likelihood-based approach to mixed modeling with ambiguity in cluster identifiers","12337510":"Nonconjugate Bayesian Analysis of Variance Component Models","232529798":"Rumor Psychology: Social \u0026 Organizational Approaches","268616159":"Linear Model Theory: Univariate, Multivariate, and Mixed Models","12754589":"The Future of Path Analysis, Segregation Analysis, and Combined Models for Genetic Dissection of Complex Traits","266523778":"Multilevel Kernel Methods for Virtual Metrology in Semiconductor Manufacturing","225697555":"Empirical Bayes analysis of variance component models for microarray data","24031631":"Genetic analysis of days from calving to first insemination and days open in Danish Holsteins using different models and censoring scenarios","281705519":"Nonparametric and Semiparametric Regression for Dependent Data","259036694":"Root production of hybrid poplars and nitrogen mineralization improve following mounding of boreal Podzols","261696383":"Applied Multivariate Analysis","264425508":"Combined yield comparison and stability evaluation of rape genotypes using the mixed model","222561580":"Principal pivot transforms: Properties and applications","47531196":"Subjective scaling of spatial room acoustic parameters influenced by visual environmental cues","232231998":"Modelling QTL effect on BTA06 using random regression test day models","228546931":"Introducing the GLIMMIX Procedure for Generalized Linear Mixed Models","230575698":"Theory of Mind and the Brain in Anorexia Nervosa: Relation to Treatment Outcome","221189313":"Multilevel statistical process Control of asynchronous multi-stream processes in semiconductor manufacturing","4994620":"Hedonic Price Models for Dynamic Markets","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","44853343":"How does habitat complexity affect foraging success? A test using functional measures on three continents","226417421":"Transition Matrices: Properties and Estimation Methods","261647328":"Gauss–Seidel Estimation of Generalized Linear Mixed Models With Application to Poisson Modeling of Spatially Varying Disease Rates","280535488":"Adsorption and desorption kinetics of 60Co and 137Cs in fresh water rivers","4745649":"Comparison of GEE, MINQUE, ML, and REML estimating equations for normally distributed data","233293725":"Gaussian process method for form error assessment using coordinate measurements","257996319":"Within-patch mobility and flight morphology reflect resource use and dispersal potential in the dryad butterfly Minois dryas","262930515":"Analysing Deviation-From-Target Data: Applying the Correct Force in Sellick’s Maneuver"},"index":428}