{"abs":"Several strategies relying on kriging have recently been proposed for adaptively estimating contour lines and excursion sets of functions under severely limited evaluation budget. The recently released R package KrigInv is presented and offers a sound implementation of various sampling criteria for those kinds of inverse problems. KrigInv is based on the DiceKriging package, and thus benefits from a number of options concerning the underlying kriging models. Six implemented sampling criteria are detailed in a tutorial and illustrated with graphical examples. Different functionalities of KrigInv are gradually explained. Additionally, two recently proposed criteria for batch-sequential inversion are presented, enabling advanced users to distribute function evaluations in parallel on clusters or clouds of machines. Finally, auxiliary problems are discussed. These include the fine tuning of numerical integration and optimization procedures used within the computation and the optimization of the considered criteria.","title":"KrigInv: An efficient and user-friendly implementation of batch-sequential inversion strategies based on Kriging","id":262369166,"url":"https://www.researchgate.net/publication/262369166_KrigInv_An_efficient_and_user-friendly_implementation_of_batch-sequential_inversion_strategies_based_on_Kriging","names":["Clément Chevalier","Victor Picheny","David Ginsbourger","Computational Statistics \u0026 Data Analysis"],"references":{"222305920":"A general procedure for first/second-order reliabilitymethod (FORM/SORM)","222581573":"Bayesian emulation of complex multi-output and dynamic computer models","44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","260278602":"Design and Modeling for Computer Experiments","41781559":"Gaussian Process for Machine Learning","4818693":"Gaussian processes and limiting linear models","228780015":"Efficient Emulators for Multivariate Deterministic Functions","223416196":"“Response surface method using vector projeted sampling points”","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","215992257":"Genetic Optimization Using Derivatives: The rgenoud Package for R","216301381":"The Design and Analysis Computer Experiments","257017520":"Calibration of computer models with multivariate output","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","2463953":"Numerical Computation Of Multivariate Normal Probabilities","221966156":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","225331924":"The kriging update equations and their application to the selection of neighboring data","220692253":"Engineering Design via Surrogate Modelling: A Practical Guide","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","4749622":"An efficient methodology for modeling complex computer codes with Gaussian processes"},"citedIn":{"281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","262205698":"Editorial: Special issue on statistical algorithms and software in R","264349943":"Passive systems failure probability estimation by the meta-AK-IS2 algorithm","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","257299288":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction"},"index":43}