{"abs":"A self-adaptive fitness formulation is presented for solving constrained optimization problems. In this method, the dimensionality of the problem is reduced by representing the constraint violations by a single infeasibility measure. The infeasibility measure is used to form a two-stage penalty that is applied to the infeasible solutions. The performance of the method has been examined by its application to a set of eleven test cases from the specialized literature. The results have been compared with previously published results from the literature. It is shown that the method is able to find the optimum solutions. The proposed method requires no parameter tuning and can be used as a fitness evaluator with any evolutionary algorithm. The approach is also robust in its handling of both linear and nonlinear equality and inequality constraint functions. Furthermore, the method does not require an initial feasible solution.","title":"Self-Adaptive Fitness Formulation for Constrained Optimization","id":3418762,"url":"https://www.researchgate.net/publication/3418762_Self-Adaptive_Fitness_Formulation_for_Constrained_Optimization","names":["Raziyeh Farmani","Jonathan Wright","IEEE Transactions on Evolutionary Computation"],"references":{"243534212":"How to Solve It: Modern Heuristics","2356071":"On the Use of Non-Stationary Penalty Functions to Solve Nonlinear Constrained Optimization Problems with GA\u0027s","201976512":"Some Guidelines for Genetic Algorithms with Penalty Functions","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","200018848":"Evolutionary Optimization of Constrained Problems","2661477":"Lecture Notes in Computer Science","222501518":"Penalty Guided Genetic Search for Reliability Design Optimization","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","201976024":"Handling Constraints in Genetic Algorithms","233117812":"Coello Coello, C.A.: Treating Constraints as Objective for Single-Objective Evolutionary Optimization. Engineering Optimization 32(3), 275-308","220375156":"Schoenauer, M.: Evolutionary Algorithms for Constrained Parameter Optimization Problems. Evolutionary Computation 4(1), 1-32","225508841":"An Adaptive Algorithm for Constrained Optimization Problems","243744349":"Constrained Optimization Via Genetic Algorithms","30823754":"A Genetic Algorithm for the Multiple-Choice Integer Program","220885494":"Constrained GA Optimization.","3418601":"Yao, X.: Stochastic ranking for constrained evolutionary optimization. IEEE Trans. Evol. Comput. 4, 284-294","267478958":"The COMOGA method: Constrained optimisation by multi-objective genetic algorithms","220801101":"A Note on Usefulness of Geometrical Crossover for Numerical Optimization Problems.","239665697":"The development of a directed genetic search technique for heavily constrained de-sign spaces","243774312":"Constraint Handling Techniques - Penalty Functions","13098216":"Michalewicz, Z.: Evolutionary Algorithms, Homomorphous Mappings, and Constrained Parameter Optimization. Evolutionary Computation 7(1), 19-44","246900871":"Multiobjective Optimization Design with Pareto Genetic Algorithm","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","3642945":"Constrained optimization using two-phase evolutionary programming","2446494":"Adaptive Penalty Methods For Genetic Optimization Of Constrained Combinatorial Problems","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","220702043":"Evolutionary Computation at the Edge of Feasibility.","269055668":"Constraint handling in genetic search - A comparative study","3575241":"On the use of non-stationary penalty functions to solve nonlinear constrained optimization problems with GA\u0027s"},"citedIn":{"251045619":"A Novel Constrained Optimization Evolutionary Algorithm Based on Orthogonal Experimental Design: A Novel Constrained Optimization Evolutionary Algorithm Based on Orthogonal Experimental Design","220647726":"Investigation of Hybrid Particle Swarm Optimization Methods for Solving Transient-Stability Constrained Optimal Power Flow Problems.","264867266":"A Dual-Population Differential Evolution With Coevolution for Constrained Optimization","221104444":"A Rough Set Penalty Function for Marriage Selection in Multiple-Evaluation Genetic Algorithms","266653687":"Two-stage non-dominated sorting and directed mating for solving problems with multi-objectives and constraints","4089897":"A simple elitist genetic algorithm for constrained optimization","3479598":"Transient stability constrained optimal power flow using particle swarm optimisation","225205618":"AMA: A new approach for solving constrained real-valued optimization problems","221007111":"Optimizing detector distribution in V-detector negative selection using a constrained multiobjective immune algorithm","6532173":"Novel engineering approaches to obesity, overweight, and energy balance: Public health needs and research opportunities","274263659":"Parameter Control in Evolutionary Algorithms: Trends and Challenges","4075018":"Constrained optimization based on a multiobjective evolutionary algorithm","239552637":"Alternative Techniques to Handle Constraints in Evolutionary Optimization","221161748":"A Penalty-Based Evolutionary Algorithm for Constrained Optimization","267654095":"Automated design of analog and high-frequency circuits. A computational intelligence approach","238007316":"An Improved Genetic Algorithm Based on J1 Subdivision and Fixed Point Theory","224177950":"Differential evolution with ensemble of constraint handling techniques for solving CEC 2010 benchmark problems","226070333":"Evolutionary Algorithms and Constrained Optimization","251043506":"Immune Clonal Multi-Objective Optimization Algorithm for Constrained Optimization: Immune Clonal Multi-Objective Optimization Algorithm for Constrained Optimization","275073569":"Iterative Dynamic Diversity Evolutionary Algorithm for Constrained Optimization","48341163":"Synthesis of optimum HVAC system configurations by evolutionary algorithm","257153822":"An adaptive penalty based covariance matrix adaptation–evolution strategy","261281245":"A modified feasibility-based rule for solving constrained optimization problems using Probability Collectives","267777959":"A Generic Constraint Handling for Particle Swarm Optimization","223350018":"Using promoters and functional introns in genetic algorithms for neuroevolutionary learning in non-stationary problems","238007419":"A Novel Evolutionary Algorithm with Component-Based Model","221006202":"Nearest Neighbor Evolutionary Algorithm for Constrained Optimization Problem","261052884":"An agricultural resources optimization model","224301826":"Solving multi-contingency transient stability constrained optimal power flow problems with an improved GA","221253485":"Improving Evolutionary Algorithms by a New Smoothing Technique.","46513818":"A statistics-based genetic algorithm for quality improvements of power supplies","254532943":"Gas Lift Optimization Under Facilities Constraints","290855742":"An Improvement for the Conjugate Gradient Analysis Method","233302414":"An orthogonal design based constrained evolutionary optimization algorithm","220216650":"Modified harmony search optimization for constrained design problems","45456601":"Application of PSO for optimization of power systems under uncertainty","273278010":"An exact penalty function-based differential search algorithm for constrained global optimization","286116219":"A Memetic Differential Evolution Algorithm Based on Dynamic Preference for Constrained Optimization Problems","224608538":"Nonlinear Network Optimization—An Embedding Vector Space Approach","228967391":"An empirical study about the usefulness of evolution strategies to solve constrained optimization problems. Int J Gen Syst","232925593":"An Adaptive Constraint Handling Technique for Evolutionary Algorithms","261726181":"Hybrid of Natural Element Method (NEM) with Genetic Algorithm (GA) to find critical slip surface","273294388":"Multi-criteria probability collectives","220935592":"Classification-Assisted Memetic Algorithms for Equality-Constrained Optimization Problems","261491474":"A constrained multiobjective evolutionary algorithm based decomposition and temporary register","220510113":"An Organizational Evolutionary Algorithm for Numerical Optimization.","235694731":"Real-time modelling of a major water supply system","4321992":"A Hybrid Adaptive Evolutionary Algorithm for Constrained Optimization","27412264":"Hybrid Particle Swarm Optimization With Wavelet Mutation and Its Industrial Applications","258799612":"Evolutionary Processes in Complex Networks and Small Worlds","259978220":"1-s2.0-S0045782513003460-main","226163695":"New Multiobjectve PSO Algorithm for Nonlinear Constrained Programming Problems","222797265":"Chen, A.: Constrained handling in genetic algorithms using a gradient-based repair method. Comput. Oper. Res. 33, 2263-2281","235694747":"Self-Adaptive Fitness Formulation for Evolutionary Constrained Optimization of Water Systems","227314960":"Constrained optimization based on hybrid evolutionary algorithm and adaptive constraint-handling technique","236201654":"A hybrid genetic pattern search augmented Lagrangian method for constrained global optimization","4201706":"Robust optimum design of SAW filters with the Taguchi method and a memetic algorithm","220583817":"An efficient algorithm for constrained global optimization and application to mechanical engineering design: League championship algorithm (LCA)","254532486":"Production Enhancement through Integrated Asset Modeling Optimization","235701411":"Adaptive Range Parameter Control","216301643":"Preference Bi-objective Evolutionary Algorithm for Constrained Optimization","6138093":"An Organizational Evolutionary Algorithm for Numerical Optimization","220472726":"Inequality constraint handling in genetic algorithms using a boundary simulation method","281924222":"Test data generation with a Kalman filter-based adaptive genetic algorithm","226755891":"An Adaptive Penalty Function for Handling Constraint in Multi-objective Evolutionary Optimization","233179993":"Constrained multi-objective optimization algorithm with an ensemble of constraint handling methods. Eng Optim","224384413":"An Adaptive Penalty Formulation for Constrained Evolutionary Optimization","220559846":"Evolutionary algorithm using feasibility-based grouping for numerical constrained optimization problems","224178079":"Efficient Constrained Optimization by the ε Constrained Rank-Based Differential Evolution","238511346":"Daubechies Wavelets for High Performance Electronice Structure Calculations: the BigDFT Project","222321030":"Multiobjective and constrained optimization for DS-CDMA code design on the clonal selection principle","235953366":"Developed hydraulic simulation model for water pipeline networks","4201607":"A constrained optimization evolutionary algorithm based on multiobjective optimization techniques","261458258":"A Genetic Algorithm Based on a New Real Coding Approach","221006844":"Constraint handling in multi-objective evolutionary optimization","281678872":"A Variable Reduction Strategy for Evolutionary Algorithms Handling Equality Constraints","257628558":"An adaptive genetic algorithm for parameter estimation of biological oscillator models to achieve target quantitative system response","271948515":"Modification of the SCE-UA to Include Constraints by Embedding an Adaptive Penalty Function and Application: Application Approach","262921590":"A hybrid differential evolution augmented Lagrangian method for constrained numerical and engineering optimization","251902940":"A Novel Constraint-Handling Method Based on Evolutionary Algorithm","221174222":"A New Kind of Handling Constraint Method for Optimization","4277408":"New Multi-objective Genetic Algorithm for Nonlinear Constrained Optimization Problems","221145036":"Road-Junction Traffic Signal Timing Optimization by an adaptive Particle Swarm Algorithm","228471667":"DUAS ABORDAGENS EVOLUTIVAS PARA RESOLVER O DESPACHO ECONÔMICO CONSIDERANDO O EFEITO DO PONTO DE VÁLVULA","3418842":"A Generic Framework for Constrained Optimization Using Genetic Algorithms","3418843":"Sakai, S.: Constrained optimization by applying the α constrained method to the nonlinear simplex method with mutations. IEEE Transactions on Evolutionary Computation 9(5), 437-451","283174930":"Balanced ranking method for constrained optimization problems using evolutionary algorithms","225161624":"A Novel Component-Based Model and Ranking Strategy in Constrained Evolutionary Optimization","261332327":"Constraint handling in Firefly Algorithm","228363113":"A diversity-enriched variant of discrete PSO applied to the design of Water Distribution Networks","220485073":"Handling boundary constraints for numerical optimization by particle swarm flying in periodic search space","221506502":"Handling Constraints in Global Optimization Using an Artificial Immune System","275468445":"A Tabu Search-Based Memetic Algorithm for Hardware/Software Partitioning","224162725":"A Hybrid Evolutionary Approach to the Nurse Rostering Problem","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm","233944817":"IS Published","271917365":"A hybrid cuckoo search algorithm with feasibility-based rule for constrained structural optimization","257548891":"A penalty function-based differential evolution algorithm for constrained global optimization","281968580":"Characterising Constrained Continuous Optimisation Problems","283794401":"Investigations of a GPU-based Levy-Firefly Algorithm for Constrained Optimization of Radiation Therapy Treatment Planning","227679873":"Accelerating adaptive trade‐off model using shrinking space technique for constrained evolutionary optimization","287396914":"An adaptive ES with a ranking based constraint handling strategy","3418912":"A Multiobjective Optimization-Based Evolutionary Algorithm for Constrained Optimization","221494310":"A New Self-adaption Differential Evolution Algorithm Based Component Model","224301640":"A lower-dimensional-search evolutionary algorithm and its application in constrained optimization problems","235953415":"Parametric analysis for genetic algorithms handling parameters","261524111":"Modified estimation of Distribution algorithm with differential mutation for constrained optimization","224174204":"Feasibility Structure Modeling: An Effective Chaperone for Constrained Memetic Algorithms","228945030":"Continuous Dynamic Constrained Optimisation-The Challenges","226858144":"An effective differential evolution with level comparison for constrained engineering design","4090137":"Handling equality constraints by adaptive relaxing rule for swarm algorithms","275722055":"Constrained, mixed-integer and multi-objective optimisation of building designs by NSGA-II with fitness approximation","278036409":"Machine Learning Interpretation of Conventional Well Logs in Crystalline Rocks","251985451":"An optimization method of station distribution","1958184":"SWAF: Swarm Algorithm Framework for Numerical Optimization","224645717":"A Self Adaptive Penalty Function Based Algorithm for Constrained Optimization","258580062":"Constrained Optimization Solution Based on an Improved Genetic Algorithm","220381210":"Ensemble of Constraint Handling Techniques","220741653":"Search space reduction technique for constrained optimization with tiny feasible space","221006957":"An Agent-based Memetic Algorithm (AMA) for Nonlinear Optimization with Equality Constraints","220740713":"Predictive parameter control","256721423":"A novel selection evolutionary strategy for constrained optimization","233871027":"An improved (μ + λ)-constrained differential evolution for constrained optimization","23418912":"Operational Optimal Ship Routing Using a Hybrid Parallel Genetic Algorithm","262163685":"A New Immune Clone Algorithm to solve the constrained optimization problems","264165627":"Adaptive Ranking Mutation Operator Based Differential Evolution for Constrained Optimization","288889983":"Solving the G-problems in less than 500 iterations: Improved efficient constrained optimization by surrogate modeling and adaptive parameter control","261466834":"An intelligent water drops algorithm for solving robot path planning problem","280722428":"Differential evolution algorithm with constraint sequencing: An efficient approach for problems with inequality constraints","222403081":"Differential evolution with dynamic stochastic selection for constrained optimization","4201738":"Constraint handling and stochastic ranking in ACO","266656425":"Controlling selection areas of useful infeasible solutions for directed mating in evolutionary constrained multi-objective optimization","226803915":"Hybrids of Constructive Metaheuristics and Constraint Programming: A Case Study with ACO","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","220514421":"Constraint-handling in nature-inspired numerical optimization: past, present and future. Swarm Evol Comput","221006462":"Incremental approximation of nonlinear constraint functions for evolutionary constrained optimization.","224645691":"Constrained Optimization by the ε Constrained Differential Evolution with Gradient-Based Mutation and Feasible Elites","263736033":"Modified Adaptive Evolutionary Algorithm for Solving JSSP Problems","282743227":"Constrained Probability Collectives with a Penalty Function Approach","257161783":"The solution of unconfined seepage problem using Natural Element Method (NEM) coupled with Genetic Algorithm (GA)","225611804":"Hybridizations of Metaheuristics With Branch \u0026 Bound Derivates","256918079":"The Automatic Dynamic Penalisation method (ADP) for handling constraints with genetic algorithms","278397928":"Boundary Searching Genetic Algorithm: A Multi-objective Approach for Constrained Problems","221008475":"A new constrained optimization evolutionary algorithm by using good point set","262992091":"New Knowledge-based Genetic Algorithm for Excavator Boom Structural Optimization","256721456":"A rough penalty genetic algorithm for constrained optimization","220405410":"Research on Grid Resources Schedule Based on an Adaptive Distribute Parallel Genetic Algorithm","276853508":"Test data generation with a Kalman filter-based adaptive genetic algorithm","220371622":"A hybrid intelligent genetic algorithm","220776614":"Hybrid Good Point Set Evolutionary Strategy for Constrained Optimization","271617952":"Efficient constraint handling for optimal reactive power dispatch problems","260028129":"Constraints handling in Nash/Adjoint optimization methods for multi-objective aerodynamic design","257725122":"Gene Expression Programming Algorithms for Optimization of Water Distribution Networks","233151047":"A practical sequential lexicographic approach for derivative-free black-box constrained optimization","4376033":"Constrained Optimization by the Evolutionary Algorithm with Lower Dimensional Crossover and Gradient-Based Mutation","273191403":"An effective algorithm for constrained optimization based on optics inspired optimization (OIO)","254245504":"A survey and numerical comparison of factor-free penalty function constraint-handling techniques in genetic algorithms","261130810":"An adaptive constraint handling approach embedded MOEA/D","220480136":"A relative feasibility degree based approach for constrained optimization problems","3419014":"An Adaptive Tradeoff Model for Constrained Evolutionary Optimization","271917447":"Layout problem of multi-component systems arising for improving maintainability","221174938":"A Genetic Algorithm Based on a New Fitness Function for Constrained Optimization Problem","257918698":"A NEW METHOD TO EVALUATE SOLUTIONS IN EVOLUTIONARY ALGORITHMS FOR CONSTRAINED OPTIMIZATION PROBLEMS","228823578":"Hybridization of a Genetic Algorithm with a Pattern Search Augmented Lagrangian Method","237148059":"Constrained Optimization Via Artificial Immune System","262293022":"An effective hybrid genetic algorithm with flexible allowance technique for constrained engineering design optimization. Expert Syst Appl","220977813":"Hybrid Particle Swarm Optimization Methods for Solving Transient-Stability Constrained Optimal Power Flow Problems.","27516515":"Methods for Improving Reliability of Evolutionary Computation Algorithms and Accelerating Problem Solving","282388244":"An Improvement for The Conjugate Gradient Analysis Method","228634723":"Hybrid enhanced genetic algorithm to select optimal machining parameters in turning operation","4375937":"Algorithm Comparisons and the Significance of Population Size","221006570":"A Study on Constrained MA Using GA and SQP: Analytical vs. Finite-Difference Gradients","257432720":"A novel memetic algorithm based on invasive weed optimization and differential evolution for constrained optimization","271738362":"Minimum penalty for constrained evolutionary optimization","271325152":"Evolutionary Algorithms for Constrained Optimization","225422496":"The Relation Between Complete and Incomplete Search","220586231":"Analyzing the Simple Ranking and Selection Process for Constrained Evolutionary Optimization","220116170":"A micro niche evolutionary algorithm with lower-dimensional-search crossover for optimisation problems with constraints","266410548":"The Automatic Dynamic Penalisation (ADP) Constraint-Handling Technique for Engineering Optimisation Problems","257917066":"A GENETIC ALGORITHM FOR CONSTRAINT OPTIMIZATION PROBLEMS WITH HYBRID HANDLING OF PENALTY SCHEME","6286727":"Multiobjective Optimization and Hybrid Evolutionary Algorithm to Solve Constrained Optimization Problems","261276235":"Preference Based Multiobjective Evolutionary Algorithm for Constrained Optimization Problems","261562446":"Path planning for multiple mobile robots under double-warehouse","233780272":"Bat Algorithm: A Novel Approach for Global Engineering Optimization","272006097":"Designing automotive embedded systems with adaptive genetic algorithms","262155336":"Multistage covariance matrix adaptation with differential evolution for constrained optimization","270053360":"Adaptive double chain quantum genetic algorithm for constrained optimization problems","224177334":"Self-adaptive evolutionary network coding algorithm: A constraint handling approach","224721035":"A New Constrained Multiobjective Optimization Algorithm Based on Artificial Immune Systems","258303133":"Hu, C.-H.: Solving constrained optimization problems with hybrid particle swarm optimization. Eng. Optim. 40, 1031-1049","250741515":"An Efficient Hybrid Algorithm for Nurse Rostering Problem","261054070":"Usefulness of infeasible solutions in evolutionary search: An empirical and mathematical study","261054069":"An evolutionary algorithm based pattern search approach for constrained optimization","257432740":"A cooperative group optimization system","220558554":"An adaptive decision maker for constrained evolutionary optimization"},"index":441}