{"abs":"We consider a processing system, composed of several parallel queues and a processor, which operates in a time-varying environment that fluctuates between various states or modes. The service rate at each queue depends on the processor bandwidth allocated to it, as well as the environment mode. Each queue is driven by a job traffic flow, which may also depend on the environment mode. Dynamic processor scheduling policies are investigated for maximizing the system throughput, by adapting to queue backlogs and the environment mode. We show that allocating the processor bandwidth to the queues, so as to maximize the projection of the service rate vector onto a linear function of the workload vector, can keep the system stable under the maximum possible traffic load. The analysis of the system dynamics is first done under very general assumptions, addressing rate stability and flow conservation on individual traffic and environment evolution traces. The connection with stochastic stability is later discussed for stationary and ergodic traffic and environment processes. Various extensions to feed-forward networks of such nodes, the multi-processor case, etc., are also discussed. The approach advances the methodology of trace-based modelling of queueing structures. Applications of the model include bandwidth allocation in wireless channels with fluctuating interference and allocation of switching bandwidth to traffic flows in communication networks with fluctuating congestion levels.","title":"Queueing and scheduling in random environments","id":38349657,"url":"https://www.researchgate.net/publication/38349657_Queueing_and_scheduling_in_random_environments","names":["Nicholas Bambos","George Michailidis","Advances in Applied Probability"],"references":{"220682470":"Dynamic Server Allocation to Parallel Queues with Randomly Varying Connectivity","238749946":"Elements of queueing theory","3619509":"On the stationary dynamics of parallel queues with random server connectivities","220084669":"Queueing Dynamics and Maximal Throughput Scheduling in Switched Processing Systems","238836856":"On Mutually Interfering Parallel Servers Subject to External Disturbances","243784847":"Sample-Path Analysis of Queueing Systems","3079239":"Scheduling and performance limits of networks with constantly varying topology","231865848":"The Stability of a Queue with Non-independent Inter-arrival and Service Times","237936125":"Stationary Stochastic Models Wiley","231908773":"On parallel queuing with random server connectivity and routing constraints","200524170":"Matrix Analysis","243769470":"On the optimality of an index rule in multichannel allocation for single-hop mobile networks with multiple service classes","30848399":"Queueing Networks of Random Link Topology: Stationary Dynamics of Maximal Throughput Schedules","2400570":"Scheduling for Multiple Flows Sharing a Time-Varying Channel: The Exponential Rule"},"citedIn":{"256606091":"Monotone Function Estimation for Computer Experiments","220470242":"Erlang loss queueing system with batch arrivals operating in a random environment","266981359":"Optimizing data throughput in client/server systems by keeping queue sizes balanced","224643371":"Flow-Level Stability of Channel-Aware Scheduling Algorithms","228742195":"Performance analysis of finite-source retrial queues operating in random environments","38349789":"Stability of spatial queueing systems","220084808":"Dynamic scheduling for switched processing systems with substantial service-mode switching times","220658237":"Inter-cell coordination in wireless data network","221335274":"Optimal Balancing of Satellite Queues in Packet Transmission to Ground Stations","226736926":"Scheduling and Control of Multi-Node Mobile Communications Systems with Randomly-Varying Channels by Stability Methods","220769717":"Stability of multi-class queueing systems with state-dependent service rates","220083905":"Control of multi-node mobile communications networks with time-varying channels via stability methods","51890034":"Cone Schedules for Processing Systems in Fluctuating Environments","221244490":"Capacity of Wireless Data Networks with Intra- and Inter-Cell Mobility","227202210":"A Queueing Analysis of Data Networks","225582363":"Dynamic power control in a fading downlink channel subject to an energy constraint","220655053":"Resource Allocation and Cross-Layer Control in Wireless Networks","224329397":"Stable Scheduling Policies for Maximizing Throughput in Generalized Constrained Queueing Systems","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","220472148":"Steady state analysis of level dependent quasi-birth-and-death processes with catastrophes","45936654":"Threshold estimation based on a P-value framework","45378310":"Analyse stochastique des réseaux spatiaux.","227026619":"Queuing analysis of max-min fairness, proportional fairness and balanced fairness","224699799":"Scheduling and Control of Mobile Communications Networks with Randomly Time Varying Channels by Stability Methods","224231784":"Inter-Cell Scheduling in Wireless Data Networks","224627606":"On the Singular Behavior of a Queueing System with Random Connectivity","277295216":"Algorithms","228556902":"CONE SCHEDULES FOR PROCESSING SYSTEMS IN RANDOM ENVIRONMENTS","4268541":"A Measurement Based Dynamic Policy for Switched Processing Systems","220243740":"Compensating for Failures with Flexible Servers","51891880":"A two-stage hybrid procedure for estimating an inverse regression\nfunction"},"index":443}