{"abs":"This paper presents and analyzes in detail an efficient search method based on evolutionary algorithms (EA) assisted by local Gaussian random field metamodels (GRFM). It is created for the use in optimization problems with one (or many) computationally expensive evaluation function(s). The role of GRFM is to predict objective function values for new candidate solutions by exploiting information recorded during previous evaluations. Moreover, GRFM are able to provide estimates of the confidence of their predictions. Predictions and their confidence intervals predicted by GRFM are used by the metamodel assisted EA. It selects the promising members in each generation and carries out exact, costly evaluations only for them. The extensive use of the uncertainty information of predictions for screening the candidate solutions makes it possible to significantly reduce the computational cost of singleand multiobjective EA. This is adequately demonstrated in this paper by means of mathematical test cases and a multipoint airfoil design in aerodynamics","title":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","id":3418892,"url":"https://www.researchgate.net/publication/3418892_Single-and_multiobjective_evolutionary_optimization_assisted_by_gaussian_random_field_metamodels_IEEE_Trans_Evol_Comput","names":["Michael Emmerich","Kyriakos C. Giannakoglou","Boris Naujoks","IEEE Transactions on Evolutionary Computation"],"references":{"3421621":"Accelerating Evolutionary Algorithms With Gaussian Process Fitness Function Models","228599201":"Single-and multi-objective airfoil design using genetic algorithms and artificial intelligence","224049497":"Evolutionary Optimization of Computationally Expensive Problems via Surrogate Modeling","2377646":"Evolutionary Algorithms for Multiobjective Optimization","2748217":"Managing Approximation Models in Optimization","268308716":"The theory of evolution strategies","220381108":"Local Function Approximation in Evolutionary Algorithms for the Optimization of Costly Functions","233006324":"Low-cost genetic optimization based on inexact pre-evaluations and the sensitivity analysis of design parameters","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","3421614":"Multiobjective GA Optimization Using Reduced Models","24319849":"Recent Advances in Approximation Concepts for Optimum Structural Design","222477661":"Kriging, cokriging, radial basis functions and the role of positive definiteness. Computers Math. Applic., 24(12), pp. 139-148","216301381":"The Design and Analysis Computer Experiments","256198631":"The Geometry of Random Fields, New York","247045407":"On the Relationship of the Tchebycheff Norm and the Efficient Frontier of Multiple-Criteria Objectives","220045365":"Multiobjective Optimization Using Evolutionary Algorithms. Wiley, New York","245088183":"A study of gold and uranium distribution patterns in the Klerksdorp gold field","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","220690578":"Evolution and Optimum Seeking","1995944":"Introduction to Monte Carlo Methods","2922005":"Evolution Strategies assisted by Gaussian Processes with Improved Pre-Selection Criterion","220176678":"Structure optimization of neural networks for evolutionary design optimization","216301407":"Global versus local search in constrained optimization of computer models","216457263":"Lecture Notes in Computer Science","220701677":"Accelerating the Convergence of Evolutionary Algorithms by Fitness Landscape Approximation.","2642786":"Direct Search Methods: Then And Now","216300590":"Metamodel—Assisted Evolution Strategies","216300591":"Metamodel-assisted Multiobjective Optimisation Strategies and Their Application in Airfoil Design","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","3903856":"Managing approximate models in evolutionary aerodynamic design optimization","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","220132816":"Evolution strategies - a comprehensive introduction. Nat Comput","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","2318192":"Numerical Optimization Using Computer Experiments","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","220045387":"Multi-objective genetic algorithms with application to control engineering problems","222091365":"Accelerating Evolutionary Algorithms with Gaussian Process Fitness Function Models","34288727":"Interpolation and pseudorandom function generation /","37405927":"Numerical Recipes in FORTM: The Art of Scientific Computing","228957563":"ON THE USE OF SURROGATE EVALUATION MODELS IN MULTI-OBJECTIVE EVOLUTIONARY ALGORITHMS","243778009":"A note on weighted criteria methods for compromise solutions in multi-objective optimization","220801096":"Problem-Independent Handling of Constraints by Use of Metric Penalty Functions.","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","222303526":"Surrogates for numerical simulations; optimization of eddy-promoter heat exchangers","2764365":"SDO: A Statistical Method for Global Optimization","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","240851631":"A rigorous analysis of two bi-criteria problem families with scalable curvature of the pareto fronts","4074955":"Computationally effective search and optimization procedure using coarse to fine approximations","235709562":"A Reduced-Cost Multi-Objective Optimization Method Based on the Pareto Front Technique, Neural Networks and PVM","242981379":"Error estimates for modified local Shepard\u0027s interpolation formula","220176614":"Faster convergence by means of fitness estimation","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","266349214":"Introduction to Gaussian Processes","2350812":"Problem-Independent Handling of Constraints by Use of Metric Penalty Functions"},"citedIn":{"259176819":"Error Metrics and the Sequential Refinement of Kriging Metamodels","4251716":"Playing in the Objective Space: Coupled Approximators for Multi-Objective Optimization","257345104":"Kriging metamodel global optimization of clinching joining processes accounting for ductile damage","29603268":"Study of some strategies for global optimization using Gaussian process models with application to aerodynamic design","226815117":"Central Force Optimization: A New Nature Inspired Computational Framework for Multidimensional Search and Optimization","229550759":"A non‐dominance‐based online stopping criterion for multi‐objective evolutionary algorithms","264428751":"Combining Gaussian processes, mutual information and a genetic algorithm for multi-target optimization of expensive-to-evaluate functions","221008674":"Evolutionary optimization of ship propulsion systems","221008162":"Tchebycheff Approximation in Gaussian Process Model Composition for Multi-objective Expensive Black Box","224330064":"Automated Solution Selection in Multi-Objective Optimisation","261189763":"A Gaussian Process Surrogate Model Assisted Evolutionary Algorithm for Medium Scale Expensive Optimization Problems","262334646":"Exploiting domain knowledge in system-level MPSoC design space exploration","289460312":"Multi-objective Optimisation Using Evolutionary Algorithms: An Introduction","227114128":"Multiobjective Metamodel–Assisted Memetic Algorithms","227537813":"Surrogate‐based infill optimization applied to electromagnetic problems","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","259151213":"A Random Field Model and its Application in Industrial Production","262891403":"Exploring or reducing noise?: A global optimization algorithm in the presence of noise","224258684":"Synthesis of Integrated Passive Components for High-Frequency RF ICs Based on Evolutionary Computation and Machine Learning Techniques","220741391":"Towards high speed multiobjective evolutionary optimizers","220045365":"Multiobjective Optimization Using Evolutionary Algorithms. Wiley, New York","275722055":"Constrained, mixed-integer and multi-objective optimisation of building designs by NSGA-II with fitness approximation","261489850":"Kriging-Assisted Multi-Objective Particle Swarm Optimization of permanent magnet synchronous machine for hybrid and electric cars","282322659":"On the Performance of Classification Algorithms for Learning Pareto-Dominance Relations","6532179":"Diffusion tensor imaging: techniques and clinical applications.","261430433":"Surrogate enhanced interactive genetic algorithm with weighted Gaussian process","6532182":"Functional brain imaging with BOSS FMRI","258792538":"Variable-Fidelity Electromagnetic Simulations and Co-Kriging for Accurate Modeling of Antennas","267654095":"Automated design of analog and high-frequency circuits. A computational intelligence approach","220702236":"Parameter Tuning Boosts Performance of Variation Operators in Multiobjective Optimization","50372157":"Agrégation d\u0027informations et alternative au krigeage en environnement aléatoire","220825623":"An Evolutionary Algorithm with Spatially Distributed Surrogates for Multiobjective Optimization","221228399":"OCD: Online Convergence Detection for Evolutionary Multi-Objective Algorithms Based on Statistical Testing","262605029":"Evolutionary Programming for High-Dimensional Constrained Expensive Black-Box Optimization Using Radial Basis Functions","221007471":"Full-atom ab initio protein structure prediction with a Genetic Algorithm using a similarity-based surrogate model","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","262253284":"A Genetic Algorithm Assisted by a Locally Weighted Regression Surrogate Model","261308117":"A study on fitness inheritance for enhanced efficiency in real-coded genetic algorithms","288889983":"Solving the G-problems in less than 500 iterations: Improved efficient constrained optimization by surrogate modeling and adaptive parameter control","254013547":"A study of surrogate models for their use in multiobjective evolutionary algorithms","202256709":"A reduced-cost SMS-EMOA using kriging, self-adaptation, and parallelization","273958687":"Stochastic Process Model for the Optimization of a Rotorcraft with Categorical Variables","271436640":"Optimizing PID controller tuning for greenhouse lighting control system by varying number of objectives","259170620":"How can surrogates influence the convergence of evolutionary algorithms?","258568998":"Cokriging for Robust Design Optimization","224570931":"Closed-loop evolutionary multiobjective optimization","245310926":"Distributed Evolutionary Algorithms with Hierarchical Evaluation","235710045":"A Subjective Review of the State of the Art in Model-Based Parameter Tuning","260712414":"GASPAD: A General and Efficient mm-Wave Integrated Circuit Synthesis Method Based on Surrogate Model Assisted Evolutionary Algorithm","261196997":"Multi-objective airfoil shape optimization using a multiple-surrogate approach","262328308":"An evolution strategy assisted by an ensemble of local Gaussian process models","39995444":"An Enhanced Probability of Improvement Utility Function for Locating Pareto Optimal Solutions","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","260125143":"Engineering Design and Decision Making Models","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","226383142":"A class of test functions for global optimization","226202147":"Recent Developments in Evolutionary Multi-Objective Optimization","261197001":"Self-adaptive lower confidence bound: A new general and effective prescreening method for Gaussian Process surrogate model assisted evolutionary algorithms","259982630":"‘Hang On a Minute’: Investigations on the Effects of Delayed Objective Functions in Multiobjective Optimization","221278827":"A Design Space Exploration Methodology Supporting Run-Time Resource Management for Multi-Processor Systems-on-Chip","221494383":"On the Performance of Metamodel Assisted MOEA/D","281668759":"Kriging model based many-objective optimization with efficient calculation of expected hypervolume improvement","272525408":"Business-driven policy optimization for service management","261131215":"Pareto Rank Learning in Multi-objective Evolutionary Algorithms","229046265":"On a Class of Global Optimization Test Functions","254230087":"Reduced order model assisted evolutionary algorithms for multi-objective flow design optimization","258163201":"Fast calculation of multiobjective probability of improvement and expected improvement criteria for Pareto optimization","282584756":"A Study on Many-Objective Optimization Using the Kriging-Surrogate-Based Evolutionary Algorithm Maximizing Expected Hypervolume Improvement","251179420":"Static MOSD","262865103":"Reliable reduced cost modeling and design optimization of microwave filters using co‐kriging","278660603":"On the Statistical Models-Based Multi-objective Optimization","262293450":"MOEA/D assisted by RBF networks for expensive multi-objective optimization problems","262358479":"An exploration methodology for a customizable OpenCL stereo-matching application targeted to an industrial multi-cluster architecture","221025346":"Real-World Applications of Multiobjective Optimization","269567359":"Benefits of Incorporating Designer Preferences Within a Multi-Objective Airfoil Design Framework","278697453":"Electromagnetic Design Automation: Surrogate Model Assisted Evolutionary Algorithm","220981336":"Improving many-objective optimizers with aggregate meta-models","235720063":"An application of a GA with Markov network surrogate to feature selection","245440213":"Central force optimization: A new metaheuristic with applications in applied electromagnetics","39997974":"Computational electromagnetics for design optimisation: The state of the art and conjectures for the future","221006937":"Clustered Multiple Generalized Expected Improvement: A Novel Infill Sampling Criterion for Surrogate Models","272374601":"Multi objective optimization of computationally expensive multi-modal functions with RBF surrogates and multi-rule selection","221024596":"Meta-Modeling in Multiobjective Optimization","220714332":"Multi-processor system-on-chip Design Space Exploration based on multi-level modeling techniques","4348473":"New trends in optimization in electromagnetics","227210998":"On Similarity-Based Surrogate Models for Expensive Single- and Multi-objective Evolutionary Optimization","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","226716412":"Kriging Is Well-Suited to Parallelize Optimization","262317021":"Advances in Evolutionary Multi-objective Optimization","262309408":"A Surrogate-Based Intelligent Variation Operator for Multiobjective Optimization","277278208":"On the Performance of Classification Algorithms for Learning Pareto-Dominance Relations","51014274":"Optimisation multi-objectifs à base de métamodèle pour les procédés de mise en Forme","235720068":"The Markov Network Fitness Model","254006190":"\"Smart\" Design Space Sampling to Predict Pareto-Optimal Solutions","235709827":"Optimizing Support Vector Machines for Stormwater Prediction","216301163":"Advanced concepts for multi-objective evolutionary optimization in aircraft industry","272846284":"GP-DEMO: Differential Evolution for Multiobjective Optimization based on Gaussian Process models","261110016":"Combining surrogate models and local search for dealing with expensive multi-objective optimization problems","223849924":"CFD-based analysis and two-level aerodynamic optimization on graphics processing units","265599047":"Dynamic Real-Time Substrate Feed Optimization of Anaerobic Co-Digestion Plants","220741054":"Mixed-Integer Evolution Strategy using multiobjective selection applied to warehouse design optimization","232610378":"A Reproducing Kernel-Based Spatial Model in Poisson Regressions","221008054":"Model-based Optimization Revisited: Towards Real-World Processes","285582494":"Steady State IBEA Assisted by MLP Neural Networks for Expensive Multi-Objective Optimization Problems","282908480":"Optimizing Thin Film Tool Coatings Using a Finite Element Computer Simulator","224246979":"ASM-MOMA: Multiobjective memetic algorithm with aggregate surrogate model","228570175":"Metamodel assisted genetic algorithm for truss weight minimization","238735258":"Universiteit Leiden Opleiding Informatica","243971115":"Cost-efficient EM-simulation-driven antenna design using co-kriging","225622230":"Knowledge Incorporation in Multi-objective Evolutionary Algorithms","52003261":"A line search approach for high dimensional function optimization","287992462":"Multi-Objective Adaptive Surrogate Modeling-Based Optimization for Parameter Estimation of Large, Complex Geophysical Models","254462092":"Surrogate Modeling in the Evolutionary Optimization of Catalytic Materials","258475215":"Swarm Heuristic for Identifying Preferred Solutions in Surrogate-Based Multi-Objective Engineering Design","216300879":"Aerodynamic Design of Compressor Airfoils using Hierarchical, Distributed, Metamodel-Assisted Evolutionary Algorithms","282425720":"Kriging-based infill sampling criterion for constraint handling in multi-objective optimization","220741511":"A Pareto Following Variation Operator for Fast-Converging Multiobjective Evolutionary Algorithms","235709880":"An Efficient High-Frequency Linear RF Amplifier Synthesis Method Based on Evolutionary Computation and Machine Learning Techniques","221008536":"Fuzzy Clustering Based Gaussian Process Model for Large Training Set and Its Application in Expensive Evolutionary Optimization","283747933":"Building accurate radio environment maps from multi-fidelity spectrum sensing data","47805548":"Multilevel Modeling","43797802":"A Mono Surrogate for Multiobjective Optimization","271366292":"Efficient multi-criteria optimization on noisy machine learning problems","226738239":"Multilevel Optimization Algorithms Based on Metamodel- and Fitness Inheritance-Assisted Evolutionary Algorithms","254058648":"OSCAR: An Optimization Methodology Exploiting Spatial Correlation in Multicore Design Spaces","280304905":"SMAS: A Generalized and Efficient Framework for Computationally Expensive Electronic Design Optimization Problems","222646520":"Low cost PSO using metamodels and inexact pre-evaluation: Application to aerodynamic shape design","221006227":"The application of evolutionary multi-criteria optimization to dynamic molecular alignment","238766980":"Automated Response Surface Model Generation with Sequential Design","245435934":"Comparison of Several Optimization Strategies for Robust Turbine Blade Design","216301349":"Two-layered Surrogate Modeling for Tuning Optimization Metaheuristics","221008365":"Efficient aerodynamic optimization of a very light jet aircraft using evolutionary algorithms and RANS flow models.","44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","220320738":"Evolutionary Model Type Selection for Global Surrogate Modeling","262374496":"Damage Prediction in Metal Forming Process Modeling and Optimization: Simplified Approaches","282400016":"Multiobjective optimization of expensive-to-evaluate deterministic computer simulator models","50277178":"Metamodel assisted multi-objective optimization for metal forming applications","227103052":"Multi-objective optimization based on meta-modeling by using support vector regression. Optim Eng","38092675":"Multi-objective optimization with controlled model assisted evolution strategies","265486868":"MULTIDISCIPLINARY DESIGN OPTIMIZATION OF COMPLEX ENGINEERING SYSTEMS FOR COST ASSESSMENT UNDER UNCERTAINTY","260622144":"Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering","240630683":"Design Space Exploration of Multi-Processor Systems-on-Chip","28357502":"Genetische Programmierung einer algorithmischen Chemie","223466655":"Self-Adaptive Surrogate-Assisted Covariance Matrix Adaptation Evolution\nStrategy","221905385":"Surrogate-Assisted Artificial Immune Systems for Expensive Optimization Problems","221061113":"A correlation-based design space exploration methodology for multi-processor systems-on-chip","220880371":"Meta-model Assisted Optimization for Design Space Exploration of Multi-Processor Systems-on-Chip","269269971":"Interleaving methods for hybrid system-level MPSoC design space exploration","274492035":"Design-Space Exploration and Runtime Resource Management for Multicores","221837016":"Resampling Methods for Meta-Model Validation with Recommendations for Evolutionary Computation","224472195":"Uncertainty of Constraint Function in Evolutionary Multi-objective Optimization","277072736":"MULTIPLES MÉTAMODÈLES POUR L\u0027APPROXIMATION ET L\u0027OPTIMISATION DE FONCTIONS NUMÉRIQUES MULTIVARIABLES","220497345":"Surrogate-assisted clonal selection algorithms for expensive optimization problems","257352368":"Aggregate meta-models for evolutionary multiobjective and many-objective optimization","262323269":"A Surrogate Based Multiobjective Evolution Strategy with Different Models for Local Search and Pre-Selection","220063473":"A Novel Global Optimization Technique for High Dimensional Functions","261045347":"Fitness Modeling With Markov Networks","260711290":"An Efficient Method for Antenna Design Optimization Based on Evolutionary Computation and Machine Learning Techniques","261054334":"Hypervolume-based expected improvement: Monotonicity properties and exact computation","272891057":"Quantifying uncertainty on Pareto fronts with Gaussian Process conditional simulations","222544049":"Response Surface Approximation of Pareto Optimal Front in Multi-objective Optimization","28669767":"Untersuchung von Optimierungsverfahren für rechenzeitaufwändige technische Anwendungen in der Motorenentwicklung","220702165":"Multiobjective Optimization on a Limited Budget of Evaluations Using Model-Assisted $\\mathcal{S}$ -Metric Selection","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","216457235":"A SEQUENTIAL DESIGN FOR APPROXIMATING THE PARETO FRONT USING THE EXPECTED PARETO IMPROVEMENT FUNCTION","220739549":"Tuning optimization algorithms for real-world problems by means of surrogate modeling","224235941":"Global optimization of integrated transformers for high frequency microwave circuits using a Gaussian process based surrogate model","261346670":"Design space pruning through hybrid analysis in system-level design space exploration","263010896":"Performance Analysis of a (1+1) Surrogate-assisted Evolutionary Algorithm","271445970":"Multiobjective optimisation on a budget: Exploring surrogate modelling for robust multi-reservoir rules generation under hydrological uncertainty"},"index":457}