{"abs":"This is a brief review of the current situation concerning practical pseudorandom number generation for Monte Carlo calculations. The conclusion is that pseudorandom number generators with the required properties are now available, but the generators actually used are often not good enough. Portable Fortran code is given for three different pseudorandom number generators, all of which have much better properties than any of the traditional generators commonly supplied in most program libraries.","title":"A Review of Pseudorandom Number Generators","id":222468860,"url":"https://www.researchgate.net/publication/222468860_A_Review_of_Pseudorandom_Number_Generators","names":["Fred James","Computer Physics Communications"],"references":{"23636505":"Toward a Universal Random Number Generator","234789148":"L\u0027ecuyer, P. Efficient and portable combined random number generators. Communications of the ACM","252622717":"Monte Carlo theory and practice","200104971":"A random number generator for PC\u0027s","230663814":"Zaremba, S.K.: The mathematical basis of Monte Carlo and Quasi-Monte Carlo methods. SIAM Review 10(3), 303-314","200104855":"A very fast shift-register sequence random number generator. J. of Computat. Phys. 40, 517-526","238678083":"Quasi-Monte Carlo Methods and Pseudo-Random Numbers","222387978":"Matrices and the structure of random number sequences","7187654":"Random Numbers Fall Mainly in the Planes"},"citedIn":{"2838568":"Simulational Studies of Energy Deposition and Secondary Processes in Deep X-Ray Lithography","8175737":"GATE: a simulation toolkit for PET and SPECT. Phys Med Biol","253029139":"Dynamic Monte Carlo description of thermal desorption processes","257619799":"On the Likelihood and Fluctuations of Gaussian Realizations","233835518":"A Random Number Generator Based on Unpredictable Chaotic Functions","247728340":"Random-Number Generator Validity in Simulation Studies: An Investigation of Normality","251167977":"From Mersenne Primes to Random Number Generators","276832403":"Accelerating dissipative particle dynamics simulations for soft matter systems","232635848":"JAPARA — A Java Parallel Random Number Generator Library for High-Performance Computing","225507173":"Computational field theory and pattern formation","225395568":"On the autocorrelation structure of inversive congruential pseudorandom number sequences","227190677":"Cross-correlation between simultaneously generated sequences of pseudo-random uniform deviates","223001962":"Optical blur and collection efficiency in columnar phosphors for X-ray imaging","258324294":"Mathematical Tools or Statistics, Monte Carlo, Group Theory","224960332":"Ab initio theory of perpendicular magnetotransport in metallic multilayers","252387118":"Computer Simulation Study of a Nematogenic Lattice Model Based on the Nehring-Saupe Interaction Potential","239758445":"Monte Carlo simulation of cation transport via vacancies in spinel solid solutions: One type of cation exchange prevails","239619169":"Chaos-induced true randomness","27271562":"Electron transport in magnetic multilayers: Effect of disorder","256640359":"Analytical Cross Sections for Monte Carlo Simulations of Photon Transport","40695879":"Assessment of the suitability of different random number generators for Monte Carlo simulations in gamma-ray spectrometry","220439822":"Parallelization Of Monte Carlo Simulations And Submission To A Grid Environment.","13268197":"Four-dimensional pure compact U(1) gauge theory on a spherical lattice","222473075":"CLHEP—a project for designing a C++ class library for high energy physics","245070506":"Analytical and Monte Carlo computations of the energy losses by ionisation and their fluctuations in 3,4He","241975384":"Potts-model grain growth simulations: Parallel algorithms and applications","225787200":"Computers in the design and analysis of HEP experiments","262594462":"IMPLANTACIÓN EN EMTP DE UN PROCEDIMIENTO BASADO EN EL MÉTODO DE MONTE CARLO PARA ANALIZAR EL COMPORTAMIENTO DE LÍNEAS DE TRANSMISIÓN FRENTE AL RAYO","223698285":"HERWIG 5.1 - a Monte Carlo event generator for simulating hadron emission reactions with interfering gluons","13227761":"Network Approach to Void Percolation in a Pack of Unequal Spheres","252506934":"Assembler RANLUX for PCs","235514418":"Adatom dynamics and diffusion in a model of O/W(110)","255622407":"Monte Carlo simulations of electronic excitation transfer in polymer composites and comparison to theory","5993056":"The calculation of dose enhancement close to platinum implants for skull radiography","230482311":"Parallel stochastic simulations with rigorous distribution of pseudo‐random numbers with DistMe: Application to life science simulations","2392088":"Random Number Generators for Parallel Computers","224960340":"The influence of defects on electrical transport in magnetic multilayers","275936334":"Comparison of ISO-GUM and Monte Carlo Method for Evaluation of Measurement Uncertainty","223248753":"Systematic searches for good multiple recursive random number generators","33421757":"The white dwarf luminosity function – I. Statistical errors and alternatives","29523331":"Monte Carlo program BHLUMI 2.01 for Bhabha scattering at low angles with Yennie-Frautschi-Suura exponentiation","281461895":"Avoidance Techniques \u0026 Neighbourhood Topologies in Particle Swarm Optimisation","222996239":"Efficient biased random bit generation for parallel lattice gas simulations","243447495":"Noise-induced fronts","45917434":"Some Comments on C. S. Wallace\u0027s Random Number Generators","33421755":"The contribution of oxygen-neon white dwarfs to the MACHO content of the Galactic halo","200104357":"Pseudo Random Numbers: Generation and Quality Checks","245529839":"A Repetition Test for PseudoRandom Number Generators","265264513":"Parallel Monte Carlo Simulations of Vapour-Liquid Systems","256153364":"The Monte Carlo program LESKO-F for deep inelastic e±p → e± X scattering at HERA including QED bremsstrahlung from the lepton line","1960013":"One-Pass, One-Hash n-Gram Statistics Estimation","41519656":"A versatile FPGA-based high speed bit error rate testing scheme /","2179186":"Hurst\u0027s Rescaled Range Statistical Analysis for Pseudorandom Number Generators used in Physical Simulations","242806828":"Rounding errors in random number generators","263801324":"On a Direct Estimate of Densities of States and Partition Functions","10732793":"Exact solutions to chaotic and stochastic systems","230025705":"Estimation of variance components due to imprinting effects with DFREML and VCE: Results of a simulation study","1796167":"Monte Carlo simulations of the halo white dwarf population","29521823":"The Monte Carlo program KORALZ, version 3.8, for the lepton or quark pair production at LEP/SLC energies","242970661":"On the lattice structure of pseudo random numbers generated by the modified inversive congruential generator with modulus 2 α","240669190":"Determination of the degree of compositional disorder in magmatic enclaves using SEM X-ray element maps","13323951":"Microcanonical ensemble Monte Carlo method for discrete systems","249050301":"Kinetic networks and order statistics for hopping in disordered systems","253577083":"Statistical Independence of a New Class of Inversive Congruential Pseudorandom Numbers","43020022":"Phase diagram and critical behavior of the square-lattice Ising model with competing nearest- and next-nearest-neighbor interactions","35947075":"Diffusive dynamics of interacting particles in equilibrium and under hydrodynamic sedimentation /","222442280":"QED multiphoton corrections to Bhabha scattering at low angels. Monte Carlo solution","251983215":"A random number generator for low power cryptographic application","266655112":"Rocovo : Robust Communal Publication Scheme","233565062":"Effect of hydraulic conductivity probability distribution function on simulated solute leaching","222070610":"Chaotic and stochastic functions","230990262":"Binder, K. Applications of Monte Carlo methods to statistical physics. Rep. Prog. Phys. 60, 487-559","261117922":"Lightweight digital hardware random number generators","2649680":"Uniform Random Number Generators for Vector and Parallel Computers","243256839":"Monte Carlo calculations on the dimensional crossover of thin Ising films","222517048":"Thiebaut R. Robustness of the linear mixed model to misspecified error distribution","244164848":"Pyramidal growth on bcc(001) stabilises facets close to {012}: A Monte Carlo study","1990752":"Bit Level Correlations in Some Pseudorandom Number Generators","2908333":"Uniform Random Number Generators for Supercomputers","224633319":"Parallel Monte Carlo simulation of imaging systems","271225006":"Application of the CIEMAT–NIST method to plastic scintillation microspheres","235567746":"Comment on \"Universal formulas for percolation thresholds\"","222485448":"Dimensionality analysis of multiparticle production at high energies","201976450":"Cracking and Co-Evolving Randomizers","223085511":"High-energy-physics event generation with PYTHIA 6.1","242806516":"A fast random number generator for the Intel Paragon supercomputer","45912625":"Fast normal random number generators on vector processors","282935884":"Efficient and robust quantum random number generation by photon number detection","1826441":"An Introduction to Monte Carlo Simulation of Statistical physics Problem","226589458":"Uniform Random Number Generation","2264247":"Random Number Generation on Parallel Computer Systems","234443119":"K→πνν¯ and K→πνν¯ decays in the general MSSM","222174633":"KORALB version 2.1. An upgrade with the TAUOLA library of τ decays","1863814":"Physical Tests for Random Numbers in Simulations","290787279":"Efficiency Calculation of Gamma Detectors by Monte Carlo Methods","280536099":"Fast CPU-based Monte Carlo simulation for radiotherapy dose calculation","222367196":"Pseudorandom number generators for Salford FTN77","13306985":"Order-disorder in a model lattice-mismatched binary alloy","221527953":"Testing Random Number Generators","3306138":"Implementation and Evaluation of a Web- Based Grid-Enabled Environment for WCDMA Multibeam System Simulations [Wireless Corner]","223835646":"A package of Linux scripts for the parallelization of Monte Carlo simulations","247329303":"Random Number Generation and Simulation on Vector and Parallel Computers","227705148":"The white dwarf luminosity function – II. The effect of the measurement errors and other biases","2612360":"Parallel Random Number Generation and High Performance Fortran","238834317":"On the Lattice Structure of Certain Linear Congruential Sequences Related to AWC/SWB Generators","222201229":"Monte Carlo simulation of bremsstrahlung emission by electrons","278395939":"A universal GFSR random number generator for personal computers","221829005":"Monte Carlo simulation of the Spearman-Kaerber TCID50","237511312":"Structure of complex systems using electronic excitation transport: Theory, Monte Carlo simulations, and experiments on micelle solutions","273788139":"DA white dwarfs from the LSS-GAC survey DR1: The preliminary luminosity and mass functions and formation rate","223682030":"RANLUX: A Fortran implementation of the high-quality pseudorandom number generator of Lüscher","47932517":"Shokkikiihdytys Auringon koronassa","223119244":"Pseudorandom number generators for personal computers","220067805":"Random number generators: Pretty good ones are easy to find","1871580":"Stochastic Effects in Physical Systems","263868798":"ABSOLUTELY UNPREDICTABLE CHAOTIC SEQUENCES","229294956":"Energy-Deposition Distributions in Materials Irradiated by Plane-Parallel Electron Beams with Energies Between 0.1 and 100 MeV","12056689":"Determining changes in NIR absorption using a layered model of the human head","227666263":"Simulating Gaia performances on white dwarfs","230209919":"Shape asymmetry of star‐branched random walks and nonreversal random walks","41697973":"White dwarfs with hydrogen-deficient atmospheres and the dark matter content of the Galaxy","43374686":"Considerations on correlations in shift-register pseudorandom number generators and their removal","13485574":"Variation of fractionator estimates and its prediction","256392581":"Gates towards evolutionary large-scale optimization: A software-oriented approach to genetic algorithms—II. Toolbox description","226680143":"A stochastic model for the permeability characteristics of saturated cemented porous media undergoing freezing","253184473":"Photoinduced electron transfer and geminate recombination in liquids: Analytical theory and Monte Carlo simulations","242806953":"A note on varying lattice isotropy","2407670":"A Fast Algorithm For Testing Irreducibility Of Trinomials Mod 2","253994992":"Quantum free-energy calculations: Optimized Fourier path-integral Monte Carlo computation of coupled vibrational partition functions","242806443":"COJETS 6.23: a Monte Carlo simulation program for -p, p-p collisions and e+e- annihilation","244382276":"Study of the permeability characteristics of porous media with methane hydrate by pore network model","236107467":"Impact of stochastic accelerations on dopant segregation in microgravity semiconductor crystal growth","238884065":"On the Use of Reducible Polynomials as Random Number Generators","47651381":"PHOTOS interface in C++ technical and physics documentation","223544240":"LVQNET 1.10 — a program for neural net and statistical pattern recognition","222474145":"TWOGEN—a simple Monte Carlo generator for two-photon reactions","221529552":"ANALYSIS OF ADD-WITH-CARRY AND SUBTRACT-WITH-BORROW GENERATORS","229930321":"Multiple‐facility loading under capacity‐based economies of scope","228934477":"Simulations for UHE Cosmic Ray Experiments","237701825":"The MC++ event generator toolkit - version 0","7884436":"Dizzy: Stochastic Simulation of Large-Scale Genetic Regulatory Networks","273888447":"GATE Monte Carlo simulation in radiation therapy for complex and dynamic beams in IMRT","6828678":"Optimization of the Monte Carlo code for modeling of photon migration in tissue","2483412":"A Parallel Genetic Algorithm for the Set Partitioning Problem","2652890":"PRNGlib: A Parallel Random Number Generator Library","10952788":"A Linear, Four-Spin Mn(II)−Nitronyl−Nitroxide-Substituted Phosphine Oxide System Exhibiting Both Antiferro- and Ferromagnetic Interactions §","24015773":"SIMANN: A Global Optimization Algorithm using Simulated Annealing","253974487":"A first-passage algorithm for the hydrodynamic friction and diffusion-limited reaction rate of macromolecules","21268913":"Monte Carlo techniques in medical radiation physics. Phys Med Biol","238530754":"How Monte Carlo Simulations Can Clarify Complex Problems in Statistical Physics","13325364":"Operational conditions for random-number generation","265916632":"Untersuchung der Pfropfendynamik und -stabilität bei der vertikalen und horizontalen Pfropfenförderung","222746178":"Chaos and randomness","227768983":"Monte Carlo simulations of the disc white dwarf population","221525041":"New methods for pseudorandom numbers and pseudorandom vector generation","2674479":"Techniques for Empirical Testing of Parallel Random Number Generators","245642152":"Chaotic Random Number Generators with Random Cycle Lengths","234804978":"New inversive congruential pseudorandom number generator with power of two modulus","230213300":"Dominant vs. codominant genetic markers in the estimation of male mating success","220942374":"The Software-Oriented Stream Cipher SSC2","30861511":"Statistical Performance Evaluation, System Modeling, Distributed Computation, and Signal Pattern Matching for a Compton Medical Imaging System.","263006399":"Monte Carlo simulations of post-common-envelope white dwarf + main sequence binaries: Comparison with the SDSS DR7 observed sample","282588611":"A General Evaluation Pattern for Pseudo Random Number Generators","31149763":"The Role of Chaotic Dynamics and Flow Fields in the Development of Disequilibrium Textures in Volcanic Rocks","249645562":"A Family of Hybrid Random Number Generators with Adjustable Quality and Speed","1862912":"Analysis of Random Number Generators Using Monte Carlo Simulation","8348514":"Response of tree biomass and wood litter to disturbance in a Central Amazon forest","221348910":"Interfaces and Implementations of Random Number Generators for JAVA Grande Appllications.","222498915":"OEDIPUS: Onium Evolution, Dipole Interaction and Perturbative Unitarisation Simulation","11398029":"Framework for testing random numbers in parallel calculations","1801018":"Random Numbers from Astronomical Imaging","225828439":"Monte Carlo Methods","282953726":"Biased random sequence generation for making common player believe it unbiased","277065128":"Acceleration of GATE Monte Carlo simulations","1862961":"Logistic Map: A Possible Random Number Generator","47282175":"PENELOPE-2008: A code system for Monte Carlo simulation of electron and photon transport","222460013":"A comparative study of some pseudorandom number generators","230981355":"Magnetic and Optical Properties and Electron Paramagnetic Resonance of Gadolinium-Containing Oxide Glasses","267656411":"A novel detection of periodic phenomena of binary chaotic sequences","235488570":"Propagating nature in chaotic systems","277292466":"JETNET 3.0 -- A Versatile Artificial Neural Network Package","238686988":"PSEUDORANDOM NUMBER GENERATORS, GOODNESS OF FIT TESTS, AND STOCHASTIC SIMULATION OF HETEROGENEOUS TUMORS","264955132":"The emerging role of Multiscale Modeling in nano- and micro-mechanics of materials","254401040":"RECONFIGURABLE HARDWARE SAT SOLVING","281635315":"A GPU OpenCL based cross-platform Monte Carlo dose calculation engine (goMC)","1864487":"New tests of random numbers for simulations in physical systems","3151115":"Rigorous Distribution of Stochastic Simulations Using the DistMe Toolkit","6183708":"Cluster computing software for GATE simulations","13303695":"Universality of the Ising model on spherelike lattices","277283778":"1 Hierarchial Models of Nanomechanics and Micromechanics","285493313":"Application of a theoretical equation-of-state model for calculating the thermodynamic parameters of NH3-H-2 binary mixtures based on a modified Exp-6 intermolecular interaction potential","229328102":"A novel dynamic model of pseudo random number generator","281585030":"Proceedings of the International Conference on Electrical and Electronic Engineering Telecommunication Engineering, and Mechatronics (EEETEM2015), Kuala Lumpur, Malaysia, 2015","49242047":"The contribution of red dwarfs and white dwarfs to the halo dark matter","243785686":"Analyses and new designs of digital chaotic ciphers","1937221":"Opportunity for Regulating the Collective Effect of Random Expansion with Manifestations of Finite Size Effects in a Moderate Number of Finite Systems","1919302":"The contribution of red dwarfs and white dwarfs to the halo dark matter","258075198":"Physical models as tests of randomness","257227828":"A stochastic approach to modeling the dynamics of natural ventilation systems","13281705":"Long-range order produced by the interaction between spin waves in classical fcc Heisenberg models","242807056":"Evidence of the correlation between positive Lyapunov exponents and good chaotic random number sequences","13329319":"Scattering function for a model of interacting surfaces","265538750":"DISCRETE-EVENT SIMULATION FOR TRIGGER AND DATA ACQUISITION SYSTEMS IN HIGH-ENERGY PHYSICS","231000745":"Monte Carlo simulations of the binary white dwarf population: A progress report","222544430":"Pseudo-random number generators for Monte Carlo simulations on ATI Graphics Processing Units","253901907":"A study of 64-bit multipliers for Lehmer pseudorandom number generators","2726748":"Parallelizing UHBD","240426273":"Preliminary Monte Carlo calculation of the conductance of the aperture of a pressure calibration system in the UHV range","2019177":"PYTHIA 6.4 physics and manual","222683199":"FASTERD: A Monte Carlo event generator for the study of final state radiation in the process e+e−→ππγ at DAΦNE","273894702":"Calcium Alternans is Due to an Order-Disorder Phase Transition in Cardiac Cells","229249578":"Numerical simulation of Glauber dynamics in the 1-d BEG model","242806777":"An efficient method for treating conditional Monte Carlo simulation","221434545":"Random Number Generators with Period Divisible by a Mersenne Prime","12254014":"Recommendations for straightforward and rigorous methods of counting neurons based on a computer simulation","48865645":"Review of Particle Physics","222747840":"HERACLES: an event generator for ep interactions at HERA energies including radiative processes","201976718":"A Parallel Genetic Algorithm for the Set Partitioning Problem","226366711":"Parallel simulation of electron-solid interactions for electron microscopy modeling","220486317":"Recursive Hashing and One-Pass, One-Hash n-Gram Count Estimation","2683298":"A Collection of Selected Pseudorandom Number Generators With Linear Structures","1792912":"A Large Stellar Evolution Database for Population Synthesis Studies. III. Inclusion of the Full Asymptotic Giant Branch Phase and Web Tools for Stellar Population Analyses","273396160":"An Image Sensor With Joint Sensing and Energy Harvesting Functions","221663419":"Analysis of power-law exponents by maximum-likelihood maps","222480594":"RANEXP: experimental random number generator package","26262016":"An efficient Monte Carlo-based algorithm for scatter correction in keV cone-beam CT","226066664":"A particle swarm pattern search method for bound constrained global optimization","231390811":"Quantitative Optimal Experimental Design Using Global Sensitivity Analysis via Quasi-Linearization","46399837":"Tests of random number generators using Ising model simulations","222964432":"Ensemble of interacting randon surfaces on a lattice","261988871":"The effects of metallicity on the Galactic disk population of white dwarfs","224701695":"Optimizing the Scalability of Parallelized GATE Simulations","222307037":"Neural 2.00 — A program for neural net and statistical pattern recognition","10822971":"Comment on \"Exact solutions to chaotic and stochastic systems\" [Chaos 11, 1 (2001)]","237688202":"Photoinduced electron transfer and geminate recombination on a micelle surface: Analytical theory and Monte Carlo simulations","241231297":"Fast and Reliable Random Numbers for Extensive Monte Carlo Calculations","251758243":"A Fast Algorithm for Testing Irreducibility of Trinomials mod 2 (preliminary report)1","257006835":"A novel iris and chaos-based random number generator","220432009":"Uniform Random Number Generators","242806739":"Acceleration of RANLUX","248503139":"Monte Carlo simulation on the cation diffusion via vacancies in simple spinels","222534383":"A mechanism for randomness","256721123":"Local Shannon entropy measure with statistical tests for image randomness","260329524":"Distribution of Random Streams for Simulation Practitioners","222457072":"Monte Carlo integration with quasi-random numbers: some experience","13324153":"Compositional segmentation and long-range fractal correlations in DNA sequences","228642324":"A project-oriented course in computational physics: Algorithms, parallel computing, and graphics","226546747":"The hierarchy of correlations in random binary sequences","250998089":"Monte Carlo Modeling of Glare in Cathode-Ray for Medical Imaging","250425680":"Short-chain behaviour of star-branched nonreversal random walks embedded in a tetrahedral lattice","4337663":"Hardware realization of a medical diagnostic system based on Probabilistic CMOS (PCMOS) technology","263801862":"MEAN FIELD, TWO-SITE CLUSTER, AND COMPUTER SIMULATION STUDY OF A NEMATOGENIC LATTICE-GAS MODEL","2488295":"On the Periods of Generalized Fibonacci Recurrences","274737570":"Limits of the applicability of the effective one-fluid model","231394313":"Excluded Volume Effects in Photoinduced Electron Transfer and Geminate Recombination: Analytical Theory and Simulations","245186393":"Experiences with the parallelisation of Monte Carlo problems","1894873":"The contribution of Oxygen-Neon white dwarfs to the MACHO content of the Galactic Halo","220258535":"A non-trivial relation between some many-dimensional chaotic discrete dynamical systems and some one-dimensional chaotic discrete dynamical systems","3274233":"The effect of longitudinally varying soil conductivity on the ground-mode low frequency propagation parameters of overhead power lines","220761312":"Practical distribution of random streams for stochastic High Performance Computing","222289651":"A Portable High-Quality Random Number Generator for Lattice Field Theory Simulations","229041258":"Bad lattice structures for vectors of non-successive values produced by some linear recurrences","233362980":"A Lilliefors test of fit to the two-component homoscedastic normal mixture","8139697":"Lubberts effect in columnar phosphors","252944579":"EGS OvrEzy, the object-oriented visual user interface for the EGS particle transport code","3772397":"Recent advances in uniform random number generation","228667511":"BaSTI, a bridge between Grid and virtual observatory part 1: BaSTI inside the VO","1785804":"The white dwarf luminosity function. I. Statistical errors and alternatives","29610011":"Monte Carlo Simulation With The GATE Software Using Grid Computing","238547948":"JETNET 3.0-A versatile artificial neural network package","37446106":"Étude du tomographe de haute résolution pour petits animaux ClearPET par la méthode de Monte Carlo","13314348":"Spin-polarized electrons at interfaces: Co/Cu systems","220576962":"L’Ecuyer, P.: Orbits and lattices for linear random number generators with composite moduli. Math. Comput. 65(213), 189-201","221524691":"Flexible approximate counting.","222502058":"A Fortran 90 interface to random number generation","42542944":"Random Number Generators Tested on Quantum Monte Carlo Simulations","222751405":"Application of Information Theory to DNA Sequence Analysis: A Review","256153259":"TAUOLA - a library of Monte Carlo programs to simulate decays of polarized τ leptons","272891314":"Studying the response of a plastic scintillator to gamma rays using the Geant4 Monte Carlo code","2755033":"Parallel Random Number Generation on KSR1","50935038":"Monte Carlo Simulation of Atom Diffusion via Vacancies in Nanofilms with a Model Simple Cubic Lattice System","200104469":"Monte Carlo tests of renormalization-group predictions for critical phenomena in Ising models. Phys. Rep. 344, 179","231105599":"The ATLAS Detector Digitization Project for 2009 data taking","4986806":"The Level and Power of the Bootstrap t Test in the AR(1) Model With Trend","201976822":"A parallel genetic algorithm for the set partitioning problem"},"index":459}