{"abs":"In the mind of the average computer user, the problem of generating uniform variates by computer has been solved long ago. After all, every computer :system offers one or more function(s) to do so. Many software products, like compilers, spreadsheets, statistical or numerical packages, etc. also offer their own. These functions supposedly return numbers that could be used, for all practical purposes, as if they were the values taken by independent random variables, with a uniform distribution between 0 and 1. Many people use them with faith and feel happy with the results. So, why bother?Other (less naive) people do not feel happy with the results and with good reasons. Despite renewed crusades, blatantly bad generators still abound, especially on microcomputers [55, 69, 85, 90, 100]. Other generators widely used on medium-sized computers are perhaps not so spectacularly bad, but still fail some theoretical and/or empirical statistical tests, and/or generate easily detectable regular patterns [56, 65].Fortunately, many applications appear quite robust to these defects. But with the rapid increase in desktop computing power, increasingly sophisticated simulation studies are being performed that require more and more “random” numbers and whose results are more sensitive to the quality of the underlying generator [28, 40, 65, 90]. Sometimes, using a not-so-good generator can give totally misleading results. Perhaps this happens rarely, but can be disastrous in some cases. For that reason, researchers are still actively investigating ways of building generators. The main goal is to design more robust generators without having to pay too much in terms of portability, flexibility, and efficiency. In the following sections, we give a quick overview of the ongoing research. We focus mainly on efficient and recently proposed techniques for generating uniform pseudorandom numbers. Stochastic simulations typically transform such numbers to generate variates according to more complex distributions [13, 25]. Here, “uniform pseudorandom” means that the numbers behave from the outside as if they were the values of i.i.d. random variables, uniformly distributed over some finite set of symbols. This set of symbols is often a set of integers of the form {0, . . . , m - 1} and the symbols are usually transformed by some function into values between 0 and 1, to approximate the U(0, 1) distribution. Other tutorial-like references on uniform variate generation include [13, 23, 52, 54, 65, 84, 89].","title":"Random Numbers for Simulation.","id":220422221,"url":"https://www.researchgate.net/publication/220422221_Random_Numbers_for_Simulation","names":["Pierre L’Ecuyer","Communications of the ACM"],"references":{"220617894":"Efficient Parallel Pseudo-Random Number Generation","24060141":"Remarks on nonlinear congruential pseudorandom numbers","261593363":"Stochastic Simulation","226434293":"Optimal characteristic polynomials for digital multistep pseudorandom numbers","238710960":"Matrixgeneratoren zur erzeugung gleichverteilter pseudozufallsvektoren","200104934":"Lewis TG, Payne WH (July 1973) Generalized feedback shift register pseudorandom number algorithm. ACM","221525055":"Random number generation on parallel processors.","222442575":"Maximum-length sequences, cellular automata, and random numbers","220617513":"A Simple Unpredictable Pseudo-Random Number Generator","239576520":"The Lattice Structure of PseudoRandom Number Generators","227022488":"Parallelization of random number generators and long-range correlations","222586708":"Random-number generation for parallel processors","258950396":"Simulation Modeling and Analysis","242924655":"Implementing a portable FORTRAN uniform (0,1) generator","220420788":"Two Fast Implementations of the \"Minimal Standard\" Random Number Generator.","225304570":"Non-Uniform Random Variate Generation","220430778":"Inferring sequences produced by pseudo-random number generators","234831078":"On the statistical independence of nonlinear congruential pseudorandom numbers","238716709":"Random Numbers Generated by Linear Recurrence Modulo Two","226734498":"Uses and Abuses of Statistical Simulation","242354643":"Introduction to Finite Fields and Their Applications, Revised Edition","4355171":"Secret linear congruential generators are not cryptographically secure","220688518":"The Art of Computer Programming, Volume II: Seminumerical Algorithms, 2nd Edition","3770651":"How To Construct Randolli Functions","220431496":"How to construct random functions. J ACM","7187654":"Random Numbers Fall Mainly in the Planes","238677778":"The serial test for digital k-step pseudorandom numbers","222727917":"Statistical independence properties of pseudorandom vectors produced by matrix generators","220430863":"On the Discrepancy of GFSR Pseudorandom Numbers.","242587841":"A Statistical Analysis of Generalized Feedback Shift Register Pseudorandom Number Generators","220616862":"RSA and Rabin Functions: Certain Parts are as Hard as the Whole","242922306":"The Serial Test for Congruential Pseudorandom Numbers Generated by Inversions","243360184":"A Method for Vectorized Random Number Generators","3772162":"Using Linear Congruential Generators For Parallel Random Number Generation","3771269":"Linear congruential generators of order K\u003e1","226707519":"The sub-lattice structure of linear congruential random number generators","221526154":"About polynomial-time “unpredictable” generators","222350207":"The lattice structure of pseudo-random vectors generated by matrix generators","242922309":"On the Period Length of Pseudorandom Vector Sequences Generated by Matrix Generators","220268386":"Polynomial Factorization and Nonrandomness of Bits of Algebraic and Some Transcendental Numbers","242388663":"Compound Random Number Generators","220617454":"Designing a Uniform Random Number Generator Whose Subsequences are k -Distributed","220492909":"Implementing a random number package with splitting facilities","220430440":"Partitioning the Period of a Class of m-Sequences and Application to Pseudorandom Number Generation","242396729":"Some Experimental Observations on the Behavior of Composite Random Number Generators","222387978":"Matrices and the structure of random number sequences","243774153":"Algorithm AS 183: An Efficient and Portable Pseudo-Random Number Generator","223749785":"Random number generators for MIMD parallel processors","220420979":"Random Number Generators: Good Ones Are Hard to Find","262284531":"Random number generation with the recursion X t \u003dX t-3p ⊕X t-3q","220493174":"The multiple prime random number generator","220576246":"On a nonlinear congruential pseudorandom number generator","265657857":"ALGORITHM 659: implementing Sobol\u0027s quasirandom sequence generator","220691826":"A guide to simulation (2nd. ed.).","238718703":"Random number generation based on polynomial arithmetic modulo two","266719805":"The use of Cebysev mixing to generate pseudo-random numbers","225664553":"Recent trends in random number and random vector generation","239586844":"An equivalence relation between Tausworthe and GFSR sequences and applications","263485416":"Principles of Random Variate Generation","242922535":"Lower Bounds for the Discrepancy of Inversive Congruential Pseudorandom Numbers","239279004":"Erratum: An Exhaustive Analysis of Multiplicative Congruential Random Number Generators with Modulus $2^{31} - 1","234789148":"L\u0027ecuyer, P. Efficient and portable combined random number generators. Communications of the ACM","234832410":"The k-Distribution of Generalized Feedback Shift Register Pseudorandom Numbers","243119768":"Accuracy in Random Number Generation","242503058":"On Optimal GFSR Pseudorandom Number Generators","2817740":"Implementation Of The Atkin-Goldwasser-Kilian Primality Testing Algorithm","226481429":"On the structure of quadratic congruential sequences","234783634":"Walsh-Spectral Test for GFSR Pseudorandom Numbers","234815375":"A fast uniform astronomical random number generator","23636505":"Toward a Universal Random Number Generator","243516913":"Building a random number generator","220430935":"Initializing generalized feedback shift register pseudorandom number generators","262153558":"Testing intrinsic random-number generators","38358449":"On Combining Pseudorandom Number Generators","222457530":"ACORN—A new method for generating sequences of uniformly distributed Pseudo-random Numbers","238678083":"Quasi-Monte Carlo Methods and Pseudo-Random Numbers","226534396":"Calculation of Minkowski-reduced Lattice Bases","262170846":"Linear congruential generators of order K\u003e1"},"citedIn":{"241840746":"Security of passive access vehicle","225877367":"Combining random number generators using cut and project sequences","276427643":"Social Noise: Generating Random Numbers from Twitter Streams","233389549":"On the combination of self-organized systems to generate pseudo-random numbers","274320220":"Assessing Excel VBA Suitability for Monte Carlo Simulation","221525041":"New methods for pseudorandom numbers and pseudorandom vector generation","2674479":"Techniques for Empirical Testing of Parallel Random Number Generators","220136471":"Twisted GFSR generators II","225457785":"Shuffling arrays: Appearances may be deceiving","50996224":"Handbook of Monte Carlo Methods","236109080":"FPGA Implementation of 8, 16 and 32 Bit LFSR with Maximum Length Feedback Polynomial using VHDL","281329615":"Efficient Multicore Implementation of An Advanced Generator of Discrete Chaotic Sequences","220669226":"L’Ecuyer, P.: Bad lattice structures for vectors of non-successive values produced by some linear recurrences. INFORMS J. Comput. 9(1), 57-60","2733095":"Some Methods Of Parallel Pseudorandom Number Generation","3933234":"Software for uniform random number generation: Distinguishing the good and the bad","247728340":"Random-Number Generator Validity in Simulation Studies: An Investigation of Normality","225193340":"Distribution of Lattice Points","271710240":"Reliable Initialization of GPU-enabled Parallel Stochastic Simulations Using Mersenne Twister for Graphics Processors","242750828":"TSP 5.0 user\u0027s guide","6162762":"Random numbers for large-scale distributed Monte Carlo simulations","227167390":"Parallel Random Number Generators Based on Large Order Multiple Recursive Generators","223491653":"The additive congruential random number generator—A special case of a multiple recursive generator","268241636":"Pseudo-Random Number Generators for Massively Parallel Discrete-Event Simulation","260586645":"Multicore Algorithms for Transient-Noise Simulation","227127959":"Resonance Theory in Reactor Applications","221348910":"Interfaces and Implementations of Random Number Generators for JAVA Grande Appllications.","227190677":"Cross-correlation between simultaneously generated sequences of pseudo-random uniform deviates","228561597":"Modeling and simulation of the mollusc Ascoglossa Elysia subornata Verril population dynamic: Application to the potential biocontrol of Caulerpa taxifolia (Valhl) C. Agardh growth in the Mediterranean sea","225828439":"Monte Carlo Methods","221525527":"A plug-in-based architecture for random number generation in simulation systems","220136250":"Twisted GFSR generators","220996107":"Generalized Lehmer-Tausworthe random number generators","215894777":"Implementation of high-order particle-tracking schemes in water column model","216225224":"A discussion on experimental model validation","260318635":"Avalanche in States; Combination of Sandpile and Cellular Automata for Generate Random Numbers","221525764":"Fast and Reliable Random-Number Generation.","228317098":"A Markov Chain Quasi-Monte Carlo Method for Bayesian Estimation of Stochastic Volatility Model","26855855":"Using simulation to determine the need for ICU beds for surgery patients","267862464":"Geradores de Números Aleatórios","249729497":"A Performance Analysis of the Minimax Multivariate Quality Control Chart","2392088":"Random Number Generators for Parallel Computers","234832834":"Pseudorandom vector generation by the inversive method","251799359":"A fast parameter estimation registration algorithm for data fusion","49805258":"A Marriage of Convenience? A qualitative study of colleague supervision of Master\u0027s level dissertations.","242427981":"implementation techniques, and empirical testing of uniform random number generators for simulation. We first discuss some philosophical issues and quality criteria. Then we explain a few concrete families of generators and give appropriate references to further details and to recommended implementations. 1 WHAT ARE WE LOOKING FOR?","223248753":"Systematic searches for good multiple recursive random number generators","222471938":"An algorithmic model for invasive species: application to Caulerpa taxifolia (Vahl) C. Agardh development in the North-Western Mediterranean Sea. Ecol Model","220675173":"A new method of random time-series simulation","220136283":"A Search for Good Multiple Recursive Random Number Generators.","242436916":"Processus Aléatoires","229963516":"Uniform Random Numbers","220136533":"Efficient and Portable Combined Tausworthe Random Number Generators.","7173671":"Periodic orbits of the ensemble of Sinai-Arnold cat maps and pseudorandom number generation","2818663":"SPRNG: A Scalable Library for Pseudorandom Number Generation","263103714":"Lower bounds in spectral tests for vectors of nonsuccessive values produced by multiple recursive generator with some zero multipliers","220492649":"Corrigendum: Algorithm 806: SPRNG: a scalable library for pseudorandom number generation.","41519656":"A versatile FPGA-based high speed bit error rate testing scheme /","2179186":"Hurst\u0027s Rescaled Range Statistical Analysis for Pseudorandom Number Generators used in Physical Simulations","242384421":"Simulation and Optimized Scheduling of Pedestrian Traffic From geometric modeling to pedestrian navigation","291602233":"Generatorsrandom numberRandom number generatorsRandom number generators","241186362":"Asymptotic statistical analysis of pseudo random numbers","223905541":"Programmable uniform-Gaussian, quasi-white noise generator and data acquisition-processing system for electrophysiology","229621967":"On the generation of high‐quality white noise series","262880202":"Generating pseudo-random numbers by combining two systems with complex behaviors","223854130":"Random number generators with long period and sound statistical properties","2772813":"Implementation of a Random Number Generator for High Performance Fortran","2827852":"The Applications of Genetic Algorithms in Cryptanalysis","226148370":"Sensitivity and Uncertainty Analysis of Models and Data","267986320":"Geometric and Statistical Properties of Pseudorandom Number Generators Based on Multiple Recursive Transformations","224043825":"The Generation of Binomial Random Variates","225230336":"Computational Study of the Relationships Between Feasible and Efficient Sets and an Approximation","222544430":"Pseudo-random number generators for Monte Carlo simulations on ATI Graphics Processing Units","3724887":"Uniform Random Number Generators: A Review","232645289":"Integrating modelling and data analysis in teaching discrete event simulation","226908157":"Nuclear Reactor Kinetics: 1934–1999 and Beyond","221434545":"Random Number Generators with Period Divisible by a Mersenne Prime","283091804":"Sphericity estimation bias for repeated measures desings in simulation studies","238069428":"USANDO O MÉTODO DE MONTE CARLO PARA ENCONTRAR RAÍZES DE EQUAÇÕES","266168667":"Modelling and simulation. Exploring dynamic system behaviour. With CD-ROM","241136856":"A note on random numbers","2683298":"A Collection of Selected Pseudorandom Number Generators With Linear Structures","224124113":"Design considerations for M\u0026S software","201976450":"Cracking and Co-Evolving Randomizers","261253406":"Using RngStreams for Parallel Random Number Generation in C++ and R","222475468":"A random number generator based on the combination of four LCGs","226589458":"Uniform Random Number Generation","2752189":"Random Number Generators for Parallel Applications","221650338":"SPRNG: A Scalable Library for Pseudorandom Number Generation.","2264247":"Random Number Generation on Parallel Computer Systems","239574226":"Methodes de Monte-Carlo","45922090":"RNGSSELIB: Program library for random number generation, SSE2 realization","46399837":"Tests of random number generators using Ising model simulations","290787279":"Efficiency Calculation of Gamma Detectors by Monte Carlo Methods","245492026":"Stream correlations in multiple recursive and congruential generators","223283665":"Several extensively tested Multiple Recursive Random Number Generators","228034103":"Random Number Generation","221527953":"Testing Random Number Generators","251463771":"Chapter 3 Uniform Random Number Generation","228865283":"Monte Carlo methods: A computational pattern for our pattern language","223835646":"A package of Linux scripts for the parallelization of Monte Carlo simulations","255656340":"ON THE INITIAL SEED OF THE RANDOM NUMBER GENERATORS","220432009":"Uniform Random Number Generators","247329303":"Random Number Generation and Simulation on Vector and Parallel Computers","266996289":"Pseudo-Random Number Generators for Vector Processors and Multicore processors","253342389":"Introduction aux Méthodes de Monte-Carlo","4056723":"Functional Verification of SMP, MPP, and Vector-Register Supercomputers through Controlled Randomness","242446023":"A Software Library in ANSI C for Empirical Testing of Random Number Generators","220492690":"TestU01: A C library for empirical testing of random number generator, revised November 2006","264171273":"A Segmented Leap-Ahead LFSR Pseudo-Random Number Generator","2763666":"A Portable Uniform Random Number Generator Well Suited for the Rejection Method","226752826":"A theoretical and empirical comparison of mainframe, microcomputer, and pocket calculator pseudorandom number generators","220840084":"Fast and Reliable Random Number Generators for Scientific Computing","264963189":"Combined Multiple Recursive Random Number Generators","228910181":"La complexité dans les Simulations Multi-Agents","251435070":"Parallel Random Number Generators in Java","236000471":"FPGA","242922685":"Pseudorandom Vector Generation by the Multiple-Recursive Matrix Method","250126883":"A Survey and Empirical Comparison of Modern PseudoRandom Number Generators for Distributed Stochastic Simulations","229041258":"Bad lattice structures for vectors of non-successive values produced by some linear recurrences","3772397":"Recent advances in uniform random number generation","220136395":"A system of high-dimensional, efficient, long-cycle and portable uniform random number generators","220669425":"An Implementation of the Lattice and Spectral Tests for Multiple Recursive Linear Random Number Generators","242669996":"RENSEIGNEMENTS PERSONNELS","227209296":"Reactor Core Methods","3528169":"Combining random number generators","46581784":"Applying dissipative dynamical systems to pseudorandom number\ngeneration: Equidistribution property and statistical independence of bits at\ndistances up to logarithm of mesh size","251442722":"Automatic Algorithm Selection for Complex Simulation Problems","4941716":"Pseudorandom number generators for supercomputers and classical computers: A practical introduction","220493252":"Portable random number generator well suited for the rejection method","3786461":"Uniform random number generators","221529552":"ANALYSIS OF ADD-WITH-CARRY AND SUBTRACT-WITH-BORROW GENERATORS","4872364":"Reverse multiple recursive random number generators","3772382":"Nonparametric techniques in simulation analysis: a tutorial","42542944":"Random Number Generators Tested on Quantum Monte Carlo Simulations","3620060":"Using nonparametric statistics in simulation analysis: a review","221525464":"Tools for teaching simulation: integrating modelling and data analysis in teaching discrete event simulation.","24071809":"The pricing of risky coupon bonds","221389277":"Design and Modeling of Clustered RAID.","220594889":"Defects in parallel Monte Carlo and quasi-Monte Carlo integration using the leap-frog technique","228051047":"Simulation in Industrial Statistics","220243922":"An Object-Oriented Random-Number Package With Many Long Streams And Substreams","2652890":"PRNGlib: A Parallel Random Number Generator Library","3315654":"Using the DFT to Synthesize Bivariate Orthogonal White Noise Series","244172920":"Genetic Programming in Hardware","220492497":"Algorithm 806: SPRNG: a scalable library for pseudorandom number generation.","221440708":"Building a Hierarchical CAN-Simulator Using an Object-Oriented Environment.","2731231":"A Study of Random Weyl Trees","229496919":"Robustness of some non‐uniform random variate generators","220136420":"On the Lattice Structure of the Add-With-Carry and Subtract-With-Borrow Random Number Generators.","234813955":"E \u003d MC3: Managing uncertain enterprise data in a Cluster-computing environment","264929335":"Numerical Methods of Statistics","233993740":"Accelerating Test, Validation and Debug of High Speed Serial Interfaces"},"index":460}