{"abs":"Since the proof in 1982, by Tsfasman Vladut and Zink of the existence of algebraic-geometric (AG) codes with asymptotic performance exceeding the Gilbert-Varshamov (G-V) bound, one of the challenges in coding theory has been to provide explicit constructions for these codes. In a major step forward during 1995-1996, Garcia and Stichtenoth (GS) provided an explicit description of algebraic curves, such that AG codes constructed on them would have a performance better than the G-V bound. We present the first low-complexity algorithm for obtaining the generator matrix for AG codes on the curves of GS. The symbol alphabet of the AG code is the finite field of q, q\u0026ges;49, elements. The complexity of the algorithm, as measured in terms of multiplications and divisions over the finite field GF(q), is upper-bounded by [Nlog(N)] where N is the length of the code. An example of code construction using the above algorithm is presented. By concatenating the AG code with short binary block codes, it is possible to obtain binary codes with asymptotic performance close to the G-V bound. Some examples of such concatenation are included","title":"A low-complexity algorithm for the construction of algebraic-geometric codes better than the Gilbert-Varshamov bound","id":3080498,"url":"https://www.researchgate.net/publication/3080498_A_low-complexity_algorithm_for_the_construction_of_algebraic-geometric_codes_better_than_the_Gilbert-Varshamov_bound","names":["Kenneth W. Shum","Ilia Aleshnikov","P. Vijay Kumar","Henning Stichtenoth","Vinay Deolalikar","IEEE Transactions on Information Theory"],"references":{"12778243":"The application of the micronucleus test in Chinese hamster V79 cells to detect drug-induced photogenotoxicity","6987689":"Dufour EK, Kumaravel T, Nohynek GJ et al.Clastogenicity, photo-clastogenicity or pseudo-photo-clastogenicity: Genotoxic effects of zinc oxide in the dark, in pre-irradiated or simultaneously irradiated Chinese hamster ovary cells. Mutat Res 607:215-224","2858856":"Explicit Modular Towers","11225518":"Use of the photo-micronucleus assay in Chinese hamster V79 cells to study photochemical genotoxicity","3079208":"An explicit construction of a sequence of codes attaining the Tsfasman-Vladut-Zink bound. The first steps","12855747":"PUVA (8-methoxy-psoralen plus ultraviolet A) induces the formation of 8-hydroxy-2 \u0027-deoxyguanosine and DNA fragmentation in calf thymus DNA and human epidermoid carcinoma cells","2995754":"The theory of error-correcting codes","15067426":"Osborne R, Perkins MA. An approach for development of alternative test methods based on mechanisms of skin irritation. Food Chem Toxicol 1994;","3080105":"Towers of function fields and iterated means","13267779":"The photomutagenicity of fluoroquinolones and other drugs","3080421":"On the splitting of places in a tower of function fields meeting the Drinfeld-Vladut bound","16322290":"Induction of SCE by DNA cross-links in human fibroblasts exposed to 8-MOP and UVA irradiation","6658475":"Induction of keratinocyte apoptosis by photosensitizing chemicals plus UVA","15329319":"Photoinduction of micronuclei by 4,4′,6-trimethylangelicin and 8-methoxypsoralen in different experimental models","3079741":"Codes on Garcia-Stichtenoth curves with true distance greater than Feng-Rao distance","13076755":"In VitroPhotogenotoxic activity of clinafloxacin: a paradigm predicting photocarcinogenicity. Toxicol Appl Pharmacol 156:222","255640619":"On the missing functions of a pyramid of curves","15695288":"Photomutagenesis test development: II. 8-Methoxypsoralen, chlorpromazine and sunscreen compounds in chromosomal aberration assays using CHO cells","6265352":"The photo comet assay - a fast screening assay for the determination of photogenotoxicity in vitro. Mutat Res","9025758":"High throughput screening (HTS) for phototoxicity hazard using the in vitro 3T3 neutral red uptake assay. Toxicol In Vitro","15695287":"Photomutagenesis test development I. 8-Methoxypsor-alen, chlorpromazine and sunscreen compounds","229755945":"Modular curves, Shimura curves, and Goppa codes better than Varshamov-Gilbert Bound","2400957":"Towards a basis for the space of regular functions in a tower of function fields meeting the Drinfeld-Vladut bound","3082868":"New upper bounds on the rate of a code via the Delsarte-MacWilliams inequalities. IEEE Trans. Inform. Theory 23, 157-166","45537623":"A screen for photoirritants in cultured cells","14107379":"Wavelength dependence of oxidative DNA damage induced by UV and visible light","11619348":"Quantitative assessment of primary skin irritants in vitro in a cytotoxicity model: Comparison with in vivo human irritation tests","258239683":"The Theory of Error-Correcting Codes, Part I","14284657":"Chetelat AA, Albertini S, Gocke EThe photomutagenicity of fluoroquinolones in tests for gene mutation, chromosomal aberration, gene conversion and DNA breakage (comet assay). Mutagenesis 11:497-504","45537631":"EEC/COLIPA project on in vitro phototoxicity testing: First results obtained with a Balb/c 3T3 cell phototoxicity assay","14018620":"Preferential incision of interstrand crosslinks induced by 8-methoxypsoralen plus UVA in yeast during the cell cycle","234789335":"Handbook of Coding Theory","24432287":"Nyst HJ, Tan IB, Stewart FA, Balm AJIs photodynamic therapy a good alternative to surgery and radiotherapy in the treatment of head and neck cancer? Photodiagnosis Photodyn Ther 6: 3-11","228694348":"Weierstrass Semigroups in an Asymptotically Good Tower of Function Fields* 1","226056201":"A Tower of Artin - Schreier Extensions of Function Fields Attaining the Drinfeld - Vlâdut Bound","26661223":"New aspects in photodynamic therapy of actinic keratoses","5547237":"Comparison of the irritation potentials of Boswellia serrata gum resin and of acetyl-11-keto-β-boswellic acid by in vitro cytotoxicity tests on human skin-derived cell lines","14446254":"Nataraj AJ, Black HS, Ananthaswamy HNSignature p53 mutation at DNA cross-linking sites in 8-methoxypsoralen and ultraviolet A (PUVA)-induced murine skin cancers. Proc Natl Acad Sci USA 93:7961-7965","220681365":"Modular curves and codes with a polynomial construction","35507689":"Construction effective des codes géométriques /","220695837":"Algebraic Function Fields and Codes","222754429":"Light-induced cross-linking of DNA in the presence of a furocoumarin (psoralen): Studies with phage λ, Escherichia coli, and mouse leukemia cells","3080467":"Finding the defining functions for one-point algebraic-geometry codes","5624936":"Cycloheximide and disulfoton are positive in the photoclastogencity assay but do not absorb UV irradiation: Another example of pseudophotoclastogenicity?","7851785":"Photogenotoxicity of hypericin in HaCaT keratinocytes: Implications for St. John\u0027s Wort supplements and high dose UVA-1 therapy","7942790":"Evaluation of phototoxic and photoallergic potentials of 13 compounds by different in vitro and in vivo methods","14124136":"Stern RS, Nichols KT, Väkevä LH, for the PUVA Follow-up StudyMalignant melanoma in patients treated for psoriasis with methoxsalen (psoralen) and ultraviolet A radiation (PUVA). N Engl J Med 336:1041-1045","235008702":"Codes on algebraic curves"},"citedIn":{"220161054":"List decoding codes on Garcia–Stictenoth tower using Gröbner basis","220139165":"Algebraic-geometric generalizations of the Parvaresh-Vardy codes","221420593":"On the Computation of Non-uniform Input for List Decoding on Bezerra-Garcia Tower.","3921087":"Expander-based constructions of efficiently decodable codes","263976127":"ON ASYMPTOTICALLY OPTIMAL TOWERS OVER QUADRATIC FIELDS RELATED TO GAUSS HYPERGEOMETRIC FUNCTIONS","228690340":"Bridging Shannon and Hamming: List Error-Correction with Optimal Rate","224578532":"A Polynomial-Time Construction of Self-Orthogonal Codes and Applications to Quantum Error Correction","224349527":"Concatenated Quantum Codes Constructible in Polynomial Time: Efficient Decoding and Error Correction","280773815":"Efficient list decoding of punctured Reed-Muller codes","220467888":"Constructions of Low-degree and Error-Correcting ε-Biased Generators","221499300":"Correlated Algebraic-Geometric Codes: Improved List Decoding over Bounded Alphabets","221420842":"Novel Algebraic Structure for Cyclic Codes.","221420587":"Homomorphic Encryptions of Sums of Groups.","263230762":"On t‐Covering Arrays: Proceedings of the Third Pythagorean Conference","221420841":"On the Key-Privacy Issue of McEliece Public-Key Encryption","37989212":"List decoding of error-correcting codes","31376577":"On Hash Functions and List Decoding with Side Information","260302748":"Codes Against Online Adversaries: Large Alphabets","273396974":"Syndrome Generation and Error Location Search for the Decoding of Algebraic-Geometry Codes on Plane Garcia–Stichtenoth Curves","229076097":"Torsion Limits and Riemann-Roch Systems for Function Fields and\nApplications","242075338":"ON THE CONSTRUCTION OF CODES FROM AN ASYMPTOTICALLY GOOD TOWER OVER F8","221420955":"Joint Source-Cryptographic-Channel Coding Based on Linear Block Codes","221355292":"Algebraic Geometric Secret Sharing Schemes and Secure Multi-Party Computations over Small Fields","277207221":"Random Codes and Graphs for Secure Communication","224709460":"Folded Codes from Function Field Towers and Improved Optimal Rate List\nDecoding","265111420":"Minimum Distance of Concatenated Conjugate Codes for Cryptography and Quantum Error Correction","3085210":"Toward an Explicit Construction of Nonlinear Codes Exceeding the Tsfasman–VlĂduŢ–Zink Bound","3085593":"Linear-Time Encodable/Decodable Codes With Near-Optimal Rate","221420804":"Subcodes of Reed-Solomon Codes Suitable for Soft Decoding.","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","3080467":"Finding the defining functions for one-point algebraic-geometry codes","3085329":"Explicit Constructions of Algebraic-Geometric Codes","220683495":"The burst error correcting capabilities of a simple array code.","48908329":"Algorithmes Rapides pour les Tours de Corps Finis et les Isogénies","224642470":"Constructions of low-degree and error-correcting ε-biased generators","224061597":"Conjugate Codes for Secure and Reliable Information Transmission","221420533":"Secure Cross-Realm Client-to-Client Password-Based Authenticated Key Exchange Against Undetectable On-Line Dictionary Attacks","225413927":"Iterative list decoding of LDPC codes","262251881":"List decoding reed-solomon, algebraic-geometric, and gabidulin subcodes up to the singleton bound","221420795":"On Generalized Hamming Weights and the Covering Radius of Linear Codes","3080421":"On the splitting of places in a tower of function fields meeting the Drinfeld-Vladut bound","220301420":"On rational embeddings of curves in the second Garcia–Stichtenoth tower","263988332":"Spaces of modular forms and algebraic geometric codes","221420643":"Iterative List Decoding of LDPC Codes.","228916726":"Algebraic geometry codes: general theory","221420513":"On the Structure of Inversive Pseudorandom Number Generators","221420897":"A Survey of Recent Attacks on the Filter Generator.","269711301":"Dense Testers: Almost Linear Time and Locally Explicit Constructions","222668690":"Integral closures and weight functions over finite fields","220576370":"Correlated algebraic-geometric codes: Improved list decoding over bounded alphabets","221420906":"On Constructing AG Codes Without Basis Functions for Riemann-Roch Spaces","268820318":"Deletion codes in the high-noise and high-rate regimes","259695265":"Erasure List-Decodable Codes From Random and Algebraic Geometry Codes","222619673":"A Class of I.p.p. Codes With Efficient Identification","3085680":"Distance properties of expander codes","29799449":"Ein Algorithmus zur Berechnung von Ganzheitsbasen in algebraischen Funktionenkörpern","268412832":"Hash Families and Cover-Free Families with Cryptographic Applications","220688197":"List Decoding of Error-Correcting Codes (Winning Thesis of the 2002 ACM Doctoral Dissertation Competition)","220682820":"Explicit Nonadaptive Combinatorial Group Testing Schemes","224679296":"Practical Construction Against Theoretical Approach in Fingerprinting","221668318":"A new method for constructing small-bias spaces from Hermitian codes","220961217":"Syndrome calculation for the decoding of algebraic-geometry codes on plane Garcia-Stichtenoth curves","1960950":"Constructive Conjugate Codes for Quantum Error Correction and Cryptography","221420633":"An Improvement of Tardos’s Collusion-Secure Fingerprinting Codes with Very Short Lengths","220301264":"On the qth power algorithm","51914346":"Bases for Riemann-Roch Spaces of One-Point Divisors on an Optimal Tower of Function Fields","221420480":"Space-Time Codes from Crossed Product Algebras of Degree 4","29799472":"Perfect hash families, identifiable parent property codes and covering arrays","3958730":"Explicit construction of codes on an asymptotically bad tower of function fields","221420741":"Normalized Minimum Determinant Calculation for Multi-block and Asymmetric Space-Time Codes","272521286":"Asymptotically good ramp secret sharing schemes","3958724":"Integral closures and weight functions over finite fields","250728456":"Some Results and some Problems Related to Concatenated Codes","271218897":"Locally recoverable codes on algebraic curves","31597727":"Dense MIMO Matrix Lattices a Meeting Point for Class Field Theory and Invariant Theory"},"index":471}