{"abs":"We use powerful new techniques for list decoding error-correcting codes to efficiently trace traitors. Although much work has focused on constructing traceability schemes, the complexity of the tracing algorithm has received little attention. Because the TA tracing algorithm has a runtime of O(N) in general, where N is the number of users, it is inefficient for large populations. We produce schemes for which the TA algorithm is very fast. The IPP tracing algorithm, though less efficient, can list all coalitions capable of constructing a given pirate. We give evidence that when using an algebraic structure, the ability to trace with the IPP algorithm implies the ability to trace with the TA algorithm. We also construct schemes with an algorithm that finds all possible traitor coalitions faster than the IPP algorithm. Finally, we suggest uses for other decoding techniques in the presence of additional information about traitor behavior.","title":"Efficient Traitor Tracing Algorithms using List Decoding.","id":220337248,"url":"https://www.researchgate.net/publication/220337248_Efficient_Traitor_Tracing_Algorithms_using_List_Decoding","names":["Alice Silverberg","Jessica Staddon","Judy Walker"],"references":{"222669638":"Secure frameproof codes, key distribution patterns, group testing algorithms and related structures","3078189":"A Justesen Construction of Binary Concatenated Codes that Asymptotically Meet the Zyablov Bound for Low Rate","3080362":"Combinatorial properties of frameproof and traceability codes","220080921":"A Hypergraph Approach to the Identifying Parent Property: The Case of Multiple Parents","3083048":"On the inherent intractability of certain coding problems. IEEE Trans. Inf. Theor. IT-24, 384-386","2244397":"Decoding Reed-Solomon Codes Beyond Half the Minimum Distance","3862186":"Algebraic soft-decision decoding of Reed-Solomon codes","3785000":"Improved decoding of Reed-Solomon and algebraic-geometric codes","220617395":"Efficient Dynamic Traitor Tracing","221355046":"Efficient Methods for Integrating Traceability and Broadcast Encryption","3079606":"Collusion-secure fingerprinting for digital data","221354770":"Coding Constructions for Blacklisting Problems without Computational Assumptions.","3080073":"Tracing Traitors","220691342":"Introduction to coding theory","2448524":"Decoding Algebraic-Geometric Codes Beyond the Error-Correction Bound","245985796":"Dynamic Traitor Tracing Advances in Cryptology-CRYPTO\u0027\u002799","221590554":"A Displacement Approach to Efficient Decoding of Algebraic-Geometric Codes.","2410516":"List Decoding Algorithms for Certain Concatenated Codes","225151963":"Efficient Trace and Revoke Schemes","221355522":"An Efficient Public Key Traitor Tracing Scheme","220695837":"Algebraic Function Fields and Codes","2631059":"Efficient Watermark Detection and Collusion Security","220334876":"Combinatorial Properties of Frameproof and Traceability Codes.","220722201":"Trials of Traced Traitors.","220533734":"Combinatorial Properties and Constructions of Traceability Schemes and Frameproof Codes","221348217":"Optimum Traitor Tracing and Asymmetric Schemes.","221420667":"Decoding Hermitian Codes with Sudan’s Algorithm","222448392":"Decoding Reed Solomon Codes beyond the Error-Correction Bound","247493131":"Sequential Traitor Tracing Advances in Cryptology-CRYPTO 2000","244955351":"A displacement structure approach to e卤cient decoding of algebraic geometric codes","245012565":"A proven secure tracing algorithm for the optimal KD traitor tracing scheme","246165372":"Fast algorithms in Sudan decoding procedure for Reed-Solomon codes","2788347":"Digital Signets: Self-Enforcing Protection of Digital Information","221590371":"Decoding Algebraic-Geometric Codes Beyond the Error-Correction Bound.","37443169":"A displacement structure approach to decoding algebraic geometric codes","222076897":"On Codes with the Identifiable Parent Property","237607924":"algebraic-geometric codes","265458700":"Introduction to Coding Theory","5567414":"Secure spread spectrum watermarking for multimedia","30764214":"On the inherent intractability of certain coding problems","2526144":"Decoding Reed Solomon Codes beyond the Error-Correction Diameter","3079881":"Improved Decoding of Reed-Solomon and Algebraic-Geometry Codes","3077956":"Construction of asymptotically good low-rate error-correcting codes through pseudo-random graphs","3080002":"Efficient decoding of Reed-Solomon codes beyond half the minimum distance","3084895":"Algebraic Soft-Decision Decoding of Reed-Solomon Codes","221010781":"A Public-Key Traitor Tracing Scheme with Revocation Using Dynamic Shares","220682068":"List Decoding of Algebraic-Geometric Codes.","221354820":"Long-Lived Broadcast Encryption","225387413":"Coding Constructions for Blacklisting Problems without Computational Assumptions","248141876":"Tracing traitors Advances in Cryptology-CRYPTO\u0027\u002794","227278324":"Key Preassigned Traceability Schemes for Broadcast Encryption"},"citedIn":{"221159150":"A Class of Traceability Codes with an Efficient Tracing Algorithm.","238346806":"Robust fingerprinting codes: A near optimal construction","27529959":"Maximum Codes with the Identifiable Parent Property","221651825":"Improved Algebraic Traitor Tracing Scheme.","41440561":"Encryption mechanisms for digital content distribution","224312469":"Towards optimal design of signal fingerprinting codes","255639792":"Asymmetric Public-key Traitor Tracing Based on Bilinear Map","224115223":"List decoding of Reed Solomon codes for wavelet based colour image watermarking scheme","220271918":"Improving the Round Complexity of Traitor Tracing Schemes","224101515":"A note on the equivalence of the traceability properties of Reed-Solomon codes for certain coalition sizes","2997945":"Data-Hiding Codes","3338791":"Soft-decision tracing in fingerprinted multimedia content","220614448":"A note about the identifier parent property in Reed-Solomon codes","220990587":"Efficient Traitor Tracing from Collusion Secure Codes","221434794":"Practical Scenarios for the Van Trung-Martirosyan Codes.","34175248":"Cryptographic error correction /","221609583":"Traitor Tracing for Shortened and Corrupted Fingerprints","221523758":"Fingerprinting Schemes. Identifying the Guilty Sources Using Side Information","222619673":"A Class of I.p.p. Codes With Efficient Identification","221347856":"Extracting Group Signatures from Traitor Tracing Schemes","251832032":"Reed-Solomon Codes as Traceability Codes with an Efficient Tracing Algorithm","220334982":"A New Joint Fingerprinting and Decryption Scheme based on a Lattice Problem.","221609491":"A fully collusion resistant broadcast, trace, and revoke system","242256152":"Fingerprinting Schemes for the Protection of Multimedia Distribution Rights","221651806":"Tracing and Revoking Pirate Rebroadcasts","3976022":"Efficient identification of traitors in fingerprinted multimedia contents","221135109":"Public-key traitor tracing from efficient decoding and unbounded enrollment: extended abstract.","225225536":"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys","220722442":"On the IPP properties of Reed-Solomon codes","44795397":"Improving the Boneh-Franklin Traitor Tracing Scheme","221523781":"Collusion Secure Convolutional Spread Spectrum Fingerprinting","3960142":"Decoding codes with the identifiable parent property","30389629":"Piracy protection in content distribution systems","3319041":"Identification of Traitors in Algebraic-Geometric Traceability Codes","35701140":"Architectural techniques for enabling secure cryptographic processing /","220779228":"Lower Bounds for Collusion-Secure Fingerprinting","2919768":"Overview of Traitor Tracing Schemes","220271893":"A Traitor Tracing Scheme Based on RSA for Fast Decryption","224213225":"Identifying Traitors Using the Koetter–Vardy Algorithm","29799472":"Perfect hash families, identifiable parent property codes and covering arrays","221540940":"Identification Algorithms for Sequential Traitor Tracing.","221609421":"Traitor Tracing with Constant Size Ciphertext","224724575":"Soft-decision decoding of traceability codes","4021511":"A generalization of traceability codes using ideal-based codes","220639261":"New constructions for IPP codes","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors"},"index":474}