{"abs":"In his 1983 paper, Neal Wagner1 defines a perfect fingerprint to be an identifying fingerprint added to an object in such a way that any alteration to it that makes the fingerprint unrecognizable will also make the object unusable. A perfect fingerprinting scheme for binary data would seem difficult to devise, since it would be possible to discover the fingerprints by comparing different fingerprinted copies of the same piece of data. In this paper we discuss a fingerprinting scheme which, although it does not surmount this problem entirely, at least specifies the number of copies an opponent must obtain in order to erase the fingerprints.","title":"Fingerprinting Long Forgiving Messages","id":221355021,"url":"https://www.researchgate.net/publication/221355021_Fingerprinting_Long_Forgiving_Messages","names":["G. R. Blakley","Catherine A Meadows","George Purdy"],"references":{"220713488":"Fingerprinting."},"citedIn":{"221523511":"An Efficient Fingerprinting Scheme with Symmetric and Commutative Encryption.","251956736":"Robust parent-identifying codes","250396651":"Codes for Digital Fingerprinting","220739375":"A Simple Anonymous Fingerprinting Scheme Based on Blind Signature","242370170":"Binary Collusion-Secure Codes: Comparison and Improvements","250615290":"Distributed multicast of fingerprinted content based on a rational peer-to-peer community","223415130":"Cryptographic methods for collusion-secure fingerprinting of digital data","249666030":"MPEG Video Content protection based on Fingerprinting Scheme","2864441":"Optimal Probabilistic Fingerprint Codes","221540903":"Trade-Off Traitor Tracing.","34175248":"Cryptographic error correction /","226265959":"Trade-Off Traitor Tracing","220722235":"Error- and Collusion-Secure Fingerprinting for Digital Data","220195329":"Secure multicast protocol with copyright protection","4274014":"A Framework for Design and Analysis of Asymmetric Fingerprinting Protocols","3455248":"Joint Coding and Embedding Techniques for Multimedia Fingerprinting","3455250":"The Boneh–Shaw Fingerprinting Scheme is Better Than We Thought","237597198":"Ecient Anonymous Fingerprinting with Group Signatures (Extended Abstract)","220242439":"Best Security Index for Digital Fingerprinting.","220962819":"Efficient Smart-Card Based Anonymous Fingerprinting","221436446":"On the (In)Security of Two Buyer-Seller Watermarking Protocols.","220166450":"An Efficient Anonymous Fingerprinting Scheme.","277207221":"Random Codes and Graphs for Secure Communication","220639258":"On a Class of Traceability Codes","220722201":"Trials of Traced Traitors.","236965920":"Enhanced Blind Decoding of Tardos Codes with New Map-Based Functions","3379574":"Anonymous fingerprinting of electronic information with automatic identification of redistributers","4367626":"Expiration Dated Fingerprinting","250856634":"Fingerprinting and the Marking Assumption","41440561":"Encryption mechanisms for digital content distribution","221643899":"Attacks on Two Buyer-Seller Watermarking Protocols and an Improvement for Revocable Anonymity","278637270":"Tracing copies of multimedia documents with Tardos codes","2293104":"Protocols for Collusion-Secure Asymmetric Fingerprinting (Extended Abstract)","220333173":"Robust Parent-Identifying Codes and Combinatorial Arrays","2623856":"Anonymous Fingerprinting","26898116":"Collusion-resistant fingerprinting for multimedia in a broadcast channel environment","2629197":"Reports In Informatics","2949707":"Efficient Smart-Card Based Anonymous Fingerprinting","241164086":"Copyright protection of multimedia content using homomorphic public key cryptosystems","2986311":"Video fingerprinting and encryption principles for digital rights management","262247633":"How to Break COT-Based Fingerprinting Schemes and Design New One","2611541":"Resistance of Digital Watermarks to Collusive Attacks","221521478":"A new asymmetric fingerprinting framework based on secret sharing.","3960142":"Decoding codes with the identifiable parent property","220989023":"A New Fingerprinting Codes for Multimedia Contents","220803164":"Coin-based Anonymous Fingerprinting Scheme with Automatic Identification of Redistributors.","2552157":"Anonymous Fingerprinting as Secure as the Bilinear Diffie-Hellman Assumption","221523529":"(In)Security of an Efficient Fingerprinting Scheme with Symmetric and Commutative Encryption of IWDW 2005","227300594":"Best Security Index for Digital Fingerprinting","220722264":"How to Break a Semi-anonymous Fingerprinting Scheme","251859587":"Application of PKC-Based Digital Watermarking Model against False-accusation","220766881":"Worst-Case Optimal Fingerprinting Codes for Non-threshold Collusion","2361262":"Anonymous Fingerprinting with Direct Non-Repudiation","220722101":"Analysis of COT-based Fingerprinting Schemes: New Approach to Design Practical and Secure Fingerprinting Scheme","221291429":"Secure Fingerprinting Using Public-Key Cryptography (Position Paper).","220617395":"Efficient Dynamic Traitor Tracing","225461223":"A Note on the Limits of Collusion-Resistant","2629311":"Anonymous Fingerprinting Based on Committed Oblivious Transfer","3079606":"Collusion-secure fingerprinting for digital data","43668538":"Protección del copyright de imágenes digitales.","48602691":"Design and Analysis of Fair Content Tracing Protocols","267307077":"A Security Analysis of Some Physical Content Distribution Systems","221327002":"Efficient Anonymous Fingerprinting with Group Signatures","265116513":"On collusion-secure codes for copyright protection","220797062":"Robustness and Security of Digital Watermarks.","255566731":"Attribute-based encryption without key cloning","225504448":"Asymmetric Fingerprinting","220766875":"An Efficient Fingerprinting Scheme with Secret Sharing","3080601":"A class of traceability codes","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","2388895":"A General Description of Pirate Strategies in a Binary Fingerprinting System","260299580":"Impacts of Watermarking Security on Tardos-Based Fingerprinting","221160686":"Key Management for Multicast Fingerprinting","220739052":"A secure code for recipient watermarking against conspiracy attacks by all users","224345753":"Web Server for Web Page Fingerprinting","220237031":"A Trade-off Traitor Tracing Scheme","221175038":"An Efficient Anonymous Fingerprinting Protocol","242505639":"Information Hiding, 4th International Workshop, IHW 2001, Pittsburgh, PA, USA, April 25-27, 2001, Proceedings","224171145":"A Provably Secure Anonymous Buyer–Seller Watermarking Protocol","2617074":"Anonymous Fingerprinting Based on Committed Josep Domingo-Ferrer","2625011":"Self-Delegation with Controlled Propagation -- or -- What If You Lose Your Laptop","220833781":"Efficient Anonymous Fingerprinting of Electronic Information with Improved Automatic Identification of Redistributors.","284914213":"Solutions to the anti-piracy problem in oblivious transfer","221050867":"Anonymous Buyer-Seller Watermarking Protocol wth Additive Homomorphism.","2625224":"Coin-Based Anonymous Fingerprinting","3963608":"Applications of group signatures to anonymous fingerprinting schemes","224679296":"Practical Construction Against Theoretical Approach in Fingerprinting","220357316":"Digital Whistleblowing in Restricted Environments.","277293679":"Collusion-Secure Fingerprinting A Simulation of the Boneh and Shaw Scheme Coding Theory and Cryptography","220722122":"A Collusion-Secure Fingerprinting Code Reduced by Chinese Remaindering and Its Random-Error Resilience","220307663":"Collusion-Resistant Fingerprinting Systems: Review and Recent Results.","220722134":"Best Security Index for Digital Fingerprinting.","220779228":"Lower Bounds for Collusion-Secure Fingerprinting","220905183":"Characteristics of Some Binary Codes for Fingerprinting","2617808":"Asymmetric Fingerprinting for Larger Collusions","266405657":"Privacy Preserving Content Protection","251191552":"Collusion Resistance of Digital Fingerprinting Schemes","220833744":"An Anonymous Buyer-Seller Watermarking Protocol with Anonymity Control","221523658":"An Efficient Buyer-Seller Watermarking Protocol Based on Chameleon Encryption"},"index":477}