{"abs":"The basis of all design codes and recommendations that are endorsed by engineering societies are safety concepts which have been formulated with the intent to meet a society\u0027s safety demands. These demands are expressed in terms of failure probabilities, differentiating between structural safety and serviceability, accounting for the expected service life and the potential loss of life and assets. While in the last century safety formats were mainly based on experience, newer code developments are supported by fully probabilistic concepts and reliability engineering tools. Nonetheless, a realistic assessment of structural performance, and in consequence the expected service life, is in many cases impaired due to oversimplified design assumptions, the elastic determination of internal forces applying the principle of superposition, and a lack of understanding regarding the relevant stochastic models. While the \u0027elastic\u0027 design has merit in many design situations, its limitations are quickly reached if a realistic assessment of bearing capacity or serviceability are to be performed. Within this contribution the role of fracture mechanics in the reliability analyses of reinforced and pre-stressed concrete structures will be presented. After providing a review of the relevant concepts, examples are given to illustrate the significance of fracture mechanics as well as point out existing short-comings and the need for additional research.","title":"The role of fracture mechanics in reliability analyses","id":282919653,"url":"https://www.researchgate.net/publication/282919653_The_role_of_fracture_mechanics_in_reliability_analyses","names":["Roman Wendner","Alfred Strauss","H. Dranovak"],"references":{"220373507":"Modeling of Chloride Concentration Effect on Reinforcement Corrosion","245301372":"Basic Analysis of Structural Safety","225895666":"Predictive Distribution of Strength under Control","243048186":"A Distribution-Free Approach to Inducing Rank Correlation Among Input Variates","222873121":"Improvements to and limitations of Latin Hypercube Sampling","263112386":"Efficient Random Fields Simulation for Stochastic FEM Analyses","222412684":"Simulation of simply cross correlated random fields by series expansion methods","216756581":"Controlling Correlations in Latin Hypercube Samples","246233854":"Fracture and Size Effect in Concrete and Other Quasi-Brittle Materials","236660847":"Exact and Invariant Second Moment Code Format","223818049":"Correlation control in small-sample Monte Carlo type simulations I: A simulated annealing approach","225408600":"ATENA — A tool for engineering analysis of fracture in concrete","41956791":"Modelling of Chloride Transport in Concrete by Cellular Automata","235335934":"Berichtigung zu: Ansatz zur Beurteilung von chloridbelasteten Stahlbetonbauwerken mit Bewertung der Restlebensdauer","263112471":"Correlation control in small sample Monte Carlo type simulations II: Analysis of estimation formulas, random correlation and perfect uncorrelatedness","278139053":"Approach for the Assessment of Concrete Structures Subjected to Chloride Induced Deterioration","222666079":"Statistical prediction of fracture parameters of concrete and implications for choice of testing standard. Cem Concr Res 32: 529-556","223912354":"Latin Hypercube Sampling and the Propagation of Uncertainty in Analyses of Complex Systems, Technical Report, SAND2001-0417","284476942":"The role of latin hypercube sampling method in reliability engineering","251670043":"Debonding of adhesively bonded composite patch repairs of cracked steel members","268761881":"Étude graphique de détermination de distributions de probabilités planes dont les marges sont données","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","235335928":"Numerically and Experimentally Based Reliability Assessment of a Concrete Bridge Subjected to Chloride-Induced Deterioration"},"citedIn":{},"index":480}