{"abs":"This paper presents various Metamodel-Assisted Evolution Strategies which reduce the computational cost of optimisation problems involving time-consuming function evaluations. The metamodel is built using previously evaluated solutions in the search space and utilized to predict the fitness of new candidate solutions. In addition to previous works by the authors, the new metamodel takes also into account the error associated with each prediction, by correlating neighboring points in the search space. A mathematical problem and the problem of design- ing an optimal airfoil shape under viscous flow considerations have been worked out. Both demonstrate the noticeable gain in computational time one might expect from the use of metamodels in Evolution Strategies.","title":"Metamodel—Assisted Evolution Strategies","id":216300590,"url":"https://www.researchgate.net/publication/216300590_Metamodel-Assisted_Evolution_Strategies","names":["Michael Emmerich","Alexios Giotis","Mutlu Özdemir","Thomas Bäck","Kyriakos Giannakoglou"],"references":{"228782051":"Low-cost stochastic optimization for engineering applications","220701677":"Accelerating the Convergence of Evolutionary Algorithms by Fitness Landscape Approximation.","3903856":"Managing approximate models in evolutionary aerodynamic design optimization","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","248336865":"Viscous-Inviscid Analysis of Transonic and Low Reynolds Number Airfoils","2366696":"Managing Approximate Models in Evolutionary Aerodynamic Design Optimization","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","2663161":"Numerical Optimization Using Computer Experiments","2318192":"Numerical Optimization Using Computer Experiments","279495803":"Metalmodeling techniques for evolutionary optimization of computationally expensive problems: promises and limitations","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","220690578":"Evolution and Optimum Seeking","38363487":"The Design and Analysis of Computer Experiments","221933068":"Multivariate Geostatistics","233006324":"Low-cost genetic optimization based on inexact pre-evaluations and the sensitivity analysis of design parameters","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","226130690":"Multivariate statistics","34288727":"Interpolation and pseudorandom function generation /"},"citedIn":{"3421747":"Combining global and local surrogate models to accelerate evolutionary optimization. IEEE Trans Syst Man Cybern Part C Appl Rev","220449066":"A Review of Constraint-Handling Techniques for Evolution Strategies","45622706":"Optimization of a range of 2D and 3D bulk forming processes by a meta-model assisted evolution strategy","4074804":"Comparing neural networks and Kriging for fitness approximation in evolutionary optimization","41116025":"Algorithme intelligent d\u0027optimisation d\u0027un design structurel de grande envergure","271514661":"Inverse Analysis of Forming Processes Based on FORGE Environment","220740645":"Fitness Approximation In Evolutionary Computation - a Survey.","221008674":"Evolutionary optimization of ship propulsion systems","268391153":"Evolution Strategies with an RBM-Based Meta-model","242549351":"Derivative Free Surrogate Optimization for Mixed-Integer Nonlinear Black Box Problems in Engineering","262293175":"Accelerating Population-Based Search Heuristics by Adaptive Resource Allocation","221009210":"Decreasing the Number of Evaluations in Evolutionary Algorithms by Using a Meta-model of the Fitness Function","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","257779268":"The optimal die semi-angle concept in wire drawing, examined using automatic optimization techniques","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","221008435":"Use of interactive evolutionary computation with simplified modeling for computationally expensive layout design optimization","250693102":"A multilevel approach to single- and multiobjective aerodynamic optimization","225167691":"Continuous Lunches Are Free Plus the Design of Optimal Optimization Algorithms","221006861":"Metamodel-Assisted Mixed Integer Evolution Strategies and Their Application to Intravascular Ultrasound Image Analysis","228963975":"A comparison between optimisation algorithms for metal forming processes","231904501":"Determination of plastic properties of metals by instrumented indentation using a stochastic optimization algorithm","224645706":"Trusted Evolutionary Algorithm","226249293":"Neural Networks as Surrogate Models for Measurements in Optimization Algorithms","222654832":"Improving the Hydrodynamic Performance of Diffuser Vanes via Shape Optimization","266171114":"Benefits of High Performance Computing applied to the numerical simulation of forged parts","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","2922005":"Evolution Strategies assisted by Gaussian Processes with Improved Pre-Selection Criterion","222545921":"Numerical product design: Springback prediction, compensation and optimization","262605029":"Evolutionary Programming for High-Dimensional Constrained Expensive Black-Box Optimization Using Radial Basis Functions","224751910":"Tuning Search Algorithms for Real-World Applications: A Regression Tree Based Approach","220291686":"A computational intelligence algorithm for simulation-driven optimization problems","240852241":"METAMODEL-ASSISTED EVOLUTION STRATEGIES APPLIED IN ELECTROMAGNETIC COMPATIBILITY DESIGN","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","241061905":"Solving optimisation problems in metal forming using Finite Element simulation and metamodelling techniques","224570930":"A systems approach to evolutionary multiobjective structural optimization and beyond","257392388":"A computational intelligence algorithm for expensive engineering optimization problems","221608800":"A Classifier-Assisted Framework for Expensive Optimization Problems: A Knowledge-Mining Approach","262328308":"An evolution strategy assisted by an ensemble of local Gaussian process models","262891509":"An optimisation strategy for industrial metal forming processes : MModelling, screening and solving of optimisation problems in metal forming","265614475":"ADAPTIVE SURROGATE-ASSISTED EVOLUTION","255826272":"A Study For Efficiently Solving Optimisation Problems With An Increasing Number Of Design Variables","267819667":"You can judge a book by its cover – Evolution of gait controllers based on program code analysis","279057607":"Meta-Heuristic Algorithms in Car Engine Design: A Literature Survey","226796771":"Evolutionary-based Meta-modelling: The Relevance of Using Approximate Models in Hydroinformatics","280848340":"Evolution Strategies","228615884":"A multi-objective optimization procedure with successive approximate models","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","238565704":"STOCHASTIC AND DETERMINISTIC OPTIMIZATION FOR TURBOMACHINERY APPLICATIONS BASED ON THE ADJOINT FORMULATION","221228382":"Parallelization of Multi-objective Evolutionary Algorithms Using Clustering Algorithms","245310702":"Metamodel-assisted distributed genetic algorithms applied to structural shape optimization problems","220199533":"Fitness inheritance in multiple objective evolutionary algorithms: a test bench and real-world evaluation. Appl Soft Comput","220444245":"Covariance Matrix Self-Adaptation and Kernel Regression - Perspectives of Evolutionary Optimization in Kernel Machines","28351434":"Evolution von Laufrobotersteuerungen mit Genetischer Programmierung","224916508":"Evolution by Adapting Surrogates","229071835":"A Bayesian Decision Theoretical Approach to Supervised Learning, Selective Sampling, and Empirical Function Optimization","3421621":"Accelerating Evolutionary Algorithms With Gaussian Process Fitness Function Models","220935343":"UAV Controller Design Using Evolutionary Algorithms","216300130":"Experimental Research in Evolutionary Computation---The New Experimentalism","220867488":"Handling Undefined Vectors in Expensive Optimization Problems","263123488":"An algorithm for computationally expensive engineering optimization problems","263430204":"On Using Surrogates with Genetic Programming","228344339":"Optimization of forging processes using Finite Element simulations: A comparison of Sequential Approximate Optimization and other algorithms","272846284":"GP-DEMO: Differential Evolution for Multiobjective Optimization based on Gaussian Process models","268988315":"Two Gaussian Approaches to Black-Box Optomization","221008831":"A Utile Function Optimizer","221112248":"Explicit Local Models: Towards \"Optimal\" Optimization Algorithms.","225984495":"A grid-enabled asynchronous metamodel-assisted evolutionary algorithm for aerodynamic optimization","264900688":"Analyzing complex mathematical model behavior by PLSR-based multivariate metamodeling","23276280":"A Graphical Model for Evolutionary Optimization","32173687":"Automotive Engine Calibration with Experiment-Based Evolutionary Multi-objective Optimization","220176770":"Memetic algorithm using multi-surrogates for computationally expensive optimization problems. Soft Comput","245314879":"Evolutionary optimization using a new radial basis function network and the adjoint formulation","228570175":"Metamodel assisted genetic algorithm for truss weight minimization","261109812":"On the use of a BSP Tree to create local surrogate models","236863927":"Intensive Surrogate Model Exploitation in Self-adaptive Surrogate-assisted CMA-ES (saACM-ES)","271661210":"Numerical simulation of extruded clay paste compression","227022372":"A Review of Techniques for Handling Expensive Functions in Evolutionary Multi-Objective Optimization","224177906":"Dimensionality-reduction frameworks for computationally expensive problems","233775451":"Exploiting Genomic Knowledge in Optimising Molecular Breeding Programmes: Algorithms from Evolutionary Computing","271366292":"Efficient multi-criteria optimization on noisy machine learning problems","226738239":"Multilevel Optimization Algorithms Based on Metamodel- and Fitness Inheritance-Assisted Evolutionary Algorithms","228695583":"Stochastic Design of a Non-Linear Controller for Autonomous UAV Recovery","221006227":"The application of evolutionary multi-criteria optimization to dynamic molecular alignment","224247010":"On the selection of surrogate models in evolutionary optimization algorithms","225989818":"An Evolutionary Multi-objective Adaptive Meta-modeling Procedure Using Artificial Neural Networks","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","228951393":"Resource-Aware Parameterizations of EDA","223747730":"Aerodynamic shape design using evolutionary algorithms and new gradient-assisted metamodels","216301601":"Models for Evolutionary Algorithms and Their Applications in System Identification and Control Optimization","261038410":"A hybrid local search operator for multiobjective optimization","277285440":"Libor Běhounek:","4090102":"Evolution strategies with controlled model assistance","242382523":"Multi-Objective Evolutionary Optimization of Gas Turbine Components","228667240":"A Metamodel Based Optimisation Algorithm for Metal Forming Processes","216300591":"Metamodel-assisted Multiobjective Optimisation Strategies and Their Application in Airfoil Design","270276055":"Problems Detected by a Ripple-Down Rules Based Medication Review Decision Support System: Are They Relevant?","224301970":"Multilevel optimization strategies based on metamodel-assisted evolutionary algorithms, for computationally expensive problems","28357502":"Genetische Programmierung einer algorithmischen Chemie","262322797":"A unification of the prevalent views on exploitation, exploration, intensification and diversification","220743160":"Model-Assisted Steady-State Evolution Strategies","236177858":"JavaEvA A Java based framework for Evolutionary Algorithms","4090093":"Performance of kriging and cokriging based surrogate models within the unified framework for surrogate assisted optimization","2568691":"Models for Evolutionary Algorithms and Their Applications in System Identification and Control Optimization","46491920":"Evolutionary optimisation of noisy multi-objective problems using confidence-based dynamic resampling","238688493":"A fast Evolutionary-based Meta-Modelling Approach for the Calibration of a Rainfall-Runoff Model","269387735":"An adaptive-topology ensemble algorithm for engineering optimization problems","235960522":"Inverse modeling and numerical optimization of heater temperatures in a Bridgman process","228957563":"ON THE USE OF SURROGATE EVALUATION MODELS IN MULTI-OBJECTIVE EVOLUTIONARY ALGORITHMS","225407631":"Automatic Optimization Techniques Applied to a Large Range of Industrial Test Cases","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","224646025":"Curse and Blessing of Uncertainty in Evolutionary Algorithm Using Approximation","228520309":"Optimization by gaussian processes assisted evolution strategies","233529605":"Increasing the Density of Available Pareto Optimal Solutions","257705395":"An Optimization Algorithm Employing Multiple Metamodels and Optimizers","251010823":"Algorithmes hybrides pour l’optimisation globale","222544049":"Response Surface Approximation of Pareto Optimal Front in Multi-objective Optimization","261369702":"Pareto Front Estimation for Decision Making","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","220176614":"Faster convergence by means of fitness estimation","2564314":"Accelerating Evolutionary Algorithms Using Fitness Function Models"},"index":483}