{"abs":"The Direct Optimized Probabilistic Calculation method -DOProC -deals with probabilistic tasks where certain input quantities are of a random nature. DOProC is typically used in probabilistic reliability assessment of load carrying structures. DOProC can be also employed in probabilistic designs of structural elements with the specified reliability. In many cases, this calculation method is very efficient and provides accurate estimates of resulting probabilities. DOProC has been successfully applied, among others, in the probabilistic calculation of fatigue cracks in steel structures and bridges which are subject to cyclical loads. The software used for that purpose, FCProbCalc, makes it possible to monitor efficiently and operatively development of fatigue damage to the structure and to specify times for service inspection. This means, the structure is compliant and well suited for operation in terms of fatigue damage. The methods and application can considerably improve estimation of maintenance costs for the structures and bridges subject to cyclical loads.","title":"Application of the Direct Optimized Probabilistic Calculation","id":259517885,"url":"https://www.researchgate.net/publication/259517885_Application_of_the_Direct_Optimized_Probabilistic_Calculation","names":["Martin Krejsa"],"references":{"251558623":"Variations in the building site categories in the underground mining region of Doubrava (Czech Republic) for land use planning","232390461":"Probabilistic criteria of structural stochastic optimal controls","237422528":"Stochastic Modeling of Deterioration Processes through Dynamic Bayesian Networks","256379905":"Structural Reliability Under Combined Random Load Sequences","253649429":"Variational Principles of Fracture Mechanics","223885715":"Probabilistic finite element analysis using ANSYS","37450583":"A Fatigue Primer for Structural Engineers","222201042":"Carpinteri A and Paggi M 2007 Self-similarity and crack growth instability in the correlation between the Paris constants. Eng. Fracture Mech","245315730":"Reliability-based management of inspection, maintenance and repair of offshore structures","251558545":"Palmgren–Miner’s rule and fracture mechanics-based inspection planning","228872112":"Extended finite element method for fretting fatigue crack propagation. Int J Solids Struct","223818049":"Correlation control in small-sample Monte Carlo type simulations I: A simulated annealing approach","222791536":"The stochastic finite element method: Past, present and future. Comput Methods Appl Mech Eng","245097154":"Sensitivity analysis of the stability problems of thin-walled structures","226884732":"Monte Carlo techniques in computational stochastic mechanics","264154407":"Performance-based design of concrete structures: durability aspects","223912354":"Latin Hypercube Sampling and the Propagation of Uncertainty in Analyses of Complex Systems, Technical Report, SAND2001-0417","259527043":"Structural Reliability Assessment using a Direct Determined Probabilistic Calculation","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{"269113608":"Advanced Numerical Method used in Computer Fluid Dynamics Modellings of Loading on Buildings"},"index":485}