{"abs":"This thesis describes research on the use of a genetic algorithm (GA) to prescribe treatment plans for forest management at the stand level. Forest management refers to making decisions about when and where to intervene in the natural growth of forests to achieve objectives, such as enhancing the visual quality of a stand or maximizing timber yield. A prescription is a schedule of thinning treatments applied to stands over a planning horizon. When multiple management goals exist treatment prescription becomes a complex multi- objective problem. The effectiveness of a GA depends on selecting an appropriate representation and germane fitness function. These design decisions are reviewed, followed by a series of experiments testing the performance of the GA. Different parameter settings are compared and the GA is contrasted with some other heuristic search methods. The final experiment compares a plan created by the GA to a plan recommended by a human expert.","title":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","id":237630671,"url":"https://www.researchgate.net/publication/237630671_SEARCHING_FOR_PRESCRIPTIVE_TREATMENT_SCHEDULES_WITH_A_GENETIC_ALGORITHM_A_TOOL_FOR_FOREST_MANAGEMENT","names":["JOHN DEWEY"],"references":{"2367140":"Bi-Objective Genetic Algorithms for Forest Management: A Comparative Study","2485857":"Genetic Algorithms for Real Parameter Optimization","201976655":"Real-Coded Genetic Algorithms and Interval-Schema","2333106":"Simulated Binary Crossover for Continuous Search Space","30821765":"Genetic algorithms as function optimizers","222130665":"Goals and goal orientation in decision support systems for ecosystem management","222808529":"Multiobjective dynamic programming for forest resource management","243686559":"Real-coded Genetic Algorithms with Simulated Binary Crossover: Studies on Multi-modal and Multi-objective Problems. Complex Systems 9(6), 431-454","2527551":"The GENITOR Algorithm and Selection Pressure: Why Rank-Based Allocation of Reproductive Trials is Best","215542657":"Multi-objective topology optimization using evolutionary algorithms","226445989":"Tackling Real-Coded Genetic Algorithms: Operators and Tools for Behavioural Analysis","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","264923669":"Genetic Algorithms, Noise, and the Sizing of Populations","239059359":"Finding Acceptable Solutions in the Pareto-Optimal Range using Multiobjective Genetic Algorithms","2775434":"Real-Coded Genetic Algorithms, Virtual Alphabets and Blocking","2264198":"Using Genetic Algorithms With Small Populations","223396279":"A practical decision-analysis process for forest ecosystem management","35038526":"Simulated adaptive management for timber and wildlife under uncertainty /","223881139":"Optimal stand management with endogenous risk of sudden destruction","255585232":"THE DESIGN OF A GENETIC ALGORITHM BASED SPATIALLY CONSTRAINED TIMBER HARVEST SCHEDULING MODEL","222126038":"Using a Genetic Algorithm to Generate Alternative Sketch Maps for Urban Planning","2409930":"Non-Linear Genetic Representations","233681887":"Combining Tabu Search and Genetic Algorithm Heuristic Techniques to Solve Spatial Harvest Scheduling Problems","2357654":"Information Theory and Coding","237306013":"The NED Forest Management DSS: The Integration of Growth and Yield Models","220045412":"Adoption in Natural and Artificial System","31679327":"Decision support systems : a knowledge-based approach / C.W. Holsapple, A.B. Whinston.","236443691":"Some Experiments in Machine Learning Using Vector Evaluated Genetic Algorithms","222688120":"NED-2: An agent-based decision support system for forest ecosystem management","222368511":"Implementation of a spatial decision support system for rural land use planning: integrating geographic information system and environmental models with search and optimisation algorithms. Comput Electron Agr","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{},"index":49}