{"abs":"A probability density contour-based expanding method (CBEM) is developed to provide an intuitive interpretation of calculating the reliability index of an engineered system in the original physical space of random variables. In this technique, a distance ratio is defined to quantify the reliability index in conjunction with a dispersive probability density contour (that just reaches the failure surface) and a unit contour (which is equivalent to the one-standard-deviation domain). The visualisation of the relative position, between the expanding probability density contour and limit state function, can be provided for bivariate and trivariate cases. The determination of the limit state function of the engineered system is discussed, which builds on an outer fence of the dispersive probability density contour. A spatial discretised approximation to both the joint probability density contour and the critical state surface is facilitated through taking advantage of the new multivariate visualisation techniques in R. Such an approximation allows the curvature of the limit state surface to be very complex, and the probability distribution contour of random variables to be any form, even non-parametric one. Several numerical examples are presented to illustrate the validity and applicability of the proposed method. A comparison between the proposed approach and the conventional reliability methods is provided.","title":"Geometric reliability analysis applied to wave overtopping of sea defences","id":281461347,"url":"https://www.researchgate.net/publication/281461347_Geometric_reliability_analysis_applied_to_wave_overtopping_of_sea_defences","names":["Xing Zheng Wu","Ocean Engineering"],"references":{"273581773":"The Surveyor\u0027s Area Formula","239335622":"A Probability-based structural code","239387459":"Efficient Spreadsheet Algorithm for First-Order Reliability Method","259582719":"An approach to assess flooding and erosion risk for open beaches in a changing climate","222388299":"A probability method for predicting time-dependent long-term shoreline erosion","222761421":"A note on wave energy dissipation over steep beaches. Coast Eng","246160032":"Factors of safety and reliability in geotechnical engineering. J Geotech Geoenviron Eng ASCE","245195918":"Distributions for storm surge extremes","227817089":"Assessment of the effects of cyclic floodplain rejuvenation on flood levels and biodiversity along the Rhine River","248091860":"A generalized probabilistic approach for slope analysis: practical application to an open pit iron ore mine","228814396":"Risk analysis-tool for integrated coastal planning","241783115":"Joint Distribution of Wave Height And Wave Crest Velocity From Reconstructed Data With Application to Ringing","257550845":"Probabilistic slope stability analysis by a copula-based sampling method","258539841":"Assessing the hydrodynamic boundary conditions for risk analyses in coastal areas: a stochastic storm surge model. Nat Hazards Earth Syst Sci","260075821":"Probabilistic modelling of extreme storms along the Dutch coast","223922153":"Reliability analysis of rock slopes involving correlated nonnormals","268245196":"An Introduction to Copulas","260750267":"Development of environmental contours using Nataf distribution model","222628087":"Fast Probability Integration by Three-Parameter Normal Tail Approximation","226330440":"Dickson, M. E., M. J. Walkden, and J. W. Hall. Systemic impacts of climate change on an eroding coastal region over the twenty-first century. Climatic Change 84","279384210":"First-Order and Second-Order Reliability Methods","38358385":"Bootstrap Methods: Another Look at the Jack-Knife","239370492":"Modelling uncertainty in long-term predictions of significant wave height","44366367":"Density Estimation For Statistics And Data Analysis","242376908":"An Introduction to The Bootstrap","291749027":"Modelling long-term distributions of significant wave height","230770816":"Applied Statistics and Probability for Engineers","230663933":"An Introduction to Statistical Modeling of Extreme Values. Springer Series in Statistics XIV","239743240":"Statistical Methods In The Atmospheric Sciences","259517492":"Evaluating environmental joint extremes for the offshore industry","241068952":"Probabilistic Models of Waves in the CoastalZone","256379905":"Structural Reliability Under Combined Random Load Sequences","265434904":"Statistical Methods for Multivariate Extremes: An Application to Structural Design","223096071":"Depth limited design wave heights in very flat regions. Coast Eng 23(1-2):43-59","245679850":"Coastal Flood Risk Assessment","256817950":"A new approach to environmental contours for ocean engineering applications based on direct Monte Carlo simulations","200806059":"An Analysis of Transformation","226441258":"Long-term wave height distributions at seven stations around the British Isles","245196231":"Quantifying uncertainty in extreme values of design parameters with resampling techniques","247385445":"Reliability and Statistics in Geotechnical Engineering","245301372":"Basic Analysis of Structural Safety","245293946":"Closure to “Factors of Safety and Reliability in Geotechnical Engineering” by J. M. Duncan","236518524":"Statistical Uncertainty in Long-Term Distributions of Significant Wave Height","284145675":"Structural reliability under combined load sequences","237067972":"Applied Smoothing Techniques for Data Analysis: The Kernel Approach with S-PLUS Illustrations","267156490":"Development of fragility functions for slope instability analysis","235748202":"A Comparison of Wind Turbine Design Loads in Different Environments Using Inverse Reliability Techniques [10]","224817420":"Modern Applied Statistics With S","29630122":"Flood Risk Assessment and Associated Uncertainty","232906132":"Evaluating environmental joint extremes for the offshore industry","266197930":"Uncertainty Modeling: with Applications to Multidimensional Civil Engineering Systems","245285858":"Efficient Reliability Evaluation Using Spreadsheet","285351165":"Journal of the American Concrete Institute"},"citedIn":{},"index":490}