{"abs":"We present a new algorithm to compute the Snell envelope in the specific case where the criteria to optimize is associated with a small probability or a rare event. This new approach combines the Stochastic Mesh approach of Broadie and Glasserman with a particle approximation scheme based on a specific change of measure designed to concentrate the computational effort in regions pointed out by the criteria. The theoretical analysis of this new algorithm provides non asymptotic convergence estimates. Finally, the numerical tests confirm the practical interest of this approach.","title":"Snell Envelope with Small Probability Criteria","id":255796968,"url":"https://www.researchgate.net/publication/255796968_Snell_Envelope_with_Small_Probability_Criteria","names":["Pierre Del Moral","Peng Hu","Nadia Oudjane","Applied Mathematics and Optimization"],"references":{"2249059":"The Law of the Euler Scheme for Stochastic Differential Equations: I. Convergence Rate of the Distribution Function","265118463":"An Introduction to Particle Methods with Financial Applications","2126101":"Genealogical particle analysis of rare events","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","5062149":"A Sotchastic Mesh Method for Pricing High-Dimensional American Options","226437062":"Interacting particle systems for the computation of rare credit portfolio losses","44105450":"On the Robustness of the Snell Envelope","221528607":"Revisit of stochastic mesh method for pricing American options","2621163":"The Law of the Euler Scheme for Stochastic Differential Equations: II. Convergence Rate of the Density","233996191":"Numerical Methods in Finance"},"citedIn":{"262526070":"Valuation of Barrier Options using Sequential Monte Carlo","281671347":"Kriging Metamodels for Bermudan Option Pricing","256606229":"Sequential Design for Optimal Stopping Problems"},"index":494}