{"abs":"This paper presents a study on the effect of blow-holes on the reliability of a cast component. The most probable point (MPP) based univariate response surface approximation is used for evaluating reliability. Crack geometry, blow-hole dimensions, external loads and material properties are treated as independent random variables. The methodology involves novel function decomposition at a most probable point that facilitates the MPP-based univariate response surface approximation of the original multivariate implicit limit state/performance function in the rotated Gaussian space. Once the approximate form of the original implicit limit state/performance function is defined, the failure probability can be obtained by Monte Carlo simulation (MCS), importance sampling technique, and first- and second-order reliability methods (FORM/SORM). FORTRAN code is developed to automate calls to ABAQUS for numerically simulating responses at sample points, to construct univariate response surface approximation, and to subsequently evaluate the failure probability by MCS, importance sampling technique, and FORM/SORM.","title":"Effect of blow-holes on reliability of cast component","id":225553742,"url":"https://www.researchgate.net/publication/225553742_Effect_of_blow-holes_on_reliability_of_cast_component","names":["B. N. Rao","Rajesh Ashokkumar","Sadhana"],"references":{"240432564":"The influence of porosity on the fatigue life for sand and permanent mould cast aluminium","228573534":"A univariate approximation at most probable point for higer-order reliability analysis","242481042":"Fracture Mechanics: Fundamentals \u0026 Applications","222857578":"Refined second-order reliability analysis","223342952":"Material Defects In Rolling Contact Fatigue of Railway Wheels-The Influence of Overloads and Defect Clusters[J]","251544502":"Decomposition methods for structural reliability analysis revisited","284088900":"Fatigue crack development from defects in cast aluminium alloy","223491257":"Fatigue Strength and Applications of Cast Aluminium Alloys with Different Degrees of Porosity","222837988":"Decomposition methods for structural reliability analysis","222165872":"Reliability analysis—A review and some perspectives","222832250":"Xu, H.: A univariate dimension-reduction method for multi-dimensional integration in stochastic mechanics. Probabilitic Engineering Mechanics 19, 393-408","273800355":"Probability Integration by Directional Simulation","225805894":"Asymptotic approximations for multinormal domain and surface integrals","223281659":"Influence of porosity on the fatigue limit of die cast magnesium and aluminium alloys","250338207":"The Structural Integrity of Cast Aluminium Automotive Components Subjected to Fatigue Loads","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","222588317":"New light on first- and second-order reliability methods","222745084":"Fatigue Life Assessment of Aluminium Alloys with Casting Defects","227605578":"A generalized dimension‐reduction method for multidimensional integration in stochastic mechanics","229335095":"In-Service Loading of AlSi11 Cast Aluminum Alloy in the Very High Cycle Regime","245284675":"Distribution of Quadratic Forms in Normal Space—Application to Structural Reliability","275188793":"Asymptotic Approximations for Multinormal Integrals","222022180":"Fatigue of cast aluminum alloys under constant and variable amplitude loading","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{},"index":496}