{"abs":"In several implementations of Sequential Monte Carlo (SMC) methods it is natural, and important in terms of algorithmic efficiency, to exploit the information of the history of the samples to optimally tune their subsequent propagations. In this article we provide an asymptotic theory for a class of such adaptive SMC methods. The theoretical framework developed here will cover, under assumptions, several commonly used SMC algorithms. There are only limited results about the theoretical underpinning of such adaptive methods: we will bridge this gap by providing a weak law of large numbers (WLLN) and a central limit theorem (CLT) for some of these algorithms. The latter seems to be the first result of its kind in the literature and provides a formal justification of algorithms used in many real data contexts.","title":"On the Convergence of Adaptive Sequential Monte Carlo Methods","id":242331345,"url":"https://www.researchgate.net/publication/242331345_On_the_Convergence_of_Adaptive_Sequential_Monte_Carlo_Methods","names":["Alexandros Beskos","Ajay Jasra","Alexandre Thiery"],"references":{"221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","37405500":"Applied Analysis of the Navier Stokes Equations","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","258727299":"Non-Asymptotic Analysis of Adaptive and Annealed Feynman-Kac Particle Models","228623464":"A Tutorial on Particle Filtering and Smoothing: Fifteen Years Later","50425579":"On the Stability of Sequential Monte Carlo Methods in High Dimensions","227513442":"Inference for Lévy Driven Stochastic Volatility Models Via Adaptive Sequential Monte Carlo","2131950":"On the ergodic properties of some adaptive MCMC algorithms","38326887":"Simulating Normalizing Constants: From Importance Sampling to Bridge Sampling to Path Sampling","2121967":"Central Limit Theorem for sequential Monte Carlo methods and its application to Bayesian inference","251232649":"Sequential Monte Carlo Methods for High-Dimensional Inverse Problems: A Case Study for the Navier--Stokes Equations","45866217":"Optimal scalings for local Metropolis--Hastings chains on nonproduct targets in high dimensions","2453431":"A Sequential Particle Filter Method for Static Models","221668291":"On adaptive resampling strategies for sequential Monte Carlo methods","228338569":"An Adaptive Sequential Monte Carlo Method for Approximate Bayesian Computation","2439039":"Convergence of Sequential Monte Carlo Methods","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","4993330":"Sequential Monte Carlo Samplers","254401175":"Adaptive Monte Carlo on Multivariate Binary Sampling Spaces"},"citedIn":{"251232649":"Sequential Monte Carlo Methods for High-Dimensional Inverse Problems: A Case Study for the Navier--Stokes Equations","269636450":"Sequential Monte Carlo Methods for Bayesian Elliptic Inverse Problems","264833912":"Parallel Sequential Monte Carlo Samplers and Estimation of the Number of States in a Hidden Markov Model","284750937":"Rare event simulation and spliting for discontinuous random variables","273067556":"Biased Online Parameter Inference for State-Space Models","263281113":"Divide-and-Conquer with Sequential Monte Carlo","265127940":"Fluctuation Analysis of Adaptive Multilevel Splitting","289367110":"Monte Carlo algorithms for computing $$\\alpha $$ α -permanents","279808481":"Rare Event Simulation and Splitting for Discontinuous Random Variables"},"index":499}