{"abs":"Accurate prediction of failure probability of a given structural system subjected to parametric uncertainty often leads to a computationally challenging process requiring considerable amount of time. To overcome this issue, it is advantageous to develop non-intrusive model, that approximates the system response and perform all subsequent operations on the developed model. This paper presents a novel non-intrusive algorithm, referred to as polynomial correlated function expansion (PCFE), for high-fidelity reliability analysis. The proposed method expresses the output in a hierarchical order of component functions which facilitate (i) expressing the component functions in term of extended bases, (ii) determination of actual responses at quasi-random sample points, (iii) determination of the unknown coefficients associated with the bases by employing homotopy algorithm and (iv) Monte Carlo simulation. PCFE decouples the stochastic computations and finite element (FE) computations, and consecutively the FE code can be treated as a black box, as in the case of a commercial software. Six numerical problems, involving explicit performance functions and real-life problems described by implicit limit-state functions, have been solved to illustrate the performance of the proposed approach. It is observed that PCFE outperforms the existing approaches.","title":"Assessment of polynomial correlated function expansion for high-fidelity structural reliability analysis","id":283542543,"url":"https://www.researchgate.net/publication/283542543_Assessment_of_polynomial_correlated_function_expansion_for_high-fidelity_structural_reliability_analysis","names":["Souvik Chakraborty","Rajib Chowdhury","Structural Safety"],"references":{"245284895":"Efficient Algorithm for Second-Order Reliability Analysis","267083372":"Generalized inverse of a matrix and its applications. Wiley, New York","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","259510909":"Adaptive response surface based efficient Finite Element Model Updating","286971920":"A Moving Kriging Interpolation Response Surface Method for Structural Reliability Analysis","254463654":"Bayesian Kriging Analysis and Design for Stochastic Simulations","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","276102651":"Confidence Bounds on Design Variables Using High-Dimensional Model Representation–Based Inverse Reliability Analysis","233997414":"D-MORPH regression: Application to modeling with unknown parameters more than observation data","267087997":"Monte Carlo simulation for reliability evaluation of complex systems","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","224815999":"High-dimensional model representation for structural reliability analysis","230765659":"Doubly weighted moving least squares and its application to structural reliability analysis","51945859":"Bayesian Post-Processor and other Enhancements of Subset Simulation for\nEstimating Failure Probabilities in High Dimensions","241105149":"Reliability Sensitivity Algorithm Based on Stratified Importance Sampling Method for Multiple Failure Modes Systems","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","223352183":"First-order concepts in system reliability. Struct Saf 1:177-188","273800443":"Second‐Order Reliability Approximations","228261680":"Low-Discrepancy Sequences: Monte Carlo Simulation of Option Prices","256919419":"Combined parametric–nonparametric uncertainty quantification using random matrix theory and polynomial chaos expansion","255672338":"Reliability Analysis Using Parabolic Failure Surface Approximation","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","256688505":"On the use of variance reducing multipliers in Monte Carlo computations of a global sensitivity index","230663817":"Implementing Sobol\u0027s quasi-random sequence generator⬚ ⬚","251401035":"General formulation of HDMR component functions with independent and correlated variables","273889515":"A semi-analytical framework for structural reliability analysis","222780925":"A new adaptive importance sampling scheme","256380552":"Monte Carlo simulation of rock slope reliability","222165116":"Observations on applications of importance sampling in structural reliability analysis","223008521":"General multi-dimensional probability integration by directional simulation","222062335":"A new directional simulation method for system reliability. Part II: Application of neural networks","277578829":"Reliability Analysis of Composite Laminate Structures by Moving Kriging Interpolation Response Surface Method","262107481":"UNCERTAINTY PROPAGATION USING HYBRID HDMR FOR STOCHASTIC FIELD PROBLEMS","273482123":"Polynomial Correlated Function Expansion for Nonlinear Stochastic Dynamic Analysis","222527371":"High-order limit state functions in the response surface method for structural reliability analysis","222334475":"The exact D-optimal first order saturated design with 17 observations","222165872":"Reliability analysis—A review and some perspectives","274096027":"Multivariate Function Approximations Using D-MORPH Algorithm","239063019":"Good permutations for extreme discrepancy","265657857":"ALGORITHM 659: implementing Sobol\u0027s quasirandom sequence generator","289410582":"D-optimal schemes for polynomial regression on m-dimensional cube","51890126":"Metamodel-based importance sampling for structural reliability analysis","222588317":"New light on first- and second-order reliability methods","242516525":"Uniformly distributed sequences with an additional uniform property","262249212":"A class of composite designs for response surface methodology","227155031":"On the Efficiency of Certain Quasi-Random Sequences of Points in Evaluating Multi-Dimensional Integrals","245284547":"A Response Surface Approach for Reliability Analysis","261134031":"Multicut-High Dimensional Model Representation for Structural Reliability Bounds Estimation Under Mixed Uncertainties","223307920":"Multiple design points in first and second-order reliability","251544479":"Stochastic sampling using moving least squares response surface approximations","257767992":"Cut-HDMR-based fully equivalent operational model for analysis of unreinforced masonry structures","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","273800355":"Probability Integration by Directional Simulation","257767983":"A reduced polynomial chaos expansion method for the stochastic finite element analysis","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","257591087":"D-MORPH regression for modeling with fewer unknown parameters than observation data","224815763":"High-dimensional model representation for structural reliability analysis","245193828":"Improving importance sampling method in structural reliability","222255813":"A new directional simulation method for system reliability. Part I: Application of deterministic point sets"},"citedIn":{},"index":509}