{"abs":"Approximation Assisted Optimization (AAO) is widely used in engineering design problems to replace computationally intensive simulations with metamodeling. Traditional AAO approaches employ global metamodeling for exploring an entire design space. Recent research works in AAO report on using local metamodeling to focus on promising regions of the design space. However, very limited works have been reported that combine local and global metamodeling within AAO. In this paper, a new approximation assisted multiobjective optimization approach is developed. In the proposed approach, both global and local metamodels for objective and constraint functions are used. The approach starts with global metamodels for objective and constraint functions and using them it selects the most promising points from a large number of randomly generated points. These selected points are then “observed”, which means their actual objective/constraint function values are computed. Based on these values, the “best” points are grouped in multiple clustered regions in the design space and then local metamodels of objective/constraint functions are constructed in each region. All observed points are also used to iteratively update the metamodels. In this way, the predictive capabilities of the metamodels are progressively improved as the optimizer approaches the Pareto optimum frontier. An advantage of the proposed approach is that the most promising points are observed and that there is no need to verify the final solutions separately. Several numerical examples are used to compare the proposed approach with previous approaches in the literature. Additionally, the proposed approach is applied to a CFD-based engineering design example. It is found that the proposed approach is able to estimate Pareto optimum points reasonably well while significantly reducing the number of function evaluations.","title":"Approximation Assisted Optimization with Combined Global and Local Metamodeling","id":262372392,"url":"https://www.researchgate.net/publication/262372392_Approximation_Assisted_Optimization_with_Combined_Global_and_Local_Metamodeling","names":[],"references":{"233556491":"Acceleration of the convergence speed of evolutionary algorithms using multi-layer neural networks","239392295":"A Multi-Objective Metamodel-Assisted Memetic Algorithm with Strength-based Local Refinement","238184565":"An Efficient Pareto Set Identification Approach for Multi-Objective Optimization on Black-Box Functions","216300591":"Metamodel-assisted Multiobjective Optimisation Strategies and Their Application in Airfoil Design","237384522":"Fuzzy Clustering Based Hierarchical Metamodeling for Design Optimization","232936402":"Approximation-Assisted Optimization for Novel Compact Heat Exchanger Designs","270753651":"Multi-Objective Robust Optimization Under Interval Uncertainty Using Online Approximation and Constraint Cuts","220981336":"Improving many-objective optimizers with aggregate meta-models","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","277379166":"Combining global and local approximations","226846290":"Optimal sizing, geometrical and topological design using a genetic algorithm","268580475":"Use of High- and Low-Fidelity Models In Approximations for Design Optimization","245310660":"On the use of metamodel-assisted, multi-objective evolutionary algorithms","222646520":"Low cost PSO using metamodels and inexact pre-evaluation: Application to aerodynamic shape design"},"citedIn":{},"index":512}