{"abs":"Fitness modeling has received growing interest from the evolutionary computation community in recent years. With a fitness model, one can improve evolutionary algorithm efficiency by directly sampling new solutions, developing hybrid guided evolutionary operators or using the model as a surrogate for an expensive fitness function. This paper addresses several issues on fitness modeling of discrete functions, particularly how modeling quality and efficiency can be improved. We define the Markov network fitness model in terms of Walsh functions. We explore the relationship between the Markov network fitness model and fitness in a number of discrete problems, showing how the parameters of the fitness model can identify qualitative features of the fitness function. We define the fitness prediction correlation, a metric to measure fitness modeling capability of local and global fitness models. We use this metric to investigate the effects of population size and selection on the tradeoff between model quality and complexity for the Markov network fitness model.","title":"Fitness Modeling With Markov Networks","id":261045347,"url":"https://www.researchgate.net/publication/261045347_Fitness_Modeling_With_Markov_Networks","names":["Alexander E. I. Brownlee","John Mccall","Qingfu Zhang","IEEE Transactions on Evolutionary Computation"],"references":{"225951346":"Opportunities for Expensive Optimization with Estimation of Distribution Algorithms","3421747":"Combining global and local surrogate models to accelerate evolutionary optimization. IEEE Trans Syst Man Cybern Part C Appl Rev","221007659":"Interactions and dependencies in estimation of distribution algorithms","220950816":"Singular value decomposition on GPU using CUDA","220742204":"Approximating the search distribution to the selection distribution in EDAs","201976348":"Genetic Algorithms and Walsh Functions: Part I, A Gentle Introduction","221009210":"Decreasing the Number of Evaluations in Evolutionary Algorithms by Using a Meta-model of the Fitness Function","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","220741431":"Estimation of distribution algorithms: From available implementations to potential developments","221006861":"Metamodel-Assisted Mixed Integer Evolution Strategies and Their Application to Intravascular Ultrasound Image Analysis","2361862":"BOA: The Bayesian Optimization Algorithm","226560681":"Preventing Premature Convergence in a Simple EDA Via Global Step Size Setting","235683879":"SATLIB: An online resource for research on SAT","224330099":"Approaches to Selection and their Effect on Fitness Modelling in an Estimation of Distribution Algorithm","220741381":"Addressing sampling errors and diversity loss in UMDA","225394525":"Combinations of estimation of distribution algorithms and other techniques","221304578":"Lecture Notes in Computer Science","216301009":"Estimation Distribution Algorithms: A New Tool for Evolutionary Computation","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","220741392":"Combining competent crossover and mutation operators: A probabilistic model building approach","4075014":"Simulation-based optimization of a controller for multi-car elevators using a genetic algorithm for noisy fitness Function","220742161":"Solving the MAXSAT problem using a multivariate EDA based on Markov networks","228466340":"Evolutionary computation based on Bayesian classifiers","221008151":"Exact Bayesian network learning in estimation of distribution algorithms","220233502":"Combining Bayesian classifiers and estimation of distribution algorithms for optimization in continuous domains","220741224":"Comparison Of Methods For Using Reduced Models To Speed Up Design Optimization.","220742251":"Evaluation Relaxation using Substructural Information and Linear Estimation","220375137":"Predictive Models for the Breeder Genetic Algorithm I. Continuous Parameter Optimization","223835155":"Evolutionary hidden information detection by granulation-based fitness approximation","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","37256820":"MARLEDA: effective distribution estimation through Markov random fields","221006462":"Incremental approximation of nonlinear constraint functions for evolutionary constrained optimization.","221008254":"Introducing ℓ1 -regularized logistic regression in Markov Networks based EDAs","30821765":"Genetic algorithms as function optimizers","221008760":"Using a Markov network as a surrogate fitness function in a genetic algorithm.","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","221112432":"A Markov Network Based Factorized Distribution Algorithm for Optimization","2889038":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","1956990":"Fitness Inheritance in the Bayesian Optimization Algorithm","2627148":"Evolutionary Search of Approximated N-Dimensional Landscapes","261001961":"Numerical Recipes in C—The Art of Scientific Computing","224839692":"Spatial Interaction and the Statistical Analysis of Lattice Systems","220740931":"Mining probabilistic models learned by EDAs in the optimization of multi-objective problems","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","243768296":"Bayesian optimization algorithm: From single level to hierarchy","235720062":"Approaches to Selection and their effect on Fitness Modeling in an Estimation of Distribution Algorithm","235720063":"An application of a GA with Markov network surrogate to feature selection","2532946":"Fitness Inheritance in Multi-Objective Optimization","220176742":"Model accuracy in the Bayesian optimization algorithm","2244772":"Properties of Fitness Functions and Search Landscapes","220118936":"An elitist non-dominated sorting genetic algorithm enhanced with a neural network applied to the multi-objective optimization of a polysiloxane process","220741295":"Fitness inheritance for noisy evolutionary multi-objective optimization","235720068":"The Markov Network Fitness Model","220740770":"An EDA based on local Markov property and Gibbs sampling","235720065":"Applications of Distribution Estimation Using Markov Network Modelling (DEUM)","220998589":"Fitness inheritance in genetic algorithms","266962299":"Scalable optimization via probabilistic modeling. From algorithms to applications","220381108":"Local Function Approximation in Evolutionary Algorithms for the Optimization of Costly Functions","220742590":"Estimation of fitness landscape contours in EAs","1907589":"iBOA: The Incremental Bayesian Optimization Algorithm","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","1766789":"Local search heuristics: Fitness Cloud versus Fitness Landscape","266920521":"Partial evaluation of genetic algorithms","220694402":"Markov random field modeling in Image Analysis (was: Markov random field modeling in computer vision ).","224599493":"Estimation of Distribution Algorithms Making Use of Both High Quality and Low Quality Individuals","43294524":"Multivariate Markov networks for fitness modelling in an estimation of distribution algorithm.","3810184":"Learning landscapes: regression on discrete spaces","221346441":"Using Optimal Dependency-Trees for Combinational Optimization.","227566889":"Optimal application strategies for entomopathogenic nematodes: Integrating theoretical and empirical approaches","4201722":"A study on polynomial regression and Gaussian Process global surrogate model in hierarchical surrogate-assisted evolutionary algorithm","228762649":"Convergence of Estimation of Distribution Algorithms for Finite Samples","220343454":"Learnable Evolution Model: Evolutionary Processes Guided by Machine Learning.","226682942":"Optimization by estimation of distribution with DEUM framework based on Markov random fields","224645795":"Solving the Ising Spin Glass Problem using a Bivariate EDA based on Markov Random Fields","3949566":"Optimization of noisy fitness functions by means of genetic algorithms using history of search with test of estimation","225403052":"GA-EDA: Hybrid Evolutionary Algorithm Using Genetic and Estimation of Distribution Algorithms","221024234":"Surrogate Deterministic Mutation: Preliminary Results","38092674":"Dependency Structure Matrix, Genetic Algorithms, and Effective Recombination","4307853":"Directed intervention crossover applied to bio-control scheduling","220741112":"Using a Markov network model in a univariate EDA: An empirical cost-benefit analysis","224309437":"Coevolution of Fitness Predictors","220403648":"Schemata, Distributions and Graphical Models in Evolutionary Optimization","220741326":"Does overfitting affect performance in estimation of distribution algorithms","220740814":"Use of infeasible individuals in Probabilistic Model Building Genetic Network Programming","221007300":"Incorporating a Metropolis method in a distribution estimation using Markov random field algorithm","221024196":"Markov Random Field Modelling of Royal Road Genetic Algorithms","224472200":"Using Over-sampling in a Bayesian Classifier EDA to solve Deceptive and Hierarchical Problems","224384949":"Analyzing Probabilistic Models in Hierarchical BOA","243766381":"Neural network fitness functions for a musical IGA","224646025":"Curse and Blessing of Uncertainty in Evolutionary Algorithm Using Approximation","221008583":"A fully multivariate DEUM algorithm","230770992":"The Basic Practice of Statistics","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","221007834":"Influence of selection and replacement strategies on linkage learning in BOA","3418828":"An Evolutionary Algorithm With Guided Mutation for the Maximum Clique Problem","220618974":"Evolutionary Optimization Using Graphical Models.","220743377":"Reduced computation for evolutionary optimization in noisy environment","220105952":"Research topics in discrete estimation of distribution algorithms based on factorizations"},"citedIn":{"282698478":"Metaheuristic Design Pattern: Surrogate Fitness Functions","275331838":"A Walk into Metaheuristics for Engineering Optimization: Principles, Methods and Recent Trends","275722055":"Constrained, mixed-integer and multi-objective optimisation of building designs by NSGA-II with fitness approximation","262623806":"Training and making calculations with mixed order hyper-networks"},"index":520}