{"abs":"We design a mean field and interacting particle interpretation of a class of spatial branching intensity models with spontaneous births arising in multiple-target tracking problems. In contrast to traditional Feynman-Kac type particle models, the transitions of these interacting particle systems depend on the current particle approximation of the total mass process. In the first part, we analyze the stability properties and the long time behavior of these spatial branching intensity distribution flows. We study the asymptotic behavior of total mass processes and we provide a series of weak Lipschitz type functional contraction inequalities. In the second part, we study the convergence of the mean field particle approximations of these models. Under some appropriate stability conditions on the exploration transitions, we derive uniform and non asymptotic estimates as well as a sub-gaussian concentration inequality and a functional central limit theorem. The stability analysis and the uniform estimates presented in the present article seem to be the first results of this type for this class of spatial branching models.","title":"Particle approximations of a class of branching distribution flows arising in multi-target tracking","id":41953425,"url":"https://www.researchgate.net/publication/41953425_Particle_approximations_of_a_class_of_branching_distribution_flows_arising_in_multi-target_tracking","names":["François Caron","Pierre Del Moral","Arnaud Doucet","Michele Pace"],"references":{"29607955":"On Adaptive Resampling Procedures for Sequential Monte Carlo Methods","200744518":"Sequential Monte-Carlo Methods in Practice","253682157":"A Functional Central Limit Theorem for a Class of Interacting Markov Chain Monte Carlo Models","29597157":"A Backward Particle Interpretation of Feynman-Kac Formulae","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","3003941":"Sequential Monte Carlo methods for Bayesian multi-target filtering with random finite sets","29607065":"Concentration Inequalities for Mean Field Particle Models","243768701":"The Mathematics of Data Fusion","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","3003665":"Multitarget Bayes Filtering via First-Order Multitarget Moments","2871527":"Sequential Monte Carlo Implementation of the"},"citedIn":{"233996210":"On the Concentration Properties of Interacting Particle Processes","51915982":"On the Concentration Properties of Interacting Particle Processes","258792151":"Mean-Field PHD Filters Based on Generalized Feynman-Kac Flow","228931339":"Discrete Time Markovian Agents Interacting Through a Potential"},"index":521}