{"abs":"In this paper we present a heuristic based upon genetic algorithms for the multidimensional knapsack problem. A heuristic operator which utilises problem-specific knowledge is incorporated into the standard genetic algorithm approach. Computational results show that the genetic algorithm heuristic is capable of obtaining high-quality solutions for problems of various characteristics, whilst requiring only a modest amount of computational effort. Computational results also show that the genetic algorithm heuristic gives superior quality solutions to a number of other heuristics.","title":"Beasley, J.E.: A Genetic Algorithm for the Multidimensional Knapsack Problem. Journal of Heuristics 4, 63-86","id":226952778,"url":"https://www.researchgate.net/publication/226952778_Beasley_JE_A_Genetic_Algorithm_for_the_Multidimensional_Knapsack_Problem_Journal_of_Heuristics_4_63-86","names":["P.C. Chu","John E Beasley","Journal of Heuristics"],"references":{"2591399":"Genetic Algorithms for 0/1 Multidimensional Knapsack Problems","222585280":"The noising method: A new method for combinatorial optimization","216545901":"Genetic Algorithms in Search, Optimization, and Machine Learning. Menlo Park, CA: Addison-Wesley","247257913":"Probabilistic Tabu Search for Zero-One Mixed Integer Programming Problems","220472738":"A genetic algorithm for the generalised assignment problem.","281611716":"HEURISTIC WITH TIE BREAKING FOR CERTAIN 0-1 INTEGER PROGRAMMING MODELS.","216300394":"Handbook of Evolutionary Computation","4941145":"The growth of m-constraint random knapsacks","2291767":"Local Search with Memory: Benchmarking RTS","226543125":"Local search with memory: Benchmarking RTS","263325354":"A Branch and Bound Method for the Multiconstraint Zero-One Knapsack Problem","220059782":"The growth of multi-constraint random knapsacks with large right-hand sides of the constraints","220590014":"Probabilistic Properties of the Dual Structure of the Multidimensional Knapsack Problem and Fast Statistically Efficient Algorithms,” Mathematical Programming65, 311-330","200622062":"Knapsack Problems: Algorithms and Computer Implementation","235351451":"Generalized Lagrange Method for Solving Problems of Optimum Allocation of Resources","238277548":"New Greedy-Like Heuristics for the Multidimensional 0-1 Knapsack Problem","227444654":"Heuristic 0-1 Linear Programming: An Experimental Comparison of Three Methods","239667817":"Approximation algorithms for m-dimensional 0-1 knapsack problem: Worst case and probabilistic analysis","2581382":"The Zero/One Multiple Knapsack Problem and Genetic Algorithms","243470496":"An Enumeration Algorithm for Knapsack Problems","239283430":"Efficient Heuristic Procedures for Integer Linear Programming with an Interior","227444265":"A Simplified Algorithm for Obtaining Approximate Solutions to Zero-One Programming Problems","220668939":"Tabu Search for General Zero-One Integer Programs Using the Pivot and Complement Heuristic","2605963":"An Overview of Genetic Algorithms: Part 2, Research Topics","222633192":"An efficient tabu search for the 0–1 multidimensional knapsack problem","226474449":"A Simulated Annealing Approach to the Multiconstraint Zero-One Knapsack Problem,” Computing, No. 40, pp. 1-8","226011734":"Dynamic Tabu List Management Using the Reverse Elimination Method","223041252":"Heuristics and reduction methods for multiple constraints 0–1 linear programming problems","226023753":"Efficient Algorithms for Solving Multiconstraint Zero-One Knapsack Problems to Optimality","239059853":"The Theory and Computation of Knapsack Functions","201977149":"Modem Heuristic Techniques for Combinatorial Problems","221704706":"Dueck, G.: New Optimization Heuristics: The Great Deluge Algorithm and the Record-to-Record Travel. Journal of Computational Physics 104, 86-92","2301589":"An Overview of Genetic Algorithms : Part 1, Fundamentals","221704719":"Pivot and Complement—A Heuristic for Zero-One Programming","227443381":"Discrete Dynamic Programming and Capital Allocation","265682030":"A Multiphase Dual Algorithm for the Zero-One Integer Programming Problem,” Operations Research, Vol 13, No 6, 879","215459436":"Adaptation in Natural and Artificial Systems: An Introductory Analysis With Applications to Biology, Control, and Artificial Intelligence","243770938":"Meta-Heuristics","222061441":"Solving zero-one mixed integer programming problems using tabu search","227150388":"The 0-1 bidimensional knapsack problem: Toward an efficient high-level primitive tool","239550456":"An Additive Algorithm for Solving Linear Programs With Zero-One Variables","233600046":"A Genetic Algorithm for the Generalised Assignment Problem","269008076":"Comparison of Heuristics for the 0–1 Multidimensional Knapsack Problem","220701665":"Significance of Locality and Selection Pressure in the Grand Deluge Evolutionary Algorithm.","229764470":"Tabu Search within a Pivot and Complement Framework","239649920":"Mathematical Programming and the Analysis of Capital Budgeting Problem","4871938":"A heuristic algorithm for the multidimensional zero-one knapsack problem","201976512":"Some Guidelines for Genetic Algorithms with Penalty Functions","4942085":"The growth of multi-constraint random knapsacks with various right-hand sides of the constraints","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","220867067":"A Perspective on Evolutionary Computation.","201976155":"Genetic Algorithms and Simulated Annealing: An Overview","2796408":"A Genetic Algorithm for the Set Covering Problem","229622652":"A heuristic for general integer programming","231031062":"A statistical analysis of the knapsack problem","240348295":"Threshold Accepting: A General Purpose Algorithm Appearing Superior to Simulated Annealing","266552756":"On the strength of relaxations of multidimensional knapsack problems","234840231":"An Improved Heuristic for Multidimensional 0-1 Knapsack Problems","222469785":"Scheuer, T.: Threshold accepting: A general purpose optimization algorithm appearing superior to simulated annealing. IBM Technical report 88.10.011, J. Comput. Phys. 90, 161-175","4940310":"Zero-One Programming With Many Variables and Few Constraints","227445968":"Note---An Approximate Algorithm for Multidimensional Zero-One Knapsack Problems---A Parametric Approach","220689401":"An Introduction to Genetic Algorithms. MIT Press, Cambridge","289381857":"The growth of multi-constraint random knapsacks with large right-hand sides of the constraints","229978453":"A Heuristic with Tie Breaking for Certain Integer Programming Problems","223344943":"Optimization by ghost image processes in neural networks","222188125":"A class of generalized greedy algorithms for the multi-knapsack problem","223059496":"An efficient preprocessing procedure for the multidimensional 0–1 knapsack problem","227444970":"Pivot and Complement--A Heuristic for 0-1 Programming","227443305":"An Approach to Linear Programming with 0-1 Variables","245279861":"OR-Library: Distributing Test Problems by Electronic Mail","238836311":"Methods for the Solution of the Multidimensional 0/1 Knapsack Problem","201976294":"Genetic Optimization Using A Penalty Function","243780727":"Some Experiences on Solving Multiconstraint Zero-One Knapsack Problems with Genetic Algorithms","227656672":"Heuristics in Integer Programming Using Surrogate Constraints,” Decision Sciences, Vol. 8, No. 1, January, pp. 156-166","226498801":"Constraint Handling in Genetic Algorithms: The Set Partitioning Problem","229604061":"A Heuristic Solution Procedure for the Multiconstraint Zero-One Knapsack Problem","267186584":"FORTRAN Codes for Mathematical Programming: Linear, Quadratic and Discrete","242535938":"A genetic algorithm approach for combinatorial optimisation problems","245264358":"Allocation of data bases and processors in a distributed computing system","3625419":"Cellular genetic algorithm with self-adjusting acceptance threshold","225535247":"Obtaining test problems via Internet","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","2776789":"Significance of Locality and Selection Pressure in the Grand Deluge Evolutionary Algorithm"},"citedIn":{"220741932":"Greedy, genetic, and greedy genetic algorithms for the Quadratic Knapsack Problem","232322525":"A Heuristic for the Multi-knapsack Problem","220901676":"Introducing a Binary Ant Colony Optimization","2396195":"A Hybrid Approach for the 0-1 Multidimensional Knapsack problem","273754203":"An Ant colony optimization approach for binary knapsack problem under fuzziness","226453870":"Securitization of Financial Assets: Approximation in Theory and Practice","221039934":"A General Model for Virtual Machines Resources Allocation in Multi-tier Distributed Systems","220469558":"Improved core problem based heuristics for the 0/1 multi-dimensional knapsack problem","226872735":"Metaheuristic Hybrids","220998960":"A Weight-Coded Genetic Algorithm for the Multiple Container Packing Problem","221109554":"Material Acquisitions in Academic Libraries","254637874":"Trade-off Analysis Methodology for Asset Management","11436174":"Genetic Programming over Context-Free Languages with Linear Constraints for the Knapsack Problem: First Results","228255154":"Parametric Models of Local Search Progression","242103874":"PROBE: a Metaheuristic for Hybridization Extended Abstract","222214415":"The development of a sub-population genetic algorithm II (SPGA II) for multi-objective combinatorial problems","221358336":"A Genetic Algorithm with Utilizing Lethal Chromosomes","27827610":"Extremal Optimisation with a Penalty Approach for the Multidimensional Knapsack Problem","277054640":"Optimised search heuristics: combining metaheuristics and exact methods to solve scheduling problems","270345262":"Memetic binary particle swarm optimization for discrete optimization problems","32221662":"Méthodes de résolution hybrides pour les problème de type knapsack","221309191":"Solving the Multidimensional Knapsack Problem Using an Evolutionary Algorithm Hybridized with Branch and Bound","221309195":"Combining Metaheuristics and Exact Algorithms in Combinatorial Optimization: A Survey and Classification","261428142":"Simulated attack based feature region selection for efficient digital image watermarking","220854549":"Time-Aware Test Suite Prioritization","245422751":"Ant algorithm for the multi-dimensional knapsack problem","220306718":"Solving the 0/1 knapsack problem using an adaptive genetic algorithm","220509540":"A New Heuristic for Solving the Multichoice Multidimensional Knapsack Problem.","40437290":"Contribution à la résolution du sac-à-dos à contraintes disjonctives","258396965":"Artificial Bee Colony Algorithm Merged with Pheromone Communication Mechanism for the 0-1 Multidimensional Knapsack Problem","257153814":"Countering the negative search bias of Ant Colony Optimization in subset selection problems","32227757":"An Efficient Algorithm for the Knapsack Sharing Problem","245307091":"Stochastic Optimization Model and O ( N2 ) Solution Algorithm for Highway Investment Decision Making under Budget Uncertainty","238875249":"A survey of effective heuristics and their application to a variety of knapsack problems","223326494":"An exact algorithm for the knapsack sharing problem","261054426":"Using surrogate information to solve the multidimensional multi-choice knapsack problem","270980216":"A CUDA Based Solution to the Multidimensional Knapsack Problem Using the Ant Colony Optimization","228361667":"Improvements to penalty-based evolutionary algorithms for the multi-dimensional knapsack problem using a gene-based adaptive mutation approach","283807925":"Memetic and Hybrid Evolutionary Algorithms","220739915":"Controlled Content Crossover: A New Crossover Scheme and Its Application to Optical Network Component Allocation Problem","271481933":"Computer-aided architecting of disaggregated space systems","201975907":"A Local-Search-Based Heuristic for the Demand-Constrained Multidimensional Knapsack Problem","224359728":"Statistical characterization of the dynamic narrowband body area channel","222436659":"MA|PM: Memetic algorithms with population management","249598612":"Multidimensional Knapsack Problems","245231339":"Single-plant sourcing decisions with a multidimensional knapsack model","250570385":"An Hybrid Approach for the 0-1 Multi Knapsack Problem","224608540":"A Novel Set-Based Particle Swarm Optimization Method for Discrete Optimization Problems","222413248":"Traffic engineering for MPLS-based virtual private networks","4098239":"Double-constrained optimization of optical component selection problem using genetic elitism and double string coding","242693874":"Techniques Hybrides de Propagation de Contraintes et de Programmation Mathematique","223365595":"Efficient task replication and management for adaptive fault tolerance in Mobile Grid environments","220249518":"Using the idea of expanded core for the exact solution of bi-objective multi-dimensional knapsack problems","235711107":"Hybrid Metaheuristics","222668244":"Introducing a Feasible-Infeasible Two-Population (FI-2Pop) Genetic Algorithm for Constrained Optimization: Distance Tracing and No Free Lunch","277294111":"Second Semester Mini-project Optimal Winner for Combinatorial Auctions","242097911":"ANT ALGORITHM FOR THE MULTIDIMENSIONAL KNAPSACK PROBLEM","251718553":"Squeaky Wheel Optimization On the Multidimensional Knapsack Problem","220669373":"The Multidimensional Knapsack Problem: Structure and Algorithms","221007287":"On gray-coded binary representation for supporting a (repair-by-interpolation) genetic operator for constrained Optimization Problems.","4360409":"A Socio-Cognitive Particle Swarm Optimization for Multi-Dimensional Knapsack Problem","261635844":"A Theoretical Assessment of Solution Quality in Evolutionary Algorithms for the Knapsack Problem","233904464":"A Modified Shuffled Frog Leaping Algorithm with Genetic Mutation for Combinatorial Optimization","223161834":"Lagrangean heuristics combined with reoptimization for the 0–1 bidimensional knapsack problem","226174417":"Very Large-Scale Neighborhood Search for the K-Constraint Multiple Knapsack Problem","220282251":"Achieving high and consistent rendering performance of Java AWT/Swing on multiple platforms","37245588":"Metaheuristic and Multiobjective Approaches for Space Allocation","264041232":"On the effectiveness of Genetic Algorithms for the multidimensional knapsack problem","2935966":"Introducing Distance Tracing of Evolutionary Dynamics in a Feasible-Infeasible Two-Population (FI-2Pop) Genetic Algorithm for Constrained Optimization","263091994":"A modified Intelligent Water Drops algorithm and its application to optimization problems","220471708":"L-class enumeration algorithms for a discrete production planning problem with interval resource quantities","232888671":"Application of the Cost – Risk Network method to the thermal protection system of the Space Shuttle","283989074":"Multi-class, multi-resource advance scheduling with no-shows, cancellations and overbooking","224384412":"A Global Repair Operator for Capacitated Arc Routing Problem","220740089":"The Effects of Locality on the Dynamics of Decoder-Based Evolutionary Search","241202866":"Regression Test Suite Prioritization using Genetic Algorithms","220740083":"Cheating for problem solving: A genetic algorithm with social interactions","24188333":"Multidimensional Knapsack Problem: A Fitness Landscape Analysis.","37254873":"A group theoretic approach to metaheuristic local search for partitioning problems","2545863":"An Improved Genetic Algorithm for the Multiconstrained 0-1 Knapsack Problem","242501270":"Evolutionary Computation in Combinatorial Optimization, 5th European Conference, EvoCOP 2005, Lausanne, Switzerland, March 30 - April 1, 2005, Proceedings","226719073":"Strategies for Decentralised Balancing Power","262281024":"Solving Multidimensional 0–1 Knapsack Problem with an Artificial Fish Swarm Algorithm","276487320":"Solving large-scale multidimensional knapsack problems with a new binary harmony search algorithm","220741067":"An evolutionary lagrangian method for the 0/1 multiple knapsack problem","220469708":"Solving the multidimensional knapsack problems with generalized upper bound constraints by the adaptive memory projection method","220087796":"Resource Allocation in an OFDM-Based Cognitive Radio System","4251820":"A Mini-Swarm for the Quadratic Knapsack Problem","220244430":"An Exact Algorithm for the Two-Constraint 0–1 Knapsack Problem","4871353":"Two genetic algorithms to solve a layout problem in the fashion industry","220471773":"Tight oscillations tabu search for multidimensional knapsack problems with generalized upper bound constraints","255645639":"Heuristic Approaches for Solving the Multidimensional Knapsack Problem (MKP)","268576002":"Self-adaptive Check and Repair Operator-based Particle Swarm Optimization for the Multidimensional Knapsack Problem","39436123":"Real time image segmentation using an adaptive thresholding approach","225128553":"Facets of the independent set polytope","222973000":"Improved results on the 0–1 multidimensional knapsack problem","254043686":"A Decomposition based estimation of distribution algorithm for multiobjective knapsack problems","45882303":"Spatial and temporal dynamical heterogeneities approaching the binarycolloidal glass transition","277338500":"A dual heuristic for mixed integer programming","27541677":"Facets of conflict hypergraphs","222832705":"Sampled Fictitious Play for Approximate Dynamic Programming","281911745":"A quantum-inspired artificial immune system for the multiobjective 0-1 knapsack problem","220464169":"A Two-Period Portfolio Selection Model for Asset-backed Securitization.","220741669":"A novel approach to optimize clone refactoring activity","256937542":"Solving 0-1 knapsack problems based on amoeboid organism algorithm","220841009":"Priority Encoding Scheme for Solving Permutation and Constraint Problems with Genetic Algorithms and Simulated Annealing.","284216784":"A binary particle swarm optimization based on the surrogate information with proportional acceleration coefficients for the 0-1 multidimensional knapsack problem","220275712":"www.elsevier.com/locate/parco Efficient parallel LAN/WAN algorithms for optimization. The MALLBA project","2717965":"Heuristics for Cardinality Constrained Portfolio Optimisation","37253916":"An adaptive tabu search approach to cutting and packing problems","220288005":"A theoretical and empirical investigation on the Lagrangian capacities of the 0-1 multidimensional knapsack problem","2290953":"A Competitive Genetic Algorithm for Resource-Constrained Project Scheduling","220668938":"Early Estimates of the Size of Branch-and-Bound Trees","241006450":"Speeding Up Local Search Neighborhood Evaluation for A MultiDimensional Knapsack Problem","220867610":"The Core Concept for the Multidimensional Knapsack Problem","225747012":"Problems of discrete optimization: Challenges and main approaches to solve them","251903537":"Competitive Decision Algorithm for Multidimensional Knapsack Problem","260534964":"MOEA/D-ACO: A multiobjective evolutionary algorithm using decomposition and AntColony","221024280":"Characterizing Locality in Decoder-Based EAs for the Multidimensional Knapsack Problem","223816802":"A dynamic programming based procedure for the multidimensional 0-1 knapsack problem","235407152":"Resource management in software as a service using the knapsack problem model","228365472":"From Genes to Memes: Optimization by Problem-aware Evolutionary Algorithms","227203254":"Hadamard’s Matrices, Grothendieck’s Constant, and Root Two","282453480":"An efficient improved particle swarm optimization based on prey behavior of fish schooling","220444701":"New polynomial-time instances to various knapsack-type problems","228958436":"STORM: An Approach to Database Storage Management in Data Center Environments","220358752":"Efficient allocation and composition of distributed storage","225361962":"Solving the Hard Knapsack Problems with a Binary Particle Swarm Approach","222122107":"A new polynomial time algorithm for 0–1 multiple knapsack problem based on dominant principles","4212999":"Profit oriented multichannel resource management for integrated Internet and DVB-T network","2895201":"Application of PROBE to the Multiconstraint","281413014":"A Hybrid Lagrangian Search Ant Colony Optimization Algorithm for the Multidimensional Knapsack Problem","222534677":"The two-stage recombination operator and its application to the multiobjective 0/1 knapsack problem: A comparative study","222970909":"Adaptive memory search for multidemand multidimensional knapsack problems","4036964":"On the performance of the ant colony system for solving the multidimensional knapsack problem","228939007":"A Hybrid Genetic Algorithm for the Multidimensional Knapsack Problem","234840228":"Partial enumeration in heuristics for some combinatorial optimization problems","220462200":"Theoretical insights into the augmented-neural-network approach for combinatorial optimization","2544966":"Weight-Codings in a Genetic Algorithm for the Multiconstraint Knapsack Problem","242393874":"TOP REFERENCES","27827403":"An Extended Extremal Optimisation Model for Parallel Architectures","251980386":"Crossover based on rough sets - A case of multidimensional knapsack problem","256937527":"Geometricity of genetic operators for real-coded representation","238381912":"Computer-based dietary menu planning","2489685":"Parallel Skeletons for Tabu Search Method","226498801":"Constraint Handling in Genetic Algorithms: The Set Partitioning Problem","254043730":"A genetic algorithm for the time-aware regression testing reduction problem","47715247":"NEW HEURISTICS FOR THE 0-1 MULTI-DIMENSIONAL KNAPSACK PROBLEMS","268398210":"An Integer Programming-based Local Search for Large-Scale Multidimensional Knapsack Problems","221309108":"An Evolutionary Strategy for the Multidimensional 0-1 Knapsack Problem Based on Genetic Computation of Surrogate Multipliers","220314790":"Fusing ant colony optimization with Lagrangian relaxation for the multiple-choice multidimensional knapsack problem","220701869":"Genetic Algorithms for the Multiple Container Packing Problem","242500580":"Advances in Artificial Intelligence, 14th Biennial Conference of the Canadian Society for Computational Studies of Intelligence, AI 2001, Ottawa, Canada, June 7-9, 2001, Proceedings","4184495":"A partheno-genetic algorithm for multidimensional knapsack problem","220200075":"Hybrid metaheuristics in combinatorial optimization: A survey","271946145":"Identifying redundancy in multi-dimensional knapsack constraints based on surrogate constraints","266872432":"Analyzing Test Case Selection using Proposed Hybrid Technique based on BCO and Genetic Algorithm and a Comparison with ACO","242502636":"Operations Research, Proceedings 2007, Selected Papers of the Annual International Conference of the German Operations Research Society (GOR), Saarbrücken, September 5-7, 2007","222197924":"Kernel search: A general heuristic for the multi-dimensional knapsack problem","239932371":"Golomb Rulers: the Influence of Representation and Heuristics","2437562":"A Constructive Genetic Algorithm For The Generalized Assignment Problem","220121278":"Scatter Search for the 0–1 Multidimensional Knapsack Problem","239584229":"A New heuristic approach for large size Zero-One Multi Knapsack Problem using intercept matrix","266575425":"A Genetic Algorithm to Solve the Virtual Machines Resources Allocation Problem in Multi-tier Distributed Systems","2881929":"A Tabu Algorithm for Homogeneous Partition of","242463701":"devant l\u0027Université de Picardie Jules Verne","254029452":"Analyzing Algorithms of Information Security","4095381":"Cutting analysis for MKP","271497605":"An ant colony optimization approach for solving the Multidimensional Knapsack Problem","221455489":"Savings in Combinatorial Auctions Through Transformation Relationships","258836190":"GECCO09t09fp287-lahoz-beltra","236262310":"A comparison of linkage-learning-based Genetic Algorithms in multidimensional knapsack problems","220090536":"Using rank-1 lift-and-project closures to generate cuts for 0–1 MIPs, a computational investigation","264097290":"Integer Programming-based Local Search Techniques for the Multidimensional Knapsack Problem","289055875":"工大-Physical topology optimization of infrastructure health monitoring sensor network for high-speed rail 1-s2.0-S0263224115005795-main网络下载","274601444":"Entropy-Based Optimization of Nonlinear Separable Discrete Decision Models","264310273":"On the performance of Linkage-tree Genetic Algorithms for the multidimensional knapsack problem","236095442":"A hybrid quantum inspired harmony search algorithm for 0-1 optimization problems","225180842":"A Fuzzy Valuation-Based Local Search Framework for Combinatorial Problems","258653867":"a Genetic Algorithm Based on Sexual Selection for the Multidimensional 0/1 Knapsack Problems","260710990":"Efficient Power Conservation Mechanism in Spline Function Defined WSN Terrain","6525350":"On the Hybridization of Memetic Algorithms With Branch-and-Bound Techniques","220867820":"Application of GRASP to the Multiconstraint Knapsack Problem.","220866797":"Path Tracing in Genetic Algorithms Applied to the Multiconstrained Knapsack Problem.","31044625":"Enumeration Methods for Repeatedly Solving Multidimensional Knapsack Sub-Problems","268018227":"An Interactive Genetic Algorithm Applied to the Multiobjective Knapsack Problem","270754280":"A new hybrid combinatorial genetic algorithm for multidimensional knapsack problems","236159966":"The Influence of Linkage-learning in the Linkage-Tree GA when Solving Multidimensional Knapsack Problems","262150765":"Development of an Improved Time–Frequency Analysis-Based Nonintrusive Load Monitor for Load Demand Identification","276833616":"Solving Large 0–1 Multidimensional Knapsack Problems by a New Simplified Binary Artificial Fish Swarm Algorithm","224545974":"An improved chaos genetic algorithm and its application in parameter optimization for robot control system","3412450":"A New Heuristic for Solving the Multichoice Multidimensional Knapsack Problem","3414498":"Multidimensional Knapsack Problem: A Fitness Landscape Analysis","277069147":"Weight Annealing Heuristics for Solving Bin Packing and other Combinatorial Optimization Problems: Concepts, Algorithms and Computational Results","254409457":"Scheduling online advertisements to maximize revenue under variable display frequency","220535036":"An Interactive Evolutionary Metaheuristic for Multiobjective Combinatorial Optimization","240727938":"An Extended Local Branching Framework and its Application to the Multidimensional Knapsack Problem","268750297":"An improved genetic algorithm based approach to solve constrained knapsack problem in fuzzy environment","220741879":"Improvements to penalty-based evolutionary algorithms for the multi-dimensional knapsack problem using a gene-based adaptive mutation approach","224173246":"On the Selection of Optimal Feature Region Set for Robust Digital Image Watermarking","4221349":"Hard problem generation for MKP","285215973":"Two New Reformulation Convexification Based Hierarchies for 0-1 MIPs","255642326":"OTIMIZAÇÃO POR ENXAME DE PARTÍCULAS COM EXTINÇÃO EM MASSA: UMA ABORDA- GEM APLICADA AO PROBLEMA MULTIDIMENSIONAL DA MOCHILA","223053984":"A cooperative local search-based algorithm for the Multiple-Scenario Max–Min Knapsack Problem","28076124":"Una Introducción a los Algoritmos Memeticos","238428100":"Evolutionary Algorithms in Combinatorial Optimization","220227797":"Joint robustness and security enhancement for feature-based image watermarking using invariant feature regions","253317857":"A Perturbation-Guided Oscillation Strategy for the Multidimensional Knapsack Problem with Generalized Upper Bound Constraints","220741841":"Evolution of hyperheuristics for the biobjective 0/1 knapsack problem by multiobjective genetic programming","250741515":"An Efficient Hybrid Algorithm for Nurse Rostering Problem","224646297":"Dietary Menu Planning Using an Evolutionary Method","278112617":"A Hybrid Genetic Algorithm for Constrained Combinatorial Problems: An Application to Promotion Planning Problems","220559140":"Solving the bi-objective multi-dimensional knapsack problem exploiting the concept of core","2355750":"Combinatorial Auctions, Knapsack Problems, and Hill-Climbing Search","221225769":"An Artificial Bee Colony Algorithm for the 0-1 Multidimensional Knapsack Problem","258293101":"CORAL: An exact algorithm for the Multidimensional Knapsack Problem","267267553":"A Genetic Algorithm for Searching Shortest Lattice Vector of SVP Challenge","30517186":"Contribution à la programmation en nombre entier","228541323":"On the importance of phenotypic duplicate elimination in decoder-based evolutionary algorithms","221927212":"Performance Study of Cultural Algorithms Based on Genetic Algorithm with Single and Multi Population for the MKP","241682545":"Improving a formulation of the quadratic knapsack problem","220089096":"Reduced costs propagation in an efficient implicit enumeration for the 01 multidimensional knapsack problem","33791003":"Solving strike force asset allocation problems : an application of 0/1 multidimensional knapsack problems with multiple-choice constraints /","283766516":"Cognitive discrete gravitational search algorithm for solving 0-1 knapsack problem","2545158":"Characterizing Locality in Decoder-Based EAs for the Multidimensional Knapsack Problem","46491878":"A trust branching path heuristic for zero-one programming","257790330":"Multi criteria genetic algorithm for optimal blending of coal","224645956":"The Role of Representation on the Multidimensional Knapsack Problem by means of Fitness Landscape Analysis","278648497":"Lecture Notes in Computer Science","226155344":"Hybrid Metaheuristics","223819623":"A Multi-Level Search Strategy for the 0-1 Multidimensional Knapsack Problem.","29626353":"A Reactive Local Search-Based Algorithm for the Multiple-Choice Multi-Dimensional Knapsack Problem","220285719":"Efficient task replication and management for adaptive fault tolerance in Mobile Grid environments.","229361565":"A hybrid of Nested Partition, Binary Ant System, and Linear Programming for the multidimensional knapsack problem","249832669":"Local Search and Memetic Algorithms for Knapsack Problems","220570396":"DRL*: A Hierarchy of Strong Block-Decomposable Linear Relaxations for 0-1 MIPs","220081956":"A roof linearization algorithm to obtain a tight upper bound for integer nonseparable quadratic programming","237792279":"Optimised search heuristics: a mapping of procedures and combinatorial optimisation problems","259170633":"Improved binary artificial fish swarm algorithm for the 0–1 multidimensional knapsack problems","251729213":"The genus Haplopleuroceras (Erycitidae, Ammonitina) in the Betic Cordillera, Southern Spain","273311350":"Decomposition based hybrid metaheuristics","268524095":"A branching variables rule for the B \u0026 B algorithm based on the flattnes of the polyhedron","221328241":"Scalable Grid Resource Trading with Greedy Heuristics","288434039":"Application-Specific Embedded Processors","261335518":"A SLA-compliant Cloud resource allocation framework for N-tier applications","2545270":"A Weight-Coded Genetic Algorithm for the Multiple Container Packing Problem","225244990":"Improving an exact approach for solving separable integer quadratic knapsack problems","250305715":"A Modified Binary Particle Swarm Optimization for Knapsack Problems","247577752":"Solving the 0-1 Multidimensional Knapsack Problem using Tabu Search and Visualization","220776306":"Solving the Hard Knapsack Problems with a Binary Particle Swarm Approach.","276099631":"Quantum-inspired firefly algorithm with particle swarm optimization for discrete optimization problems","226890712":"Tabu Search-Based Metaheuristic Algorithm for Large-scale Set Covering Problems","221411181":"New Hybrid Matheuristics for Solving the Multidimensional Knapsack Problem","222557987":"A Scheme for Exact Separation of Extended Cover Inequalities and Application to Multidimensional Knapsack Problems","261280227":"A genetic algorithm based approach to maximizing real-time system value under resource constraints","2644570":"A Population Heuristic for Constrained Two-Dimensional Non-Guillotine Cutting","257351970":"A novel modified binary differential evolution algorithm and its applications","258233617":"A Fuzzy Genetic Algorithm Based on Binary Encoding for Solving Multidimensional Knapsack Problems","261038585":"A fast particle swarm optimization algorithm for the multidimensional knapsack problem","271602248":"An effective hybrid harmony search-based algorithm for solving multidimensional knapsack problems","269294199":"A Comparison of Differential Evolution Algorithm with Binary and Continuous Encoding for the MKP","222565176":"Local and Global Lifted Cover Inequalities for the 0–1 Multidimensional Knapsack Problem","236340328":"Energy Efficient Allocation of Virtual Machines in Cloud Computing Environments Based on Demand Forecast","263169327":"Binary trie coding scheme: An intelligent genetic algorithm avoiding premature convergence","220743595":"Analysis of greedy heuristics and weight-coded eas for multidimensional knapsack problems and multi-unit combinatorial auctions","222989261":"The multidimensional 0–1 knapsack problem: An overview","220668832":"Combination of Metaheuristic and Exact Algorithms for Solving Set Covering-Type Optimization Problems","220312489":"A theoretical and empirical study on unbiased boundary-extended crossover for real-valued representation","221001634":"Permutation-Based Evolutionary Algorithms for Multidimensional Knapsack Problems.","7471869":"Empirical Analysis of Locality, Heritability and Heuristic Bias in Evolutionary Algorithms: A Case Study for the Multidimensional Knapsack Problem","221275042":"A Flipping Local Search Genetic Algorithm for the Multidimensional 0-1 Knapsack Problem","220701620":"Parallel Varying Mutation in Deterministic and Self-adaptive GAs","220471218":"Lagrangian relaxation and constraint generation for allocation and advanced scheduling","253036941":"A Scatter Search Method for the Bi-Criteria Multidimensional {0, 1}Knapsack Problem using Surrogate Relaxation","282071629":"A probability model based evolutionary algorithm with priori and posteriori knowledge for multiobjective knapsack problems","257588729":"Binary Accelerated Particle Swarm Algorithm (BAPSA) for discrete optimization problems","242614494":"Modelling of Hostel Space Allocation","228085554":"Hybrids Combining Local Search heuristics with Exact Algorithms","220403593":"Bringing order into the neighborhoods: Relaxation guided variable neighborhood search","280243736":"Reformulation and solution approach for non-separable integer quadratic programs","239283438":"An Introduction to Memetic Algorithms","221024152":"On the Effectivity of Evolutionary Algorithms for the Multidimensional Knapsack Problem","220472210":"Fast, effective heuristics for the 0-1 multi-dimensional knapsack problem","220470173":"Solving multidimensional knapsack problems with generalized upper bound constraints using critical event tabu search","245276707":"Une approche hybride pour le sac � dos multidimensionnel en variables 0?1","221900795":"Solving Knapsack Problems with Attribute Grammars","264941833":"Modified Choice Function Heuristic Selection for the Multidimensional Knapsack Problem","32165678":"An improved surrogate constraints method for separable nonlinear integer programming","242410679":"O.R. Applications Two genetic algorithms to solve a layout problem in the fashion industry","220589038":"Separation Algorithms for 0-1 Knapsack Polytopes","27544426":"A multi-objective stochastic approach to combinatorial technology space exploration","225345441":"An Attribute Grammar Decoder for the 01 MultiConstrained Knapsack Problem","220265457":"A New Ant Colony Optimization Applied for the Multidimensional Knapsack Problem","2668284":"An Example of Integrating Constraint Programming and Mathematical Programming","220776447":"A New Hybrid Algorithm for the Multidimensional Knapsack Problem","45894757":"Cheating for Problem Solving: A Genetic Algorithm with Social Interactions","220472260":"A new ant colony optimization algorithm for the multidimensional Knapsack problem","229055298":"On bounds available from branch-and-price decomposition of the multidimensional knapsack problem with generalized upper bound constraints","284085767":"Physical Topology Optimization of Infrastructure Health Monitoring Sensor Network for High-speed Rail","225499035":"Computer-Based Dietary Menu Planning: How to Support It by Complex Knowledge?","227215205":"A Gentle Introduction to Memetic Algorithms","221196252":"An Improved Clone Selection Optimization Algorithm Based on Prior Knowledge.","221190106":"An Artificial Intelligence Algorithm for Multi-dimensional Knapsack Problem Based on Small World Phenomenon.","266423575":"Solving the 0-1 Knapsack Problem with EDAs","224162725":"A Hybrid Evolutionary Approach to the Nurse Rostering Problem","221133783":"Brokering Algorithms for Composing Low Cost Distributed Storage Resources.","261322090":"Paralleled Genetic Algorithm for Solving the Knapsack Problem in the Cloud","235614449":"A New Hybrid Binary Particle Swarm Optimization Algorithm for Multidimensional Knapsack Problem","220867537":"Computing Surrogate Constraints for Multidimensional Knapsack Problems Using Evolution Strategies","228854616":"Evolutionary Balancing of Healthy Meals","220082146":"A Two-stage Model for a Day-ahead Paratransit Planning Problem","220215262":"An effective hybrid EDA-based algorithm for solving multidimensional knapsack problem","220742615":"Healthy daily meal planner","257432668":"Systolic neighborhood search on graphics processing units","291013212":"A New and Fast Evolutionary Algorithm for Strict Strong Graph Coloring Problem","228988576":"Neural metaheuristics for the multidimensional knapsack problem","257391710":"A novel binary fruit fly optimization algorithm for solving the multidimensional knapsack problem. Knowledge-Based Systems, 48, 17-23","222678607":"A Framework for the Description of Evolutionary Algorithms","30815962":"A Comparison of GAs Penalizing Infeasible Solutions and Repairing Infeasible Solutions on the 0-1 Knapsack Problem","244295041":"Performance Study of a Distributed Genetic Algorithm with Parallel Cooperative-Competitive Genetic Operators","291064407":"Biogeography Based Optimization for Multi-Knapsack Problems","221008419":"A hybrid model of evolutionary algorithms and branch-and-bound for combinatorial optimization problems","249600505":"A Model for Parallel Operators in Genetic Algorithms","265984192":"A Survey on the Applications of Bee Colony Optimization Techniques","225135216":"Exploring the Evolutionary Details of a Feasible-Infeasible Two-Population GA","226375258":"A new discrete electromagnetism-based meta-heuristic for solving the multidimensional knapsack problem using genetic operators","46429665":"A hybrid genetic algorithm for solving a layout problem in the fashion industry","220461574":"The Multidimensional 0-1 Knapsack Problem—Bounds and Computational Aspects","221094411":"The Core Concept for 0/1 Integer Programming","233694919":"An Adaptive Tabu Search Approach for 2-Dimensional Orthogonal Packing Problems","4035336":"Exploiting surrogate constraint analysis for fixing variables in both bounds for multidimensional knapsack problems","266680531":"Biased Random-Key Genetic Algorithms for the Winner Determination Problem in Combinatorial Auctions","3927811":"Parallel cooperative-competitive self-adaptive mutation in genetic algorithms","270647065":"Risk-Based Two-Step Optimization Model for Highway Transportation Investment Decision-Making","221009429":"A New Approach to Solving 0-1 Multiconstraint Knapsack Problems Using Attribute Grammar with Lookahead","220867088":"On the Feasibility Problem of Penalty-Based Evolutionary Algorithms for Knapsack Problems","265966816":"A Genetic Algorithm for Searching Shortest Lattice Vector of SVP Challenge","220176932":"A case study of memetic algorithms for constraint optimization","220741140":"Applying Genetic Algorithms To Finding The Optimal Gene Order In Displaying The Microarray Data.","220373534":"A Heuristic Approach for Selecting Highway Investment Alternatives","261849254":"CORAL: An Exact Algorithm for the Multidimensional Knapsack Problem","224133660":"Composing Supply Chains Through Multiunit Combinatorial Reverse Auctions With Transformability Relationships Among Goods","228580062":"The multiple container packing problem: A genetic algorithm approach with weighted codings","220940906":"STORM: An Approach to Database Storage Management in Clustered Storage Environments.","3810174":"Weight-codings in a genetic algorithm for the multi-constraint knapsack problem","242301241":"Entropy of Problem Difficulty and Improved Surrogate Constraint method for Multidimensional Nonlinear Knapsack Problems","272040828":"Solving a robotic assembly line balancing problem using efficient hybrid methods","245330386":"A mathematical model for selecting mixed models with due dates","221007485":"Using Fast Matrix Multiplication in Bio-Inspired Computation for Complex Optimization Problems","4052841":"Mathematical programming model and algorithms for production planning with considering slab matching","233782970":"Solving 0-1 knapsack problems by a discrete binary version of cuckoo search algorithm","47713679":"AN ARCHITECTURE FOR HIGH-PERFORMANCE PRIVACY-PRESERVING AND DISTRIBUTED DATA MINING","251929683":"User-Behavior based software fault detection for device","271837028":"A Genetic Algorithm to Solve the Multidimensional Knapsack Problem","220403322":"An ant colony optimization approach for the multidimensional knapsack problem","227447506":"An Approximate Dynamic Programming Approach to Multidimensional Knapsack Problems","266532028":"Variable neighborhood formulation space search for circle packing","220403325":"Alternating control tree search for knapsack/covering problems","220462657":"Cutting and Surrogate Constraint Analysis for Improved Multidimensional Knapsack Solutions","257551422":"Multiple sourcing under supplier failure risk and quantity discount: A genetic algorithm approach","4075348":"Optimal designs for microarray experiments","245331443":"Modeling multiple plant sourcing decisions","271557443":"A faster genetic algorithm to solve Knapsack problem employing fuzzy technique","29636265":"Sbihi, A.: A best first search exact algorithm for the multiple-choice multidimensional knapsack problem. J. Comb. Optim. 13(4), 337-351","43107838":"Upper Bounds for Large Scale Integer Quadratic Mulitdimensional Knapsack Problems","271076184":"A Case Study of Controlling Crossover in a Selection Hyper-heuristic Framework Using the Multidimensional Knapsack Problem","257336357":"A solution procedure for integrated supply chain planning problem in open business environment using genetic algorithm","220398167":"Workload-based generation of administrator hints for optimizing database storage utilization","222400055":"Global Optimization and Multi Knapsack : a Percolation Algorithm","237447515":"Simulated Annealing for the 0/1 Multidimensional Knapsack Problem1","220204705":"A memetic algorithm for the quadratic multiple container packing problem","220204708":"The improved adaptive link adjustment evolutionary algorithm for the multiple container packing problem","233590377":"Scheduling aircraft landings at London Heathrow using a population heuristic","226782721":"Combining (Integer) Linear Programming Techniques and Metaheuristics for Combinatorial Optimization","222555855":"An iterative variable-based fixation heuristic for the 0-1 multidimensional knapsack problem","2788263":"A \"Logic-Constrained\" Knapsack Formulation and a Tabu Algorithm for the Daily Photograph Scheduling of an Earth Observation Satellite","224342737":"Subcarrier, Bit and Power Allocation for Multiuser OFDM-Based Multi-Cell Cognitive Radio Systems","257448136":"Essential Particle Swarm Optimization queen with Tabu Search for MKP resolution","39064004":"Heuristic algorithms for the multiple-choice multidimensional knapsack problem","242500070":"Artificial Evolution, 4th European Conference, AE\u002799, Dunkerque, France, November 3-5, 1999, Selected Papers","267695201":"Memetic Algorithms","220471987":"A heuristic approach for allocation of data to RFID tags: A data allocation knapsack problem (DAKP)","225484521":"The property analysis of evolutionary algorithms applied to spanning tree problems","262407231":"Meta-RaPS approach for the 0-1 Multidimensional Knapsack Problem","228819517":"Tabu search: Global intensification using dynamic programming","35219897":"Solving single and multiple plant sourcing problems with a multidimensional knapsack model [electronic resource] /","221006472":"Solving multidimensional knapsack problems by an immune-inspired algorithm","283345739":"Pairwise independence and its impact on Estimation of Distribution Algorithms","221048453":"Feasibility Restoration for Iterative Meta-heuristics Search Algorithms","3041180":"Profit Oriented Multichannel Resource Management of Integrated Communication and Broadcast Networks","5179388":"An exact algorithm for the multiple-choice multidimensional knapsack problem","233740893":"A Genetic Algorithm for Optimization of a Relational Knapsack Problem with Respect to a Description Logic Knowledge Base","47714668":"META-RAPS: PARAMETER SETTING AND NEW APPLICATIONS","225816256":"Sensitivity of the Optimum to Perturbations of the Profit or Weight of an Item in the Binary Knapsack Problem","220470929":"Problem reduction heuristic for the 0-1 multidimensional knapsack problem","258394286":"A Memetic Lagrangian Heuristic for the 0-1 Multidimensional Knapsack Problem","225487545":"Greedy algorithm for the general multidimensional knapsack problem","284243768":"Study neighborhood field optimization algorithm on nonlinear sorptive barrier design problems","257722514":"Set-based particle swarm optimization applied to the multidimensional knapsack problem","2685945":"Population Heuristics","5070743":"Efficient Algorithms for the Knapsack Sharing Problem","51614921":"Evolvable Neuronal Paths: A Novel Basis for Information and Search in the Brain","233693747":"A multidimensional knapsack model for asset-backed securitization","227544689":"A method combining interior point methods and metaheuristics for 0-1 programming","258407559":"Hybrid Metaheuristics","258389123":"A Genetic Algorithm with Fuzzy Crossover Operator and Probability","228712014":"Una visión general de los algoritmos meméticos","221157083":"Particle Swarm Optimization for the Multidimensional Knapsack Problem","220461787":"NeuroGenetic approach for combinatorial optimization: An exploratory analysis","3949510":"Parallel varying mutation genetic algorithms","220698329":"Parallel Skeletons for Tabu Search Method Based on Search Strategies and Neighborhood Partition"},"index":527}