{"abs":"Surrogate models of fitness have been presented as a way of reducing the number of fitness evaluations required by evolutionary algorithms. This is of particular interest with expensive fitness functions where the time taken for building the model is outweighed by the savings of using fewer function evaluations. In this article, we show how a Markov network model can be used as a surrogate fitness function for a genetic algorithm in a new algorithm called Markov Fitness Model Genetic Algorithm (MFM-GA). We thoroughly investigate its application to a fitness function for feature selection in Case-Based Reasoning (CBR), using a range of standard benchmarks from the CBR community. This fitness function requires considerable computation time to evaluate and we show that using the surrogate offers a significant decrease in total run-time compared to a GA using the true fitness function. This comes at the cost of a reduction in the global best fitness found. We demonstrate that the quality of the solutions obtained by MFM-GA improves significantly with model rebuilding. Comparisons with a classic GA, a GA using fitness inheritance and a selection of filter selection methods for CBR shows that MFM-GA provides a good trade-off between fitness quality and run-time.","title":"An application of a GA with Markov network surrogate to feature selection","id":235720063,"url":"https://www.researchgate.net/publication/235720063_An_application_of_a_GA_with_Markov_network_surrogate_to_feature_selection","names":["Alexander E. I. Brownlee","Olivier Regnier-Coudert","John Mccall","Stewart Massie","Stefan Stulajter","International Journal of Systems Science"],"references":{"235308036":"Surrogate assisted local search in PMSM drive design","220118936":"An elitist non-dominated sorting genetic algorithm enhanced with a neural network applied to the multi-objective optimization of a polysiloxane process","33546870":"DEUM: A Framework for an Estimation of Distribution Algorithm based on Markov Random Fields","7841019":"Estimation of Distribution Algorithms with Kikuchi Approximations","226643087":"Estimating the distribution in an EDA","220998589":"Fitness inheritance in genetic algorithms","220265524":"A Hybrid Estimation of Distribution Algorithm for CDMA Cellular System Design.","221009210":"Decreasing the Number of Evaluations in Evolutionary Algorithms by Using a Meta-model of the Fitness Function","220742590":"Estimation of fitness landscape contours in EAs","220740275":"Do not match, inherit: fitness surrogates for genetics-based machine learning techniques.","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","220176770":"Memetic algorithm using multi-surrogates for computationally expensive optimization problems. Soft Comput","221006861":"Metamodel-Assisted Mixed Integer Evolution Strategies and Their Application to Intravascular Ultrasound Image Analysis","228057776":"Approximation Algorithms for Combinatorial Problems","227308587":"A Hybrid Estimation of Distribution Algorithm for CDMA Cellular System Design","2454668":"A Comparative Study on Feature Selection in Text Categorization","2417551":"Irrelevant Features and the Subset Selection Problem","224330099":"Approaches to Selection and their Effect on Fitness Modelling in an Estimation of Distribution Algorithm","3810184":"Learning landscapes: regression on discrete spaces","225394525":"Combinations of estimation of distribution algorithms and other techniques","222073866":"Screening important design variables for building a usability model: Genetic algorithm-based partial least-squares approach","220741392":"Combining competent crossover and mutation operators: A probabilistic model building approach","4075014":"Simulation-based optimization of a controller for multi-car elevators using a genetic algorithm for noisy fitness Function","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","220742161":"Solving the MAXSAT problem using a multivariate EDA based on Markov networks","4201722":"A study on polynomial regression and Gaussian Process global surrogate model in hierarchical surrogate-assisted evolutionary algorithm","228466340":"Evolutionary computation based on Bayesian classifiers","226682942":"Optimization by estimation of distribution with DEUM framework based on Markov random fields","220343454":"Learnable Evolution Model: Evolutionary Processes Guided by Machine Learning.","220741224":"Comparison Of Methods For Using Reduced Models To Speed Up Design Optimization.","224645795":"Solving the Ising Spin Glass Problem using a Bivariate EDA based on Markov Random Fields","224191005":"Application of evolutionary algorithms to learning evolved Bayesian Network models of rig operations in the Gulf of Mexico","221345776":"Feature Selection for High-Dimensional Data: A Fast Correlation-Based Filter Solution","3949566":"Optimization of noisy fitness functions by means of genetic algorithms using history of search with test of estimation","220742251":"Evaluation Relaxation using Substructural Information and Linear Estimation","225403052":"GA-EDA: Hybrid Evolutionary Algorithm Using Genetic and Estimation of Distribution Algorithms","223835155":"Evolutionary hidden information detection by granulation-based fitness approximation","41529789":"Optimisation and Fitness Modelling of Bio-control in Mushroom Farming Using a Markov Network EDA","220831596":"Feature Selection and Generalisation for Retrieval of Textual Cases","221024234":"Surrogate Deterministic Mutation: Preliminary Results","224645797":"Iterated Local Search with Guided Mutation","251162416":"Surrogate Model-Based Differential Evolution","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","221006311":"Structure Learning and Optimisation in a Markov-network based Estimation of Distribution Algorithm","2608247":"Fitness Distance Correlation as a Measure of Problem Difficulty for Genetic Algorithms","30821765":"Genetic algorithms as function optimizers","221345378":"Filters, Wrappers and a Boosting-Based Hybrid for Feature Selection.","220742268":"An application of a multivariate estimation of distribution algorithm to cancer chemotherapy","221008760":"Using a Markov network as a surrogate fitness function in a genetic algorithm.","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","220219127":"A study of mutual information based feature selection for case based reasoning in software cost estimation","220741745":"An application of EDA and GA to dynamic pricing","216300862":"Fitness Distance Correlation as a Measure of Problem Difficulty for Genetic Algorithms","221112432":"A Markov Network Based Factorized Distribution Algorithm for Optimization","2889038":"Surrogate-Assisted Evolutionary Optimization Frameworks for High-Fidelity Engineering Design Problems","224309437":"Coevolution of Fitness Predictors","1956990":"Fitness Inheritance in the Bayesian Optimization Algorithm","267464850":"Towards a New Evolutionary Computation: Advances on Estimation of Distribution Algorithms","221007300":"Incorporating a Metropolis method in a distribution estimation using Markov random field algorithm","228756682":"Hybrid estimation of distribution algorithm for global optimization","224472200":"Using Over-sampling in a Bayesian Classifier EDA to solve Deceptive and Hierarchical Problems","221008583":"A fully multivariate DEUM algorithm","223713209":"Wrappers for Feature Subset Selection","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","235720062":"Approaches to Selection and their effect on Fitness Modeling in an Estimation of Distribution Algorithm","2532946":"Fitness Inheritance in Multi-Objective Optimization","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","242706958":"Spatial interaction and statistical analysis of lattice systems","34201459":"Stochastic Local Search-Foundations and Applications","220702173":"Optimization of Noisy Fitness Functions by Means of Genetic Algorithms Using History of Search","220344030":"Gene Selection for Cancer Classification Using Support Vector Machines"},"citedIn":{"271665795":"Optimal Kullback–Leibler approximation of Markov chains via nuclear norm regularisation","271933181":"An efficient optimum Latin hypercube sampling technique based on sequencing optimisation using simulated annealing","275722055":"Constrained, mixed-integer and multi-objective optimisation of building designs by NSGA-II with fitness approximation","261045347":"Fitness Modeling With Markov Networks","284244030":"Dimensionality Reduction in Complex Medical Data: Improved Self-Adaptive Niche Genetic Algorithm"},"index":532}