{"abs":"The bodies of fish change shape over propulsive, behavioral, developmental, and evolutionary time scales, a general phenomenon that we call \"reconfiguration\". Undulatory, postural, and form-reconfiguration can be distinguished, studied independently, and examined in terms of mechanical interactions and evolutionary importance. Using a combination of live, swimming fishes and digital robotic fish that are autonomous and self-propelled, we examined the functional relation between undulatory and postural reconfiguration in forward swimming, backward swimming, and yaw turning. To probe how postural and form reconfiguration interact, the yaw turning of leopard sharks was examined using morphometric and kinematic analyses. To test how undulatory reconfiguration might evolve, the digital robotic fish were subjected to selection for enhanced performance in a simulated ecology in which each individual had to detect and move towards a food source. In addition to the general issue of reconfiguration, these investigations are united by the fact that the dynamics of undulatory and postural reconfigurations are predicted to be determined, in part, by the structural stiffness of the fish\u0027s body. Our method defines undulatory reconfiguration as the combined, point-by-point periodic motion of the body, leaving postural reconfiguration as the combined deviations from undulatory reconfiguration. While undulatory reconfiguration appears to be the sole or primary propulsive driver, postural reconfiguration may contribute to propulsion in hagfish and it is correlated with differences in forward, and backward, swimming in lamprey. Form reconfigures over developmental time in leopard sharks in a manner that is consistent with an allometric scaling theory in which structural stiffness of the body is held constant. However, correlation of a form proxy for structural stiffness of the body suggests that body stiffness may scale in order to limit maximum postural reconfiguration during routine yaw turns. When structural stiffness and undulatory frequency are modeled as determining the tail\u0027s undulatory wave speed, both factors evolve under selection for enhanced foraging behavior in the digital fish-like robots. The methods used in making these distinctions between kinds of reconfiguration have broad applicability in fish biology, especially for quantifying complex motor behaviors in the wild and for simulating selection on behavior that leads to directional evolution of functional phenotypes.","title":"Go Reconfigure: How Fish Change Shape as They Swim and Evolve","id":51113361,"url":"https://www.researchgate.net/publication/51113361_Go_Reconfigure_How_Fish_Change_Shape_as_They_Swim_and_Evolve","names":["John H Long, Jr","Marianne E Porter","Robert G Root","Chun Wai Liew","Integrative and Comparative Biology"],"references":{"24045359":"Turning maneuvers in Sharks: Predicting body curvature from axial morphology","7417872":"Maneuvering in juvenile carcharhinid and sphyrnid sharks: The role of the hammerhead shark cephalofoil","221001480":"Using a genetic algorithm to optimize the gape of a snake jaw","11035404":"The notochord of hagfish Myxine glutinosa: Visco-elasic properties and mechanical functions during steady swimming","216756204":"Note on the swimming of slender fish. J Fluid Mech 9:305-317","221438997":"Exploration or Convergence? Another Meta-Control Mechanism for GAs.","11282788":"Evolution of behavior and neural control of the fast-start escape response","253543829":"Flapping flexible fish. Periodic and secular body reconfigurations in swimming lamprey, Petromyzon marinus","3232030":"A Navigational Primitive: Biorobotic Implementation of Cycloptic Helical Klinotaxis in Planar Motion","13499490":"Mechanics of the fast-start: muscle function and the role of intramuscular pressure in the escape behavior of Amia calva and Polypterus palmas. J Exper Bio","10987255":"Force transmission via axial tendons in undulating fish: A dynamic analysis","248563620":"Stability and Maneuverability","224453045":"Biomimetic evolutionary analysis: Robotically-simulated vertebrates in a predator-prey ecology","31126479":"Simple Physical Principles and Vertebrate Aquatic Locomotion","12165710":"The Mauthner cell and other identified neurons of the brainstem escape network of fish","222501755":"A genetic algorithm for continuous design space search","6684253":"Biomimetic evolutionary analysis: Testing the adaptive value of vertebrate tail stiffness in autonomous swimming robots","227108724":"Morphology, mechanics, and locomotion: the relation between the notochord and swimming speed in sturgeon"},"citedIn":{"259517878":"Computational and Mathematical Modeling of the Effects of Tailbeat Frequency and Flexural Stiffness in Swimming Fish","259517877":"Axial systems and their actuation: New twists on the ancient body of craniates","259518386":"Jumping sans legs: Does elastic energy storage by the vertebral column power terrestrial jumps in bony fishes?","224252443":"Swimming speed control and on-board flow sensing of an artificial trout","233555843":"Robotic Models for Studying Undulatory Locomotion in Fishes","51872349":"A robotic fish caudal fin: Effects of stiffness and motor program on locomotor performance","225056165":"Ophiuroid robot that self-organizes periodic and non-periodic arm movements","276385160":"Diverse anguilliform swimming kinematics in Pacific hagfish ( Eptatretus stoutii ) and Atlantic hagfish ( Myxine glutinosa )","271457114":"A Flexible Fin with Bio-Inspired Stiffness Profile and Geometry","268445943":"Testing Biological Hypotheses with Embodied Robots: Adaptations, Accidents, and By-Products in the Evolution of Vertebrates","224658556":"Active radiating element using FET source integrated with a multilayer slot coupled patch antenna","233669172":"Inspired by Sharks: A Biomimetic Skeleton for the Flapping, Propulsive Tail of an Aquatic Robot","237093243":"A revised metric for quantifying body shape in vertebrates","51701999":"Swimming fundamentals: Turning performance of leopard sharks (Triakis semifasciata) is predicted by body shape and postural reconfiguration"},"index":534}