{"abs":"An important issue in multiobjective optimization is the quantitative comparison of the performance of different algorithms. In the case of multiobjective evolutionary algorithms, the outcome is usually an approximation of the Pareto-optimal set, which is denoted as an approximation set, and therefore the question arises of how to evaluate the quality of approximation sets. Most popular are methods that assign each approximation set a vector of real numbers that reflect different aspects of the quality. Sometimes, pairs of approximation sets are also considered. In this study, we provide a rigorous analysis of the limitations underlying this type of quality assessment. To this end, a mathematical framework is developed which allows one to classify and discuss existing techniques.","title":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","id":3418737,"url":"https://www.researchgate.net/publication/3418737_Performance_Assessment_of_Multiobjective_Optimizers_An_Analysis_and_Review","names":["Eckart Zitzler","Lothar Thiele","Marco Laumanns","C.M. Fonseca","Viviane Grunert da Fonseca","IEEE Transactions on Evolutionary Computation"],"references":{"3865145":"On measuring multiobjective evolutionary algorithm performance","35290207":"Fault tolerant design using single and multicriteria genetic algorithm optimization /","235709769":"Evaluating the quality of approximation to the non-dominated set","3642225":"Design space exploration using the genetic algorithm","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","2377646":"Evolutionary Algorithms for Multiobjective Optimization","243773771":"Multiobjective Evolutionary Algorithms: Classi cations","2642725":"Evaluating the Quality of Approximations to the Non-Dominated Set","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","228709937":"Introduction to Set Theory","221220222":"Approximating Multi-objective Knapsack Problems","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","235199377":"Fault Tolerant Design Using Single and Multicriteria Genetic Algorithm Optimization","3949545":"On metrics for comparing nondominated sets","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2441340":"On the Assessment of Multiobjective Approaches to the Adaptive Distributed Database Management Problem","2239800":"On Measuring Multiobjective Evolutionary Algorithm Performance","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","229881453":"MOSA Method: A Tool for Solving Multiobjective Combinatorial Optimization Problems, ” Journal of Multi Criteria Decision Analysis 8, pp. 221-236","2584888":"An Evolutionary Algorithm for Multiobjective Optimization: The Strength Pareto Approach","220637959":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons.","235709741":"Lecture Notes in Computer Science","216300934":"On metrics for comparing non-dominated sets","227273705":"Sayin, S.: Measuring the quality of discrete representation of efficient sets in multiple objective mathematical programming. Math. Program. 87 A, 543-560","2830223":"Inferential Performance Assessment of Stochastic Optimisers and the Attainment Function","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","225035791":"Introduction to Set Theory, 3rd Edition","246816017":"Metrics for Quality Assessment of a Multiobjective Design Optimization Solution Set","201977070":"On the Assessment of Multiobjective Approaches to the Adaptive Distributed Database Management Problem","229763167":"Heuristic Estimation of the Efficient Frontier for a Bi‐Criteria Scheduling Problem","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","201977075":"On the Assessment of Multiobjective Approaches to the Adaptive Distributed Management Problem","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","229707789":"Pareto simulated annealing- A metaheuristic technique for multiple-objective combinatorial optimization","216457304":"Lecture Notes in Computer Science","220701912":"Running Time Analysis of Multi-objective Evolutionary Algorithms on a Simple Discrete Optimization Problem"},"citedIn":{"221007148":"Model-Building Algorithms for Multiobjective EDAs: Directions for Improvement","270790690":"A Comparative Study on Multiobjective Swarm Intelligence for the Routing and Wavelength Assignment Problem","261431187":"Transgenetic algorithm for the biobjective oil derivatives distribution problem","258649964":"An Efficient Conical Area Evolutionary Algorithm for Bi-objective Optimization","280076471":"Evaluation of a Multi-Objective EA on Benchmark Instances for Dynamic Routing of a Vehicle","251389682":"Pareto Evolutionary Algorithm Hybridized with Local Search for Biobjective TSP","220249385":"Convergence of Stochastic Search Algorithms to Finite Size Pareto Set Approximations","260622209":"Genetic Training Instance Selection in Multiobjective Evolutionary Fuzzy Systems: A Coevolutionary Approach","4251722":"Fuzzy Optimization with Multi-Objective Evolutionary Algorithms: a Case Study","224347477":"Multi-objective order planning model and algorithm for integrated steel production","224333141":"A Jumping Genes Paradigm: Theory, Verification and Applications","236215839":"Hybrid Multi-Attribute QoS Optimization in Component Based Software Systems","255704886":"A surrogate-based multiobjective metaheuristic and network degradation simulation model for robust toll pricing","24373629":"Evaluation of Genetic Algorithm Concepts Using Model Problems","259868531":"A new performance metric for user-preference based multi-objective evolutionary algorithms","288827687":"Multiobjective evolutionary algorithm based on multimethod with dynamic resources allocation","221007160":"Variable interactions and exploring parameter space in an expensive optimisation problem: Optimising Short Term Conflict Alert","220105995":"Hybrid immune algorithm with Lamarckian local search for multi-objective optimization","221146427":"PerOpteryx: automated application of tactics in multi-objective software architecture optimization","274706503":"An Evolutionary Approach with Surrogate Models and Network Science Concepts to Design Optical Networks","221007159":"An improved multiobjective memetic algorithm for permutation flow shop scheduling.","265209813":"Faster Computation of Expected Hypervolume Improvement","220755252":"An experimental study of the Multi-objective Go with the Winners Algorithm on the biobjective QAP with correlated flow matrices","220702008":"SPAM: Set Preference Algorithm for Multiobjective Optimization","236480059":"Designing multi-objective multi-armed bandits algorithms: A study","26980792":"Explorando abordagens inovadoras para geração de classificadores","237510155":"Designing ART-based Classifiers through Multi-Objective Memetic Evolution","260755369":"A dimensionality reduction approach for many-objective Markov Decision Processes: Application to a water reservoir operation problem","209607770":"Metaheuristic algorithms for multi-objective scheduling problems","283547843":"Multiobjective Synthesis of Steerable UWB Circular Antenna Array considering Energy Patterns","3225625":"A multiobjective genetic approach for system-level exploration in parameterized systems-on-a-chip","223696253":"Multi-objectives Tabu Search based algorithm for progressive resource allocation","287406344":"Modified Distance Calculation in Generational Distance and Inverted Generational Distance","3418142":"Multiobjective Evolutionary Optimization of DNA Sequences for Reliable DNA Computing","3225626":"On effective slack management in postscheduling phase","261711797":"2014 - JMCDA - A Bi-Objective Inventory Routing Problem for Sustainable Waste Management Under Uncertainty","220669195":"A review and evaluation of multi-objective algorithms for the flowshop scheduling problem. INFORMS J Comput","220462355":"Solution methods for the bi-objective (cost-coverage) unconstrained facility location problem with an illustrative example","270899223":"Annnealing-Pareto","274708587":"Un Nuevo Algoritmo Evolutivo en Programación Multiobjetivo para Aproximar el Frente Óptimo de Pareto","220200234":"Feature-based classifier ensembles for diagnosing multiple faults in rotating machinery","220058920":"Metaheuristics for the bi-objective orienteering problem. Swarm Intell","225348952":"Meta-heuristics for System Design Engineering","220701968":"Are All Objectives Necessary? On Dimensionality Reduction in Evolutionary Multiobjective Optimization","263126933":"Multi-objective Reinforcement Learning with Continuous Pareto Frontier Approximation","29647359":"Efficient Multiobjective Synthesis of Analog Circuits using Hierarchical Pareto-Optimal Performance Hypersurfaces","221469967":"Integration Test of Classes and Aspects with a Multi-Evolutionary and Coupling-Based Approach","256276346":"An overview of population-based algorithms for multi-objective optimisation","221175059":"A Novel Weight Design in Multi-objective Evolutionary Algorithm","260585398":"Robust Scheduling of Task Graphs under Execution Time Uncertainty","221228399":"OCD: Online Convergence Detection for Evolutionary Multi-Objective Algorithms Based on Statistical Testing","261375954":"Multi-objective Design of Survivable Flexible-Grid DWDM Networks","278716628":"Sustainable performance oriented operational decision-making of single machine systems with deterministic product arrival time","221228390":"Lecture Notes in Computer Science","220310891":"Design of mixed H","258817830":"Mutual Information for Performance Assessment of Multi Objective Optimisers: Preliminary Results","221228387":"Exploring the Performance of Stochastic Multiobjective Optimisers with the Second-Order Attainment Function","220753253":"Remote sensing image fusion based on multi-objective evolutionary algorithm","228451794":"Dimensionality reduction in multiobjective optimization with (partial) dominance structure preservation: Generalized minimum objective subset problems","221228415":"Lecture Notes in Computer Science","221007230":"Generalized immigration schemes for dynamic evolutionary multiobjective optimization","220753275":"Towards accuracy-adaptive simulation for efficient design-space optimization","4089962":"Performance evaluation of simple multiobjective genetic local search algorithms on multiobjective 0/1 knapsack problems","221416807":"Ant Colony VS. Genetic Multiobjective Route Planning in Dynamic Multi-hop Ridesharing","221228406":"Multiobjective Optimization on a Budget of 250 Evaluations","220702076":"A Multiobjective Differential Evolution Based on Decomposition for Multiobjective Optimization with Variable Linkages","222262627":"Environmental/Economic power dispatch problem using multi-objective differential evolution algorithm","274720771":"A new exact method and matheuristics for bi-objective 0/1 ILPs: Application to FTTx-network design","261054418":"Evenly spaced Pareto fronts of quad-objective problems using PSA partitioning technique","261054417":"Application of the multi-objective Alliance Algorithm to a benchmark aerodynamic optimization problem","224150786":"A Computer Engineering Benchmark Application for Multiobjective Optimizers","283551928":"Indicator-Based Selection","224197891":"Optimization of Josephson Junction Comparators in Terms of Speed and Accuracy","235705964":"Not Going to Take this Anymore: Multi-Objective Overtime Planning for Software Engineering Projects","228892100":"Applying Memetic Algorithm in Multi-Objective Resource Allocation among Competing Projects","221007182":"A hybrid constraint handling mechanism with differential evolution for constrained multiobjective optimization","281823407":"Multi-objective analysis of computational models","262830025":"A memetic algorithm for multi-objective resource allocation problems","50842467":"Set-based Multiobjective Fitness Landscapes: A Preliminary Study","227702263":"Evolutionary multiobjective optimization","46305962":"A hierarchical approach to model parameter optimization for developmental systems","262293450":"MOEA/D assisted by RBF networks for expensive multi-objective optimization problems","267028354":"The multi-objective hybridization of particle swarm optimization and fuzzy ant colony optimization","274094141":"Averaged Hausdorff Approximations of Pareto Fronts based on Multiobjective Estimation of Distribution Algorithms","4251694":"Use of the WFG toolkit and PISA for comparison of MOEAs","220081520":"A genetic algorithms to solve the bicriteria shortest path problem","226333967":"Objective Space Partitioning Using Conflict Information for Many-Objective Optimization","283449494":"A mapping technique for better solution exploration: NSGA-II adaptation","233971078":"DDMOA: Descent Directions based Multiobjective Algorithm","1765486":"Stochastic convergence of random search to fixed size Pareto set\napproximations","221228378":"Optimizing the DFCN Broadcast Protocol with a Parallel Cooperative Strategy of Multi-Objective Evolutionary Algorithms","288932175":"Adaptive Composite Operator Selection and Parameter Control for Multiobjective Evolutionary Algorithm","241554973":"Multi-Objective Hybrid Evolutionary Optimization with Automatic Switching Among Constituent Algorithms","226719225":"Pareto Cone ε-Dominance: Improving Convergence and Diversity in Multiobjective Evolutionary Algorithms","233971080":"A New Hybrid Evolutionary Multiobjective Algorithm Guided by Descent Directions","235976338":"Multi-Objective Evolutionary Algorithm with Node-Depth Encoding and Strength Pareto for Service Restoration in Large-Scale Distribution Systems","221228457":"Noisy Multiobjective Optimization on a Budget of 250 Evaluations","282540113":"Parameter Estimation for Coupled Hydromechanical Simulation of Dynamic Compaction Based on Pareto Multiobjective Optimization","257896408":"Multi-objective process parameter optimization for energy saving in injection molding process","254230446":"Transient responses’ optimization by means of set-based multi-objective evolution","258521060":"Scalability Analysis of the Asynchronous, Master-Slave Borg Multiobjective Evolutionary Algorithm","221228450":"A New Analysis of the LebMeasure Algorithm for Calculating Hypervolume","220741031":"On the possibility to create a compatible--complete unary comparison method for evolutionary multiobjective algorithms.","221228478":"Adaptive Objective Space Partitioning Using Conflict Information for Many-Objective Optimization.","224316877":"Scheduling Strategies for the Bicriteria Optimization of the Robustness and Makespan","224198088":"Evolutionary algorithms for multi-objective optimization problems with interval parameters","257722312":"An experimental analysis of design choices of multi-objective ant colony optimization algorithms","276369644":"Using an outward selective pressure for improving the search quality of the MOEA/D algorithm","282538061":"An experimental analysis of a new two-stage crossover operator for multiobjective optimization","278661121":"Complexity Theories of Cities Have Come of Age","278724611":"Measuring Performance of Algorithms in Dynamic Environement","260529944":"Variable and large neighborhood search to solve the multiobjective set covering problem","284041329":"Statistical Analysis of a Multi-objective Optimization Algorithm Based on a Model of Particles With Vorticity Behavior","216300612":"Many-Objective Optimization: An Engineering Design Perspective","225158601":"On local optima in multiobjective combinatorial optimization problems","232615289":"A Survey of Performance Assessment for Multiobjective Optimizers","227136812":"A Convergence Acceleration Technique for Multiobjective Optimisation","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","282534000":"A bi-objective home care scheduling problem: Analyzing the trade-off between costs and client inconvenience","227204386":"An algorithm for the capacitated vehicle routing problem with route balancing","260585248":"Machine learning predictive modelling high-level synthesis design space exploration","220702093":"Convergence Rates of (1+1) Evolutionary Multiobjective Optimization Algorithms","50389932":"Outils et algorithmes pour gérer l\u0027incertitude lors de l\u0027ordonnancement d\u0027application sur plateformes distribuées","260622137":"Using the Averaged Hausdorff Distance as a Performance Measure in Evolutionary Multiobjective Optimization","291013100":"VL-PLS: A Multi-objective Variable Length Pareto Local Search to Solve the Node Placement Problem for Next Generation Network","221044122":"Large-Dimensional Multi-Objective Evolutionary Algorithms Based on Improved Average Ranking","226755891":"An Adaptive Penalty Function for Handling Constraint in Multi-objective Evolutionary Optimization","260622128":"On Gradients and Hybrid Evolutionary Algorithms for Real-Valued Multiobjective Optimization","43188782":"Algoritmos evolutivos y preferencia del decisor aplicados a problemas de optimización multiobjetivos discretos","265799530":"TOWARDS ENHANCING SOLUTION SPACE DIVERSITY IN MULTI-OBJECTIVE OPTIMIZATION: A HYPERVOLUME-BASED APPROACH","43188780":"On uncertainty and robustness in evolutionary optimization-based multicriterio decision-making","4090111":"A multi-objective GA-Simplex hybrid approach for gene regulatory network models","221228526":"Effects of Removing Overlapping Solutions on the Performance of the NSGA-II Algorithm","267669302":"Success in evolutionary computation","226428349":"Exact hybrid algorithms for solving a bi-objective vehicle routing problem","281884686":"Metaheuristics for the Multi-Objective Dial-a-Ride Problem","261715802":"Multi-objective evolutionary algorithms for the design of grid-connected solar tracking systems","220343783":"Empirical evaluation methods for multiobjective reinforcement learning algorithms","228947296":"Enhancing A Multiobjective Evolutionary Algorithm Through Flexible Evolution","226215358":"An Evolutionary Algorithm for the Biobjective QAP","257642396":"On the Biobjective Adjacent Only Quadratic Spanning Tree Problem","221228519":"On Gradient Based Local Search Methods in Unconstrained Evolutionary Multi-objective Optimization","260622144":"Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering","262686560":"A Clustering Based Multiobjective Evolutionary Algorithm","221416955":"PHC-NSGA-II: A novel multi-objective memetic algorithm for continuous optimization","265635612":"Clustering-Based Selection for Evolutionary Many-Objective Optimization","282365982":"Evaluating a Multi-Objective Hyper-Heuristic for the Integration and Test Order Problem","221007335":"MOEA/D-AMS: Improving MOEA/D by an adaptive mating selection mechanism","221007328":"Hybridizing PSO and DE for improved vector evaluated multi-objective optimization","223833499":"Optimal expansion of an existing electrical power transmission network by multi-objective genetic algorithms","280940659":"A Multi-Objective Evolutionary Algorithm-based Decision Support System: A Case Study on Job-Shop Scheduling in Manufacturing","228345169":"Stochastic Local Search Algorithms for Multiobjective Combinatorial Optimization","221228513":"The Multiple Multi Objective Problem – Definition, Solution and Evaluation","221414908":"A Decomposition-based Multi-objective Particle Swarm Optimization Algorithm for Continuous Optimization Problems","224202131":"A dynamic continuous descent approach methodology for low noise and emission","260622151":"The Automatic Design of Multiobjective Ant Colony Optimization Algorithms","257673108":"A Novel Multi-Objective Shuffled Complex Differential Evolution Algorithm with Application to Hydrological Model Parameter Optimization","262365042":"A hybrid genetic approach for multi-objective and multi-platform large volume surveillance problem","258625470":"Assessing the value of cooperation and information exchange in large water resources systems by agent-based optimization","220935678":"Solving Rotated Multi-objective Optimization Problems Using Differential Evolution","228343113":"Improving Automatic Design Space Exploration by Integrating Symbolic Techniques into Multi-Objective Evolutionary Algorithms","221228538":"On Sequential Online Archiving of Objective Vectors","221228535":"Online Objective Reduction to Deal with Many-Objective Problems","241170055":"A novel self-organizing quantum evolutionary algorithm for multi-objective optimization","221228534":"Recombination of Similar Parents in EMO Algorithms","251043375":"A Normal Distribution Crossover for ε-MOEA: A Normal Distribution Crossover for ε-MOEA","225580459":"Job scheduling with forbidden setups and two objectives using genetic algorithms and penalties","266475323":"Evolutionary algorithms and other metaheuristics in water resources: Current status, research challenges and future directions","272388326":"Three-dimension Test Wrapper Design based on Multi-objective Cuckoo Search","220773875":"Intelligent Multiobjective Particle Swarm Optimization Based on AER Model","225674670":"Multiobjective evolutionary algorithms for complex portfolio optimization problems","241770164":"Local Preference-inspired Co-evolutionary Algorithms","261343090":"A direct local search mechanism for decomposition-based multi-objective evolutionary algorithms","266635014":"Handling Geological Uncertainty in Oil Field Development with Multi-objective Optimization Technique","221228493":"Multiobjective Evolutionary Algorithms on Complex Networks","226800994":"A new multiobjective simulated annealing algorithm","290496951":"Modelling beneficiaries’ choice in disaster relief logistics","260134761":"Consistencies or Contradictions of Performance Metrics in Multiobjective Optimization?","264709932":"Physical programming for preference driven evolutionary multi-objective optimization","284018694":"An improved multi-objective evolutionary algorithm for simultaneously detecting separated and overlapping communities","277139562":"Expected Hypervolume Improvement Algorithm for PID Controller Tuning and the Multiobjective Dynamical Control of a Biogas Plant","221228480":"Initial Population Construction for Convergence Improvement of MOEAs.","220702165":"Multiobjective Optimization on a Limited Budget of Evaluations Using Model-Assisted $\\mathcal{S}$ -Metric Selection","261369702":"Pareto Front Estimation for Decision Making","271952070":"Multi-objective variable neighborhood search: an application to combinatorial optimization problems","225797507":"Genetic Algorithm Applications in Surveillance and Maintenance Optimization","263423813":"A comparison of NSGA-II, DEMO, and EM-MOPSO for the multi-objective design of concentric rings antenna arrays","261054322":"R2-IBEA: R2 indicator based evolutionary algorithm for multiobjective optimization","221009362":"Multi-objective Genetic Programming for Improving the Performance of TCP.","222889399":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications","4253887":"Evolutionary Multiobjective Design of Fuzzy Rule-Based Systems","267632371":"Pareto Upper Confidence Bounds algorithms: an empirical study","271964468":"An Improved Multiobjective Optimization Evolutionary Algorithm Based on Decomposition for Complex Pareto Fronts","254043686":"A Decomposition based estimation of distribution algorithm for multiobjective knapsack problems","224207966":"Diversity Management in Evolutionary Many-Objective Optimization","221103143":"D: On the comparison of microdata disclosure control algorithms","270723368":"A New Local Search-Based Multiobjective Optimization Algorithm","29470922":"Using XMPP for ad-hoc grid computing - An application example using parallel ant colony optimisation","282540505":"A Triobjective Model for Locating a Public Semiobnoxious Facility in the Plane","224261202":"Iteration-Based Trade-Off Analysis of Resource-Aware SDF","221006911":"Online convergence detection for evolutionary multi-objective algorithms revisited","224246859":"A performance comparison of multi-objective optimization evolutionary algorithms for all-optical networks design","289460312":"Multi-objective Optimisation Using Evolutionary Algorithms: An Introduction","46572508":"Aproximações arbitrárias de módulo e fase na modelagem de sistemas lineares invariantes ao deslocamento com técnicas de otimização \u0027Soft-Computing\u0027","249970684":"A Multiobjective Memetic Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","220740660":"Embedded evolutionary multi-objective optimization for worst case robustness","261342863":"A Multi-Objective Evolutionary approach for linear antenna array design and synthesis","221230129":"A summary-attainment-surface plotting method for visualizing the performance of stochastic multiobjective optimizers","236683012":"Quality Measures of Parameter Tuning for Aggregated Multi-Objective Temporal Planning","257635963":"A decomposition-based hybrid multiobjective evolutionary algorithm with dynamic resource allocation","257705598":"Handling multiple objectives with biogeography-based optimization","282536436":"An Evolutionary Algorithm for Multiobjective Fuzzy Portfolio Selection Models with Transaction Cost and Liquidity","260083364":"Flexible Management of Transportation Networks under Uncertainty","242655059":"Multi-objectivization of short-term unit commitment under uncertainty using evolutionary algorithm","257242736":"Variable neighborhood search for multi-objective resource allocation problems","224472135":"Assessing the quality of the relation between scalarizing function parameters and solutions in multiobjective optimization","264673006":"Evolutionary many-objective optimization by MO-NSGA-II with enhanced mating selection","262327944":"On Beam Search for Multicriteria Combinatorial Optimization Problems","226165840":"Evolutionary Algorithms for the Multi Criterion Minimum Spanning Tree Problem","220650506":"An evolutionary algorithm for multicriteria path optimization problems","215473659":"Solving a Bi-Objective Winner Determination Problem in a Transportation Procurement Auction","238720778":"Applications of Computational Intelligence in Biology: Current Trends and Open Problems","221760519":"Using Evolutionary Algorithms for Fitting High-Dimensional Models to Neuronal Data","261764778":"Multiobjective memetic algorithm based on decomposition","251815475":"Applications of laser-plasma electron accelerators:point-scanning radiotherapy and high resolution radiography of dense objects","259982925":"Pareto archived dynamically dimensioned search with hypervolume-based selection for multi-objective optimization","224146542":"Decision-Theoretic Design Space Exploration of Multiprocessor Platforms","220742682":"Accelerating convergence using rough sets theory for multi-objective optimization problems.","268070601":"Theory and practice of natural computing. Second international conference, TPNC 2013, Cáceres, Spain, December 3–5, 2013. Proceedings","216301015":"Self Adaptation and Convergence of Multiobjective Evolutionary Algorithms in Continuous Search Spaces","261021373":"A hybridization of MOEA/D with the nonlinear simplex search algorithm","261125797":"A hybrid of decomposition and domination based evolutionary algorithm for multi-objective software next release problem","238720780":"Multi-Objective Swarm Intelligent Systems - Theory \u0026 Experiences","47750112":"Lecture Notes in Computer Science","224472153":"A cognitive system based on fuzzy information processing and multi-objective evolutionary algorithm","224257127":"MO-Greedy: An Extended Beam-Search Approach for Solving a Multi-criteria Scheduling Problem on Heterogeneous Machines","4362616":"Colony Location Algorithm for Multiobjective Assignment Problem with Application to E-Brokerage","238477069":"A Jumping Gene Algorithm for Multiobjective Resource Management in Wideband","265027312":"Isight Design Optimization Methodologies","265780971":"A study with neighborhood searches to deal with multiobjective unconstrained permutation problems","220472346":"An optimization-based heuristic for the Multi-objective Undirected Capacitated Arc Routing Problem","220742761":"Fuzzy Dominance Based Multi-objective GA-Simplex Hybrid Algorithms Applied to Gene Network Models","220740713":"Predictive parameter control","221271153":"Convergence rates of SMS-EMOA on continuous Bi-objective problem classes","23648299":"An exact -constraint method for bi-objective combinatorial optimization problems: Application to the Traveling Salesman Problem with Profits","259405363":"Knowledge Gradient for Multi-objective Multi-armed Bandit Algorithms","282941851":"Optimal WCDMA network planning by multiobjective evolutionary algorithm with problem-specific genetic operation","4376837":"A Hybridised Evolutionary Algorithm for Multi-Criterion Minimum Spanning Tree Problems","225549366":"Domain-specific initial population strategy for compliant mechanisms using customized genetic algorithm","221580413":"Multi-objective Particle Swarm Optimization Method Based on Fitness Function and Sequence Approximate Model","220218474":"A two-stage hybrid memetic algorithm for multiobjective job shop scheduling","249319318":"Applying a Multiobjective Metaheuristic Inspired by Honey Bees to Phylogenetic Inference.","271495521":"Large-scale portfolio optimization using multiobjective dynamic mutli-swarm particle swarm optimizer","262317805":"A Modified micro Genetic Algorithm for undertaking Multi-Objective Optimization Problems","270723437":"Visualization of Pareto Front Approximations in Evolutionary Multiobjective Optimization: A Critical Review and the Prosection Method","279169516":"Multiobjective Particle Swarm Optimization Based on PAM and Uniform Design","265139870":"Multi-Objective Performance Evaluation of Controllers for a Thermal Process","286926926":"Correlated Gaussian Multi-Objective Multi-Armed Bandit across Arms Algorithm","226518228":"Vector Ordinal Optimization","221006969":"A new performance metric for multiobjective optimization: The integrated sphere counting","256464412":"Learning Paradigm Based on Jumping Genes: A General Framework for Enhancing Exploration in Evolutionary Multiobjective Optimization","265596545":"Interactive preferences in multiobjective ant colony optimisation for assembly line balancing","271206770":"The iPICEA-g: A new hybrid evolutionary multi-criteria decision making approach using the brushing technique","227050705":"An efficient multiobjective differential evolution algorithm for engineering design","229876970":"Adaptive ranks clone and","273111325":"The bi-objective Pollution-Routing Problem","224175111":"Integration of Preferences in Hypervolume-Based Multiobjective Evolutionary Algorithms by Means of Desirability Functions","216300984":"Running Time Analysis of a Multiobjective Evolutionary Algorithm on Simple and Hard Problems","221009008":"Evolutionary Multi-objective Simulated Annealing with Adaptive and Competitive Search Direction","224214016":"Review on Real Coded Genetic Algorithms Used in Multiobjective Optimization","257635846":"Repeated weighted boosting search for discrete or mixed search space and multiple-objective optimisation","261959362":"A coordinate-exchange two-phase local search algorithm for the D- and I-optimal designs of split-plot experiments","273482002":"Two-Objective Design of Benchmark Problems of a Water Distribution System via MOEAs: Towards the Best-Known Approximation of the True Pareto Front","220728392":"Multi-objective Ant Colony Optimization Algorithm for Shortest Route Problem","224472066":"Hypervolume Approximation using Achievement Scalarizing Functions for Evolutionary Many-Objective Optimization","4940076":"An empirical study on similarity-based mating for evolutionary multiobjective combinatorial optimization. Eur J Oper Res","4325674":"Symbolic Reliability Analysis and Optimization of ECU Networks","225549336":"On dominance-based multiobjective local search: Design, implementation and experimental analysis on scheduling and traveling salesman problems","222301227":"Gries, M.: Methods for evaluating and covering the design space during early design development. Integration, the VLSI Journal 38(2), 131-183","257635888":"A study of two penalty-parameterless constraint handling techniques in the framework of MOEA/D","222415921":"A new epsilon-dominance hierarchical Bayesian optimization algorithm for large multiobjective monitoring network design problems","222415920":"Stützle, T.: Design and analysis of stochastic local search for the multiobjective traveling salesman problem. Computers \u0026 Operations Research 36(9), 2619-2631","256456253":"A Novel Slicing Based Algorithm to Calculate Hypervolume for Multi-Objective Optimization Problems","261043963":"Multiobjective optimization of green sand mould system using DE and GSA","3139930":"Selecting features for nuclear transients classification by means of genetic algorithms","283990424":"On the influence of feature selection in fuzzy rule-based regression model generation","221633603":"A Study on Dominance-Based Local Search Approaches for Multiobjective Combinatorial Optimization","264789694":"Massively Parallel Evolutionary Computation on GPGPUs","251316109":"Hypervolume-based multi-objective local search","259542531":"Adapting the Hypervolume Quality Indicator to Quantify Trade-Offs and Search Efficiency for Multiple Criteria Decision-Making Using Pareto Fronts","215461289":"Diseño E Implementación De Una Metaheurística Basada En Autómatas Finitos Deterministas Para La Optimización Multiobjetivo De Problemas Combinatorios","242011923":"Multi-objective sequence dependent setup times permutation flows hop: a new algorithm and a comprehensive study. Eur J Oper Res","276859391":"MOMM: Multi-objective model merging","220048542":"Evolutionary Computation in Combinatorial Optimization","228572187":"On objective conflicts and objective reduction in multiple criteria optimization","265170504":"MOEA/D with Baldwinian learning inspired by the regularity property of continuous multiobjective problem","221007019":"Improved multi-objective evolutionary algorithm for day-ahead thermal generation scheduling","237148074":"Combining Crowding Estimation in Objective and Decision Space With Multiple Selection and Search Strategies for Multi-Objective Evolutionary Optimization","235794308":"Adaptive Variable Neighborhood Search for Solving Multi-Objective Facility Layout Problems with Unequal Area Facilities","220048534":"Evolutionary Computation in Combinatorial Optimization","261991955":"Design Space Exploration in Application-Specific Hardware Synthesis for Multiple Communicating Nested Loops","283636073":"Techniques for Genetic Software Architecture Design","265875016":"Optimisation of Mould Filling Parameters of the Compression Resin Transfer Moulding Process","221506722":"An Artificial Immune System-Inspired Multiobjective Evolutionary Algorithm with Application to the Detection of Distributed Computer Network Intrusions","261307906":"Applying the WFG algorithm to calculate incremental hypervolumes","257588939":"Synchronous and asynchronous Pareto-based multi-objective Artificial Bee Colony algorithms","228858934":"Multiobjective Optimization Using Clustering Based Two Phase PSO","226143464":"Multi-criteria location planning for public facilities in tsunami-prone coastal areas","281897307":"An orthogonal predictive model-based dynamic multi-objective optimization algorithm","224472313":"Effects of Using Two Neighborhood Structures on the Performance of Cellular Evolutionary Algorithms for Many-Objective Optimization","220867761":"A Plasmid Based Transgenetic Algorithm for the Biobjective Minimum Spanning Tree Problem","221271214":"The logarithmic hypervolume indicator","281897298":"A hybrid evolutionary multiobjective optimization algorithm with adaptive multi-fitness assignment","222571751":"A multi-objective evolutionary algorithm for the deployment and power assignment problem in wireless sensor networks","221009039":"A quality metric for multi-objective optimization based on Hierarchical Clustering Techniques","241129466":"A Methodology for Choosing between Alternative Communications Systems","257337075":"Scheduling multi-objective open shop scheduling using a hybrid immune algorithm","220740750":"Extending evolutionary algorithms to discover tri-criterion and non-supported solutions for the minimum spanning tree problem","261053993":"Evaluation of gossip Vs. broadcast as communication strategies for multiple swarms solving MaOPs","224247034":"An experimental study of preference model integration into multi-objective optimization heuristics","262331909":"A memetic algorithm for multiobjective problems","240685041":"Genetic Optimization of Multidimensional Technological Process Reliability","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","221883539":"On Local Search for Bi-objective Knapsack Problems","258207432":"Metaheurísticas Multi-Objetivo para Equilibrado de Líneas de Montaje en Automoción: Optimización Conjunta de Tiempo y Espacio","282425720":"Kriging-based infill sampling criterion for constraint handling in multi-objective optimization","268238418":"A heuristically-driven multi-criteria tool for the design of efficient open WiFi access networks","220361874":"Multiobjective optimization using an immunodominance and clonal selection inspired algorithm","245309229":"Preference-based Pareto Optimization in Certain and Noisy Environments","221009048":"Correlation between diversity and hypervolume in evolutionary multiobjective optimization","257697513":"Multiobjective vehicle routing problem with fixed delivery and optional collections","290193657":"10.1002 2015WR017756","222704880":"Nature-inspired metaheuristics for multiobjective activity crashing","223855841":"An ant colony optimization algorithm for the bi-objective shortest path problem","258635485":"Notice of Violation of IEEE Publication Principles Multiobjective Reinforcement Learning: A Comprehensive Overview","226497594":"Recent Trends in Evolutionary Multiobjective Optimization","257697510":"On the worst-case optimal multi-objective global optimization","220284061":"Multi-Criterion Optimization in Minimum Spanning Trees.","274856412":"Evaluating different strategies for integration testing of aspect-oriented programs","287330461":"IMPACT ANALYSIS OF CROSSOVERS IN MULTIOBJECTIVE EVOLUTIONARY ALGORITHM","290109684":"Relation between Neighborhood Size and MOEA/D Performance on Many-Objective Problems","286922917":"Performance Analysis of Simulation-based Multiobjective Optimization Using High Performance Computing","216300837":"Mating Scheme for Controlling the Diversity-Convergence Balance for Multiobjective Optimization","260621899":"A Hybrid Multiobjective Evolutionary Algorithm for Multiobjective Optimization Problems","272497145":"GENEPI: A MULTI-OBJECTIVE MACHINE REASSIGNMENT ALGORITHM FOR DATA CENTRES","228688996":"Two Heuristic Operations to Improve the Diversity of Two-objective Pareto Solutions","222420104":"A framework for Visually Interactive Decision-making and Design Using Evolutionary Multiobjective Optimization (VIDEO)","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","252018382":"A Multiobjective Memetic Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","261299807":"Plasmon-enhanced whispering gallery mode biosensing","254230250":"MOEA/D-SQA: A multi-objective memetic algorithm based on decomposition","225563839":"The efficiency of indicator-based local search for multi-objective combinatorial optimisation problems","225422496":"The Relation Between Complete and Incomplete Search","260621912":"Preference-Inspired Coevolutionary Algorithms for Many-Objective Optimization","282970380":"An alternative hypervolume-based selection mechanism for multi-objective evolutionary algorithms","269580739":"Synthetic biology for the directed evolution of protein biocatalysts: Navigating sequence space intelligently","277016912":"A multiobjective model and evolutionary algorithms for robust time and space assembly line balancing under uncertain demand","251954896":"Research on Optimization of Coal Production in New Mine Basis of Strategic Alliance","236865480":"A Memetic Evolutionary Multi-Objective Optimization Method for Environmental Power Unit Commitment","245309255":"The benefits of adaptive parametrization in multi-objective Tabu Search optimization","224246917":"Multi-objective design of highly interpretable fuzzy rule-based classifiers with semantic cointension","223808653":"Basics of genetic algorithms optimization for RAMS applications","277561680":"Self-adaptive multi-objective teaching-learning-based optimization and its application in ethylene cracking furnace operation optimization","226702431":"A method for simulation based optimization using radial basis functions","220714234":"Multi-Objective Routing and Topology Optimization in Networked Embedded Systems","256456340":"Adaptive Operator Selection With Bandits for a Multiobjective Evolutionary Algorithm Based on Decomposition","280156524":"Improving Robustness of Stopping Multi-objective Evolutionary Algorithms by Simultaneously Monitoring Objective and Decision Space","3455466":"Evolutionary multi-objective optimization: A historical view of the field","257164980":"A Multi-Objective Approach to Subarrayed Linear Antenna Arrays Design Based on Memetic Differential Evolution","225199245":"Evolutionary multi-objective optimization: Some current research trends and topics that remain to be explored","257588920":"New fitness sharing approach for multi-objective genetic algorithms","232877061":"Bi-objective project portfolio selection and staff assignment under uncertainty","252045027":"Multi-fidelity Simulation modelling in optimization of a hybrid submarine propulsion system","277348719":"Game-theoretic differential evolution for multiobjective optimization of green sand mould system","275339648":"Synchronous R-NSGA-II: An Extended Preference-Based Evolutionary Algorithm for Multi-Objective Optimization","220105975":"A new diversity induction mechanism for a multi-objective ant colony algorithm to solve a real-world time and space assembly line balancing problem","236658679":"On the Use of Sharpe´s index in evolutionary portfolio optimization under Markowitz´s model","273410471":"Dynamic Multiobjective Optimization Using Evolutionary Algorithm with Kalman Filter","220310732":"Achieving balance between proximity and diversity in multi-objective evolutionary algorithm","257392313":"A hybrid systematic design for multiobjective market problems: A case study in crude oil markets","220714184":"An Efficent Hierachical Fuzzy Approach for System Level System-on-a-Chip Design.","251821810":"A Multiobjective Genetic Fuzzy Approach for Intelligent System-level Exploration in Parameterized VLIW Processor Design","262366802":"Transformation-Based Exploration of Data Parallel Architecture for Customizable Hardware: A JPEG Encoder Case Study","284004639":"Lecture Notes in Computer Science","220105964":"Multi-strategy ensemble evolutionary algorithm for dynamic multi-objective optimization","221787328":"Improving Interpretability of Fuzzy Models Using Multi-Objective Neuro-Evolutionary Algorithms","222405817":"A software integration approach for designing and assessing dependable embedded systems","276461954":"Metaheuristic algorithms for approximate solution to ordinary differential equations of longitudinal fins having various profiles","4133318":"Comparison of local search implementation schemes in hybrid evolutionary multiobjective optimization algorithms","221787332":"Agent-Based Co-Evolutionary Techniques for Solving Multi-Objective Optimization Problems","241119139":"E20 The buffer capacity of urine. A new aspect for differential diagnostics of urolithiasis","234001421":"Coordinating strategic outsourcing decisions for semiconductor assembly using a bi-objective genetic algorithm","51990810":"A Pareto-metaheuristic for a bi-objective winner determination problem in a combinatorial reverse auction","223536982":"A portfolio optimization model with three objectives and discrete variables. Comp. Oper. Res. 37, 1285-1297","259136886":"Repeated double cross-validation for choosing a single solution in evolutionary multi-objective fuzzy classifier design","225585015":"Multiobjective Optimization and Rule Learning: Subselection Algorithm or Meta-heuristic Algorithm?","275219054":"Improving multi-objective code-smells correction using development history","274920040":"A New Multiobjective Evolutionary Algorithm Based on Decomposition of the Objective Space for Multiobjective Optimization","251112699":"Fuzzy Optimization via Multi-Objective Evolutionary Computation for Chocolate Manufacturing","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","257406276":"Practical multi-objective controller for preventing noise and vibration in an automobile wiper system","265401796":"MULTIOBJECTIVE PARTICLE SWARM OPTIMIZATION: INTEGRATION OF DYNAMIC POPULATION AND MULTIPLE-SWARM CONCEPTS AND CONSTRAINT HANDLING","282577600":"A ranking method based on two preference criteria: Chebyshev function and epsilon-indicator","277170834":"Annealing Linear Scalarized Based Multi-Objective Multi-Armed Bandit Algorithm","220313398":"On convergence of the multi-objective particle swarm optimizers","257512782":"The review of multiple evolutionary searches and multi-objective evolutionary algorithms","216301305":"Improving PSO-Based Multi-objective Optimization Using Crowding, Mutation and ∈-Dominance","40536137":"Optimierung von Fahrerassistenzsystemen","220741389":"Multiobjective evolutionary algorithms for dynamic social network clustering","262405508":"On Set-Based Multiobjective Optimization","221007627":"Seeding the Initial Population of a Multi-Objective Evolutionary Algorithm using Gradient-Based Information","288285447":"Multiobjective optimization of bioethanol production via hydrolysis using hopfield- enhanced differential evolution","251239632":"Optimising Data-Driven Safety Related Systems","46491882":"An improved multiobjective differential evolution based on Pareto-adaptive -dominance and orthogonal design","259138909":"Energy saving in railway timetabling: A bi-objective evolutionary approach for computing alternative running times","221406976":"Component deployment optimisation with bayesian learning","270971412":"A bi-objective scheduling problem on batch machines via a Pareto-based ant colony system","277889699":"A Multi-Start Split based Path Relinking (MSSPR) approach for the vehicle routing problem with route balancing","230881265":"Continuous Trait-Based Particle Swarm Optimisation (CTB-PSO)","278733486":"Hybrid Algorithm for Multi-Objective Optimization by Greedy Hypervolume Maximization","250682564":"ε-DANTE: An ant colony oriented depth search procedure","260662718":"Two-Level Production Plan Decomposition Based on a Hybrid MOEA for Mineral Processing","270293547":"A multiobjective study of the Gaussian cluster paging in the Reporting Cells strategy","225623883":"A Bi-objective Metaheuristic for Disaster Relief Operation Planning","276177487":"A Simple Pareto Adaptive ε-Domination Differential Evolution Algorithm for Multi-Objective Optimization","225382229":"The Multiobjective Traveling Salesman Problem: A Survey and a New Approach","254702869":"Particle swarm optimisation of memory usage in embedded systems","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","250614965":"Automatic extraction of common research areas in world scientograms using the multiobjective Subdue algorithm","220344167":"A cooperative coevolutionary algorithm for instance selection for instance-based learning","235709513":"Do Hypervolume Regressions Hinder EMOA Performance? Surprise and Relief","224259867":"Evolving Multimodal Networks for Multitask Games","220378981":"Optimizing Performance and Reliability on Heterogeneous Parallel Systems: Approximation Algorithms and Heuristics","238660725":"Multi-objective site selection and analysis for GSM cellular network planning","262526440":"A new Probe Guided Mutation operator and its application for solving the cardinality constrained portfolio optimization problem","3453562":"A Jumping-Genes Paradigm for Optimizing Factory WLAN Network","263804392":"PIECEWISE LINEAR REPRESENTATION SEGMENTATION IN NOISY DOMAINS WITH A LARGE NUMBER OF MEASUREMENTS: THE AIR TRAFFIC CONTROL DOMAIN","282524292":"Curses, Tradeoffs, and Scalable Management: Advancing Evolutionary Multiobjective Direct Policy Search to Improve Water Reservoir Operations","261709261":"Robust Multi-criteria Service Composition in Information Systems","276175392":"A Many-Objective Evolutionary Algorithm With Enhanced Mating and Environmental Selections","4262422":"Scored Pareto MEC for Multi-Objective Optimization and Its Convergence","220403579":"A new dispatching rule based genetic algorithm for the multi-objective job shop problem","250614954":"A multiobjective evolutionary programming framework for graph-based data mining","220381049":"A Fast Way of Calculating Exact Hypervolumes","220243838":"Dynamic Policy Modeling for Chronic Diseases: Metaheuristic-Based Identification of Pareto-Optimal Screening Strategies","273789455":"A PSO-based timing-driven Octilinear Steiner tree algorithm for VLSI routing considering bend reduction","278049484":"Multi-objective optimization method using an improved NSGA-II algorithm for oil–gas production process","250614959":"MOSubdue: A Pareto dominance-based multiobjective Subdue algorithm for frequent subgraph mining","266376639":"On the Performance of Multiobjective Evolutionary Algorithms in Automatic Parameter Extraction of Power Diodes","216301189":"A Critical Survey of Performance Indices for Multi-Objective Optimisation","220380993":"Multiobjective Optimization of Safety Related Systems: An Application to Short-Term Conflict Alert.","228663234":"One decade of multi-objective calibration approaches in hydrological modeling: A review","259511572":"Metaheuristic procedure for a bi-objective supply chain design problem with uncertainty","262227396":"A comparative study of variation operators used for evolutionary multi-objective optimization","284013192":"New version of a multi-algorithm genetically adaptive for multiobjective optimization","30514102":"Optimisation de Forme Multi-Objectif sur Machines Parallèles avec\nMéta-Modèles et Coupleurs. Application aux Chambres de Combustion Aéronautiques.","220741455":"A multi-objective particle swarm optimizer based on decomposition","260621792":"A Review of the Application of Multiobjective Evolutionary Fuzzy Systems: Current Status and Further Directions","23249673":"PSO-Based Multiobjective Optimization With Dynamic Population Size and Adaptive Local Archives","220606283":"Evolutionary Multi-Objective Optimisation Of Neural Networks For Face Detection.","263986642":"ROTATED PROBLEMS AND ROTATIONALLY INVARIANT CROSSOVER IN EVOLUTIONARY MULTI-OBJECTIVE OPTIMIZATION","225885977":"Approaching Dynamic Multi-Objective Optimization Problems by Using Parallel Evolutionary Algorithms","280691412":"MOTA: A Many-Objective Tuning Algorithm Specialized for Tuning under Multiple Objective Function Evaluation Budgets","235709565":"An Adaptive Approach to Controlling Parameters of Evolutionary Algorithms","233617311":"Influence of age on masonry bond strength and mortar microstructure","227252216":"A Review of Agent-Based Co-Evolutionary Algorithms for Multi-Objective Optimization","224057122":"The Optimization Methods Based on Non-dominated Sorting Genetic Algorithm for Scheduling of Material Flow in Mineral Process","223043378":"Computational steering of a multi-objective evolutionary algorithm for engineering design","220706652":"Eliminating Positional Dependency in Binary Representation via Redundancy","224177959":"A fast many-objective hypervolume algorithm using iterated incremental calculations","224259873":"Optimal strategies for multi objective games and their search by evolutionary multi objective optimization","259505419":"QAR-CIP-NSGA-II: A new multi-objective evolutionary algorithm to mine quantitative association rules","271501904":"Articulating Decision Maker\u0027s Preference Information within Multiobjective Artificial Immune Systems","262368545":"Parameterized average-case complexity of the hypervolume indicator","275329770":"Multi-objective Learning of Hybrid Classifiers","274084565":"Multi-criteria optimization of traffic signals: Mobility, safety, and environment","271741622":"Robuste multikriterielle Dienstkomposition in Informationssystemen","267263335":"A Fast Dynamical Evolutionary Algorithm for Multi-objective Mechanical Component Design","242445561":"Evolution Based on Decomposition for Multiobjective Optimization with Variable Linkages","224384981":"Dynamic Multiple Swarms in Multiobjective Particle Swarm Optimization","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","220403630":"Evolutionary multiobjective optimization in noisy problem environments","221308863":"Fuzzy Classification of Mortality by Infection of Severe Burnt Patients Using Multiobjective Evolutionary Algorithms.","226989832":"Using a Gradient Based Method to Seed an EMO Algorithm","221392803":"Parallel Library of Multi-objective Evolutionary Algorithms","257480137":"An adaptive compromise programming method for multi-objective path optimization","220944317":"Solving Multi-objective Pseudo-Boolean Problems.","226860819":"An Evolutionary Algorithm for the Multi-objective Multiple Knapsack Problem","281492063":"Battling Arrow\u0027s Paradox to Discover Robust Water Management Alternatives","272169636":"A comparative study of Multi-Objective Ant Colony Optimization algorithms for the Time and Space Assembly Line Balancing Problem","220471227":"Restarted Iterated Pareto Greedy algorithm for multi-objective flowshop scheduling problems","223709172":"Bound sets for biobjective combinatorial optimization problems","233297730":"Multi-objective no-wait flow shop scheduling problems: models and algorithms. Int J Prod Res","241116409":"Screen Lupus Patients for CV Risk Annually","255729049":"MFGA: A GA for complex real-world optimisation problems","262257928":"A Study on Evolutionary Multi-Objective Optimization with Fuzzy Approximation for Computational Expensive Problems","283621966":"Barzilai and Borwein’s method for multiobjective optimization problems","257334780":"Multiobjective topology optimization of truss structures with kinematic stability repair","235701411":"Adaptive Range Parameter Control","258237899":"Unwanted Noise and Vibration Control Using Finite Element Analysis and Artificial Intelligence","4262640":"A Multi-Objective Evolutionary Approach for Fuzzy Optimization in Production Planning","263286019":"Controller Tuning by Means of Evolutionary Multiobjective Optimization: a Holistic Multiobjective Optimization Design Procedure","220381079":"A Novel Immune Clonal Algorithm for MO Problems","245310505":"VIS: An artificial immune network for multi-objective optimization","221411204":"Effective Hybrid Stochastic Local Search Algorithms for Biobjective Permutation Flowshop Scheduling","261489966":"Multi-objective mapping optimization via problem decomposition for many-core systems","257635811":"Solving a Dial-a-Ride Problem with a Hybrid Multi-objective Evolutionary Approach: Application to Demand Responsive Transport","264641919":"Evolutionary Path Control Strategy for Solving Many-Objective Optimization Problem","3418760":"A collective-based adaptive symbiotic model for surface reconstruction in area-based stereo","243350589":"Optimising flat-walled multi-layered anechoic linings using evolutionary algorithms","226236355":"The dynamic optimization of PKM","265213196":"Multiobjective Memetic Estimation of Distribution Algorithm Based on an Incremental Tournament Local Searcher","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","284121644":"Selection mechanisms based on the maximin fitness function to solve multi-objective optimization problems","272198399":"Novel Search Scheme for Multi-Objective Evolutionary Algorithms to Obtain Well-Approximated and Widely Spread Pareto Solutions","224319385":"A Competitive-Cooperative Coevolutionary Paradigm for Dynamic Multiobjective Optimization","226135984":"Can Single-Objective Optimization Profit from Multiobjective Optimization?","224178070":"Sequential parameter optimization for multi-objective problems","237223144":"New results for the multi-objective sequence dependent setup times flowshop problem","9833027":"Plasma levels, urinary excretion, and clearance of 17-OHCS in renal patients after intravenous cortisol","278379073":"Benchmarking Numerical Multiobjective Optimizers Revisited","221024251":"An Analysis of Algorithmic Components for Multiobjective Ant Colony Optimization: A Case Study on the Biobjective TSP","281885205":"Force-Based Cooperative Search Directions in Evolutionary Multi-objective Optimization","3418862":"A faster algorithm for calculating hypervolume","220753907":"Effectiveness of genetic multistep searches in interpolation and extrapolation domains on multiobjective optimization","280631909":"Online Diversity Assessment in Evolutionary Multiobjective Optimization: A Geometrical Perspective","221544405":"Evolutionary Multi-objective Optimization Algorithm with Preference for Mechanical Design.","266407168":"Annealing-Pareto Multi-Objective Multi-Armed Bandit Algorithm","250614802":"Three-objective subgraph mining using multiobjective evolutionary programming","261500276":"An Investigation on Noisy Environments in Evolutionary Multi-Objective Optimization","220403649":"Solving the musical orchestration problem using multiobjective constrained optimization with a genetic local search approach","3418833":"Cooperative Coevolution of Artificial Neural Network Ensembles for Pattern Classification","221900766":"Multiple objective ant colony optimisation. Swarm Intell","2616014":"Multicriteria Optimization with Export Rules for Mechanical Design","257371580":"Flexible optimum design of a bracing system for façade design using multiobjective Genetic Algorithms","222681003":"Comparing state-of-the-art evolutionary multiobjective algorithms for long-term groundwater monitoring design. Advances in Water Resources, 29(6), 792-807","226789238":"Implementation of Multiobjective Memetic Algorithms for Combinatorial Optimization Problems: A Knapsack Problem Case Study","220403665":"Teghem, J.: Two-phase Pareto local search for the biobjective traveling salesman problem. Journal of Heuristics 16(3), 475-510","261477734":"Multi-objective Service Composition with Time- and Input-Dependent QoS","270774997":"Co-Evolutionary Optimization for Multi-Objective Design Under Uncertainty","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","220313561":"Multi-criteria genetic optimisation of the manoeuvres of a two-stage launcher","271549143":"A multi-objective service selection algorithm for service composition","220886992":"Some Demonstrations about the Cardinality of Important Sets of Non-dominated Sets.","256454066":"A Distributed Multiobjective Approach to Negotiations in Semi-Competitive Environments","262325593":"Testing of the multi-objective alliance algorithm on benchmark functions","221157329":"Multi-objective Feature Selection with NSGA II","220073502":"Multiobjective Neural Network Ensembles Based on Regularized Negative Correlation Learning","276175733":"Preference representation using Gaussian functions on a hyperplane in evolutionary multi-objective optimization","229039791":"COMPARATIVE STUDY OF SEVERAL MULTI-OBJECTIVE GENETIC ALGORITHMS","235709701":"Recent Developments in Derivative-Free Multiobjective Optimisation","220378674":"Use of Run Time Predictions for Automatic Co-Allocation of Multi-Cluster Resources for Iterative Parallel Applications","220063247":"Application of a niched Pareto genetic algorithm for selecting features for nuclear transients classification. Int J Intell Syst","4193068":"Using symbolic feasibility tests during design space exploration of heterogeneous multi-processor systems","282532803":"Chaotic initialized multiple objective differential evolution with adaptive mutation strategy (CA-MODE) for construction project time-cost-quality trade-off","221228601":"The Combative Accretion Model – Multiobjective Optimisation Without Explicit Pareto Ranking","260803740":"Multicriteria Optimization of A Long-Haul Routing and Scheduling Problem","226254437":"On Handling a Large Number of Objectives A Posteriori and During Optimization","237094200":"ETEA: A Euclidean Minimum Spanning Tree-Based Evolutionary Algorithm for Multi-Objective Optimization","229881513":"Dynamic multiobjective optimization of large‐scale industrial production systems: An emerging strategy","221228597":"Lorenz versus Pareto Dominance in a Single Machine Scheduling Problem with Rejection","274406208":"An Integer Linear Programming Approach to the Single and Bi-Objective Next Release Problem","221228595":"A Multi-objective Tabu Search Algorithm for Constrained Optimisation Problems","265170130":"Multiobjective GRASP with path relinking","221228594":"On Convergence of Multi-objective Pareto Front: Perturbation Method.","225181300":"Multiobjective Metaheuristic Approaches to Reliability Optimization","220741129":"Graphical tools for the analysis of bi-objective optimization algorithms","263894171":"A fast and efficient multi-objective evolutionary learning scheme for fuzzy rule-based classifiers","220341760":"A novel MILP-based objective reduction method for multi-objective optimization: Application to environmental problems","225037898":"Optimisation of a Multi-Objective Two-Dimensional Strip Packing Problem based on Evolutionary Algorithms","274199412":"Homogene Approximation der Paretofront bei mehrkriteriellen Kontrollproblemen","221228555":"Steady-State Selection and Efficient Covariance Matrix Update in the Multi-objective CMA-ES","261723325":"Engineering an efficient two-phase local search algorithm for the co-rotating twin-screw extruder configuration problem","282633212":"A new multi-objective particle swarm optimization algorithm based on decomposition","269404971":"Model-Based Multi-Objective Reinforcement Learning","221228554":"The Development of a Multi-threaded Multi-objective Tabu Search Algorithm.","221160971":"A multimethod search approach based on adaptive generations level","221228551":"Comparison Between Lamarckian and Baldwinian Repair on Multiobjective 0/1 Knapsack Problems","221228550":"A Two-Phase Local Search for the Biobjective Traveling Salesman Problem","221007365":"Optimization techniques for the selection of members and attributes in ensemble systems","220773890":"Exploiting Second Order Information in Computational Multi-objective Evolutionary Optimization.","221228548":"Recombination for Learning Strategy Parameters in the MO-CMA-ES.","282610677":"Many-Objective Problems: Challenges and Methods","221007362":"On scalability of Adaptive Weighted Aggregation for multiobjective function optimization","251909171":"Pareto-Set Based Multi-Objective Dynamic Reactive Power and Voltage Control","271665923":"Hybrid multi-objective optimisation for concurrent activities consolidating two docked spacecraft","221228572":"Quantifying the Effects of Objective Space Dimension in Evolutionary Multiobjective Optimization","221228571":"Multiple Criteria Lot-Sizing in a Foundry Using Evolutionary Algorithms","3418880":"Evolutionary multiobjective industrial design: The case of a racing car tire-suspension system","262151316":"Improving Many-Objective Optimization Performance by Sequencing Evolutionary Algorithms","223614562":"Visualization-based multi-objective improvement of environmental decision-making using linearization of response surfaces","221007380":"A Feasibility-Preserving Local Search Operator for Constrained Discrete Optimization Problems","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","264006784":"Two-Phase Differential Evolution for the Multiobjective Optimization of Time–Cost Tradeoffs in Resource-Constrained Construction Projects","45930881":"The multiobjective multidimensional knapsack problem: A survey and a new approach","3418890":"A distributed Cooperative coevolutionary algorithm for multiobjective optimization","221228561":"Feedback-Control Operators for Evolutionary Multiobjective Optimization","280224755":"On the Performance Metrics of Multiobjective Optimization","283872171":"Theoretical and Practical Fundamentals","263286000":"An improved version of the multiple trajectory search for real value multi-objective optimization problems","5303060":"Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria","5303061":"Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection","262304999":"Including preferences into a multiobjective evolutionary algorithm to deal with many-objective engineering optimization problems","30814877":"A New Approach on Many Objective Diversity Measurement","228794093":"The Multi-objective Evolution of Mobile Robot Behavior","221228641":"Adequacy of Empirical Performance Assessment for Multiobjective Evolutionary Optimizer.","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","287148626":"Dimension reduction of decision variables for multireservoir operation: A spectral optimization model","227153626":"Using Experimental Design to Analyze Stochastic Local Search Algorithms for Multiobjective Problems","223454721":"A dominance tree and its application in evolutionary multi-objective optimization","222647829":"Comparative analysis of multiobjective evolutionary algorithms for random and correlated instances of multiobjective d-dimensional knapsack problems","261196997":"Multi-objective airfoil shape optimization using a multiple-surrogate approach","228959986":"Performance of demo on new test problems: A comparison study","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","251045292":"The ε Dominance Based Multi-Objective Evolutionary Algorithm and an Adaptive ε Strategy: The ε Dominance Based Multi-Objective Evolutionary Algorithm and an Adaptive ε Strategy","220743240":"Swarm intelligence guided by multi-objective mathematical programming techniques","277023714":"Necessary and Sufficient Conditions for Surrogate Functions of Pareto Frontiers and Their Synthesis Using Gaussian Processes","263048399":"A Hitchhiker\u0027s Guide to Search-Based Software Engineering for Software Product Lines","220743243":"G-Metric: an M-ary quality indicator for the evaluation of non-dominated sets","228828871":"PARALLEL EVOLUTIONARY ALGORITHM FOR HETEROGENEOUS COMPUTER SYSTEMS","4174682":"An algebra of Pareto points","259539997":"A Simulated Annealing Algorithm for Noisy Multiobjective Optimization","282000299":"Sunflower phenotype optimization under climatic uncertainties using crop models","252191841":"Editorial: Evolutionary Multiobjective Optimization","271711064":"Optimizing the mobility management task in networks of four world capital cities","224177712":"An enhanced MOEA/D-DE and its application to multiobjective analog cell sizing","264883364":"Multi-Objective Design of a Combinatorial Structure","221228609":"Exploiting Comparative Studies Using Criteria: Generating Knowledge from an Analyst\u0027s Perspective.","284359581":"Shape Optimization of a Cyclone Separator using Multi-Objective Surrogate-Based Optimization","221296192":"Solving Constrained Multi-objective Optimization Problems Using Non-dominated Ranked Genetic Algorithm","277887970":"Multi-Objective Genetic Algorithm for Berth Allocation Problem Considering Daytime Preference","245439959":"Genetic Algorithms Applied to Multi-Objective Aerospace Shape Optimization","267963520":"Blended Rank Evolutionary Algorithm and Constrained Multiobjective Optimisation","46432703":"Model-Based Problem Solving through Symbolic Regression via Pareto Genetic Programming","224255526":"Meeting Deadlines Cheaply","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","221154899":"Design of complex image processing systems in ESL","263167185":"Optimization of meshless based simulation for coupled transport phenomena","283503456":"Evoluindo os pesos de uma Rede Neural Artificial uma abordagem Multiobjetivo","220214950":"A memetic model of evolutionary PSO for computational finance applications","262358058":"On the anytime behavior of IPOP-CMA-ES","272753608":"Strategic Flight Assignment Approach based on Multi-objective Parallel Evolution Algorithm with Dynamic Migration Interval","259505405":"General framework for localised multi-objective evolutionary algorithms","220608170":"A Multiobjective Particle Swarm Optimizer for Constrained Optimization","4201425":"An optimization algorithm for imprecise multi-objective problem functions","273400799":"Anytime Pareto local search","284779375":"Preference Incorporation in Evolutionary Multiobjective Optimization: A Survey of the State-of-the-Art","220743351":"An enhanced statistical approach for evolutionary algorithm comparison","241126911":"Une faune nouvelle de trilobites ( Brachymetopus, Namuropyge) dans le Viséen des Vosges du Sud. Conséquences stratigraphiques et paléoécologiques","239549926":"La de cision de groupe : lèapplication de me thodes de surclassement de synthse","223157996":"Efficient design space exploration for application specific systems-on-a-chip","257596665":"Multi-objective scheduling and a resource allocation problem in hospitals","225593046":"Transgenetic Algorithm: A New Endosymbiotic Approach for Evolutionary Algorithms","260011227":"On the use of multiobjective optimization for solving the Location Areas strategy with different paging procedures in a realistic mobile network","225556185":"Multi-Objective Neural Network Optimization for Visual Object Detection","281584480":"Combining Multi-Objective Search and Constraint Solving for Configuring Large Software Product Lines.","221007493":"MODE-LD+SS: A novel Differential Evolution algorithm incorporating local dominance and scalar selection mechanisms for multi-objective optimization","235709863":"Automatically Improving the Anytime Behaviour of Optimisation Algorithms","220403336":"Multi-objective redundancy allocation optimization using a variable neighborhood search algorithm","260721697":"Performance Metric Ensemble for Multiobjective Evolutionary Algorithms","238523803":"Multi-objective optimization in dynamic environment: A review","261196860":"Inverse induction motor modelling of a submarine propulsion system","283636554":"Sensitivity of Algorithm Parameters and Objective Function Scaling in Multi-Objective Optimisation of Water Distribution Systems","228617743":"Lamarckian Repair and Darwinian Repair in EMO Algorithms for Multiobjective 0/1 Knapsack Problems","4269041":"Diversity Metrics in Multi-objective Optimization: Review and Perspective","261078079":"Effects of duplicated objectives in many-objective optimization problems on the search behavior of hypervolume-based evolutionary algorithms","220741273":"Scaling up indicator-based MOEAs by approximating the least hypervolume contributor: A preliminary study","226604595":"Evolving the Tradeoffs between Pareto-Optimality and Robustness in Multi-Objective Evolutionary Algorithms","254461080":"Divide and Conquer High-Level Synthesis Design Space Exploration","241186260":"Multi-objective immune algorithm with dynamic memetic Cauchy mutation","260799549":"A multi-objective optimization approach for the integration and test order problem","277605171":"An Algorithm for Many-Objective Optimization With Reduced Objective Computations: A Study in Differential Evolution","284017492":"Performance evaluation of dominance-based and indicator-based multiobjective approaches for phylogenetic inference","220176037":"Use of biased neighborhood structures in multiobjective memetic algorithms","222572287":"Considering manufacturing cost and scheduling performance on a CNC turning machine","222414588":"Floor shape optimization for green building design","3419017":"A Jumping Gene Paradigm for Evolutionary Multiobjective Optimization","250615118":"MOEP-SO: A multiobjective evolutionary programming algorithm for graph mining","264744057":"A new selection metric for multiobjective hydrologic model calibration","276542405":"Representation of the non-dominated set in biobjective discrete optimization","277291832":"Evolutionary Computation Group","275096485":"Tuning Optimization Algorithms Under Multiple Objective Function Evaluation Budgets","29626886":"How effective and efficient are multiobjective evolutionary algorithms at hydrologic model calibration? Hydrol Earth Syst Sci","272174075":"Universal approximators for direct policy search in multi-purpose water reservoir management: A comparative analysis","261520468":"Diversity Comparison of Pareto Front Approximations in Many-Objective Optimization","280879993":"Decomposing the user-preference in multiobjective optimization","259849402":"On the Effects of the Robot Configuration on Evolving Coordinated Motion Behaviors","221163238":"New Quality Measures for Multiobjective Programming","4307848":"On performance metrics and particle swarm methods for dynamic multiobjective optimization problems","272198640":"Modeling and solving the project selection and Scheduling","268694477":"Hybrid multiple objective artificial bee colony with differential evolution for the time-cost-quality tradeoff problem","257567882":"Calibrating continuous multi-objective heuristics using mixture experiments","257516680":"Scheduling issues in vehicle routing","264002669":"Hypervolume Maximization via Set Based Newton\u0027s Method","215867150":"Some convergence-based M-ary cardinal metrics for comparing performances of multi-objective optimizers","225836716":"A Hypervolume-Based Optimizer for High-Dimensional Objective Spaces","228548166":"Resource Co-Allocation based on Application Profiling: A Case Study in Multi-Objective Evolutionary Computations","270007245":"On the use of filters to facilitate the post-optimal analysis of the Pareto solutions in multi-objective optimization","285696731":"A multiobjective evolutionary algorithm using dynamic weight design method","275583885":"P3GA: An Algorithm for Technology Characterization","224333502":"Optimizing the Configuration of a Broadcast Protocol through Parallel Cooperation of Multi-objective Evolutionary Algorithms","252392681":"Validating Pareto optimal operation parameters of polyp detection algorithms for CT colonography","261465207":"Double cross-validation for performance evaluation of multi-objective genetic fuzzy systems","290435757":"Multi-objective Evolutionary Algorithm with Discrete Differential Mutation Operator for Service Restoration in Large-Scale Distribution Systems","269222888":"Exploration versus exploitation trade-off in infinite horizon Pareto Multi-armed bandits algorithms","272006097":"Designing automotive embedded systems with adaptive genetic algorithms","3568604":"Enhanced performance of PMOS and CMOS circuits using self-aligned MOSFETs with modulation doped Si-Ge channel","224356020":"An Evolutionary Algorithm to a Multi-Objective Deployment and Power Assignment Problem in Wireless Sensor Networks","26817140":"Use of surrogate modelling for multiobjective optimisation of urban wastewater systems","235744739":"Hybrid Pareto archived dynamically dimensioned search for multi-objective combinatorial optimization: Application to water distribution network design","280851276":"Optimal μ-Distributions for the Hypervolume Indicator for Problems With Linear Bi-Objective Fronts: Exact and Exhaustive Results","223876779":"Multi-objective self-adaptive algorithm for highly constrained problems: Novel method and applications","4201396":"A hybrid multi-objective evolutionary algorithm using an inverse neural network for aircraft control system design","220204758":"Evolutionary Multiobjective Design in Automotive Development","228537961":"Multi-objective sequence dependent setup times flowshop scheduling: a new algorithm and a comprehensive study","221007579":"An Investigation on Evolutionary Gradient Search for Multi-objective Optimization","220380890":"A distributed Cooperative coevolutionary algorithm for multiobjective optimization.","280851269":"Approaching the Pareto-Frontier of the Multi-Objective Dial-a-Ride Problem","260803698":"A Bi-Objective Inventory Routing Problem for Sustainable Waste Management Under Uncertainty","4307896":"SAT-decoding in evolutionary algorithms for discrete constrained optimization problems","256453810":"Studying Feedback Mechanisms for Adaptive Parameter Control in Evolutionary Algorithms","261430382":"Issues with performance measures for dynamic multi-objective optimisation","274310050":"MOEA/PC: Multiobjective Evolutionary Algorithm Based on Polar Coordinates","227208822":"Evolutionary Optimization for Multiobjective Portfolio Selection under Markowitz’s Model with Application to the Caracas Stock Exchange","227655276":"On the use of multi‐algorithm, genetically adaptive multi‐objective method for multi‐site calibration of the SWAT model","287443677":"Visualizing Exact and Approximated 3D Empirical Attainment Functions","268821509":"Feedback-control operators for improved Pareto-set description: Application to a polymer extrusion process","280554681":"Approximating Multiobjective Optimization Problems with Complex Pareto Fronts","220471589":"A hybrid TP+PLS algorithm for bi-objective flow-shop scheduling problems","220741929":"A memetic algorithm for two-dimensional multi-objective bin-packing with constraints","265792470":"A Portfolio Optimization Approach to Selection in Multiobjective Evolutionary Algorithms","223719767":"Multi-objective K-connected Deployment and Power Assignment in WSNs using a problem-specific constrained evolutionary algorithm based on decomposition","259179376":"Stable Matching Based Selection in Evolutionary Multiobjective Optimization","258757478":"Visual analytics clarify the scalability and effectiveness of massively parallel many-objective optimization: A groundwater monitoring design example","220901670":"Automatic Configuration of Multi-Objective ACO Algorithms","273910879":"A dual-population paradigm for evolutionary multiobjective optimization","275551329":"Beam Search for integer multi-objective optimization","257299288":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction","265622469":"Efficient Algorithms for the Assessment of Stochastic Multiobjective Optimizers","220508469":"Multiobjective Optimization Approach for Sensor Arrangement in A Complex Indoor Environment","221196603":"Reference Set Metrics for Multi-Objective Algorithms","46888670":"Multi-Objective Combinatorial Optimization: Problematic and Context","257549134":"Multi Agent Collaborative Search based on Tchebycheff decomposition","280534179":"A Performance Comparison Indicator for Pareto Front Approximations in Many-Objective Optimization","220774707":"An Hybrid Soft Computing Approach for Automated Computer Design.","224094528":"A Confidence-Based Dominance Operator in Evolutionary Algorithms for Noisy Multiobjective Optimization Problems","257432388":"A multiobjective approach based on artificial bee colony for the static routing and wavelength assignment problem. Soft Comput","222701915":"Multiobjective constructive heuristics for the 1/3 variant of the time and space assembly line balancing problem: ACO and random greedy search","224211267":"Decomposition-Based Memetic Algorithm for Multiobjective Capacitated Arc Routing Problem","223562060":"Working principles, behavior, and performance of MOEAs on MNK-landscapes","224211266":"A Multicriteria Statistical Based Comparison Methodology for Evaluating Evolutionary Algorithms","237670923":"Parallel Evolutionary Multi-Objective Optimization on Large, Heterogeneous Clusters: An Applications Perspective","5297268":"Improving Locality in Binary Representation via Redundancy","282852593":"A Predictive Pareto Dominance Based Algorithm for Many-Objective Problems","224250230":"Multiobjective Production Planning Optimization Using Hybrid Evolutionary Algorithms for Mineral Processing","224086389":"A novel algorithm for non-dominated hypervolume-based multiobjective optimization","4201583":"Multi-objective mobile agent routing in wireless sensor networks","258401097":"A PSO-Optimized Minimum Spanning Tree-Based Topology Control Scheme for Wireless Sensor Networks","6532179":"Diffusion tensor imaging: techniques and clinical applications.","225261917":"Multi-objective and prioritized berth allocation in container ports","220313874":"A real-coding jumping gene genetic algorithm (RJGGA) for multiobjective optimization","257643372":"Multi-objective Variable Neighborhood Search Algorithms for a Single Machine Scheduling Problem with Distinct due Windows","251230912":"Adding Diversity to Two Multiobjective Constructive Metaheuristics for Time and Space Assembly Line Balancing","257518432":"An affective learning agent with Petri-net-based implementation. Appl Intell","46888688":"Advances in Multi-Objective Nature Inspired Computing","256660343":"Approximation quality of the hypervolume indicator","224330083":"Evolutionary Many-Objective Optimization: A Short Review","243333820":"Immune secondary response and clonal selection inspired optimizers","262808470":"DECMO2: a robust hybrid and adaptive multi-objective evolutionary algorithm","220166493":"Preliminary Numerical Experiments in Multiobjective Optimization of a Metallurgical Production Process.","287397221":"Synthesis of Phase-Only Reconfigurable Linear Arrays Using Multiobjective Invasive Weed Optimization Based on Decomposition","230814084":"On the Design of a Novel Two--Objective Harmony Search Approach for Distance-- and Connectivity--based Localization in Wireless Sensor Networks","209606711":"Restarted Iterated Pareto Greedy algorithm for Multi-Objective Flowshop problems","271905917":"Study of hybrid methods for approximating the Edgeworth-Pareto hull in nonlinear multicriteria optimization problems","283151529":"An imprecise Multi-Objective Genetic Algorithm for uncertain Constrained Multi-Objective Solid Travelling Salesman Problem","220774755":"NEWPAR: An Optimized Feature Selection and Weighting Schema for Category Ranking.","285549896":"A Novel Multiple Objective Symbiotic Organisms Search (MOSOS) for Time-Cost-Labor Utilization Tradeoff Problem","262282221":"The Relationship between the Covered Fraction, Completeness and Hypervolume Indicators","265853838":"A Novel Interactive Preferential Evolutionary Method for Controller Tuning in Chemical Processes","223191317":"Multi-objective zone mapping in large-scale distributed virtual environments","264719262":"A strength Pareto evolutionary algorithm–based conflict assessment framework of electricity market participants\u0027 objectives in generation maintenance scheduling","259973925":"Multi-Objective Quality-Driven Service Selection--A Fully Polynomial Time Approximation Scheme","220739956":"Some comments on GD and IGD and relations to the Hausdorff distance","235121247":"Hybrid Robust Multi-Objective Evolutionary Optimization Algorithm","222302494":"DEMORS: a hybrid multi-objective optimization algorithm using differential evolution and rough sets for constrained problems. Comput Oper Res","261131215":"Pareto Rank Learning in Multi-objective Evolutionary Algorithms","271920234":"Using a simulated Wolbachia infection mechanism to improve multi-objective evolutionary algorithms","225536273":"Pareto set approximation by the method of adjustable weights and successive lexicographic goal programming","46888616":"ParadisEO-MOEO: A Software Framework for Evolutionary Multi-Objective Optimization","4174940":"Evolutionary design of analog circuits with a uniform-design based multi-objective adaptive genetic algorithm","216457345":"An evolutionary multiobjective optimization approach to component-based software architecture design","220774720":"Endowing BDI Agents with Capability for Modularizing.","239946277":"MOEA/D with adaptive weight adjustment","277873912":"Multi-objective optimization of polyester-rope and steel-rope suspended footbridges","220741954":"Biobjective evolutionary and heuristic algorithms for intersection of geometric graphs.","220774723":"Empirical Evaluation of Scoring Methods.","224579855":"On the Complexity of Computing the Hypervolume Indicator","275227658":"Stopping criteria for MAPLS-AW, a hybrid multi-objective evolutionary algorithm","261192672":"Search-based genetic optimization for deployment and reconfiguration of software in the cloud","216301719":"A Tutorial on Evolutionary Multiobjective Optimization","261403617":"Algorithmic Framework for MO optimization","220774749":"Rational Agents under ASP in Games theory.","224330024":"An Improved CHSO Algorithm for Multi-Objective Optimization Problem","221024596":"Meta-Modeling in Multiobjective Optimization","251829115":"A New Way of Calculating Exact Exclusive Hypervolumes","268475514":"Aerodynamic Optimization Using a Hybrid MOGA-Local Search Method","258063131":"Choosing the Appropriate Forecasting Model for Predictive Parameter Control","220774742":"Social Responsibility among deliberative agents.","4283454":"A Competitive-Cooperation Coevolutionary Paradigm for Multi-objective Optimization","262317021":"Advances in Evolutionary Multi-objective Optimization","268883079":"Post Pareto-optimal pruning algorithm for multiple objective optimization using specific extended angle dominance","4291779":"Synchronization of the Probes of a Distributed Instrument for Real-Time Ethernet Networks","220176795":"Multi-objective self-adaptive differential evolution with elitist archive and crowding entropy-based diversity measure. Soft Comput Fusion Found Method Appl","242029289":"Multiobjective Gaussian Particle Swarm Approach Applied to Multiloop PI Controller Tuning of a Quadruple-Tank System","222525894":"Metaheuristics and cooperative approaches for the Bi-objective Ring Star Problem","261141269":"Multi-Objective Optimization by Using Evolutionary Algorithms: The $p$-Optimality Criteria","4201672":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","282530911":"Many-Objective Evolutionary Algorithms","267127653":"Pareto Local Search Algorithms for Anytime Bi-objective Optimization","280534066":"Bi-goal evolution for many-objective optimization problems","239936192":"Uma Nova Medida de Performance para Otimizac ¸˜ ao MultiObjetivo: Integral da Contagem de Esferas","235711107":"Hybrid Metaheuristics","268163956":"A novel preference articulation operator for the Evolutionary Multi-Objective Optimisation of classifiers in concealed weapons detection","235694748":"Evolutionary Multi-Objective Optimization in Water Distribution Network Design","225665506":"A fast steady-state ε-dominance multi-objective evolutionary algorithm","267164543":"Knowledge-driven computing. Knowledge engineering and intelligent computations","221174203":"One MOEA Uniformity Measurement Based on Generalized Spherical Transformation.","286844301":"Multi-objective Dynamic Layout Problems for Unequal-Area Workshop Facilities Based on NSGA-II","224598521":"An Introduction to Multiobjective Optimisation Methods for Decentralised Power Planning","259124203":"Multi-objective real-time dispatching for integrated delivery in a Fab using GA based simulation optimization","286924166":"Search-Based Synthesis of Probabilistic Models for Quality-of-Service Software Engineering","290168276":"Multi-Objective Ant Colony Optimization Based on the Physarum-Inspired Mathematical Model for Bi-Objective Traveling Salesman Problems","216301639":"On the Design of Optimisers for Surface Reconstruction ABSTRACT","261124916":"Bipolar preferences dominance based evolutionary algorithm for many-objective optimization","224408005":"The distributed generator placement and sizing test suite and analysis tool","242506450":"Computational Intelligence in Reliability Engineering: Evolutionary Techniques in Reliability Analysis and Optimization","44099079":"Otimização por nuvem de partículas multiobjetivo no aprendizado indutivo de regras","216457295":"On Expected-Improvement Criteria for Model-based Multi-objective Optimization","228684045":"Lifetime Reliability Optimization for Embedded Systems: A System-Level Approach","221002113":"A comparison of randomized and evolutionary approaches for optimizing base station site selection","265554810":"A multiobjective evolutionary algorithm based on decomposition with normal boundary intersection for traffic grooming in optical networks","266982214":"On the Performance of Local Search for the Biobjective Traveling Salesman Problem","220739975":"Generalized adaptive pursuit algorithm for genetic pareto local search algorithms","216457303":"Indicator-Based Selection in Multiobjective Search","291186153":"The Bi-Objective Quadratic Multiple Knapsack Problem: Model and Heuristics","216457298":"A portfolio optimisation approach to selection in multi-objective evolutionary algorithms","271551643":"A directional-biased tabu search algorithm for multi-objective unconstrained binary quadratic programming problem","220856735":"A Novel Multi-objective Evolutionary Algorithm.","29621627":"ParadisEO-MOEO: A Framework for Evolutionary Multi-objective Optimization","281715825":"Design of sparse concentric rings array for LEO satellites","257119214":"A multi-objective electromagnetism algorithm for a bi-objective flowshop scheduling problem. J Manuf Syst","29621629":"Metaheuristics for the Bi-objective Ring Star Problem","220160417":"Metco: a Parallel Plugin-Based Framework for Multi-Objective Optimization.","29621628":"Combinatorial Optimization of Stochastic Multi-objective Problems: An Application to the Flow-Shop Scheduling Problem","238682874":"Title of Dissertation ENTROPY APPROACH TO METAMODELING, MULTI-OBJECTIVE GENETIC ALGORITHM, AND QUALITY ASSESSMENT OF SOLUTION SETS FOR","272018678":"Efficient Workflow Scheduling for Grid Computing Using a Leveled Multi-objective Genetic Algorithm","29637893":"Evaluation and Optimization of the Robustness of DAG Schedules in Heterogeneous Environments","224330139":"Scalarization versus Indicator-based Selection in Multi-Objective CMA Evolution Strategies","228788582":"A NEW EVOLUTIONARY ALGORITHM FOR MULTIOBJECTIVE OPTIMIZATION BASED ON ENDOCRINE PARADIGM","4074747":"Some multiobjective optimizers are better than others","261460816":"Evolutionary algorithms for a three-objectives oil derivatives network problem","216457248":"The maximum hypervolume set yields near-optimal approximation","222321030":"Multiobjective and constrained optimization for DS-CDMA code design on the clonal selection principle","250888754":"Multi-criteria design methodology of a dielectric resonator antenna with jumping genes evolutionary algorithm","221053413":"Fuzzy Classification with Multi-objective Evolutionary Algorithms","221196775":"An Intelligence Model with Max-Min Strategy for Constrained Evolutionary Optimization.","4201610":"Designing comminution circuits with a multi-objective evolutionary algorithm","216457260":"Getting lost or getting trapped: On the effect of moves to incomparable points in multiobjective hillclimbing","24305081":"A Unified Model for Evolutionary Multiobjective Optimization and its Implementation in a General Purpose Software Framework: ParadisEO-MOEO","224330131":"The self-adaption strategy for parameter ε in ε-MOEA","224360849":"Jumping Genes Multiobjective Optimization Scheme for Planar Monopole Ultrawideband Antenna","275018923":"Multi-objective Evolutionary Algorithm with Discrete Differential Mutation Operator for Service Restoration in Large-Scale Distribution Systems","235434712":"On the use of Principal Component Analysis for reducing the number of environmental objectives in multi-objective optimization: Application to the design of chemical supply chains","260211539":"Multi-objective optimization of empirical hydrological model for streamflow prediction","46433814":"Enhancement of Sandwich Algorithms for Approximating Higher Dimensional Convex Pareto Sets","216457268":"Indicator-based evolutionary algorithm with hypervolume approximation by achievement scalarizing functions","221905388":"Agent-Based Multi-Objective Evolutionary Algorithms with Cultural and Immunological Mechanisms","261460815":"A new selection mechanism based on hypervolume and its locality property","262374265":"A general framework for evolutionary multiobjective optimization via manifold learning","264387359":"An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point-Based Nondominated Sorting Approach, Part I: Solving Problems With Box Constraints","259804065":"An Adaptive Multi-Swarm Optimizer for Dynamic Optimization Problems","37988001":"A design framework and genetic algorithm for digital design optimisation on FPGAs","262155074":"Bicriteria p-Hub Location Problems and Evolutionary Algorithms","259804063":"General Subpopulation Framework and Taming the Conflict Inside Populations","220508609":"Multiobjective Simulated Annealing for Fuzzy Clustering With Stability and Validity","27342150":"Improved genetic algorithm inspired by biological evolution","239594158":"Adaptive Co-Allocation of Distributed Resources for Parallel Applications","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","237062858":"Simulation-Based Multi-Objective Optimization of Current Conveyors: Performance Evaluations","264917798":"A Comparative Study of Multi-objective Evolutionary Algorithms for the Bi-objective 2-Dimensional Vector Packing Problem","233529605":"Increasing the Density of Available Pareto Optimal Solutions","263525189":"Comparison and Evaluation of Multiple Objective Genetic Algorithms for the Antenna Placement Problem: Algorithmic Solutions for Wireless, Mobile, Ad Hoc and Sensor Networks (Guest Editors: Amotz Bar-Noy, Alan A. Bertossi, Cristina M. Pinotti and Cauligi S. Raghavendra)","220740057":"Population-ACO for the automotive deployment problem","272891058":"Multiobjective optimization: When objectives exhibit non-uniform latencies","216457236":"Set-based multi-objective optimization, indicators, and deteriorative cycles","259539850":"A MOO-based Methodology for Designing 3D Stacked Integrated Circuits","272891057":"Quantifying uncertainty on Pareto fronts with Gaussian Process conditional simulations","28355907":"Minimum Spanning Trees Made Easier Via Multi-Objective Optimization","260008844":"Self-adaptive metaheuristics for solving a multi-objective 2-dimensional vector packing problem","216457235":"A SEQUENTIAL DESIGN FOR APPROXIMATING THE PARETO FRONT USING THE EXPECTED PARETO IMPROVEMENT FUNCTION","257403810":"Multiobjective evolutionary algorithms for multivariable PI controller design","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","264432442":"Deconstructing Multi-objective Evolutionary Algorithms: An Iterative Analysis on the Permutation Flow-Shop Problem","262208346":"Multi-objective no-wait hybrid flowshop scheduling problem with transportation times","225526154":"A Non-ordered Rule Induction Algorithm through Multi-Objective Particle Swarm Optimization: Issues and Applications","259957632":"An Algorithmic Framework for Multiobjective Optimization","261051249":"A genetic local search algorithm for multiobjective time-dependent route planning","273181878":"MO-COMPASS: A Fast Convergent Search Algorithm for Multi-Objective Discrete Optimization via Simulation","31104293":"A Jumping Gene Algorithm for Multiobjective Resource Management in Wideband CDMA Systems","264037187":"Un nuevo Algoritmo Evolutivo de Optimización Multiobjetivo basado en Preferencias: WASF-GA","224198749":"Scenario-Based Design Space Exploration of MPSoCs","282951132":"Multi-objective optimization coupled with dimension-wise polynomial-based approach in smart well placement under model uncertainty","269724950":"Novel performance metrics for robust multi-objective optimization algorithms","4074808":"Comparative Studies on Micro Heat Exchanger Optimization","265552604":"Software Refactoring Under Uncertainty: A Robust Multi-Objective Approach","227608729":"Visualization approaches for the prototype improvement problem","220209192":"A heuristic two-phase solution method for the multi-objective dial-a-ride problem","263613118":"A preference-based evolutionary algorithm for multiobjective optimization: The weighting achievement scalarizing function genetic algorithm","282353117":"Preference-guided Evolutionary Algorithms for Many-objective Optimization","220381224":"An Investigation on Noisy Environments in Evolutionary Multiobjective Optimization","273980766":"Framework for multi-criteria decision management in watershed restoration","286506009":"A More Efficient Selection Scheme in iSMS-EMOA","220381225":"A review of multiobjective test problems and a scalable test problem toolkit.","222433353":"Applications of multi-objective structure optimization","235932444":"Analyzing the impact of MOACO components: An algorithmic study on the multi-objective shortest path problem","221188128":"Robust Handling of Multiple Multi-Objective Optimisations.","227152005":"Multiobjective Genetic Fuzzy Systems","284995059":"A Self-adaptive Genetic Algorithm Applied to Multi-Objective Optimization of an Airfoil","259084900":"Speeding up many-objective optimization by Monte Carlo approximations","278797707":"Using Comparative Preference Statements in Hypervolume-Based Interactive Multiobjective Optimization","224309321":"A Multiobjective Evolutionary-Simplex Hybrid Approach for the Optimization of Differential Equation Models of Gene Networks","242447211":"Optimierung durch evolutionäre Algorithmen mit S-Metrik-Selekti on","220825649":"Ants Guide Future Pilots.","263930528":"Hybrid algorithms for the twin–screw extrusion configuration problem","275594573":"Asteroid Rendezvous Mission Design Using Multiobjective Particle Swarm Optimization","266967755":"Interrelationship-Based Selection for Decomposition Multiobjective Optimization","278619582":"A Correlation Analysis of Set Quality Indicator Values in Multiobjective Optimization","29621476":"On the Integration of a TSP Heuristic into an EA for the Bi-objective Ring Star Problem","220045365":"Multiobjective Optimization Using Evolutionary Algorithms. Wiley, New York","257516144":"Simulation and multicriteria optimization modeling approach for regional water restoration management","265628415":"Effective Stochastic Local Search Algorithms For Bi-Objective Permutation Flowshop Scheduling","277257644":"Ambulance routing problems with rich constraints and multiple objectives [PhD thesis]","220176433":"Searching for knee regions of the Pareto front using mobile reference points","239577972":"Foundations of Genetic Algorithms, 8th International Workshop, FOGA 2005, Aizu-Wakamatsu City, Japan, January 5-9, 2005, Revised Selected Papers","288838659":"Enhanced Version of Multi-algorithm Genetically Adaptive for Multiobjective optimization","272239875":"Bi-criteria appointment scheduling of patients with heterogeneous service sequences","38092670":"On the Use of Problem-Specific Candidate Generators for the Hybrid Optimization of Multi-Objective Production Engineering Problems","261382824":"Electrical Transmission Lines Design through Integer Multiobjective Particle Swarm Optimization Approach","272846207":"Preference-inspired co-evolutionary algorithms using weight vectors","220119075":"Multiobjective memetic algorithms for time and space assembly line balancing","4074752":"Bounded archiving using the Lebesgue measure","282742244":"Multiobjective Optimization of Crop-mix Planning Using Generalized Differential Evolution Algorithm","220471392":"Bullinaria, J.A.: An improved multi-objective evolutionary algorithm for the vehicle routing problem with time windows. Comput. Oper. Res. 38(1), 287-300","275060003":"Opposition-based Multiple Objective Differential Evolution (OMODE) for optimizing work shift schedules","275381550":"A Local Search-Based Multiobjective Optimization Algorithm for Multiobjective Vehicle Routing Problem With Time Windows","221007975":"Introducing a robust and efficient stopping criterion for MOEAs","220741732":"Improving EA-based design space exploration by utilizing symbolic feasibility tests","47843222":"Don\u0027t be greedy when calculating hypervolume contributions","226803915":"Hybrids of Constructive Metaheuristics and Constraint Programming: A Case Study with ACO","224133139":"The r-Dominance: A New Dominance Relation for Interactive Evolutionary Multicriteria Decision Making","220119116":"Particle swarm optimisation of interplanetary trajectories from Earth to Jupiter and Saturn","265274011":"Reducing the Complexity of Multi-Objective Water Distribution System Optimization Through Global Sensitivity Analysis","210205139":"Computing Hypervolume Contributions in Low Dimensions: Asymptotically Optimal Algorithm and Complexity Results","223184920":"Performance evaluation of efficient multi-objective evolutionary algorithms for design space exploration of embedded computer systems","225581095":"Evolutionary Multiobjective Route Planning in Dynamic Multi-hop Ridesharing","257153541":"MOEA/D + uniform design: A new version of MOEA/D for optimization problems with many objectives","242823982":"Decomposition-Based Memetic Algorithm for Multi-Objective Capacitated Arc Routing Problem","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","283616700":"An Efficient and Universal Conical Hypervolume Evolutionary Algorithm in Three or Higher Dimensional Objective Space","220887158":"Why Unary Quality Indicators Are Not Inferior to Binary Quality Indicators","47843204":"Multiplicative Approximations and the Hypervolume Indicator","273898764":"A survey on handling computationally expensive multiobjective optimization problems using surrogates: non-nature inspired methods","288932952":"Enhancing the ϵ-constraint method through the use of objective reduction and random sequences: application to environmental problems","281292197":"Sensitivity of Algorithm Parameters and Objective Function Scaling in Multi-Objective Optimisation of Water Distribution Systems","258163201":"Fast calculation of multiobjective probability of improvement and expected improvement criteria for Pareto optimization","281413027":"Indicator Based Ant Colony Optimization for Multi-objective Knapsack Problem","261722879":"Multi-objective ant colony optimization for the twin-screw configuration problem","220739652":"Scale Invariant Pareto Optlmallty a meta-formalism for characterizing and modeling cooperativity in evolutionary systems","220741700":"An informed convergence accelerator for evolutionary multiobjective optimiser","225355779":"Population-Based Incremental Learning for Multiobjective Optimisation","225611804":"Hybridizations of Metaheuristics With Branch \u0026 Bound Derivates","224317486":"Multiobjective Groundwater Management Using Evolutionary Algorithms","261311211":"Mesh simplification for 3D modeling using evolutionary multi-objective optimization","279223772":"An Airway Network Flow Assignment Approach Based on an Efficient Multiobjective Optimization Framework","264387256":"Multiobjective Estimation of Distribution Algorithm Based on Joint Modeling of Objectives and Variables","225566730":"Evolutionary Multiobjective Design of Fuzzy Rule-Based Classifiers","273329457":"Interval-based ranking in noisy evolutionary multi-objective optimization","221007953":"A new transgenetic approach for the biobjective spanning tree problem.","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","269292914":"Clustering-based Selection for Evolutionary Multi-objective Optimization","220852393":"Approximating the Pareto Front of Multi-criteria Optimization Problems","282410324":"Improving multi-objective reservoir operation optimization with sensitivity-informed dimension reduction","259515122":"Resource allocation model and double-sphere crowding distance for evolutionary multi-objective optimization","290731225":"Effect of SMS-EMOA Parameterizations on Hypervolume Decreases","273948122":"The Generalized Consistent Vehicle Routing Problem","223074500":"Orthogonal simulated annealing for multiobjective optimization","235355026":"Sets of interacting scalarization functions in local search for multi-objective combinatorial optimization problems","4074923":"A simplified artificial life model for multiobjective optimisation: A preliminary report","220741821":"Graph-based sequence clustering through multiobjective evolutionary algorithms for web recommender systems","257153732":"BSTBGA: a hybrid genetic algorithm for constrained multi-objective optimization problems. Comput Oper Res","221139127":"Alleviate the Hypervolume Degeneration Problem of NSGA-II.","262425150":"Optimized task scheduling and resource allocation on cloud computing environment using improved differential evolution algorithm","285582494":"Steady State IBEA Assisted by MLP Neural Networks for Expensive Multi-Objective Optimization Problems","29637720":"Métaheuristiques pour le flow-shop de permutation bi-objectif stochastique","222681307":"Including different kinds of preferences in a multi-objective ant algorithm for time and space assembly line balancing on different Nissan scenarios","220121279":"Hybrid Population-Based Algorithms for the Bi-Objective Quadratic Assignment Problem","259523289":"Hybrid Taguchi-Based Particle Swarm Optimization for Flowshop Scheduling Problem","281328997":"Shake them all! Rethinking Selection and Replacement in MOEA/D","224309500":"A Fast Incremental Hypervolume Algorithm","271472012":"Hybrid MPI-OpenMP parallel optimization for thermo-fluid problems","273524207":"Priority based dominance: A new measure in multiobjective optimization","220493959":"SMS-EMOA - Effektive evolutionäre Mehrzieloptimierung (SMS-EMOA - Effective Evolutionary Multiobjective Optimization).","220215427":"The mean-variance cardinality constrained portfolio optimization problem: An experimental evaluation of five multiobjective evolutionary algorithms","220338310":"Overfitting cautious selection of classifier ensembles with genetic algorithms","259523293":"A hybrid metaheuristic for multiobjective unconstrained binary quadratic programming","223561974":"Pareto memetic algorithm with path relinking for bi-objective traveling salesperson problem. Eur J Oper Res","286528701":"Finding Evenly Spaced Pareto Fronts for Three-Objective Optimization Problems","23997637":"A Generic Multi-dimensional Feature Extraction Method Using Multiobjective Genetic Programming","271003019":"A multi-population cooperative coevolutionary algorithm for multi-objective capacitated arc routing problem","280554772":"A Fast Strength Pareto Evolutionary Algorithm Incorporating Predefined Preference Information","281050478":"A feature-based performance analysis in evolutionary multiobjective optimization","261202465":"Multi co-objective evolutionary optimization: Cross surrogate augmentation for computationally expensive problems","260692536":"Multiobjective Time Series Matching for Audio Classification and Retrieval","220741790":"A co-evolutionary hybrid algorithm for multi-objective optimization of gene regulatory network models","224329960":"Solution Diversity in Multi-Objective Optimization: A Study in Virtual Reality","272031116":"MOEA/D with uniform decomposition measurement for many-objective problems","258757335":"Evolutionary multiobjective optimization in water resources: The past, present, and future","261120557":"An algorithm for calculating the hypervolume contribution of a set","222048386":"A multiobjective immune algorithm based on a multiple-affinity model","260039360":"A Survey of Multi-Objective Sequential Decision-Making","38092676":"Increasing the production accuracy of profile bending with methods of computational intelligence","221008109":"Hyperheuristic codification for the multi-objective 2D Guillotine Strip Packing Problem","4375942":"Uniformity Assessment for Evolutionary Multi-Objective Optimization","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","282400016":"Multiobjective optimization of expensive-to-evaluate deterministic computer simulator models","38092672":"Statistical Methods for Convergence Detection of Multi-Objective Evolutionary Algorithms","220741870":"Automatic configuration of state-of-the-art multi-objective optimizers using the TP+PLS framework","260543040":"Automatic colonic polyp detection using multiobjective evolutionary techniques - art. no. 61445E","251978447":"Improved Vector Evaluated Genetic Algorithm with Archive for Solving Multiobjective PPS Problem","261300828":"A Possibilistic Framework for Solving Multi-objective Problems under Uncertainty: Definition of New Pareto Optimality","4375953":"A New Technique for Assessing the Diversity of Close-Pareto-Optimal Front","220170442":"Multi-Objective Approaches to Optimal Testing Resource Allocation in Modular Software Systems","257432206":"Multi-objective ant colony optimization based on decomposition for bi-objective traveling salesman problems","272037344":"Bi-objective hypervolume-based Pareto optimization","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","266293761":"CoBRA: A Coevolutionary Meta-heuristic for Bi-level Optimization","282195249":"Preference Articulation by Means of the R2 Indicator","40906642":"Computing Gap Free Pareto Front Approximations with Stochastic Search Algorithms","278717823":"Automatically Improving the Anytime Behaviour of Multiobjective Evolutionary Algorithms","249672453":"Adding diversity to a Multiobjective Ant Colony algorithm for time and Space Assembly Line Balancing","278318450":"Metaheuristics for Biobjective Flow Shop Scheduling","262249031":"An Approach to Instantly Use Single-objective Results for Multi-objective Evolutionary Combinatorial Optimization","226222236":"Hybrid Metaheuristics for Multi-objective Combinatorial Optimization","236946424":"Combining multicriteria analysis and tabu search for dial-a-ride problems","4074967":"Evolutionary many-objective optimisation: an exploratory analysis","220887232":"A Set of Test Cases for Performance Measures in Multiobjective Optimization","261460603":"Space trajectory design: Analysis of a real-world many-objective optimization problem","262316620":"A note on the ∈-indicator subset selection","224190638":"On Optimizing a Demand Responsive Transport with an Evolutionary Multi-Objective Approach","224190639":"An Evolutionary Multi-objective Approach for Speed Tuning Optimization with Energy Saving in Railway Management","260027019":"Multi-objective evolutionary algorithms for fuzzy classification in survival prediction","262316631":"Refined ranking relations for multi objective optimization andapplication to P-ACO","220901597":"On the Design of ACO for the Biobjective Quadratic Assignment Problem","4375995":"Convergence Properties of E-Optimality Algorithms for Many Objective Optimization Problems","220901584":"Solving a Bi-objective Flowshop Scheduling Problem by Pareto-Ant Colony Optimization","221008086":"Delta-V genetic optimisation of a trajectory from Earth to Saturn with fly-by in Mars","228622427":"Evolutionary multi-objective optimization and its use in finance","286883045":"Adaptive IDEA for Robust Multiobjective Optimization. Application to the r-TSALBP-m/A","220105502":"Multiobjective differential evolution for scheduling workflow applications on global grids. Concurrency Comput-Pract Exp","257403222":"Investigating technical trading strategy via an multi-objective evolutionary platform","224645985":"The Particle Swarm Interval Rule Optimizer with an Application to Drug Design Data","221006639":"Comparing PSO and NSGA II for the biobjective Oil Derivatives Distribution Problem","266082783":"Novel multi-objective optimization algorithm","261030283":"Multiplicative Approximations, Optimal Hypervolume Distributions, and the Choice of the Reference Point","290742099":"Effect of Dominance Balance in Many-Objective Optimization","221547324":"Optimum Design of Balanced SAW Filters Using Multi-Objective Differential Evolution.","224904046":"A Multiobjective Ant Colony Optimization Algorithm for the 1/3 Variant of the Time and Space Assembly Line Balancing Problem","2557485":"A Tutorial on Evolutionary Multiobjective Optimization","221608766":"Self-adaptation Techniques Applied to Multi-Objective Evolutionary Algorithms.","227414915":"A software framework based on a conceptual unified model for evolutionary multiobjective optimization: ParadisEO-MOEO","1885715":"Novel Algorithm to Calculate Hypervolume Indicator of Pareto Approximation Set","220701495":"Functional-Specialization Multi-Objective Real-Coded Genetic Algorithm: FS-MOGA","224904055":"An advanced multi-objective genetic algorithm design for the time and space assembly line balancing problem","224646002":"Multiobjective Multistatic Sonar Sensor Placement","224904054":"Multi-objective constructive heuristics for the 1/3 variant of the time and space assembly line balancing problem: ACO and random greedy search","290254685":"An Alternative Preference Relation to Deal with Many-Objective Optimization Problems","216300272":"Hypervolumen-basierte Selektion in einem evolutionären Algorithmus zur Mehrzieloptimierung","221547297":"A Hybrid of Differential Evolution and Genetic Algorithm for Constrained Multiobjective Optimization Problems.","243970205":"Towards Efficient Multiobjective Optimization: Multiobjective statistical criterions","225362809":"Combination of Genetic Algorithms and Evolution Strategies with Self-adaptive Switching","26648460":"Lecture Notes in Computer Science","271629868":"Multiobjective evolutionary algorithm based on decomposition for 3-objective optimization problems with objectives in different scales","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","224904057":"Multiobjective memetic algorithms for time and space assembly line balancing","265470412":"MOEA/D with opposition-based learning for multiobjective optimization problem","263074225":"Speed Up Reliability Model Optimization With Hypervolume Contribution Calculating Algorithm","221477676":"Shipper Decision Support for the Acceptance of Bids during the Procurement of Transport Services","221008652":"A two-phase evolutionary algorithm for multiobjective mining of classification rules","288931608":"Preference Driven Multi-Objective Optimisation Design Procedure for Industrial Controller Tuning","224301951":"Iterative approach to indicator-based multiobjective optimization","259926367":"Constrained multiobjective designs for functional magnetic resonance imaging experiments via a modified non-dominated sorting genetic algorithm","221008648":"A Subproblem-dependent Heuristic in MOEA/D for the Deployment and Power Assignment Problem in Wireless Sensor Networks","267870687":"Refined Ranking Relations for Selection of Solutions in Multi Objective Metaheuristics","277253806":"Hierarchical High-Level Synthesis Design Space Exploration with Incremental Exploration Support","221006597":"A novel hybrid evolutionary strategy and its periodization with multi-objective genetic optimizers","220742401":"Constraint handling with modified hypervolume indicator for multi-objective optimization problems.","262220170":"Multi-directional local search","221977360":"Asynchronous Master-Slave Parallelization of Differential Evolution for Multi-Objective Optimization","249071863":"An Analysis of the Effect of Multiple Layers in the Multi-Objective Design of Conducting Polymer Composites","226505648":"An Introduction to Multi-Objective Evolutionary Algorithms and Some of Their Potential Uses in Biology","290852708":"Difficulties in specifying reference points to calculate the inverted generational distance for many-objective optimization problems","225573698":"Rough Sets Theory for Multi-Objective Optimization Problems","271830535":"An evolutionary approach for multi-objective vehicle routing problems with backhauls","274263660":"Probabilistic Dominance in Multiobjective Reliability-Based Optimization: Theory and Implementation","254320926":"A statistical model-based algorithm for ‘black-box’ multi-objective optimisation","280751757":"A Multiobjective Memetic Algorithm for Solving the Carsharing Problem","4075017":"Multi-objective genetic algorithms for courses of action planning","236658723":"A Comparative Study of Multi-objective Evolutionary Algorithms to Optimize the Selection of Investment Portfolios with Cardinality Constraints","259170632":"A simulated annealing for multi-criteria optimization problem: DBMOSA","245586072":"Optimisation Combinatoire Multi-Objectif : Apport des Methodes cooperatives et contribution a l\u0027optimisation multi-objectif","264827383":"Distributed Localized Bi-objective Search","221608821":"On the Distribution of EMOA Hypervolumes","220701540":"Path-Guided Mutation for Stochastic Pareto Local Search Algorithms","267971004":"APPROACHES TO MULTI-OBJECTIVE MULTI-TIER OPTIMIZATION IN URBAN DRAINAGE PLANNING","225878834":"Differential Evolution versus Genetic Algorithms in Multiobjective Optimization","220740461":"Pattern identification in Pareto-set approximations","227427275":"Berth Scheduling by Customer Service Differentiation: A Multi-Objective Approach","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","238184565":"An Efficient Pareto Set Identification Approach for Multi-Objective Optimization on Black-Box Functions","264002043":"Application of Cognitive Techniques to Network Management and Control","275260960":"A multiobjective model and evolutionary algorithms for robust time and space assembly line balancing under uncertain demand","224301847":"Indicator-based multi-objective local search","235745345":"Developing Parsimonious and Efficient Algorithms for Water Resources Optimization Problems","225624893":"Optimal k-Level Planarization and Crossing Minimization","221008765":"A multiobjective variant of the Subdue graph mining algorithm based on the NSGA-II selection mechanism","253755763":"An Ant Colony Optmisation (ACO) based deployment optimisation strategy","262169075":"A Strategy to Solve MaOPs with Multiple Swarms Based on Broadcast Communication","259150119":"Computational Logistics","220701553":"A High Performance Multi-objective Evolutionary Algorithm Based on the Principles of Thermodynamics.","51967311":"Quantum Control Experiments as a Testbed for Evolutionary\nMulti-Objective Algorithms","229176305":"A multi-objective approach for the segmentation issue","262107590":"Model ensemble for the simulation of plankton community dynamics of Lake Kinneret (Israel) induced from in situ predictor variables by evolutionary computation","229176306":"Initialization procedures for multiobjective evolutionary approaches to the segmentation issue","222833449":"Obtaining transparent models of chaotic systems with multi-objective simulated annealing algorithms","221608788":"Multi-Objective Optimization with an Adaptive Resonance Theory-Based Estimation of Distribution Algorithm: A Comparative Study.","228912070":"Handling Uncertainty in Indicator-Based Multiobjective Optimization","222133086":"Multi-objective optimization for inventory control in two-level assembly systems under uncertainty of lead times","266604928":"The Application of Nature-Inspired Nest Building to Wireless Site Selection","265908668":"On the Impact of Multiobjective Scalarizing Functions","228819915":"Multiobjective optimisation of urban wastewater systems using ParEGO: a comparison with NSGA II","221608797":"MetaHybrid: Combining Metamodels and Gradient-Based Techniques in a Hybrid Multi-Objective Genetic Algorithm","241006647":"M\u0027etaheuristiques pour le flow-shop de permutation bi-objectif stochastique","254462273":"On the Properties of the R2 Indicator","237391958":"Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods","225614594":"Intuitive Visualization and Interactive Analysis of Pareto Sets Applied on Production Engineering System","51617123":"Reply from Authors re: Simon P. Kim, R. Houston Thompson. Competing-Risks Analysis for Renal Cell Carcinoma: How Do We Accurately Communicate the Risks and Benefits of Treatment to Patients? Eur Urol 2011;60:1160-2","49798279":"Multi-Objective Reliability-Based Optimization with Stochastic Metamodels","288073563":"Optimal averaged Hausdorff archives for bi-objective problems: theoretical and numerical results","239570995":"Operational Optimisation of Water Distribution Networks","265908652":"Local Optimal Sets and Bounded Archiving on Multi-objective NK-Landscapes with Correlated Objectives","221025114":"Lecture Notes in Computer Science","259197189":"Modeling and solving the bi-objective minimum diameter-cost spanning tree problem","220742481":"A pareto archive evolutionary strategy based radial basis function neural network training algorithm for failure rate prediction in overhead feeders","4279871":"A Fast Algorithm for Computing the Contribution of a Point to the Hypervolume","257313064":"On Optimizing a Bi-objective Flowshop Scheduling Problem in Uncertain Environment","220701528":"Path Relinking on Many-Objective NK-Landscapes","236095632":"A Scalable Memetic Algorithm for Simultaneous Instance and Feature Selection","40535273":"Neural learning methods for visual object detection","23648236":"Using support vector machines to learn the efficient set in multiple objective discrete optimization","24399858":"Objective Reduction in Evolutionary Multiobjective Optimization: Theory and Applications","239919307":"THERMO POWER GENERATION OPTIMIZATION","221006759":"Flock-based Evolutionary Multi-Agent System in Solving Noisy Multi-Objective Optimization Problems","253294995":"The Attainment-Function Approach to Stochastic Multiobjective Optimizer Assessment and Comparison","228633391":"Biobjective evolutionary and heuristic algorithms for intersection of geometric graphs","261110016":"Combining surrogate models and local search for dealing with expensive multi-objective optimization problems","221008825":"Improving hypervolume-based multiobjective evolutionary algorithms by using objective reduction methods","220289972":"Stochastic convergence of random search methods to fixed size Pareto front approximations","261120262":"Research on Performance Measures of Multi-objective Optimization Evolutionary Algorithms","277237265":"Product Configuration from a Mathematical Optimization Perspective","30519113":"Optimisation Combinatoire Multi-Objectif : Apport des méthodes coopératives et contribution à l\u0027extraction de connaissances","220740532":"A benchmark for quality indicators in multi-objective optimization.","215661127":"Graph partitioning by multi-objective real-valued metaheuristics: A comparative study","51692937":"Diagnostic Assessment of Search Controls and Failure Modes in Many-Objective Evolutionary Optimization","263469353":"A multiobjective cellular genetic algorithm based on 3D structure and cosine crowding measurement","278689282":"A Fast Local Search Approach for Multiobjective Problems","251875746":"Optimum synthesis of a four-bar mechanism using the modified bacterial foraging algorithm","262396162":"A Multi-objective Solution for Retrieving Class Diagrams","261230897":"An Elitist Polynomial Mutation Operator for Improved Performance of MOEAs in Computer Networks","224472004":"The Pareto-Following Variation Operator as An Alternative Approximation Model","266017149":"Programming by Optimisation","254503309":"Performance Indices for Multiobjective Distinct Candidates Optimization (MODCO)","233007940":"Pareto layer: Its formulation and search by way of evolutionary multi-objective optimization","221494171":"An Effective Dynamical Multi-objective Evolutionary Algorithm for Solving Optimization Problems with High Dimensional Objective Space","271730329":"Modified differential evolution algorithm using a new diversity maintenance strategy for multi-objective optimization problems","225393630":"GRACE: A Generational Randomized ACO for the Multi-objective Shortest Path Problem","257518058":"Evolutionary response surfaces for classification: an interpretable model. Appl Intell","228672276":"A study of Pareto and two-phase local search algorithms for biobjective permutation flowshop scheduling","291583959":"MH-MOEA: A New Multi-Objective Evolutionary Algorithm Based on the Maximin Fitness Function and the Hypervolume Indicator","228672285":"Towards the empirical analysis of SLS algorithms for multiobjective combinatorial optimization problems through experimental design","224301980":"Multi-objective strip packing using an evolutionary algorithm","270898913":"Annealing-Pareto Multi-Objective Multi-Armed Bandits Algorithm","261038411":"A scalability study of multi-objective particle swarm optimizers","287201243":"Approximative Pareto Front Identification","224224152":"Multi-fidelity simulation modelling in optimization of a submarine propulsion system","254222817":"An Enhanced MOGWW for the bi-objective Quadratic Assignment Problem","267555128":"Multi-Objective Evolutionary Algorithms for Vehicle Routing Problems","220199890":"Multi-objective energy-efficient dense deployment in Wireless Sensor Networks using a hybrid problem-specific MOEA/D","267551039":"Performance of multi-objective algorithms on varying test problem features using the WFG toolkit","4353679":"A New Key Exchange Scheme Based on Chebyshev Polynomials","228858731":"Exploratory Analysis of Stochastic Local Search Algorithms in Biobjective Optimization","221006819":"Comparison of multiobjective evolutionary algorithms for solving the multiobjective route planning in dynamic multi-hop ridesharing","221006844":"Constraint handling in multi-objective evolutionary optimization","260010415":"A Comparative Performance Assessment of a Set of Multiobjective Algorithms for Constrained Portfolio Assets Selection","220265458":"Metamodels for Fast Multi-objective Optimization: Trading Off Global Exploration and Local Exploitation","221006840":"On convergence of multi-objective Particle Swarm Optimizers.","220265463":"Modeling and Optimization of the Specificity in Cell Signaling Pathways Based on a High Performance Multi-objective Evolutionary Algorithm.","224256901":"A new approach to handle high dimensional and large datasets in multi-objective evolutionary fuzzy systems","220290043":"Evolving better population distribution and exploration in evolutionary multi-objective optimization","262353272":"Optimization of a supersonic airfoil using the multi-objective alliance algorithm","265408780":"Techniques to Deal with Many-objective Optimization Problems Using Evolutionary Algorithms","224301953":"Ranking-Dominance and Many-Objective Optimization","253282808":"Alma Mater Studiorum - Universitµa di Bologna","262781261":"An Investigation of Generalized Differential Evolution Metaheuristic for Multiobjective Optimal Crop-Mix Planning Decision","220701646":"Objective Space Partitioning Using Conflict Information for Many-Objective Optimization.","283129353":"Multi-objective optimization for rapid and robust optimal oilfield development under geological uncertainty","277401186":"A hybrid multi-objective PSO algorithm with local search strategy for VLSI partitioning","263586138":"R 2 Indicator-Based Multiobjective Search","220742597":"Comparison of Similarity Measures for the Multi-Objective Vehicle Routing Problem with Time Windows","258656647":"Local Descent Direction Vector Based Differential Evolution for Multiobjective Optimization","24033153":"Optimizing computer-aided colonic polyp detection for CT colonography by evolving the Pareto front","225760134":"Multi-objective Expansion Planning of Electrical Distribution Networks Using Comprehensive Learning Particle Swarm Optimization","220701651":"Multi-Objective Equivalent Random Search","278797930":"What makes an instance difficult for black-box 0-1 evolutionary multiobjective optimizers?","256938406":"An improved multi-objective differential evolution with a termination criterion for optimizing chemical processes","228967261":"Quality assessment of multiobjective optimisation algorithms in component deployment","261040503":"Multi-objective Optimization Evolutionary Algorithm Based on Point-to-Weight Method","280626752":"Confronting Tipping Points: Can Multi-objective Evolutionary Algorithms Discover Pollution Control Tradeoffs Given Environmental Thresholds?","229614420":"Process Planning and Scheduling in Distributed Manufacturing System Using Multiobjective Genetic Algorithm","254302677":"An Object-oiented Framework with Multi-objective Cellular Evolutionary Algorithm for Service Restoration of Shipboard Power Networks","237009117":"Time Complexity and Zeros of the Hypervolume Indicator Gradient Field","221006380":"Generalization of HSO algorithm for computing hypervolume for multiobjective optimization problems","261062795":"Generalized Multiobjective Evolutionary Algorithm Guided by Descent Directions","259995769":"Bi-objective optimization of drayage operations in the service area of intermodal terminals","224645738":"Particle Swarm Optimization for the Bi-objective Degree constrained Minimum Spanning Tree","254017581":"Multi-objective Variable Neighborhood Search algorithms for a just-in-time single machine scheduling problem","283811811":"Toward a More Realistic, Cost-Effective, and Greener Ground Movement Through Active Routing—Part I: Optimal Speed Profile Generation","221340219":"Robust non-preemptive hard real-time scheduling for clustered multicore platforms","257196127":"The Development of a Multi-Objective Tabu Search Algorithm for Continous Optimisation Problems","28358332":"ICSPEA","224399980":"A fair comparison of representations, operators and algorithms for the sugarcane harvest problem","41786737":"Efficient Covariance Matrix Update for Variable Metric Evolution Strategies","261273758":"Reference point-based search scheme for multiobjective evolutionary algorithm","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","273610561":"Application of Hybrid MOPSO Algorithm to Optimal Reactive Power Dispatch Problem Considering Voltage Stability","281753563":"Solving the multi-objective path planning problem in mobile robotics with a firefly-based approach","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","202255127":"The Multi-objective Variable Metric Evolution Strategy, Part I","221006389":"Constraint handling procedure for multiobjective particle swarm optimization","271933231":"A multi-objective approach for a project scheduling problem with due dates and temporal constraints infeasibilities","260477094":"Scalarization based Pareto optimal set of arms identification algorithms","262211715":"A New Multi-Objective Evolutionary Algorithm Based on a Performance Assessment Indicator","256721007":"A scalable approach to simultaneous evolutionary instance and feature selection","256721000":"Comparison of design concepts in multi-criteria decision-making using level diagrams","262959241":"Acceleration of Solving the Dynamic Multi-Objective Network Design Problem Using Response Surface Methods","226140764":"On the Velocity Update in Multi-Objective Particle Swarm Optimizers","221581849":"Performance Measures for Dynamic Multi-Objective Optimization","261052579":"A Study on Optimizing Execution Time and Code Size in Iterative Compilation","268157142":"Large-scale parallelization of the Borg multiobjective evolutionary algorithm to enhance the management of complex environmental systems","258226262":"A nonparametric approach using artificial intelligence in vibration and noise reduction of flexible systems","224645719":"Evolutionary Multiobjective Ensemble Learning Based on Bayesian Feature Selection","221024792":"Introduction to Evolutionary Multiobjective Optimization","232946390":"Supporting the selection of robust engineering concepts under suppliers related uncertainties","224330345":"Order of Nonlinearity as a Complexity Measure for Models Generated by Symbolic Regression via Pareto Genetic Programming","3421955":"Grid Implementation of a Parallel Multiobjective Genetic Algorithm for Optimized Allocation of Chlorination Stations in Drinking Water Distribution Systems: Chojnice Case Study","272408331":"Generic Constraints Handling Techniques in Constrained Multi-criteria Optimization and its Application","228817566":"Multi-objective Evolutionary Design of Robust Controllers on the Grid⋆","224258658":"Assessing Visual Quality of 3-D Polygonal Models","222308864":"Multi-objective decision analysis for competence-oriented project portfolio selection","277696459":"Interactive Approaches Applied to Multiobjective Evolutionary Algorithms","228453079":"Optimización de problemas multi-objetivo de empaquetado de palets mediante algoritmos evolutivos","220637805":"A Comparison of three evolutionary strategies for multiobjective genetic programming","224190999":"MOEA/D-DRA with two crossover operators","38077704":"Multiobjective Optimization of Temporal Processes","237148524":"Application of Swarm Intelligence Techniques to the Design of Analog Circuits: Evaluation and Comparison","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","220742266":"A new proposal for multi-objective optimization using differential evolution and rough sets theory","265330819":"EVOLVE – A bridge between probability, set oriented numerics, and evolutionary computation III. Selected papers based on the presentations at the international conference, Mexico City, Mexico, August 7–9, 2012","226202147":"Recent Developments in Evolutionary Multi-Objective Optimization","23162427":"On the Suitability of Different Representations of Solid Catalysts for Combinatorial Library Design by Genetic Algorithms","220742259":"A stopping criterion based on Kalman estimation techniques with several progress indicators","225876523":"An Introduction to Multiobjective Metaheuristics for Scheduling and Timetabling","230660832":"Ant Colony Optimization and Swarm Intelligence: 4th International Workshop, ANTS 2004","281329563":"Experiments on Local Search for Bi-objective Unconstrained Binary Quadratic Programming","273749809":"Opposition-Based Multiple-Objective Differential Evolution to Solve the Time–Cost–Environment Impact Trade-Off Problem in Construction Projects","251179420":"Static MOSD","4939564":"Evolutionary multi-objective optimization","1920886":"Metaheuristics and Their Hybridization to Solve the Bi-objective Ring Star Problem: a Comparative Study","222198355":"Design of mixed H2/H∞ control systems using algorithms inspired by the immune system","216300436":"Experiments on metaheuristics: methodological overview and open issues","220199533":"Fitness inheritance in multiple objective evolutionary algorithms: a test bench and real-world evaluation. Appl Soft Comput","220742234":"Evolutionary Multiobjective Optimization","224580118":"Convergence Acceleration Operator for Multiobjective Optimization","28358342":"Gradient-based/Evolutionary Relay Hybrid for Computing Pareto Front Approximations Maximizing the S-Metric","224580117":"Multiobjective Evolutionary Algorithm With Controllable Focus on the Knees of the Pareto Front","262219993":"Adapting Scientific Workflow Structures Using Multi-Objective Optimization Strategies","236327278":"D(2)MOPSO: MOPSO based on Decomposition and Dominance with Archiving using Crowding Distance in Objective and Solution Spaces.","220867157":"Microarray Biclustering: A Novel Memetic Approach Based on the PISA Platform","220883625":"Let the Ants Deploy Your Software - An ACO Based Deployment Optimisation Strategy","220541602":"Adaptive Multi-Objective Optimization Based on Nondominated Solutions.","273289158":"A novel crossover operator based on variable importance for evolutionary multi-objective optimization with tree representation","220742329":"Incorporating directional information within a differential evolution algorithm for multiobjective optimization","269309855":"Determining Integration and Test Orders in the Presence of Modularization Restrictions","265599047":"Dynamic Real-Time Substrate Feed Optimization of Anaerobic Co-Digestion Plants","225747680":"On the Effect of Applying a Steady-State Selection Scheme in the Multi-Objective Genetic Algorithm NSGA-II","221006521":"Multi-objective DE and PSO Strategies for Production Scheduling","273393629":"Multiobjective Reinforcement Learning: A Comprehensive Overview","262281274":"Coherent design methodology using modelling, simulation and optimisation","220867249":"A Memetic Algorithm for the Biobjective Minimum Spanning Tree Problem","48989559":"GRASP with Hybrid Path Relinking for Bi-Objective Winner Determination in Combinatorial Transportation Auctions","2830262":"No Free Lunch and Free Leftovers Theorems for Multiobjective Optimisation Problems","4327388":"Efficient symbolic multi-objective design space exploration","220289727":"Balancing exploration and exploitation with adaptive variation for evolutionary multi-objective optimization","243788071":"Analysis and applications of evolutionary multiobjective optimization algorithms","280063760":"MOEA/VAN: Multiobjective Evolutionary Algorithm Based on Vector Angle Neighborhood","261109809":"Improving an evolutionary multi-objective algorithm for the biclustering of gene expression data","224594625":"Correction to “A Fast Incremental Hypervolume Algorithm” [Dec 08 714-723]","224645825":"An Improved Dimension-Sweep Algorithm for the Hypervolume Indicator","224453315":"A unified model for evolutionary multi-objective optimization and its implementation in a general purpose software framework","241625541":"Finding evenly spaced fronts for multiobjective control via averaging Hausdorff-measure","221008520":"Two encoding schemes for a multi-objective Cutting Stock Problem","223087337":"A study of local search algorithms for the biobjective QAP with correlated flow matrices","241164792":"Quantum Dynamic Mechanism-based Multi-objective Evolutionary Algorithm and Performance Analysis","4116374":"Design of optimal complex spreading codes for DS-CDMA using an evolutionary approach","223697661":"A hybrid intelligent system for multiobjective decision making problems","285396649":"Multi-objective optimization of space station short-term mission planning","255883500":"Automatic Generation of Multi-objective ACO Algorithms for the Bi-objective Knapsack","262164494":"GAME: GPU accelerated multipurpose evolutionary algorithm library","220740249":"A multi-objective algorithm for DS-CDMA code design based on the clonal selection principle","269481918":"Multi-objective optimization of high speed vehicle-passenger catamaran by genetic algorithm: Part II Computational simulations","256721148":"A modification to MOEA/D-DE for multiobjective optimization problems with complicated Pareto sets","254462104":"GECCO 2012 tutorial on evolutionary multiobjective optimization","220867225":"A Preliminary Study on Handling Uncertainty in Indicator-Based Multiobjective Optimization","245326123":"Set-based concept selection in multi-objective problems: Optimality versus variability approach","221008539":"A nonlinear simplex search approach for multi-objective optimization","257552613":"Pareto Frontier of a Dynamic Principal–Agent Model with Discrete Actions: An Evolutionary Multi-Objective Approach","262768660":"Solution of optimal power flow using nondominated sorting multi objective gravitational algorithm","49282386":"Heuristics for Optimising the Calculation of Hypervolume for Multi-objective Optimisation Problems","224645854":"A Knowledge-Based Evolution Strategy for the Multi-Objective Minimum Spanning Tree Problem","269729709":"Efficient meta-heuristics based on various dominance criteria for a single-machine bi-criteria scheduling problem with rejection","227154507":"Multiobjective Evolutionary Search of Difference Equations-based Models for Understanding Chaotic Systems","262881385":"A multi-objective evolutionary approach for fuzzy optimization in production planning","262285414":"Single Machine Scheduling with Rejection: Minimizing Total Weighted Completion Time and Rejection Cost","257405074":"A multi-objective approach to the application of real-world production scheduling","259133623":"An efficient multi-objective evolutionary fuzzy system for regression problems","283903785":"The L-shape search method for triobjective integer programming","277722955":"Multi-Objective Optimization for Self-Adjusting Weighted Gradient in Machine Learning Tasks","266653730":"On set-based local search for multiobjective combinatorial optimization","260712514":"An Efficient Evolutionary Algorithm for Chance-Constrained Bi-Objective Stochastic Optimization","220469997":"Theoretical and practical fundamentals for multi-objective optimisation in resource-constrained project scheduling problems","224645800":"Fixture-scheduling for the Australian Football League using a Multi-Objective Evolutionary Algorithm","236011968":"Multi-Objective Reinforcement Learning using Sets of Pareto Dominating Policies","268075048":"Multiobjective evolutionary algorithm with a discrete differential mutation operator developed for service restoration in distribution systems","225315514":"G–Indicator: An M–Ary Quality Indicator for the Evaluation of Non–dominated Sets","4249493":"Super 14 Rugby Fixture Scheduling Using a Multi-Objective Evolutionary Algorithm","273393566":"An Architecture-Based Multi-Objective Optimization Approach to Testing Resource Allocation","260360285":"A survey on multi-objective evolutionary algorithms for many-objective problems","220170949":"Intelligent process planning methods for the manufacturing of moulds","221006583":"Methods for Decreasing the Number of Objective Evaluations for Independent Computationally Expensive Objective Problems","280237929":"Development of Pareto-based evolutionary model integrated withdynamic goal programming and successive linear objective reduction","260995152":"Objective space partitioning using conflict information for solving many-objective problems","273397675":"The Rolling Tide Evolutionary Algorithm: A Multiobjective Optimizer for Noisy Optimization Problems","237334983":"Analysis and Design of Stochastic Local Search Algorithms for the Multiobjective Traveling Salesman Problem","45868377":"Techniques for Highly Multiobjective Optimisation: Some Nondominated Points are Better than Others","264966184":"Transactions on Computational Science XXI. Special issue on innovations in nature-inspired computing and applications","257196223":"A Parallel Multiple Reference Point Approach for Multi-objective Optimization","51959027":"A GP-MOEA/D approach for modelling total electron content over Cyprus","220289741":"Portfolio optimization with an envelope-based multi-objective evolutionary algorithm","221008604":"Multi-objective mobile agent-based Sensor Network Routing using MOEA/D","290602662":"Towards a Framework for VM organisation based on Multi-Objectives","46255412":"Cultural-Based Multiobjective Particle Swarm Optimization","273000371":"Exploiting Multi–Objective Evolutionary Algorithms for Designing Energy–Efficient Solutions to Data Compression and Node Localization in Wireless Sensor Networks","224645780":"Co-Evolutionary Multi-Agent System with Sexual Selection Mechanism for Multi-Objective Optimization","221547213":"Infeasible Elitists and Stochastic Ranking Selection in Constrained Evolutionary Multi-objective Optimization","235790839":"Stochastic Pareto local search: Pareto neighbourhood exploration and perturbation strategies","45229385":"Improved step size adaptation for the MO-CMA-ES","236536290":"Quality Measures of Parameter Tuning for Aggregated Multi- Objective Temporal Planning","280721222":"Quantum computation based bundling optimization for combinatorial auction in freight service procurements","222814905":"Parallelization strategies for rapid and robust evolutionary multiobjective optimization in water resources applications","4227007":"Improving system level design space exploration by incorporating SAT-solvers into multi-objective evolutionary algorithms","271445970":"Multiobjective optimisation on a budget: Exploring surrogate modelling for robust multi-reservoir rules generation under hydrological uncertainty"},"index":544}