{"abs":"Anguilliform swimming has been investigated by using a computational model combining the dynamics of both the creature\u0027s movement and the two-dimensional fluid flow of the surrounding water. The model creature is self-propelled; it follows a path determined by the forces acting upon it, as generated by its prescribed changing shape. The numerical solution has been obtained by applying coordinate transformations and then using finite difference methods. Results are presented showing the flow around the creature as it accelerates from rest in an enclosed tank. The kinematics and dynamics associated with the creature\u0027s centre of mass are also shown. For a particular set of body shape parameters, the final mean swimming speed is found to be 0.77 times the speed of the backward-travelling wave. The corresponding movement amplitude envelope is shown. The magnitude of oscillation in the net forward force has been shown to be approximately twice that in the lateral force. The importance of allowing for acceleration and deceleration of the creature\u0027s body (rather than imposing a constant swimming speed) has been demonstrated. The calculations of rotational movement of the body and the associated moment of forces about the centre of mass have also been included in the model. The important role of viscous forces along and around the creature\u0027s body and in the growth and dissolution of the vortex structures has been illustrated.","title":"Self-propelled anguilliform swimming: Simultaneous solution of the two-dimensional Navier-Stokes equations and Newton\u0027s laws of motion","id":13477381,"url":"https://www.researchgate.net/publication/13477381_Self-propelled_anguilliform_swimming_Simultaneous_solution_of_the_two-dimensional_Navier-Stokes_equations_and_Newton\u0027s_laws_of_motion","names":["J Carling","TL Williams","G Bowtell","Journal of Experimental Biology"],"references":{"243765381":"Locomotion of fishes","279571021":"Modelling muscle power output in swimming fish","264474219":"Function of red axial muscle of carp (Cyprinus carpio L.) : Recruitment and normalised power output during swimming in different modes","13883771":"The three-dimensional hydrodynamics of tadpole swimming","13904925":"Computational fluid dynamic study of tadpole swimming","15054286":"Anguilliform Body Dynamics: Modelling the Interaction between Muscle Activation and Body Curvature","231912734":"Analysis of swimming three-dimensional plates","252177864":"Efficiency of energy conversion during sinusoidal movement of white muscle fibres from dogfish Scyliorhinus canicula","238242748":"Hydrodynamics and energetics of fish propulsion","13883778":"Fish foot prints: morphology and energetics of the wake behind a continuously swimming mullet (Chelon labrosus Risso)","239923418":"Fast-start performance and body form in seven species of Teleost fish","240271080":"Swimming in the Lamprey: Modeling the Neural Pattern Generation, the Body Dynamics and the Fluid Dyn","215930210":"The Feyman Lectures on Physics","233984942":"Fast continuous swimming of saithe (Pollachius virens): a dynamic analysis of bending moments and muscle power. J Exp Biol","238157709":"A Hydrodynamical Analysis of Fish Turning Manoeuvres","51992005":"“A Calculation Procedure for Heat, Mass and Momentum Transfer In Three-Dimensional Parabolic Flows”","14629762":"Interactions between muscle activation, body curvature and the water in the swimming lamprey. Symp. Soc. Exp. Biol., 49:49-59"},"citedIn":{"228712353":"Motion Control of a Three-Dimensional Eel-like Robot","12737732":"Large-amplitude undulatory fish swimming: Fluid mechanics coupled to internal mechanics","224441448":"Reduced Mean Model for Controlling a Three-Dimensional Eel-like Robot","3988533":"A new integrated array for multi-beam systems with application to millimeter imaging","224626025":"Design of a Spherical Wrist with Parallel Architecture: Application to Vertebrae of an Eel Robot","258791270":"Mesh adaptation for simulation of unsteady flow with moving immersed boundaries","11670433":"How the body contributes to the wake in undulatory fish swimming: Flow fields of a swimming eel (Anguilla anguilla)","222434897":"SPH simulations of swimming linked bodies","6168648":"Numerical simulations of undulatory swimming at moderate Reynolds number","228592311":"Swimming fish and fish-like models: the harmonic structure of undulatory waves suggests that fish actively tune their bodies","237741617":"Locomotion of articulated bodies in an ideal uid: 2d model with buoyancy, circulation and collisions","226005095":"Propulsive performance of a fish-like travelling wavy wall","223901560":"A block LU-SGS implicit unsteady incompressible flow solver on hybrid dynamic grids for 2D external bio-fluid simulations","258179138":"NUMERICAL MODELING AND EXPERIMENTAL INVESTIGATION OF A BIOLOGICALLY-INSPIRED UNDULATING MARINE PROPELLER","45635995":"On the self-displacement of deformable bodies in an ideal fluid","276025680":"Simulation, optimization and learning of artificial swimmers","221001480":"Using a genetic algorithm to optimize the gape of a snake jaw","45873809":"Locomotion and Control of a Self-Propelled Shape-Changing Body in a Fluid","247824617":"Computation of Self-Propelled Swimming in Larva Fishes","13068276":"A kinematic comparison of forward and backward swimming in the eel Anguilla anguilla","254821637":"Modelling the hydrodynamics of swimming fish, from individuals to infinite schools","228924819":"On the self-displacement of deformable bodies in a potential fluid flow","275461457":"Improved Lighthill fish swimming model for bio-inspired robots: Modeling, computational aspects and experimental comparisons","1898786":"Design of a Spherical Wrist with Parallel Architecture: Application to Vertebrae of an Eel Robot","11331475":"Hydrodynamics of caudal fin locomotion by chub mackerel, Scomber japonicus (Scombridae). J Exp Biol","228926439":"Poincaré-Cosserat equations for Lighthill three-dimensional dynamic model of a self propelled eel devoted to Robotics","245230815":"Dynamics of free straight swimming of angulla angulla including forward, braking and backward locomotion","284012203":"The three-dimensional hydrodynamics of thunniform swimming under self-propulsion","224342295":"Fast Dynamics of an Eel-Like Robot—Comparisons With Navier–Stokes Simulations","278812375":"Fast Dynamics of a three dimensional eel-like robot: comparisons with Navier-Stokes simulations","265239430":"UNSTEADY NAVIER-STOKES SIMULATION OF RAINBOW TROUT SWIMMING HYDRODYNAMICS","226082867":"Fish locomotion: Kinematics and hydrodynamics of flexible foil-like fins","37452148":"Review of \"The dynamics of legged locomotion: models, analysis, and challenges\" by Ph. Holmes, R. J. Full, D. Koditschek, and J. Guckenheimer, SIAM Rev. 48 (2006), no. 2, 207-304","10987255":"Force transmission via axial tendons in undulating fish: A dynamic analysis","6819129":"An elastic rod model for anguilliform swimming","273522206":"Gait and speed selection in slender inertial swimmers","226214958":"An Initial and Boundary Value Problem Modeling Fish-like Swimming","273640726":"Comparative numerical analysis of the flow pattern and performance of a foil in flapping and undulating oscillations","7204400":"Median fin function in bluegill sunfish Lepomis macrochirus: Streamwise vortex structure during steady swimming","29649049":"Fast Quadratic Local Meta-Models for Evolutionary Optimization of Anguilliform Swimmers","281329819":"Analyse théorique, analyse numérique et contrôle de systèmes d\u0027interaction fluide-structure et de systèmes de type ondes","276484635":"shapeAppendix","225776148":"Animal Locomotion","12917415":"Neuromuscular control: Introduction and overview","24398097":"Using computational fluid dynamics to calculate the stimulus to the lateral line of a fish in still water. Journal of Experimental Biology, 212(10), 1494-1505","49788315":"Mechanisms underlying rhythmic locomotion: Body-fluid interaction in undulatory swimming","224162609":"When Fish Moonwalk","271141209":"Propulsion velocity of a flapping wing at low Reynolds number","223723559":"Modelling anguilliform swimming at intermediate Reynolds number: A review and a novel extension of immersed boundary method applications","248563619":"Skin and Bones, Sinew and Gristle: the Mechanical Behavior of Fish Skeletal Tissues","226692854":"A Reconciliation of Viscous and Inviscid Approaches to Computing Locomotion of Deforming Bodies","51225973":"Experimental Hydrodynamics and Evolution: Function of Median Fins in Ray-finned Fishes","5395752":"Numerical investigation of the hydrodynamics of carangiform swimming in the transitional and inertial flow regimes","51225974":"Power Requirements of Swimming: Do New Methods Resolve Old Questions?","229369902":"Hydrodynamics of an oscillating articulated eel-like structure","242315254":"Revised manuscript submitted to Journal of Experimental Mechanics Special Issue on Locomotion A reconciliation of viscous and inviscid approaches to computing locomotion of deforming bodies","213772602":"Hydrodynamics of Undulatory Propulsion","253543829":"Flapping flexible fish. Periodic and secular body reconfigurations in swimming lamprey, Petromyzon marinus","260173576":"Body dynamics and hydrodynamics of swimming fish larvae: a computational study","216546914":"Simulations of single and multiple swimmers with non-divergence free deforming geometries","231927388":"Hydrodynamic Performance of Two-Dimensional Undulating Foils in Triangular Formation","258654459":"Simulation of self-propelled anguilliform swimming by local domain-free discretization method","272377517":"Strategies for swimming: explorations of the behaviour of a neuro-musculo-mechanical model of the lamprey","237264314":"Tadpole Locomotion: Axial Movement and Tail Functions in a Largely Vertebraeless Vertebrate","8629026":"Three Gray classics on the biomechanics of animal movement. J Exp Biol","222426083":"An immersed boundary method for smoothed particle hydrodynamics of self-propelled swimmers","227903795":"Undulatory fish swimming: From muscles to flow","222572002":"A new mathematical formulation and fast algorithm for fully resolved simulation of self-propulsion","29610084":"Locomotion of Deformable Bodies in an Ideal Fluid: Newtonian versus Lagrangian Formalisms","285421743":"Modeling and Simulation of a Fish-like Swimmer in an Ideal Flow with Lateral-line Flow Sensors","267104838":"Reinforcement Learning and Wavelet Adapted Vortex Methods for Simulations of Self-propelled Swimmers","237602695":"HABILITATION À DIRIGER LES RECHERCHES","264550250":"Hydrodynamics of locomotion in the squid Loligo pealei","11623427":"Computational hydrodynamics of animal swimming: boundary element method and three-dimensional vortex wake structure. Comp Biochem Physiol A 131:51","260023499":"Simulation of swimming of a flexible filament using the generalized lattice-spring lattice-Boltzmann method","45598978":"The Dynamics of Legged Locomotion: Models, Analyses, and Challenges","8598588":"Hydrodynamics of eel swimming. I. Wake structure","252399540":"Power Requirements of Swimming: Do New Methods Resolve Old Questions?1","220663704":"Poincar,-Cosserat Equations for the Lighthill Three-dimensional Large Amplitude Elongated Body Theory: Application to Robotics","254264472":"Hydrodynamics and Energy-Saving Swimming Techniques of Pacific Bluefin Tuna.","23963822":"Numerical investigation of the hydrodynamics of anguilliform swimming in the transitional and inertial flow regimes","225304750":"Optimization of anguilliform swimming","229300073":"Effects of geometric shape on the hydrodynamics of a self-propelled flapping foil","273834650":"Thrust producing mechanisms in ray-inspired underwater vehicle propulsion","29602570":"Locomotion of articulated bodies in an ideal fluid: 2d model with buoyancy, circulation and collisions","40193455":"Neuromuscular control : introduction and overview","264039542":"Simulation of forced deformable bodies interacting with two-dimensional incompressible flows: Application to fish-like swimming","51253212":"Experimental Hydrodynamics of Fish Locomotion: Functional Insights from Wake Visualization","224705201":"Feedback design for 3D movement of an Eel-like robot","224339594":"Multi-variable Constrained Control Approach for a Three-Dimensional Eel-like Robot","6937008":"Numerical model of self-propulsion in a fluid","12838690":"Locomotor forces on a swimming fish: Three-dimensional vortex wake dynamics quantified using digital particle image velocimetry. Journal of Experimental Biology, 202(18), 2393-2412","234090005":"Mechanics of Undulatory Swimming in a Frictional Fluid","222571945":"A versatile implicit iterative approach for fully resolved simulation of self-propulsion","227045989":"Thrust production by a mechanical swimming lamprey","271360735":"A study on flow physics of burst-and-coast swimming of koi carp (Cyprinus carpio koi) based on measurements and numerical simulations","272314312":"Locomotion of a flapping flexible plate","257440675":"Propulsive mechanism of forward and backward free swimming of angulla angulla*","227606638":"Numerical analysis on the propulsive performance and vortex shedding of fish-like traveling wavy plate"},"index":549}