{"abs":"The utilization of multiple fidelity simulators for the design and analysis of computer experiments has received increased attention in recent years. In this paper, we study the contour estimation problem for complex systems by considering two fidelity simulators. Our goal is to design a methodology of choosing the best suited simulator and input location for each simulation trial so that the overall estimation of the desired contour can be as good as possible under limited simulation resources. The proposed methodology is sequential and based on the construction of Gaussian process surrogate for the output measure of interest. We illustrate the methodology on a canonical queueing system and evaluate its efficiency via a simulation study.","title":"Contour estimation via two fidelity computer simulators under limited resources","id":257338146,"url":"https://www.researchgate.net/publication/257338146_Contour_estimation_via_two_fidelity_computer_simulators_under_limited_resources","names":["Ray-Bing Chen","Ying-Chao Hung","Weichung Wang","Sung-Wei Yen","Computational Statistics"],"references":{"265427282":"Bayesian design and analysis of computer experiments: Two examples","45904702":"A Computationally Stable Approach to Gaussian Process Interpolation of\nDeterministic Computer Simulation Data","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","46493894":"Uniform design over general input domains with applications to target region estimation in computer experiments","264857903":"Blind Kriging: A New Method for Developing Metamodels","228677353":"Multi-fidelity optimization via surrogate modelling","45870547":"Construction of nested space-filling designs","23804897":"Nested Maximin Latin Hypercube Designs","245893283":"Designs for Computer Experiments","2385583":"A Rigorous Framework for Optimization of Expensive Functions by Surrogates","31303344":"Predicting the Output from a Complex Computer Code When Fast Approximations Are Available","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","251729936":"Building Surrogate Models Based on Detailed and Approximate Simulations","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","228660404":"Bayesian Hierarchical Modeling for Integrating Low-Accuracy and High-Accuracy Experiments","228475851":"Limit Kriging","38363487":"The Design and Analysis of Computer Experiments","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","216756595":"Uniform Design: Theory and Application","216301661":"Screening, Predicting, and Computer Experiments","228917240":"Modeling, scheduling, and simulation of switched processing systems","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments"},"citedIn":{},"index":553}