{"abs":"In this article, we propose a nonparametric adaptive importance sampling (NAIS) algorithm to estimate rare event quantile. Indeed, Importance Sampling (IS) is a well-known adapted random simulation technique. It consists in generating random weighted samples from an auxiliary distribution rather than the distribution of interest. The optimization of this auxiliary distribution is often very difficult in practice. First, we review how to define the optimal auxiliary density of IS for quantile estimation in the general case and then propose a nonparametric method based on Gaussian kernel density estimator to approach the optimal auxiliary density that does not assume an initial PDF guess. This method is then finally applied to theoretical cases to demonstrate the efficiency of the proposed NAIS algorithm and on the quantile estimation of the temperature of a forest fire detection simulator.","title":"Extreme quantile estimation with nonparametric adaptive importance sampling","id":256080947,"url":"https://www.researchgate.net/publication/256080947_Extreme_quantile_estimation_with_nonparametric_adaptive_importance_sampling","names":["Jérôme Morio","Simulation Modelling Practice and Theory"],"references":{"3422256":"The importance of importance sampling","226250740":"Mean-squared error of kernel estimators for finite values of the sample size","45903285":"Quantile Estimation with Adaptive Importance Sampling","229384999":"A two-stage Subset Simulation-based approach for calculating the reliability of inelastic structural systems subjected to Gaussian random excitations","227624095":"Nonparametric Partial Importance Sampling for Financial Derivative Pricing","231080149":"Importance sampling: An illustrative introduction","1911433":"Controlled stratification for quantile estimation","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","222464350":"Approximating the Permanent via Importance Sampling with Application to the Dimer Covering Problem","268648348":"Transformations in Density Estimation","245865479":"Density Estimation for Statistics and Data Analysis, Chapman and Hall, New York","3885850":"Nonparametric adaptive importance sampling for rare event simulation","2837897":"Rare Event Estimation for Static Models via Cross-Entropy and Importance Sampling","224061436":"Splitting for Rare-Event Simulation","1925045":"Computationally Efficient Nonparametric Importance Sampling","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","230911856":"Introduction to importance sampling in rare-event simulations","243587760":"A Quantitative Model-Independent Method for Global Sensitivity Analysis of Model Output","244955309":"A First Course in Order Statistics","220286740":"Beta kernel quantile estimators of heavy-tailed loss distributions","245210913":"Application of spherical subset simulation method and auxiliary domain method on a benchmark reliability study","46103168":"Adaptive particle techniques and rare event estimation","222461568":"Optimization of computer simulation models with rare events. Eur J Oper Res","230663933":"An Introduction to Statistical Modeling of Extreme Values. Springer Series in Statistics XIV","223623709":"Onboard sensor orientation analysis with kriging method","29601545":"Rare event simulation for a static distribution","241736100":"A First Course in Order Statistics","231079689":"An overview of importance splitting for rare event simulation","38357892":"Statistical Inference Using Extreme Order Statistics","250693054":"Realistic and efficient reliability estimation for aerospace structures","284682912":"Subset simulation and its application to probabilistic seismic performance assessment","4771602":"All of Statistics: a Concise Course in Statistical Inference","243768924":"Transformations in Density Estimation: Rejoinder","243414233":"LETTERS AND COMMENTS: Importance sampling: how to approach the optimal density?","255061102":"Importance estimation in forward Monte Carlo calculations","222814884":"Application of line sampling simulation method to reliability benchmark problems","268209561":"M Carlo Statistical Methods","245079154":"Non-parametric adaptive importance sampling for the probability estimation of a launcher impact position","223944114":"Reliability-based design sensitivity by efficient simulation","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","254287814":"Nonparametric Importance Sampling","2484042":"The Cross-Entropy Method for Combinatorial and Continuous Optimization","261547897":"Compartment fire risk analysis by advanced Monte Carlo simulation","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","222402096":"Making best use of model evaluations to compute sensitivity indices. Comput Phys Commun","232819218":"A comparison of quantile estimators","222672830":"Benchmark study on reliability estimation in higher dimensions of structural systems – An overview"},"citedIn":{"236132338":"A Maximum Entropy Approach to Loss Distribution Analysis","281704632":"Recent Results on Nonparametric Quantile Estimation in a Simulation Model","263968877":"Nonparametric recursive quantile estimation","266943935":"A survey of rare event simulation methods for static input-output models","280310254":"Estimating the small failure probability of a nuclear passive safety system by means of an efficient Adaptive Metamodel-Based Subset Importance Sampling method","271603451":"Adaptive density estimation based on real and artificial data","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation"},"index":562}