{"abs":"The multi-objective covariance matrix adaptation evolution strategy (MO-CMA-ES) combines a mutation operator that adapts its search distribution to the underlying optimization problem with multi- criteria selection. Here, a generational and two steady-state selection schemes for the MO-CMA-ES are compared. Further, a recently pro- posed method for computationally ecient adaptation of the search dis- tribution is evaluated in the context of the MO-CMA-ES.","title":"Steady-State Selection and Efficient Covariance Matrix Update in the Multi-objective CMA-ES","id":221228555,"url":"https://www.researchgate.net/publication/221228555_Steady-State_Selection_and_Efficient_Covariance_Matrix_Update_in_the_Multi-objective_CMA-ES","names":["Christian Igel","Thorsten Suttorp","Nikolaus Hansen"],"references":{"235709965":"Evolutionsstrategie. Optimierung technischer Systeme nach Prinzipien der biolo-gi-schen Evolution","220375075":"Completely Derandomized Self-Adaptation in Evolution Strategies","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","220742254":"A computational efficient covariance matrix update and a (1+1)-CMA for evolution strategies","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","225922938":"Learning Probability Distributions in Continuous Evolutionary Algorithms - A Comparative Review","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","216301297":"Evolutionsstrategie: Optimierung Technischer Systeme Nach Prinzipien Der Bilogischen Evolution","220935678":"Solving Rotated Multi-objective Optimization Problems Using Differential Evolution","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","243786641":"Kalman filtering: theory and practice using MATLAB","220740848":"Multi-objective test problems, linkages, and evolutionary methodologies","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2527551":"The GENITOR Algorithm and Selection Pressure: Why Rank-Based Allocation of Reproductive Trials is Best","201976488":"Uniform Crossover in Genetic Algorithms","2605569":"PISA --- A Platform and Programming Language Independent Interface for Search Algorithms","221025610":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","220742531":"Rotated test problems for assessing the performance of multi-objective optimization algorithms","10710734":"Reducing the Time Complexity of the Derandomized Evolution Strategy with Covariance Matrix Adaptation (CMA-ES)","234811153":"Evolution and Optimum Seeking: The Sixth Generation","3411845":"Multi-Objective Optimization and Multiple Constraint Handling with Evolutionary Algorithms – Part II: A Unified Formulation","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","216457304":"Lecture Notes in Computer Science"},"citedIn":{"225199245":"Evolutionary multi-objective optimization: Some current research trends and topics that remain to be explored","40536137":"Optimierung von Fahrerassistenzsystemen","216301639":"On the Design of Optimisers for Surface Reconstruction ABSTRACT","221616470":"Improved compressed objective genetic algorithm: COGA-II","224330139":"Scalarization versus Indicator-based Selection in Multi-Objective CMA Evolution Strategies","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","221228548":"Recombination for Learning Strategy Parameters in the MO-CMA-ES.","41786737":"Efficient Covariance Matrix Update for Variable Metric Evolution Strategies","254461799":"Asynchronous Master/Slave MOEAs and Heterogeneous Evaluation Costs","48414194":"Lecture Notes in Computer Science","220741273":"Scaling up indicator-based MOEAs by approximating the least hypervolume contributor: A preliminary study","225747680":"On the Effect of Applying a Steady-State Selection Scheme in the Multi-Objective Genetic Algorithm NSGA-II","224190824":"System approach for multi-purpose representations of traffic scene elements","278379074":"Injecting CMA-ES into MOEA/D","259084900":"Speeding up many-objective optimization by Monte Carlo approximations","281884949":"Not all parents are equal for MO-CMA-ES","266656348":"A novel population-based multi-objective CMA-ES and the impact of different constraint handling techniques","237094200":"ETEA: A Euclidean Minimum Spanning Tree-Based Evolutionary Algorithm for Multi-Objective Optimization","271551733":"Active covariance matrix adaptation for multi-objective CMA-ES","45229385":"Improved step size adaptation for the MO-CMA-ES","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","221271214":"The logarithmic hypervolume indicator","221228592":"On the Effect of the Steady-State Selection Scheme in Multi-Objective Genetic Algorithms"},"index":566}