{"abs":"This paper introduces an efficient methodology for assessing the seismic risk of structural systems equipped with linear and nonlinear viscous damping devices while accounting for the uncertainties affecting both seismic input and model parameters. The proposed methodology employs a combination of efficient and accurate analytical and simulation techniques to estimate the probabilistic properties of the structural response under a seismic input modeled as a non-stationary stochastic process. The effectiveness of the proposed methodology is illustrated through a parametric study, with respect to the dampers’ properties, of the performance of two adjacent steel buildings connected by linear and nonlinear viscous dampers. The results of the study provide useful information regarding the accuracy of the approximations introduced by the proposed reliability assessment approach, and the effectiveness of the added dampers in reducing the system seismic risk.","title":"Performance-based seismic risk assessment for buildings equipped with linear and nonlinear viscous dampers","id":263464289,"url":"https://www.researchgate.net/publication/263464289_Performance-based_seismic_risk_assessment_for_buildings_equipped_with_linear_and_nonlinear_viscous_dampers","names":["Andrea Dall\u0027Asta","Michele Barbato","Enrico Tubaldi","Engineering Structures"],"references":{"229364267":"Closed-form solutions for the time-variant spectral characteristics of non-stationary random processes","227674705":"Dynamic systems with high damping rubber: Nonlinear behaviour and linear approximation","229737077":"Incremental dynamic analysis with consideration of modeling uncertainties","245304602":"Quantitative Comparison of Optimization Approaches for the Design of Supplemental Damping in Earthquake Engineering Practice","265280898":"Fragility curves for reinforced concrete highway overpass bridges","248843418":"Structural Reliability Applications of Nonstationary Spectral Characteristics","245077963":"Simultaneous stiffness-damping optimization of structures with respect to acceleration, displacement and base shear. Eng Struct","236154497":"Probabilistic performance assessment of low-ductility RC frames retrofitted with dissipative braces","229548540":"Limit states and failure mechanism of viscous dampers and implications for large earthquakes","245077839":"Seismic reliability analysis of hysteretic structure with viscoelastic dampers","243365972":"Spectral density of an oscillator with power law damping excited by white noise","229349309":"Performance measures and optimal design of linear structural systems under stochastic stationary excitation","263047733":"Structural Reliability Methods","258875766":"Dynamics Of Structures","273370323":"Discussion of “Quantitative Comparison of Optimization Approaches for the Design of Supplemental Damping in Earthquake Engineering Practice” by Robert Levy and Oren Lavan","245301830":"Stochastic Evaluation of Seismic Structural Performance","245077830":"Integrated optimum design of viscoelastically damped structural systems","251544483":"A comparison of deterministic, reliability-based and risk-based structural optimization under uncertainty","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","263657577":"Survival Probability Determination of Nonlinear Oscillators Subject to Evolutionary Stochastic Excitation","227663118":"HDR Devices for the Seismic Protection of Frame Structures: Experimental Results and Numerical Simulations","245305663":"Closure to “Quantitative Comparison of Optimization Approaches for the Design of Supplemental Damping in Earthquake Engineering Practice” by Robert Levy and Oren Lavan","254303178":"Seismic Reliability Analysis of Structures","237845321":"A probabilistic performance-based risk assessment approach for seismic pounding with efficient application to linear systems. Struct Saf 36-37:14-22","285381094":"Building Control with Passive Dampers: Optimal Performance-based Design for Earthquakes","223783728":"Reliability of linear structures with parameter uncertainty under non-stationary earthquake","229864724":"Non‐ergodicity and PEER\u0027s framework formula","238180501":"Seismic design of viscoelastic dampers for structural applications. J Struct Eng ASCE","230261841":"Nonlinear stochastic dynamic analysis for performance‐based earthquake engineering","241344587":"Supplemental Energy Dissipation: State-of-the-Art and State-of-the-Practice","247661546":"Structure-Specific Scalar Intensity Measures for Near-Source and Ordinary Earthquake Ground Motions","260498156":"Simulation of Stochastic Processes by Spectral Representation","225401475":"Stochastic optimum design criterion for linear damper devices for seismic protection of building. Struct Multidisc Optim","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","237845341":"A probabilistic performance-based approach for mitigating the seismic pounding risk between adjacent buildings","251516556":"On the reliability-based design of structures including passive energy dissipation systems","227977699":"Stochastic seismic analysis of MDOF structures with nonlinear viscous dampers","237845400":"New Analytical Solution of the First-Passage Reliability Problem for Linear Oscillators","275967429":"Random Vibration and Statistical Linearization","222791536":"The stochastic finite element method: Past, present and future. Comput Methods Appl Mech Eng","236154537":"Influence of Model Parameter Uncertainty on Seismic Transverse Response and Vulnerability of Steel-Concrete Composite Bridges with Dual Load Path","223436910":"Dynamic response of damper-connected adjacent buildings under earthquake excitation"},"citedIn":{"284206322":"Efficient Approach for the Reliability-Based Design of Linear Damping Devices for Seismic Protection of Buildings","281522398":"Influence of the nonlinear behavior of viscous dampers on the seismic demand hazard of building frames","276458147":"Smart damper using the combination of magnetic friction and pre-compressed rubber springs","283661713":"Intensity measures for seismic liquefaction hazard evaluation of sloping site","272100908":"Dynamic behavior of adjacent buildings connected by linear viscous/viscoelastic dampers"},"index":569}