{"abs":"This paper is concerned with the application of genetic algorithms to optimization problems over several real parameters. It is shown that k-point crossover (for k small relative to the number of parameters) can be viewed as a crossover operation on the vector of parameters plus perturbations of some of the parameters. Mutation can also be considered as a perturbation of some of the parameters. This suggests a genetic algorithm that uses real parameter vectors as chromosomes, real parameters as genes, and real numbers as alleles. Such an algorithm is proposed with two possible crossover methods. Schemata are defined for this algorithm, and it is shown that Holland\u0027s Schema theorem holds for one of these crossover methods. Experimental results are given that indicate that this algorithm with a mixture of the two crossover methods outperformed the binary-coded genetic algorithm on 7 of 9 test problems.","title":"Genetic Algorithms for Real Parameter Optimization","id":2485857,"url":"https://www.researchgate.net/publication/2485857_Genetic_Algorithms_for_Real_Parameter_Optimization","names":["Alden H. Wright"],"references":{"242356870":"Adaptation In Natural And Artificial Systems","201976495":"Adapting Operator Probabilities in Genetic Algorithm","220045412":"Adoption in Natural and Artificial System","2609278":"Dynamic Parameter Encoding for Genetic Algorithms","216301417":"Numerical Optimization of Computer Models","220885575":"Application of Genetic Algorithms in Chemometrics.","35578608":"An Analysis of the Behavior of a Class of Genetic Adaptive Systems","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","220885653":"A Study of Control Parameters Affecting Online Performance of Genetic Algorithms for Function Optimization.","220885701":"A New Interpretation of Schema Notation that Overtums the Binary Encoding Constraint."},"citedIn":{"228618660":"Generation of multiple cubic spiral paths for obstacle avoidance of a car-like mobile robot using the evolutionary search","229355951":"The differential ant-stigmergy algorithm","2291749":"Adaptive Global Optimization with Local Search","220313897":"Search Space Boundary Extension Method in Real-Coded Genetic Algorithms","237254189":"GA-fuzzy P2ID Control System for Flexible-joint Robot Arm","4085808":"Effect of SAC composition on soldering performance","220449074":"Evolutionary Computation and Its Applications in Neural and Fuzzy Systems","220866875":"Constrained Coverage Optimisation for Mobile Cellular Networks","4223057":"A combined LMS with RGA algorithm of the co-channel separation system","254230324":"Design optimization of cold-formed steel portal frames taking into account the effect of building topology","222415186":"A genetic algorithm for combined topology and shape optimisations","4275282":"Control of Modular Robot with Parameter Estimation Using Genetic Algorithms","252965639":"Neural networks and Genetic Algorithms for robust predictive controller","3810348":"A parabolic operator for parameter optimization problems","261085080":"The Content-Based Image Retrieval using the Pulse Coupled Neural Network","221579564":"Forward kinematics of the 3RPR planar parallel manipulators using real coded Genetic Algorithms","233395663":"In vitro quantification of the performance of model-based mono-planar and bi-planar fluoroscopy for 3D joint kinematics estimation","2626563":"A Study in Set Recombination","244994737":"Operating Rules for Multi-Reservoir Systems","259224414":"New State-of-the-art Results for Cassini2 Global Trajectory Optimization Problem","262250383":"Free Pattern Search for global optimization","3302429":"Comments on Theoretical analysis of evolutionary algorithms with an infinite population size in continuous space. I. Basic properties of selection and mutation [with reply]","224699733":"Estimating the Unmeasured Dynamics of Biological Systems using a Constrained Real-Coded Genetic Algorithm","226298187":"Genetic Algorithms and Scatter Search: Unsuspected Potentials","280721549":"447 - Tabu Search in Analytics and Computational Science","255651588":"Rigorous analysis and design of diffractive optical elements","258241372":"A New Genetic Algorithm for Solving Optimization Problem","242460233":"Design andanalysisof radiometric instrumentsusing high-levelnumerical modelsand geneticalgorithms","225120592":"A New Self-adaptative Crossover Operator for Real-Coded Evolutionary Algorithms","287035687":"Incorporating Genetic Algorithms in Transport Management","4235390":"Genetic algorithms-based method for disturbance attenuation in flight control systems","4089857":"Evaluating a hybrid encoding and three crossover operators on the constrained portfolio selection problem","223870231":"An empirical study of impact of crossover operators on the performance of non-binary genetic algorithm based neural approaches for classification","221008233":"GA with a new multi-parent crossover for solving IEEE-CEC2011 competition problems","220739950":"Targeted filter evolution for improved image reconstruction resolution","257831704":"An application of genetic algorithms with binary and real coding for approximate synthesis of suboptimal control in deterministic systems","2615407":"A Pareto Frontier for Full Stern Submarines via Genetic Algorithm","263977970":"WHAT CAUSES PERSISTENCE OF STOCK RETURN VOLATILITY? ONE POSSIBLE EXPLANATION WITH AN ARTIFICIAL STOCK MARKET","242669115":"A multiobjective discrete stochastic optimization approach to shared aquifer management: Methodology and application","277920989":"VizAssist: an interactive user assistant for visual data mining","238660215":"A Method for Utilizing Diploid/Dominance in Genetic Search World Conference on Computational Intelligence (1994) IEEE (pp. 439-444)","252231494":"Sources of Data on Freezing Rain and Resulting Damages","226152746":"Optimizing the Shape of an Impeller Using the Differential Ant-Stigmergy Algorithm","267777959":"A Generic Constraint Handling for Particle Swarm Optimization","13441179":"Self-Adaptation in Evolving Systems","4201494":"The use of a genetic algorithm to optimize the functional form of a multi-dimensional polynomial fit to experimental data","257722118":"Economic analysis of a hybrid solar-fuel cell power delivery system using tuned genetic algorithm","225495339":"On the use of energy minimization for CA based analysis in elasticity","3218543":"Optimized PWM Strategy Based on Genetic Algorithms","260088798":"A robust approach for multi-agent natural resource allocation based on stochastic optimization algorithms","2601031":"Real-Coded Adaptive Range Genetic Algorithm And Its Application to Aerodynamic Design","248876725":"Genetic Algorithms for the Calibration of Constitutive Models for Soils","233775502":"The Effect of Exploration on the Use of Producer-Scrounger Tactics","227890679":"Optimizing the reservoir operation rule curves by genetic algorithms. Hydrol Process","2772040":"Fuzzy Connectives Based Crossover Operators to Model Genetic Algorithms Population Diversity","285391206":"Computational Intelligence: Synergies of Fuzzy Logic, Neural Networks and Evolutionary Computing","5583923":"An Introduction to Simulated Evolutionary Optimization","220669249":"Direct Marketing Performance Modeling Using Genetic Algorithms","8569067":"Multi objective water resources systems analysis using genetic algorithms—application to Chou-Shui river basin Taiwan. J Water Sci Technol","222640431":"Multiobjective constrained optimal synthesis of planar mechanisms using a new evolutionary algorithm","228678096":"Particle Swarms and Nonextensive Statistics for Nonlinear Optimisation","223083833":"Are we modelling the right thing? The impact of incorrect problem specification in credit scoring","283886744":"Integrating Support Vector Regression and a geomorphologic Artificial Neural Network for daily rainfall-runoff modeling","267680640":"Confidence interval based crossover using a L 1 norm localization estimator for real-coded genetic algorithms","277295345":"Evolutionary Algorithms: Overview, Methods and Operators.” Documentation for: Genetic Evolutionary Algorithm Toolbox for Use with Matlab version: toolbox 1.92 documentation 1.92","223497515":"Recurrent fuzzy network design using hybrid evolutionary learning algorithms","277296381":"Abstract Fuzzy Sets and Systems 138 (2003) 381–398 Evolving two-dimensional fuzzy systems","220697949":"Optimizing the Shape of an Impeller Using the Differential Ant-Stigmergy Algorithm.","253161321":"Learning Linear Operators by Genetic Algorithms","284188815":"Playing Games with Genetic Algorithms: Application on Price-QoS Competition in Telecommunications Market","41903870":"EXPLORING THE RELATIONSHIP OF THE CLOSENESS OF A GENETIC ALGORITHM’S CHROMOSOME ENCODING TO ITS PROBLEM SPACE","239008444":"Real-coded genetic algorithm for Bragg grating parameter synthesis","228655395":"Simultaneous Due Date Assignment and Lot Sizing with Uncertain Flow Times","3243186":"Optimizing fiber Bragg gratings using a genetic algorithm with fabrication-constraint encoding","224073176":"Biomechanical properties and patterns of injury in the human cervical spine","1957015":"Genetic Algorithms and Quantum Computation","220176785":"A population-based algorithm-generator for real-parameter optimization","221048252":"Estimating the Difficulty Level of the Challenges Proposed in a Competitive e-Learning Environment","226708754":"Real-Coded Genetic Algorithm for Rule-Based Flood Control Reservoir Management","221008318":"Multiple solution search based on hybridization of real-coded evolutionary algorithm and Quasi-Newton method","228382991":"The NERO real-time video game","280043557":"A Unified Taxonomy of Hybrid Metaheuristics with Mathematical Programming, Constraint Programming and Machine Learning","2921652":"Chemical Genetic Algorithms --- Coevolution between Codes and Code Translation","224976368":"Detailed kinetic and chemometric study of the cellulose thermal breakdown in artificially aged and non aged commercial paper. Different methods for computing activation energy as an assessment model in archaeometric applications","2425017":"A Genetic Algorithm Tutorial","37243559":"Sélection et réglage de paramètres pour l\u0027optimisation de logiciels d\u0027ordonnancement industriel","242559722":"Solving Bus Terminal Location Problem Using Genetic Algorithm","224170493":"Diversity Improvement by Non-Geometric Binary Crossover in Evolutionary Multiobjective Optimization","254885779":"Interactive inversion in geosciences","3810456":"Seismic velocity inversion with genetic algorithms","216300615":"Experimentelle Analyse Evolutionärer Algorithmen auf dem CEC 2005 Testfunktionensatz","33819296":"Multiple criteria genetic algorithms in engineering design and operation /","257196017":"Genetic search over probability spaces","228618503":"A new genetic algorithm with arithmetic crossover to economic and environmental economic dispatch","260606758":"Thakur, M.: A new genetic algorithm for global optimization of multimodal continuous functions. J. Comput. Sci. 5, 298-311","6138093":"An Organizational Evolutionary Algorithm for Numerical Optimization","28292383":"CGO y COBLI: clasificadores oblícuos basados en algoritmos genéticos","275960003":"Development of an intelligent system to support compaction optimization of geomaterials in transportation network","220175789":"Sánchez AM. Hybrid crossover operators for real-coded genetic algorithms: an experimental study","282951790":"MLGA : A SAS Macro to Compute Maximum Likelihood Estimators via Genetic Algorithms","251403850":"A Real-coded Genetic Algorithm using the Unimodal Normal Distribution Crossover","4372730":"Improvement of the performance of distributed OS-CFAR system by (μ+λ)-ES optimisation","271496343":"Power system stabilizer design using real-coded genetic algorithm","12184579":"Symmetry axis computation for almost-Symmetrical and asymmetrical objects: Application to pigmented skin lesions","220677607":"Material characterization of composite laminates using dynamic response and real parameter-coded microgenetic algorithm","220558823":"Mean square error criteria to multiresponse process optimization by a new genetic algorithm","228659561":"High-dimensional real-parameter optimization using the differential ant-stigmergy algorithm","245126741":"Dimensional synthesis of adjustable path generation linkages using the optimal slider adjustment","224618926":"GA type IMC control for pneumatic servo system","248571422":"Optimal Scheduling of Urban Transit Systems Using Genetic Algorithms","222855559":"An inexact approach for linear programming problems with fuzzy objective and resources","12548205":"Model-based spectral estimation of Doppler signals using parallel genetic algorithms","44696185":"Investigation of Age-Related Changes in Physiological Kinetic Tremor","227173725":"Decision Strategies in Evolutionary Optimization","228571461":"\"Optimal\" mutation rates for genetic search","229540209":"A taxonomy for the crossover operator for real-coded genetic algorithms: an experimental study. Int. J. Intell. Syst. 18, 309-338","220743159":"A stigmergy-based algorithm for black-box optimization: noiseless function testbed","11957334":"Self-Adaptive Genetic Algorithms with Simulated Binary Crossover","11957335":"A Comparison Study of Self-Adaptation in Evolution Strategies and Real-Coded Genetic Algorithms","221905371":"Applications of the Differential Ant-Stigmergy Algorithm on Real-World Continuous Optimization Problems","228975943":"Discovering hierarchical decision rules with evolutive algorithms in supervised learning","261450611":"Evolving team tactics using potential fields","228733259":"Coello Coello, C.A.: Constraint-handling using an evolutionary multiobjective optimization technique. Civ. Eng. Environ. Syst. 17, 319-346","229441863":"Intelligent control for modeling of real time reservoir operation. Hydrol Process","220341704":"A novel select-best and prepotency evolution algorithm and its application to develop industrial oxidation reaction macrokinetic model","220249546":"Hybrid spectral gradient method for the unconstrained minimization problem","238698193":"EVOLUTIONÄRE ALGORITHMEN: IMPLEMENTATION UND ANWENDUNGEN IM ASSET-MANAGEMENT","242166403":"CARACTERIZACIÓN DINÁMICA DE YACIMIENTOS ESTRATIGRÁFICAMENTE COMPLEJOS USANDO ALGORITMOS GENÉTICOS","3663044":"Thermal power plant start-up scheduling with evolutionary computation by using an enforcement operator","255574978":"Solving the Integrated Corridor Control Problem Using Simultaneous Perturbation Stochastic Approximation","250692107":"A new parameter identification method of soft biological tissue combining genetic algorithm with analytical optimization","220147173":"Merging Nash Equilibrium Solution with Genetic Algorithm : The Game Genetic Algorithm.","225130896":"Evolutionary Optimization of Machining Processes","220313053":"Supervised learning by means of accuracy-aware evolutionary algorithms","262877012":"Evolutionary Computation in System Identification: Review and Recommendations","220741679":"Sampling Bias and Search Space Boundary Extension in Real Coded Genetic Algorithms.","222752833":"Evolutionary Algorithms Approach to the Solution of Mixed Integer Non-Linear Programming Problems","228556948":"Operations Research/Computer Science Interfaces Series","229865656":"Real Coded Genetic Algorithm Optimization of Long Term Reservoir Operation","223912022":"Spherical and ellipsoidal volcanic sources at Long Valley caldera, California, using genetic algorithm inversion technique","4939076":"Multiagent visual area coverage using a new genetic algorithm selection scheme","251707920":"Optimal selection for multiple quantitative trait loci and contributions of individuals using genetic algorithm","256733791":"Form-finding of tensegrity structures via genetic algorithm","220600372":"A multiobjective genetic algorithm for obtaining the optimal size of a recurrent neural network for grammatical inference","272352545":"ConnectionSc2014","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","221582383":"Population Extinction in Genetic Algorithms: Application in Evolutionary Studies","3995943":"Schema theorem of real-coded nonlinear genetic algorithm","238571300":"Inversion of seismic refraction data using genetic algorithm","232924414":"An Alternative Method to Determine the Magic Tyre Model Parameters Using Genetic Algorithms","220063744":"Hybrid Crossover Operators with Multiple Descendents for Real-Coded Genetic Algorithms: Combining Neighborhood- Based Crossover Operators","226651296":"Two-Loop Real-Coded Genetic Algorithms with Adaptive Control of Mutation Step Sizes","220688384":"Hybrid Intelligent Systems for Pattern Recognition Using Soft Computing - An Evolutionary Approach for Neural Networks and Fuzzy Systems","3207450":"Generating test inputs for embedded control systems","233327810":"Hybrid-coded crossover for binary-coded genetic algorithms in constrained optimization","257336957":"Design optimization of diamond disk pad conditioners","4074764":"An epistasis measure based on the analysis of variance for the real-coded representation in genetic algorithms","221479936":"Using a Genetic Algorithm to Estimate Parameters of a Coarticulation Model.","220739611":"The Virtual Gene Genetic Algorithm","273695079":"Comparative Analysis of Real and Binary Coded Genetic Algorithm for Fuzzy Time Series Prediction","224617562":"Robust l1 design of a multivariable PI controller using a real-coded genetic algorithm","228313250":"On Estimation of the Parameters of Gielis Superformula from Empirical Data","226361412":"Modeling of Stress Changes at Mayon Volcano, Philippines","220528670":"Genetic learning of fuzzy cognitive maps","4058369":"Optimization of Test/Diagnosis/Rework Location(s) and Characteristics in Electronic Systems Assembly Using Real-Coded Genetic Algorithms","251792959":"Estimating non-linear utility functions of time use in the context of activity schedule adaptation model","24128589":"Evolution with Individual and Social Learning in an Agent-Based Stock Market","215990687":"Using Genetic Algorithms to Develop Scoring Models For Alternative Measures of Performance (Abstract)","238167923":"An investigation into the use of spatial coordinates for the genetic algorithm based solution of the fixture layout optimization problem","229407982":"A wavefront sensor-less adaptive optical system for a solid-state laser","3321201":"Genetic algorithms and their applications. Signal Proc Mag IEEE","3575153":"A method for utilizing diploid/dominance in genetic search","3663216":"Hybrid evolutionary programming with fast convergence for constrained optimization problems","245560297":"Genetic Algorithm-Based Optimization Approach and Generic Tool for Calibrating Traffic Microscopic Simulation Parameters","220661867":"Optimisation With Real-Coded Genetic Algorithms Based On Mathematical Morphology","228584657":"Optimal Prediction Strategy for DNA Sequence Promoter Based on Genetic Algorithm","220801126":"Applying Family Competition to Evolution Strategies for Constrained Optimization.","222539795":"Cost-minimizing inverse classification problem: A genetic algorithm approach","221211775":"Current XCSF Capabilities and Challenges","12672400":"Genetic algorithm for ellipsometric data inversion of absorbing layers","4074863":"Elitist Multiobjective evolutionary algorithm for environmental/economic dispatch","243776468":"Multi-parent recombination with simplex crossover in real-coded genetic algorithms","26567878":"Minimization of Harmonics in PWM Inverters Based on Genetic Algorithms","221009017":"Comparison of GA and PSO performance in parameter estimation of microbial growth models: A case-study using experimental data","3421539":"Towards Intelligent Geographic Load Balancing for Mobile Cellular Networks","221390952":"Multi-Objective Optimization by CBR GA-Optimizer for Module-Order Modeling.","238175087":"On the use of genetic algorithm for finding the neutral instability curve in plane Poiseuille flow","3949922":"Global optimization of neural network weights","4074848":"A modified genetic algorithm for optimal electrical distribution network reconfiguration","41712412":"Identification of a spatial linear model based on earthquake-induced data and genetic algorithm with parallel selection","254043713":"An new crossover operator for real-coded genetic algorithm with selective breeding based on difference between individuals","223109163":"A semi-infinite programming model for earliness/tardiness production planning with a genetic algorithm","256937527":"Geometricity of genetic operators for real-coded representation","51936881":"CIXL2: A Crossover Operator for Evolutionary Algorithms Based on\nPopulation Features","220815428":"Evolutionary Learning Strategy using Bug-Based Search.","221020225":"Building a Better Air Defence System Using Genetic Algorithms.","254048841":"RGBCA-genetic bee colony algorithm for travelling salesman problem","224894999":"Forward kinematics of the 6-6 general parallel manipulator using Real Coded Genetic Algorithms","235780989":"Selective Harmonic\nElimination of PWM AC/AC voltage Controller Using Hybrid RGA-PS Approach\",","261308129":"A family of adaptive penalty schemes for steady-state genetic algorithms","223013950":"Robust Design using Pareto type optimization: A genetic algorithm with arithmetic crossover","239375154":"Robust state estimator based on maximum constraints satisfaction of uncertain measurements","260145911":"Advanced particle swarm assisted genetic algorithm for constrained optimization problems","278688228":"Artificial Bee Colony Algorithm with Uniform Mutation","279274974":"Evolutionary Computation: An overview","224895004":"The forward kinematics of 3rpr planer parallel manipulator using a hybrid meta-heuristic paradigm","224895002":"Hybrid meta-heuristic paradigm for the forward kinematics of the 6-6 general parallel manipulator","258521622":"A Novel Hybrid Crossover based Artificial Bee Colony Algorithm for Optimization Problem","2716074":"Dynamic and Heuristic Fuzzy Connectives Based Crossover Operators for Controlling the Diversity and Convergence of Real-Coded Genetic Algorithms","224201939":"Field-of-View Optimization of FSO Receiver Using Real-coded Genetic Algorithm","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","2333106":"Simulated Binary Crossover for Continuous Search Space","4073900":"Genetic algorithms for economic dispatch with valve point effect","233935970":"AMC15957","35468168":"Análise de reabilitação de redes de distribuição de água para abastecimento via algoritmos genéticos multiobjetivo.","245306120":"Evolutionary Simulations to Determine the Human Circadian Period Using an Extended Sleep-Wake Model","227303441":"Evolutionary algorithms for the calculation of electron distributions in Si-MOSFETs","3418516":"Evolutionary programming techniques for constrained optimization problems","261272115":"Optimal design of the transverse flux machine using a fitted genetic algorithm with real parameters","250885975":"DESIGNING DIELECTRIC GRATING FILTERS WITH PGAPACK","221431953":"Parameter Meta-optimization of Metaheuristic Optimization Algorithms","3418513":"Evolutionary Computation: Comments on the History and Current State","259224278":"New State-of-the-art Results for Cassini2 Global Trajectory Optimization Problem","41481182":"Robust mask-layout and process synthesis in micro-electro-mechanical-systems (MEMS) using genetic algorithms","3301781":"Theoretical Analysis of Evolutionary Algorithms With an Infinite Population Size in Continuous Space Part II: Analysis of the Diversification Role of Crossover","220701824":"Real-Coded Adaptive Range Genetic Algorithm Applied to Transonic Wing Optimization.","3903889":"A crossover operator using independent component analysis for real-coded genetic algorithms","229320704":"Rainfall-based criteria for assessing slump rate of mountainous highway slopes: A case study of slopes along Highway 18 in Alishan, Taiwan","41022430":"Algorithmes métaheuristiques hybrides pour la sélection de gènes et la classification de données de biopuces","223901929":"Optimization of an air cushion vehicle bag and finger skirt using genetic algorithms","232628332":"Geese-Inspired Hybrid Particle Swarm Optimization Algorithm for Traveling Salesman Problem","220740762":"A satellite image set for the evolution of image transforms for defense applications","261054013":"On the recombination operator in the real-coded genetic algorithms","220740763":"Uniform Crossover Revisited: Maximum Disruption in Real-Coded GAs","4256245":"Solving non convex Min-Max predictive controller","221161627":"An efficient real-coded genetic algorithm for real-parameter optimization","224314598":"Improving Image Resolution with Edge-Targeted Filter Evolution","2333082":"Using Case-Based Learning to Improve Genetic-Algorithm-Based Design Optimization","234898364":"Tabu Search - in Handbook of Combinatorial Optimization V3","271680908":"The forward kinematics of the 6-6 parallel manipulator using an evolutionary algorithm based on generalized generation gap with parent-centric crossover","3418608":"Test-case generator for nonlinear continuous parameter optimization techniques","225633462":"Carpinteri, A.: A double-multiplicative dynamic penalty approach for constrained evolutionary. Struct Multidiscip Optim 35, 431-445","261274198":"Motion curve optimization of intermittent conveyance bottling machine for reducing liquid vibration","3754485":"Real-coded genetic algorithm based fuzzy sliding-mode control design for precision positioning","225107109":"The theory of virtual alphabets","221787383":"Real-Time Detection of Infrared Profile Patterns and Features Extraction","253088452":"Hummer Specific Learning to Enhance Query-by-Humming","3802603":"Nonlinear MBPC for mobile robot navigation using genetic algorithms","242513825":"Simulation and optimization of engine performance using Kriging model and Genetic Algorithm","220701951":"Multi-parent Recombination in Genetic Algorithms with Search Space Boundary Extension by Mirroring","220742897":"Rapid evaluation and evolution of neural models using graphics card hardware","236985338":"Wavelet feature extraction and genetic algorithm for biomarker detection in colorectal cancer data","258724535":"Inverse groundwater modeling with emphasis on model parameterization","274314631":"Human meta-cognition inspired collaborative search algorithm for optimization","222649510":"Study of the drying behavior of high load multiphase droplets in an acoustic levitator at high temperature conditions","39994246":"A Digital Technique for Online Identification and Tracking of Power System Harmonics Based on Real Coded Genetic Algorithm","256970423":"A hybrid real coded genetic algorithm – Pattern search approach for selective harmonic elimination of PWM AC/AC voltage controller","3775966":"On the effect of multi-parents recombination in binary coded genetic algorithms","221007044":"Two-Dimensional Barcode Decoration Based on Real-Coded Genetic Algorithm","241891204":"Experimental Comparison of Six Population-based Algorithms for Continuous BlackBox Optimization","251627281":"EEG simulation by 2D interconnected chaotic oscillators","215990575":"Using Genetic Algorithms to Develop Scoring Models For Alternative Measures of Performance","237333460":"etiques","2631129":"Multiple Criteria Genetic Algorithms In Engineering Design And Operation","220648660":"Optimization of Test/Diagnosis/Rework Location(s) and Characteristics in Electronic System Assembly","238559170":"Evolutionary Optimization of Combined Sewer Overflow","221275338":"Evolutionary Computation: An Overview.","226180224":"Application of Genetic Algorithm and Finite Element Method for Backcalculating Layer Moduli of Flexible Pavements","232975388":"Experience with the IMMa tyre test bench for the determination of tyre model parameters using genetic techniques","220951339":"A Shared-Memory ACO-Based Algorithm for Numerical Optimization","262277538":"The Capacity and the Versatility of the Pulse Coupled Neural Network in the Image Matching","246122665":"Evolutionary Monte Carlo: Application to Cp model sampling and change point problem","267424243":"CONTROLE NÃO LINEAR GENÉTICO DO PENDULO INVERTIDO","232657882":"Application of Gene Expression Programming to Real Parameter Optimization","252010755":"Taguchi method based model predictive control design for laser scanner","233041893":"Genetic algorithm for the optimal design of axially loaded non-prismatic columns","221013796":"An improved genetic algorithm based economic dispatch with nonsmooth fuel cost function","224292692":"Parallel Growing SOM Monitored by Genetic Algorithm","228355991":"Real‐parameter crossover operators with multiple descendents: An experimental study","257821010":"Optimization of material parameter identification in biomechanics","268049908":"Evolutionary operators for continuous convex parameter spaces","284564216":"Migration policies to improve exploration in parallel island models for optimization via metaheuristics","2761275":"Representation and Self-adaption in Genetic Algorithms","220176142":"Metaheuristic optimization frameworks: A survey and benchmarking","222342994":"A Markov Chain analysis of genetic algorithms with power of 2 cardinality alphabets","220701489":"An Evolutionary Design for f-theta Lenses.","234779625":"A distributed ant-based algorithm for numerical optimization","233935851":"AMC15957","26648460":"Lecture Notes in Computer Science","2473534":"Genetic Algorithms, Numerical Optimization, and Constraints","274382401":"AN XML-BASED GENETIC ALGORITHM TOOL – SYSTEM FEATURES AND MODELING","228366209":"Evolutionary Wavelet Neural Network for Large Scale Function Estimation in Optimization","235665451":"INVESTIGATING CURRENT DENSITY DEPENDENCE OF OXIDE TRAP CHARGING IN n- MOSFETS DURING SUBSTRATE ELECTRONS INJECTION: A GENETIC ALGORITHM APPROACH","261021103":"COPD Prognosis under Biologically Inspired Neural Network","3217936":"Speed estimation of an induction motor drive using an optimized extended Kalman filter. IEEE Trans Ind Electr","4322912":"An Efficient Frequency Estimation Methodology using Genetic Algorithms in FPGA","228967302":"Structural Damage Assessment under Varying Temperature Conditions","4075032":"A new algorithm for exploring and optimizing optical fibre designs using a two dimensional genome with latent, redundant and master genes","221927196":"The Roles of Crossover and Mutation in Real-Coded Genetic Algorithms","221786896":"Optimal Design of Mechanisms for Robot Hands","277287597":"The multiobjective genetic . . . benchmark problems -- an analysis","41481303":"Evolutionary techniques applied to mask-layout synthesis in micro-mechanical-electronic systems (MEMS)","31708114":"Evolutionary Algorithms in Theory and Practice : Evolution Strategies, Evolutionary Programming, Genetic Algorithms / T. Bäck.","29462517":"Towards an optimal financial investment decision in Build-Operate-Transfer projects using genetic algorithms","266013167":"Handbook of Metaheuristics","223248251":"A new mutation operator for real coded genetic algrithms","259170631":"Population-based metaheuristics for continuous boundary-constrained dynamic multi-objective optimisation problems","222418809":"Speciation by perception","222501755":"A genetic algorithm for continuous design space search","224645978":"The Distribution Genetic Algorithm: Evolving a Population of Distributions","220867347":"A Comparison of Genetic Algorithms and Particle Swarm Optimization for Parameter Estimation in Stochastic Biochemical Systems","256721268":"An adaptive parameter binary-real coded genetic algorithm for constraint optimization problems: Performance analysis and estimation of optimal control parameters","5614191":"Evolutionary learning of hierarchical decision rules. IEEE Trans Syst Man Cybern B","221006608":"The Continuous Differential Ant-Stigmergy Algorithm applied to real-world optimization problems","225075028":"State Transition Algorithm","222368638":"A genetic method of LAD estimation for models with censored data","222197505":"A genetic algorithm estimation of the term structure of interest rates","261114323":"Genetic Algorithm for Traveling Salesman Problem: Using Modified Partially-Mapped Crossover Operator","267572657":"Single-hidden-layer fuzzy recurrent wavelet neural network: Applications to function approximation and system identification","221467509":"The Robust Flight Control of an UAV Using MIMO QFT: GA-Based Automatic Loop-Shaping Method.","220316523":"Discovering hierarchical decision rules with evolutive algorithms in supervised learning.","220740455":"Evolving an edge selection formula for ant colony optimization","225491775":"Analyzing the statistical features of CIXL2 crossover offspring","257938704":"A Genetic Algorithm for Solving the CEC\u00272013 Competition Problems on Real-Parameter Optimization","245586163":"Genetic Algorithms and Fuzzy Multiobjective Optimization","3927658":"An adaptive neighboring search using crossover-like mutation for multi modal function optimization","220754809":"Variation operator performance for evolved image reconstruction transforms","224169741":"Genetic and TABU algorithm based array synthesis for the generation of a shaped beam antenna","228966391":"Experiments on Estimation of the Parameters of Gielis Super-Formula by Simulated Annealing Method of Optimization","281010924":"Power Cable Fault Recognition Based on an Annealed Chaotic Competitive Learning Network","3562083":"Using an annealing genetic algorithm to solve global energy minimization problem in molecular binding","272481898":"A estrutura a termo de taxas de juros no Brasil: modelos, estimação e testes","224172804":"RETRACTED ARTICLE: Determination of component proportion based on BP neural networks","242755623":"Algorithms for Solving the Method of Inequalities - A Comparative Study","27524035":"Process Optimization for Machining of Hardened Steels","245433537":"Robust Fault Detection and Isolation Using Robust l1 Estimation","235316324":"Vibrational genetic algorithm as a new concept in airfoil design","3623508":"GENOCOP III: A co-evolutionary algorithm for numerical optimization problems with nonlinear constraints","229433288":"Parallel Optimisation Algorithms for Continuous, Non-Linear Numerical Simulations","3971671":"The determination of base station placement and transmit power in an inhomogeneous traffic distribution for radio network planning","222562090":"A test of genetic algorithms in relevance feedback","245314801":"Inverse airfoil design by using an accelerated genetic algorithm via distribution strategies","229878723":"The synthesis of planar parallel manipulators with prismatic joint for an optimal, singularity-free workspace","46593205":"Cooperative methods in optimisation: analysis and results","221451079":"The Positioning of Base Station in Wireless Communication with Genetic Approach","277294834":"Genetic Algorithms Applications to Fuzzy Logic Based Systems","4070979":"Environmental/economic dispatch of thermal units using an elitist multiobjective evolutionary algorithm","261277167":"The Hidden Potential of Movie Genome Communities: Analyzing Fine-Grained Semantic Information in Motion Pictures","270723676":"Optimization of reconfigurable flow lines applying real coded genetic algorithm, Electronic","224617245":"BMI optimization based on unimodal normal distribution crossover GA with relaxed LMI convex estimation","242980868":"A robust parameter design for multi-response problems","241849578":"Measuring and predicting adaptation behavior in multi-dimensional activity-travel patterns","229894962":"A misclassification cost‐minimizing evolutionary–neural classification approach","257733085":"A genetic algorithm based lookup table approach for optimal stepping sequence of open-loop stepper motor systems","268237176":"Real time selective harmonic minimization for multilevel inverters using genetic algorithm and artificial neural network angle generation","220510113":"An Organizational Evolutionary Algorithm for Numerical Optimization.","220312489":"A theoretical and empirical study on unbiased boundary-extended crossover for real-valued representation","238774451":"Animated QR Code Generation Using Optimization Algorithms","239665344":"An Introduction to Genetic Algorithms for Scientists and Engineers","3865265":"Representation, mutation and crossover issues in evolutionary computation","4064946":"Optimized random PWM strategy based on genetic algorithms","261197085":"Genetic algorithms to automatic weld bead detection in double wall double image digital radiographs","290390976":"An enhancement of selection and crossover operations in real-coded genetic algorithm for large-dimensionality optimization","34813063":"Adaptive global optimization with local search /","220701619":"Heuristic Crossovers for Real-Coded Genetic Algorithms Based on Fuzzy Connectives.","12118574":"A real-coded genetic algorithm for training recurrent neural networks. Neural Netw","220061578":"A Novel Genetic Algorithm and its Application in Fuzzy Variable Structure Control of Fuel Cell","2335418":"A Combined Genetic Adaptive Search (GeneAS) for Engineering Design","255712676":"Multiple objective optimization of reconfigurable manufacturing system","228896575":"Speed Control of Induction Motor using Fuzzy PI and Optimized using GA","226922266":"The Development of Information Guided Evolution Algorithm for Global Optimization","229711662":"Introduction to Evolutionary Algorithms","251837856":"Application of robust l1 fault detection and isolation to an industrial benchmark using a genetic algorithm","237408398":"FACADE DESIGN OPTIMIZATION FOR DAYLIGHT WITH A SIMPLE GENETIC ALGORITHM","250240067":"A Comparative Study on Fitting of Gielis Curves by Classical versus Generalized Simulated Annealing Methods","261457214":"Harmonic minimization of a PWM power inverter using bioinspired algorithms","271603355":"Global–local population memetic algorithm for solving the forward kinematics of parallel manipulators","3827350":"Genetic algorithm using real parameters for array antenna design optimisation","215725685":"On solving the forward kinematics of 3RPR planar parallel manipulator using hybrid metaheuristics","245477390":"Chapter 4 Nonlinear regression","223771622":"Genetic algorithm and M-estimator based robust sequential estimation of parameters of nonlinear sinusoidal signals","248880231":"Optimal In Situ Bioremediation Design by Hybrid Genetic Algorithm-Simulated Annealing","3829385":"A functional specialization hypothesis for designing genetic algorithms","223486951":"A new crossover operator for real coded genetic algorithms. Appl Math Comput","2688657":"Dynamic Hill Climbing: Overcoming the limitations of optimization techniques","3623564":"Gaussian Mutation and Self-Adaptation for Numeric Genetic Algorithms","3418760":"A collective-based adaptive symbiotic model for surface reconstruction in area-based stereo","220999569":"Structure prediction: Real-valued versus binary hybrid genetic algorithms","222557059":"An optimal design of neuro-FLC by Lamarckian co-adaptation of learning and evolution","227115848":"Genetic Algorithm for Optimizing the Gust Loads for Predicting Aircraft Loads and Dynamic Response","222667652":"An hybrid real genetic algorithm to detect structural damage using modal properties. Mech Syst Signal Process","235779272":"A hybrid RGA-PS Approach for Selective Harmonic Elimination of PWM AC/AC Voltage Controller","259640766":"Characterization of the Performance of Memetic Algorithms for the Automation of Bone Tracking With Fluoroscopy","220529645":"Evolving two-dimensional fuzzy systems","2798304":"Learning Consensus Patterns in Unaligned DNA Sequences Using a Genetic Algorithm","225466299":"Genetic supervised classification of Standard Arabic fricative sounds","271522530":"On the Optimal Design of Glass Grid Shells with Planar Quadrilateral Elements","241036432":"Randomized line search techniques in combined GA for discrete sizing optimization of truss structures","262963576":"An Approach to Design Virtual Keyboards for Text Composition in Indian Languages","220313588":"A genetic algorithm calibration method based on convergence due to genetic drift","277822042":"Grid Scheduling Using PSO with SPV Rule","215958025":"Hybrid Approach to Optimal Packing Using Genetic Algorithm and Coulomb Potential Algorithm","226147234":"A study on synergy of multiple crossover operators in a hierarchical genetic algorithm applied to structural optimisation","10995327":"A unified model for the speed of sound in cranial bone based on genetic algorithm optimization","223624079":"Hybridization of intelligent techniques and ARIMA models for time series prediction","3418857":"Real-Time Neuroevolution in the NERO Video Game","222537630":"Optimal synthesis of mechanism with genetic algorithms","254028281":"Uncertain Low Penetration Rate -- A Practical Issue in Mobile Intelligent Transportation Systems","224646016":"An Evolutionary Algorithm for a Single-Item Resource-Constrained Aggregate Production Planning Problem","262602053":"Near Optimal Reentry Guidance Law Using Inverse Problem Approach (In Persian)","24114059":"Some Experiments on Fitting of Gielis Curves by Simulated Annealing and Particle Swarm Methods of Global Optimization","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","225671067":"OBLIC: Classification System Using Evolutionary Algorithm","281685542":"A Real Coded Genetic Algorithm for a Class of Continuous Space Location-Allocation Problems","46468137":"An Evolutionary Algorithm for the Estimation of Threshold Vector Error Correction Models","232837902":"Comparing several genetic algorithm schemes for the calibration of conceptual rainfall-runoff models","251453458":"Risk Minimization and Minimum Description for Linear Discriminant Functions by Genetic Algorithms","221007810":"Optimisation of the Beer Distribution Game with Complex Customer Demand Patterns","257212859":"Adaptive non-linear map and its application","220551124":"Co-adaptation of self-organizing maps by evolution and learning","254043600":"Robust motion estimation for overlapping images via genetic algorithm","273349308":"A Real-Coded Genetic Algorithm with a Direction-Based Crossover Operator","220740560":"Effects of the Use of Non-Geometric Binary Crossover on Evolutionary Multiobjective Optimization","221006804":"GA with a new multi-parent crossover for constrained optimization","220723165":"A Query by Humming System that Learns from Experience.","220555227":"Multidimensional and multideme genetic algorithms for the construction of fuzzy systems","3217201":"Genetic algorithm tuning of Lyapunov-based controllers: an application to a single-link flexible robot system","239541571":"This paper presents a GA algorithm for function optimization that combines the features of Simplex","240928090":"An Introduction to Evolution for Computer Scientists","2429730":"Evolutionary Pattern Search Algorithms","220693024":"Evolutionary and adaptive computing in engineering design.","221228583":"A Real-Coded Predator-Prey Genetic Algorithm for Multiobjective Optimization","225609338":"New Results at Mayon, Philippines, from a Joint Inversion of Gravity and Deformation Measurements","223383128":"Optimizing emission inventory for chemical transport models by using genetic algorithm","257434707":"Integrated fuzzy-connective-based aggregation network with real-valued genetic algorithm for quality of life evaluation","255578167":"Interactive inverse methodology applied to stratigraphic forward modelling","228594351":"Using a Genetic Algorithm to Model Broadband Regional Waveforms for Crustal Structure in the Western United States","262170800":"Towards an efficient genetic algorithm optimizer for sequential projection pursuit","220380720":"Real-time neuroevolution in the NERO video game.","2462518":"Distributed Algorithms for Formation of Geometric Patterns with Many Mobile Robots","236844296":"Artificial Movements Inspired for Global Optimization","283643903":"Synchronization of Chaotic Discrete-Time Fuzzy Systems by means of Fuzzy Output Regulation and Genetic Algorithms","3234601":"Genetic algorithm assisted joint multiuser symbol detection and fading channel estimation for synchronous CDMA systems","51968002":"Between theory and practice: guidelines for an optimization scheme with\ngenetic algorithms - Part I: single-objective continuous global optimization","220885558":"Fuzzy Recombination for the Breeder Genetic Algorithm.","3418920":"Combining Neural Networks and Genetic Algorithms to Predict and Reduce Diesel Engine Emissions","3418921":"Nonlinear Least Square Regression by Adaptive Domain Method With Multiple Genetic Algorithms","45860262":"Adaptation and Self-Organization in Evolutionary Algorithms","220743222":"A stigmergy-based algorithm for black-box optimization: noisy function testbed.","3217198":"Genetic algorithms: Concepts and applications","24112752":"On generating correlated random variables with a given valid or invalid Correlation matrix","224056901":"A Fast and Efficient Method for Frequency Deviation Measurement Based on Genetic Algorithms using a FPGA Approach","261138575":"A modified real coded genetic algorithm for constrained optimization","255611930":"Algoritmos Genéticos con Codificación Real: Operadores de Cruce Híbridos Basados en Entornos con Múltiples Descendientes","225409609":"Performance Improvement of the Attitude Estimation System Using Fuzzy Inference and Genetic Algorithms","250843609":"Adaptive KnowledgeDiscovery Techniques for Data Mining","11824030":"An Analysis of Two-Parent Recombinations for Real-Valued Chromosomes in an Infinite Population","228774543":"Damage Assessment of a Bridge under Varying Environmental Conditions","263553179":"Assessing the Dynamic Viscosity of Na–K–Ca–Cl–H2O Aqueous Solutions at High-Pressure and High-Temperature Conditions","2704154":"Soft Genetic Operators in Evolutionary Algorithms","220714514":"A meta-heuristic paradigm for solving the forward kinematics of 6-6 general parallel manipulator.","43550126":"Análisis y diseño de algoritmos genéticos paralelos distribuidos","242092377":"Graduate Course An Introduction to Genetic Algorithms","2396956":"A Hierarchical Genetic System For Symbolic Function Identification","3011348":"A crack identification microwave procedure based on a genetic algorithm for nondestructive testing","220942866":"Multiple Crossover per Couple with Selection of the Two Best Offspring: An Experimental Study with the BLX-alpha Crossover Operator for Real-Coded Genetic Algorithms.","227599017":"A crossover operator that uses Pareto optimality in its definition","2454303":"Constrained GA applied to Production and Energy Management of a Pulp and Paper Mill","221040238":"User Specific Training of a Music Search Engine","263818490":"Simulation of Rain Splash Using a Genetic Fuzzy System","228822759":"A robust real-coded genetic algorithm using unimodal normal distribution crossover augmented by uniform crossover: Effects of self-adaptation of crossover …","224120350":"Solving the forward kinematics of the 3RPR planar parallel manipulator using a hybrid meta-heuristic paradigm","227024589":"Optimization of Multireservoir Systems by Genetic Algorithm","2597729":"Learning by Objectives for Adaptive Shop-Floor Scheduling","251919429":"Statistical modeling and optimization for diesel engine calibration","224120349":"A meta-heuristic paradigm for solving the forward kinematics of 6–6 general parallel manipulator","222144123":"Kazemi, S. M. and S. M. Hosseini. Comparison of spatial interpolation methods for estimating heavy metals in sediments of Caspian Sea. Expert Systems with Applications 38","229666537":"Structural damage assessment with antiresonances versus mode shapes using parallel genetic algorithms. Struct Control Health Monit","3923808":"Economic dispatch solution using a genetic algorithm based on arithmetic crossover","3411818":"A genetics-based approach for aggregated production planning in a fuzzy environment","261214414":"Mechanism and Machine Theory","255631454":"Operadores de Cruce con Múltiples Descendientes para Algoritmos Genéticos con Codificación Real: Estudio Experimental","220549699":"GOLS - Genetic orthogonal least squares algorithm for training RBF networks","228381429":"Hybrid Nature-Inspired Computation Methods for Optimization","226508525":"Parallel optimization of evolutionary algorithms","228436717":"Final Project Report: Learning optimal parameters of Graph-Based Image Segmentation","238796111":"A metaheuristic Algorithm for New Models of Fuzzy Bus Terminal Location Problem with a Certain Ranking Function","221002330":"Mining Interesting Regions using an Evolutionary Algorithm","3350341":"Adaptive robust detection for CDMA using a genetic algorithm","220199528":"A novel method for real parameter optimization based on Gene Expression Programming","224177701":"Interactive interpolating crossover in grammatical evolution","225123858":"Linkage Identification by Nonlinearity Check for Real-Coded Genetic Algorithms","220992085":"On the energy efficiency of some cooperative and non-cooperative transmission schemes in WSNs","221418056":"An Improved Genetic Algorithm for Spatial Clustering","220612184":"Selectionist relaxation: Genetic algorithms applied to image segmentation","228586208":"Genetic Selection of Parametric Scenes Genetic Algorithms","44161312":"Parametric system identification and active vibration control of vibrational structures using genetic algorithm","238171574":"The feature-preserving map of high-dimensional complex chemical objects using non-linear map integrated with correlative component analysis","259406066":"A Modified Non-Dominated Sorting Genetic Algorithm with Fractional Factorial Design for Multi-Objective Optimization Problems","220392103":"Pruning boosted classifiers with a real valued genetic algorithm","225493728":"2 Type-1 Fuzzy Logic","4307920":"The differential ant-stigmergy algorithm: An experimental evaluation and a real-world application","215617355":"Making and breaking power laws in evolutionary algorithm population dynamics","3985326":"Environmentally constrained economic dispatch via a genetic algorithm with arithmetic crossover","7378914":"Chemical Genetic Algorithms—Evolutionary Optimization of Binary-to-Real-Value Translation in Genetic Algorithms","257680585":"Evolutionary Optimization: Pitfalls and Booby Traps","251910294":"Fitness-Based Recombination Operator Applying to the Real-Coded Genetic Algorithms","274730999":"Evolutionary algorithm enhancement for model predictive control and real-time decision support","241147335":"Aromatic Hydrocarbon Isomerization Process Optimization based on IDE and AOS","220403386":"Improving crossover operator for real-coded genetic algorithms using virtual parents","221230772":"Cluster-based Adaptive Mutation Mechanism To Improve the Performance of Genetic Algorithm","224670457":"Applying permutation modulation to spread-spectrum systems","267061365":"Tunneling and Genetic Algorithms for Global Optimization","237698440":"POLYPEPTIDE S TRUCTURE P REDICTION: REAL-VALUED V ERSUS B INARY H YBRID G ENETIC ALGORITHMS","220170938":"Fan-shape optimisation using CFD and genetic algorithms for increasing the efficiency of electric motors","228532794":"Resource management and scalability of the XCSF learning classifier system","220256902":"Model selection via Genetic Algorithms for RBF networks","4032405":"Evolving fuzzy controllers through evolutionary programming","28243463":"The use of fuzzy connectives to design real-coded genetic algorithms","225433284":"Genetic Algorithm to Optimize Fitness Function with Sampling Error and its Application to Financial Optimization Problem","2765700":"Inductive Learning of Mutation Step-size in Evolutionary Parameter Optimization","4744166":"Real-Parameter Evolutionary Monte Carlo With Applications to Bayesian Mixture Models","268432464":"AN ONTOLOGY-DRIVEN SIMILARITY PROVIDING RELIABLE PROTEIN FAMILY RECOGNITION","246307094":"Genetic Algorithms as Post Processors for Data Mining","251834552":"Accurate Calibration of a Robotic Positioning System Using the Evolutionary Search","220885655":"Genetic AlgorithmsNumerical Optimizationand Constraints.","222337667":"Multi-objective optimisation of real-valued parameters of a hybrid MT system using Genetic Algorithms","232831529":"Optimal configuration selection for reconfigurable manufacturing system using NSGA II and TOPSIS","243769677":"Genetic Fuzzy Systems: Evolutionary Tuning and Learning of Fuzzy Knowledge Bases","3973110":"Optimal grey topological predicting approach to short-term load forecasting in power system","222732938":"Characterisation and comparison of gender-specific utility functions of shopping duration episodes","220218093":"Applying multiobjective RBFNNs optimization and feature selection to a mineral reduction problem","236177858":"JavaEvA A Java based framework for Evolutionary Algorithms","279676794":"ALT KISMİ MOMENT VE YARI-VARYANS RİSK MODELLERİ KULLANARAK GENETİK ALGORİTMA YARDIMIYLA PORTFÖY OPTİMİZASYONU: İMKB UYGULAMASI","3756011":"A study on the effect of multi-parent recombination in real coded genetic algorithms","228461130":"“Genetic Algorithms Applied in Online Autotuning PID Parameters of a Liquid-Level Control System,”","220437238":"OS-CFAR and CMLD threshold optimization in distributed systems using evolutionary strategies","232630794":"A Mobile Agent Framework to Support Parallel Computing: Application to Multi-product Planning and Scheduling Problems","224325255":"FPGA implementation of Genetic Algorithms for frequency estimation in power systems","226445989":"Tackling Real-Coded Genetic Algorithms: Operators and Tools for Behavioural Analysis","2787313":"Optimizing Engineering Designs Using a Combined Genetic Search","260972629":"Frequency band-wise passive control of linear time invariant structural systems with H∞ optimization","226751072":"Non-standard methods in evolutionary computation","265788467":"On rotationally invariant continuous-parameter genetic algorithms","3828703":"Wing design using real-coded adaptive range genetic algorithm","256937144":"A Directed Genetic Algorithm for global optimization","220291784":"Improving real-parameter genetic algorithm with simulated annealing for engineering problem","256756900":"Development of plotting position for the general extreme value distribution","215617334":"Adaptation and Self-Organization in Evolutionary Algorithms","267971592":"Continuous Parameters in Dreamy Genetic Algorithms","228346477":"Tabu Search","229588573":"Application of the genetic algorithm for optimizing operation rules of the LiYuTan reservoir in Taiwan. J Am Water Resour Assoc","251425035":"Optimal Division of Data for Neural Network Models in Water Resources Applications","2707410":"Evolutionary Computation: An Overview","220356318":"An Adaptive Real-Coded Genetic Algorithm.","220885716":"A Real Coded Genetic Algorithm with an Explorer and an Exploiter Populations."},"index":576}