{"abs":"Informatica is a journal primarily covering the European com- puter science and informatics community; scientific and educa- tional as well as technical, commercial and industrial. Its basic aim is to enhance communications between different European structures on the basis of equal rights and international referee- ing. It publishes scientific papers accepted by at least two ref- erees outside the author\u0027s country. In addition, it contains in- formation about conferences, opinions, critical examinations of existing publications and news. Finally, major practical achieve- ments and innovations in the computer and information industry are presented through commercial publications as well as through independent evaluations. Editing and refereeing are distributed. Each editor from the Editorial Board can conduct the refereeing process by appointing two new referees or referees from the Board of Referees or Edi- torial Board. Referees should not be from the author\u0027s country. If new referees are appointed, their names will appear in the list of referees. Each paper bears the name of the editor who appointed the referees. Each editor can propose new members for the Edi- torial Board or referees. Editors and referees inactive for a longer period can be automatically replaced. Changes in the Editorial Board are confirmed by the Executive Editors. The coordination necessary is made through the Executive Edi- tors who examine the reviews, sort the accepted articles and main- tain appropriate international distribution. The Executive Board is appointed by the Society Informatika. Informatica is partially supported by the Slovenian Ministry of Science and Technology. Each author is guaranteed to receive the reviews of his article. When accepted, publication in Informatica is guaranteed in less than one year after the Executive Editors receive the corrected version of the article.","title":"EDITORIAL BOARDS, PUBLISHING COUNCIL","id":242286565,"url":"https://www.researchgate.net/publication/242286565_EDITORIAL_BOARDS_PUBLISHING_COUNCIL","names":["Tomaû Banovec","Ciril Baökovi","Andrej Jerman","Vladislav Rajkovi","Ivan Bratko","Marko Jagodic"],"references":{"220166303":"Collaborative Translation with Mobile Agents.","3113517":"Rada, R., et al.: Development and application of a metric on semantic nets. IEEE Trans. Syst. Man Cybern. 19(1), 17-30","221151786":"The Wizard of Oz System for Weather Information Retrieval.","2368040":"Semantic distance in WordNet: An experimental, application-oriented evaluation of five measures","220166672":"System Administration Using Software Agents.","243610004":"MULTEXT - East Version 3: Multilingual Morphosyntactic Speci cations, Lexicons and Corpora","2473521":"Verb Semantics And Lexical Selection","1783052":"Semantic Similarity Based on Corpus Statistics and Lexical Taxonomy","228780474":"Visualization of news articles","228894014":"The parameters tuning for evolutionary synthesis algorithm","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","221179314":"Generating OCL Specifications and Class Diagrams from Use Cases: A Newtonian Approach.","222449501":"How to get people to say and type what computers can understand","200003659":"Frequency Analysis of English Usage: Lexicon and Grammar","220166078":"Unifying the Interpretation of Redundant Information.","46298854":"History of Computing in Education","1961529":"Semantics of Programming Languages: A Tool-Oriented Approach","2599552":"Using Information Content to Evaluate Semantic Similarity in a Taxonomy","240920690":"Morpho-Syntactic Descriptions in MULTEXT-East | the Case of Serbian","220166319":"Assesing the Potential Impact of an Electronic Grade System to the School Environment.","1782953":"PARADISE: A Framework for Evaluating Spoken Dialogue Agents","220166189":"Representing Agents and their Systems: A Challenge for Current Moddeling Languages.","220166059":"An XML-based Serialization of Information Exchanged by Software Agents.","232629993":"Two-Level Grammar as an Object-Oriented Requirements Specification Language (PDF)","272479370":"Computer-Aided Reuse Tool (CART)","220424980":"A goal-driven approach to enterprise component identification and specification","41648710":"Transformations for architectural restructuring","242183120":"A system for evaluation of human upper extremity","220166234":"A New Efficient Group Signature With Forward Security.","220166746":"Towards a Modelling Methodology for Fault-Tolerant Multi-Agent System.","266719779":"Improved error recovery in generated LR parsers","266722093":"Extending CC4 neural networks to classify real life documents","220166357":"Indexing Agent for Data Gathering in an e-Travel System.","200045222":"An Introduction to Latent Semantic Analysis","2557547":"MULTEXT: Multilingual Text Tools and Corpora","265707162":"Algorithms for drawing polyhedra from 3-connected planar graphs","220166482":"Type Systems for Concurrent Programming Calculi","266219150":"Providing Cross-Lingual Information Access with Knowledge-Poor Methods","239931676":"Attribute Grammars: Definitions, Systems, and Bibliography","2720890":"An Information-Theoretic Definition of Similarity","228394697":"Multi-Attribute Modelling of Economic and Ecological Impacts of Cropping Systems","220375030":"Analysis of Selection Algorithms: A Markov Chain Approach","265572225":"The Demarcate Construction: A new form of tree-based priority queues","232878134":"Contextual correlates of semantic similarity","225204149":"Semantics of context-free languages. Math. Syst. Theory. 2 95","267123889":"On-line handwriting Chinese character analysis and recognition using stroke correspondence search","4940310":"Zero-One Programming With Many Variables and Few Constraints","234782237":"Constraint logic programming","220427591":"Constraint Logic Programming Languages.","221023177":"Placing search in context: The concept revisited","268892014":"Distributing state space for parallel computation of CTL model checking","268885998":"Multi-agent system case studies in command and control, information fusion and data management","2537677":"Talk\u0027n\u0027travel: A Conversational System For Air Travel Planning","253086715":"MIAOw: a Method to Integrate a Process Algebra with Formal Data","2502856":"The Video Store Revisited - Thoughts on Refactoring and Testing","270589775":"Software Engineering: The Trend","220166505":"A Task-Oriented Compositional Mobile Agent Architecture for Knowledge Exchanges Between Agencies and Agents.","265317927":"A spectral approach to graphical representation of data","223615660":"Solving inverse initial-value, boundary-value problems via genetic algorithm","221996739":"Semantic Similarity in a Taxonomy: An Information Based Measure and Its Application to Problems of Ambiguity in Natural Language","221151575":"Information-Providing Dialogue Management.","220166499":"Human-Agent Interaction: Case Studies in Human Supervised UAV.","221024209":"A Clustering Based Niching EA for Multimodal Search Spaces"},"citedIn":{},"index":58}