{"abs":"The asymptotic robustness of estimators as a function of a rarity parameter, in the context of rare-event simulation, is often qualified by properties such as bounded relative error (BRE) and logarithmic efficiency (LE), also called asymptotic optimality. However, these properties do not suffice to ensure that moments of order higher than one are well estimated. For example, they do not guarantee that the variance of the empirical variance remains under control as a function of the rarity parameter. We study generalizations of the BRE and LE properties that take care of this limitation. They are named bounded relative moment of order k (BRM-k) and logarithmic efficiency of order k (LE-k), where k\u003e\u003d1 is an arbitrary real number. We also introduce and examine a stronger notion called vanishing relative centered moment of order k, and exhibit examples where it holds. These properties are of interest for various estimators, including the empirical mean and the empirical variance. We develop (sufficient) Lyapunov-type conditions for these properties in a setting where state-dependent importance sampling (IS) is used to estimate first-passage time probabilities. We show how these conditions can guide us in the design of good IS schemes, that enjoy convenient asymptotic robustness properties, in the context of random walks with light-tailed and heavy-tailed increments. As another illustration, we study the hierarchy between these robustness properties (and a few others) for a model of highly-reliable Markovian system (HRMS) where the goal is to estimate the failure probability of the system. In this setting, for a widely-used class of IS schemes, we show that BRM-k and LE-k are equivalent and that these properties become strictly stronger when k increases. We also obtain a necessary and sufficient condition for BRM-k in terms of quantities that can be readily verified from the parameters of the model.","title":"Asymptotic Robustness of Estimators in Rare-Event Simulation","id":29649681,"url":"https://www.researchgate.net/publication/29649681_Asymptotic_Robustness_of_Estimators_in_Rare-Event_Simulation","names":["Pierre L’Ecuyer","Jose Blanchet","Bruno Tuffin","Peter W. Glynn","ACM Transactions on Modeling and Computer Simulation"],"references":{"2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","265831260":"Monte Carlo Simulation and Large Deviations Theory for Uniformly Recurrent Markov Chains","225713713":"Estimating tail probabilities of heavy tailed distributions with asymptotically zero relative error","50336198":"Mathematical Statistics","2125802":"Limit Theorems in Free Probability Theory I","2451630":"General Conditions for Bounded Relative Error in Simulations of Highly Reliable Markovian Systems","3023205":"A large deviations perspective on the efficiency of multilevel splitting","32012839":"Applied Probability and Queues","227446046":"Importance Sampling for Stochastic Simulations","228864309":"State-dependent importance sampling and large deviations","2118579":"Dynamic importance sampling for uniformly recurrent Markov chains","228632440":"Rare event simulation techniques: An introduction and recent advances","3885987":"Simulating GI/GI/1 queues and insurance risk processes withsubexponential distributions","220136390":"On the efficiency of RESTART for multidimensional state systems","2355513":"The Asymptotic Efficiency of Simulation Estimators. Op. Res. 40:505-520","220136450":"Rare events, splitting, and quasi-Monte Carlo","222953623":"Monte Carlo simulation of Markov unreliability models","246879016":"MTTF estimation by Mo nte Carlo methods using Markov models","225210701":"Fast simulation of rare events in queueing and reliability models","227446636":"Importance Sampling for the Simulation of Highly Reliable Markovian Systems","225828439":"Monte Carlo Methods","228057717":"An Introduction to Probability Theory and Its Applications II","4100125":"On numerical problems in simulations of highly reliable Markovian systems","11396430":"Transition Path Sampling: Throwing Ropes over Rough Mountain Passes, in the Dark","235622440":"Monte Carlo Methods in Financial Engineering","3078157":"On the Optimality and Stability of Exponential Twisting in Monte Carlo Estimation","235043365":"Importance Sampling, Large Deviations, and Differential Games","220769798":"Strongly efficient estimators for light-tailed sums","220462227":"Approximation of Zero-Variance Importance Sampling in Reliability Settings","1748970":"Efficient rare-event simulation for the maximum of heavy-tailed random walks. Ann Appl Probab","234779020":"Design and analysis of simulation experiments","220324690":"Efficiency of high-order moment estimates","4213814":"New measures of robustness in rare event simulation","38358079":"Importance Sampling in the Monte Carlo Study of Sequential Tests","247261636":"Probability: Theory and Examples 2nd Ed","226303365":"Efficient Simulation of Light-Tailed Sums: an Old-Folk Song Sung to a Faster New Tune...","38351731":"The Berry-Esseen bound for Student’s statistic","220331546":"A Unified Framework for Simulating Markovian Models of Highly Dependable Systems.","245453658":"Applied Probability and Queueing","38350453":"Bounded normal approximation in simulations of highly reliable Markovian systems","265424047":"Note on the Berry-Esseen Theorem","243081859":"The Advanced Theory of Statistics. Volume I, Distribution Theory","3885893":"Introduction to simulation","221526731":"Approximate zero-variance simulation"},"citedIn":{"262256290":"Rare-Event Simulation for Stochastic Recurrence Equations with Heavy-Tailed Innovations","45905337":"Asymptotic optimality of the cross-entropy method for Markov chain problems","50996224":"Handbook of Monte Carlo Methods","266870883":"A new technique for rare-event simulation based on partition of the region","291077975":"Introduction to Rare-Event Simulation","263545787":"Asymptotic optimality of RESTART estimators in highly dependable systems","275167977":"Some Recent Results in Rare Event Estimation","43521417":"State-dependent importance sampling schemes via minimum cross-entropy","4274261":"Efficient Estimation of Loss Rates in Optical Packet Switched Networks with Wavelength Conversion","237697084":"Curriculum Vitae Bruno Tun","224209093":"Combination of conditional Monte Carlo and approximate zero-variance importance sampling for network reliability estimation","224123841":"Importance sampling simulations of phase-type queues","220170500":"Approximate Zero-Variance Importance Sampling for Static Network Reliability Estimation.","222400478":"The cross-entropy method with patching for rare-event simulation of large Markov chains","275275208":"An Adaptive Zero-Variance Importance Sampling Approximation for Static Network Dependability Evaluation","266754627":"Simulation Methods for Reliability and Availability of Complex Systems","257665533":"Markov chain importance sampling with applications to rare event probability analysis","257637105":"A simple recursive importance and stratified sampling scheme for stochastic network reliability estimation","259460957":"2013 Performance evaluation of an importance sampling technique in a Jackson network","273579874":"A new Walk on Equations Monte Carlo method for solving systems of linear algebraic equations","220876807":"Evaluating Differentiated Quality of Service Parameters in Optical Packet Switching","220462227":"Approximation of Zero-Variance Importance Sampling in Reliability Settings","273307386":"Balanced and Approximate Zero-Variance Recursive Estimators for the Network Reliability Problem","251300174":"Stochastic Enumeration Method for Counting NP-Hard Problems","4306169":"Ant-based approach for determining the change of measure in importance sampling","254050330":"Rare event simulation techniques","278200918":"Importance sampling for Jackson networks with customer impatience until the end of service","256035594":"Probabilistic Bounded Relative Error Property for Learning Rare Event Simulation Techniques","257266973":"Optimal Monte Carlo integration with fixed relative precision","226263095":"Application of Reliability, Availability, and Maintainability Simulation to Process Industries: a Case Study","259461052":"Performance evaluation of an importance sampling technique in a Jackson network","51889883":"Small Variance Estimators for Rare Event Probabilities","262310127":"Efficient calculation of rare event probabilities in Markovian queueing networks","226410286":"Analysis and Improvements of Path-Based Methods for Monte Carlo Reliability Evaluation of Static Models","234005026":"A Comparison of Cross-Entropy and Variance Minimization Strategies","254049782":"Graph Reductions to Speed Up Importance Sampling-Based Static Reliability Estimation","260641754":"Total variation approximations and conditional limit theorems for multivariate regularly varying random walks conditioned on ruin","266943935":"A survey of rare event simulation methods for static input-output models","242669996":"RENSEIGNEMENTS PERSONNELS","261122767":"Efficient importance sampling under partial information","224231101":"Approximate Zero-Variance Importance Sampling for Static Network Reliability Estimation","260027037":"An Adaptive Zero-Variance Importance Sampling Approximation for Static Network Dependability Evaluation","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","241157300":"On Asymptotical Efficiency of Importance Sampling with p-order Relative Moment Minimization","4102609":"Integrated 0.9 V charge-control switching converter with self-biased current sensor","225896321":"Dynamic Fault Tree Analysis: Simulation Approach","226303365":"Efficient Simulation of Light-Tailed Sums: an Old-Folk Song Sung to a Faster New Tune...","251712760":"State-dependent importance sampling for rare-event simulation: An overview and recent advances","283060129":"Ant-Based Approach for Determining the Change of Measure in Importance Sampling","221526731":"Approximate zero-variance simulation"},"index":581}