{"abs":"In the present paper an adaptive Kriging surrogate model with active refinement is proposed to solve component reliability analysis problems (i.e. with a single design point) with a reasonable limit for the dimensionality of the basic random variables space. The model uses an adaptive Kriging-based trust region method to search for the design point and predict the failure probability based on the first-order reliability method. This prediction is then verified or improved using Monte Carlo simulation with importance sampling based on a Kriging surrogate model built up iteratively around the design point using an active refinement algorithm. The usefulness of the proposed surrogate model in terms of accuracy and efficiency for practical engineering applications is shown with a numerical example involving an advanced nonlinear FEA structural model.","title":"Adaptive surrogate model with active refinement combining Kriging and a trust region method","id":283056064,"url":"https://www.researchgate.net/publication/283056064_Adaptive_surrogate_model_with_active_refinement_combining_Kriging_and_a_trust_region_method","names":["Bruno Gaspar","A. P. Teixeira","Carlos Guedes Soares"],"references":{"228954980":"A comparison of approximate response functions in structural reliability analysis, Probabilistic","275087204":"System Reliability Analysis by Monte Carlo Based Method and Finite Element Structural Models","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","222351395":"Uncertainties in Probabilistic Numerical Analysis of Structures and Solids – Stochastic Finite Elements","232372925":"Methods for ultimate limit state assessment of ships and ship-shaped offshore structures: Part II stiffened panels","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","222868929":"On Latin Hypercube Sampling for structural reliability analysis","266323381":"Combining polynomial chaos expansions and Kriging for solving structural reliability problems","283056052":"Structural reliability analysis combining Kriging surrogate models with an adaptive trust region method","222390634":"Construction of response surfaces based on progressive-lattice-sampling experimental design with application to uncertainty propagation","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","221676250":"Meta-models for Structural Reliability and Uncertainty Quantification","223270145":"Reliability analysis of automotive body-door subsystem","222287247":"Neural-network-based reliability analysis: A comparative study","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","261291205":"Assessment of the Efficiency of Kriging Surrogate Models for Structural Reliability Analysis","232405698":"Assessment of IACS-CSR implicit safety levels for buckling strength of stiffened panels for double hull tankers","233951275":"FE Based structural reliability analysis using STAND environment","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","245327426":"Ultimate strength of plates with random fields of corrosion","223906278":"Application of Kriging method to structural reliability"},"citedIn":{},"index":597}