{"abs":"The use of surrogate models instead of computationally expensive simulation codes is very convenient in engineering. Roughly speaking, there are two kinds of surrogate models: the deterministic and the probabilistic ones. These last are generally based on Gaussian assumptions. The main advantage of probabilistic approach is that it provides a measure of uncertainty associated with the surrogate model in the whole space. This uncertainty is an efficient tool to construct strategies for various problems such as prediction enhancement, optimization or inversion. In this paper, we propose a universal method to define a measure of uncertainty suitable for any surrogate model either deterministic or probabilistic. It relies on Cross-Validation (CV) sub-models predictions. This empirical distribution may be computed in much more general frames than the Gaussian one. So that it is called the Universal Prediction distribution (UP distribution). It allows the definition of many sampling criteria. We give and study adaptive sampling techniques for global refinement and an extension of the so-called Efficient Global Optimization (EGO) algorithm. We also discuss the use of the UP distribution for inversion problems. The performances of these new algorithms are studied both on toys models and on an engineering design problem.","title":"Universal Prediction Distribution for Surrogate Models","id":287759983,"url":"https://www.researchgate.net/publication/287759983_Universal_Prediction_Distribution_for_Surrogate_Models","names":["Malek Ben Salem","Olivier Roustant","Fabrice Gamboa","Lionel Tomaso"],"references":{"44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","48377504":"Statistics for Experimenters. An Intro to Design, Data Analysis, and Model Building","220320738":"Evolutionary Model Type Selection for Global Surrogate Modeling","4760591":"Van Beers, W.C.M.: Application-driven sequential designs for simulation experiments: Kriging metamodeling. J. Oper. Res. Soc. 55(9), 876-883","233373487":"Maximum Entropy Sampling","220279848":"Towards the Optimal Design of Numerical Experiments.","223564511":"Surrogate-based analysis and optimization","3083261":"Distribution-Free Performance Bounds for Potential Function Rules","268572240":"Maximum Accumulative Error Samplint Strategy for Approximation of Deterministic Engineering Simulations","216756600":"Overview of modern design of experiments methods for computational simulations","281473939":"A survey of cross-validation procedures for model selection","220411509":"Hierarchical Nonlinear Approximation for Experimental Design and Statistical Data Fitting","224839856":"The Predictive Sample Reuse Method with Application","216300850":"On Sequential Sampling for Global Metamodeling in Engineering Design","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","258831733":"Kriginv: An efficient and user-friendly implementation of batch sequential inversion strategies based on kriging","209436387":"A Tutorial on Support Vector Regression","257335183":"Cross-Validation Based Single Response Adaptive Design of Experiments for Deterministic Computer Simulations","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","225981794":"Multiple surrogates: How cross-validation errors can help us to obtain the best predictor","222662110":"Kriging metamodeling in simulation: a review. Eur J Oper Res","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","222679450":"Convergence properties of the expected improvement algorithm with fixed mean and covariance functions","227093096":"Ensemble of surrogates","227145388":"Expected improvement in efficient global optimization through bootstrapped kriging","237548813":"Choosing the Sample Size of a Computer Experiment: A Practical Guide","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","245366776":"A Clustering-Based Surrogate Model Updating Approach to Simulation-Based Engineering Design","237453504":"Review of Metamodeling Techniques in Support of Engineering Design Optimization","222490346":"Minimax and Maximin Distance Designs","243119700":"Surface Generated by Moving Least Square Methods","226736744":"Approximation of multiresponse deterministic engineering simulations: A dependent metamodeling approach","216301385":"Metamodeling Sampling Criteria in a Global Optimization Framework","274874575":"A Robust Error-Pursuing Sequential Sampling Approach for Global Metamodeling Based on Voronoi Diagram and Cross Validation","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","251876153":"Efficient global optimization algorithm assisted by multiple surrogate techniques","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand"},"citedIn":{},"index":599}