{"abs":"We present a model that realizes both resonance-Regge (Veneziano) and parton-hadron (Bloom-Gilman) duality. We first review the features of the Veneziano model and we discuss how parton-hadron duality appears in the Bloom-Gilman model. Then we review limitations of the Veneziano model, namely that the zero-width resonances in the Veneziano model violate unitarity and Mandelstam analyticity. We discuss how such problems are alleviated in models that construct dual amplitudes with Mandelstam analyticity (so-called DAMA models). We then introduce a modified DAMA model, and we discuss its properties. We present a pedagogical model for dual amplitudes and we construct the nucleon structure function F2(x,Q2). We explicitly show that the resulting structure function realizes both Veneziano and Bloom-Gilman duality.","title":"Explicit Model Realizing Parton-Hadron Duality","id":223130147,"url":"https://www.researchgate.net/publication/223130147_Explicit_Model_Realizing_Parton-Hadron_Duality","names":["L. L. Jenkovszky","V. K. Magas","Tim Londergan","A. P. Szczepaniak","International Journal of Modern Physics A"],"references":{"225732786":"Off-Mass-Shell Dual Amplitude with Mandelstam Analyticity","223093189":"Connection between lepton- and hadron-induced diffraction phenomena","225898620":"Resonance-reggeon and parton-hadron duality in strong interactions","2043541":"Effective Functional Form of Regge Trajectories","222506697":"Do we need two pomerons?","222445001":"Production of vector mesons by real and virtual photons at high energies","260263822":"Vector Meson Dominance","1897809":"Regge Exchange Contribution to Deeply Virtual Compton Scattering","2001936":"Dual Properties of the Structure Functions","45911539":"Quark-nucleon dynamics and Deep Virtual Compton Scattering","258944063":"Quarks and Leptons: An Introductory Course in Modern Particle Physics","50336336":"An introduction to Regge theory \u0026 high energy physics.","2001422":"Duality in Semi-Exclusive Processes","243425490":"Exclusive J/Ψ electroproduction in a dual model","238966508":"Electron scattering at 4° with energies of 4.5-20 GeV","1761100":"Inclusive Perspectives","238921771":"A vector meson dominance approach to scale invariance","222480789":"How fast do small x structure functions rise? A comparative analysis","222657746":"Exclusive electroproduction and the quark structure of the nucleon","222829520":"Target-mass corrections and the Bloom-Gilman duality of the nucleon structure function","222449114":"Structure functions and low x physics","235590931":"Long-Range-Potential Model of Hadrons","235587216":"Forward Compton Scattering","221663914":"Vector Mesons and DVCS at HERA","2149310":"The Nucleon Structure in the Resonance Region","2003712":"The Behavior of Form Factors of Nucleon Resonances and Quark-Hadron Duality","239442459":"QCD factorization at fixed Q2(1 - χ)","2004801":"Duality in Semi-Exclusive Processes","229328139":"Small x extrapolation of structure functions and the Pomeron","235558763":"Dual Resonance Theory with Nonlinear Trajectories","255228629":"Regge trajectories and the quark-gluon coupling constant","229326926":"Resonance masses and widths from nonlinear Regge trajectories","235505902":"Scaling and the Behavior of Nucleon Resonances in Inelastic Electron-Nucleon Scattering","235548707":"Correspondence Arguments for High-Energy Collisions","235582432":"Semi-exclusive deeply virtual Compton scattering","226214097":"Nucleon form factors in a VMD model with both Q 2- and S -channel duality","222297171":"The origins of quark-hadron duality: How does the square of the sum become the sum of the squares?","229811935":"Asymptotic Expansion","2039537":"New possibilities of old soft pomeron in DIS","235562532":"Electromagnetic N-Δ transition at high Q^{2}","2011370":"Baryonic Regge trajectories with analyticity constraints","13330750":"Distribution amplitudes and electroproduction of the delta and other low-lying resonances","243456442":"Scaling, Duality, and the Behavior of Resonances in Inelastic Electron-Proton Scattering","2014823":"Quark-hadron duality in electron scattering","51910434":"Introduction to QCD - a bound state perspective","1999267":"Quark-Hadron Duality in Structure Functions","2017120":"Summary Talk on Quark-Hadron Duality","2002273":"From Regge behavior to DGLAP evolution"},"citedIn":{"258816863":"Extraction of from deep inelastic scattering at large x","225732786":"Off-Mass-Shell Dual Amplitude with Mandelstam Analyticity","2005858":"Low-Energy Diffraction; A Direct-Channel Point of View: The Background"},"index":608}