{"abs":"We introduce a new multiobjective evolutionary algorithm called PESA (the Pareto Envelope-based Selection Algorithm), in which selection and diversity maintenance are controlled via a simple hyper-grid based scheme. PESA\u0027s selection method is relatively unusual in comparison with current well known multiobjective evolutionary algorithms, which tend to use counts based on the degree to which solutions dominate others in the population. The diversity maintenance method is similar to that used by certain other methods. The main attraction of PESA is the integration of selection and diversity maintenance, whereby essentially the same technique is used for both tasks. The resulting algorithm is simple to describe, with full pseudocode provided here and real code available from the authors. We compare PESA with two recent strong-performing MOEAs on some multiobjective test problems recently proposed by Deb. We find that PESA emerges as the best method overall on these problems.","title":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","id":220701837,"url":"https://www.researchgate.net/publication/220701837_The_Pareto_Envelop-based_Selection_Algorithm_for_Multi-Objective_Optimization","names":["David Corne","Joshua Damian Knowles","Martin J. Oates"],"references":{"235709741":"Lecture Notes in Computer Science","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","245102847":"A tabu search procedure to solve multiobjective combinatorial optimization problems","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","2599118":"Tabu Search for Multiobjective Optimization: MOTS","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","278655114":"A Tabu Search Procedure to Solve MultiObjective Combinatorial Optimization Problems","12809680":"Deb, K.: Multi-Objective Genetic Algorithms: Problem Difficulties and Construction of Test Problems. Evolutionary Computation 7, 205-230","2713564":"Generating a Diversity of Good Solutions to a Practical Combinatorial Problem using Vectorized Simulated Annealing","2631294":"A Niched Pareto Genetic Algorithm for Multiobjective Optimization","225783245":"Selective breeding in a multiobjective genetic algorithm","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2462623":"Local Search, Multiobjective Optimization and the Pareto Archived Evolution Strategy","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","229707789":"Pareto simulated annealing- A metaheuristic technique for multiple-objective combinatorial optimization","220702040":"On the Performance Assessment and Comparison of Stochastic Multiobjective Optimizers."},"citedIn":{"280554681":"Approximating Multiobjective Optimization Problems with Complex Pareto Fronts","224761188":"A New Multi-objective Evolutionary Optimisation Algorithm: The Two-Archive Algorithm","220470562":"GISMOO: A new hybrid genetic/immune strategy for multiple-objective optimization","220740897":"AMGA: An archive-based micro genetic algorithm for multi-objective optimization","232619478":"A Model and Methodology for Composition QoS Analysis of Embedded Systems","220740903":"An efficient approach to unbounded bi-objective archives -","220449074":"Evolutionary Computation and Its Applications in Neural and Fuzzy Systems","221673764":"Application of multi-objective optimization with a genetic algorithm for the optimization of CML Circuits","253348620":"A Grid-Based Evolutionary Algorithm for Many-Objective Optimization","221673763":"Multi-objective optimization of MCML circuits using a genetic algorithm","46888670":"Multi-Objective Combinatorial Optimization: Problematic and Context","220105995":"Hybrid immune algorithm with Lamarckian local search for multi-objective optimization","221008181":"Multi-objective evolutionary programming without non-domination sorting is up to twenty times faster","220742965":"HEMO: A Sustainable Multi-objective Evolutionary Optimization Framework","34471471":"Explicit building block multiobjective evolutionary computation : methods and applications /","209607770":"Metaheuristic algorithms for multi-objective scheduling problems","5297268":"Improving Locality in Binary Representation via Redundancy","220121403":"A hybrid meta-heuristic for multi-objective optimization: MOSATS","271467531":"A Review on Evolutionary Multiobjective Optimization for Routing Problem of Computer Networks","291072383":"Diseño de una biblioteca de compuertas MCML utilizando un algoritmo genético y optimización multiobjetivo","220669195":"A review and evaluation of multi-objective algorithms for the flowshop scheduling problem. INFORMS J Comput","252018473":"An experimental study of Multi-Objective Evolutionary Algorithms for balancing interpretability and accuracy in fuzzy rulebase classifiers for financial prediction","221432066":"Parallel Tabu Search and the Multiobjective Capacitated Vehicle Routing Problem with Soft Time Windows","2367509":"On the Convergence and Diversity-Preservation Properties of Multi-Objective Evolutionary Algorithms","273139829":"A Three-Phase Approach for Robust Project Scheduling: An Application for R\u0026D Project Scheduling","224094574":"The Multi-objective Differential Evolution Algorithm Based on Quick Convex Hull Algorithms","274122848":"B-Spline Curve Approximation Using Pareto Envelope-Based Selection Algorithm – PESA","291390825":"Improved multi-objective clustering with automatic determination of the number of clusters","41967289":"Multi-Objective Optimization Problems with Arena Principle and NSGA-II","46888688":"Advances in Multi-Objective Nature Inspired Computing","2362394":"Multiobjective Genetic Programming: Reducing Bloat Using SPEA2","220176735":"Adaptation and application of multi-objective evolutionary algorithms for rule reduction and parameter tuning of fuzzy rule-based systems. Soft Comput","223886617":"Development of optimal design formula for bi-tuned mass dampers using multi-objective optimization","272015474":"Tuning compilations by multi-objective optimization: Application to Apache web server","224182548":"On the Influence of the Number of Objectives on the Hardness of a Multiobjective Optimization Problem","242259513":"Un Algoritmo Basado en Evolución Diferencial para Resolver Problemas Multiobjetivo","232851882":"Evolutionary Multiobjective Optimization in Materials Science and Engineering","262222830":"Generalizing the improved run-time complexity algorithm for non-dominated sorting","238720616":"Application of Novel Clonal Algorithm in Multiobjective Optimization","266954685":"Genetic operators for the multiobjective flowshop problem","220585331":"Recent Advances in Evolutionary Computation","220439931":"Improving the Performance of Multi-Objective Evolutionary Algorithms Using the Island Parallel Model.","242405929":"Vitri - A Generic Framework for Engineering Decision Support Systems on Heterogeneous Computer Networks","221304171":"Evaluating Image Segmentation Algorithms Using the Pareto Front","221228402":"Fuzzy-Pareto-Dominance and its Application in Evolutionary Multi-objective Optimization","262174717":"Multi-objective Evolutionary Algorithm Based on Layer Strategy","261054416":"A Multi-Objective Genetic Graph-Based Clustering algorithm with memory optimization","46888616":"ParadisEO-MOEO: A Software Framework for Evolutionary Multi-Objective Optimization","224472326":"Automatic Clustering with Multi-objective Differential Evolution Algorithms","228874696":"Mapping Cores on Network-on-Chip","265128866":"Metaheuristic Multi-objective optimization of constrained Futures Portfolios for effective risk management","277298422":"Evolutionary framework for the creation of diverse hybrid ensembles for better generalisation [DIVACE: diverse and accurate ensemble learning algorithm . . .","216301719":"A Tutorial on Evolutionary Multiobjective Optimization","221228380":"Overview of Artificial Immune Systems for Multi-objective Optimization","4201524":"Strategies based on polar coordinates to keep diversity in multi-objective genetic algorithm","220740945":"Simple Population Replacement Strategies for a Steady-State Multi-objective Evolutionary Algorithm","226754047":"Data Mining Based Optimization of Test Cases to Enhance the Reliability of the Testing","271464528":"Solving multi-objective problems using SPEA2 and Tabu search","262317021":"Advances in Evolutionary Multi-objective Optimization","4090047":"A hierarchical evolutionary approach to multi-objective optimization","261077772":"CMA-PAES: Pareto archived evolution strategy using covariance matrix adaptation for Multi-Objective Optimisation","222525894":"Metaheuristics and cooperative approaches for the Bi-objective Ring Star Problem","228827432":"Evolutionary Multiobjective Bayesian Optimization Algorithm: Experimental Study","228992299":"RPSGAe — Reduced Pareto Set Genetic Algorithm: Application to Polymer Extrusion","265930583":"Swarm Intelligence based Soft Computing Techniques for the Solutions to Multiobjective Optimization Problems","220702120":"Evolutionary Multiobjective Clustering.","224598521":"An Introduction to Multiobjective Optimisation Methods for Decentralised Power Planning","228706621":"22 Why You Should Consider Nature-Inspired Optimization Methods in Financial Mathematics","264848215":"Optimisation par Algorithme Génétique d\u0027une Commande LPV de Suspension Semi-active","261267250":"Simultaneous optimization of performance, energy and temperature for DAG scheduling in multi-core processors","237310598":"RESUME DE MEMOIRE EN MAGISTER en GENIE MECANIQUE - PRODUCTIQUE OPTION : SYSTEMES DE PRODUCTION","220754316":"An Spanning Tree Based Method For Pruning Non-Dominated Solutions in Multi-Objective Optimization Problems.","261500723":"A hybrid adaptive evolutionary algorithm in the domination-based and decomposition-based frameworks of multi-objective optimization","4042906":"A cooperative coevolutionary algorithm for multiobjective optimization","273298662":"A hybrid multi-objective optimization method considering optimization problems in power distribution systems","220291470":"Parallelism on multicore processors using Parallel.FX","263091997":"Wind turbine selection for wind farm layout using multi-objective evolutionary algorithms","227675433":"Design and Optimization of LNA Topologies with Image Rejection Filters","227313968":"Supply Chain Inventory Optimisation with Multiple Objectives: An Industrial Case Study","4074750":"Enhanced distribution and exploration for multiobjective evolutionary algorithms","4074746":"Adaptive diversity maintenance and convergence guarantee in multiobjective evolutionary algorithms","254230510":"AMGA2: improving the performance of the archive-based micro-genetic algorithm for multi-objective optimization. Eng Optim","24305081":"A Unified Model for Evolutionary Multiobjective Optimization and its Implementation in a General Purpose Software Framework: ParadisEO-MOEO","272085219":"Un nuevo algoritmo Evolutivo Multi-Objetivo para la extracción de Reglas de Asociación Cuantitativas Positivas y Negativas","228838774":"A multi-objective evolutionary algorithm with a separate archive","226411943":"Application of Bio-Inspired Optimization Techniques in Power Distribution Systems","225674670":"Multiobjective evolutionary algorithms for complex portfolio optimization problems","37988001":"A design framework and genetic algorithm for digital design optimisation on FPGAs","221008328":"Constrained multi-objective optimization algorithm with diversity enhanced differential evolution.","221006281":"Comparing algorithms, representations and operators for the multi-objective knapsack problem","221228489":"Non-invasive Atrial Disease Diagnosis Using Decision Rules: A Multi-objective Optimization Approach","226759010":"Multiobjective Adaptive Representation Evolutionary Algorithm (MAREA) - A new evolutionary algorithm for multiobjective optimization","282315833":"A comparison of multiple objective evolutionary algorithms for solving the multi-objective node placement problem","263525189":"Comparison and Evaluation of Multiple Objective Genetic Algorithms for the Antenna Placement Problem: Algorithmic Solutions for Wireless, Mobile, Ad Hoc and Sensor Networks (Guest Editors: Amotz Bar-Noy, Alan A. Bertossi, Cristina M. Pinotti and Cauligi S. Raghavendra)","285448689":"Study on multi-objective flexible job-shop scheduling problem considering energy consumption","282490916":"A leader–follower partially observed, multiobjective Markov game","241105578":"Non-dominated ranked genetic algorithm for solving multi-objective optimization problems: NRGA","239550131":"Optimal sensor scheduling and power management in sensor networks","271661252":"Empirical and analytical study of many-objective optimization problems: Analysing distribution of nondominated solutions and population size for scalability of randomized heuristics","226622839":"Performance Scaling of Multi-objective Evolutionary Algorithms","224177572":"An Interactive Evolutionary Multiobjective Optimization Method Based on Progressively Approximated Value Functions","220534239":"Multiple Criteria Decision Making, Multiattribute Utility Theory: Recent Accomplishments and What Lies Ahead","238344911":"The Good of the Many Outweighs the Good of the One: Evolutionary Multi Objective Optimization","2369759":"Controlled Elitist Non-dominated Sorting Genetic Algorithms for Better Convergence","265021232":"IPESA-II: Improved Pareto Envelope-Based Selection Algorithm II","281777206":"A multiobjective metaheuristic approach for the integrated vehicle and crew scheduling","225256850":"On The Effects of Archiving, Elitism, and Density Based Selection in Evolutionary Multi-objective Optimization","270960934":"A Multiobjective Evolutionary Algorithm Using Gaussian Process-Based Inverse Modeling","224545899":"Design of two power system stabilizers coordinately based on Strength Pareto Evolutionary Algorithm","220381224":"An Investigation on Noisy Environments in Evolutionary Multiobjective Optimization","220740664":"A grid-based fitness strategy for evolutionary many-objective optimization","224246859":"A performance comparison of multi-objective optimization evolutionary algorithms for all-optical networks design","278792584":"Pareto Optimization Identifies Diverse Set of Phosphorylation Signatures Predicting Response to Treatment with Dasatinib","224309321":"A Multiobjective Evolutionary-Simplex Hybrid Approach for the Optimization of Differential Equation Models of Gene Networks","220288054":"An evolutionary artificial immune system for multi-objective optimization","239523665":"A Guided Hybrid Genetic Algorithm for Feature Selection with Expensive Cost Functions","262795915":"Posicionamiento óptimo de enrutadores en WSAN mediante algoritmos evolutivos","225137729":"Implementation of scatter search for multi-objective optimization: A comparative study","4090133":"Improving the performance of evolutionary algorithms for the multiobjective 0/1 knapsack problem using ε -dominance","1958193":"Dominance Based Crossover Operator for Evolutionary Multi-objective Algorithms","225407041":"Multi-Objective Clustering and Cluster Validation","220739613":"Use of domain information to improve the performance of an evolutionary algorithm.","291072111":"Diseño de un amplificador operacional de transconductancia aplicando técnicas de optimización multiobjetivo","235793206":"2.7 Genetic Algorithms, Optimization, and Evolutionary Modeling","241164060":"Designing multiple inverter systems with evolutionary multiobjective optimisation","221007975":"Introducing a robust and efficient stopping criterion for MOEAs","260033076":"An Analysis of Decomposition Approaches in Multi-objectivization via Segmentation","262527726":"The assessment of evolutionary algorithms for analyzing the positional accuracy and uncertainty of maps","4242706":"A multi-objective evolutionary approach to the portfolio optimization problem","257635855":"A regularity model-based multiobjective estimation of distribution algorithm with reducing redundant cluster operator","257153541":"MOEA/D + uniform design: A new version of MOEA/D for optimization problems with many objectives","229876970":"Adaptive ranks clone and","224214016":"Review on Real Coded Genetic Algorithms Used in Multiobjective Optimization","261300979":"Intelligent Algorithms for Solving Multiobjective Optimization Problems","228689094":"An Estimation of Nadir Objective Vector Using a Hybrid Evolutionary-cum-Local-Search Procedure","220741699":"Automated red teaming: a proposed framework for military application.","46590893":"Optimización de tensión en redes de distribución utilizando técnicas evolutivas [Power network voltage optimization using evolutive algorithms]","261038819":"An hybrid algorithm for the industrial car sequecing problem","262266573":"Active learning with multi-criteria decision making systems","1960297":"Functional Brain Imaging with Multi-Objective Multi-Modal Evolutionary Optimization","264789694":"Massively Parallel Evolutionary Computation on GPGPUs","242011923":"Multi-objective sequence dependent setup times permutation flows hop: a new algorithm and a comprehensive study. Eur J Oper Res","221787326":"Design of an Efficient Genetic Algorithm to Solve the Industrial Car Sequencing Problem","220048534":"Evolutionary Computation in Combinatorial Optimization","237417389":"Dominance Based Crossover Operator for Evolutionary Multi-objective Algorithms DRAFT VERSION","225319137":"A Multi-Objective Ant-Colony Algorithm for Permutation Flowshop Scheduling to Minimize the Makespan and Total Flowtime of Jobs","221611175":"Multi-Objective Evolutionary Algorithms Used in Greenhouse Planning for Recycling Biomass into Energy","221883565":"Borg: An Auto-Adaptive Many-Objective Evolutionary Computing Framework","257153732":"BSTBGA: a hybrid genetic algorithm for constrained multi-objective optimization problems. Comput Oper Res","261419532":"A multi-objective evolutionary algorithm for mining quantitative association rules","3421614":"Multiobjective GA Optimization Using Reduced Models","225794287":"A hybrid method for solving multi-objective global optimization problems","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","220215427":"The mean-variance cardinality constrained portfolio optimization problem: An experimental evaluation of five multiobjective evolutionary algorithms","220045495":"Multiobjective Evolutionary Algorithms and Applications","258207432":"Metaheurísticas Multi-Objetivo para Equilibrado de Líneas de Montaje en Automoción: Optimización Conjunta de Tiempo y Espacio","280554772":"A Fast Strength Pareto Evolutionary Algorithm Incorporating Predefined Preference Information","261338684":"A Staged Multi-Objective Co-Evolutionary Algorithm","235298743":"Multi-objective feature selection using a Bayesian artificial immune system","228429867":"Multiobjective bayesian optimization algorithm for combinatorial problems: Theory and practice","262153750":"Pareto-efficient hybridization for multi-objective recommender systems","262352410":"An evolutionary Bi-objective approach to the capacitated facility location problem with cost and CO 2 emissions","226497594":"Recent Trends in Evolutionary Multiobjective Optimization","244684585":"Parallel Tabu Search and the Multiobjective Vehicle Routing Problem with Time Windows","221582473":"Multiobjective Evolutionary Algorithms: Applications in Real Problems.","225124566":"Multi-start and path relinking methods to deal with multi-objective knapsack problems. Ann Oper Res","50590398":"Multiobjective Optimization Approaches in Image Segmentation – The Directions and Challenges","283188574":"A Multiobjective Genetic Algorithm Based on a Discrete Selection Procedure","226311356":"Evolutionary Multiobjective Clustering","221256947":"A Multi-objective Genetic Algorithm Approach to Construction of Trading Agents for Artificial Market Study","4375943":"An Efficient Multi-objective Evolutionary Algorithm Based on Minimum Spanning Tree","224472233":"Performance Assessment of the Hybrid Archive-based Micro Genetic Algorithm (AMGA) on the CEC09 Test Problems","222297332":"Abstract QoS analysis for component-based embedded software: Model and methodology","224720041":"A Multi-Objective Evolutionary Algorithm for Rule Selection and Tuning on Fuzzy Rule-Based Systems","269311427":"Chaos Quantum Clonal Multiobjective Evolutionary Algorithm","220200140":"Multi-objective nature-inspired clustering and classification techniques for image segmentation","261569092":"A Hybrid Pareto Frontier Generation Method for Trade-Off Analysis in Transportation Asset Management","220689651":"Multiobjective Genetic Algorithms for Clustering - Applications in Data Mining and Bioinformatics.","225364149":"Metaheuristics and exact methods to solve a multiobjective parallel machines scheduling problem","227283024":"Dynamic Uniform Scaling for Multiobjective Genetic Algorithms","221673706":"Segmentación de nemátodos en imágenes digitales usando redes neuronales artificiales","3455466":"Evolutionary multi-objective optimization: A historical view of the field","220116222":"A Scheduling Model with Multi-Objective Optimization for Computational Grids using NSGA-II","232275000":"A Pareto-based Memetic Algorithm for Optimization of Looped Water Distribution Systems","4074967":"Evolutionary many-objective optimisation: an exploratory analysis","261202555":"A new archive based steady state genetic algorithm","232274994":"Multi-objective Crop Planning using Pareto-based Evolutionary Algorithms","220310732":"Achieving balance between proximity and diversity in multi-objective evolutionary algorithm","232274985":"Annealing-tabu PAES: a Multi-objective Hybrid Meta-heuristic","4074954":"Hybridization of the multi-objective evolutionary algorithms and the gradient-based algorithms","8549751":"Ideal Evaluation from Coevolution","237233109":"MOMBES Multiobjective Modelbased Evolution Strategy","233658388":"System optimization by multiobjective genetic algorithms and analysis of the coupling between variables, constraints and objectives","225925257":"Multi-objective topology and sizing optimization of truss structures based on adaptive multi-island search strategy","258388326":"Multiobjective Quantum Evolutionary Algorithm for the Vehicle Routing Problem with Customer Satisfaction","267998714":"Multi-Objectivization in Genetic Algorithms","223536982":"A portfolio optimization model with three objectives and discrete variables. Comp. Oper. Res. 37, 1285-1297","275257952":"A novel Hybrid multi-objective immune algorithm with adaptive differential evolution","2404908":"Full Elite Sets for Multi-Objective Optimisation","225269604":"On Multi-Objective Evolutionary Algorithms","274920040":"A New Multiobjective Evolutionary Algorithm Based on Decomposition of the Objective Space for Multiobjective Optimization","224301906":"Multiple trajectory search for multiobjective optimization","227414915":"A software framework based on a conceptual unified model for evolutionary multiobjective optimization: ParadisEO-MOEO","241163345":"An Experimental Study of Similarity-Based Mating on a Weight-Based Multiobjective Immune Genetic Algorithm","220472117":"Metaheuristics and cooperative approaches for the Bi-objective Ring Star Problem","220176142":"Metaheuristic optimization frameworks: A survey and benchmarking","224184142":"Design of an Operational Transconductance Amplifier applying multiobjective optimization","258381168":"Multiobjective Design Optimization of Grillage Systems according to LRFD-AISC","235683859":"Metaheuristic Optimization Backgrounds: A Literature Review","224301950":"How well do multi-objective evolutionary algorithms scale to large problems","225313610":"Improving the Performance of Evolutionary Algorithms for the Multiobjective 0/1 Knapsack Problem Using ε-Dominance","225699669":"Multi-objectives optimal model of heavy equipment using improved Strength Pareto Evolutionary Algorithm","224503625":"A Novel Clonal Algorithm for Multiobjective Optimization","229710744":"Multi‐objective optimization for channel allocation in mobile computing using NSGA‐II","2633240":"Multi-Objective Evolutionary Algorithms: Introducing Bias Among Pareto-Optimal Solutions","226505648":"An Introduction to Multi-Objective Evolutionary Algorithms and Some of Their Potential Uses in Biology","29973498":"Méthodologie de conception système à base de plateformes reconfigurables et programmables","42804410":"An Improved Clonal Algorithm in Multiobjective Optimization","236658723":"A Comparative Study of Multi-objective Evolutionary Algorithms to Optimize the Selection of Investment Portfolios with Cardinality Constraints","263394697":"Distributed Query Plan Generation Using Multiobjective Genetic Algorithm","221008662":"Multiple Trajectory Search for Unconstrained/Constrained Multi-Objective Optimization","216301279":"On the Evolutionary Optimisation of Many Objectives","220701543":"Dominance Based Crossover Operator for Evolutionary Multi-objective Algorithms.","220372834":"An immune-inspired multi-objective approach to the reconstruction of phylogenetic trees","4120188":"Autonomous resource management and control algorithms for distributed wireless sensor networks","3418750":"Dynamic multiobjective evolutionary algorithm: Adaptive cell-based rank and density estimation","238660725":"Multi-objective site selection and analysis for GSM cellular network planning","224346897":"A Survey and Future Trend of Study on Multi-Objective Scheduling","220180305":"Cross-pollinating parallel genetic algorithms for multiobjective search and optimization","221608827":"Greedy Local Improvement of SPEA2 Algorithm to Solve the Multiobjective Capacitated Transshipment Problem","221006716":"Evolutionary Multi-Objective Clustering for Overlapping Clusters Detection","269725251":"Optimizing ERP readiness improvements under budgetary constraints","221392742":"PSFGA: A Parallel Genetic Algorithm for Multiobjective Optimization.","8997597":"An Adaptive Sharing Elitist Evolution Strategy for Multiobjective Optimization","4262422":"Scored Pareto MEC for Multi-Objective Optimization and Its Convergence","221105013":"Multi-objective Robot Coalition Formation for Non-additive Environments","220790642":"Design of a MCML Gate Library Applying Multiobjective Optimization","284625579":"An affinity propagation based multiobjective evolutionary algorithm for selecting optimal aiming points of missiles","224228099":"QoS-Driven Service Composition with Reconfigurable Services","236678213":"GeDEA-II: A simplex crossover based evolutionary algorithm including the genetic diversity as objective","220199807":"Multiobjective invasive weed optimization: Application to analysis of Pareto improvement models in electricity markets","264743332":"Solving a new bi-objective location-routing-inventory problem in a distribution network by meta-heuristics","251238558":"Fault tolerant embedded systems design by multi-objective optimization","271917661":"Reference direction based immune clone algorithm for many-objective optimization","259525909":"Diversity and Convergence Issues in Evolutionary Multiobjective Optimization: Application to Agriculture Science","4367917":"New progresses and prospect of multi-objective evolutionary algorithm","225860358":"Multi-objective optimization for bus body with strength and rollover safety constraints based on surrogate models","220381009":"Cluster Guide Particle Swarm Optimization (CGPSO) for Underdetermined Blind Source Separation With Advanced Conditions","239796285":"Comparisons of bi-objective genetic algorithms for hybrid flowshop scheduling with sequence-dependent setup times","2488925":"Robust and Flexible Scheduling with Evolutionary Computation","259505419":"QAR-CIP-NSGA-II: A new multi-objective evolutionary algorithm to mine quantitative association rules","232175446":"IMPLEMENTATION OF PARETO-ARCHIVE NSGA-II ALGORITHMS TO A NEARLY-ZERO-ENERGY BUILDING OPTIMISATION PROBLEM","226621184":"Evolving Continuous Pareto Regions","3421873":"Optimal Advertising Campaign Generation for Multiple Brands Using MOGA","259994102":"A survey on nature inspired metaheuristic algorithms for partitional clustering","271210144":"afruzi2014","3418808":"Intelligent Evolutionary Algorithms for Large Parameter Optimization Problems","235836544":"MO-TRIBES, an adaptive multiobjective particle swarm optimization algorithm","221024186":"History and Immortality in Evolutionary Computation.","2316980":"Reducing Local Optima in Single-Objective Problems by Multi-objectivization","267871584":"An Efficient Chemical Reaction Optimization Algorithm for Multiobjective Optimization","277966344":"A Survey of Multiobjective Evolutionary Clustering","3418798":"A GA-Based Design Space Exploration Framework for Parameterized System-On-A-Chip Platforms","224169926":"Toward an Estimation of Nadir Objective Vector Using a Hybrid of Evolutionary and Local Search Approaches","51692937":"Diagnostic Assessment of Search Controls and Failure Modes in Many-Objective Evolutionary Optimization","2363014":"Benchmark Problem Generators and Results for the Multiobjective Degree-Constrained Minimum Spanning Tree Problem","230799204":"A Novel Approach for Traffic Accidents Sanitary Resource Allocation Based on Multi-Objective Genetic Algorithms","261714236":"Partially Observed, Multi-objective Markov Games","262400261":"Evolutionary-computer-assisted design of image operators that detect interest points using genetic programming","237469824":"A Tool for Rapid Development of Multi-Objective Evolutionary Algorithms (MOEAs) with Application to Facility Location Problems","250107971":"Differential Evolution for Solving Multi-objective Optimization Problems","234052447":"A comparison of Multiobjective Evolutionary Algorithms","223818727":"A tool for multiobjective evolutionary algorithms","262228243":"ASMiGA: An archive-based steady-state micro genetic algorithm","220999583":"Multi-objective Optimization in the Area Coverage Problems for Cellular Communication Networks: Evaluation of an Elitist Evolutionary Strategy.","220381079":"A Novel Immune Clonal Algorithm for MO Problems","4358900":"K.: Multiobjective Optimization of SLA-Aware Service Composition","3418766":"Reducing the Run-Time Complexity of Multiobjective EAs: The NSGA-II and Other Algorithms","230883199":"Multi-objective immune algorithm with Baldwinian learning","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","233179993":"Constrained multi-objective optimization algorithm with an ensemble of constraint handling methods. Eng Optim","237112544":"رهیافتی نوین برای اداره محدودیت در بهینه سازی چند هدفه با استفاده از الگوریتم بهینه سازی ازدحام ذرات","265213196":"Multiobjective Memetic Estimation of Distribution Algorithm Based on an Incremental Tournament Local Searcher","232623897":"A Fast Method of Constructing the Non-Dominated Set: Arena\u0027s Principle","224319385":"A Competitive-Cooperative Coevolutionary Paradigm for Dynamic Multiobjective Optimization","229574504":"Multi‐objective highway alignment optimization using a genetic algorithm","261140826":"A Multipopulation Coevolutionary Strategy for Multiobjective Immune Algorithm","221024230":"Recombination and Self-Adaptation in Multi-objective Genetic Algorithms","224646065":"Multiobjective Job Shop Scheduling using Genetic Algorithm with Cyclic Fitness Assignment","29603605":"Automatic Clustering Using a Synergy of Genetic Algorithm and Multi-objective Differential Evolution","220290043":"Evolving better population distribution and exploration in evolutionary multi-objective optimization","261500276":"An Investigation on Noisy Environments in Evolutionary Multi-Objective Optimization","254014917":"Modeling non functional requirements in designing middleware for pervasive healthcare system","4216487":"Fault Tolerance in Bluetooth Scatternet Topologies","2363085":"A Comparison of Encodings and Algorithms for Multiobjective Minimum Spanning Tree Problems","233638657":"Conceptual design of bicycle frames by multiobjective shape annealing","268043540":"A New Genetic Algorithm to Solve Effectively Highly Multi- Objective Problems: POGA","221163456":"A New Evolutionary Algorithm for Solving Multiobjective Optimization","222568373":"Machine scheduling in custom furniture industry through neuro-evolutionary hybridization","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","226017163":"The Pareto\n-Box Problem for the Modelling of Evolutionary Multiobjective Optimization Algorithms","220949459":"Solving the industrial car sequencing problem in a Pareto sense","221024214":"A Multiobjective Evolutionary Algorithm for Car Front End Design.","222407613":"A Hybrid Model of Integer Programming and Variable Neighbourhood Search for Highly-Constrained Nurse Rostering Problems","257404331":"Multiobjective Evolutionary Algorithms for Portfolio Management: A comprehensive literature review","259126670":"Solving a new stochastic multi-mode p-hub covering location problem considering risk by a novel multi-objective algorithm","225505913":"New definition and calculation model for evolutionary multi-objective optimization","226115185":"A Simple Approach to Evolutionary Multiobjective Optimization","226110070":"Current and Future Research Trends in Evolutionary Multiobjective Optimization","262907047":"Comparison of different power generators in PV-battery-power generator hybrid system","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","255979603":"Multi-objective adaptive evolutionary strategy for tuning compilations","48334323":"Openet4wf: marco de conocimiento para el modelado de flujos de trabajo formalizados mediante redes de Petri","224600695":"Creating Human Activity Recognition Systems Using Pareto-based Multiobjective Optimization","221228601":"The Combative Accretion Model – Multiobjective Optimisation Without Explicit Pareto Ranking","249603581":"Technology Transfer: Academia to Industry","225181300":"Multiobjective Metaheuristic Approaches to Reliability Optimization","266288320":"Self organizing multi-objective optimization problem","248808944":"Uncertainty-based multiobjective optimization of groundwater remediation design. Water Resour Res 44:W02,404","262453376":"A Multi-Objective Imperialist Competitive Algorithm for solving discrete time, cost and quality trade-off problems with mode-identity and resource-constrained situations","224311929":"Effective Evolutionary Algorithms for Many-Specifications Attainment: Application to Air Traffic Control Tracking Filters","260498593":"A Survey on Multiobjective Evolutionary Algorithms for the Solution of the Portfolio Optimization Problem and Other Finance and Economics Applications","261049508":"An Improved Ranking Scheme for Selection of Parents in Multi-Objective Genetic Algorithm","3418906":"An Investigation on Preference Order Ranking Scheme for Multiobjective Evolutionary Optimization","221024792":"Introduction to Evolutionary Multiobjective Optimization","255638532":"Algoritmos Culturales Aplicados a Optimización con Restricciones y Optimización Multiobjetivo","267665612":"Unsupervised classification. Similarity measures, classical and metaheuristic approaches, and applications","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","259994692":"Non-additive multi-objective robot coalition formation","236136750":"A New Distributed Evolutionary Computation Technique for Multi-Objective Optimization","259716167":"A Casting Yield Optimization Case Study: Forging Ram","221914631":"Tackling the Industrial Car Sequencing Problem Using GISMOO Algorithm","3418890":"A distributed Cooperative coevolutionary algorithm for multiobjective optimization","5303061":"Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection","224578084":"WBMOIGA: Weight-based multiobjective immune genetic algorithm and its application","224092701":"A Multi-objective Constrained Optimization Algorithm Based on Infeasible Individual Stochastic Binary-Modification","224623140":"Predictive controller for heterogeneous sensor network operation in dynamic environments","222168694":"Artificial immune system for multi-objective design optimization of composite structures","228453079":"Optimización de problemas multi-objetivo de empaquetado de palets mediante algoritmos evolutivos","282674068":"Comparison the Combination of Different Power Generators with Photovoltaic Panels and Batteries","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","268161198":"Nonlinear and complex dynamics. Applications in physical, biological, and financial systems","226202147":"Recent Developments in Evolutionary Multi-Objective Optimization","259716130":"State-of-the-Art Multi-Objective Optimisation of Manufacturing Processes Based on Thermo-Mechanical Simulations","220742259":"A stopping criterion based on Kalman estimation techniques with several progress indicators","261186800":"A hybrid multi-objective approach to capacitated facility location with flexible store allocation for green logistics modeling","220742222":"Optimal Operating Conditions for Overhead Crane Maneuvering Using Multi-objective Evolutionary Algorithms.","251812971":"A MODIFIED PAES ALGORITHM USING ADAPTIVE REPRESENTATION OF SOLUTIONS","1920886":"Metaheuristics and Their Hybridization to Solve the Bi-objective Ring Star Problem: a Comparative Study","257432617":"A multi-objective artificial physics optimization algorithm based on ranks of individuals","264200398":"An integrated portfolio optimisation procedure based on data envelopment analysis, artificial bee colony algorithm and genetic programming","220610130":"Zhang, Y., et al.: Comparing the performance of metaheuristics for the analysis of multi-stakeholder tradeoffs in requirements optimisation. Information and Software Technology 53(7), 761-773","50283912":"A Multiobjective Optimization Approach to Solve a Parallel Machines Scheduling Problem","266663068":"Automatic Isotherm Derivation From Field Data for Oilfield Scale-Inhibitor Squeeze Treatments","267424906":"Linear and Nonlinear Approximation of Fuzzy Random Variables","229083682":"Optimisation multi-objectif pour la selection de modeles SVM","220541602":"Adaptive Multi-Objective Optimization Based on Nondominated Solutions.","222526159":"A multi-model selection framework for unknown and/or evolutive misclassification cost problems","220869284":"A Novel Weight-Based Immune Genetic Algorithm for Multiobjective Optimization Problems","224259791":"Lorenz dominance based metaheuristic to solve a hybrid flowshop scheduling problem with sequence dependent setup times","257680585":"Evolutionary Optimization: Pitfalls and Booby Traps","220217012":"A hybrid genetic algorithm for multi-objective product plan selection problem with ASP and ALB","220743358":"An evolutionary bi-objective approach to the capacitated facility location problem with cost and CO","268157027":"A multi-objective artificial bee colony algorithm based on division of the searching space","23276282":"An Efficient Non-dominated Sorting Method for Evolutionary Algorithms","266452090":"Study of Hardware and Software Optimizations of SPEA2 on Hybrid FPGAs","268446623":"Aerodynamic Shape Optimization in Aeronautics: A Fast and Effective Multi-Objective Approach","262353923":"Revisiting the NSGA-II crowding-distance computation","224453315":"A unified model for evolutionary multi-objective optimization and its implementation in a general purpose software framework","220740235":"Multi-objective genetic algorithms for pipe arrangement design","220403335":"Pareto memetic algorithm for multiple objective optimization with an industrial application","220480131":"Multi-objective differential evolution with diversity enhancement","272198547":"An immune multi-objective optimization algorithm with differential evolution inspired recombination","280727316":"Self-organizing Multiobjective Optimization Based on Decomposition with Neighborhood Ensemble","264230925":"A GA-PSO Layer Encoded Hybrid Approach to 0/1 Knapsack Optimization","27313682":"The Trade Off Between Diversity and Quality for Multi-objective Workforce Scheduling","220925593":"A Multi-objective Optimal Approach for UAV Routing in Reconnaissance Mission with Stochastic Observation Time","4090763":"What are the characteristics of optimal Bluetooth scatternets?","225461957":"On the Usefulness of MOEAs for Getting Compact FRBSs Under Parameter Tuning and Rule Selection","221335175":"Multiobjective 0/1 Knapsack Problem using Adaptive epsilon-Dominance.","277605171":"An Algorithm for Many-Objective Optimization With Reduced Objective Computations: A Study in Differential Evolution","220813971":"A Multi-Objective Multi-Modal Optimization Approach for Mining Stable Spatio-Temporal Patterns.","237090207":"Protein Structure Prediction based on Evolutionary Methods","222337667":"Multi-objective optimisation of real-valued parameters of a hybrid MT system using Genetic Algorithms","262614114":"Configuración multi-objetivo de sistemas de producción utilizando estrategias evolutivas","222432911":"Evolutionary algorithms in multiply-specified engineering. The MOEAs and WCES strategies","232626706":"Dynamic Crowding Distance?A New Diversity Maintenance Strategy for MOEAs","221007610":"A hierarchical solve-and-merge framework for multi-objective optimization","237411824":"CHAPTER 1 AN INTRODUCTION TO MULTI-OBJECTIVE EVOLUTIONARY ALGORITHMS AND THEIR APPLICATIONS","223138454":"Multi-Objective Differential Evolution for Automatic Clustering with Application to Micro-Array Data Analysis","280237929":"Development of Pareto-based evolutionary model integrated withdynamic goal programming and successive linear objective reduction","45868377":"Techniques for Highly Multiobjective Optimisation: Some Nondominated Points are Better than Others","51145967":"Deductive Sort and Climbing Sort: New Methods for Non-Dominated Sorting","226118302":"MO-TRIBES, an adaptive multiobjective particle swarm optimization algorithm","236136954":"Using Different Approaches to Approximate a Pareto Front for a Multiobjective Evolutionary Algorithm: Optimal Thinning Regimes for Eucalyptus fastigata","226558580":"A Hybrid Approach Based on Evolutionary Strategies and Interval Arithmetic to Perform Robust Designs","228537961":"Multi-objective sequence dependent setup times flowshop scheduling: a new algorithm and a comprehensive study","221007579":"An Investigation on Evolutionary Gradient Search for Multi-objective Optimization","220380890":"A distributed Cooperative coevolutionary algorithm for multiobjective optimization.","221547213":"Infeasible Elitists and Stochastic Ranking Selection in Constrained Evolutionary Multi-objective Optimization","224294567":"Who\u0027s better? PESA or NSGA II?","260510845":"Multi-Objective Optimal Energy Consumption Scheduling in Smart Grids","225714831":"A cross-docking scheduling problem with sub-population multi-objective algorithms","220288730":"The cross-entropy method in multi-objective optimization: an assessment. Eur J Oper Res","220427997":"A search based approach to fairness analysis in requirement assignments to aid negotiation, mediation and decision making. Requir Eng","222534332":"Multi-objective Optimization using Genetic Algorithms: a Tutorial"},"index":61}