{"abs":"Integral means are important class of bivariate means. In this paper we prove the very general algorithm for calculation of coefficients in asymptotic expansion of integral mean. It is based on explicit solving the equation of the form $B(A(x))\u003dC(x)$, where $B$ and $C$ have known asymptotic expansions. The results are illustrated by calculation of some important integral means connected with gamma and digamma functions.","title":"Asymptotic expansions of integral means and applications to the ratio of gamma functions","id":259151517,"url":"https://www.researchgate.net/publication/259151517_Asymptotic_expansions_of_integral_means_and_applications_to_the_ratio_of_gamma_functions","names":["Neven Elezovic","Lenka Mihoković","Applied Mathematics and Computation"],"references":{"254715336":"The best bounds in Gautschi\u0027s inequality","233292241":"New asymptotic expansions of the quotient of gamma functions","222626034":"Bernoulli polynomials and asymptotic expansions of the quotient of gamma functions","266007757":"Gould, H.W.: Coefficient identities for powers of Taylor and Dirichlet series. Am. Math. Mon. 81, 3-14","266434358":"Differential and integral f-means and applications to digamma function","220388682":"Bernoulli polynomials and asymptotic expansions of the quotient of gamma functions.","284297192":"Asymptotic formulae associated with the Wallis power function and digamma function","44366143":"Asymptotic expansions / A. Erdelyi","229811935":"Asymptotic Expansion","246355633":"Handbook Of Means And Their Inequalities"},"citedIn":{"282534581":"Asymptotic inequalities and comparison of classical means","282223284":"Asymptotic expansions of gamma and related functions, binomial coefficients, inequalities and means","281415182":"Neuman-Sándor mean, asymptotic expansions and related inequalities","280321775":"Asymptotic expansions of bivariate classical means and related inequalities","282526634":"Asymptotic analysis of the iterative power means","280321706":"Asymptotic expansions and comparison of bivariate parameter means"},"index":616}