{"abs":"The instantaneous frequency (IF) is a very important feature of nonstationary signals in numerous applications. The first overview of the concept and application of the IF estimators is presented in seminal papers by Boashash. Since then, a significant knowledge has been gained about the performance of the IF estimators. This knowledge has been used not only for development of various IF estimators but also for introduction of novel time–frequency (TF) representations. The IF estimation in environments characterized by low signal-to-noise (SNR) has achieved significant benefits from these theoretical developments. In this paper, we review some of the most important developments in the last two decades related to the concept of the IF, performance analysis of IF estimators, and development of IF estimators for low SNR environments.","title":"Instantaneous frequency in time–frequency analysis: Enhanced concepts and performance of estimation algorithms","id":266148624,"url":"https://www.researchgate.net/publication/266148624_Instantaneous_frequency_in_time-frequency_analysis_Enhanced_concepts_and_performance_of_estimation_algorithms","names":["Ljubisa Stankovic","Igor Djurovic","Srdjan Stankovic","Marko Simeunović","Slobodan Đukanović","Milos Dakovic","Digital Signal Processing"],"references":{"215754718":"Huang, N.E., et al.: The Empirical Mode Decomposition and the Hilbert Spectrum for Nonlinear and Non-stationary Time Series Analysis. Proc. R. Soc. Lond. A 454, 903-995","3342393":"Algorithm for the instantaneous frequency estimation using time-frequency distributions with adaptive window width","3321145":"Linear and quadratic time-frequency signal representations. IEEE Signal Process Mag","3376446":"Introducing time-frequency distribution with a `complex-time\u0027 argument","224276049":"Discrete evolutionary transform for time-frequency analysis","268353004":"REFINEMENT IN THE ESTIMATION OF MULTICOMPONENT POLYNOMIAL-PHASE SIGNALS","3079996":"Instantaneous frequency estimation using higher order L-Wigner distributions with data-driven order and window length","224393805":"Effects of Cauchy Integral Formula Discretization on the Precision of IF Estimation: Unified Approach to Complex-Lag Distribution and its Counterpart L-Form","3079224":"Nonparametric estimation of instantaneous frequency","3315754":"Analysis of multicomponent LFM signals by a combined Wigner-Hough transform. IEEE Trans Signal Process","3316755":"Product high-order ambiguity function for multicomponent polynomial-phase signal modeling","258715726":"High-Resolution Time-Frequency Representations Based on the Local Polynomial Fourier Transform for Over-the-Horizon Radars","220226314":"On a chirplet transform-based method applied to separating and counting wolf howls","241637964":"Fuzzy Clustering of Seismic Sequences: Segmentation of Time-Frequency Representations","235890211":"The Viterbi algorithm","3384095":"Motion parameter estimation by using time-frequency representations","220121139":"Restructuring speech representations using a pitch adaptive time-frequency smoothing and an instantaneous-frequency based on F0 extraction: possible role of a repetitive structure in sounds. Speech Commun","260061359":"Instantaneous frequency estimation using robust spectrogram with varying window length","3773192":"High-resolution instantaneous frequency estimation based on time-varying AR modeling","3077656":"The Wavelet Transform., Time-Frequency Localisation and Signal Analysis","254062611":"EMD Revisited: A New Understanding of the Envelope and Resolving the Mode-Mixing Problem in AM-FM Signals","225071442":"Adaptive Instantaneous Frequency Estimation of Multicomponent FM Signals Using Quadratic Time–Frequency Distributions","44849044":"Robust Time-Frequency Distributions with Complex-Lag Argument","263128469":"Quasi-maximum-likelihood estimator of polynomial phase signals","222894090":"Time–frequency analysis of multiple resonances in combustion engine signals","2984549":"Estimating and interpreting the instantaneous frequency of a signal. II. Algorithms and applications","2984550":"Estimating and Interpreting The Instantaneous Frequency of a Signal—Part 1: Fundamentals","261091523":"Refinement in the estimation of multicomponent polynomial-phase signals","3319906":"Signal Decomposition by Using the S-Method With Application to the Analysis of HF Radar Signals in Sea-Clutter","223616004":"Signal-to-noise ratio estimation using higher-order moments","3316067":"Localization of the complex spectrum: the S transform. IEEE Trans Signal Process 44: 998-1001","3480418":"Instantaneous frequency estimation based on directionally smoothed pseudo-Wigner-Vill distribution bank","257292046":"Time-Frequency Analysis","43253192":"Time-Frequency Energy Distributions Meet Compressed Sensing","3316077":"Discrete rotational Fourier transform","3077966":"Asymptotic Wavelet and Gabor Analysis: Extraction of instantaneous frequencies","235677804":"Instantaneous Frequency Estimation of Multicomponent Nonstationary Signals Using Multiview Time-Frequency Distributions Based on the Adaptive Fractional Spectrogram","3091279":"Order Adaptive Local Polynomial FT Based Interference Rejection in Spread Spectrum Communication Systems","3318096":"Instantaneous frequency estimation of nonlinear frequency-modulated signals in the presence of multiplicative and additive noise","3006283":"Synthetic Aperture Imaging Radar and Moving Targets","224149050":"Time-frequency rate distributions with complex-lag argument","229811935":"Asymptotic Expansion","3342173":"Analysis of nonlinear FM signals by pattern recognition of their time-frequency representation","3315523":"The fractional Fourier transform and time-frequency representation","224641554":"Estimation of Instantaneous Frequency and Instantaneous Bandwidth via Adaptive Signal Decomposition","3315777":"Discrete polynomial-phase transform","224166959":"Multiwindow S-method for instantaneous frequency estimation and its application in radar signal analysis","224165935":"On Refining Polynomial Phase Signal Parameter Estimates","220321110":"Analysis of polynomial-phase signals by the integrated generalized ambiguity function","262210525":"XWD-algorithm for the instantaneous frequency estimation revisited: Statistical analysis","3613367":"Why and how of time-frequency reassignment","43517721":"Time-Frequency Signal Analysis and Processing: A Comprehensive Reference","257291732":"Wavelets and Subband Coding","3908282":"Instantaneous frequency estimation using discrete evolutionary transform for jammer excision","223109581":"Local polynomial Fourier transform: A review on recent developments and applications","3317168":"A four-parameter atomic decomposition of chirplets","3319984":"Analysis of Multicomponent Polynomial Phase Signals","220058526":"An Efficient Algorithm for Instantaneous Frequency Estimation of Nonstationary Multicomponent Signals in Low SNR","257879770":"A methodology for time-frequency image processing applied to the classification of non-stationary multichannel signals using instantaneous frequency descriptors with application to newborn EEG signals","3342774":"A new technique for instantaneous frequency rate estimation","260061447":"Time-frequency signal analysis with applications","260398613":"Time-Frequency Reassignment and Synchrosqueezing: An Overview","3316129":"Instantaneous frequency estimation of quadratic and cubic FM signals using the cross polynomial Wigner-Ville distribution","242670061":"Implementation of Instantaneous Frequency Estimation based on Time-Varying AR Modeling","229001277":"Estimation of multicomponent signals by using time-frequency representations with application to knock signal analysis","3321001":"Quantitative Performance Analysis of Scalogram as Instantaneous Frequency Estimator","237067905":"Handbook of Blind Source Separation: Independent Component Analysis and Separation","3177360":"Time-Dependent ARMA Modeling of Nonstationary Signals","264673125":"EMD and Teager–Kaiser energy applied to hydrocarbon detection in a carbonate reservoir","256993781":"Fractional Fourier transform as a signal processing tool: An overview of recent developments","3318168":"Robust Wigner distribution with application to the instantaneous frequency estimation","3315584":"Analysis of instantaneous frequency representation using time-frequency distributions-generalized Wigner distribution","3317124":"Multiridge detection and time-frequency reconstruction","259632835":"Time-frequency transforms for radar imaging and signal analysis","258657489":"A Hybrid CPF-HAF Estimation of Polynomial-Phase Signals: Detailed Statistical Analysis","222316167":"Feature identification in the time–frequency plane by using the Hough–Radon transform","3320575":"One or Two Frequencies? The Empirical Mode Decomposition Answers","224306577":"Instantaneous Frequency Estimation Using the ${\\rm S}$ -Transform","224753076":"Comparing Gaussian and chirplet dictionaries for time-frequency analysis using matching pursuit decomposition","222215663":"IF Estimation for Multicomponent Signals Using Image Processing Techniques in the Time-Frequency Domain","3315690":"Flandrin, P.: Improving the Readability of Time-Frequency and Time-Scale Representations by the Reassignment Method. IEEE Trans. Signal Proc. 40, 1068-1089","6520509":"Estimation of Multiple Accelerated Motions Using Chirp-Fourier Transform and Clustering","228575809":"An Alternative Formulation for the Empirical Mode Decomposition","241291905":"New methods and applications of time-frequency analysis","224738948":"Time-varying autoregressive modeling of a class of nonstationary signals","224562817":"Nonlinear IF Estimation Based on the Pseudo WVD Adapted Using the Improved Sliding Pairwise ICI Rule","228407166":"Weighted average instantaneous frequency based on adaptive signal decomposition","3318487":"Performance of quadratic time-frequency distributions as instantaneous frequency estimators","3176408":"Analysis of time-varying signals with small BT values: Acoustics, Speech and Signal Processing","3319001":"Modification of the ICI Rule-Based IF Estimator for High Noise Environments","3316958":"Instantaneous frequency estimation using the Wigner distribution with varying and data-driven window length","256464295":"Instantaneous Frequency Based Newborn EEG Seizures Characterization","3367388":"Estimation of instantaneous frequency using the discrete Wigner distribution","3315136":"Method for time-frequency analysis","2993374":"“The Viterbi Algorithm,”","4015304":"Instantaneous frequency estimation by using Wigner distribution and Viterbi algorithm","3342277":"Comments on the interpretation of instantaneous frequency","3315400":"Linear signal synthesis using the Radon-Wigner transform","3316680":"Performance analysis of instantaneous frequency-based interference excision techniques in spread spectrum communications","228682330":"Fan chirp transform for music representation","3314889":"Use of the cross Wigner-Ville distribution for estimation of instantaneous frequency","3321295":"Joint Time–Frequency Analysis"},"citedIn":{"282625464":"A new music-empirical wavelet transform methodology for time–frequency analysis of noisy nonlinear and non-stationary signals","281612937":"Performance evaluation of the Hilbert-Huang transform for respiratory sound analysis and its application to continuous adventitious sound characterization","277950226":"In-cylinder pressure-based direct techniques and time frequency analysis for combustion diagnostics in IC engines","282497954":"Quasi ML algorithm for 2-D PPS estimation","283036586":"An Accurate Modulation Recognition Method of QPSK Signal","281358412":"An efficient algorithm for harmonic retrieval by combining blind source separation with wavelet packet decomposition","276086814":"On parameters of the QML PPS estimator"},"index":618}