{"abs":"For many applications it is useful to sample from a finite set of objects in accordance with some particular distribution. One approach is to run an ergodic (i.e., irreducible aperiodic) Markov chain whose stationary distribution is the desired distribution on this set; after the Markov chain has run for M steps, with M sufficiently large, the distribution governing the state of the chain approximates the desired distribution. Unfortunately it can be difficult to determine how large M needs to be. We describe a simple variant of this method that determines on its own when to stop, and that outputs samples in exact accordance with the desired distribution. The method uses couplings, which have also played a role in other sampling schemes; however, rather than running the coupled chains from the present into the future, one runs from a distant point in the past up until the present, where the distance into the past that one needs to go is determined during the running of the al...","title":"Exact sampling with couple Markov chains and applications to statistical mechanics","id":220345500,"url":"https://www.researchgate.net/publication/220345500_Exact_sampling_with_couple_Markov_chains_and_applications_to_statistical_mechanics","names":["James Gary Propp","David B. Wilson","Random Structures and Algorithms"],"references":{"278939552":"Minorization conditions and convergence rate for Markov chain Monte Carlo","38331593":"Slow droplet-driven relaxation of stochastic Ising models in the vicinity of the phase coexistence region","38330570":"Bound on the mass gap for finite volume stochastic Ising models at low temperature","252512648":"On Simulating a Markov Chain Stationary Distribution when Transition Probabilities are Unknown","200104426":"Exactly Solved Models in Statistical Mechanics","2096662":"Local statistics for random domino tilings of the Aztec diamond","228057758":"Randomized Dynamic Graph Algorithms with PolyLogarithmic Time per Operation","264959683":"Rank Correlation Methods","38360387":"The Stochastic Random-Cluster Process and the Uniqueness of Random-Cluster Measures","240053444":"Interacting Particle Systems","252774810":"Residual Entropy of Square Ice","13249242":"Equivalence of the dimer resonating-valence-bond problem to the quantum roughening problem","3635366":"Markov chain algorithms for planar lattice structures SIAM","2276275":"The Logarithmic Sobolev Inequality For Discrete Spin Systems On A Lattice","38327898":"Correlational inequalities for partially ordered sets","200111102":"Rank Correlation Methods","210269723":"The Theory of Critical Phenomena: An Introduction to the Renormalisation Group","220533437":"The Random Walk Construction of Uniform Spanning Trees and Uniform Labelled Trees","44476350":"Additive and Cancellative Interacting Particle Systems","2429629":"Studying Convergence of Markov Chain Monte Carlo","2783795":"Generating Random Spanning Trees More Quickly than the Cover Time","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","243787289":"Lectures on the Coupling Method","256392407":"Tiling with polyominoes and combinatorial group theory","13250154":"Collective Monte Carlo Updating for Spin Systems","233950933":"On the Statistical-Analysis of Dirty Pictures","2759693":"Monte Carlo Methods in Statistical Mechanics: Foundations and New Algorithms","38362464":"Ergodic Theorems for Weakly Interacting Infinite Systems and the Voter Model, Ann Probab","200105284":"Monte Carlo study of weighted percolation clusters relevant to the Potts model","232128380":"Generalized Monte Carlo Significance Tests","221932947":"Algebraic Graph Theory","220780546":"Markov Chains for Linear Extensions, The Two-Dimensional Case","220136500":"Stationarity Detection in the Initial Transient Problem.","38362852":"On the Rate of Convergence of the Metropolis Algorithm and Gibbs Sampler by Geometric Bounds","13297663":"Sine-Gordon theory of the non-Néel phase of two-dimensional quantum antiferromagnets","247406985":"Reversible Markov Chains and Random Walks on Graphs","247386633":"Remarks on the FKG inequalities","2103447":"Lattice structure for orientations of graphs","246076818":"Enumerative Combinatorics | Volume 1","257650274":"Algorithms for Random Generation and Couting: a Markov Chain Approach","216900305":"Rank Correlation Method","239582331":"Stochastic Relaxation, Gibbs Distributions and the Bayesian Resoration of Images","242353101":"Group Representations in Probability and Statistics","228057640":"The Probablistic Method","220695960":"The Probabilistic Method","265365904":"Conway\u0027s Tiling Groups","38363016":"Geometric Bounds for Eigenvalues of Markov Chains","220407136":"How to Get a Perfectly Random Sample from a Generic Markov Chain and Generate a Random Spanning Tree of a Directed Graph","220617312":"Approximating the Permanent.","222983936":"Kasteleyn P.W.: On the random cluster model I. Introduction and relation to other models. Physica D 57, 536-564","260161226":"Convergence Rates of the Gibbs Sampler, the Metropolis Algorithm and Other Single-Site Updating Dynamics","41125567":"Exactly Solvable Model for the Roughening Transition of a Crystal Surface","249677744":"Fast Mixing in a Markov Chain","220342774":"Exact Mixing in an Unknown Markov Chain","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","228057930":"Approximating the Permanent","256513198":"Strong uniform times and finite random walks","221498458":"Generating Random Spanning Trees","220690637":"Algorithms for Random Generation and Counting: A Marko Chain Approath","260786401":"The Potts model","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","231123891":"Roughening transitions and the zero-temperature triangular Ising antiferromagnet","2361948":"Algebraic Algorithms for Sampling from Conditional Distributions","2455641":"Markov Chain Algorithms for Planar Lattice Structures","38331702":"For Gibbs state of 2D lattice spin systems weak mixing implies strong mixing"},"citedIn":{"37990979":"Distributed algorithms for dynamic topology construction and their applications","258520937":"Deterministic Random Walks for Rapidly Mixing Chains","228367775":"Perfect Stochastic Summation in High Order Feynman Graph Expansions","221114670":"Gibbs Probability Distributions for Stereo Reconstruction","251479803":"Preparation and Double-Helix Icosahedra Structure of δ-Co 2Zn 15","23635310":"Central limit theorem for the size of the range of a renewal process","273685591":"A Bayesian Approach for the Identification of Genes and Gene-level SNP Aggregates in a Genetic Analysis of Cancer Data","27516329":"Algorithms for Nonuniform Networks","257516371":"Using the M/G/1 queue under processor sharing for exact simulation of queues","2796577":"Perfect Simulation for the Area-Interaction Point Process","222464329":"Faster random generation of linear extensions","242285180":"Image restoration with discrete Level Sets and Total Variation: stochastic aspects","227739039":"Autologistic Models for Binary Data on a Lattice","228828589":"The linked importance sampler auxiliary variable metropolis hastings algorithm for distributions with intractable normalising constants","226510224":"A Polynomial-Time Perfect Sampler for the Q-Ising with a Vertex-Independent Noise","243750547":"A Review of Perfect Simulation in Stochastic Geometry","4213844":"Approximate/perfect samplers for closed Jackson networks","285368599":"Engineering Optimization","47821507":"Bayesian Image Analysis","221366573":"An n-Dimensional Generalization of the Rhombus Tiling","51946246":"Probabilistic Divide-and-Conquer: A New Exact Simulation Method, With Integer Partitions as an Example","222083362":"Gibbs point processes for studying the development of spatial-temporal stochastic processes","265187280":"Multivariate Hawkes Processes","221421869":"Coupling from the Past in Hybrid Models for File Sharing Peer to Peer Systems.","38370902":"Chaînes de Markov Constructives Indexées par Z","3192852":"Bayesian estimation for homogeneous and inhomogeneous Gaussian random fields","277679273":"Bayesian Computation Via Markov Chain Monte Carlo","238606879":"On Perfect Simulation of Certain Queueing Networks","2501633":"Markov Chains for Linear Extensions,","4236391":"Perfect Simulation of Queueing Networks with Blocking and Rejection","254211852":"Transforming spatial point processes into Poisson processes using random superposition","265353212":"Coupling Time in Markovian Queueing Networks","2676740":"Ordering, Slicing And Splitting Monte Carlo Markov Chains","225809752":"A distance-based diagnostic for trans-dimensional Markov chains","4771941":"Perfect Simulation Of Conditionally Specified Models","2106384":"Random Surfaces","2940957":"Regularized Greedy Importance Sampling","4771967":"Bayesian Analysis of Agricultural Field Experiments (with discussion)","2278427":"Perfect Simulation for Sample-Based Inference","234140109":"Inference for Belief Networks Using Coupling From the Past","228666780":"Model based clustering and weighted Chinese restaurant processes","46572283":"Matrices à signes alternants, boucles denses et partitions planes","45909633":"A general framework for perfect simulation of long memory processes","45892227":"Nonparametric Bayesian Density Modeling with Gaussian Processes","267989945":"objsegm – User Manual","240839194":"Perfect sampling from the limit of deterministic products of stochastic matrices","23684393":"A Bayesian approach to gene-gene and gene-environment interactions in chronic fatigue syndrome","220407136":"How to Get a Perfectly Random Sample from a Generic Markov Chain and Generate a Random Spanning Tree of a Directed Graph","24164661":"Perfect simulation of spatial point processes using dominated coupling from the past with application to a multiscale area-interaction point process","3422323":"The Metropolis Algorithm","4742159":"Likelihood Subgradient Densities","24164664":"Perfect simulation for Bayesian wavelet thresholding with correlated coefficients","51934032":"Generalized Direct Sampling for Hierarchical Bayesian Models","222688524":"Perfect sampling from independent Metropolis-Hastings chains","48210581":"Perfect Simulation for Mixtures with Known and Unknown Number of Components","220653932":"Perfect simulation of index based routing queueing networks","24054052":"Bayesian modeling of continuously marked spatial point patterns","242482751":"Statistical Model Checking Approach for Stationary Dependability Verication","220345711":"Coalescing Times for IID Random Variables with Applications to Population Biology","221427069":"Finding a Level Ideal of a Poset","232007044":"The Move-to-Front Rule: A Case Study for two Perfect Sampling Algorithms","228925940":"Output Assessment for Monte Carlo Simulations via the Score Statistic","263773163":"avs rc 2013","228628980":"Stochastic attractors for non-ergodic Markov processes: Some examples","38351388":"Explicit Isoperimetric Constants and Phase Transitions in the Random-Cluster Model","270594165":"Reviving the Two-state Markov Chain Approach (Technical Report)","220321143":"Exact Bayesian curve fitting and signal segmentation","261836748":"Delocalization of two-dimensional random surfaces with hard-core constraints","242295337":"Advances in Markov chain Monte Carlo methods","2585723":"Antithetic Coupling for Perfect Sampling","265109392":"Reducing the Impact of State Space Explosion in Stochastic Automata Networks","7452716":"Relative focus map estimation using blind deconvolution","228540865":"Aspects Of Spatial Statistics, Stochastic Geometry And Markov Chain Monte Carlo Methods","6158338":"Bayesian Analysis of Cross-Classified Spatial Data with Autocorrelation: Multinomial Case","38326824":"Bayesian Model Averaging: A Tutorial","224119097":"Reliability Statistic Estimation on Network via Perfect Sampling","225603863":"An Empirical-Statistical Agenda for Recognition","44230341":"Strukturelle Ansätze für die Stereorekonstruktion","220653902":"On the efficiency of perfect simulation in monotone queueing networks","3335256":"The Random Trip Model: Stability, Stationary Regime, and Perfect Simulation","267680671":"TIME TO COALESCENCE FOR A CLASS OF NONUNIFORM ALLOCATION PROCESSES","5384254":"A Dominated Coupling From The Past algorithm for the stochastic simulation of networks of biochemical reactions","3917898":"The rejection Gibbs coupler: A perfect sampling algorithm and its application to truncated multivariate Gaussian distributions","261128162":"Sampling point processes on stable unbounded regions and exact simulation of queues","38340154":"A Mixture Representation of π with Applications in Markov Chain Monte Carlo and Perfect Sampling","277708025":"Markov Chain Monte Carlo (MCMC)Based in part on the article “Markov chain Monte Carlo (MCMC)” by Galin L. Jones and James P. Hobert, which appeared in the Encyclopedia of Environmetrics .","263230405":"Approximate Bayesian Computation for Exponential Random Graph Models for Large Social Networks","1898603":"Approximate zero-one laws and sharpness of the percolation transition in a class of models including 2D Ising percolation","252715884":"Conductance and Rapidly Mixing Markov Chains","265629609":"On perfect simulation and EM estimation","222538047":"On Markov Chains for Independent Sets","2455641":"Markov Chain Algorithms for Planar Lattice Structures","6362141":"Perfect Sampling of the Master Equation for Gene Regulatory Networks","225727753":"Perfect simulation for point processes given noisy observations","228703711":"An auto-validating, trans-dimensional, universal rejection sampler for locally Lipschitz arithmetical expressions","271601742":"Perfect simulation for models of industry dynamics","2112673":"Perfect Sampling Using Bounding Chains","256663502":"Coupling control variates in dynamic Monte Carlo","4772045":"Bayesian Calibration of Computer Models","38326989":"Computational Advances for and from Bayesian Analysis","226729221":"Spatial Point Processes and the Projection Method","250356324":"Notes on Perfect Simulation","228202774":"How Hedge Funds Beat the Market","258229225":"On the Existence and Nonexistence of Finitary Codings for a Class of Random Fields","11448355":"Ten years on.","50917253":"Time-to-Coalescence for Interacting Particle Systems: Parallel versus Sequential Updating","2847909":"Efficient Use of Exact Samples","274263255":"Scalable Bayesian Inference for the Inverse Temperature of a Hidden Potts Model","242254560":"Markov Chain Monte Carlo Methods for Statistical Inference","3635366":"Markov chain algorithms for planar lattice structures SIAM","2907321":"Compositions of Random Functions on a Finite Set","228597046":"Simulating Language Change in the Presence of Non-Idealized Syntax (Corrected)","220769713":"Perfect simulation and monotone stochastic bounds","241163974":"Perfect Sampling for Fork-Join networks","2124985":"Perfect simulation for a class of positive recurrent Markov chains","4772050":"Perfect slice samplers","220244410":"Efficiency of Time Segmentation Parallel Simulation of Finite Markovian Queueing Networks","221707689":"Bayesian Parameter Estimation for Latent Markov Random Fields and Social\nNetworks","261065488":"Noisy Monte Carlo: Convergence of Markov chains with approximate transition kernels","229521678":"Exact Sampling From Anti-Monotone Systems","241678020":"Analytical and Stochastic Modeling Techniques and Applications - 18th International Conference, ASMTA 2011, Venice, Italy, June 20-22, 2011. Proceedings","254287755":"Discretization of Continuous Markov Chains and Markov Chain Monte Carlo Convergence Assessment","2459776":"Efficient Exact Sampling From the Ising Model Using Swendsen-Wang","258083781":"Exact simulation pricing with Gamma processes and their extensions","228949250":"Steady-state dependability verification by perfect sampling: Comparison study","228339003":"A non-monotone CFTP perfect simulation method","2419843":"From Stochastic Parallel Transport to Harmonic Maps","30513535":"Influence des conditions de bord dans les réseaux d\u0027automates booléens à seuil et application à la biologie","46490219":"Perfect simulation of stationary equilibria","45919756":"High-Dimensional Lipschitz Functions are Typically Flat","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","227703075":"Mode jumping proposals in MCMC","2847898":"Shift-Coupling and Convergence Rates of Ergodic Averages","228031782":"Markov Chain Monte Carlo Simulations","224190953":"A novel approach for the simulation of power quality stationary disturbances in electric power systems","245576214":"Efficient Exact Sampling for the Ising Model at all Temperatures","4743423":"Spatial-Temporal Modeling of Forest Gaps Generated by Colonization From Below- and Above-Ground Bark Beetle Species","228373803":"Perfect Simulation for Image Restoration","220651934":"Perfect Simulation of a Class of Stochastic Hybrid Systems with an Application to Peer to Peer Systems","243265223":"Markov chains in random environments and random iterated function systems","2742417":"On Perfect Simulation for Some Mixtures of Distributions","220345754":"Ten years!","256663540":"Metropolis Procedural Modeling","2427038":"Statistical Inference and Perfect Simulation for Point Processes Observed With Noise","241689305":"Enumeration of octagonal tilings","242383564":"MATHEMATICAL ENGINEERING TECHNICAL REPORTS Polynomial Time Perfect Sampler for Discretized Dirichlet Distribution","2395290":"A Coupling-Regeneration Scheme for Diagnosing Convergence in Markov Chain Monte Carlo Algorithms","221525387":"Perfect simulation of monotone systems for rare event probability estimation","51957671":"Incorporating biological information into linear models: A Bayesian approach to the selection of pathways and genes","273697007":"Surface Patch Modeling and Perfect Simulation in Markov Random Fields","222484867":"Another Involution Principle-Free Bijective Proof of Stanley\u0027s Hook-Content Formula","2127073":"Laws and Likelihoods for Ornstein Uhlenbeck-Gamma and other BNS OU Stochastic Volatilty models with extensions","228768096":"CFTP algorithms for perfect sampling","4771978":"Extensions of Fill\u0027s algorithm for perfect simulation","220652003":"Backward Coupling in Bounded Free-Choice Nets Under Markovian and Non-Markovian Assumptions","32964913":"Universal Transfer Learning","254572523":"Randomized Approximation for Generalized Median Stable Matching","38349441":"Perfect simulation of some point processes for the impatient user","11788412":"Perfect Simulation from Population Genetic Models with Selection","45130367":"Markov Chain Monte Carlo Technology","227623232":"Markov Chain Monte Carlo Method and its applications","33703632":"Dominated coupling from the past and some extensions of the area-interaction process","45910632":"Constructing Summary Statistics for Approximate Bayesian Computation:\nSemi-automatic ABC","235359955":"A criterium for non-uniqueness of $g$ measures","2441459":"Perfect Sampling For Doeblin Chains","232656136":"Statistical Model Checking for Steady State Dependability Verification","225773986":"A Primer on Perfect Simulation for Spatial Point Processes","255645675":"Gaussian random field models for spatial data","266920754":"Modeling and spatial statistics","1764545":"Campbell equilibrium equation and pseudo-likelihood estimation for non-hereditary Gibbs point processes","2926832":"The Random Geometry of Equilibrium Phases","225341872":"Perfect sampling algorithm for small m×n contingency tables","220785096":"Use of Human Motion Biometrics for Multiple-View Registration","51931128":"Explicit error bounds for Markov chain Monte Carlo","220187133":"Fast perfect sampling from linear extensions","228831559":"Steady-state property verification: a comparison study","1754364":"Construction of weakly CUD sequences for MCMC sampling","237424332":"Bounds on the coupling time in acyclic queueing networks","2332873":"Perfect Sampling and Queueing Models","231513382":"Perfect simulation for the Feynman-Kac law on the path space","42608230":"Estimation of Parameters for Macroparasite Population Evolution Using Approximate Bayesian Computation","2864325":"Exact Simulation Using Markov Chains","2102478":"The Random-Cluster Model","228589903":"Construction of stochastic processes, coupling and regeneration","242578053":"Aspects of Temporal and Spatio-temporal Processes","254281690":"Monotonic multigamma coupling for perfect sampling","8433779":"Forest gap dynamics and the Ising model. J Theor Biol","264779580":"An Overview of Stochastic Approximation Monte Carlo","269040892":"Empirical Q-Value Iteration","3921101":"Glauber Dynamics onTrees and Hyperbolic Graphs","253353967":"Polynomial-time Perfect Sampler for Closed Jackson Networks with Single Servers","220286424":"Direct simulation for discrete mixture distributions","51949537":"Attractive regular stochastic chains: Perfect simulation and phase transition","260439935":"Perfect Simulation of $M/G/c$ Queues","220286426":"Perfect simulation of positive Gaussian distributions","2099422":"Ribbon Tilings and Multidimensional Height Functions","2473248":"Towards exact MPM-decision for Labelling Problems","259635839":"Exact Bayesian inference via data augmentation","262426275":"Perfect Sampling of Networks with Finite and Infinite Capacity Queues","45932464":"Mixing Time for the Solid-on-Solid Model","2394408":"Spatial Jump Processes and Perfect Simulation","2859302":"Convergence of Simulation-Based Policy Iteration","228578448":"Selecting nonlinear stochastic process rate models using information criteria","265687751":"Exact Estimation for Markov Chain Equilibrium Expectations","238072612":"Maximum Likelihood Estimation for the Bombing Model","221462573":"The Effect of Boundary Conditions on Mixing Rates of Markov Chains.","238703397":"Perfect Sampling on Continuous State Spaces","220136511":"The double CFTP method","2646281":"Simulating The Invariant Measures Of Markov Chains Using Backward Coupling At Regeneration Times","2411781":"Finite Markov Chains and Algorithmic Applications","220096572":"Exact sampling with highly uniform point sets","48169977":"Exact Sampling for the Ising Model at all Temperatures","225551448":"On the Markov Chain Monte Carlo (MCMC) method","220184630":"Metropolis procedural modeling","220780546":"Markov Chains for Linear Extensions, The Two-Dimensional Case","287193141":"PLAT - Production Lines Analysis Tool","46508014":"Simulating the Dickman distribution","242621274":"Title of dissertation: Estimating Common Odds Ratio","2462986":"Exact sampling for Bayesian inference: towards general purpose algorithms","220345363":"A Bounding Chain for Swendsen-Wang","220874783":"Improvement of a Whole Sentence Maximum Entropy Language Model Using Grammatical Features","37420803":"Understand the Simulation of Mobility Models with Palm Calculus","243043142":"Perfect Simulation for Random Sequential Adsorption of d-Dimensional Spheres with Random Radii","228544676":"Random walks on combinatorial objects","265402090":"Approximate Sampling for Doubly-intractable Distributions and Modeling Choice Interdependence in a Social Network","2112795":"Perte d\u0027information dans les transformations du jeu de pile ou face","2445592":"A Guide to Exact Simulation","2098461":"Generating a random sink-free orientation in quadratic time","2777364":"Bounding Convergence Time of the Gibbs Sampler in Bayesian Image Restoration","2834708":"Extended Renovation Theory and Limit Theorems for Stochastic Ordered Graphs","222572667":"Tile invariants: New horizons","2530663":"Exact Sampling of TCP Window States","2900335":"A Primer on Perfect Simulation","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","257910297":"Random generation of hypotheses in the JSM method using simple Markov chains","2436450":"Exact MAP States and Expectations from Perfect Sampling: Greig, Porteous and Seheult revisited","220136536":"Perfect sampling for queues and network models","228592878":"Perfect simulation of monotone systems with variance reduction","257618443":"Beam search algorithms for multilabel learning","226539729":"Convergence assessment techniques for Markov chain Monte Carlo","228854003":"Parallel generation of samples for simulation techniques applied to Stochastic Automata Networks","251408299":"An Introduction to Markov Chain Monte Carlo Methods","23636016":"Beta-hypergeometric distributions and random continued fractions","237380479":"Rapidly mixing chain and perfect sampler for logarithmic separable concave distributions","2440575":"Exact and Approximate Sampling from the Stationary Distribution of a Markov Chain","3703140":"Learning generic prior models for visual computation","2130241":"Markovianity in space and time","254211653":"On exact sampling of stochastic perpetuities","2645324":"On the Use of Auxiliary Variables in Markov Chain Monte Carlo Sampling","2810178":"A Faster Method for Sampling Independent Sets","234019992":"Bayesian non-parametrics and the probabilistic approach to modelling","2131275":"Distributions of linear functionals of two parameter Poisson--Dirichlet random measures","227635450":"Modern Statistics for Spatial Point Processes*","221055041":"A Note on the Discrete Binary Mumford-Shah Model","254211656":"Exact simulation of the stationary distribution of the FIFO M/G/c queue","225081349":"Coupled MCMC with a randomized acceptance probability","2298198":"Fast Convergence of the Glauber Dynamics for Sampling Independent Sets: Part I","2833756":"A note on convergence rates of Gibbs sampling for nonparametric mixtures","220462171":"Randomized approximation scheme and perfect sampler for closed Jackson networks with multiple servers","222569668":"On the exact simulation of functionals of stationary Markov chains","2120097":"Multiprocess parallel antithetic coupling for backward and forward Markov Chain Monte Carlo","224237791":"Seed: An Easy-to-Use Random Generator of Recursive Data Structures for Testing","232979558":"Pseudo-perfect and adaptive variants of the Metropolis–Hastings algorithm with an independent candidate density","255646388":"On computation using Gibbs sampling for multilevel models","2837921":"Interruptible Exact Sampling in the Passive Case","4772293":"Exact and computationally efficient likelihood-based estimation for discretely observed diffusion processes","242514939":"Deliverable Title: Modelling and Performance Evaluation for Quality of Service in Next Generation Internet","226329837":"Prediction by conditional simulation: models and algorithms","2218416":"Approximate zero-one laws and sharpness of the percolation transition in a class of models including two-dimensional Ising percolation","255656622":"The Random Trip Model, Part II: Stationary Regime and Perfect Simulation1","220357814":"Propp-Wilson Algorithms And Finitary Codings For High Noise Markov Random Fields.","48169801":"Exact sampling for intractable probability distributions via a Bernoulli\nfactory","254417596":"Lazylon: a Lightweight and Churn-aware Membership Protocol","242521059":"Solving the Probabilistic Decoding Problems Using Evolutionary Computation Techniques","44348220":"Markov chains in randon environments and random iterated function systems / órjan Stenflo","221618348":"The Gaussian Process Density Sampler","265365064":"Exact Sampling, Regeneration and Minorization Conditions","37427105":"The Random Trip Model, Part II: Stationary Regime and erfect Simulation","238689184":"Algorithmen und Zufall","220359865":"Detection of Tracks in Aerial Photos by the Gibbs Sampler.","227123218":"Attractors for Ergodic and Monotone Random Dynamical Systems","2404794":"A Comparative Study on the Power of Van-Lieshout and Baddeley\u0027s J-Function","2576825":"Perfect Sampling Without a Lifetime Commitment","2111878":"General state space Markov chains and MCMC algorithms","267221579":"Change of interaction in an Ising dynamic model Surveillance of Spatio-Temporal Patterns: Change of Interaction in an Ising Dynamic Model","2637184":"Perfect Simulation of Point Patterns From Noisy Observations","2801024":"Stopping Tests for Markov Chain Monte-Carlo Methods","234017880":"Perfect simulation for the infinite random cluster model, Ising and\nPotts models at low or high temperature","226109652":"New Coins From Old: Computing With Unknown Bias","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","45903630":"Perfect simulation using dominated coupling from the past with application to area-interaction point processes and wavelet thresholding","2787741":"Shape Analysis of Spinal Curves by Wavelet Warping Using an MCMC Approach","2462098":"Cluster Algorithms for Spatial Point Processes with Symmetric and Shift Invariant Interactions","2430365":"Ecient Exact Sampling From the Ising Model Using Swendsen-Wang","2914708":"Lattice Structures from Planar Graphs","246204176":"Flots de noyaux et flots coalescents","46247807":"A Note on Perfect Slice Sampling","45899522":"Random sampling of lattice paths with constraints, via transportation","46215937":"Marked point processes for statistical and morphological analysis of astronomical data","242429873":"Models and simulation techniques from stochastic geometry","221324530":"An Algorithm of Coupling from the Past with Directional Threshold","228571225":"Perfect Simulation and Non-monotone Markovian Systems","226327739":"Polynomial time approximate or perfect samplers for discretized Dirichlet distribution","10874210":"Ancestral processes for non-neutral models of complex diseases","1874395":"Free energy differences : Representations, estimators, and sampling strategies","257642140":"Efficiency of simulation in monotone hyper-stable queueing networks","228571223":"Finding the Stationary Distribution of ARCH Models Through Perfect Simulation","254877433":"Eight lectures on Mixing Times","2218475":"Expected Coalescence Time for a Nonuniform Allocation Process","222419087":"Friel, N.: Bayesian inference for exponential random graph models. Soc. Netw. 33(1), 41-55","2323948":"Perfect Simulation of Point Processes Given Noisy Observations","225179812":"Exponential Rates of Convergence in the Ergodic Theorem: A Constructive Approach","2582007":"Exact Random Sampling From Independent Sets","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","220357873":"ULD-Lattices and Delta-Bonds.","2208245":"Random even graphs","271620582":"Assessing convergence of the Markov chain Monte Carlo algorithms: A review","2811376":"Markov Chain Monte Carlo for Statistical Inference","2463230":"Using Perfect Sampling in Parameter Estimation of a Whole Sentence Maximum Entropy Language Model","2110973":"Perfect simulation for unilateral fields","227771470":"Bayesian density estimation using Bernstein polynomials","2096639":"A variational principle for domino tilings","38349739":"Perfect simulation of Hawkes processes","3318229":"A Bayesian approach to characterizing uncertainty in inverse problems using coarse and fine-scale information","45894481":"Critical Ising on the Square Lattice Mixes in Polynomial Time","228092010":"MCMC for doubly-intractable distributions","220953817":"Stationary solution approximation using a memory-efficient perfect sampling technique.","227535995":"Perfect samplers for mixtures of distributions","278701417":"Perfect Sampling","239760307":"Backward Sampling in Metropois-Hastings Algorithm for Truncated Posterior Distributions","2487774":"Circularly-Coupled Markov Chain Sampling","244956002":"Ecient Use of Exact Samples","2211293":"Exact sampling of corrugated surfaces","3318220":"Perfect sampling: A review and applications to signal processing","222300350":"Ribbon Tile Invariants from Signed Area","34007033":"Bethe free energy and contrastive divergence approximations for undirected graphical models [microform].","3318221":"Perfect sampling for the wavelet reconstruction of signals","236174355":"Modeling Protein Expression and Protein Signaling Pathways","227414925":"A coupling approach to estimating the Lyapunov exponent of stochastic max-plus linear systems","222302022":"Perfect simulation and moment properties for the Matérn type III process","29503429":"Complete monotone coupling for Markov processes","2096662":"Local statistics for random domino tilings of the Aztec diamond","2128429":"Shuffling cards for blackjack, bridge, and other card games","45926578":"Attractive n-type contact processes","262350253":"Cluster spatial point process models for cosmological applications","43079808":"A Bayesian Framework for Image Segmentation With Spatially Varying Mixtures","227425183":"Coloring percolation clusters at random","12419753":"Aldehyde-mannan antigen complexes target the MHC class I antigen-presentation pathway","2096650":"Computing and Sampling Restricted Vertex Degree Subgraphs and Hamiltonian Cycles","2783795":"Generating Random Spanning Trees More Quickly than the Cover Time","227425168":"Two-sided taboo limits for Markov processes and associated perfect simulation","51918086":"Markov Approximations of chains of infinite order in the\n$\\bar{d}$-metric","225468271":"Classification using distance nearest neighbours","1820164":"Exact sampling from non-attractive distributions using summary states","2101823":"Flows, coalescence and noise","2610695":"Boundary-Dependent Local Behavior For 2-D Dimer Models","228364221":"Skilling, J.: Nested sampling for general Bayesian computation. Bayesian Anal. 1(4), 833-860","280683161":"One-Dimensional Infinite Memory Imitation Models with Noise","2255361":"Markov Chain Monte Carlo and Related Topics","38339690":"Perfect sampling of ergodic Harris chains","267690448":"Spatial Bayesian Variable Selection Models on Functional Magnetic Resonance Imaging Time-Series Data","253304126":"Perfect Sampling: The Basics Perfect Sampling: The Basics","277111459":"Cha\\^{i}nes de Markov Constructives Index\\\u0027{e}es par Z","4020757":"Density estimation for measurement purposes and convergence improvement using MCMC","245581961":"Impact of bias in evolutionary mechanisms: migration among subdivided population and gene conversion among multigene family","238731280":"Exact and Approximate Recursive Calculations for Binary Markov Random Fields Defined on Graphs","220785411":"Image Indexing by Focus Map.","233947100":"Rapid mixing of Swendsen-Wang dynamics in two dimensions","259129695":"Bayesian analysis for partially observed network data, missing ties, attributes and actors","228458419":"The Conditional-Potts Clustering Model","220348176":"Coupling from the past with randomized quasi-Monte Carlo","279309981":"The random walk of an electrostatic field using parallel infinite charged planes","257069419":"Finite Sample Properties of Adaptive Markov Chains via Curvature","35734552":"Convergence of Markov chain Monte Carlo algorithms with applications to image restoration [microform].","230568836":"A class of measure-valued Markov chains and Bayesian nonparametrics","33513411":"Efficient Markovian couplings: Examples and counterexamples","231996398":"Perfect posterior simulation for mixture and hidden Markov models","51890474":"Random walk in a finite directed graph subject to a synchronizing road\ncoloring","49459404":"Bayesian Modelling in Machine Learning: A Tutorial Review","260999601":"Bayesian Analysis for Exponential Random Graph Models Using the Adaptive Exchange Sampler","221016851":"Lecture Notes in Computer Science","228677600":"Memorial Article","48167068":"Perfect Sampling of Markov Chains with Piecewise Homogeneous Events","2395750":"Towards Perfect Sampling for Bayesian Mixture Priors","264160764":"Perfect simulation using atomic regeneration with application to Sequential Monte Carlo","2335328":"Improving Markov chain Monte Carlo Estimators by Coupling to an Approximating Chain","221258612":"A Fast and Exact Algorithm for Total Variation Minimization","2250340":"On some weighted Boolean models.","51940689":"Comparison inequalities and fastest-mixing Markov chains","2115177":"Geometric Ergodicity and Perfect Simulation","263258618":"Generalized Loop-Erased Random Walks and Approximate Reachability","45927667":"Sublinearity of the travel-time variance for dependent first-passage\npercolation","222301969":"Domino tilings and related models: Space of configurations of domains with holes","2695803":"Aspects Of Spatial Statistics, Stochastic Geometry And Markov Chain Monte Carlo Methods","225101631":"Exact and efficient Bayesian inference for multiple changepoint","260995542":"A Spatio-Temporal Nonparametric Bayesian Variable Selection Model of fMRI Data for Clustering Correlated Time Courses.","221367147":"Probability and Computation","220345209":"Perfect simulation with exponential tails on the running time","4996624":"Problem Solving is Often a Matter of Cooking Up an Appropriate Markov Chain","230349798":"Markov Chain Monte Carlo, Introduction","251701596":"Relating time and customer averages for queues using `forward\u0027 coupling from the past","33028010":"An Elementary Rigorous Introduction to Exact Sampling","220950347":"Exploiting Multi-core Architectures in Clusters for Enhancing the Performance of the Parallel Bootstrap Simulation Algorithm","45891804":"Learning to Predict Combinatorial Structures","2672202":"Perfect Sampling of Harris Recurrent Markov Chains","231840691":"Shift and scale coupling methods for perfect simulation","275836434":"A stochastic system with infinite interacting components to model the time evolution of the membrane potentials of a population of neurons","51914107":"Perfect Simulation Of Processes With Long Memory: a \u0027Coupling Into And From The Past\u0027 Algorithm","227425256":"One-shot coupling for certain stochastic recursive sequences","228682695":"Use of SAMC for Bayesian Analysis of Statistical Models with Intractable Normalizing Constants","2142796":"How to Couple from the Past Using a Read-Once Source of Randomness","266730889":"Analytical and Stochastic Modeling Techniques and Applications: 19th International Conference, ASMTA 2012, Grenoble, France, June 4-6, 2012.","233014158":"A survey of average contractive iterated function systems","235895904":"Estimating the Granularity Coefficient of a Potts-Markov Random Field Within a Markov Chain Monte Carlo Algorithm","228735955":"Asymptotic properties of ESTAR models","221111135":"Perturb-and-MAP random fields: Using discrete optimization to learn and sample from energy models","4741693":"Transdimensional Markov Chains: A Decade of Progress and Future Perspectives","29623218":"Bounds for the Coupling Time in Queueing Networks Perfect Simulation","2629214":"Perfect simulation for correlated Poisson random variables conditioned to be positive","4215351":"Motion-based flexible camera registration","2575965":"Monte Carlo Inference for Belief Networks Using Coupling From the Past","2481753":"Polynomial Time Perfect Sampling Algorithm for Two-rowed Contingency Tables","225270547":"Perfect Simulation for a Stationary Silo with Absorbing Walls","3318349":"Multiuser detection of synchronous code-division multiple-access signals by perfect sampling","2451108":"Presentation Des Travaux","2857641":"Small and Pseudo-Small Sets for Markov Chains","225302510":"Approximation algorithms for the normalizing constant of Gibbs\ndistributions","38352076":"Perte d’information dans les transformations du jeu de pile ou face","48203862":"Reachability and recurrence in a modular generalization of annihilating random walks (and lights-out games) on hypergraphs","2347690":"On the Existence and Non-Existence of Finitary Codings for a Class of Random Fields","228916014":"Surface Patch Modeling and Perfect Simulation in Markov Random Fields","228838191":"Efficient and scalable steady-state dependability verification","23795684":"Four lectures on computational statistical physics","220779450":"How to Get an Exact Sample From a Generic Markov Chain and Sample a Random Spanning Tree From a Directed Graph, Both Within the Cover Time.","239133910":"Ergodic Theorems for Markov Chains Represented by Iterated Function Systems","228566793":"Label Ranking Algorithms: A Survey","225304570":"Non-Uniform Random Variate Generation","51958147":"Developments in Perfect Simulation of Gibbs Measures Through a New Result for the Extinction of Galton-Watson-Like Processes","239155422":"Cluster Sampling and its Applications to Segmentation, Stereo and Motion","248619086":"Transforming an Arbitrary Minsum Problem into a Binary One","229026567":"Perfect simulation, monotonicity and finite queueing networks","38389997":"Perfectly random sampling of truncated multinormal distributions","221628305":"Monotonicity and Efficient Computation of Bounds with Time Parallel Simulation","262246661":"Localization and Exact Simulation of Brownian Motion-Driven Stochastic Differential Equations","259875288":"Space-time information percolation for the stochastic Ising model","2577025":"Coupling from the Past: a User\u0027s Guide","220345221":"Random Dyadic Tilings of the Unit Square","238879895":"Transdimensional Markov Chains","220342152":"Generating Random Elements of Finite Distributive Lattices","4788962":"On an adaptive version of the Metropolis-Hastings algorithm with independent proposal distribution","38008047":"Natively probabilistic computation","242281693":"Perfect simulation: A (short) survey","226974506":"Directed Markov Point Processes as Limits of Partially Ordered Markov Models","5800693":"Model selection and Bayesian methods in statistical genetics: Summary of Group 11 contributions to Genetic Analysis Workshop 15","228564784":"Solving Stochastic Difference Equations Originated from Continuous-time Threshold AR (1) Models Through Perfect Simulation","50353583":"Perfect simulation for locally continuous chains of infinite order","259441094":"Uniform Ergodicity of the Iterated Conditional SMC and Geometric Ergodicity of Particle Gibbs samplers","221405059":"Probabilistic Structured Predictors.","227716896":"Coupling from the past times with ambiguities and perturbations of\ninteracting particle systems","45860873":"Ancestral Graph with Bias in Gene Conversion","227604259":"Likelihood and Non‐parametric Bayesian MCMC Inference for Spatial Point Processes Based on Perfect Simulation and Path Sampling","45861896":"Gallo, S.: Chains with unbounded variable length memory: perfect simulation and visible regeneration scheme. Adv. Appl. Probab. 43, 735-759","221027224":"Statistical Model Checking Using Perfect Simulation","2721436":"Automatic Reconstruction with Inhomogeneous Models","227093311":"Spatial Averages of Coverage Characteristics in Large CDMA Networks","265428325":"A Regeneration Proof of the Central Limit Theorem for Uniformly Ergodic Markov Chains","262314264":"An Empirical-Statistical Agenda for Recognition","221661064":"A Class Coupler for Perfect Sampling from Continuous Distributions With\nand Without Atoms","272829181":"TPA: A New Method For Approximate Counting","251293754":"Coupling Iterated Kolmogorov Diffusions","236264661":"A Monte Carlo Metropolis-Hastings Algorithm for Sampling from Distributions with Intractable Normalizing Constants","221426679":"A Polynomial-Time Perfect Sampler for the Q-Ising with a Vertex-Independent Noise.","262993257":"Delocalization of Two-Dimensional Random Surfaces with Hard-Core Constraints","2477795":"Polynomial Time Perfect Sampler for Discretized Dirichlet Distribution","2493153":"Using Perfect Sampling in Parameter Estimation of a Whole Sentence Maximum Entropy Language Model","237535456":"Monotonicity and complete monotonicity for continuous-time Markov Chains","281449998":"Perfect simulation for the Feynman-Kac law on the path space (simpler presentation and additional examples)","269876959":"Point Process-based Monte Carlo Estimation","225518524":"Exact Simulation for Discrete Time Spin Systems and Unilateral Fields","274968238":"Decision Making Under Uncertain Segmentations","266967335":"Approximate Maximum Likelihood Estimation of the Autologistic Model","5273246":"Boundary conditions and phase transitions in neural networks. Simulation results","4216464":"Distributed Uniform Sampling in Unstructured Peer-to-Peer Networks","4364946":"A fast approximation algorithm for the Lyapunov exponent of stochastic max-plus systems","237054192":"Bayesian nonparametric analysis of reversible Markov chains","228880246":"On compositions of random functions on a finite set","2367222":"The Randomness Recycler Approach to Perfect Sampling","227694405":"A Class of Normalized Random Measures with an Exact Predictive Sampling Scheme","2616063":"Bayesian Inference for Spatial Point Processes Via Perfect Sampling","2579198":"The swap move: a tool for building faster Markov chains","220617727":"Approximation Algorithm and Perfect Sampler for Closed Jackson Networks with Single Servers","226256807":"Forests, colorings and acyclic orientations of the square lattice","273350295":"Perfect and nearly perfect sampling of work-conserving queues","2819829":"Quermass-Interaction Processes: Conditions for Stability","2821877":"Perfect Metropolis-Hastings simulation of locally stable point processes","259927456":"On Randomized Approximation for Finding a Level Ideal of a Poset and the Generalized Median Stable Matchings","2856692":"Speeding up the FMMR Perfect Sampling Algorithm: A Case Study Revisited","2344643":"Percolation","2292418":"Extension of Fill\u0027s perfect rejection sampling algorithm to general chains (Extended abstract) in Monte Carlo Methods","270763714":"Standardness of monotonic Markov filtrations","242404504":"Advances and applications in perfect sampling","267759902":"A* Sampling","2302664":"Perfect Simulation Involving a Continuous and Unbounded State Space","4227758":"A Statistical Inference Comparison for Measurement Estimation: Application to the Estimation of Groove Dimensions by RFEC","228875092":"Distributed Uniform Sampling in Real-World Networks","262152528":"Tradeoff between accuracy and efficiency in the time-parallel simulation of monotone systems","222653364":"Simulating the maximum of a random walk","31327020":"Computational complexity of Markov chain Monte Carlo methods for finite Markov random fields","45867085":"Perfect Simulation of Vervaat Perpetuities","2802387":"Convergence in the Wasserstein Metric for Markov Chain Monte Carlo Algorithms with Applications to Image Restoration","222420923":"Understanding the Simulation of Mobility Models with Palm Calculus","250361878":"Random even graphs and the Ising model","4871857":"Parallel simulation of transfer lines by time segmentation","29603523":"Le modèle d\u0027Ising","276386680":"Perfect sampling of Jackson Queueing Networks","38339915":"Processes with long memory: Regenerative construction and perfect simulation","2672427":"Parallel computing and Monte Carlo algorithms","1901336":"Coupling times with ambiguities for particle systems and applications to context-dependent DNA substitution models","221437495":"Exact Sampling in Machine Scheduling Problems.","262352043":"Introduction to Monte Carlo Methods","222668364":"Tilings of rectangles with T-tetrominoes","224056915":"A Novel Approach to the Simulation of Power Quality Disturbances in Electric Power Systems","50996224":"Handbook of Monte Carlo Methods","227776159":"On Exact Simulation of Markov Random Fields Using Coupling from the Past","7641977":"Generalizing Swendson-Wang to sampling arbitrary posterior probabilities","228719280":"Markov Chains, Iterated System of Functions and Coupling time for Perfect Simulation","228570764":"Flots de noyaux et flots coalescents: Flows of kernels and coalescing flows","277194641":"A Note on the Folding Coupler","259115108":"An Integrative Bayesian Modeling Approach to Imaging Genetics","2096905":"The Randomness Recycler: A new technique for perfect sampling","2620208":"Perfect Simulation of an Inventory Model for Perishable Products","2949943":"Note on Rejection sampling and exact sampling with the Metropolised Independence Sampler","225372748":"Efficient Simulation and Likelihood Methods for Non-Neutral Multi-Allele Models","268072153":"Computer performance engineering. 9th European workshop, EPEW 2012, Munich, Germany, July 30, 2012, and 28th UK workshop, UKPEW 2012, Edinburgh, UK, July 2, 2012. Revised selected papers","257557625":"Analysis of binary data via a centered spatial-temporal autologistic regression model","228848263":"On monotonicity of finite capacity queueing networks and their perfect simulation","2334468":"Perfect Simulation for Reed-Frost Epidemic Models","51928112":"A Gibbs Sampler on the n-Simplex","221406744":"PSI2 : Envelope Perfect Sampling of Non Monotone Systems","251704362":"ULD-lattices and -Bonds","222601838":"Biased random walk in a one-dimensional percolation model","220769795":"Backward Coupling in Petri nets","265428223":"Random Colourings of Lattice Graphs","220866055":"Perfect Simulation of Stochastic Automata Networks","264936676":"Exploiting Multi-Core Architectures for Reduced-Variance Estimation with Intractable Likelihoods","246994326":"Omniparametric simulation of the two-type Richardson model","271856410":"Statistical model checking for unbounded until formulas","220286483":"MCMC Sampler Convergence Rates for Hierarchical Normal Linear Models: A Simulation Approach","220866073":"Perfect Sampling of Phase-Type Servers Using Bounding Envelopes","45926789":"Spatial birth-death swap chains","2611998":"Exact Sampling for Bayesian Inference: Unbounded State Spaces","27468515":"An efficient MCMC method for distributions with intractable normalising constants","255588474":"An upper bound on the convergence time of the Gibbs sampler in Ising models","220286563":"Estimating likelihoods for spatio-temporal models using importance sampling","2637675":"Mathematical Foundations of the Markov Chain Monte Carlo Method","221437559":"A Note on Bounding the Mixing Time by Linear Programming","268820290":"Probabilistic divide-and-conquer: deterministic second half","265920670":"Bayesian Analysis for Exponential Random Graph Models Using the Double Metropolis-Hastings Sampler","261043400":"Sampling Online Social Networks Using Coupling From The Past","220866146":"Perfect Sampling of Load Sharing Policies in Large Scale Distributed Systems","254287968":"Markov Chain Monte Carlo: 10 Years and Still Running!","50341960":"Random Generation Using Binomial Approximations","254287969":"Empirical Bayes: Past, Present and Future","2136942":"On the invariant distribution of a one-dimensional avalanche process","221306494":"Performance Issues for Parallel Implementations of Bootstrap Simulation Algorithm","254287975":"Missing data: Dial M for","45867503":"Simulation Reductions for the Ising Model","242079035":"THE RANDOMNESS RECYCLER: A NEW APPROACH TO PERFECT SIMULATION","2349940":"Markov Chains: Structure and Applications","2143097":"Perfect simulation for interacting point processes, loss networks and\nIsing models","220286587":"Bayesian inference for pairwise interacting point processes","228586179":"Bayesian Parameter Estimation in Ising and Potts Models: A Comparative Study with Applications to Protein Modeling","2095938":"Stochastic Monotonicity and Realizable Monotonicity","221611627":"Improving Time Parallel Simulation for Monotone Systems.","271140726":"Fully Bayesian Binary Markov Random Field Models: Prior Specification and Posterior Simulation","2418502":"Clustering Methods based on Variational Analysis in the Space of Measures","268988267":"Unbiased Monte Carlo: posterior estimation for intractable/infinite-dimensional models","227413739":"Practical simulation and estimation for Gibbs Delaunay-Voronoi tessellations with geometric hardcore interaction","251481499":"PO07MO10 Rhinocerebral mucormycosis: a case report","6839042":"Perfect Simulation From Nonneutral Population Genetic Models: Variable Population Size and Population Subdivision","5844790":"Solvable models of neighbor-dependent substitution processes","267223197":"Sampling Strategies for MCMC","37988658":"Simulation of ancestral graphs for Monte Carlo integration","220866139":"Different Monotonicity Definitions in Stochastic Modelling","220765785":"On Generating All Optimal Monotone Classifications","2440022":"Convergence Rates For Monte Carlo Experiments","245857746":"Fast convergence of the Glauber dynamics for sampling independent sets","2376529":"Exact MAP States and Expectations from Perfect Sampling: Greig, Porteous and Seheult revisited","220743263":"Towards a self-stopping evolutionary algorithm using coupling from the past","2824028":"Simulating Perpetuities","24082967":"A review of image-warping methods","227037937":"The Mathematics of Mixing Things Up","2461528":"A New Method for Coupling Random Fields","220146274":"Image Restoration with Discrete Constrained Total Variation Part I: Fast and Exact Optimization","266209441":"A Perfect Sampling Algorithm of Random Walks with Forbidden Arcs","261254163":"Exact Sampling of Stationary and Time-Reversed Queues","3880889":"The randomness recycler: a new technique for perfect sampling","270454683":"An exposition to information percolation for the Ising model","43020565":"Convergence and coupling for spin glasses and hard spheres","220779169":"Tiling groups for Wang tiles.","251186546":"Ergodic averages for monotone functions using upper and","4791234":"The Candy model: Properties and inference","2302893":"Towards a More General Propp-Wilson Algorithm: Multistage Backward Coupling","241303022":"Upper Bounds for Markov Approximations of Ergodic Processes","267933800":"Coupling: Cutoffs, CFTP and Tameness","220599990":"Size-biased random closed sets","254464186":"Linear space direct pattern sampling using coupling from the past","223686340":"Efficiency test of pseudorandom number generators using random walks","2860990":"Combinatorial identities associated with CFTP","224943856":"Probabilistic Structured Predictors","226551325":"One-Shot CFTP; Application to a Class of Truncated Gaussian Densities","276477927":"Perfect sampling of a single-server queue with periodic Poisson arrivals","262251583":"Acceleration of perfect sampling by skipping events","267196531":"STATISTIQUE SPATIALE","226034406":"Higher Order Models using Entropy, Markov Random Fields and Sequential Simulation","31144571":"A recursive algorithm for Markov random fields","259312853":"Perfect sampling for infinite server and loss systems","4277218":"Psi^2 a Software Tool for the Perfect Simulation of Finite Queueing Networks","38351340":"The Ising model on diluted graphs and strong amenability","3949467":"Blocked stochastic sampling versus Estimation of Distribution Algorithms","224651972":"Method for the calculation of power quality indices","241527245":"Computation Intensive Methods: State of the Art","253095101":"Coupling, renewal and perfect simulation of chains of infinite order","264960099":"Perfect simulation and backward coupling","242997712":"Perfect sampling for Bayesian variable selection in a linear regression model","2465678":"Parametric Modelling of Functional Magnetic Resonance Imaging Data","3091331":"Markov Chain Monte Carlo Posterior Density Approximation for a Groove-Dimensioning Purpose","3094429":"A Statistical Inference Comparison for Measurement Estimation Using Stochastic Simulation Techniques","2139027":"The shape of a typical boxed plane partition","223088376":"Deviation from power law, spatial data of forest canopy gaps, and three lattice models","242561472":"Computer Intensive Methods \u0026 Spatial Statistics with an emphasis on perfect simulation and spatial point processes","45894923":"Reversible jump Markov chain Monte Carlo","2527134":"Extrapolating and Interpolating Spatial Patterns","29599354":"Exact Random Generation of Symmetric and Quasi-symmetric Alternating-sign Matrices","228915743":"An Upper Bound for the Coupling Time of (Max,+){Linear Systems","4789234":"Perfect Simulation for Length-interacting Polygonal Markov Fields in the Plane","267258963":"Some Non-Standard Sequential Monte Carlo Methods and Their Applications","220779159":"Determinant Algorithms for Random Planar Structures.","263736441":"Universality of cutoff for the Ising model","222606982":"Computational issues for perfect simulation in spatial point patterns","228645474":"Searching for Rare Growth Factors Using Multicanonical Monte Carlo Methods","254421225":"Distributions of Functionals of the two Parameter Poisson-Dirichlet Process","2302944":"Exact Sampling Using Auxiliary Variables","2283495":"Edge Effects On Local Statistics In Lattice Dimers: A Study Of The Aztec Diamond (finite Case)","263812220":"Perfect sampling for closed queueing networks","266018832":"Probability theory. 2nd revised ed","265497630":"J-OMINO PACKINGS","3192829":"Synchronous random fields and image restoration","228395600":"Realizable monotonicity and inverse probability transform","266853416":"Antiretroviral drug distribution routing system in Limpopo province, South Africa. Journal of Mathematics and System Science.","2627559":"An Interruptible Algorithm for Perfect Sampling via Markov Chains","47524100":"Using TPA to count linear extensions","215446278":"The Markov Chain Monte Carlo Revolution","236686793":"An Integrative Bayesian Modeling Approach to Imaging Genetics","268022826":"Minimal Covers of Maximal Cliques for Interval Graphs","232862258":"A double Metropolis–Hastings sampler for spatial models with intractable normalizing constants","277791576":"Use of spatial models and the MCMC method for investigating the relationship between road traffic pollution and asthma amongst children","248132886":"Towards Automatic Reversible Jump Markov Chain Monte Carlo","220320451":"Exact and Approximate Sampling by Systematic Stochastic Search","29618727":"Index routing for task allocation in Grids","2290631":"Extension of Fill\u0027s perfect rejection sampling algorithm to general chain","228573817":"Perfect sampling of stationary rewards of Markov chains","225180291":"Scaling of program functionality","227423846":"Realizable monotonicity for continuous-time Markov processes","220852928":"Importance Resampling for Global Illumination","26532478":"Variable Selection by Perfect Sampling","240925111":"MCMC Methods to Estimate Bayesian Parametric Models","2444232":"Bayesian Calibration of Complex Computer Models","220601032":"Perfect Simulation in Stochastic Geometry","5386144":"A Bayesian genome-wide linkage analysis of quantitative traits for rheumatoid arthritis via perfect sampling","23740062":"Tiling Groups for Wang Tiles","225099422":"Monotone Queuing Networks and Time Parallel Simulation","30072383":"Computational statistics with environmental and remote sensing applications","2728927":"An extension of Fill\u0027s exact sampling algorithm to non-monotone chains","2108379":"Glauber Dynamics on Trees and Hyperbolic Graphs","2828240":"Exact Sampling and Approximate Counting Techniques","258247832":"Perfect Simulation of Determinantal Point Processes","222819000":"Perfect simulation for marked point processes","45920579":"Perfect simulation for stochastic chains of infinite memory: relaxing the continuity assumption"},"index":623}