{"abs":"The aim of this work is to address the question of whether we can in principle design rational decision-making agents or artificial intelligences embedded in computable physics such that their decisions are optimal in reasonable mathematical senses. Recent developments in rare event probability estimation, recursive bayesian inference, neural networks, and probabilistic planning are sufficient to explicitly approximate reinforcement learners of the AIXI style with non-trivial model classes (here, the class of resource-bounded Turing machines). Consideration of the effects of resource limitations in a concrete implementation leads to insights about possible architectures for learning systems using optimal decision makers as components. Comment: Submitted to MDPI Algorithms Special Issue \"Algorithmic Complexity in Physics \u0026 Embedded Artificial Intelligences\"","title":"A Monte Carlo Algorithm for Universally Optimal Bayesian Sequence Prediction and Planning","id":45895681,"url":"https://www.researchgate.net/publication/45895681_A_Monte_Carlo_Algorithm_for_Universally_Optimal_Bayesian_Sequence_Prediction_and_Planning","names":["Anthony Di Franco"],"references":{"14100213":"Flat Minima","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","2834210":"The Speed Prior: A New Simplicity Measure Yielding Near-Optimal Computable Predictions","247868527":"The Essence of Winning and Losing","227298629":"Ultimate Cognition à la Gödel","220500234":"Learning Complex, Extended Sequences Using the Principle of History Compression","10862955":"Kalman filters improve LSTM network performance in problems unsolvable by traditional recurrent nets","221497725":"The Speed Prior: A New Simplicity Measure Yielding Near-Optimal Computable Predictions","222688016":"Introduction to computability logic","2386194":"A Sparse Sampling Algorithm for Near-Optimal Planning in Large Markov Decision Processes","26856431":"A Sequential Monte Carlo Method for Bayesian Analysis of Massive Datasets","1956069":"Optimal Ordered Problem Solver","243772509":"Neural Networks and Analog Computation: Beyond the Turing Limit","2256541":"Turing Machines are Recurrent Neural Networks"},"citedIn":{},"index":626}