{"abs":"This article deals with the spatio-temporal sensors deployment in order to maximize detection probability of an intelligent and randomly moving target in an area under surveillance. Our work is based on the rare events simulation framework. More precisely, we derive a novel stochastic optimization algorithm based on the generalized splitting method. This new approach offers promising results without any state-space discretization and can handle various types of constraints.","title":"Splitting method for spatio-temporal search efforts planning","id":51892081,"url":"https://www.researchgate.net/publication/51892081_Splitting_method_for_spatio-temporal_search_efforts_planning","names":["Chouchane Mathieu","Paris Sébastien","Le Gland François","Ouladsine Mustapha"],"references":{"24116174":"Fitting an Origin-Displaced Logarithmic Spiral to Empirical Data by Differential Evolution Method of Global Optimization","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","227307272":"Snap and Spread: A Self-deployment Algorithm for Mobile Sensor Networks","235084615":"Track Spacing for An Archimedes Spiral Search by a Maritime Patrol Aircraft (MPA) in Anti-Submarine Warfare (ASW) Operations","244975318":"Using Multiple Searchers in Constrained-Path, Moving-Target Search Problems","3003683":"Survey of Maneuvering Target Tracking. Part I: Dynamic Models","220157872":"Design of a sensor network for target detection","226592753":"The Gibbs Cloner for Combinatorial Optimization, Counting and Sampling","241901368":"Branch and Bound methods for a Search Problem","221454794":"Effective solutions for real-world Stackelberg games: When agents must deal with human uncertainties","220288730":"The cross-entropy method in multi-objective optimization: an assessment. Eur J Oper Res","220375001":"An Overview of Evolutionary Algorithms for Parameter Optimization","221456109":"Deployed ARMOR protection: The application of a game theoretic model for security at the Los Angeles International Airport"},"citedIn":{"262160020":"Splitting Method for Spatio-temporal Sensors Deployment in Underwater Systems"},"index":631}