{"abs":"We consider robust resource allocation of services in Clouds. More specifically, we consider the case of a large public or private Cloud platform that runs a relatively small set of large and independent services. These services are characterized by their demand along several dimensions (CPU, memory,...) and by their quality of service requirements, that have been defined through an SLA in the case of a public Cloud or fixed by the administrator in the case of a private Cloud. This quality of service defines the required robustness of the service, by setting an upper limit on the probability that the provider fails to allocate the required quantity of resources. This maximum probability of failure can be transparently turned into a pair (price,penalty). Failures can indeed hit the platform, and resilience is provided through service replication. Our contribution is two-fold. First, we propose a resource allocation strategy whose complexity is logarithmic in the number of resources, what makes it very efficient for large platforms. Second, we propose an efficient algorithm based on rare events detection techniques in order to estimate the robustness of an allocation, a problem that has been proven to be P-complete. Finally, we provide an analysis of the proposed strategy through an extensive set of simulations, both in terms of the overall number of allocated resources and in terms of time necessary to compute the allocation.","title":"Efficient and Robust Allocation Algorithms in Clouds under Memory Constraints","id":258082621,"url":"https://www.researchgate.net/publication/258082621_Efficient_and_Robust_Allocation_Algorithms_in_Clouds_under_Memory_Constraints","names":["Olivier Beaumont","Lionel Eyraud-Dubois","Paul Renaud-Goud"],"references":{"220941227":"Energy Efficient Allocation of Virtual Machines in Cloud Data Centers","221996154":"Probability Inequalities For Sums of Bounded Random Variables","200045935":"Above the Clouds: A Berkeley View of Cloud Computing","257650271":"Approximation Algorithms for NP-Hard Problems","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","226683077":"A Primer in Column Generation","260358216":"Heterogeneous Resource Allocation under Degree Constraints","38367431":"“A Measure of Asymptotic Efficiency for Tests of a Hypothesis Based on a Sum of Observations,”","221085218":"Checkpointing vs. Migration for Post-Petascale Supercomputers","278797836":"Reliable Service Allocation in Clouds with Memory and Capacity Constraints","222707797":"An on-line replication strategy to increase availability in Data Grids","261148103":"Reliable Service Allocation in Clouds","258407548":"Job Scheduling Strategies for Parallel Processing","48416185":"Checkpointing strategies for parallel jobs","221428777":"Online Bin Packing with Resource Augmentation.","262326398":"Heterogeneity and dynamicity of clouds at scale: Google trace analysis","220617721":"The Complexity of Counting Cuts and of Computing the Probability that a Graph is Connected","235639060":"Approximation Algorithms for Energy Minimization in Cloud Service Allocation under Reliability Constraints","277295384":"Above the Clouds: A Berkeley View of Cloud Computing","43193585":"SLA-Aware Virtual Resource Management for Cloud Infrastructures","220232579":"Improving the Availability of Supercomputer Job Input Data Using Temporal Replication","225252747":"Cloud Computing: State-of-the-art and Research Challenges","262292874":"Multi-criteria Checkpointing Strategies: Response-Time versus Resource Utilization","230596114":"The Scope of Integer and Combinatorial Optimization","224144045":"Performance Study of Parallel Programming on Cloud Computing Environments Using MapReduce","220851864":"and VMWare. Improving MapReduce Performance in Heterogeneous Environments","220851866":"MapReduce: Simplified Data Processing on Large Clusters","220783003":"Evaluating the viability of process replication reliability for exascale systems","220695890":"Computers and Intractability, A Guide To The Theory of NP-Completeness","220457110":"Fault Tolerance in Petascale/ Exascale Systems: Current Knowledge, Challenges and Research Opportunities","2425629":"Branch-and-Price: Column Generation for Solving Huge Integer Programs","221084180":"A Heuristic for Mapping Virtual Machines and Links in Emulation Testbeds","220618207":"Valiant, L.G.: The complexity of enumeration and reliability problems. SIAM J. Comput. 8, 410-421","46648381":"A Note on the Complexity of Network Reliability Problems","46116227":"Energy-Efficient Cloud Computing","220457311":"The International Exascale Software Project: a Call To Cooperative Action By the Global High-Performance Community","4193152":"Improving Data Availability through Dynamic Model-Driven Replication in Large Peer-to-Peer Communities","229024281":"Trading Cycles for Information: Using Replication to Schedule Bag-of-Tasks Applications on Computational Grids"},"citedIn":{},"index":634}