{"abs":"We present a new generic minimum cross-entropy method, called the semi-iterative MinxEnt, or simply SME, for rare-event probability estimation, counting, and approximation of the optimal solutions of a broad class of NP-hard linear integer and combinatorial optimization problems (COP’s). The main idea of our approach is to associate with each original problem an auxiliary single-constrained convex MinxEnt program of a special type, which has a closed-form solution. We prove that the optimal pdf obtained from the solution of such a specially designed MinxEnt program is a zero variance pdf, provided the “temperature” parameter is set to minus infinity. In addition we prove that the parametric pdf based on the product of marginals obtained from the optimal zero variance pdf coincides with the parametric pdf of the standard cross-entropy (CE) method. Thus, originally designed at the end of 1990s as a heuristics for estimation of rare-events and COP’s, CE has strong connection with MinxEnt, and thus, strong mathematical foundation. The crucial difference between the proposed SME method and the standard CE counterparts lies in their simulation-based versions: in the latter we always require to generate (via Monte Carlo) a sequence of tuples including the temperature parameter and the parameter vector in the optimal marginal pdf’s, while in the former we can fix in advance the temperature parameter (to be set to a large negative number) and then generate (via Monte Carlo) a sequence of parameter vectors of the optimal marginal pdf’s alone. In addition, in contrast to CE, neither the elite sample no the rarity parameter is needed in SME. As result, the proposed SME algorithm becomes simpler, faster and at least as accurate as the standard CE. Motivated by the SME method we introduce a new updating rule for the parameter vector in the parametric pdf of the CE program. We show that the CE algorithm based on the new updating rule, called the combined CE (CCE), is at least as fast and accurate as its standard CE and SME counterparts. We also found numerically that the variance minimization (VM)-based algorithms are the most robust ones. We, finally, demonstrate numerically that the proposed algorithms, and in particular the CCE one, allows accurate estimation of counting quantities up to the order of hundred of decision variables and hundreds of constraints.","title":"Semi-Iterative Minimum Cross-Entropy Algorithms for Rare-Events, Counting, Combinatorial and Integer Programming","id":225579612,"url":"https://www.researchgate.net/publication/225579612_Semi-Iterative_Minimum_Cross-Entropy_Algorithms_for_Rare-Events_Counting_Combinatorial_and_Integer_Programming","names":["Reuven Rubinstein","Methodology And Computing In Applied Probability"],"references":{"261662232":"Elements of Information Theory","230873347":"Stochastic Programming, Handbook in Operations Research and Management Science","222461568":"Optimization of computer simulation models with rare events. Eur J Oper Res","200110894":"Probability and Computing : Randomized Algorithms and Probabilistic Analysis","242382129":"Randomized Algorithms A short course on randomized algorithms and the probabilistic method","265332852":"Letter to the Editor—-A Closed Form Solution of Certain Programming Problems","210222819":"Simulation and the Monte Carlo Method","220327268":"Discrete Event Simulation: Modeling, Programming, and Analysis","11224364":"Computer science: Satisfied with physics","228057840":"Randomized Algorithms","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","225694233":"How Many Needles are in a Haystack, or How to Solve #P-Complete Counting Problems Fast","226538122":"A Stochastic Minimum Cross-Entropy Method for Combinatorial Optimization and Rare-event Estimation*","220669261":"A Study on the Cross-Entropy Method for Rare-Event Probability Estimation","2484042":"The Cross-Entropy Method for Combinatorial and Continuous Optimization","242929962":"Penalty Functions and Duality in Stochastic Programming Via Divergence Functionals","201975931":"Simulated Annealing and Boltzmann Machines: A Stochastic Approach to Combinatorial Optimization and Neural Computing","258187760":"Generalized Cross-entropy Methods with Applications to Rare-event Simulation and Optimization","220060358":"A Dynamic Programming Approach to Efficient Sampling from Boltzmann Distributions","247932412":"The Multiplicative Weights Update Method: a Meta Algorithm and Applications"},"citedIn":{"226592753":"The Gibbs Cloner for Combinatorial Optimization, Counting and Sampling","277727821":"Artificial cognitive control with self-x capabilities: A case study of a micro-manufacturing process","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","222679549":"Portfolio selection based on fuzzy cross-entropy. J Comput Appl Math","224230389":"Cross Entropy Algorithms for Data Association in Multi-Target Tracking","253662151":"Cross-Entropy Based Data Association for Multi Target Tracking","222910405":"A hybrid intelligent algorithm for portfolio selection problem with fuzzy returns","270669807":"Portfolio Selection Based on Distance between Fuzzy Variables","285758470":"Multi-objective end optimization based on an improved cross-entropy method. A case study of a micro-scale manufacturing process","226907993":"Entropy and Cloning Methods for Combinatorial Optimization, Sampling and Counting Using the Gibbs Sampler","232062731":"A Stochastic Optimization Method for Partially Decomposable Problems, with Applications to Analysis of NMR Spectra"},"index":643}