{"abs":"The class of joint decoder in fingerprinting codes is of utmost importance in theoretical papers to establish the concept of fingerprint capacity. However, no implementation supporting a large user base is known to date. This paper presents an iterative decoder which is the first attempt toward practical large-scale joint decoding. The discriminative feature of the scores benefits on one hand from the side-information of previously found users, and on the other hand, from recently introduced universal linear decoders for compound channels. Neither the code construction nor the decoder makes assumptions about the collusion size and strategy, provided it is a memoryless and fair attack. The extension to incorporate soft outputs from the watermarking layer is straightforward. An extensive experimental work benchmarks the very good performance and offers a clear comparison with previous state-of-the-art decoders.","title":"Toward Practical Joint Decoding of Binary Tardos Fingerprinting Codes","id":241638980,"url":"https://www.researchgate.net/publication/241638980_Toward_Practical_Joint_Decoding_of_Binary_Tardos_Fingerprinting_Codes","names":["Peter Meerwald","Teddy Furon","IEEE Transactions on Information Forensics and Security"],"references":{"48168089":"Short Collusion-Secure Fingerprint Codes against Three Pirates","1960396":"On the Fingerprinting Capacity Under the Marking Assumption","220460658":"On error-correcting fingerprinting codes for use with watermarking","2864441":"Optimal Probabilistic Fingerprint Codes","224101513":"Blind decoder for binary probabilistic traitor tracing codes","224101512":"Tardos fingerprinting codes in the combined digit model","224602229":"High-Rate Random-Like Spherical Fingerprinting Codes With Linear Decoding Complexity","50894943":"Towards Joint Tardos Decoding: The \u0027Don Quixote\u0027 Algorithm","3079606":"Collusion-secure fingerprinting for digital data","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","225366004":"An improvement of discrete Tardos fingerprinting codes","45340968":"EM Decoding of Tardos Traitor Tracing Codes","220780339":"High rate fingerprinting codes and the fingerprinting capacity","224101511":"Worst case attacks against binary probabilistic traitor tracing codes","224101510":"Capacity-achieving fingerprint decoding","50894934":"Iterative single Tardos decoder with controlled probability of false positive","224258556":"On the Saddle-Point Solution and the Large-Coalition Asymptotics of Fingerprinting Games","220481281":"On the Saddle-point Solution and the Large-Coalition Behavior of Fingerprinting Games","4361380":"1 Universal Fingerprinting: Capacity and Random-Coding Exponents","224219770":"Tardos Fingerprinting Codes in the Combined Digit Model","254869593":"Accusation probabilities in Tardos codes: Beyond the Gaussian approximation","224191028":"Linear Universal Decoding for Compound Channels","3085343":"On the Capacity Game of Private Fingerprinting Systems Under Collusion Attacks","3319041":"Identification of Traitors in Algebraic-Geometric Traceability Codes","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","220177255":"High-rate random-like spherical fingerprinting codes with linear decoding complexity.","220784914":"Experimental Assessment of Probabilistic Fingerprinting Codes over AWGN Channel","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors"},"citedIn":{"262994280":"Watermarking textures in video games","272193983":"Optimal sequential fingerprinting: Wald vs. Tardos","260604334":"Simplified MAP Detector for Binary Fingerprinting Code Embedded by Spread Spectrum Watermarking Scheme","259845207":"Capacities and Capacity-Achieving Decoders for Various Fingerprinting Games","275719364":"Tally-Based Simple Decoders for Traitor Tracing and Group Testing","281675201":"Anticollusion solutions for asymmetric fingerprinting protocols based on client side embedding","281418473":"Challenging Differential Privacy:The Case of Non-interactive Mechanisms","261512931":"Asymptotics of Fingerprinting and Group Testing: Tight Bounds From Channel Capacities","261121192":"Decoding Fingerprinting Using the Markov Chain Monte Carlo Method","277348287":"A Capacity-Achieving Simple Decoder for Bias-Based Traitor Tracing Schemes","265753069":"False Positive probabilities in q-ary Tardos codes: comparison of attacks","260647797":"A Simple Tracing Algorithm for Binary Fingerprinting Code under Averaging Attack","261563273":"Asymptotics of Fingerprinting and Group Testing: Capacity-Achieving Log-Likelihood Decoders"},"index":659}