{"abs":"A method for performing a reliability analysis of structural systems within a standard finite element code is presented. This numerical procedure can be implemented in any finite element (f.e.) code having an internal optimization routine. The design points of structural problems are determined by calculating the minimum distance from the origin to the failure surface in a set of normalized variables, by using the minimization routine of the f.e. code. In order to test the procedure, simple structural systems are solved and the results are compared with those obtained by using different approaches. Some examples of application of the procedure for the reliability analysis of real structures are presented.","title":"Structural reliability analysis using a standard deterministic finite element code","id":245210410,"url":"https://www.researchgate.net/publication/245210410_Structural_reliability_analysis_using_a_standard_deterministic_finite_element_code","names":["Antonio Borri","Emanuela Speranzini","Structural Safety"],"references":{"239387028":"Probability Approximations by Log Likelihood Maximization","245302843":"Reliability-Based Vector Optimization of Structural Systems","226306473":"Stochastic equivalent linearization algorithms and their applicability to hysteretic systems","284294630":"Galerkin based response approach for reliability analysis","226241478":"Response variables correlation in stochastic finite element analysis","245285557":"Hyperspace Division Method for Structural Reliability","265866099":"Fragility Analysis of Complex Structural System","245211537":"Direct computation of the design point of a stochastic structure using a finite element code","245284547":"A Response Surface Approach for Reliability Analysis","246192849":"Finite Element Reliability of Geometrically Nonlinear Uncertain Structures","222945716":"Optimization algorithms for structural reliability"},"citedIn":{"251516541":"An improvement of the response surface method","251615710":"Hydraulic residence time computation for constructed wetland design","269968468":"Reliability approach on impacted composite materials for railways","223532023":"Benefit of splines and neural networks in simulation based structural reliability analysis","251615706":"Ecological restoration of arsenic contaminated soil by Arundo donax L","274405246":"HLRF–BFGS optimization algorithm for structural reliability","233463597":"Reliability-based optimisation of offshore jacket-type structures with an integrated-algorithms system","4184664":"Research on reliability evaluation of series systems with optimization algorithm","251544505":"An adaptive directional importance sampling method for structural reliability","269954864":"Importance analysis for models with correlated variables and its sparse grid solution","283997508":"New optimization algorithms for structural reliability","251109852":"Redundancy Analysis of Structural Systems","47383576":"Vibrational spectra of bis(maltolato)oxovanadium(IV): A potent insulin mimetic agent","44029587":"Parametric uncertainties in reliability analysis of bridge structures","229389026":"Reliability assessment of locking systems","223711623":"Adaptive radial-based importance sampling method for structural reliability","257022117":"An efficient response surface method and its application to structural reliability and reliability-basedoptimization","242494913":"Beitrag zur Bestimmung von Abminderungsfaktoren bei der Überlagerung von Geschoßlasten mit Berücksichtigung ihrer zeitlichen und räumlichen Verteilungen","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","258113403":"Effective structural sizing/shape optimisation through a reliability-related multifactor optimisation approach","245286596":"Finite Element-Based Structural Reliability Assessment Using Efficient Directional Simulation","251516547":"Modified subset simulation method for reliability analysis of structural systems"},"index":67}