{"abs":"Bayesian methods have been very successful in quantifying uncertainty in physics-based problems in parameter estimation and prediction. In these cases, physical measurements y are modeled as the best fit of a physics-based model $\\eta(\\theta)$ where $\\theta$ denotes the uncertain, best input setting. Hence the statistical model is of the form $y \u003d \\eta(\\theta) + \\epsilon$, where $\\epsilon$ accounts for measurement, and possibly other error sources. When non-linearity is present in $\\eta(\\cdot)$, the resulting posterior distribution for the unknown parameters in the Bayesian formulation is typically complex and non-standard, requiring computationally demanding computational approaches such as Markov chain Monte Carlo (MCMC) to produce multivariate draws from the posterior. While quite generally applicable, MCMC requires thousands, or even millions of evaluations of the physics model $\\eta(\\cdot)$. This is problematic if the model takes hours or days to evaluate. To overcome this computational bottleneck, we present an approach adapted from Bayesian model calibration. This approach combines output from an ensemble of computational model runs with physical measurements, within a statistical formulation, to carry out inference. A key component of this approach is a statistical response surface, or emulator, estimated from the ensemble of model runs. We demonstrate this approach with a case study in estimating parameters for a density functional theory (DFT) model, using experimental mass/binding energy measurements from a collection of atomic nuclei. We also demonstrate how this approach produces uncertainties in predictions for recent mass measurements obtained at Argonne National Laboratory (ANL).","title":"A Bayesian Approach for Parameter Estimation and Prediction using a Computationally Intensive Model","id":263891759,"url":"https://www.researchgate.net/publication/263891759_A_Bayesian_Approach_for_Parameter_Estimation_and_Prediction_using_a_Computationally_Intensive_Model","names":["Dave Higdon","Jordan D McDonnell","Nicolas Schunck","Jason Sarich","Stefan Wild","Journal of Physics G Nuclear and Particle Physics"],"references":{"255249911":"Nuclear Energy Densiy Optimization: Large Deformations","243103678":"[Bayesian Computation and Stochastic Systems]: Rejoinder","256098304":"First Results from the CARIBU Facility: Mass Measurements on the r-Process Path","200622065":"Equation of State Calculations by Fast Computing Machines","234038839":"Statistics Analysis in Climate Research","200105001":"Equation of State by Fast Computing Machines","4772045":"Bayesian Calibration of Computer Models","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","239667584":"A Framework for Validation of Computer Models","239427784":"Modeling Data from Computer Experiments: An Empirical Comparison of Kriging with MARS and Projection Pursuit Regression","228780015":"Efficient Emulators for Multivariate Deterministic Functions","252582913":"Using Statistical and Computer Models to Quantify Volcanic Hazards","216633469":"Markov Chain Monte Carlo: Stochastic Simulation for Bayesian Inference. Chapman \u0026 Hall/CRC: Boca Raton, FL","216756606":"Orthogonal Array-Based Latin Hypercubes","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","231132703":"Cosmic Calibration","51991941":"Inverse Problem Theory and Model Parameter Estimation","263200494":"Error Analysis in Nuclear Density Functional Theory","216301381":"The Design and Analysis Computer Experiments","265620657":"Bayesian Computation and Stochastic Systems","51997116":"Applied Functional Data Analysis","4742946":"Computer Model Calibration Using High-Dimensional Output","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","228660883":"Inferring Climate System Properties Using a Computer Model","267079262":"Markov Chain Monte Carlo - Stochastic Simulation for Bayesian Inference","45920265":"Nuclear Energy Density Optimization","285364218":"Biometrika","216301661":"Screening, Predicting, and Computer Experiments","222548735":"Bayesian analysis of computer code outputs: A tutorial"},"citedIn":{"279183750":"Bayesian techniques for model calibration and stochastic inverse problems","278390132":"Polynomial chaos-based metamodeling for solving inverse heat conduction problems","279203554":"Spectral likelihood expansions for Bayesian inference","271771482":"Quantifying properties of hot and dense QCD matter through systematic model-to-data comparison","270905852":"Uncertainty Quantification for Nuclear Density Functional Theory and Information Content of New Measurements","263200494":"Error Analysis in Nuclear Density Functional Theory"},"index":672}