{"abs":"It is well known that Pareto based algorithms do not scale when the number of objectives is greater than three. That way, it is an open problem in integrated circuit design because optimizing amplifiers by multi-objective evolutionary algorithms requires evaluating many objectives with many constraints. In this manner, we show the usefulness of MOMBI, an algorithm based on R2 indicator, for improving the optimal sizing of amplifiers designed with MOSFETs. It is highlighted that such kind of algorithms could lead to solve problems in analog integrated circuit optimization when considering many objectives. In addition, a handling constraint scheme is incorporated to MOMBI. The optimization algorithm based on R2 indicator is applied herein to an amplifier that is used to implement a universal active filter showing good SPICE simulations results.","title":"Optimizing an Amplifier by a Many-Objective Algorithm Based on R2 Indicator","id":277717819,"url":"https://www.researchgate.net/publication/277717819_Optimizing_an_Amplifier_by_a_Many-Objective_Algorithm_Based_on_R2_Indicator","names":["Luis Gerardo de la Fraga","Esteban Tlelo-Cuautle"],"references":{"222540032":"Lecture Notes in Computer Science","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","235709918":"Nonlinear Multiobjective Optimization","222697333":"Constraint-handling in genetic algorithms through the use of dominance-based tournament selection","261389292":"Single-Input Four-Output Voltage-Mode Universal Biquadratic Filter Employing Four OTAs and Two Grounded Capacitors","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","221228500":"Global Multiobjective Optimization with Evolutionary Algorithms: Selection Mechanisms and Mutation Control","3904004":"Failure of Pareto-based MOEAs: Does non-dominated really mean near to optimal?","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm"},"citedIn":{},"index":675}