{"abs":"Many state-of-the-art evolutionary vector optimization algorithms compute the contributing hypervolume for ranking candidate solutions. However, with an increasing number of objectives, calculating the volumes becomes intractable. Therefore, although hypervolume-based algorithms are often the method of choice for bi-criteria optimization, they are regarded as not suitable for many-objective optimization. Recently, Monte Carlo methods have been derived and analyzed for approximating the contributing hypervolume. Turning theory into practice, we employ these results in the ranking procedure of the multi-objective covariance matrix adaptation evolution strategy (MO-CMA-ES) as an example of a state-of-the-art method for vector optimization. It is empirically shown that the approximation does not impair the quality of the obtained solutions given a budget of objective function evaluations, while considerably reducing the computation time in the case of multiple objectives. These results are obtained on common benchmark functions as well as on two design optimization tasks. Thus, employing Monte Carlo approximations makes hypervolume-based algorithms applicable to many-objective optimization.","title":"Speeding up many-objective optimization by Monte Carlo approximations","id":259084900,"url":"https://www.researchgate.net/publication/259084900_Speeding_up_many-objective_optimization_by_Monte_Carlo_approximations","names":["Karl Bringmann","Tobias Friedrich","Christian Igel","Thomas Voß","Artificial Intelligence"],"references":{"220740712":"Comparing Results of 31 Algorithms from the Black-Box Optimization Benchmarking BBOB-2009","220375075":"Completely Derandomized Self-Adaptation in Evolution Strategies","224177886":"Designing Airfoils using a Reference Point based Evolutionary Many-objective Particle Swarm Optimization Algorithm","262368545":"Parameterized average-case complexity of the hypervolume indicator","216300582":"Multicriteria Optimization","222540032":"Lecture Notes in Computer Science","3949503":"Scalable multi-objective optimization test problems","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","257356573":"An improved algorithm for Klee\u0027s measure problem on fat boxes","41786737":"Efficient Covariance Matrix Update for Variable Metric Evolution Strategies","216300585":"Introduction To Evolutionary Computing","225922938":"Learning Probability Distributions in Continuous Evolutionary Algorithms - A Comparative Review","210205139":"Computing Hypervolume Contributions in Low Dimensions: Asymptotically Optimal Algorithm and Complexity Results","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","221006970":"Performance evaluation of an advanced local search evolutionary algorithm","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","220381049":"A Fast Way of Calculating Exact Hypervolumes","229091452":"Evolution strategies","280020908":"Shark","221271214":"The logarithmic hypervolume indicator","224309500":"A Fast Incremental Hypervolume Algorithm","221228555":"Steady-State Selection and Efficient Covariance Matrix Update in the Multi-objective CMA-ES","267806675":"Centrifugal pump design: Three benchmark problems for many-objective optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","285916832":"Theory of Multiobjective Optimization","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","241623627":"On Klee\u0027s measure problem for grounded boxes","220741273":"Scaling up indicator-based MOEAs by approximating the least hypervolume contributor: A preliminary study","216457303":"Indicator-Based Selection in Multiobjective Search","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","256660343":"Approximation quality of the hypervolume indicator","45229385":"Improved step size adaptation for the MO-CMA-ES","3801351":"Complexity of k-SAT","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","222521916":"On the complexity of k-SAT","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"282481319":"An improved {\\alpha }-dominance strategy for many-objective optimization problems","267511239":"Empirical Performance of the Approximation of the Least Hypervolume Contributor","276075363":"A New Uniform Evolutionary Algorithm Based on Decomposition and CDAS for Many-objective Optimization","272846394":"Efficient optimization of many objectives by approximation-guided evolution","280534066":"Bi-goal evolution for many-objective optimization problems","280534179":"A Performance Comparison Indicator for Pareto Front Approximations in Many-Objective Optimization","272373586":"A New Decomposition Based Evolutionary Algorithm with Uniform Designs for Many-objective Optimization"},"index":680}