{"abs":"Abstract Many optimization problems arising in applications have to consider several objective functions at the same time. Evolutionary algorithms seem to be a very natural choice for dealing with multi-objective problems as the population of such an algorithm can be used to represent the trade-offs with respect to the given objective functions. In this paper, we contribute to the theoretical understanding of evolutionary algorithms for multi-objective problems. We consider indicator-based algorithms whose goal is to maximize the hypervolume for a given problem by distributing μ points on the Pareto front. To gain new theoretical insights into the behavior of hypervolume-based algorithms we compare their optimization goal to the goal of achieving an optimal multiplicative approximation ratio. Our studies are carried out for different Pareto front shapes of bi-objective problems. For the class of linear fronts and a class of convex fronts, we prove that maximizing the hypervolume gives the best possible approximation ratio when assuming that the extreme points have to be included in both distributions of the points on the Pareto front. Furthermore, we investigate the choice of the reference point on the approximation behavior of hypervolume-based approaches and examine Pareto fronts of different shapes by numerical calculations.","title":"Multiplicative Approximations, Optimal Hypervolume Distributions, and the Choice of the Reference Point","id":261030283,"url":"https://www.researchgate.net/publication/261030283_Multiplicative_Approximations_Optimal_Hypervolume_Distributions_and_the_Choice_of_the_Reference_Point","names":["Tobias Friedrich","Frank Neumann","Christian Thyssen","Evolutionary Computation"],"references":{"262368545":"Parameterized average-case complexity of the hypervolume indicator","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","3949503":"Scalable multi-objective optimization test problems","222540032":"Lecture Notes in Computer Science","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","261823251":"Practical Methods of Optimization by R. Fletcher","257356573":"An improved algorithm for Klee\u0027s measure problem on fat boxes","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","47843204":"Multiplicative Approximations and the Hypervolume Indicator","221271214":"The logarithmic hypervolume indicator","230660832":"Ant Colony Optimization and Swarm Intelligence: 4th International Workshop, ANTS 2004","224645825":"An Improved Dimension-Sweep Algorithm for the Hypervolume Indicator","3880857":"On the approximability of trade-offs and optimal access of Web sources","220743243":"G-Metric: an M-ary quality indicator for the evaluation of non-dominated sets","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","241623627":"On Klee\u0027s measure problem for grounded boxes","216457303":"Indicator-Based Selection in Multiobjective Search","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","28358342":"Gradient-based/Evolutionary Relay Hybrid for Computing Pareto Front Approximations Maximizing the S-Metric","47750112":"Lecture Notes in Computer Science","256660343":"Approximation quality of the hypervolume indicator","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice"},"citedIn":{"270961698":"On using the hypervolume indicator to compare Pareto fronts: Applications to multi-criteria optimal experimental design","280534066":"Bi-goal evolution for many-objective optimization problems"},"index":681}