{"abs":"We present a new algorithm to calculate exact hypervolumes. Given a set of $d$-dimensional points, it computes the hypervolume of the dominated space. Determining this value is an important subroutine of Multiobjective Evolutionary Algorithms (MOEAs). We analyze the \"Quick Hypervolume\" (QHV) algorithm theoretically and experimentally. The theoretical results are a significant contribution to the current state of the art. Moreover the experimental performance is also very competitive, compared with existing exact hypervolume algorithms. A full description of the algorithm is currently submitted to IEEE Transactions on Evolutionary Computation.","title":"Quick HyperVolume","id":229329189,"url":"https://www.researchgate.net/publication/229329189_Quick_HyperVolume","names":["Luís M. S. Russo","Alexandre P. Francisco","IEEE Transactions on Evolutionary Computation"],"references":{"200552951":"The Paradox of Choice: Why More Is Less","222540032":"Lecture Notes in Computer Science","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","4201672":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","216457263":"Lecture Notes in Computer Science","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","1885715":"Novel Algorithm to Calculate Hypervolume Indicator of Pareto Approximation Set","220939835":"Faster S-Metric Calculation by Considering Dominated Hypervolume as Klee’s Measure Problem","265622469":"Efficient Algorithms for the Assessment of Stochastic Multiobjective Optimizers","202232988":"Algorithm 64: Quicksort","216300272":"Hypervolumen-basierte Selektion in einem evolutionären Algorithmus zur Mehrzieloptimierung","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","277291920":"The Measure of Pareto Optima. Applications to Multi-objective Metaheuristics","2421116":"An Efficient Representation for Sparse Sets","229431286":"A fast dimension-sweep algorithm for the hypervolume indicator in four dimensions","3418862":"A faster algorithm for calculating hypervolume","220381049":"A Fast Way of Calculating Exact Hypervolumes","30867274":"The Design and Analysis of Computer Algorithms","221654678":"Cost-effective outbreak detection networks. In: kDD","3498772":"New upper bounds in Klee\u0027s measure problem","224645825":"An Improved Dimension-Sweep Algorithm for the Hypervolume Indicator","224309500":"A Fast Incremental Hypervolume Algorithm","237898893":"Algorithms for Klee\u0027\u0027s rectangle problems","2830223":"Inferential Performance Assessment of Stochastic Optimisers and the Attainment Function","246816017":"Metrics for Quality Assessment of a Multiobjective Design Optimization Solution Set","221669789":"Probability and Computing: Randomized Algorithms and Probabilistic Analysis","241623627":"On Klee\u0027s measure problem for grounded boxes","220426126":"Multidimensional Divide-and-Conquer.","224579855":"On the Complexity of Computing the Hypervolume Indicator","235357289":"Bringing Order to Special Cases of Klee\u0027s Measure Problem","268024150":"Multi-objective memetic algorithms","216457303":"Indicator-Based Selection in Multiobjective Search","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","266239206":"Can the Measure of ∪ n 1 [ a i , b i ] be Computed in Less Than O(n logn) Steps?","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","4074752":"Bounded archiving using the Lebesgue measure","266350430":"Introduction to Ramsey Spaces","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"290852708":"Difficulties in specifying reference points to calculate the inverted generational distance for many-objective optimization problems","274263562":"Behavior of Multiobjective Evolutionary Algorithms on Many-Objective Knapsack Problems","287406344":"Modified Distance Calculation in Generational Distance and Inverted Generational Distance","282528680":"Decomposition-based multi-objective evolutionary algorithm for vehicle routing problem with stochastic demands"},"index":686}