{"abs":"Genetic algorithms (GAs) have been extensively used in different domains as a means of doing global optimization in a simple yet reliable manner. They have a much better chance of getting to global optima than gradient based methods which usually converge to local sub optima. However, GAs have a tendency of getting only moderately close to the optima in a small number of iterations. To get very close to the optima, the GA needs a very large number of iterations. Whereas gradient based optimizers usually get very close to local optima in a relatively small number of iterations. In this paper we describe a new crossover operator which is designed to endow the GA with gradient-like abilities without actually computing any gradients and without sacrificing global optimality. The operator works by using guidance from all members of the GA population to select a direction for exploration. Empirical results in two engineering design domains and across both binary and floating point represent...","title":"Guided Crossover: A New Operator for Genetic Algorithm Based Optimization","id":2331428,"url":"https://www.researchgate.net/publication/2331428_Guided_Crossover_A_New_Operator_for_Genetic_Algorithm_Based_Optimization","names":["Khaled Rasheed","Haym Hirsh"],"references":{"2507330":"The Generation Of Form Using An Evolutionary Approach","261288758":"GADO: A Genetic Algorithm for Continuous Design Optimization","30870161":"Genetic engineering and design problems","245365912":"Genetic Algorithm-Based Structural Topology Design With Compliance and Topology Simplification Considerations","243766734":"GeneAS: A Robust Optimal Design Technique for Mechanical Component Design","283996103":"Genetic Algorithms In Search, Optimization, and Machine Learning","243665386":"Genetic Algorithms in Searching","245235760":"AI in Control System Design Using a New Paradigm for Design Representation","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","220375122":"A Genetic Algorithm for Channel Routing in VLSI Circuits","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","284692234":"Genetic Engineering and Design Problems","220695059":"Genetic Algorithm+Data Structures\u003dEvolution Programs","30873058":"Genetic + Data Structures \u003d Evolution Programs","2336982":"High Performance Supersonic Missile Inlet Design Using Automated Optimization","222501755":"A genetic algorithm for continuous design space search","245429784":"Multiobjective Genetic Algorithm for Multidisciplinary Design of Transonic Wing Planform","2333082":"Using Case-Based Learning to Improve Genetic-Algorithm-Based Design Optimization","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","242372494":"Genetic algorithm in search","223938660":"Using Modeling Knowledge to Guide Design Space Search","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","243776152":"The utility of nonlinear programming algorithms"},"citedIn":{"267053290":"Speech processing and soft computing","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","251885602":"A Self-guided genetic algorithm with dominance properties for single machine scheduling problems","246401533":"Humanoid Robot Simulation and Walking Behavior Development in the Spark Simulator Framework","242224723":"PROGETTAZIONE DI TRATTAMENTI SMORZANTI MEDIANTE TECNICHE DI OTTIMIZZAZIONE BASATE SU ALGORITMI GENETICI","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","237787467":"Employment History","239765789":"Evolutionary discriminative speaker adaptation","225409078":"Solution searching for multi-variable optimization problems by momentum genetic algorithm","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","223424191":"Multi-objective shape optimization of a heat exchanger using parallel genetic algorithms"},"index":697}