{"abs":"An alternate formulation of the classical vehicle routing problem with stochastic demands (VRPSD) is considered. We propose a new heuristic method to solve the problem, based on the Cross-Entropy method. In order to better estimate the objective function at each point in the domain, we incorporate Monte Carlo sampling. This creates many practical issues, especially the decision as to when to draw new samples and how many samples to use. We also develop a framework for obtaining exact solutions and tight lower bounds for the problem under various conditions, which include specific families of demand distributions. This is used to assess the performance of the algorithm. Finally, numerical results are presented for various problem instances to illustrate the ideas.","title":"Solving the Vehicle Routing Problem with Stochastic Demands using the Cross-Entropy Method","id":225194729,"url":"https://www.researchgate.net/publication/225194729_Solving_the_Vehicle_Routing_Problem_with_Stochastic_Demands_using_the_Cross-Entropy_Method","names":["Krishna Chepuri","Tito Homem-de-Mello","Annals of Operations Research"],"references":{"200035308":"Simulated Annealing for noisy cost functions","238735931":"Integer and combhtatorial optimization","200621942":"Scheduling of Vehicles From a Central Depot to a Number of Delivery Points","263366449":"Stochastic vehicle routing","220136343":"Variable-Sample Methods for Stochastic Optimization","243772695":"A Global Search Method for Discrete Stochastic Optimization","226218344":"A Tutorial on the Cross-Entropy Method","2833584":"A Tutorial on the Cross-Entropy Method","257404491":"A modification of the stochastic ruler method for discrete stochastic optimization","243776802":"A Tabu Search Heuristic for the Vehicle Routing Problem with Stochastic Demands and Customers","271120143":"Multiple Comparisons: Theory and Methods.","265374841":"Formulations and bounds for the stochastic capacitated vehicle routing problem with uncertain supplies","230596114":"The Scope of Integer and Combinatorial Optimization","242916552":"New optimality cuts for a single‐vehicle stochastic routing problem","4756605":"Models and Exact Solutions for a Class of Stochastic Location-Routing Problems","242932941":"“The Multiple Terminal Delivery Problem With Probabilistic Demands”","223806176":"“Stochastic Vehicle Routing with Modified Savings Algorithm,”","227447221":"A Simulated Annealing Algorithm With Constant Temperature for Discrete Stochastic Optimization","220471192":"Heuristic procedure neural networks for the CMST problem","264963062":"An Exact Algorithm for the Vehicle Routing Problem with Stochastic Demands and Customers","233444821":"A Framework For Probabilistic Vehicle Routing","37616893":"Application of the Cross-Entropy Method to the Buffer Allocation Problem in a Simulation-Based Environment","222024952":"Genetic algorithms with noisy fitness","38362764":"Probabilistic Search with Overrides","243764033":"A Priori Optimization of the Probabilistic Traveling Salesman Problem","227446728":"A Method for Discrete Stochastic Optimization","265441556":"The Vehicle Routing Problem with Stochastic Travel Times","238836859":"Stochastic Inventory Routing: Route Design with Stockouts and Route Failures","243771210":"A Vehicle Routing Problem with Stochastic Demand","225898171":"Simulated annealing with noisy or imprecise energy measurements","239060593":"A Rollout Policy for the Vehicle Routing Problem with Stochastic Demands","222764566":"“Stochastic Vehicle Routing”","216300214":"Design and Analysis of Experiments for Statistical Selection, Screening, and Multiple Comparisons","37593707":"“Computational Approaches to Stochastic Vehicle Routing Problems”","2396030":"Cross-Entropy and Rare Events for Maximal Cut and Partition Problems","229530869":"Multiple Comparison Procedures","223145644":"Stochastic Vehicle Routing: A Comprehensive Approach","2593601":"Scheduling Of Genetic Algorithms In A Noisy Environment","3997915":"Estimation of rare event probabilities using cross-entropy","200035338":"The Sample Average Approximation Method for Stochastic Discrete Optimization","228725706":"A vehicle routing problem with stochastic travel times","222839843":"Secomandi, N.: Comparing neuro-dynamic programming algorithms for the vehicle routing problem with stochastic demands. Comput. Oper. Res. 27, 1201-1225","3997910":"A Combined Procedure for Optimization via Simulation","257196730":"Optimal stochastic single-machine-tardiness scheduling by stochastic branch-and-bound","2484042":"The Cross-Entropy Method for Combinatorial and Continuous Optimization","265892520":"Multiple Comparison: Theory and Methods","4941490":"The stochastic vehicle routing problem revisited","261589357":"Multiple Comparisons: Theory and Methods","249599130":"Stochastic Vehicle Routing Problems","262366425":"Stochastic Discrete Optimization"},"citedIn":{"220288545":"Cyclic-Order Neighborhoods With Application to the Vehicle Routing Problem With Stochastic Demand","228937509":"A set-partitioning-based model for the stochastic vehicle routing problem","263606326":"Shaped beam synthesis of phased arrays using the cross entropy method","228940071":"Cross-Entropy Method","251917184":"Vehicle Routing Problem with Weight Coefficients and Stochastic Demands Based on the Cross-Entropy Method","50996224":"Handbook of Monte Carlo Methods","221079334":"Improving the GRLVQ Algorithm by the Cross Entropy Method.","51639583":"Fixed-point algorithms for constrained ICA and their applications in fMRI data analysis","275946239":"Optimization of Logistics: Theory \u0026 Practice","276364661":"A cross-entropy method applied to the In-core fuel management optimization of a Pressurized Water Reactor","259118975":"Fast and scalable parallel layout decomposition in double patterning lithography","222552268":"Application of the cross entropy method to the GLVQ algorithm","226218344":"A Tutorial on the Cross-Entropy Method","276337643":"An Improved Harmony Search Algorithm for Power Distribution Network Planning","257153735":"Heuristics for the probabilistic traveling salesman problem with deadlines based on quasi-parallel Monte Carlo sampling","256822619":"Application of global optimization methods to model and feature selection","276519650":"Distributed Generation Placement for Power Distribution Networks","239930454":"Multi-Objective Heuristics for the Vehicle Routing Problem","228947129":"Cross Entropy based Neighborhood Reduction and Initial Tour Formation for Tabu Search on the Asymmetric Traveling Salesman Problem","282955004":"Simulation optimization via gradient-based stochastic search","226375514":"An Early Warning System for Loan Risk Assessment Based on Rare Event Simulation","3152916":"Network Reliability Optimization via the Cross-Entropy Method","220462471":"An optimal routing policy for unmanned aerial vehicles (analytical and cross-entropy simulation approach). Annals of Operations Research","230887910":"Reinforcement Learning and Dynamic Programming Using Function Approximators","44812300":"A Breeder genetic algorithm for vehicle routing problem with stochastic demands","29647587":"A Practical Approach for Robust and Flexible Vehicle Routing Using Metaheuristics and Monte Carlo Sampling","220403595":"A cross entropy based algorithm for reliability problems","267333575":"A two-stage heuristic method for vehicle routing problem with split deliveries and pickups","265015651":"Partial-route inequalities for the multi-vehicle routing problem with stochastic demands","251630806":"Using safety stocks and simulation to solve the vehicle routing problem with stochastic demands","5171298":"Analysing risk orientation in a stochastic VRP","274405364":"Two-echelon logistics distribution region partitioning problem based on a hybrid particle swarm optimization–genetic algorithm","4111758":"Global likelihood optimization via the cross-entropy method with an application to mixture models","256030320":"A Comparison of Cross Entropy Approaches for the Classical Vehicle Routing Problem","257337444":"A cross-entropy-based approach for the optimization of flexible process planning","241189459":"Police Patrol service optimization based on the spatial pattern of hotspots","279242256":"Chapter 3. The Cross-Entropy Method for Optimization","224123884":"On the performance of the Cross-Entropy method","224305255":"An importance sampling method with applications to rare event probability","220136543":"Simulation optimization using the cross-entropy method with optimal computing budget allocation.","220249312":"Dynamic sample budget allocation in model-based optimization","275981619":"The Vehicle Routing Problem with Stochastic Demands and Split Deliveries","259125553":"On the computational complexity of the Probabilistic Traveling Salesman Problem with Deadlines","220373475":"The Optimization of Signal Settings on a Signalized Roundabout Using the Cross-entropy Method","222407301":"Hybridizing the cross-entropy method: An application to the max-cut problem","262279271":"Service-Oriented Line Planning and Timetabling for Passenger Trains","4206599":"On the design of multi-type networks via the cross-entropy method","269466181":"Estimation-based metaheuristics for the vehicle routing problem with stochastic demands and customers","280690935":"A heuristic algorithm for optimal fleet composition with vehicle routing considerations","251509420":"Enhanced cross-entropy method for dynamic economic dispatch with valve-point effects","267747745":"Stochastic Vehicle Routing Problem: A Literature Survey","228920816":"Applying Simulation and Reliability to Vehicle Routing Problems with Stochastic Demands","274462860":"Improved Cross Entropy Algorithm for the Optimum of Charge Planning Problem","235036762":"Path Optimization for Single and Multiple Searchers: Models and Algorithms","220399354":"Hierarchical Cross-Entropy Optimization for Fast On-Chip Decap Budgeting","267755180":"Chapter 4. Reducing the Kullback-Leibler Distance: The Cross-Entropy Method for Optimization","266646456":"A Cross-Entropy Method for Solving Passenger Flow Routing Problem","221060208":"Parallel hierarchical cross entropy optimization for on-chip decap budgeting","261599092":"Paired cooperative reoptimization strategy for the vehicle routing problem with stochastic demands","251931105":"An importance sampling method with applications to vehicle routing problem","220413385":"A Hybrid Monte Carlo Local Branching Algorithm for the Single Vehicle Routing Problem with Stochastic Demands","275059598":"A single vehicle routing problem with pickups and deliveries, continuous random demands and predefined customer order","224123831":"Optimal generation expansion planning via the Cross-Entropy method","277909758":"Adaptive probabilistic harmony search for binary optimization problems","23984386":"An approximate dynamic programming approach for the vehicle routing problem with stochastic demands","47353122":"Solution methodologies for vehicle routing problems with stochastic demand","43459303":"Designing an Optimal Network Using the Cross-Entropy Method","26620004":"Solving the Vehicle Routing Problem with Stochastic Demands via Hybrid Genetic Algorithm-Tabu Search","224324397":"An Importance Sampling Method Based on Martingale with Applications to Rare Event Probability","46487350":"A simulation/metaheuristic approach to newspaper production and distribution supply chain problems","282538274":"An improved cross entropy algorithm for steelmaking-continuous casting production scheduling with complicated technological routes","222952511":"A cross entropy approach to design of reliable networks","266553497":"Hardness Results for the Probabilistic Traveling Salesman Problem with Deadlines","271544789":"Self-organizing optimization algorithm for cast planning of steel making-continuous casting","282202921":"Improved cross entropy algorithm for steelmaking continuous casting production scheduling with minimum power consumption","237680599":"USING DATA MINING TO FORECAST UNCERTAIN DEMANDS IN STOCHASTIC VEHICLE ROUTING PROBLEM"},"index":707}