{"abs":"This article gives a comprehensive,introduction into one of the main branches of evolutionary computation,– the evolution strategies (ES) the history of which dates back to the 1960s in Germany. Starting from a survey of history the philosophical background,is explained in order to make,understandable why,ES are realized in the way they are. Basic ES algorithms and design principles for variation and selection operators as well as theoretical issues are presented, and future branches of ES research are discussed. Key words: computational intelligence, Darwinian evolution, design principles for genetic","title":"Evolution strategies - a comprehensive introduction. Nat Comput","id":220132816,"url":"https://www.researchgate.net/publication/220132816_Evolution_strategies_-_a_comprehensive_introduction_Nat_Comput","names":["Hans-Georg Beyer","Hans-Paul Schwefel","Natural Computing"],"references":{"3642935":"Adapting arbitrary normal mutation distributions in evolution strategies: The covariance matrix adaptation","220375075":"Completely Derandomized Self-Adaptation in Evolution Strategies","235709965":"Evolutionsstrategie. Optimierung technischer Systeme nach Prinzipien der biolo-gi-schen Evolution","23740136":"When Will a Genetic Algorithm Outperform Hill-Climbing?","3418678":"Local Performance of the (1 + 1)-ES in a Noisy Environment","220897839":"Theoretical Aspects of Evolutionary Algorithms","201976591":"Application of the Evolutionsstrategie to Discrete Optimization Problems","216301411":"Collective phenomena in evolutionary systems","216301422":"Evolutionsstrategie und numerische Optimierung","220431151":"Holland, J.H.: Outline for a logical theory of adaptive systems. J. ACM 9(3), 297-314","220701739":"Step-Size Adaption Based on Non-Local Use of Selection Information.","216301417":"Numerical Optimization of Computer Models","220701737":"On the Optimization of Unimodal Functions with the (1 + 1) Evolutionary Algorithm.","220701992":"Structure Evolution and Incomplete Induction","12723280":"FDA -A Scalable Evolutionary Algorithm for the Optimization of Additively Decomposed Functions","268308716":"The theory of evolution strategies","33747351":"Optimierung balkenartiger Zylinderschalen aus Stahlbeton mit elastischem und plastischem Werkstoffverhalten /","243658131":"Numerische Optimierung von Computer-Modellen mittels der Evolutionsstrategie. Birkhäuser, Basel","229100863":"Wahrscheinlichkeitsrechnung und mathematische Statistik, Berlin (Ost) 1971","235948297":"Projekt MHD-Staustrahlrohr: Experimentelle Optimierung einer Zweiphasendüse, Teil I","2583097":"An Evolutionary Algorithm for Integer Programming","220701624":"Reproductive Isolation as Strategy Parameter in Hierarichally Organized Evolution Strategies.","225526766":"Long path problems","241892810":"A Tool for Evolving Artificial Neural Networks","201976488":"Uniform Crossover in Genetic Algorithms","220375040":"A Rigorous Complexity Analysis of the (1 + 1) Evolutionary Algorithm for Separable Functions with Boolean Inputs","2361862":"BOA: The Bayesian Optimization Algorithm","220701571":"A Spatial Predator-Prey Approach to Multi-objective Optimization: A Preliminary Study.","3418642":"On the performance of (1, λ)-evolution strategies for the ridge function class","239030419":"Evolutionsstrategien zur numerischen L ¨ osung von Adaptationsaufgaben","3418648":"On self-adaptive features in real-parameter evolutionary algorithm. IEEE T Evolut Comput","2645509":"On the Choice of the Mutation Probability for the (1+1) EA","220689559":"Convergence Properties of Evolutionary Algorithms. Kovac, Hamburg","234208580":"Einführung in die Wahrscheinlichkeitsrechnung und mathematische Statistik","220690578":"Evolution and Optimum Seeking","14166753":"An alternative explanation for the manner in which genetic algorithms operate","221605260":"Convergence Properties of (μ + λ) Evolutionary Algorithms.","226320449":"Bayesian Optimization Algorithm","2817559":"A condition for the genotype-phenotype mapping: Causality","2592152":"On Correlated Mutations in Evolution Strategies","3810181":"Some observations on the interaction of recombination and self-adaptation in evolution strategies","242919230":"Toward a Theory of Evolution Strategies: On the Benefits of Sex the (μ/μ, λ) Theory","28352116":"On the Performance of (1, λ)-Evolution Strategies For The Ridge Function Class","220381158":"Parameter control in evolutionary algorithms","220801004":"The Dynamics of Evolution Strategies in the Optimization of Traveling Salesman Problems","237005545":"Simulation of Steady States in Dissipative Systems by Darwin\u0027s Paradigm of Evolution","220701548":"An Evolutionary Algorithm for Integer Programming.","28351228":"Theoretische Analyse evolutionärer Algorithmen unter dem Aspekt der Optimierung in diskreten Suchräumen","240147357":"On Linear Convergence of a Class of Random Search Algorithms","2449002":"On the analysis of evolutionary algorithms - A proof that crossover really can help","220375024":"How Mutation and Selection Solve Long Path Problems in Polynomial Expected Time","200622118":"Cybernetic Solution Path of an Experimental Problem","2627581":"Evolution Strategies for Vector Optimization","2332917":"The Evolution of Evolvability in Genetic Programming","216300863":"A history of evolutionary computation","12321120":"Analysis of the (1, λ)-ES on the Parabolic Ridge","12321121":"Analysis of the (μ/μ, λ)-ES on the Parabolic Ridge","200621973":"Artificial Intelligence through Simulated Evolution, Wiley, New York","216300294":"Toward a Theory of Evolution Strategies: Self-Adaptation","2606149":"Contemporary Evolution Strategies","221531222":"Contemporary Evolution Strategies.","32167689":"On the design and analysis of evolutionary algorithms (Algorithm Engineering as a New Paradigm)","236373493":"TWO-PHASE NOZZLE AND HOLLOW CORE JET EXPERIMENTS.","237128655":"Toward a Theory of Evolution Strategies: On the Benefit of Sex-the (m/m-l)Strategy","201976935":"An Effective Heuristic Algorithm for the TSP","222827943":"Performance analysis of evolution strategies with multi-recombination in high-dimensional RN-search spaces disturbed by noise","220702167":"Refueling of a Nuclear Power Plant: Comparison of a Naive and a Specialized Mutation Operator.","227334268":"The Analysis of Evolutionary Algorithms—A Proof That Crossover Really Can Help","242356870":"Adaptation In Natural And Artificial Systems","216300561":"Metric Based Evolutionary Algorithms","28351429":"Convergence behavior of evolution strategies on ridge functions","223194427":"Real royal road functions - where crossover provably is essential. Discret. Appl. Math. 149, 111-125","3418562":"Parameter control in evolutionary algorithms. — IEEE Trans. Evolutionary Computation, Vol. 3, No. 2, pp. 124-141","2828508":"Analysis of a Simple ES on the \"Parabolic Ridge\"","220045412":"Adoption in Natural and Artificial System","222670527":"Evolutionary algorithms in noisy environments: theoretical issues and guidelines for practice","2826833":"Convergence Properties of Evolution Strategies with the Derandomized Covariance Matrix Adaptation: The ...-CMA-ES","223880614":"On the analysis of a simple evolutionary algorithm on quadratic pseudo-boolean functions"},"citedIn":{"257435481":"Application of covariance matrix adaptation–evolution strategy to optimal control of hepatitis B infection","224677223":"Evolutionary Algorithm for 3D Object Reconstruction from Images","224472418":"What is situated evolution?","237749794":"Evolutionary algorithms applied to lens design: case study and analysis","235709958":"Counteracting genetic drift and disruptive recombination in (μ, +λ)-EA on multimodal fitness landscapes","260642695":"On the Behaviour of the (1, λ)-ES for Conically Constrained Linear Problems","222702934":"Robust optimization – A comprehensive survey","224331086":"Adaptive Stabilized Multi-RBF Kernel for Support Vector Regression","221435175":"A Comparison of Evolutionary Algorithms for Automatic Calibration of Constrained Cellular Automata","4089893":"Grouping-based evolutionary algorithm: Seeking balance between feasible and infeasible individuals of constrained optimization problems","46306009":"Pattern Mining of Multichannel sEMG for Tremor Classification","220740918":"A novel approach to adaptive isolation in evolution strategies","220105984":"Genetic algorithm with automatic termination and search space rotation","51122991":"Raman Spectroscopic Study of Crystallization from Solutions Containing MgSO4 and Na2SO4: Raman Spectra of Double Salts","47932159":"Silvicultural decisions based on simulation-optimization systems","261283767":"Optimal computing budget allocation for small computing budgets","247039632":"ON THE EXTINCTION OF SUB-POPULA- TIONS ON MULTIMODAL LANDSCAPES","287600907":"Markov Chain Analyses of Random Local Search and Evolutionary Algorithm","265527266":"On Optimization of Simulation Based Design","51518250":"Using an evolutionary algorithm to determine the parameters of a biologically inspired model of head direction cells","226723258":"Computational Intelligence in Visual Sensor Networks: Improving Video Processing Systems","256276346":"An overview of population-based algorithms for multi-objective optimisation","280881280":"Reactive Power and Voltage Control Based on Mesh Adaptive Direct Search Algorithm","220564837":"Parallel hybrid evolutionary computation: Automatic tuning of parameters for parallel gene expression programming","237866600":"A multifunctional comparison of even-aged and uneven-aged forest management in a boreal region","221228392":"A New Memory Based Variable-Length Encoding Genetic Algorithm for Multiobjective Optimization.","268519499":"Simplified Cuckoo Search A robust metaheuristic for agent-based artificial markets","262299630":"Artificially evolved functional shell morphology of burrowing bivalves","4872219":"On scheduling around large restrictive common due windows","221302114":"Natural Inspiration for Artificial Adaptivity: Some Neurocomputing Experiences in Robotics","240643589":"Optimization of felf-organized flocking of a robot swarm via evolutionary strategies","238665325":"A Framework for modelling stochastic optimisation algorithms with Markov chains","278763720":"Evolution Strategies with Additive Noise: A Convergence Rate Lower Bound","257697545":"A requirement for the mutation operator in continuous optimization","276920535":"Classification of Mental Disorders Figures based on Soft Computing Methods","288700771":"Multi-objective energy storage power dispatching using plug-in vehicles in a smart-microgrid","257144588":"How to analyse evolutionary algorithms","281004254":"On Evolutionary Approaches to Wind Turbine Placement with Geo-Constraints","256919345":"An improved robust topology optimization approach using multiobjective evolutionary algorithms. Comput Struct","261390327":"GAAP. Genetic Algorithm with Auxiliary Populations Applied to Continuous Optimization Problems","264816559":"Power law-based local search in artificial bee colony","221529427":"Simulation-based optimization of a complex mail transportation network","255569736":"Efficient recurrent local search strategies for semi- and unsupervised regularized least-squares classification","241696272":"Evolving connectivity between genetic oscillators and switches using evolutionary algorithms","266043299":"Forecasting the Thailand stock market using evolution strategies","256919337":"Fully Stressed Design Evolution Strategy for Shape and Size Optimization of Truss Structures","254461782":"Biaxial box plots and ordered trial ranks for visualizing large sets of experimental results","276482054":"Optimization of bus stop placement for routes on uneven topography","224673249":"Evolutionary Fuzzy Logic Controller Schemes Suitable for the Simple Automatic Design","41652988":"Νέες μέθοδοι εκμάθησης για ασαφή γνωστικά δίκτυα και εφαρμογές στην ιατρική και βιομηχανία","220702127":"Evolving Dynamics in an Artificial Regulatory Network Model.","282583110":"A Hybrid Evolutionary-Deterministic Optimization Approach for Conceptual Design","280535085":"Toward a unifying framework for evolutionary processes","242269929":"Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods A Predator-Prey Approach for Pareto-Optimization","257722309":"A speculative approach to parallelization in particle swarm optimization","220497343":"Evolutionary self-adaptation: A survey of operators and strategy parameters","222823892":"Multiobjective design of Work-In-Process buffer for scheduling repetitive building projects","4376799":"Quadratic Leaky Integrate-and-Fire Neural Network Tuned with an Evolution-Strategy for a Simulated 3D Biped Walking Controller","229340426":"A Boosted Genetic Fuzzy Classifier for land cover classification of remote sensing imagery","262491911":"An algorithm for the regression of the UNIQUAC interaction parameters in liquid–liquid equilibrium for single- and multi-temperature experimental data","221228428":"Multi-objective Model Selection for Support Vector Machines","269985968":"Error modeling approach to improve time series forecasters","277065771":"Tuning search algorithms for real-world applications","221007236":"Sequential parameter optimization","283807810":"How to Create Generalizable Results","216300621":"Evolutionary Construction of Multiple Graph Alignments for Mining Structured Biomolecular Data","236201656":"Back analysis of geomechanical parameters by optimisation of a 3D model of an underground structure","263573272":"Productivity and optimal management of the uneven-aged hardwood forests of Hyrcania","222434804":"Human-competitive lens system design with evolution strategies","225232346":"A New Surface Tension Equation for Refrigerants","251682743":"Vertebral Fracture Assessment Helps Target Tx","260622130":"Real-Coded Chemical Reaction Optimization","259137484":"Particle swarm optimization with increasing topology connectivity","256817137":"Differential harmony search algorithm to optimize PWRs loading pattern","268148539":"A heuristic fuzzy algorithm bio-inspired by Evolution Strategies for energy forecasting problems","202329295":"A Variable Neighbourhood Search Algorithm for Job Shop Scheduling Problems","245352030":"Total Cost Minimization of a High-Pressure Natural Gas Network","220462567":"A unified framework for population-based metaheuristics","264791821":"Bare Bones Particle Swarm Optimization With Scale Matrix Adaptation","240998042":"Some Properties of Quasi-orthogonal and Para-orthogonal Polynomials. A Survey","235419329":"Particle Swarm Optimization with pbest Crossover","238720755":"Parameter Setting in Evolutionary Algorithms","260622148":"Hybrid Metaheuristics Based on Evolutionary Algorithms and Simulated Annealing: Taxonomy, Comparison, and Synergy Test","242130595":"Notas de Aula de Otimizacao","220702184":"Searching for Balance: Understanding Self-adaptation on Ridge Functions","221011453":"Active Appearance Model-Based Facial Composite Generation with Interactive Nature-Inspired Heuristics","47806984":"Analyzing the Role of “Smart” Start Points in Coarse Search-Greedy Search","256464797":"Prediction Stability in a data-based mechanistic model of sigmaF during sporulation in Bacillus subtilis","225705383":"Self-Adaptation in Evolutionary Algorithms","281972760":"Evolution Strategies with Thresheld Convergence","220132804":"Niching with derandomized evolution strategies in artificial and real-world landscapes","251485735":"Understanding the process of microwave-assisted digestion combining diluted nitric acid and oxygen as auxiliary reagent","36717293":"Mathematical modeling and kinetic analysis of cellular signaling pathways","261455688":"Genetic programming based degree constrained spanning tree extraction","273614994":"Global Solution of Optimization Problems in Rotorcraft Flight Mechanics","241159809":"Score matrix optimization for quartz binding peptides using evolutionary strategy","220702201":"Threshold Selection, Mitosis and Dual Mutation in Cooperative Co-evolution: Application to Medical 3D Tomography","224863622":"Nonlinear Model Predictive Substrate Feed Control of Biogas Plants","225822103":"A multistage genetic fuzzy classifier for land cover classification from satellite imagery","225676695":"Survivable Network Design with an Evolution Strategy","222719394":"An evolutionary approach to query-sampling for heterogeneous systems","231154989":"Enhancing the probability of three-photon absorption in iodine through pulse shaping","243781227":"Indexed bibliography of genetic algorithms in operations research","258635655":"Correcting and combining time series forecasters","260280173":"Revisiting evolutionary algorithms in feature selection and nonfuzzy/fuzzy rule based classification","41204356":"A framework for hybrid dynamic evolutionary algorithms : multiple offspring sampling (MOS)","225131929":"A generic coordination mechanism for lot-sizing in supply chains","235974373":"Optimization, imitation and innovation: Computational intelligence and games","225338777":"A (μ, λ)-coordination mechanism for agent-based multi-project scheduling","220696029":"Metaheuristic Clustering","260329342":"Image Segmentation on the Spherical Coordinate Representation of the RGB Color Space","262676308":"Teaching and peer-learning particle swarm optimization","283197468":"Genetic search for optimally-constrained multiple-line fitting of discrete data points","233655570":"Inoptimality losses in forest management decisions caused by errors in an inventory based on airborne laser scanning and aerial photographs","283451879":"Approximate fuzzy analysis of linear structural systems applying intervening variables","251729410":"Potential global stratotype sections and points in China for defining Cambrian stages and series","232707290":"Simulated Annealing","221494324":"A Steepest Descent Evolution Immune Algorithm for Multimodal Function Optimization.","272415035":"Improved Novel Global Harmony Search with a New Relaxation Method for Reliability Optimization Problems","221008932":"Sequential Parameter Optimization of an Evolution Strategy for the design of Mold Temperature Control Systems.","270723368":"A New Local Search-Based Multiobjective Optimization Algorithm","220740642":"Evolutionary algorithms for dynamic optimization problems: workshop preface.","280691120":"Automated negotiation in environmental resource management: Review and assessment","4354381":"New Linear SEC-DED Codes with Reduced Triple Bit Error Miscorrection Probability","220115985":"On Machine Symbol Grounding and Optimization.","289013803":"Metaheuristics","270506250":"Heterogeneous Populations of Learning Agents in the Minority Game","1904906":"TRUST-TECH based Methods for Optimization and Learning","246847406":"Modeling and Learning Walking Gaits of Biped Robots","220286008":"Self-adaptation of evolution strategies under noisy fitness evaluations. Genet Programming Evolvable Mach","262319805":"Community of scientist optimization: An autonomy oriented approach to distributed optimization","221006861":"Metamodel-Assisted Mixed Integer Evolution Strategies and Their Application to Intravascular Ultrasound Image Analysis","220199997":"Finding pre-images via evolution strategies","287973384":"Informed mutation of wind farm layouts to maximise energy harvest","257070710":"Fully Automatic Plaque Segmentation in 3-D Carotid Ultrasound Images","222110743":"A Novel Particle Swarm Optimization Algorithm with Adaptive Inertia Weight","229704833":"Dynamic optimisation by a modified bees algorithm","242501445":"Evolutionary Computation in Combinatorial Optimization, 10th European Conference, EvoCOP 2010, Istanbul, Turkey, April 7-9, 2010. Proceedings","255657487":"PARALLEL DIRECT SEARCH METHODS FOR SIMULATION-BASED OPTIMIZATION","1958184":"SWAF: Swarm Algorithm Framework for Numerical Optimization","275652955":"Algorithm selection for black-box continuous optimization problems: A survey on methods and challenges","216301011":"Total synthesis of Algorithmic Chemistries","236082986":"Optimization and visualization of the edge weights in optimal assignment methods for virtual screening","257580574":"A new method of mining data streams using harmony search","220148819":"Component-based construction of bio-pathway models: The parameter estimation problem","220701803":"Selecting Small Audio Feature Sets in Music Classification by Means of Asymmetric Mutation","221211775":"Current XCSF Capabilities and Challenges","216300976":"An experimental analysis of evolution strategies and particle swarm optimisers using design of experiments","220742783":"Evolutionary strategies for multi-scale radial basis function kernels in support vector machines","221271143":"Mutative Self-adaptation on the Sharp and Parabolic Ridge","270397770":"Construction of a trophically complex near-shore Antarctic food web model using the Conservative Normal framework with structural coexistence","268342949":"Multiple Geometrical Alignments for the Analysis of Protein Active Sites","226436132":"Evolvable Hardware: A Problem of Generalization Which Works Best: Large Population Size and Small Number of Generations or visa versa?","220286076":"Evolutionary Adaptation of Nonlinear Dynamical Systems in Computational Neuroscience","221561949":"Variance Scaling for EDAs Revisited","229346496":"Application of an evolutionary algorithm to the inverse parameter estimation of an individual-based model","221258847":"Skipping Fisher\u0027s Criterion.","226481168":"Economic modeling using evolutionary algorithms: The effect of a binary encoding of strategies","220290129":"Global and local real-coded genetic algorithms based on parent-centric crossover operators","3541315":"A result on time-varying compensation in l1-sensitivity minimization","264789694":"Massively Parallel Evolutionary Computation on GPGPUs","261054198":"An algorithm based on Evolution Strategies for makespan minimization in hybrid flexible flowshop scheduling problems","285448313":"A New Optimal Solution to Environmentally Constrained Economic Dispatch Using Modified Real Coded Genetic Algorithm","263507657":"Using self-adaptive optimisation methods to perform sequential optimisation for low-energy building design","228953304":"Grouping-based evolutionary algorithm improves the performance of dynamic penalty method for constrained optimization problems","259290634":"Selection Hyper-heuristics in Dynamic Environments","264287809":"Optimizing any-aged management of mixed boreal forest under residual basal area constraints","220048542":"Evolutionary Computation in Combinatorial Optimization","1763742":"Evolution Strategies in Optimization Problems","276087280":"Robot Skill Learning: From Reinforcement Learning to Evolution Strategies","220701856":"Lower Bounds for Evolution Strategies Using VC-Dimension","228686889":"Ant Colony Optimization for Continuous and Mixed-Variable Domains","51014274":"Optimisation multi-objectifs à base de métamodèle pour les procédés de mise en Forme","220048534":"Evolutionary Computation in Combinatorial Optimization","265645657":"A Spatially Informative Optic Flow Model of Bee Colony With Saccadic Flight Strategy for Global Optimization","220742822":"Stochastic local search in continuous domains: Questions to be answered when designing a novel algorithm","285045106":"Gray Wolf Optimizer for Hyperspectral Band Selection","220701864":"Niche Radius Adaptation with Asymmetric Sharing","234024034":"HappyCat - A Simple Function Class Where Well-Known Direct Search Algorithms Do Fail","220312753":"Evolution strategies based adaptive Lp LS-SVM","262295093":"Differential evolution with self-adaptation and local search for constrained multiobjective optimization","220048519":"Hybrid Metaheuristics","233172094":"Solving the Multiple Platform Configuration Problem","282005844":"Synthesising robust and optimal parameters for cardiac pacemakers using symbolic and evolutionary computation techniques","256513768":"Dynamical Modeling and Parameter Identification of Seismic Isolation Systems by Evolution Strategies","220963976":"An Adjusted Simulated Annealing Approach to Particle Swarm Optimization: Empirical Performance in Decision Making","232703098":"Evolutionary Computation on the Connex Architecture","220740736":"Performance analysis of derandomized evolution strategies in quantum control experiments","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","236169144":"A survey of non-gradient optimization methods in structural engineering","221271197":"On the Prediction of the Solution Quality in Noisy Optimization.","280600852":"A Comparison of Optimization Algorithms for Practical Staff Scheduling Problems in Logistics and Retailing","29622389":"Adaptive Encoding: How to Render Search Coordinate System Invariant","237152151":"gecco2013","221156502":"On-Board Evolutionary Algorithm and Off-Line Rule Discovery for Column Formation in Swarm Robotics","220867731":"New Computational Results for the Nurse Scheduling Problem: A Scatter Search Algorithm","257095403":"Optimization of elastic properties and weaving patterns of woven composites","262239775":"On the Behaviour of the (1,λ)-σSA-ES for a Constrained Linear Problem","224246939":"Novelty-based restarts for evolution strategies","220867810":"Comparison of Evolutionary Techniques for Value-at-Risk Calculation.","221562104":"Stochastic Feature Selection in Support Vector Machine Based Instrument Recognition","4043250":"DEPSO: Hybrid particle swarm with differential evolution operator","252384984":"Robustness in Digital Hardware","229043312":"Differential Evolution: An Efficient Method in Optimal PID Tuning and on–line Tuning","250693416":"Computational aspects of inverse analyses for determining softening curves of concrete","2945520":"GermanTeam 2003","221103305":"Optimizing on-demand data broadcast scheduling in pervasive environments","240994232":"A Strong Converse Result for Approximation by Weighted Bernstein Polynomials on the Real Line","24201371":"Evolutionary Construction of Multiple Graph Alignments for the Structural Analysis of Biomolecules","251858671":"A new approach in synchronization of uncertain chaos systems through particle swarm optimization","224472207":"A memetic algorithm for global optimization in chemical process synthesis","224472210":"Locust Swarms - A New Multi-Optima Search Technique","290480291":"An innovative framework for probabilistic-based structural assessment with an application to existing reinforced concrete structures","237012949":"A fuzzy logic based approach for modeling quality and reliability related customer satisfaction in the automotive domain","265713199":"An Interactive Web Based Toolkit For Multi Focus Image Fusion","265367083":"Symbolic regression of generative network models","274270626":"Optimization of Gas Transmission Networks under Energetic and Environmental Considerations","220867798":"Minimizing Makespan on a Single Batch Processing Machine with Non-identical Job Sizes: A Hybrid Genetic Approach","290617516":"Evolution Strategies","228927398":"Evolution Strategies with q-Gaussian Mutation for Dynamic Optimization Problems","224180063":"Learning the Track and Planning Ahead in a Car Racing Controller","256970074":"Accelerating FPGA-based evolution of wavelet transform filters by optimized task scheduling","221253436":"Learning the Complete-Basis-Functions Parameterization for the Optimization of Dynamic Molecular Alignment by ES.","221007649":"Natural Evolution Strategies","225922938":"Learning Probability Distributions in Continuous Evolutionary Algorithms - A Comparative Review","260705688":"Discrete approaches in evolution strategies based optimum design of steel frames","220372795":"Using evolution strategy for cooperative focused crawling on semantic web. Neural Comput Appl","220550975":"Evolutionary algorithms with neighborhood cooperativeness according to neural maps","273308240":"How effective is the Grey Wolf optimizer in training multi-layer perceptrons","227014556":"Evolutionary Optimization of Neural Systems: The Use of Strategy Adaptation","262272442":"Lecture Notes in Computer Science","220473145":"Solving the stochastic dynamic lot-sizing problem through nature-inspired heuristics","261918140":"Comparison of Emerging Metaheuristic Algorithms for Optimal Hydrothermal System Operation","239541349":"The German National RoboCup Team","263810461":"A Variable Kernel Function for Hybrid Unsupervised Kernel Regression","226176862":"Robustness of Isotropic Stable Mutations in a General Search Space","268884512":"A C++application programming interface for biased random-key genetic algorithms","260943270":"A Probabilistic Assessment Methodology for Life Cycle Analysis of Structures","220196659":"An evolution strategy-based multiple kernels multi-criteria programming approach: The case of credit decision making","220120883":"Optimizing feature complementarity by evolution strategy: Application to automatic speaker verification","224180083":"Online evolution in Unreal Tournament 2004","253549869":"Structure Mapping for Improved Situational Awareness, Missions Planning, and Operator Tracking","221165339":"Evolutionary tuning of multiple SVM parameters.","253293869":"Robustness in Nature as a Design Principle for Artificial Intelligence","268350917":"Agent Based Models of Competition and Collaboration","223375211":"A hybrid evolutionary algorithm for solving two-stage stochastic integer programs in chemical batch scheduling","262018465":"Heuristic correction of wind speed mesoscale models simulations for wind farms prospecting and micrositing","221411190":"Hybrid Numerical Optimization for Combinatorial Network Problems.","261479889":"Optimum power flow using flexible genetic algorithm model in practical power systems","43460816":"Towards a spatial language for mobile robots","277289679":"Maximum Likelihood Detection in Communication using Metaheuristic Search Methods","220862307":"Managing Energy in a Virtual Power Plant Using Learning Classifier Systems.","256822535":"An efficient approach for unsupervised fuzzy clustering based on grouping evolution strategies","41099327":"Chemical programming to eploit chemical Reaction systems for computation","276427305":"Designing evolutionary feedforward neural networks using social spider optimization algorithm","3220071":"Optimization Using a Modified Second-Order Approach With Evolutionary Enhancement","267058620":"Micro-macro-interactions in structured media and particle systems","283001479":"Service level agreement based adaptive Grid superscheduling","283091589":"Multi-agent evolutionary systems for the generation of complex virtual worlds","263495151":"Evolving graph‐based chromosome by means of variable size genetic network programming with binomial distribution","216301240":"Computing Nash equilibria through particle swarm optimization","257760514":"Ship hull form optimization by evolutionary algorithm in order to diminish the drag","261959164":"Bio-inspired optimisation for economic load dispatch: A review","230780835":"Evolution and Analysis of Genetic Networks for Stable Cellular Growth and Regeneration","225799965":"Evolving Solutions: The Genetic Algorithm and Evolution Strategies for Finding Optimal Parameters","259183896":"Sequential Parameter Optimization","46106834":"On the Behaviour of Evolution Strategies Optimising Cigar Functions","257330488":"A Framework for Hybrid Dynamic Evolutionary Algorithms: Multiple Offspring Sampling (MOS)","262901189":"Convergence Analysis of Evolutionary Algorithms That Are Based on the Paradigm of Information Geometry","255575372":"A DISCRETE PARTICLE SWARM OPTIMIZER FOR CLUSTERING SHORT-TEXT CORPORA","222408506":"Computing Nash equilibria through computational intelligence methods","220743507":"A mutation operator for evolution strategies to handle constrained problems.","27544537":"An Evolutionary Method for Synthesizing Technological Planning and Architectural Advance","224169946":"Application of an Adaptive Differential Evolution Algorithm With Multiple Trial Vectors to Artificial Neural Network Training","250305644":"Memetic search in artificial bee colony algorithm","224690157":"Coplanar waveguide elements for a European CAD environment","272179891":"AGGE: A Novel Method to Automatically Generate Rule Induction Classifiers Using Grammatical Evolution","257768918":"Kernel representations for evolving continuous functions","233787233":"Toward Anthropomimetic Robotics: Development, Simulation, and Control of a Musculoskeletal Torso","281174605":"Attractors in Sequence Space: Peptide Morphing by Directed Simulated Evolution","3418788":"On the Computation of All Global Minimizers Through Particle Swarm Optimization","274606798":"The Role of Behavioral Diversity and Difficulty of Opponents in Coevolving Game-Playing Agents","261129474":"Adaptive Phase Synchronisation Algorithm for Collaborative Beamforming in Wireless Sensor Networks","276834838":"Cloud Particles Evolution Algorithm","3519149":"Performance evaluation of an 8 kbps speech coder for a land mobileradio at 1.5 GHz","258176507":"An attempt to reveal synergies between biology and mechanical engineering","220739505":"Evolving heterochrony for cellular differentiation using vector field embryogeny","257615302":"A corresponding states principle-based equation for the surface tension of Alkenes","5751497":"Evolutionary Optimization of Sequence Kernels for Detection of Bacterial Gene Starts","220311429":"Jung, J.J.: Evolutionary approach for semantic-based query sampling in large-scale information sources. Inf. Sci. 182(1), 30-39","233736010":"An Evolution Strategy Approach toward Rule-Set Generation for Intrusion Detection Systems (IDS)","220862338":"Fast Blackbox Optimization: Iterated Local Search and the Strategy of Powell.","258504130":"Optimal Scaling of Digital Transcriptomes","275657409":"Statistical Comparison of evolutionary algorithm","51966377":"Evolutionary Hessian Learning: Forced Optimal Covariance Adaptive\nLearning (FOCAL)","271602308":"Urban layout optimization framework to maximize direct solar irradiation","280044038":"Performance Profile: A Multi-Criteria Performance Evaluation Method for Test-based Problems.","290776035":"Self-Practice Imitation Learning from Weak Policy","235453617":"Accelerated optimization and automated discovery with covariance matrix adaptation for experimental quantum control","220403608":"A mutation operator based on a Pareto ranking for multi-objective evolutionary algorithms","228648733":"A CASE STUDY OF USING SIMULATION AND SOFT COMPUTING TECHNIQUES FOR OPTIMISATION OF MANUFACTURING SYSTEMS","289952649":"Sparse Covariance Matrix Adaptation Techniques for Evolution Strategies","281125381":"Finite life span for improving the selection scheme in evolution strategies","46221316":"Genetic Algorithms and Their Application to In Silico Evolution of Genetic Regulatory Networks","220381156":"A Memetic Algorithm for Global Optimization in Chemical Process Synthesis Problems","3418866":"Evolutionary discriminant analysis","220606432":"A Clustering-Based Niching Framework for the Approximation of Equivalent Pareto-Subsets.","242093221":"Performance-dependent attractive and repulsive particle swarm optimisation","28357502":"Genetische Programmierung einer algorithmischen Chemie","235709634":"Validation and Optimization of an Elevator Simulation Model with Modern Search Heuristics","45172862":"An Evolutionary Confidence Measure for Spotting Words in Speech Recognition","235709635":"Validation and optimization of an elevator simulation model with modern search heuristics","224178060":"A new self-adaptive approach for evolutionary multiobjective optimization","280922735":"Improving Survivability in Environment-driven Distributed Evolutionary Algorithms through Explicit Relative Fitness and Fitness Proportionate Communication","280941164":"System identification of inverse, multimodal and nonlinear problems using evolutionary computing – Application to a pile structure supported on nonlinear springs","221157368":"Elitistic Evolution: An Efficient Heuristic for Global Optimization","288429031":"Multi-Objective Parameter Selection for Classifiers","3328741":"Evaluation of Optimization Methods for Nonrigid Medical Image Registration Using Mutual Information and B-Splines","3418857":"Real-Time Neuroevolution in the NERO Video Game","260498790":"A Distance-Based Locally Informed Particle Swarm Model for Multimodal Optimization","223301550":"Economic optimization of non-sharp separation sequences by means of evolutionary algorithms","220372929":"Neuro-evolutionary mobile robot egomotion estimation with a 3D ToF camera. Neural Comput Appl","261842296":"Evolutionary Algorithms","223059872":"A hybrid CMA-ES and HDE optimisation algorithm with application to solar energy potential","220381129":"Theoretical Analysis of Phenotypic Diversity in Real-Valued Evolutionary Algorithms With More-Than-One-Element Replacement","271870680":"A Modified DE: Population or Generation based Levy Flight Differential Evolution (PGLFDE)","257574327":"Cross-lingual training of summarization systems using annotated corpora in a foreign language","220741597":"On strategy parameter control by Meta-ES","220739549":"Tuning optimization algorithms for real-world problems by means of surrogate modeling","220313567":"Entropy-based efficiency enhancement techniques for evolutionary algorithms","264985908":"The Coral Reefs Optimization Algorithm: A Novel Metaheuristic for Efficiently Solving Optimization Problems","262362273":"The optimisation research of screw conveyor","260529281":"Reconstructing biological gene regulatory networks: Where optimization meets big data","249337300":"Nonlinear Generation of Ultra-Flat Broadened Spectrum Based on Adaptive Pulse Shaping","235709701":"Recent Developments in Derivative-Free Multiobjective Optimisation","220339753":"A comprehensive review of nature inspired routing algorithms for fixed telecommunication networks","233783010":"Optimized groundwater drawdown in a subsiding urban mining area","227335810":"On three new approaches to handle constraints within evolution strategies. Nat Comput 5:363-385","221562426":"Lecture Notes in Computer Science","286935572":"Bio-Inspired and Information-Theoretic Signal Processing","229570209":"A multi‐agent system for the decentralized resource‐constrained multi‐project scheduling problem","257176640":"Superstructure-free synthesis and optimization of distributed industrial energy supply systems","236844296":"Artificial Movements Inspired for Global Optimization","221017655":"Mutation Rate for Evolvable Hardware.","272010024":"On the efficacy of chaos-enhanced heuristic walks with nature-based controllers for robust and accurate intelligent search, part A: An experimental analysis","225158772":"Optimization in Fractal and Fractured Landscapes Using Locust Swarms","258176067":"Automated multi-objective and multidisciplinary design optimization of a transonic turbine stage","220743177":"Learning environment dynamics from self-adaptation. A preliminary investigation","220132924":"Improving convergence of evolutionary multi-objective optimization with local search: A concurrent-hybrid algorithm","265616625":"Global Optimization of Bioprocesses using Stochastic and Hybrid Methods","261043366":"Using Mutation Analysis to Evolve Subdomains for Random Testing","225214018":"Time-Dependent Trading Strategies in a Continuous Double Auction","242376002":"Develop an Evolutionary Computing Algorithm to Allocate Rooms to Functions in a Conference Centre","220132910":"Evolution strategies with cumulative step length adaptation on the noisy parabolic ridge","3418887":"Functions with noise-induced multimodality: A test for evolutionary robust optimization - Properties and performance analysis","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","220702237":"On the Importance of Information Speed in Structured Populations","237049116":"Optimizing the structure and management of uneven-sized stands of Finland","220743190":"Evolutionary learning with kernels: A generic solution for large margin problems","224364129":"Adaptive interactive evolutionary computation for cctive intent-oriented design","245384606":"Biologically inspired optimization: A review","220380701":"Enhancing Differential Evolution Utilizing Proximity-Based Mutation Operators","221253135":"A New Recurring Multistage Evolutionary Algorithm for Solving Problems Efficiently","242281776":"Multikriteriální hybridní evoluční algoritmy pro výběr a optimalizaci dekontaminačních technologií","222041726":"Restricted gradient-descent algorithm for value-function approximation in reinforcement learning","5303059":"Step Length Adaptation on Ridge Functions","239795471":"Simultaneous solving of balancing and sequencing problems in mixed-model assembly line systems","224177685":"Meta-Heuristic Search and Square Erickson Matrices","240852241":"METAMODEL-ASSISTED EVOLUTION STRATEGIES APPLIED IN ELECTROMAGNETIC COMPATIBILITY DESIGN","262163692":"Electrical discharge machine using fuzzy for fitness evolutionary strategies optimization (EDiMƒESO)","224570931":"Closed-loop evolutionary multiobjective optimization","41412899":"Automatic diagnosis of vocal fold paresis by employing Phonovibrogram features and machine learning methods","273167124":"A Clustering Method Based on the Maximum Entropy Principle","228392643":"Evolutionary algorithms for vehicle routing","222660133":"Development of scheduling strategies with Genetic Fuzzy systems","3418966":"Evolutionary gradient search revisited. IEEE Trans Evol Comput","220341824":"Optimization based design of reactive distillation column using a memetic algorithm","240620851":"Un etat des lieux de l\u0027optimisation evolutionnaire et de ses implications en sciences pour l\u0027ingenieur","221296213":"Dynamically Weighted Continuous Ant Colony Optimization for Bi-Objective Portfolio Selection Using Value-at-Risk","222002781":"Hybrid metaheuristics with evolutionary algorithms specializing in intensification and diversification: Overview and progress report","4035419":"A high fill factor 1 × N spatial light modulator based on an epitaxial polysilicon process","51474553":"Himmelstein DS, Greene CS, Moore JH.. Evolving hard problems: generating human genetics datasets with a complex etiology. Bio Data Mining 4: 21","257403967":"Evolutionary kernel density regression","273660710":"Optimal Computing Budget Allocation for Ordinal Optimization in Solving Stochastic Job Shop Scheduling Problems","222647855":"A new hybrid method using evolutionary algorithms to train Fuzzy Cognitive Maps","255614038":"Nitrates/nitrites concentration estimation in wastewater samples using transmittance curve models optimized by evolutionary computation techniques","271795033":"Globally convergent evolution strategies","222813739":"Neuroevolution strategies for episodic reinforcement learning","223688248":"Evolutionary algorithms in the optimization of dynamic molecular alignment","224603670":"On the evolution of artificial Tetris players","220444245":"Covariance Matrix Self-Adaptation and Kernel Regression - Perspectives of Evolutionary Optimization in Kernel Machines","4035396":"Multiple layer asymmetric vertical comb-drive actuated scanning mirrors","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","37437764":"Dynamically reconfigurable bio-inspired hardware","257942560":"Local SVM Constraint Surrogate Model for Self-Adaptive Evolution Strategies","290073290":"Automatic Parallelization of EC on GPGPUs and Clusters of GPGPU Machines with EASEA and EASEA-CLOUD","4307906":"Self-adaptation of mutation distribution in evolutionary algorithms","228722215":"HYBRID EA/MIP METHOD FOR SOLVING TWO-STAGE STOCHASTIC INTEGER PROGRAMMING PROBLEMS IN CHEMICAL BATCH SCHEDULING","6339557":"Transport-theory-based stochastic image reconstruction of bioluminescent sources","239543745":"HierarchicallyOrganisedEvolutionStrategiesonthe ParabolicRidge","47335764":"Emergence of robust regulatory motifs from in silico evolution of sustained oscillation","223090379":"Computational Methods in Optimization Considering Uncertainties -- An Overview","241147349":"Optimum Study of Auto-disturbance-rejection Controller for High-order Systems","222334673":"Automatic tuning of communication protocols for vehicular ad hoc networks using metaheuristics","257942734":"On Evolutionary Approaches to Unsupervised Nearest Neighbor Regression","257942732":"On Mutation Rate Tuning and Control for the (1+1)-EA","3419042":"Registration of CT and Intraoperative 3-D Ultrasound Images of the Spine Using Evolutionary and Gradient-Based Methods","251839641":"Swarm applications: A potential future application for evolvable hardware","51656847":"Using swarm intelligence for finding transition states and reaction paths","225453806":"Evolution of Descent Directions","203863993":"An adaptation of evolutionary strategies for forecasting the exchange rate","256296166":"Block Krylov Methods to Solve Adjoint Problems in Aerodynamic Design Optimization","269407140":"A modified ABC algorithm for the stage shop scheduling problem","44622084":"Pavlovian Prisoner\u0027s Dilemma—Analytical results, the quasi-regular phase and spatio-temporal patterns","241173974":"Genetic network programming with exception control","233752152":"Schriftenreihe CIplus, Band 3/2012 Beyond Particular Problem Instances: How to Create Meaningful and Generalizable Results Beyond Particular Problem Instances: How to Create Meaningful and Generalizable Results","257635554":"Evolution strategy based adaptive Lq penalty support vector machines with Gauss kernel for credit risk analysis","221335181":"An Empirical Investigation of Optimum Tracking with Evolution Strategies","41578938":"Evolving cell models for systems and synthetic biology","263896186":"Efficient retrieval of landscape Hessian: Forced optimal covariance adaptive learning","216301349":"Two-layered Surrogate Modeling for Tuning Optimization Metaheuristics","288932604":"Automatic Clustering Using Nature-Inspired Metaheuristics: A Survey","262323303":"Power law-based local search in differential evolution","225781427":"Synthesis of Spatio-temporal Models by the Evolution of Non-uniform Cellular Automata","221357815":"Neuro-fuzzy system design using differential evolution with local information","267324457":"The Dynamical Systems Approach - Progress Measures and Convergence Properties","281203466":"PARAMETRIC IDENTIFICATION FOR MODEL OF A CHEMICAL HAZARDOUS SUBSTANCE CONCENTRATION USING SOFT COMPUTING","224177804":"Defining locality in genetic programming to predict performance","228937333":"Constraint Handling for Covariance Matrix Adaption with Meta-Models","3949548":"Continuous selection and self-adaptive evolution strategies","203864052":"Curve Fitting Using Adaptive Evolution Strategies for Forecasting the Exchange Rate","220741372":"Hierarchically organised evolution strategies on the parabolic ridge","220741375":"Modeling evolutionary fitness for DNA motif discovery","225244852":"Neural computing increases robot adaptivity","220176070":"Covariance matrix self-adaptation evolution strategies and other metaheuristic techniques for neural adaptive learning","220149443":"Performance analysis of the simultaneous perturbation stochastic approximation algorithm on the noisy sphere model","220606200":"Computing Two Linchpins of Topological Degree by a Novel Differential Evolution Algorithm.","271424499":"Performance analysis of parallel master-slave Evolutionary strategies (μ,λ) model python implementation for CPU and GPGPU","4307872":"Self-Adaptive Niching CMA-ES with Mahalanobis Metric","272425950":"Identification of the hygrothermal properties of a building envelope material by the covariance matrix adaptation evolution strategy","282340151":"Gray wolf optimizer for hyperspectral band selection","220454600":"The influence of inhomogeneous trap distribution on results of DLTS study","225267330":"Numerical homogenization and optimization of smart composite materials","41412999":"Classification of functional voice disorders based on phonovibrograms","278301543":"Constructive Cooperative Coevolution for Optimising Interacting Production Stations","267441154":"Parameter-less algorithm for evolutionary-based optimization: For continuous and combinatorial problems","267252761":"An inference model for analyzing termination conditions of Evolutionary Algorithms","277562238":"Fully Automatic Roadside Camera Calibration for Traffic Surveillance","220516051":"Self-Adaptation of Mutation Distribution in Evolution Strategies for Dynamic Optimization Problems","39571884":"Modelado e Identicación de Bioprocesos","235720181":"Improving efficiency of a statistical analysis of complex ecological models, when using the statistical software R by parallelising tasks with Rmpi","265190452":"Asymmetric Sharing","262288472":"Signaling and visualization for interactive evolutionary search and selection of conceptual solutions","269300745":"Memory-aware sizing for in-memory databases","269329413":"Verification through calibration: An approach and a case study of a model of conflict in Syria","220449066":"A Review of Constraint-Handling Techniques for Evolution Strategies","267760638":"Water wave optimization: A new nature-inspired metaheuristic","241064530":"MGA-Toolbox Version 0.1 Tool for Aligning Multiple Graphs","220160275":"Genetic Programming with Linear Representation: a Survey.","262452139":"Identification of Functionally Related Enzymes by Learning-to-Rank Methods","220739879":"Sex and death: Towards biologically inspired heuristics for constraint handling","257626952":"Evolutionary discriminative confidence estimation for spoken term detection","41530989":"In vivo bioluminescence tomography with a blocking-off finite-difference SP3 method and MRI/CT coregistration","264850396":"Environment-driven Open-ended Evolution with a Population of Autonomous Robots","221053237":"Power Prediction in Smart Grids with Evolutionary Local Kernel Regression","261039022":"Speciation of population in neuroevolutionary ship handling","272030748":"Distribution of waiting time for dynamic pickup and delivery problems","242731612":"Chose the Right Mutation Rate for Better Evolve Combinational Logic Circuits","259971920":"Modos de Coordinación en la Actuación de un Grupo Colaborativo de Decisores bajo un Ambiente Distribuido y Asíncrono","221272323":"Entwicklung und Optimierung eines elastischen Registrierungsverfahrens für CTA und RA Daten.","51623719":"Hybrid Ant Colony-Genetic Algorithm (GAAPI) for Global Continuous Optimization","234795464":"An eigenanalysis and synthesis of unitary operators used in quantum computing algorithms","6532185":"Efficiency of transfection and localization of superparamagnetic iron oxide particles in neural progenitor cells using two methods.","243333820":"Immune secondary response and clonal selection inspired optimizers","271547411":"(μ,λ) Evolutionary and particle swarm hybrid algorithm over cloud computing, with an application to dinosaur gait optimization","27516318":"A Systematic Procedure for Analysis and Design of Energy Systems","4201599":"Elitist generational genetic chromodynamics - A new radii-based evolutionary algorithm for multimodal optimization","283772074":"Analysis of Calendar Effects: Day-of-the-Week Effect on the Stock Exchange of Thailand (SET)","226808261":"Evolutionary Optimization of Least-Squares Support Vector Machines","224751910":"Tuning Search Algorithms for Real-World Applications: A Regression Tree Based Approach","224084255":"A Survey on the Application of Genetic Programming to Classification","45397745":"Environment-Driven Embodied Evolution in a Population of Autonomous Agents","220866912":"Enhancing Parameter Estimation of Biochemical Networks by Exponentially Scaled Search Steps","235336266":"Local Search and Restart Strategies for Satisfiability Solving in Fuzzy Logics","257518345":"Dynamic group-based differential evolution using a self-adaptive strategy for global optimization problems","220739961":"DBSCAN-based multi-objective niching to approximate equivalent pareto-subsets","227113432":"Using optimization for fitting individual-tree growth models for uneven-aged stands","228895217":"Stochastic integer programming in chemical batch scheduling: evolution strategies vs. exact algorithms","29617556":"Unsupervised Learning of Echo State Networks: A Case Study in Artificial Embryogeny","220866931":"A Framework for Multi-model EDAs with Model Recombination","244343497":"Evolutionary Fabrication: The Co-Evolution of Form and Formation","227295702":"Use of the q-Gaussian Mutation in Evolutionary Algorithms","260006684":"Enhanced particle swarm optimization based on principal component analysis and line search","261858296":"Evolving parameters of multi-scale radial basis function kernels for support vector machines","279057607":"Meta-Heuristic Algorithms in Car Engine Design: A Literature Survey","40697355":"Vector Field Embryogeny","276481041":"An integrative top-down and bottom-up qualitative model construction framework for exploration of biochemical systems","221309275":"Gaining Insights into Laser Pulse Shaping by Evolution Strategies","256967482":"Surface tension prediction for refrigerant binary systems","228628940":"Electromagnetic device optimization by hybrid evolution strategy approaches","265128866":"Metaheuristic Multi-objective optimization of constrained Futures Portfolios for effective risk management","224330030":"Evolutionary Programming with q-Gaussian Mutation for Dynamic Optimization Problems","284716169":"Ringed Seal Search for Global Optimization via a Sensitive Search Model","265730980":"The estimation of I–V curves of PV panel using manufacturers’ I–V curves and evolutionary strategy","291972372":"Tutorial Sobre o Uso de Técnicas para Controle de Parâmetros em Algoritmos de Inteligência de Enxame e Computação Evolutiva","235707001":"DEAP: Evolutionary algorithms made easy","220301652":"Enhancing network based intrusion detection for imbalanced data.","2901082":"Evolutionary Algorithms For Optimization Practitioners","220064100":"A survey of repair methods used as constraint handling techniques in evolutionary algorithms","242102804":"Solving deterministic policy (PO)MDPs using Expectation-Maximisation and Antifreeze","23637269":"Morik, K.: About the non-convex optimization problem induced by non-positive semidefinite kernel learning. Advances in Data Analysis and Classification 2, 241-258","224330017":"A Technique for the Visualization of Population-Based Algorithms","45815492":"A Little Respect (for the Role of Common Components in Heuristic Search)","221008301":"Improving the performance of particle swarms through dimension reductions — A case study with locust swarms","258569192":"Physics- and Engineering Knowledge-Based Repair of Computer-Aided Design Parametric Geometries","224641504":"Maximum-Likelihood Parameter Estimation for Current-Based Mechanical Fault Detection in Induction Motors","220740011":"Performance analysis of niching algorithms based on derandomized-ES variants","229325101":"Modeling and analysis of biopathways dynamics","282149974":"Identification of Envelope Hygrothermal Properties Based on In-situ Sensor Measurements and Stochastic Inverse Methods","220740003":"Evolving an autonomous agent for non-Markovian reinforcement learning","277222408":"Optimisation sans dérivées sous contraintes : deux applications industrielles en ingénierie de réservoir et en calibration des moteurs","235711107":"Hybrid Metaheuristics","282238045":"Retinal Blood Vessels Segmentation Based on Bio-Inspired Algorithm","228382991":"The NERO real-time video game","232251712":"Clever Algorithms","241216248":"Robust Bio-regenerative Life Support Systems Control","221432232":"Evolutionary Selection in Simulation-Based Optimization","251693978":"Utility driven optimization of real time data broadcast schedules","220740022":"Efficient Credit Assignment through Evaluation Function Decomposition","220289410":"A new methodology for generating and combining statistical forecasting models to enhance competitive event prediction","233701706":"Designing fractional-order PI\u003cSUP align\u003dright\u003eλ\u003c/SUP\u003eD\u003cSUP align\u003dright\u003eμ\u003c/SUP\u003e controller using differential harmony search algorithm","220866959":"Stochastic Local Search Techniques with Unimodal Continuous Distributions: A Survey.","237535887":"Population-Based Methods in the Optimization of Stand Management","270279867":"Gaussian bare-bones artificial bee colony algorithm","241631947":"Combining genetic oscillators and switches using evolutionary algorithms","224342513":"Hierarchical Pattern Discovery in Graphs","230701423":"Integration of Flexible Interfaces in Optimization Software Frameworks for Simulation-Based Optimization","43292197":"Optimisation globale de systèmes mécaniques","271817857":"Localized biogeography-based optimization","230701430":"Simulation-based evolution of resupply and routing policies in rich vendor-managed inventory scenarios","224330213":"Large Scale Global Optimization Using Differential Evolution With Self-adaptation and Cooperative Co-evolution","230701435":"Simulation-based evolution of municipal glass-waste collection strategies utilizing electric trucks","227723564":"Improving the performance of natural gas pipeline networks fuel consumption minimization problems","224219618":"Heart Rate Prediction Model Based on Physical Activities Using Evolutionary Neural Network","220559846":"Evolutionary algorithm using feasibility-based grouping for numerical constrained optimization problems","224330139":"Scalarization versus Indicator-based Selection in Multi-Objective CMA Evolution Strategies","220740077":"On the use of evolution strategies for optimising certain positive definite quadratic forms","251909061":"A heuristic approach for value at risk based portfolio optimization","216457262":"Evaluating optimization methodologies for future integration in building performance tools","273640583":"Biogeographic harmony search for emergency air transportation","6528174":"Metabolic flux estimation - A self-adaptive evolutionary algorithm with singular value decomposition","250710591":"Perceptrons without output codes","239538824":"DevelopmentofSchedulingStrategieswithGeneticFuzzySystems","216301611":"AMUSE (Advanced Music Explorer)---A Multitool framework for music data analysis","263621479":"FUZZY OPERATOR TREES FOR MODELING RATING FUNCTIONS","220772857":"Using ES Based Automated Software Clustering Approach to Achieve Consistent Decompositions.","285648337":"Dengue disease: a multiobjective viewpoint","271568120":"Simultaneous topology, shape and size optimization of truss structures by fully stressed design based on evolution strategy","288073202":"U-NSGA-III: A Unified Evolutionary Optimization Procedure for Single, Multiple, and Many Objectives: Proof-of-Principle Results","4074724":"Neuroevolution for reinforcement learning using evolution strategies","271551733":"Active covariance matrix adaptation for multi-objective CMA-ES","239921815":"Heat Exchanger Exergetic Lifecycle Cost Optimization using Evolutionary Algorithms","261036910":"Optimization in multi-modal continuous space with little globally convex using differential evolution on scattered parents","228774214":"Efficient and Responsive Stochastic Optimization","226019740":"Steigerung der Mitarbeiterproduktivität durch automatische Erstellung von Arbeitszeitmodellen in Verbindung mit der Personaleinsatzplanung am Beispiel Handel","224999823":"Robustness as Key to Success for Space Missions","257074100":"Prediction stability in a data-based, mechanistic model of σF regulation during sporulation in Bacillus subtilis","220742081":"Why noise may be good: Additive noise on the sharp ridge","224166327":"Evolutionary design and optimization of Wavelet Transforms for image compression in embedded systems","224563598":"JG(2)A: A Grid-Enabled Object-Oriented Framework for Developing Genetic Algorithms","221139395":"Sentiment Classification with Support Vector Machines and Multiple Kernel Functions","268241680":"Darwin or Lamarck? Future Challenges in Evolutionary Algorithms for Knowledge Discoveryand Data Mining","245404238":"Optimierung mit Genetischen Algorithmen und eine Anwendung zur Modellreduktion (Optimization with Genetic Algorithms and an Application for Model Reduction)","51912681":"Natural Evolution Strategies","224129453":"Towards Intelligent Team Composition and Maneuvering in Real-Time Strategy Games","28355912":"Using Gene Duplication and Gene Deletion in Evolution Strategies","257553313":"GA-TVRC-Het: Genetic algorithm enhanced time varying relational classifier for evolving heterogeneous networks","225468809":"Evolution Strategies in Dynamic Environments","269133040":"Robust Topology Optimization using Multi Objective Evolutionary Algorithms","275244188":"Visualization of Evolutionary Runs with Isometric Mapping","220867030":"A Memetic Algorithm with Population Management (MA|PM) for the Capacitated Location-Routing Problem","239854261":"From parameter control to search control: Parameter Control Abstraction in Evolutionary Algorithms","261104273":"Estimation of first excursion probabilities for uncertain stochastic linear systems subject to Gaussian load","220825642":"An Analysis of Locust Swarms on Large Scale Global Optimization Problems","257196626":"A memetic approach to construct transductive discrete support vector machines","259971701":"UNIVERSIDAD DE OCCIDENTE UNIDAD CULIACÁN Doctorado en Ciencias Administrativas MODOS DE COORDINACIÓN EN LA ACTUACIÓN DE UN GRUPO COLABORATIVO DE DECISORES BAJO UN AMBIENTE DISTRIBUIDO Y ASÍNCRONO TESIS QUE COMO REQUISITO PARA OBTENER EL GRADO DE DOCTOR EN CIENCIAS ADMINISTRATIVAS PRESENTA","286010375":"Tax Enforcement in an Agent-Based Model with Endogenous Audits","226240626":"Defining locality as a problem difficulty measure in genetic programming","252025364":"An evolutionary confidence measurement for spoken term detection","51912205":"Information-Geometric Optimization Algorithms: A Unifying Picture via Invariance Principles","225568871":"Exploring Very Large State Spaces Using Genetic Algorithms","220176388":"A differential evolution based algorithm for breaking the visual steganalytic system","222826580":"Improving food processing using modern optimization methods","51932676":"Novel Analysis of Population Scalability in Evolutionary Algorithms","275051898":"The Presence of Nuclear Cactus in the Early Drosophila Embryo May Extend the Dynamic Range of the Dorsal Gradient","220444674":"An Improved Harmony Search Algorithm with Differential Mutation Operator","221016074":"Combined Working Time Model Generation and Personnel Scheduling","224559180":"An evolved fuzzy logic system for fire size prediction","4298097":"Evolution Strategies for Matching Active Appearance Models to Human Faces","221399043":"Fuzzy Modeling of Labeled Point Cloud Superposition for the Comparison of Protein Binding Sites.","239577972":"Foundations of Genetic Algorithms, 8th International Workshop, FOGA 2005, Aizu-Wakamatsu City, Japan, January 5-9, 2005, Revised Selected Papers","240737132":"Optimizing Flow Shop Sequencing Through Simulation Optimization Using Evolutionary Methods","229431449":"Contaminant source characterization in water distribution systems using binary signals","275244376":"Hybrid Manifold Clustering with Evolutionary Tuning","229103846":"Dynamic optimisation by a modified bees algorithm","220471392":"Bullinaria, J.A.: An improved multi-objective evolutionary algorithm for the vehicle routing problem with time windows. Comput. Oper. Res. 38(1), 287-300","224567337":"Ant Colony Optimisation-based radiation pattern manipulation algorithm for Electronically Steerable Array Radiator Antennas","253545047":"Bio-inspired FPGA Architecture for Self-Calibration of an Image Compression Core based on Wavelet Transforms in Embedded Systems","220661868":"Two effective hybrid metaheuristic algorithms for minimization of multimodal functions","278650325":"Handbook of Natural Computing","221157473":"Intelligent Anti-Grouping in Real-Time Strategy Games","220514420":"Real-parameter evolutionary multimodal optimization: a survey of the state-of-the-art. Swarm Evol Comput 1:71-88","48412595":"Evolutionary Robotics: Exploring New Horizons","4201748":"A new mutation operator for evolution strategies for constrained problems","225099839":"Premature Convergence in Constrained Continuous Search Spaces","4201751":"Evolution strategies with adaptively rescaled mutation vectors","2938228":"Evolving Dynamics in an Artificial Regulatory Network Model","227944655":"Solving Satisfiability in Fuzzy Logics with Evolution Strategies","231248017":"Meta-Optimization of Evolutionary Strategies for Empirical Potential Development: Application to Aqueous Silicate Systems","225714221":"Integrating fire risk in stand management scheduling. An application to Maritime pine stands in Portugal","47648653":"Environment-driven Distributed Evolutionary Adaptation in a Population of Autonomous Robotic Agents","5582089":"Reconstruction of Multiple Neuromagnetic Sources Using Augmented Evolution Strategies— A Comparative Study","236309320":"Meta-Evolutionary Algorithms and Recombination Operators for Satisfiability Solving in Fuzzy Logics","7130418":"Network topology and the evolution of dynamics in an artificial genetic regulatory network model created by whole genome duplication and divergence","200619691":"Estrategias Evolutivas Aplicadas a los Algoritmos de Enjambres para el Control de Sistemas Complejos","220051523":"A Genetic Fuzzy-Rule-Based Classifier for Land Cover Classification From Hyperspectral Imagery","273478959":"Grouping evolution strategies: An effective approach for grouping problems","50227099":"Superposition and Alignment of Labeled Point Clouds","262363845":"Right on the MONEE: combining task- and environment-driven evolution","220852302":"Exploring Very Large State Spaces Using Genetic Algorithms.","229068992":"GermanTeam 2004","284454299":"Towards Statistical Convergence Criteria for Mutation-Based Evolutionary Algorithms","277919202":"Use of depth-first search and direct search methods to optimize even-aged stand management: a case study involving maritime pine in Asturias (NW Spain)","291595282":"Niching in Evolutionary Algorithms","261858030":"Differential evolution with local information for neuro-fuzzy systems optimisation","260596479":"Locust Swarms for Large Scale Global Optimization of Nonseparable Problems","221163609":"Evolution of Reactive Rules in Multi Player Computer Games Based on Imitation","224712723":"Multiuser Detection in DS-CDMA Using Hybrid Evolutionary Strategy","221599821":"Decision Support in Car Leasing: a Forecasting Model for Residual Value Estimation.","251980414":"Synthesizing Chaotic Systems with Genetic Programming","266656415":"Generational neuro-evolution: Restart and retry for improvement","233953418":"Recursive simulation and experimental frame for multiscale simulation","282441134":"Simulated Annealing With Parameter Tuning for Wind Turbine Placement Optimization","250340247":"THE PROGRAM STRUCTURE OF GENETIC PROGRAMMING TREES","220577882":"A Lamarckian Hybrid of Differential Evolution and Conjugate Gradients for Neural Network Training","226418689":"A survey on approaches for reliability-based optimization. Struct Multidiscip Optim","257516251":"A comparison of three heuristics on a practical case of sub-daily staff scheduling","230813764":"Evolutionary Optimization of Multi-Agent Control Strategies for Electric Vehicle Charging","259973883":"• Babar, zaheer et al, “Genetic programming based degree constrained spanning tree extraction”, in Proceedings 2013 Eighth International Conference on Digital Information Management (ICDIM). Sept 2013, pp. 241–246.","228061201":"A cooperative strategy for parameter estimation in large scale systems biology models","223666396":"Short-term fault prediction based on support vector machines with parameter optimization by evolution strategy","262496815":"ALGORITMOS EVOLUTIVOS MULTIOBJETIVO APLICADOS A LOS PROYECTOS DE ANTENAS MICROSTRIP","229349409":"Hybrid chaotic ant swarm optimization","222515404":"The landscape adaptive particle swarm optimizer","220176528":"Evolutionary strategies for hyperparameters of support vector machines based on multi-scale radial basis function kernels","247712603":"Technology and the Foundations of Biology","220901555":"Automatic Generation of Optimised Working Time Models in Personnel Planning","275836394":"A Cooperative Framework for Fireworks Algorithm","228980792":"Stock Exchange of Thailand Index Prediction Using Back Propagation Neural Networks","261038608":"Multirole Population of Automated Helmsmen in Neuroevolutionary Ship Handling","221431953":"Parameter Meta-optimization of Metaheuristic Optimization Algorithms","273696249":"On Current Model–Building Methods for Multi–Objective Estimation of Distribution Algorithms: Shortcommings and Directions for Improvement","263172614":"Computational Optimization and Applications in Engineering and Industry","220868736":"A Review of Bio-inspired Algorithms as Image Processing Techniques","225099972":"On Advantages of Scheduling Using Genetic Fuzzy Systems","277695778":"Methods for In Silico Biology: Model Construction and Analysis","262937113":"Systematic N-tuple Networks for Position Evaluation: Exceeding 90% in the Othello League","221358212":"A Genetic Fuzzy Rule-Based Classifier for Land Cover Image Classification","259125956":"Emergency railway wagon scheduling by hybrid biogeography-based optimization","2553233":"Dynamic Optimization Of Bioreactors: A Review","262799891":"Biochemical systems identification by a random drift particle swarm optimization approach","262169114":"Hybrid Artificial Intelligence Approaches on Vehicle Routing Problem in Logistics Distribution","220741779":"Optimizing of NC tool paths for five-axis milling using evolutionary algorithms on wavelets","257252072":"A metaheuristic framework for stochastic combinatorial optimization problems based on GPGPU with a case study on the probabilistic traveling salesman problem with deadlines","260942384":"Uncertainty Evaluation of Reinforced Concrete and Composite Structures Behavior","220057763":"Evolutionary Approach to Improve Wavelet Transforms for Image Compression in Embedded Systems","252207798":"Multiagent-Based Fault Tolerance Management for Robustness","4205956":"Prediction of the Stock Exchange of Thailand using adaptive evolution strategies","255658745":"A Knowledge-Based Geometry Repair System for Robust Parametric CAD Models","258382498":"Adaptive Parameters for a Modified Comprehensive Learning Particle Swarm Optimizer","291406999":"Viability Principles for Constrained Optimization Using a (1+1)-CMA-ES","262322797":"A unification of the prevalent views on exploitation, exploration, intensification and diversification","226058401":"A Metamodel-Assisted Steady-State Evolution Strategy for Simulation-Based Optimization","229091452":"Evolution strategies","221450472":"Voice Pathology Classification by Using Features from High-Speed Videos.","271564276":"Calculation of a Fixed–Tank Vehicle Optimum Dynamic Performance","202256878":"Design of problem-specific evolutionary algorithm/mixed-integer programming hybrids: Two-stage stochastic integer programming applied to chemical batch scheduling","220176637":"Modeling dynamics of a real-coded CHC algorithm in terms of dynamical probability distributions","40906643":"Memetic Algorithms for Continuous Optimisation Based on Local Search Chains","40906645":"Adaptive Niche Radii and Niche Shapes Approaches for Niching with the CMA-ES","275602823":"Output-error state-space identification of vibrating structures using evolution strategies: A benchmark study","260524652":"Adaptive Peptide Design","261202557":"An Evolutionary Strategy for Surrogate-Based Multiobjective Optimization","220219596":"Evolutionary algorithm for stochastic job shop scheduling with random processing time","269297121":"Multi objective optimization of energy production of distributed generation in distribution feeder","226615404":"An Implementation of Evolutionary Computation Operators in OpenCL","275258776":"A Novel Hybrid Adaptive Collaborative Approach Based on Particle Swarm Optimization and Local Search for Dynamic Optimization Problems","202256892":"Evolutionäre Algorithmen zur Echtzeitoptimierung von Produktionsplänen für Chargenprozesse (Evolutionary Algorithms for the Online Optimization of Batch Production Schedules)","223090879":"A population-based artificial immune system for numerical optimization","259080839":"An Evolutionary Algorithm for Sub-Daily/Sub-Shift Staff Scheduling","220864720":"Variable Metric Reinforcement Learning Methods Applied to the Noisy Mountain Car Problem","270163485":"Subdomain-Based Test Data Generation","224260949":"A Multi-Facet Survey on Memetic Computation","220676909":"A Rigorous Analysis of the Harmony Search Algorithm: How the Research Community can be Misled by a \"Novel\" Methodology.","27811749":"Mixed-Integer Nonlinear Programming Optimization Strategies for Batch Plant Design Problems","224301907":"Differential evolution for multiobjective optimization with self adaptation","221008674":"Evolutionary optimization of ship propulsion systems","216300278":"Sequential Parameter Optimization Applied to Self-Adaptation for Binary-Coded Evolutionary Algorithms","216300272":"Hypervolumen-basierte Selektion in einem evolutionären Algorithmus zur Mehrzieloptimierung","276272739":"Efficient real-parameter single objective optimizer using hierarchical CMA-ES solvers","228746170":"Recent approaches to global optimization problems through Particle Swarm optimization. Nat Comput 1(2):235?306","246044850":"Type II robotic assembly line balancing problem: An evolution strategies algorithm for a multi-objective model","220701501":"Convergence Analysis of Evolution Strategies with Random Numbers of Offspring","220740405":"Racing to improve on-line, on-board evolutionary robotics","224646012":"Improving Evolution Strategies through Active Covariance Matrix Adaptation","224645955":"The polar evolution strategy","267215308":"Preference-Based reinforcement learning: Evolutionary direct policy search using a Preference-Based racing algorithm","254003457":"Analysis of a repair mechanism for the (1,λ)ES applied to a simple constrained problem","224123768":"Coupling simulation with HeuristicLab to solve facility layout problems","225370957":"Iterated local search with Powell\u0027s method: A memetic algorithm for continuous global optimization","290946917":"Signals and Images: Advances and Results in Speech, Estimation, Compression, Recognition, Filtering, and Processing","220742428":"Theoretical and empirical study of particle swarms with additive stochasticity and different recombination operators","251894071":"Multi-objective evolution of the Pareto optimal set of neural network classifier ensembles","261159332":"Redundancy creates opportunity in developmental representations","273211004":"Incremental Learning of Bayesian Networks Based on Chaotic Dual-Population Evolution Strategies and Its Application to Nanoelectronics","229063570":"Resampling versus Repair in Evolution Strategies Applied to a Constrained Linear Problem","259170631":"Population-based metaheuristics for continuous boundary-constrained dynamic multi-objective optimisation problems","259991882":"Nonautonomous stochastic search for global minimum in continuous optimization","29636594":"Adaptive Encoding for Optimization","272242182":"The Simplicity of Optimal Trading in Order Book Markets","225182547":"Hochlexibles Workforce Management. Herausforderungen und Lösungsverfahren","224594720":"Agent-Based Simulation of Dispatching Rules in Dynamic Pickup and Delivery Problems","283494049":"Computational Fluid Dynamics-Based Design Optimization Method for Archimedes Screw Blood Pumps","264002043":"Application of Cognitive Techniques to Network Management and Control","266230167":"Interactive Evolutionary Strategies for Automatic Facial Composite Generation","4245006":"Particle Swarm Optimization with Discrete Recombination: An Online Optimizer for Evolvable Hardware","230816654":"Solving differential equations with Fourier series and Evolution Strategies","220867450":"Convergence Synthesis of Dynamic Frequency Modulation Tones Using an Evolution Strategy","220740472":"ICSPEA: evolutionary five-axis milling path optimisation.","221506403":"GA-TVRC: A Novel Relational Time Varying Classifier to Extract Temporal Information Using Genetic Algorithms.","267454882":"Design of memetic algorithms for the efficient optimization of chemical process synthesis problems with structural restrictions","260125143":"Engineering Design and Decision Making Models","37536861":"Self-Adaptive Scouting—Autonomous Experimentation for Systems Biology","220668742":"State-of-the Art Review —Evolutionary Algorithms for Vehicle Routing","220701505":"Cumulative Step Length Adaptation on Ridge Functions","228674509":"Interactive Nature-Inspired Heuristics for Automatic Facial Composite Generation","228707279":"Metamodel-Assisted Simulation-Based Optimization of a Real-World Manufacturing Problem","262322636":"Tracking Targets under Uncertainty: Natural Computing Approaches","223882024":"A model for parameter setting based on Bayesian networks","220867418":"Staff Scheduling with Particle Swarm Optimisation and Evolution Strategies","221522757":"Evolving Scientific Knowledge","220846939":"A novel high frequency, high-efficiency, differential class-E power amplifier in 0.18μm CMOS","216300182":"Considerations of Budget Allocation for Sequential Parameter Optimization (SPO)","220777306":"Genetic Local Search for Optimum Multiuser Detection Problem in DS-CDMA Systems","226315023":"Niching Methods: Speciation Theory Applied for Multi-modal Function Optimization","237238352":"TECHNISCHE UNIVERSIT¨ AT DORTMUND REIHE COMPUTATIONAL INTELLIGENCE COLLABORATIVE RESEARCH CENTER 531 Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods Intelligent Group Movement and Selection in Realtime Strategy Games","224215848":"Fast Optimization of Electromagnetic Design Problems Using the Covariance Matrix Adaptation Evolutionary Strategy","216300178":"Investigation of One-Go Evolution Strategy/Quasi-Newton Hybridizations","216300179":"Model Optimization with Evolutionary Algorithms","216300188":"Challenges for Contemporary Evolutionary Algorithms","216300189":"Challenges for Contemparary Evolutionary Algorithms","282971815":"Sieves method in fuzzy control: logarithmically increase the number of rules","220797780":"Automatic Parameter Optimization for a Dynamic Robot Simulation.","270007913":"An Algebraic Approach to Population-Based Evolutionary Algorithm Generation","256721203":"A survey on optimization metaheuristics","251750785":"Evolution¨ are Algorithmen kurz gefasst1","40535273":"Neural learning methods for visual object detection","262400288":"Integrating niching into the predator-prey model using epsilon-constraints","270683814":"Evolutionary Algorithms for Wireless Communications: A Review of the State-of-the art","261353751":"Calibration of a physics-based model of an anthropomimetic robot using Evolution Strategies","221006761":"On the Evolution of Laser Pulses under a Dynamic Quantum Control Environment","216300130":"Experimental Research in Evolutionary Computation---The New Experimentalism","259994102":"A survey on nature inspired metaheuristic algorithms for partitional clustering","268173686":"Application of evolutionary algorithm to design minimal phase digital filters with non-standard amplitude characteristics and finite bit word length","216300137":"Experimental Analysis of Evolution Strategies---Overview and Comprehensive Introduction","220380076":"Grid computing for parallel bioinspired algorithms","266322253":"A hybrid immune–evolutionary strategy algorithm for the analysis of the wide-angle X-ray diffraction curves of semicrystalline polymers","235962500":"Simulated 3D Biped Walking with an Evolution-Strategy Tuned Spiking Neural Network","290435032":"Optimizing groups of colluding strong attackers in mobile urban communication networks with evolutionary algorithms","235225245":"Robust experiment design for the estimation of thermophysical parameters using stochastic algorithms","216300157":"SPOT - Sequential Parameter Optimization Toolbox (Documentation)","220740531":"Particle swarm guided evolution strategy","3417769":"(1+λ) evolution strategy method for asynchronous DS-CDMA multiuser detection","283475579":"A parallel evolution strategy for an earth imaging problem in geophysics","243451937":"Optimal control of multiphoton ionization of Rb2 molecules in a magneto-optical trap","233763658":"Visualization and clustering by 3D cellular automata: Application to\nunstructured data","220879758":"High Level Validation of an Optimization Algorithm for the Implementation of Adaptive Wavelet Transforms in FPGAs.","20256656":"Lysis in detection of intracellular organisms.","238452894":"Learning Fast Walking Patterns with Reliable Odometry Information for Four-Legged Robots","263739668":"Hybrid Biogeography-Based Optimization for Integer Programming","216500808":"Greedy Scheduling with Complex Objectives","228756242":"Gesture Recognition Using Neuroevolution","241465557":"Feedback Structures as a Key Requirement for Robustness: Case Studies in Image Processing","220740506":"High Dimensions and Heavy Tails for Natural Evolution Strategies","228895504":"Evolution strategies learned with automatic termination criteria","216500816":"Greedy Scheduling with Custom-made Objectives","220199847":"Evolution strategies and multi-objective optimization of permanent magnet motor","51025331":"Impacts of Invariance in Search: When CMA-ES and PSO Face Ill-Conditioned and Non-Separable Problems","224472027":"Differential Evolution with Self-adaptation and Local Search for Constrained Multiobjective Optimization","267960643":"Automatic Design of Analogue Circuits","242387145":"Computational Maps in the Visual Cortex","227662634":"Circadian phase entrainment via nonlinear model predictive control","220218269":"Tuning metaheuristics: A data mining based approach for particle swarm optimization","4269820":"A Population-oriented Architecture for Particle Swarms","259092943":"A novel prototype generation technique for handwriting digit recognition","45925500":"SPOT: An R Package For Automatic and Interactive Tuning of Optimization Algorithms by Sequential Parameter Optimization","2569958":"Parallel Evolutionary Training Algorithms for \"hardware-Friendly\" Neural Networks","265470227":"Evolution strategies for computing periodic orbits","283080221":"Divergence of character and premature convergence: A survey of methodologies for promoting diversity in evolutionary optimization","262885737":"Combining Environment-Driven Adaptation and Task-Driven Optimisation in Evolutionary Robotics","220701668":"Comparison of Steady-State and Generational Evolution Strategies for Parallel Architectures.","221185001":"Evolutionary Algorithms with Stable Mutations Based on a Discrete Spectral Measure","261140826":"A Multipopulation Coevolutionary Strategy for Multiobjective Immune Algorithm","41219236":"Lower Bounds for Comparison Based Evolution Strategies Using VC-dimension and Sign Patterns","250730532":"Language Games and Generalisation Grounded in Autonomous Agents","220742653":"Tone mapping by interactive evolution","266355000":"Using statistical inference for designing termination conditions ensuring convergence of Evolutionary Algorithms","228342596":"Evolving neural network agents in the NERO video game","216300094":"SPOT---A Toolbox for Visionary Ideas","224646017":"An Evolution Strategy for Improving the Design of Phased Array Transducers","263911775":"EVOLUTIONARY OPTIMIZATION OF SEQUENCE KERNELS FOR DETECTION OF BACTERIAL GENE STARTS","282928699":"Design optimization of large gap single axis thrust magnetic bearing actuator","267043079":"Comparison of Constraint-Handling Mechanisms for the (1,λ)-ES on a Simple Constrained Problem","220867524":"Cumulative Step Length Adaptation for Evolution Strategies Using Negative Recombination Weights","3421893":"Analysis of CCME: Coevolutionary Dynamics, Automatic Problem Decomposition, and Regularization","254716375":"Image Segment Processing for Analysis and Visualization","226982782":"An Analysis of the Control Parameters’ Adaptation in DE","220867536":"Adaptability of Algorithms for Real-Valued Optimization","277028473":"Bio-Inspired Routing Algorithms Survey for Vehicular Ad Hoc Networks","220867542":"Substitution Matrix Optimisation for Peptide Classification","261636453":"A methodology for the characterization and diagnosis of cognitive impairments - Application to specific language impairment","280944193":"Combining Conflicting Environmental and Task Requirements in Evolutionary Robotics","261189776":"Frequency Fitness Assignment","261062795":"Generalized Multiobjective Evolutionary Algorithm Guided by Descent Directions","224696929":"Current Based Mechanical Fault Detection in Induction Motors through Maximum Likelihood Estimation","258523246":"Reverse Engineering of Kinetic Reaction Networks by Means of Cartesian Genetic Programming and Particle Swarm Optimization","28352182":"Experimental analysis of evolution strategies","264005812":"Adaptive water demand forecasting for near real-time management of smart water distribution systems","263893171":"Measurement of Fitness Function efficiency using Data Envelopment Analysis","41786737":"Efficient Covariance Matrix Update for Variable Metric Evolution Strategies","280385466":"Evolutionary Optimization","252743685":"Robust Learning of High-dimensional Biological Networks with Bayesian Networks","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","232776392":"The Sequential Parameter Optimization Toolbox","28352169":"Optimal Elevator Group Control by Evolution Strategies","202255127":"The Multi-objective Variable Metric Evolution Strategy, Part I","287796796":"Mutation strength control via meta evolution strategies on the ellipsoid model","222966358":"Engineered versus standard evolutionary algorithms: A case study in batch scheduling with recourse","9050004":"Parameter Estimation in Biochemical Pathways: A Comparison of Global Optimization Methods","262903989":"Investigating replenishment policies for centralised and decentralised supply chains using stochastic programming approach","276885406":"Lévy flight artificial bee colony algorithm","220867125":"An Efficient Hybrid Search Algorithm for Various Optimization Problems","273315689":"An implementation of the path integrator mechanism of head direction cells for bio-mimetic navigation","261478576":"Evolutionary Feature Preselection for Viola-Jones Classifier Training","224645701":"Weighted Multirecombination Evolution Strategies on the Parabolic Ridge","224301689":"A global-local hybrid Evolutionary Strategy (ES) for Recurrent Neural Networks (RNNs) in system identification","28358300":"Non-convex and multi-objective optimization in data mining","286510653":"Concise Supply-Chain Simulation Optimization for Large Scale Logistic Networks","29812470":"Comparative study on the application of evolutionary optimization techniques to orbit transfer maneuvers","4124428":"Self-adaptive evolutionary algorithm based methods for quantification in metabolic systems","220873240":"A New Approach to Improving Multilingual Summarization Using a Genetic Algorithm.","239939963":"Review.Assessing uncertainty and risk in forest planning and decision support systems: Review of classical methods and introduction of innovative approaches","221080084":"Meta-evolution Strategy to Focused Crawling on Semantic Web.","221911556":"Support Vector Machine Classification of Vocal Fold Vibrations Based on Phonovibrogram Features","28356336":"Making Indefinite Kernel Learning Practical","28358385":"Capabilities of EMOA to Detect and Preserve Equivalent Pareto Subsets","220742254":"A computational efficient covariance matrix update and a (1+1)-CMA for evolution strategies","29466247":"A population ecology inspired parent selection strategy for numerical constrained optimization problems","31598244":"Fast Evolutionary Maximum Margin Clustering","225985073":"A Review of Bio-inspired Algorithms for Vehicle Routing","235958618":"Right on the MONEE: Combining Multi-Objective and Open-Ended Evolution","263172350":"Computational Optimization, Methods and Algorithms","240918794":"Controlling Task Distribution in MONEE","242589986":"SELECTION OF OPTIMAL HEAT SINK DIMENSIONS USING EVOLUTIONARY STRATEGIES: A CASE STUDY","200502436":"Evolving Neural Networks for Online Reinforcement Learning","266561723":"Evolutionary optimization for disaster relief operations: A survey","264564893":"Permanent-magnet fields for synchronous machines — I","220867187":"Particle Swarm for the Traveling Salesman Problem","273286931":"Optimising forest stand management in Galicia, north-western Spain","261494988":"Teaching - Learning-based optimization approach for enhancing remanufacturability pre-evaluation system\u0027s reliability","220867190":"Fast EAX Algorithm Considering Population Diversity for Traveling Salesman Problems","220217980":"Towards open decision support systems based on semantic focused crawling","221045326":"Learning Human-Level AI abilities to drive racing cars","280061906":"Randomized Derivative-Free Optimization of Noisy Convex Functions","220867150":"Towards Evolutionary Network Reconstruction Tools for Systems Biology","222550564":"Evolutionary tuning of multiple SVM parameters","280848340":"Evolution Strategies","28358365":"Intelligent group movement and selection in realtime strategy games","271636317":"Forecasting air passengers at São Paulo International Airport using a mixture of local experts model","268222600":"Two Step Evolution Strategy for Device Motif BSIM Model Parameter Extraction","220291670":"Manufacturer-retailer supply chain coordination: A bi-level programming approach","273166143":"Adaptive pair bonds in genetic algorithm: An application to real-parameter optimization","224580122":"Evolutionary Optimization of Dynamics Models in Sequential Monte Carlo Target Tracking","220740178":"Controlling overfitting with multi-objective support vector machines","258555923":"Design of Multi-Stage Manufacturing Networks for Personalized Products Using Metaheuristics","281651122":"Metaheuristics for energy-efficient data routing in vehicular networks","224191010":"A closer look down the basins of attraction","275949324":"A New Look at the Covariance Matrix Estimation in Evolution Strategies","220639911":"Space-Diversity Issues in the Context of a B-ISDN-Oriented Indoor Radio Environment.","222237371":"Evaluating customer aid functions of online stores with agent-based models of customer behavior and evolution strategy","215645023":"Evolutionary Optimization of Growing Neural Gas Parameters for Object Categorization and Recognition","224107228":"Factors analysis on Stock Exchange of Thailand (SET) index movement","220951202":"Parallel Processing for Multi-objective Optimization in Dynamic Environments","261199896":"A (μ, λ) evolutionary and particle swarm hybrid algorithm, with an application to dinosaur gait optimization","220740258":"Towards an understanding of locality in genetic programming","258113769":"On Proving Linear Convergence of Comparison-based Step-size Adaptive Randomized Search on Scaling-Invariant Functions via Stability of Markov Chains","232637011":"Evolution Strategy Based Automated Software Clustering Approach","224645869":"Directed Evolutionary Programming: Towards an Improved Performance of Evolutionary Programming","228344339":"Optimization of forging processes using Finite Element simulations: A comparison of Sequential Approximate Optimization and other algorithms","221368999":"Visual information retrieval using synthesized imagery","247927133":"On the behaviour of the (1, λ)-ES for a simple constrained problem","220867249":"A Memetic Algorithm for the Biobjective Minimum Spanning Tree Problem","220867254":"Effects of Scale-Free and Small-World Topologies on Binary Coded Self-adaptive CEA","228991493":"Similarity Features, and their Role in Concept Alignment Learning","228532794":"Resource management and scalability of the XCSF learning classifier system","268691371":"Particle swarm optimization with dual-level task allocation","224516808":"A Probabilistic Memetic Framework","255537298":"Design Trade Studies, and Risk and Uncertainty in Collaborative Design and Model Based Engineering: Methods, Tools, Research, and Practice","224185078":"Determining the Time Period and Amount of Training Data for Stock Exchange of Thailand Index Prediction","220742276":"Optimal number of evolution strategies mutation step sizes in dynamic environments","256721120":"A note on teaching-learning-based optimization algorithm. Information Sciences, 212, 79-93","267794523":"LOW-DIMENSIONAL CURVATURE METHODS IN DERIVATIVE-FREE OPTIMIZATION ON SHARED COMPUTING NETWORKS","224301805":"Solving multimodal problems via multiobjective techniques with Application to phase equilibrium detection","225444551":"Using Genetic Algorithms for Multi-depot Vehicle Routing","255596683":"Evolutionary Algorithms for the Unit Commitment Problem","220797585":"Learning in a High Dimensional Space: Fast Omnidirectional Quadrupedal Locomotion","224301798":"GPES: An algorithm for evolving hybrid kernel functions of Support Vector Machines","225110739":"Evolution of Competing Strategies in a Threshold Model for Task Allocation","221080211":"Evolutionary Strategies Used for the Mobile Robot Trajectory Tracking Control","228895335":"Monkey algorithm for global numerical optimization","224197272":"Genetic Network Programming with Sarsa Learning Based Nonuniform Mutation","4327303":"Evolutionary identification of a recurrent fuzzy neural network with enhanced memory capabilities","220437226":"Effective and Diverse Adaptive Game AI","221008608":"Orbit Transfer Manoeuvres as a Test Benchmark for Comparison Metrics of Evolutionary Algorithms","257398919":"Fuzzy logic control and soft sensing applications in food and beverage processes","220633847":"Sub-daily Staff Scheduling for a Logistics Service Provider","4249492":"Greedy Scheduling with Complex Obejectives","257917066":"A GENETIC ALGORITHM FOR CONSTRAINT OPTIMIZATION PROBLEMS WITH HYBRID HANDLING OF PENALTY SCHEME","279400305":"Learning the Structure of Continuous Markov Decision Processes","28110451":"Driving-Bots with a Neuroevolved Brain: Screaming Racers","227082838":"Derivative-Free Optimization","220934857":"A Comparative Study of CMA-ES on Large Scale Global Optimisation","228446837":"A Stochastic Optimization Approach for Unsupervised Kernel Regression","6913923":"A decompositional approach to parameter estimation in pathway modeling: A case study of the Akt and MAPK pathways and their crosstalk","220867271":"Integrated Generation of Working Time Models and Staff Schedules in Workforce Management","220551882":"Use of gene dependent mutation probability in evolutionary neural networks for non-stationary problems","221457089":"Heterogeneous Populations of Learning Agents in the Minority Game.","265809956":"Computational intelligence. Revised and selected papers of the 3rd international joint conference, IJCCI 2011, Paris, France, October 24–26, 2011","262367312":"Evolutionary algorithm based control policies for flexible optimal power flow over time","224645781":"Evolution of Human-Competitive Agents in Modern Computer Games","241310100":"Stochastic image reconstruction in bioluminescence tomography with the equation of radiative transfer","6883217":"Optimum Tracking with Evolution Strategies","45229384":"Active Covariance Matrix Adaptation for the (1+1)-CMA-ES","221049554":"Towards the Automated Design of Phased Array Ultrasonic Transducers – Using Particle Swarms to Find “Smart” Start Points","287231713":"Estimation of parameters for a hysteresis model using evolution strategy"},"index":712}