{"abs":"The Pareto Archived Evolution Strategy (PAES) [KC99c, KC99b], a local search algorithm for multiobjective optimization tasks, is compared with a modern, proven population-based EA, the Strength Pareto Evolutionary Algorithm (SPEA) of Zitzler and Thiele [ZT98, ZDT99, ZT99]. Comparison is carried out with respect to six test functions designed by Deb, each of which is designed to capture and isolate a specific problem feature that may present difficulties to multiobjective optimizers. Statistical techniques introduced previously, and derived from those of Fonseca and Fleming [FF96], are used to process the results to form confidence measures relating to the percentage of the non-dominated front which is covered by each algorithm. These results indicate that, with no attempt at tuning PAES to any of the problems, it outperforms SPEA conclusively on four of the test functions. Some investigation of the mutation rates used by PAES is then carried out. This shows that using a higher mutation...","title":"Local Search, Multiobjective Optimization and the Pareto Archived Evolution Strategy","id":2462623,"url":"https://www.researchgate.net/publication/2462623_Local_Search_Multiobjective_Optimization_and_the_Pareto_Archived_Evolution_Strategy","names":["Joshua Damian Knowles","David Corne"],"references":{"239059359":"Finding Acceptable Solutions in the Pareto-Optimal Range using Multiobjective Genetic Algorithms","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","2270411":"Assessing the Performance of the Pareto Archived Evolution Strategy","2610542":"A Free Lunch Proof for Gray versus Binary Encodings","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","2516586":"An Updated Survey of Evolutionary Multiobjective Optimization Techniques :","2642725":"Evaluating the Quality of Approximations to the Non-Dominated Set","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","3755949":"On a Multi-Objective Evolutionary Algorithm and Its Convergence to the Pareto Set","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107","220702040":"On the Performance Assessment and Comparison of Stochastic Multiobjective Optimizers."},"citedIn":{"37413310":"Multi-objective optimisation applied to industrial energy problems","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","238660725":"Multi-objective site selection and analysis for GSM cellular network planning","221008418":"A hybrid Genetic Algorithm for multiobjective structural optimization","2241938":"M-PAES: A Memetic Algorithm for Multiobjective Optimization","220403408":"A Cellular Genetic Algorithm with Disturbances: Optimisation Using Dynamic Spatial Interactions","8997597":"An Adaptive Sharing Elitist Evolution Strategy for Multiobjective Optimization","288838659":"Enhanced Version of Multi-algorithm Genetically Adaptive for Multiobjective optimization","3996394":"Causality assignment using multi-objective evolutionary algorithms","260799549":"A multi-objective optimization approach for the integration and test order problem","257549134":"Multi Agent Collaborative Search based on Tchebycheff decomposition","3904005":"MEA: A metapopulation evolutionary algorithm for multi-objective optimisation problems","242323150":"Se han utilizado las siguientes claves para denotar los tipos de publicaciones en que cada trabajo fue referenciado: LIB ING \u003d Libro en ing´ es, JOUR INT \u003d Journal Internacional, CONG INT \u003d Congreso Internacional, CONG NAC \u003d Congreso Na"},"index":713}