{"abs":"Evolutionary algorithms (EA) have proved to be well suited for optimization problems with multiple objectives. Due to their inherent parallelism they are able to capture a number of solutions concurrently in a single run. In this report, we propose a new evolutionary approach to multicriteria optimization, the Strength Pareto Evolutionary Algorithm (SPEA). It combines various features of previous multiobjective EAs in a unique manner and is characterized as follows: a) besides the population a set of individuals is maintained which contains the Pareto-optimal solutions generated so far; b) this set is used to evaluate the fitness of an individual according to the Pareto dominance relationship; c) unlike the commonly-used fitness sharing, population diversity is preserved on basis of Pareto dominance rather than distance; d) a clustering method is incorporated to reduce the Pareto set without destroying its characteristics. The proof-of-principle results on two problems suggest that SPE...","title":"An Evolutionary Algorithm for Multiobjective Optimization: The Strength Pareto Approach","id":2584888,"url":"https://www.researchgate.net/publication/2584888_An_Evolutionary_Algorithm_for_Multiobjective_Optimization_The_Strength_Pareto_Approach","names":["Eckart Zitzler","Lothar Thiele"],"references":{"220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","2754984":"Finding Multimodal Solutions Using Restricted Tournament Selection","2827305":"Finding Multiple Solutions in Problems of Bounded Difficulty","220201252":"System-Level Synthesis Using Evolutionary Algorithms","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","2674926":"Multi-Sexual Genetic Algorithm for Multiobjective Optimization.","2243429":"A Non-generational Genetic Algorithm for Multiobjective Optimization","3642940":"An interactive fuzzy satisficing method for multiobjective multidimensional 0-1 knapsack problems through genetic algorithms","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","2299624":"Population Diversity in an Immune System Model: Implications for Genetic Search","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","34058890":"Theory of evolutionary algorithms and application to system synthesis /","2600791":"Using Genetic Algorithms to Explore Pattern Recognition in the Immune System","220471028":"Reducing the size of the nondominated set: Pruning by clustering.","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","242356870":"Adaptation In Natural And Artificial Systems","220885661":"A Multiple Criteria Genetic Algorithm for Containership Loading.","216300639":"Compaction of Symbolic Layout using Genetic Algorithms","2690834":"Niching Methods for Genetic Algorithms","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","242372494":"Genetic algorithm in search","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107"},"citedIn":{"221230381":"Avoiding simplification strategies by introducing multi-objectiveness in real world problems.","242763898":"Equipo de Algoritmos Evolutivos Multiobjetivo Paralelos","3418674":"Evolutionary algorithms with dynamic population size and local exploration for multiobjective optimization","220470562":"GISMOO: A new hybrid genetic/immune strategy for multiple-objective optimization","224573803":"Compositional Model-Driven Design of Embedded Code for Energy-Efficient Buildings","274379347":"A Specific Heuristic Dedicated to a Coverage/Tracking Bi-objective Problem for Wireless Sensor Deployment","261280153":"Solving the Location Areas problem with Strength Pareto Evolutionary Algorithm","273078349":"Multi-Objective Heuristic Computation Applied To Architectural And Structural Design: A Review","2241068":"Evolutionary Algorithm Based Exploration of Software Schedules for Digital Signal Processors","220740903":"An efficient approach to unbounded bi-objective archives -","285888261":"An NSGA-II approach with local search for a VAR planning multi-Objective Problem","232381910":"Optimal design of four-bar mechanisms using a hybrid multi-objective GA with adaptive local search","288827687":"Multiobjective evolutionary algorithm based on multimethod with dynamic resources allocation","228357512":"Regular paper New Approach to Solve Multi-objective Environmental/Economic Dispatch","242749550":"Equipo Probabilístico de Algoritmos Evolutivos Multiobjetivo en Computación Paralela","225780067":"Cell formation in the presence of reconfigurable machines","224677747":"An Improved Elitist Strategy Multi-Objective Evolutionary Algorithm","251618024":"Multiobjective evolutionary finance-based scheduling: Individual projects within a portfolio","261349769":"Genetic algorithm-based optimization in 4th order Sallen Key high pass filter","287649086":"Solving robot path planning problem by using a new elitist multi-objective IWD algorithm based on coefficient of variation","4201566":"The harmonic decision matrix: A subtle model of the natural neuron","5297268":"Improving Locality in Binary Representation via Redundancy","270650373":"Prediction of protein subcellular localization by incorporating multiobjective PSO-based feature subset selection into the general form of Chou’s PseAAC","242745949":"UNIVERSIDAD NACIONAL DE ASUNCIÓN","255704859":"Optimization of Power System Operation","255591191":"Studies on Fast Pareto Genetic Algorithm Based on Fast Fitness Identification and External Population Updating Scheme","220739843":"Two-level of nondominated solutions approach to multiobjective particle swarm optimization","272416786":"Bi-objective integrating sustainable order allocation and sustainable supply chain network strategic design with stochastic demand using a novel robust hybrid multi-objective metaheuristic","2534934":"Hybrid Multi-Objective Evolutionary Computation of Constrained Downside Risk-Return Efficient Sets for Credit Portfolios","51588387":"Evolutionary and Principled Search Strategies for Sensornet Protocol Optimization","249430767":"Non-dominated Rank based Sorting Genetic Algorithms","265640935":"Multiobjective Cell Formation with Routing Flexibility: A Graph Partitioning Approach","249071852":"Multicriteria Optimal Control of Polypropylene Terepthalate Polymerization Reactor","2369041":"A Short Tutorial on Evolutionary Multiobjective Optimization","4075017":"Multi-objective genetic algorithms for courses of action planning","254230302":"Autonomous robot navigation based on the evolutionary multi-objective optimization of potential fields","276177487":"A Simple Pareto Adaptive ε-Domination Differential Evolution Algorithm for Multi-Objective Optimization","224311650":"Multiobjective particle swarm for environmental/economic dispatch problem","238951427":"Multi-objective optimization of seismically isolated high-rise building structures using genetic algorithms","220948245":"Parallel Hypervolume-Guided Hyperheuristic for Adapting the Multi-objective Evolutionary Island Model","224301852":"Multiobjective algorithms to optimize broadcasting parameters in mobile Ad-hoc networks","250358952":"Time-Jerk Synthetic Optimal Trajectory Planning of Robot Using Strength Pareto Evolutionary Algorithm","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","242259513":"Un Algoritmo Basado en Evolución Diferencial para Resolver Problemas Multiobjetivo","2249323":"Evolutionary Algorithms for Multi-Criterion Optimization in Engineering Design","4201485":"Complementary selection and variation for an efficient multiobjective optimization of complex systems","48907428":"Proposition de compromis pour le calcul de solutions préférées à l\u0027aide d\u0027un algorithme évolutionnaire multiobjectif en optimisation multidisciplinaire","220121424":"A Multi-Objective Production Inventory Model with Backorder for Fuzzy Random Demand Under Flexibility and Reliability","265789336":"Methods for Multi-Objective Optimization: An Analysis","225175354":"Multi-objective Optimization Evolutionary Algorithms Applied to Paroxysmal Atrial Fibrillation Diagnosis Based on the k-Nearest Neighbours Classifier","268337580":"Combination of optimization and robustness evaluation from practical point of view","228953078":"USING ROBUSTNESS AND SENSITIVITY EVALUATION FOR SETTING UP A RELIABLE BASEMENT FOR ROBUST DESIGN OPTIMIZATION","221392742":"PSFGA: A Parallel Genetic Algorithm for Multiobjective Optimization.","235080279":"Optimization of Heterogeneous UAV Communications Using the Multiobjective Quadratic Assignment Problem","227358169":"Clustering multivariate time series by genetic multiobjective optimization","271533179":"Optimal Bi-Objective Redundancy Allocation for Systems Reliability and Risk Management","228811765":"A novel multi-objective evolutionary algorithm for solving environment/economic dispatch problem","223638787":"Modelling and Pareto optimization of heat transfer and flow coefficients in microchannels using GMDH type neural networks and genetic algorithms","262301685":"Identifying Non-Redundant Gene Markers from Microarray Data: A Multiobjective Variable Length PSO-Based Approach","233178046":"High resolution material ablation and deposition with femtosecond lasers and applications to photomask repair. J. Mod. Optic. 51, 2781-2796","228625913":"Strength By Objective: Una nueva estrategia de asignación de fitness para Algoritmos Evolutivos Multi-Objetivos.","222800668":"Optimal VAR dispatch using a multiobjective evolutionary algorithm","271944297":"Multi-Objective Optimization of a Micromixer with Convergent-Divergent Sinusoidal Walls","4156001":"Scored Pareto-MEC for multi-objective optimization","236678213":"GeDEA-II: A simplex crossover based evolutionary algorithm including the genetic diversity as objective","239543845":"Decomposition-Based Assembly Synthesis for Structural Stiffness","252016999":"Studying the SPEA2 algorithm for optimising a pattern-recognition based machine translation system","48354434":"Multi-objective offshore safety system design optimization","238789215":"\"Equipo de Algoritmos Evolutivos Multiobjetivo Paralelos\" (Team Algorithm of pMOEAs)","222308644":"Multiobjective particle swarm optimization for environmental economic dispatch problem. Electr Pow Syst Res 79:1105?1113","283568258":"Multilevel and Color Image Segmentation by NSGA II Based OptiMUSIG Activation Function","234028951":"Clustering gene expression signals from retinal microarray data","227702263":"Evolutionary multiobjective optimization","262227396":"A comparative study of variation operators used for evolutionary multi-objective optimization","233246593":"Multi-objective optimization of abrasive flow machining processes using polynomial neural networks and genetic algorithms","235734122":"Time-stamped resampling for robust evolutionary portfolio optimization","221392730":"A Parallel Skeleton for the Strength Pareto Evolutionary Algorithm 2","257489205":"A Pareto-based hybrid multiobjective evolutionary approach for constrained multipath traffic engineering optimization in MPLS/GMPLS networks","235710050":"Multiobjective Genetic Programming for Maximizing ROC Performance","224579856":"Multiobjective Genetic Algorithm-Based Fuzzy Clustering of Categorical Attributes","233617311":"Influence of age on masonry bond strength and mortar microstructure","227252216":"A Review of Agent-Based Co-Evolutionary Algorithms for Multi-Objective Optimization","277295345":"Evolutionary Algorithms: Overview, Methods and Operators.” Documentation for: Genetic Evolutionary Algorithm Toolbox for Use with Matlab version: toolbox 1.92 documentation 1.92","258021657":"A Hardware-based Multi-Disciplinary Design Optimization Method for Aeronautical Applications","250693262":"Multi-modal topological optimization of structure using immune algorithm","277297670":"HIERARCHICAL SYNTHESIS OF EMBEDDED SYSTEMS USING EVOLUTIONARY ALGORITHMS -- A Multi-Objective Approach","221324210":"A Multi-Objective Particle Swarm Optimization for Web Service Composition","261077772":"CMA-PAES: Pareto archived evolution strategy using covariance matrix adaptation for Multi-Objective Optimisation","2530466":"A New Evolutionary Adaptive Representation Paradigm","32224109":"Optimisation de transport à la demande dans des territoires polarisés","282540113":"Parameter Estimation for Coupled Hydromechanical Simulation of Dynamic Compaction Based on Pareto Multiobjective Optimization","268889743":"Multiple Objective Combinatorial Optimization — A Tutorial","261348634":"Multiobjective particle swarm optimization based ontology alignment","4076212":"A novel multiobjective evolutionary algorithm for optimal reactive power dispatch problem","221006759":"Flock-based Evolutionary Multi-Agent System in Solving Noisy Multi-Objective Optimization Problems","274138332":"Hybrid ACO Algorithms for Multi-Objective Knapsack Problem","262315310":"A case study to demonstrate a Pareto Frontier for selecting a best response surface design while simultaneously optimizing multiple criteria","220132753":"Multiobjective particle swarm optimization with nondominated local and global sets","268163956":"A novel preference articulation operator for the Evolutionary Multi-Objective Optimisation of classifiers in concealed weapons detection","235694748":"Evolutionary Multi-Objective Optimization in Water Distribution Network Design","222815190":"Development of a soft computing-based framework for engineering design optimisation with quantitative and qualitative search spaces","221392803":"Parallel Library of Multi-objective Evolutionary Algorithms","220654519":"Domain-independent feature extraction for multi-classification using multi-objective genetic programming","266045769":"Kombination von Optimierung und Robustheitsbewertung aus praktischer Sicht","224574454":"A Study of the Multi-Objective Evolutionary Algorithm Based on Elitist Strategy","245310473":"Inverse modelling of multi-objective thermodynamically optimized turbojet engines using GMDH-type neural networks and evolutionary algorithms","263863084":"Adaptive Memetic Computing for Evolutionary Multiobjective Optimization","239730909":"FACTS location and size for reactive power system compensation through the multi-objective optimization","227552520":"Pareto Multiobjective Optimization","224441337":"Parallel Protein Structure Prediction by Multiobjective Optimization","2365630":"A Hybrid Multi-Objective Evolutionary Approach to Engineering Shape Design","257810375":"A Multistage Value-Based Model for Prioritization of Distribution Projects Using a Multiobjective Genetic Algorithm","215757889":"Multi-Objective Scheduling of BPEL Workflows in Geographically Distributed Clouds","235694737":"Evolutionary multi-objective optimization of the design and operation of water distribution network: Total cost vs. reliability vs. water quality","221230512":"GA-Based Solutions Comparison for Storage Strategies Optimization for an Automated Warehouse","261267250":"Simultaneous optimization of performance, energy and temperature for DAG scheduling in multi-core processors","221047693":"A Domain-Independent Approach to Discourse-Level Knowledge Discovery from Texts","221184908":"Agent-Based Co-Operative Co-Evolutionary Algorithm for Multi-Objective Optimization.","220754316":"An Spanning Tree Based Method For Pruning Non-Dominated Solutions in Multi-Objective Optimization Problems.","224118783":"Multi-objective Pareto Genetic Algorithms Using Fast Elite Updating","3418769":"A semantically guided and domain-independent evolutionary model for knowledge discovery from texts","261500723":"A hybrid adaptive evolutionary algorithm in the domination-based and decomposition-based frameworks of multi-objective optimization","223296488":"Generation Dispatch under Large Penetration of Wind Power Considering Emission and Economy","227413286":"Multi-objective optimization of internal combustion engine by means of 1D fluid-dynamic models","220637580":"Evolving Dynamic Multi-Objective Optimization Problems with Objective Replacement","223748092":"A multiobjective approach to MR brain image segmentation","281344111":"Color Magnetic Resonance Brain Image Segmentation by ParaOptiMUSIG Activation Function: An Application","234052447":"A comparison of Multiobjective Evolutionary Algorithms","4090000":"Optimisation of the high efficiency deep grinding process with fuzzy fitness function and constraints","285260718":"Optimization of Power System Operation, Second Edition","225191875":"Hierarchical Approach to Evolutionary Multi-Objective Optimization","27530005":"A Possibilistic Approach to Rotorcraft Design through a Multi-Objective Evolutionary Algorithm","48667220":"HVAC system modeling and optimization: A data-mining approach","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","235209395":"Optimization of a Quantum Cascade Laser Operating in the Terahertz Frequency Range Using a Multiobjective Evolutionary Algorithm","228943635":"Decomposition-Based Assembly Synthesis of a 3D Body-in-White Model for Structural Stiffness","226755891":"An Adaptive Penalty Function for Handling Constraint in Multi-objective Evolutionary Optimization","220743056":"Parallel hyperheuristic: a self-adaptive island-based model for multi-objective optimization","223608299":"Modelling and multi-objective optimization of a variable valve-timing spark-ignition engine using polynomial neural networks and evolutionary algorithms","242137815":"HANDLING INTEGRATED QUANTITATIVE AND QUALITATIVE SEARCH SPACE IN ENGINEERING DESIGN OPTIMISATION PROBLEMS","3418766":"Reducing the Run-Time Complexity of Multiobjective EAs: The NSGA-II and Other Algorithms","220199333":"Synergetic use of different evaluation, parameterization and search tools within a multilevel optimization platform","268435267":"Uma Abordagem Evolutiva Multi-Objectivo para o Problema de Compensação de Energia Reactiva em Redes de Distribuição de Energia Eléctrica","224377314":"Improving multi-objective clustering through support vector machine: Application to gene expression data","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","228378401":"Multiobjective motion planning for a nonholonomic vehicle","221246354":"Optimizing the Broadcast in MANETs Using a Team of Evolutionary Algorithms","282496619":"Pareto optimal design of reconfigurable rice seedling transplanting mechanisms using multi-objective genetic algorithm","220160417":"Metco: a Parallel Plugin-Based Framework for Multi-Objective Optimization.","221339121":"An efficient methodology for hierarchical synthesis of mixed-signal systems with fully integrated building block topology selection.","3454198":"Combining information extraction with genetic algorithms for text mining","265988894":"The Harmonic Decision Matrix: a group of operators for the fuzzy-logic, multi-objective decisions and optimizations","254024672":"A multiobjective PSO-based approach for identifying non-redundant gene markers from microarray gene expression data","28127592":"Multiobjective evolutionary algorithms: Pareto rankings","269297354":"Runtime optimization of hybrid energy source from an UPS back-upping critical consumer","220698094":"Adaptive Pareto Differential Evolution and Its Parallelization","221605883":"Stochastic Model Predictive Controller for the Integration of Building Use and Temperature Regulation.","225508768":"Cooperation and competition in multidisciplinary optimization","224561585":"Interleaved Ultrawideband Antenna Arrays Based on Optimized Polyfractal Tree Structures","263638368":"Study on Diversity of Population in Game model based Co-evolutionary Algorithm for Multiobjective optimization","3019512":"The Pareto Optimization of Ultra-Wideband Polyfractal Arrays","261412163":"Optimization of fully-integrated power converter circuits comprising tapered inductor layout and temperature effects","239560346":"Optimal VAR Dispatch Using Strength Pareto Evolutionary Algorithm","223532940":"Product platform two-stage quality optimization design based on multiobjective genetic algorithm","221148623":"Routing Path Determination Using QoS Metrics and Priority Based Evolutionary Optimization","269785846":"Representing Sampled Pareto Frontiers as Parameterized Continuous Manifolds Using Self-Organizing Maps","266635014":"Handling Geological Uncertainty in Oil Field Development with Multi-objective Optimization Technique","291190207":"Evolving Explanatory Novel Patterns for Semantically-Based Text Mining","238778077":"Population Variation in Canonical Tree based Genetic Programming","2268869":"An Updated Survey of Evolutionary Multiobjective Optimization Techniques: State of the Art and Future Trends","237665475":"OPTIMIZATION USING AN EVOLUTIONARY HYPERPLANE GUIDED APPROACH","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","225126784":"Automatic Selection of Pareto-Optimal Topologies of Hidden Markov Models Using Multicriteria Evolutionary Algorithms","32220935":"Approche computationnelle de l\u0027orchestration musciale - Optimisation multicritère sous contraintes de combinaisons instrumentales dans de grandes banques de sons","228569970":"Thermodynamic Pareto optimization of turbojet engines using multi-objective genetic algorithms","232636720":"Adaptive Niche Multi-Objective Particle Swarm Optimization Algorithm","279212617":"Multi-objective optimization of material model parameters of an adhesive layer by using SPEA2","220142065":"On auto-calibration algorithms for a forest growth simulation model","260280173":"Revisiting evolutionary algorithms in feature selection and nonfuzzy/fuzzy rule based classification","281072175":"Multiobjective Design Optimization using Nash Games","268044053":"Optimised Embedded Distributed Controller for Automated Lighting Systems","278633076":"Design of new metaheuristics for image segmentation. Application on biomedical imaging","223227839":"Wind energy dispatch considering environmental and economic factors","24065436":"Approximate solution methods for multiobjective combinatorial optimization","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","224178088":"Nature-Inspired Design Techniques for Ultra-Wideband Aperiodic Antenna Arrays","271661252":"Empirical and analytical study of many-objective optimization problems: Analysing distribution of nondominated solutions and population size for scalability of randomized heuristics","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","2369759":"Controlled Elitist Non-dominated Sorting Genetic Algorithms for Better Convergence","263076181":"Efficient optimization of fully-integrated inductive DC–DC converters comprising tapered inductor layout synthesis and temperature effects","221228499":"A Statistical Comparison of Multiobjective Evolutionary Algorithms Including the MOMGA-II","220265511":"Improving NSGA-II Algorithm Based on Minimum Spanning Tree","228794539":"A Novel Diversity Guided Particle Swarm Multi-objective Optimization Algorithm","222415944":"Combining deliberative and computer-based methods for multi-objective land-use planning","255591478":"An Evolutionary Approach to Discourse-level Knowledge Discovery from Texts","263734962":"Zhang Q. and Mahfouf M.: ‘A nature-inspired multi-objective optimisation strategy based on a new reduced space searching algorithm for the design of alloy steels’, Eng. Appl. Artif. Intell.","254017582":"Multi-objective particle swarm optimization for optimal power flow in a deregulated environment of power systems","279716775":"Implementation of meta-heuristic algorithms for supplier selection and evaluation and multi product order allocation","280385466":"Evolutionary Optimization","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","235411224":"A multi-objective genetic algorithm for the Protein Structure Prediction","224301646":"Multiobjective approach to categorical data clustering","3204896":"Multiobjective Genetic Clustering for Pixel Classification in Remote Sensing Imagery","3949353":"Multiobjective optimization using a Pareto differential evolution approach","267801824":"Application of MOPSO for economic load dispatch solution with transmission losses","221185075":"Rule Extraction from Neural Network by Genetic Algorithm with Pareto Optimization","222828117":"A hybrid promoter analysis methodology for prokaryotic genomes","257635963":"A decomposition-based hybrid multiobjective evolutionary algorithm with dynamic resource allocation","254379016":"METAMODEL-ASSISTED MULTI-OBJECTIVE EVOLUTIONARY OPTIMIZATION","244289453":"Genetic Tabu Search for the Multi-objective Knapsack Problem","269654320":"Pareto optimization of a two-degree of freedom passive linear suspension using a new multiobjective genetic algorithm","220132924":"Improving convergence of evolutionary multi-objective optimization with local search: A concurrent-hybrid algorithm","225037898":"Optimisation of a Multi-Objective Two-Dimensional Strip Packing Problem based on Evolutionary Algorithms","220265480":"Multi-Objective Optimization of Particle Reinforced Silicone Rubber Mould Material for Soft Tooling Process","221656602":"3D exploration of software schedules for DSP algorithms.","4055827":"Environmental/economic power dispatch using multiobjective evolutionary algorithms: A comparative study","225110084":"Agent-Based Co-Operative Co-Evolutionary Algorithm for Multi-Objective Optimization","223012964":"Multi-objective evolutionary optimization of polynomial neural networks for modelling and prediction of explosive cutting process","3418884":"Abido, M.A.: Multiobjective evolutionary algorithms for electric power dispatch problem. IEEE Trans. Evol. Comput. 10(3), 315-329","46299122":"GESOS: A Multi-Objective Genetic Tool for Project Management Considering Technical and Non-Technical Constraints","220765208":"Differential Analysis on Deep Web Data Sources.","47435746":"Application of computational intelligence in modeling and optimization of HVAC systems","288838659":"Enhanced Version of Multi-algorithm Genetically Adaptive for Multiobjective optimization","4375924":"Combining Multiobjective Fuzzy Clustering and Probabilistic ANN Classifier for Unsupervised Pattern Classification: Application to Satellite Image Segmentation","245416855":"Applications of the Non-Dominated Sorting Genetic Algorithm (NSGA) in Chemical Reaction Engineering","229142175":"A Novel Multiobjective Directed Bee Colony Optimization Algorithm for Multiobjective Emission Constrained Economic Power Dispatch","272408331":"Generic Constraints Handling Techniques in Constrained Multi-criteria Optimization and its Application","277055931":"Contribution à l\u0027optimisation complexe par des techniques de Swarm Intelligence","2948885":"Coalition Calculation in a Dynamic Agent Environment","228943006":"AN APPROACH TO FORMAL VERIFICATION OF RULE-BASED MODEL TRANSFORMATION","222827635":"A new multiobjective evolutionary algorithm","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","220080165":"A model for the dynamic coordination of multiple competing goals","227060917":"Multiobjective evolutionary approach to cost-effective traffic grooming in unidirectional SONET/WDM rings","259716167":"A Casting Yield Optimization Case Study: Forging Ram","4074752":"Bounded archiving using the Lebesgue measure","4289919":"Multi-Objective Evolutionary Approaches for Reactive Power Planning in Electrical Networks - an Overview","228771556":"Parameter Prediction in Dynamic Analysis using Response Surface Method and Multi-Objective Genetic Algorithms","245139930":"Optimization of system parameters for gas-generator engines","221006442":"Efficient Constrained Evolutionary Multi-Agent System for Multi-objective Optimization","221007467":"Analysis of Microarray Data using Multiobjective Variable String Length Genetic Fuzzy Clustering","226589894":"Multiobjective Particle Swarm Optimization for Optimal Power Flow Problem","226069553":"Solving a multi-objective no-wait flow shop scheduling problem with an immune algorithm","252045388":"Reactive power handling by a multi-objective formulation","232648336":"An Efficient Methodology for Hierarchical Synthesis of Mixed-Signal Systems with Fully Integrated Building Block Topology Selection","228871914":"Record Linkage as a Multiobjective Optimization Problem solved by Evolutionary Computation","223338015":"Pareto optimal synthesis of four-bar mechanisms for path generation","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","263857387":"Efficient Multi-objective Optimization Method for the Mixed-model-line Assembly Line Design Problem","245326285":"A multi-objective design optimization strategy as applied to pre-mixed pre-vaporized injection systems for low emission combustors","256841243":"Cooperation and Competition Strategies in Multi-objective Shape Optimization-Application to Low-boom/Low-drag Supersonic Business Jet","223573510":"Pareto optimization of a five-degree of freedom vehicle vibration model using a multi-objective uniform-diversity genetic algorithm (MUGA)","264419476":"Verteilungsplanung für Komponenten in Smart Item Umgebungen","220740735":"A Cumulative Evidential Stopping Criterion for Multiobjective Optimization Evolutionary Algorithms ABSTRACT","259716130":"State-of-the-Art Multi-Objective Optimisation of Manufacturing Processes Based on Thermo-Mechanical Simulations","289148518":"Comparison of Three Multi-objective Optimization Algorithms for Hydrological Model","273111325":"The bi-objective Pollution-Routing Problem","242347820":"A multi-objective analysis of a special switched reluctance","273081112":"Partial Rank Aggregation using Multiobjective Genetic Algorithm: Application in Ranking Genes","47843204":"Multiplicative Approximations and the Hypervolume Indicator","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","241632568":"Multi-objective particle swarm optimization for transient secure congestion management","271517552":"Parallel Genetic Algorithm Model to Extract Association Rules","261300979":"Intelligent Algorithms for Solving Multiobjective Optimization Problems","251812971":"A MODIFIED PAES ALGORITHM USING ADAPTIVE REPRESENTATION OF SOLUTIONS","271711064":"Optimizing the mobility management task in networks of four world capital cities","221007936":"Multiobjective Fuzzy Biclustering in Microarray Data: Method and a New Performance Measure","256970301":"The active–reactive – Complete dispatch of an electrical network","282532263":"Constrained Reactive Power Control (CRPC) Based Multi-Objective Optimization under Multi-Contingencies ( N-m )","220741721":"Discussion of parallel model of multi-objective genetic algorithms on heterogeneous computational resources","228854999":"Generalized analysis of promoters (GAP): A method for dna sequence description","225954820":"A Study on Distribution Preservation Mechanism in Evolutionary Multi-Objective Optimization","220289106":"The application and effectiveness of a multi-objective metaheuristic algorithm for partial classification","226148878":"Multi-Objective Evolutionary Algorithms for Engineering Shape Design","259784205":"Combination of optimization and robustness evalutation from practical point of view","220714577":"Designing integrated guidance law for aerodynamic missiles by multi-objectives evolutionary algorithm and Tabu search","226202636":"Mutiobjective Programming","221276231":"EARL: an Evolutionary Algorithm for Record Linkage.","230600900":"NSGA-II with local search for a multi-objective reactive power compensation problem","4152129":"A pareto based multi-objective genetic algorithm for scheduling of FMS","241149916":"A New Structure for Particle Swarm Optimization (nPSO) Applicable to Single Objective and Multiobjective Problems","261419543":"A multi-objective genetic algorithm for the Protein Structure Prediction","224747233":"TEAM Workshop Problem 25: A Multiobjective Analysis","221506742":"A Population Adaptive Based Immune Algorithm for Solving Multi-objective Optimization Problems","260525570":"A Parallel Version of the Self-Adaptive Low-High Evaluation Evolutionary-Algorithm for Electromagnetic Device Optimization","221787326":"Design of an Efficient Genetic Algorithm to Solve the Industrial Car Sequencing Problem","220048534":"Evolutionary Computation in Combinatorial Optimization","46589271":"Modelos de recuperación de la información basados en información lingüística difusa y algoritmos evolutivos. Mejorando la representación de las necesidades de información","257680585":"Evolutionary Optimization: Pitfalls and Booby Traps","281864031":"A hybrid one-class rule learning approach based on swarm intelligence for software fault prediction","221007544":"Unsupervised Cancer Classification through SVM-boosted Multiobjective Fuzzy Clustering with Majority Voting Ensemble","222675679":"Gene discovery using Pareto depth sampling distributions","237764016":"Pareto Analysis for Gene Filtering in Microarray Experiments","227003420":"Multiobjective Combinatorial Optimization — Theory, Methodology, and Applications","279060281":"Multiobjective Differential Evolution based Fuzzy Clustering for MR Brain Image Segmentation","3810214":"“An updated survey of evolutionary multiobjective optimization techniques: State of the art and future trends,” in: Congress on evolutionary computation","3419050":"A Simulated Annealing-Based Multiobjective Optimization Algorithm: AMOSA","221008562":"Solving Constrained Multi-Criteria Optimization Tasks Using Elitist Evolutionary Multi-Agent System","266325631":"Evolutionary Multi-objective Image Feature Extraction in the Presence of Noise","228385854":"NSGA-II with Local Search for a Multi-Objective VAR Planning Problem","224716486":"Clustering using Multi-objective Genetic Algorithm and its Application to Image Segmentation","220403335":"Pareto memetic algorithm for multiple objective optimization with an industrial application","243788064":"Hierarchical Synthesis of Embedded Systems Using Evolutionary Algorithms","270684559":"A multi-principle module identification method for product platform design","49631579":"Multi-Class Clustering of Cancer Subtypes through SVM Based Ensemble of Pareto-Optimal Solutions for Gene Marker Identification","2241938":"M-PAES: A Memetic Algorithm for Multiobjective Optimization","27313682":"The Trade Off Between Diversity and Quality for Multi-objective Workforce Scheduling","271918982":"Solving the location areas management problem with multi-objective evolutionary strategies","43307299":"Estudios sobre sistemas adaptativos con aplicaciones en la robótica autónoma y los agentes inteligentes","257619174":"An efficient multi-objective optimization approach based on the micro genetic algorithm and its application","221582473":"Multiobjective Evolutionary Algorithms: Applications in Real Problems.","237090207":"Protein Structure Prediction based on Evolutionary Methods","220045474":"Towards Automatic Controller Design using Multi-Objective Evolutionary Algorithms","223234289":"Multi-objective optimal design of truss structure with immune algorithm","220063452":"An evolutionary strategy for decremental multiobjective optimization problems","220943082":"Semantically-Driven Explanatory Text Mining: Beyond Keywords.","289048825":"Multi-objective Optimization Immune Algorithm Using Clustering","279060326":"Multiobjective Differential Evolution: A Comparative Study on Benchmark Problems","228688996":"Two Heuristic Operations to Improve the Diversity of Two-objective Pareto Solutions","226044085":"Multiobjective Evolutionary Algorithms for Electric Power Dispatch Problem","221252860":"Portfolio Optimization Using SPEA2 with Resampling","222432911":"Evolutionary algorithms in multiply-specified engineering. The MOEAs and WCES strategies","237783011":"CLUSTERING GENE EXPRESSION SIGNALS FROM RETINAL MICROARRAY DATA G. Fleuryƒ;, A. Heroy, S. Yoshidaz, T. Carter#, C. Barlow# and A. Swaroopz","277054796":"Optimisation multi-objective des problèmes combinatoires : application à la génération des horaires d\u0027examens finaux","245061451":"Designing integrated guidance law for aerodynamic missiles by hybrid multi-objective evolutionary algorithm and tabu search","228393036":"A generic optimal feature extraction method using multiobjective genetic programming","224222862":"Pareto Optimization of Thinned Planar Arrays With Elliptical Mainbeams and Low Sidelobe Levels","220689651":"Multiobjective Genetic Algorithms for Clustering - Applications in Data Mining and Bioinformatics.","220283636":"A survey and taxonomy of performance improvement of canonical genetic programming","242749870":"Equipo Elitista de Algoritmos Evolutivos Multiobjetivo","228887666":"An empirical study of tabu search for the MOKP","249354507":"Single and Multi-objective Optimization of Composite Structures: The Influence of Design Variables","226320548":"Tabu-Based Exploratory Evolutionary Algorithm for Effective Multi-objective Optimization","225836716":"A Hypervolume-Based Optimizer for High-Dimensional Objective Spaces","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","280237929":"Development of Pareto-based evolutionary model integrated withdynamic goal programming and successive linear objective reduction","266454588":"Optimierung und Robustheitsbwertung in der virtuellen Produktentwicklung","222824085":"Evolutionary computation and structural design: A survey of the state-of-the-art","223490703":"Pareto optimality-based multi-objective transmission planning considering transmission congestion","221611242":"A Parallel Plugin-Based Framework for Multi-objective Optimization","237090240":"An Efficient Decision Rule-based System for the Protein Residue-residue Contact Prediction","222830249":"A generic optimising feature extraction method using multiobjective genetic programming","220629188":"Combining Information Extraction with Genetic Algorithms for Text Mining.","4225444":"Pareto Multi Objective Optimization","2406849":"CoFrame: A Modular Co-Design Framework for Heterogeneous Distributed Systems","4133850":"Optimization of individual well adaptive body biasing (IWABB) using a multiple objective evolutionary algorithm","4074969":"Multiobective motion planning for a nonholonic vehicle","227657846":"Application of Multi‐Objective Evolutionary Optimization Algorithms to Reactive Power Planning Problem","261269626":"Dynamic task graph scheduling on multicore processors for performance, energy, and temperature optimization","282878772":"A Multi-objective Mixed-discrete Particle Swarm Optimization Algorithm with Multi-domain Diversity Preservation","236136954":"Using Different Approaches to Approximate a Pareto Front for a Multiobjective Evolutionary Algorithm: Optimal Thinning Regimes for Eucalyptus fastigata","220781250":"Multiobjective Genetic Clustering with Ensemble Among Pareto Front Solutions: Application to MRI Brain Image Segmentation","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","220856517":"Hierarchical Approach to Evolutionary Multi-Objective Optimization.","222544049":"Response Surface Approximation of Pareto Optimal Front in Multi-objective Optimization","224645776":"Multiobjective Optimal VAR Dispatch Using Strength Pareto Evolutionary Algorithm","4074954":"Hybridization of the multi-objective evolutionary algorithms and the gradient-based algorithms","237233109":"MOMBES Multiobjective Modelbased Evolution Strategy","220727519":"Multiobjective Genetic Fuzzy Clustering of Categorical Attributes","224645780":"Co-Evolutionary Multi-Agent System with Sexual Selection Mechanism for Multi-Objective Optimization","222031555":"Selection and optimization of pin cross-sections for electronics cooling","262315611":"Impact of Different Recombination Methods in a Mutation-Specific MOEA for a Biochemical Application","221787332":"Agent-Based Co-Evolutionary Techniques for Solving Multi-Objective Optimization Problems","221320397":"Search Computing and the Life Sciences.","261851236":"Introduction of a Mutation Specific Fast Non-dominated Sorting GA Evolved for Biochemical Optimizations"},"index":723}