{"abs":"Though it has been claimed that elitism could improve evolutionary multi-objective search significantly, a thorough and extensive evaluation of its effects is still missing. Guidelines on how elitism could successfully be incorporated have not yet been developed. This paper presents a unified model of multi-objective evolutionary algorithms, in which arbitrary variation and selection operators can be combined as building blocks, including archiving and re-insertion strategies. The presented model enables most specific multi-objective (evolutionary) algorithm to be formulated as an instance of it, which will be demonstrated by simple examples. We further show how elitism can be quantified by the model\u0027s parameters and how this allows an easy evaluation of the effect of elitism on different algorithms","title":"Unified model for multi-objective evolutionary algorithms with elitism","id":3865129,"url":"https://www.researchgate.net/publication/3865129_Unified_model_for_multi-objective_evolutionary_algorithms_with_elitism","names":["Marco Laumanns","Eckart Zitzler","Lothar Thiele"],"references":{"2239554":"Evolutionary Search for Minimal Elements in Partially Ordered Finite Sets","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","216300737":"On the convergence of multiobjective evolutionary algorithms","3418513":"Evolutionary Computation: Comments on the History and Current State","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2782915":"A Variant of Evolution Strategies for Vector Optimization","250735898":"C4.5 Multiobjective optimization","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","2439369":"Approximating the Pareto Set: Concepts, Diversity Issues, and Performance Assessment","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","225783245":"Selective breeding in a multiobjective genetic algorithm","221032054":"Multi-Objective Genetic Local Search Algorithm.","2842064":"Non-linear Goal Programming Using Multi-Objective Genetic Algorithms","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","220701882":"Niching and elitist models for MOGAs","243666680":"F1.9 Multicriterion decision making"},"citedIn":{"260622218":"A Possibilistic Mean-Downside Risk-Skewness Model for Efficient Portfolio Selection","223536982":"A portfolio optimization model with three objectives and discrete variables. Comp. Oper. Res. 37, 1285-1297","220805164":"Handling Uncertainties in Evolutionary Multi-Objective Optimization","220312871":"Ectropy of diversity measures for populations in Euclidean space","2404908":"Full Elite Sets for Multi-Objective Optimisation","261421468":"Two Symmetrical Decomposition Methods for Structure-complex Petri Nets and Their Applications","220381224":"An Investigation on Noisy Environments in Evolutionary Multiobjective Optimization","276513648":"Efficient Portfolio Construction with the Use of Multiobjective Evolutionary Algorithms: Best Practices and Performance Metrics","227414915":"A software framework based on a conceptual unified model for evolutionary multiobjective optimization: ParadisEO-MOEO","4939076":"Multiagent visual area coverage using a new genetic algorithm selection scheme","222211885":"A novel evolution strategy for multiobjective optimization problem","220105995":"Hybrid immune algorithm with Lamarckian local search for multi-objective optimization","4089896":"Vector Evaluated Differential Evolution for Multiobjective Optimization","220981821":"A Hybrid Evolutionary Algorithm for Cluster Geometry Optimization: The Importance of Structural Elitism","48198911":"New Model for Multi-Objective Evolutionary Algorithms","257705598":"Handling multiple objectives with biogeography-based optimization","260849838":"Detection of unusual trajectories using multi-objective evolutionary algorithms and rough sets","225223496":"A flexible three-level logistic network design considering cost and time criteria with a multi-objective evolutionary algorithm. J Intell Manuf","2605569":"PISA --- A Platform and Programming Language Independent Interface for Search Algorithms","37710864":"System-Level Modelling and Design Space Exploration for Multiprocessor Embedded System-on-Chip Architectures","223648868":"An investigation on noise-induced features in robust evolutionary multi-objective optimization","6680145":"Independent Component Analysis-motivated Approach to Classificatory Decomposition of Cortical Evoked Potentials","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","221228568":"A MOPSO Algorithm Based Exclusively on Pareto Dominance Concepts","220866834":"2-Objective Optimization of Cells Overlap and Geometry with Evolutionary Algorithms","256276346":"An overview of population-based algorithms for multi-objective optimisation","7801930":"On the use of multi-objective evolutionary algorithms for the induction of fuzzy classification rule systems. Biosystems","4267644":"A Hybrid Multi-objective Evolutionary Algorithm and Its Application in Component-based Product Design","220671770":"Genetic Programming-Based Automatic Gait Generation in Joint Space for a Quadruped Robot","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","2370915":"Multi-Objective Design Space Exploration of Road Trains with Evolutionary Algorithms","281799555":"Verifying the Effectiveness of an Evolutionary Approach in Solving Many-Objective Optimization Problems","237844582":"Attribute Index and Uniform Design Based Multiobjective Association Rule Mining with Evolutionary Algorithm","272029050":"An analysis of the interface between evolutionary algorithm operators and problem features for water resources problems. A case study in water distribution network design","228591342":"A neural network based generalized response surface multiobjective evolutionary algorithm","277035474":"Partição multicritério de um território em zonas : modelos, algoritmos e aplicações","225519651":"A Review of Major Application Areas of Differential Evolution","229876970":"Adaptive ranks clone and","220740721":"Markov chain hyper-heuristic (MCHH): An online selective hyper-heuristic for multi-objective continuous problems","220381049":"A Fast Way of Calculating Exact Hypervolumes","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","224472067":"Updating Exclusive Hypervolume Contributions Cheaply","237249094":"SEEA FOR MULTI-OBJECTIVE OPTIMIZATION: REINFORCING ELITIST MOEA THROUGH MULTI-PARENT CROSSOVER, STEADY ELIMINATION AND SWARM HILL CLIMBING","224645892":"Maximising Hypervolume for Selection in Multi-objective Evolutionary Algorithms","220381014":"Using unconstrained elite archives for multiobjective optimization","225459204":"Linked interpolation-optimization strategies for multicriteria optimization problems","221532492":"Computational Intelligence in Modeling of Biological Neurons: A Case Study of an Invertebrate Pacemaker Neuron","251829115":"A New Way of Calculating Exact Exclusive Hypervolumes","224177959":"A fast many-objective hypervolume algorithm using iterated incremental calculations","242360590":"Multi-Objective Optimisation for Information Access Tasks","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","242376975":"Cost-effective Evolutionary Strategies for Pareto Optimal Front Approximation in Multiobjective Shape Design Optimization of Electromagnetic Devices","224301859":"Incrementally maximising hypervolume for selection in multi-objective evolutionary algorithms","277298436":"Multi-Objective Particle Swarm Optimisation Methods.","4201672":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","4201424":"GDE3: The third evolution step of generalized differential evolution","225665506":"A fast steady-state ε-dominance multi-objective evolutionary algorithm","261307906":"Applying the WFG algorithm to calculate incremental hypervolumes","3419046":"Dominance-Based Multiobjective Simulated Annealing","257153732":"BSTBGA: a hybrid genetic algorithm for constrained multi-objective optimization problems. Comput Oper Res","264928592":"Optimization of Logistics","243788071":"Analysis and applications of evolutionary multiobjective optimization algorithms","224309500":"A Fast Incremental Hypervolume Algorithm","224594625":"Correction to “A Fast Incremental Hypervolume Algorithm” [Dec 08 714-723]","224453315":"A unified model for evolutionary multi-objective optimization and its implementation in a general purpose software framework","220215427":"The mean-variance cardinality constrained portfolio optimization problem: An experimental evaluation of five multiobjective evolutionary algorithms","221258388":"A Multi-objective Gravitational Search Algorithm","266475333":"A hyper-heuristic approach to water distribution network design","221336216":"Hybridization of Independent Component Analysis, Rough Sets, and Multi-Objective Evolutionary Algorithms for Classificatory Decomposition of Cortical Evoked Potentials","286215846":"Classification and Survival Analysis Using Multi-objective Evolutionary Algorithms","7021765":"On the use of multi-objective evolutionary algorithms for survival analysis","36146583":"Traffic engineering in MPLS networks with multiple objectives : modeling and optimization /","3418757":"Rank-density-based multiobjective genetic algorithm and benchmark test function study","226604595":"Evolving the Tradeoffs between Pareto-Optimality and Robustness in Multi-Objective Evolutionary Algorithms","49282386":"Heuristics for Optimising the Calculation of Hypervolume for Multi-objective Optimisation Problems","286922917":"Performance Analysis of Simulation-based Multiobjective Optimization Using High Performance Computing","2473370":"An Evolutionary Algorithm With A Multilevel Pairing Strategy For Single And Multiobjective Optimization","221008531":"Optimising multi-modal polynomial mutation operators for multi-objective problem classes","221006995":"Benchmark multi-objective optimisation test problems with mixed encodings","225859507":"Leader identification and leader selection: Its effect on a swarm\u0027s performance for multi-objective design optimization problems","224319385":"A Competitive-Cooperative Coevolutionary Paradigm for Dynamic Multiobjective Optimization","261140826":"A Multipopulation Coevolutionary Strategy for Multiobjective Immune Algorithm","242206885":"Multi-Ring: Uma nova topologia para otimização por enxame de partículas (PSO)","24305081":"A Unified Model for Evolutionary Multiobjective Optimization and its Implementation in a General Purpose Software Framework: ParadisEO-MOEO","3418879":"Multiobjective optimization and evolutionary algorithms for the application mapping problem in multiprocessor system-on-chip design","224301715":"Population diversity measure based on singular values of the distance matrix","265995541":"Multiple Control Levels in Structured Genetic Algorithms","3418862":"A faster algorithm for calculating hypervolume","224178048":"On population diversity measures in Euclidean space","266475326":"A General Multi-objective Hyper-Heuristic for Water Distribution Network Design with Discolouration Risk","225674670":"Multiobjective evolutionary algorithms for complex portfolio optimization problems","264193631":"Automated construction of evolutionary algorithm operators for the bi-objective water distribution network design problem using a genetic programming based hyper-heuristic approach","261500276":"An Investigation on Noisy Environments in Evolutionary Multi-Objective Optimization","220405195":"An Effective Adaptive Multi-objective Particle Swarm for Multimodal Constrained Function Optimization","239469227":"COMPARISON OF GENERALIZED DIFFERENTIAL EVOLUTION TO OTHER MULTI-OBJECTIVE EVOLUTIONARY ALGORITHMS","228587632":"Multiobjective optimization using parallel vector evaluated particle swarm optimization","228666454":"A particle swarm optimizer for multi-objective optimization","236610797":"Hybrid organization of functional departments and manufacturing cells in the presence of imprecise data","225256850":"On The Effects of Archiving, Elitism, and Density Based Selection in Evolutionary Multi-objective Optimization"},"index":726}