{"abs":"This study investigates the use of multiobjective techniques in Genetic Programming (GP) in order to evolve compact programs and to reduce the effects caused by bloating. The proposed approach considers the program size as a second, independent objective besides the program functionality. In combination with a recent multiobjective evolutionary technique, SPEA2, this method outperforms four other strategies to reduce bloat with regard to both convergence speed and size of the produced programs on a even-parity problem.","title":"Multiobjective Genetic Programming: Reducing Bloat Using SPEA2","id":2362394,"url":"https://www.researchgate.net/publication/2362394_Multiobjective_Genetic_Programming_Reducing_Bloat_Using_SPEA2","names":["Stefan Bleuler","Martin Brack","Lothar Thiele","Eckart Zitzler"],"references":{"2824873":"Evolving Compact Solutions in Genetic Programming: A Case Study","201976459":"Genetic Programming II: Automatic Discovery of Reusable Programs","226817696":"Fitness causes bloat: Mutation","13337999":"Effects of Code Growth and Parsimony Pressure on Populations in Genetic Programming.","216300097":"Genetic Programming--An Introduction","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","3812157":"Evolving more efficient digital circuits by allowing circuit layoutevolution and multi-objective fitness","2761730":"Genetic Programming and Redundancy","220375083":"Balancing Accuracy and Parsimony in Genetic Programming","2771203":"Genetic Programming as a Means for Programming Computers by Natural Selection","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","221228580":"Application of Multiobjective Evolutionary Algorithms for Dose Optimization Problems in Brachytherapy","13260058":"Effects of Code Growth and Parsimony Pressure on Populations in Genetic Programming","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","244931946":"20 Data Structures and Genetic Programming","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm"},"citedIn":{"220359458":"Coevolution of Nearest Neighbor Classifiers.","224719974":"Multiobjective Genetic Fuzzy Systems: Review and Future Research Directions","6357350":"Multiobjective optimization in bioinformatics and computational biology. IEEE/ACM Trans Comput Biol Bioinform (TCBB) 4:279-292","220741408":"Evolutionary algorithm considering program size: Efficient program evolution using GRAPE","2557485":"A Tutorial on Evolutionary Multiobjective Optimization","224677994":"Autonomous Robot Failure Recognition Design using Multi-Objective Genetic Programming","227152005":"Multiobjective Genetic Fuzzy Systems","29868759":"A multi-objective GP-PSO hybrid algorithm for gene regulatory network modeling","244439168":"Program Evolution with Explicit Learning: a New Framework for Program Automatic Synthesis","226238573":"Pursuing the Pareto Paradigm: Tournaments, Algorithm Variations and Ordinal Optimization","29974747":"Apprentissage de fonctions visuelles pour un robot mobile par programmation génétique","258398580":"Optimum Design of LC Filter of PWM Inverter with Discrete-Time Model Following Control Obtained by Applying Multi-Objective Genetic Algorithm","216300273":"Evolutionary Optimization of Mould Temperature Control Strategies: Encoding and Solving the Multiobjective Problem with Standard Evolution Strategy and Kit for Evolutionary Algorithms","257564492":"Operator equalisation for bloat free genetic programming and a survey of bloat control methods","289460312":"Multi-objective Optimisation Using Evolutionary Algorithms: An Introduction","221009206":"A Statistical Learning Perspective of Genetic Programming","220702010":"Robust Inferential Sensors Based on Ensemble of Predictors Generated by Genetic Programming","224721018":"RLGP: An Efficient Method to Avoid Code Bloating on Genetic Programming","242655061":"Customized Evolutionary Optimization Procedure for Generating Minimum Weight Compliant Mechanisms","220741388":"Multiobjective genetic programming approach to evolving heuristics for the bounded diameter minimum spanning tree problem: MOGP for BDMST","225135692":"Biomass Inferential Sensor Based on Ensemble of Models Generated by Genetic Programming","257636220":"Giri B. K., Hakanen J., Miettinen K. and Chakraborti N.: ‘Genetic programming through bi-objective genetic algorithms with a study of a simulated moving bed process involving multiple objectives’, Appl. Soft Comput.","220045365":"Multiobjective Optimization Using Evolutionary Algorithms. Wiley, New York","230855659":"Utilising Restricted For-Loops in Genetic Programming","220413705":"Multiple Warehouses Scheduling Using Steady State Genetic Algorithms","263453855":"Helper-Objectives: Using Multi-Objective Evolutionary Algorithms for Single-Objective Optimisation: Evolutionary Computation Combinatorial Optimization (Editors: Jens Gottlieb, Emma Hart, Martin Middendorf, Günter Raidl and Colin Reeves)","282700777":"Profit maximization in cloud computing","241187666":"Removing code bloating in crossover operation in Genetic Programming","221024792":"Introduction to Evolutionary Multiobjective Optimization","224330345":"Order of Nonlinearity as a Complexity Measure for Models Generated by Symbolic Regression via Pareto Genetic Programming","283943383":"Using multi-objective evolutionary algorithms for single-objective constrained and unconstrained optimization","7801930":"On the use of multi-objective evolutionary algorithms for the induction of fuzzy classification rule systems. Biosystems","228696801":"Edge Detector Evolution using Multidimensional Multiobjective Genetic Programming","277972946":"Compromise Rank Genetic Programming for Automated Nonlinear Design of Disaster Management","264817550":"Parallel genetic algorithm with fading selection","220637805":"A Comparison of three evolutionary strategies for multiobjective genetic programming","238660725":"Multi-objective site selection and analysis for GSM cellular network planning","4219405":"Evolutionary multi-objective optimization: current state and future challenges","220286065":"Automated Discovery of Numerical Approximation Formulae via Genetic Programming","228644337":"Dynamic security policy learning","249960126":"Multiobjective Learning Classifier Systems: An Overviews","226202147":"Recent Developments in Evolutionary Multi-Objective Optimization","220175941":"On the possibilities of (pseudo-) software cloning from external interactions","274075403":"Simulation-Based Rule Generation Considering Readability","239553816":"Searching for Quantum Software","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","6758200":"Generalized disjunction decomposition for evolvable hardware. IEEE Trans Syst Man Cybern Part B","4365345":"Learning Vision Algorithms for Real Mobile Robots with Genetic Programming","251345048":"Evolution’s Niche in Multi-Criterion Problem Solving","251828837":"Genetic Programming Based on an Adaptive Regularization Method","275157761":"Current trends in evolutionary multi-objective optimization","4201512":"Multi-objective techniques in genetic programming for evolving classifiers","230855593":"Genetic Programming, 7th European Conference, EuroGP2004, Coimbra, Portugal, April 5-7, 2004, Proceedings","2867803":"Lexicographic Parsimony Pressure","216301460":"Using Genetic Programming for Feature Creation with a Genetic Algorithm Feature Selector","10710738":"Modification Point Depth and Genome Growth in Genetic Programming","220742234":"Evolutionary Multiobjective Optimization","4089933":"Multiobjective parsimony enforcement for superior generalisation performance","216301719":"A Tutorial on Evolutionary Multiobjective Optimization","6192937":"GPDTI: A Genetic Programming Decision Tree Induction method to find epistatic effects in common complex diseases","242405643":"Feasibility of the Evolutionary Algorithm using Different Behaviours of the Mutation Rate to Design Simple Digital Logic Circuits","276832251":"Controlling code growth by dynamically shaping the genotype size distribution","226754047":"Data Mining Based Optimization of Test Cases to Enhance the Reliability of the Testing","4283967":"Multi-Objective Genetic Algorithm to Support Class Responsibility Assignment","262317021":"Advances in Evolutionary Multi-objective Optimization","265200203":"Multi-Mission Radar Waveform Design via a Distributed SPEA2 Genetic Algorithm","225441256":"Minimizing Structural Risk on Decision Tree Classification","2377646":"Evolutionary Algorithms for Multiobjective Optimization","221574053":"Graph Grammar Encoding and Evolution of Automata Networks.","220654519":"Domain-independent feature extraction for multi-classification using multi-objective genetic programming","262292791":"Multiobjectivization with NSGA-ii on the noiseless BBOB testbed","278303235":"Evolutionary Inference of Attribute-Based Access Control Policies","277165074":"Controlling bloat : individual and population based approaches in genetic programming","221006517":"Graph design by graph grammar evolution","266452090":"Study of Hardware and Software Optimizations of SPEA2 on Hybrid FPGAs","220199555":"A comparison of two learning mechanisms for the automatic design of fuzzy diagnosis systems for rotating machinery","264848215":"Optimisation par Algorithme Génétique d\u0027une Commande LPV de Suspension Semi-active","220741005":"Evolving optimal feature extraction using multi-objective genetic programming: A methodology and preliminary study on edge detection","3412371":"Identifying the Structure of NonLinear Dynamic Systems Using Multiobjective Genetic Programming","282358910":"Evolutionary multi-objective optimization for evolving hierarchical fuzzy system","267432540":"Helper-Objectives: Using Multi-Objective Evolutionary Algorithms for Single-Objective Optimisation","2475912":"Searching Under Multi-Evolutionary Pressures","2524809":"Accuracy, Parsimony, and Generality in Evolutionary Learning Systems via Multiobjective Selection","220718742":"Accuracy, Parsimony, and Generality in Evolutionary Learning Systems via Multiobjective Selection.","46611583":"THE FUTURE CHALLENGES","2560413":"Fighting Bloat With Nonparametric Parsimony Pressure","283094373":"Comparison of two data-driven modelling techniques for long-term streamflow prediction using limited datasets","224259041":"Evolving Distributed Algorithms With Genetic Programming","221352177":"Expression Inference — Genetic Symbolic Classification Integrated with Non-linear Coefficient Optimisation","225666992":"Multi-objective Learning Classifier Systems","262166627":"A Multi-agent Genetic Algorithm for Multi-objective Optimization","227046210":"Reducing Bloat in GP with Multiple Objectives","266586158":"CONTROLLING THE PROBLEM OF BLOATING USING STEPWISE CROSSOVER AND DOUBLE MUTATION TECHNIQUE","28357502":"Genetische Programmierung einer algorithmischen Chemie","228393036":"A generic optimal feature extraction method using multiobjective genetic programming","223464835":"A multi-objective genetic programming approach to developing Pareto optimal decision trees","220590326":"Application of Multiobjective Genetic Programming to the Design of Robot Failure Recognition Systems","220283636":"A survey and taxonomy of performance improvement of canonical genetic programming","234387757":"Graph Structured Program Generation Using Evolutionary Algorithm Considering Program Size","268260132":"Genetic Programming Techniques for Sensor Networks","220283899":"Evolving rule induction algorithms with multi-objective grammar-based genetic programming","228638330":"Phenotype diversity objectives for graph grammar evolution","263941989":"Genetic Programming: Principles, Applications and Opportunities for Hydrological Modelling","222830249":"A generic optimising feature extraction method using multiobjective genetic programming","220740809":"The roles of diversity preservation and mutation in preventing population collapse in multiobjective genetic programming","226107032":"Pareto-Front Exploitation in Symbolic Regression","226131615":"Diversity Mechanisms in Pitt-Style Evolutionary Classifier Systems","238778077":"Population Variation in Canonical Tree based Genetic Programming","262171464":"Controlling bloat through parsimonious elitist replacement and spatial structure","220739522":"Alternative Bloat Control Methods","220497352":"Evolution of visual controllers for obstacle avoidance in mobile robotics","220837572":"Using Multiobjective Genetic Programming to Infer Logistic Polynomial Regression Models.","3418841":"Multiobjectivity and Complexity in Embodied Cognition","224089526":"Implicitly Controlling Bloat in Genetic Programming","263525189":"Comparison and Evaluation of Multiple Objective Genetic Algorithms for the Antenna Placement Problem: Algorithmic Solutions for Wireless, Mobile, Ad Hoc and Sensor Networks (Guest Editors: Amotz Bar-Noy, Alan A. Bertossi, Cristina M. Pinotti and Cauligi S. Raghavendra)","257779629":"Incremental evolution of fast moving and sensing simulated snake-like robot with multiobjective GP and strongly-typed crossover","220740825":"Evolving distributed algorithms with genetic programming: election.","221024990":"Future Challenges.","221009114":"Toward an Alternative Comparison between Different Genetic Programming Systems","221228504":"Improving Computational Mechanics Optimum Design Using Helper Objectives: An Application in Frame Bar Structures","263066452":"Genetic Programming Evolved through Bi-Objective Genetic Algorithms Applied to a Blast Furnace","6883218":"A Comparison of Bloat Control Methods for Genetic Programming","51145968":"Multimodal Optimization Using a Bi-Objective Evolutionary Algorithm","221431244":"Learning General Solutions through Multiple Evaluations during Development."},"index":731}