{"abs":"The spatial prediction methodology that has become known under the heading of kriging is largely based on the assumptions that the underlying random field is Gaussian and the covariance function is exactly known. In practical applications, however, these assumptions will not hold. Beyond Gaussianity of the random field, lognormal kriging, disjunctive kriging, (generalized linear) model-based kriging and trans-Gaussian kriging have been proposed in the literature. The latter approach makes use of the Box–Cox-transform of the data. Still, all the alternatives mentioned do not take into account the uncertainty with respect to the distribution (or transformation) and the estimated covariance function of the data. The Bayesian trans-Gaussian kriging methodology proposed in the present paper is in the spirit of the “Bayesian bootstrap” idea advocated by Rubin (Ann Stat 9:130–134, 1981) and avoids the unusual specification of noninformative priors often made in the literature and is entirely based on the sample distribution of the estimators of the covariance function and of the Box–Cox parameter. After some notes on Bayesian spatial prediction, noninformative priors and developing our new methodology finally we will present an example illustrating our pragmatic approach to Bayesian prediction by means of a simulated data set.","title":"Why do we need and how should we implement Bayesian Kriging methods. Stoch. Environ","id":225110648,"url":"https://www.researchgate.net/publication/225110648_Why_do_we_need_and_how_should_we_implement_Bayesian_Kriging_methods_Stoch_Environ","names":["Jürgen Pilz","Gunter Spöck","Stochastic Environmental Research and Risk Assessment"],"references":{"225875286":"Fitting Variogram Models by Weighted Least Squares","224839719":"An Analysis of Transformations (with Discussion)","23630761":"Interpolation with uncertain spatial covariance: a Bayesian alternative to kriging. J Multivariate Anal","265366643":"Bayesian Prediction of Transformed Gaussian Random Fields","226195736":"Bayesian Kriging—Merging Observations and Qualified Guesses in Kriging","227800373":"Multivariate spatial interpolation and exposure to air pollutants. Can J Stat","2120071":"Default priors for Gaussian processes. Ann Stat","227660566":"Extention of spatial information, Bayesian kriging and updating of prior variogram","227647478":"Model-Based Geostatistic","278876950":"An approach to statistical spatio-temporal modeling of meteorological fields, with discussion. J Am Stat Assoc","248971516":"Bayesian Inference in Gaussian Model-based Geostatistics","2319535":"Objective Bayesian Analysis of Spatially Correlated Data","251424976":"Parameter Uncertainty in Estimation of Spatial Functions: Bayesian Analysis","226757289":"The Bayesian bridge between simple and universal kriging. Math Geol","2301165":"Bayesian Variogram Modeling for an Isotropic Spatial Process","38358650":"The Bayesian Bootstrap","243768499":"A Bayesian Analysis of Kriging","37420142":"Introduction to Disjunctive Kriging and Non-Linear Geostatistics","227110768":"Bayesian spatial prediction"},"citedIn":{"225687027":"Spatial sampling design and covariance-robust minimax prediction based on convex design ideas","279457512":"Spatiotemporal Dynamics of Hand-Foot-Mouth Disease and Its Relationship with Meteorological Factors in Jiangsu Province, China","233860849":"The application of Bayesian statistics and convex design methodologies to geostatistical\nprediction and sampling design","267591281":"Kriging Modeling for Engine Mount Optimization in Motorcycles","265846493":"Interfacing Geostatistics and GIS","274069584":"Wetland Evapotranspiration Estimation for South Florida Using MODIS Imagery","265013708":"Development and validation of a dynamic metamodel based on stochastic radial basis functions and uncertainty quantification","225118252":"Copula-based geostatistical modeling of continuous and discrete data including covariates","278186460":"IMPROVEMENTS TO GRADIENT-ENHANCED KRIGING USING A BAYESIAN INTERPRETATION","233747236":"Some Advances in Bayesian Spatial Prediction and Sampling Design","260562188":"The Association of Ambient Air Pollution and Physical Inactivity in the United States","258733351":"Linear and Nonlinear Models. Fixed effects, random effects, and total least squares","220164368":"Bayesian spatial modeling and interpolation using copulas","283154737":"Spatial Distribution of TDS in Drinking Water of Tehsil Jampur using Ordinary and Bayesian Kriging","233860835":"Bayesian locally stationary trans-Gaussian kriging using generalized Voronoi tesselations","272032098":"Using Vis-NIR Spectroscopy for Monitoring Temporal Changes in Soil Organic Carbon","255702187":"SpatialCopula: A Matlab toolbox for copula-based spatial analysis","283697854":"Modeling Soil Organic Carbon at Regional Scale by Combining Multi-Spectral Images with Laboratory Spectra","236900105":"Objective Bayesian Analysis of Geometrically Anisotropic Spatial Data","258160244":"Spatial reconstruction of rainfall fields from rain gauge and radar data. Stoch Environ Res Risk Assess","288219770":"A 120-year record of the spatial and temporal distribution of gravestone decay and acid deposition","264463770":"Sources and contents of air pollution affecting term low birth weight in Los Angeles County, California, 2001-2008","285550041":"Line of Sight controller tuning using Bayesian optimization of a high-level optronic criterion","233747184":"Interoperability- Spatial interpolation and automated mapping","233860821":"Bayesian Trans-Gaussian Kriging with Log-Log Transformed Skew Data","257807035":"Valid predictions with confidence estimation in an air pollution problem","267742675":"Fallout plume of submerged oil from Deepwater Horizon","283107961":"Behavior of graphite reinforced magnesium matrix composites against sliding wear and friction","289430311":"Cooperatively mapping of the underwater acoustic channel by robot swarms","260795363":"Assessment of Spatial Models for Interpolation of Elevation in Pakistan","226405588":"Towards generic real-time mapping algorithms for environmental monitoring and emergency detection","233860827":"Modeling and interpolation of non-Gaussian spatial data: a comparative\nstudy","289694185":"Groundwater fluoride enrichment in an active rift setting: Central Kenya Rift case study","266697739":"Modeling and mapping isotopic patterns in the Northwest Atlantic derived from loggerhead sea turtles","278403319":"Lecture Notes in Earth System Sciences","282343268":"Investigation of denitrifying microbial communities within an agricultural drainage system fitted with low-grade weirs","269727906":"Spatial Interpolation of Sulfate Concentration in Groundwater Including Covariates Using Bayesian Hierarchical Models","223183355":"Automatic processing, quality assurance and serving of real-time weather data","283316117":"Concurrence of Aqueous and Gas Phase Contamination of Groundwater in the Wattenberg Oil and Gas Field of Northern Colorado","261588384":"The Method of Normalized Correlations: A Fast Parameter Estimation Method for Random Processes and Isotropic Random Fields That Focuses on Short-Range Dependence","284986187":"A Latent Variable Approach to Modelling Multivariate Geostatistical Skew-Normal Data","262533533":"Geographic Disparity in Chronic Obstructive Pulmonary Disease (COPD) Mortality Rates among the Taiwan Population","288686540":"Evaluating Land Subsidence Rates and Their Implications for Land Loss in the Lower Mississippi River Basin","268228935":"Lymphatic filariasis control in Tanga Region, Tanzania: Status after eight rounds of mass drug administration"},"index":743}