{"abs":"Stochastic finite element techniques are used for estimating the uncertain response of discretized structural systems which are defined by random quantitites or are subjected to random excitations. Such techniques are especially useful in view of the development of probabilistic models for the estimation of the residual lifetime of components undergoing damage-accumulation processes. A special procedure for calculating the probability distribution of the single response variable was discussed in Ref. [1].Attention is focused in this paper on the improvements to be included for estimating the correlation between the response variables of interest and their joint probability distribution. La dicitura elementi finiti stocastici contraddistingue quell\u0027insieme di tecniche numeriche che consentono una stima dell\u0027incertezza che affligge la risposta di sistemi strutturali discreti o discretizzabili, caratterizzati da parametri aleatori o/e soggetti ad eccitazioni aleatorie. L\u0027impiego di queste tecniche si mostrato particolarmente utile nella definizione delle variabili di ingresso di quei modelli probabilistici con cui si stima la vita residua di elementi strutturali soggetti ad accumulo di danno. Un procedimento efficiente per ricavare la legge di distribuzione di probabilit della singola variabile di risposta era stato messo a punto in [1].In questo lavoro si discutono gli sviluppi necessari per includere la stima della correlazione tra due variabili e la determinazione di distribuzioni di probabilit congiunta.","title":"Response variables correlation in stochastic finite element analysis","id":226241478,"url":"https://www.researchgate.net/publication/226241478_Response_variables_correlation_in_stochastic_finite_element_analysis","names":["Lucia Faravelli","Meccanica"],"references":{"232539887":"Experimental designs (2nd ed.).","245137080":"Analysis of cladding residual stresses and their influence on the structural reliability of LWR pressure vessels","200656985":"Design and Analysis of Experiments (2nd Ed)","25331103":"Experimental Designs","229485618":"Random Field Finite Elements","243573259":"Applied regression analysis and other multivariable methods. PWS-KENT"},"citedIn":{"245211373":"Lifetime prediction of fatigue sensitive structural elements","245211497":"A response surface technique for fuzzy—random evaluations of local seismic hazard","245210410":"Structural reliability analysis using a standard deterministic finite element code","226990558":"Reliability Based Seismic Design","245211537":"Direct computation of the design point of a stochastic structure using a finite element code","245211491":"Stochastic finite elements for crash problems","239373963":"Randomness effects in crashworthiness analysis"},"index":744}