{"abs":"Virtually all structural optimizations based on system reliability were conducted considering only the ultimate state of plastic collapse initiated from the intact (i.e., undamaged) system. These single-objective optimizations may result in decreasing the safety levels with respect to other limit states of concern, such as deformation, plastic hinge occurrences, and residual system reliability. Motivated by the need of a rational reliability-based multilimit-state optimization approach, where different conflicting requirements in the design of structural systems are considered simultaneously, a vector-optimization approach is formulated. In this approach a vector-valued objective function is examined, and the system safety is considered with regard to multiple reliability requirements imposed simultaneously. The solution to this problem is defined as the set of noninferior solutions in the space of decision variables. A three-step reliability-based vector-optimization searching strategy is suggested, a decision support space is proposed, and examples of solutions for both nondeterministic truss and frame systems are presented.","title":"Reliability-Based Vector Optimization of Structural Systems","id":245302843,"url":"https://www.researchgate.net/publication/245302843_Reliability-Based_Vector_Optimization_of_Structural_Systems","names":["Gongkang Fu","Dan M. Frangopol","Journal of Structural Engineering"],"references":{"245302349":"Material Behavior and Optimum Design of Structural Systems","222387909":"System reliability developments in structural engineering. Structural Safety 1(1):3-13","233378636":"Formulations of reliability-oriented optimization","245301304":"Structural Optimization Using Reliability Concepts","232828508":"Optimal reliability-based design of large framed structures"},"citedIn":{"233922289":"Reliability Based Optimal Design of Structures Using Competitive Genetic Algorithms","269198155":"Life-Cycle Performance of Structural Systems under Uncertainty","273745301":"Risk-Based Maintenance Optimization of Deteriorating Bridges","223245835":"Multi-objective reliability-based optimization of prestressed concrete beams","289629508":"Multi-objective optimization of truss structures using the bee algorithm","223036034":"Computer-aided design of optimal structures with uncertainty","44071977":"A Multiobjective and Stochastic System for Building Maintenance Management","222411083":"On the effects of non-linear elements in the reliability-based optimal design of stochastic dynamical systems","229676221":"Probabilistic structural optimization","264378125":"Zyklisch belastete Betonstrukturen","222542935":"An efficient framework for optimal robust stochastic system design using stochastic simulation","239390739":"Reliability-Based Optimization of Plant Precast Concrete Structures","252321939":"An experimental model of buckling restrained braces for multi-performance optimum design","239439131":"Pareto Analysis for Multicriteria Optimization of Bridge Preservation Decisions","279892464":"Time-variant redundancy of ship structures","220373382":"Reliability-Based Optimization Models for Scheduling Pavement Rehabilitation","228585210":"Multi-Criteria Optimal Structural Design Under Uncertainty","223446516":"Multi-objective design optimization of electrostatically actuated microbeam resonators with and without parameter uncertainty","223311018":"Reliability-based optimization of structural systems by adaptive target safety – Application to RC frames","245301304":"Structural Optimization Using Reliability Concepts","245303220":"Reliability-Based Optimization of Series Systems of Parallel Systems","229360576":"A robust study of reliability-based optimization methods under eigen-frequency","250695581":"Optimization of damage-tolerant structural systems","44050512":"Integration of stochastic deterioration models with multicriteria decision theory for optimizing maintenance of bridge decks","44066711":"Risk-based maintenance optimization of bridge structures","239390515":"Holonomic Elastoplastic Reliability Analysis of Truss Systems. II: Applications","245210410":"Structural reliability analysis using a standard deterministic finite element code","263094546":"A review of multi-criteria decision-making methods for infrastructure management","44088413":"Network-level bridge management using a multiobjective optimization decision model","250696972":"Life-cycle reliability-based optimization of civil and aerospace structures. Comput Struct","259174479":"Reliability-based Design Optimization (RBDO)","256919471":"Multiobjective Optimization of Trusses Using Genetic Algorithms","236129580":"Reliability-based optimization of maintenance scheduling of mechanical components under fatigue"},"index":748}