{"abs":"A method for computing probabilities of failure of structural components and systems is proposed. The approach is based on a radial-space division technique in conjunction with automatic generation of unit centerline vectors. Based on this technique, the standard normal space is divided into active and passive subdomains. The probability contribution of each active subdomain to the total probability of failure is estimated by approximating the actual limit-state hypersurface with a hypersphere segment centered on the actual hypersurface. The proposed method can solve with relatively high accuracy both component and system reliability problems involving nonlinearities and multiple extremum points of the probability density on the limit-state hypersurface. A number of numerical examples involving linear and nonlinear performance functions of components and systems are presented. The results are in good agreement with exact solutions, probability bounds, multinormal approximations, and/or Monte Carlo simulations.","title":"Hyperspace Division Method for Structural Reliability","id":245285557,"url":"https://www.researchgate.net/publication/245285557_Hyperspace_Division_Method_for_Structural_Reliability","names":["Satoshi Katsuki","Dan M. Frangopol","Journal of Engineering Mechanics"],"references":{"245301372":"Basic Analysis of Structural Safety","236660920":"Methods of Structural Safety","223214616":"Sensitivity estimation within first and second order reliability methods","222588317":"New light on first- and second-order reliability methods","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","233329810":"Reliability Index and Failure Probability","257940484":"Structural Reliability Analysis, Prediction","245284594":"Radial Importance Sampling for Structural Reliability","268017285":"Application of Structural System Reliability Theory","232838093":"Narrow Reliability Bounds for Structural Systems"},"citedIn":{"233922161":"Reliability Based Optimization of Complex Structures using Competitive GAs","264150780":"Low-discrepancy sampling for structural reliability sensitivity analysis","222062335":"A new directional simulation method for system reliability. Part II: Application of neural networks","239373191":"Application of low-discrepancy sampling method in structural reliability analysis","245185113":"Load combination analysis by ‘Directional simulation in the load space’","263349749":"Reliability Assessment of Structural Systems Based on A Directional Vector Approximation Method.","281609550":"Study of multiple plane combination approximate method for structural reliability analysis","260081737":"Integration of reliability methods into a commercial finite element software package","245211600":"Er G.K.: A method for multi-parameter PDF estimation of random variables. Struct. Saf. 20, 25-36","243787593":"Hybrid Analysis Method for Reliability-Based Design Optimization","285236751":"DETC2002/DAC-34128 AN INVESTIGATION OF NONLINEARITY OF RELIABILITY-BASED DESIGN OPTIMIZATION APPROACHES","261395072":"A Method of Quasi Monte Carlo for Computation of Ship Availability","223568523":"System Reliability and Redundancy in Structural Design and Evaluation","222231783":"Estimation of failure probabilities by local approximation of the limit state function","245286596":"Finite Element-Based Structural Reliability Assessment Using Efficient Directional Simulation","268389477":"Adaptive response surface approach using artificial neural networks and Moving Least Squares","259118123":"The estimation of failure probabilities as a false optimization problem","245281413":"Computational Platform for Predicting Lifetime System Reliability Profiles for Different Structure Types in a Network","267594385":"Structural Reliability Analysis With Cross Entropy and Low Discrepancy Sampling Methods","245078962":"Uncertainty analyses in fault trees and Bayesian networks using FORM/SORM methods","260364782":"Towards efficient reliability methods with applications to industrial problems","222837988":"Decomposition methods for structural reliability analysis","245078901":"Computing failure probabilities. Applications to reliability analysis","263666649":"An improved adaptive kriging-based importance technique for sampling multiple failure regions of low probability","237608923":"Hybrid Analysis Method for Reliability-Based Design","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","2461523":"An Adaptive Response Surface Method Utilizing Error Estimates","267412422":"Beurteilung der Zuverlässigkeit von Verbundmörtelsystemen mittels probabilistischer Methoden","245210410":"Structural reliability analysis using a standard deterministic finite element code","226884732":"Monte Carlo techniques in computational stochastic mechanics","222255813":"A new directional simulation method for system reliability. Part I: Application of deterministic point sets","229200279":"Modifications to the ‘directional simulation in the load space’ approach to structural reliability analysis"},"index":750}