{"abs":"Markov chain Monte Carlo (MCMC) methods have been used extensively in statistical physics over the last 40 years, in spatial statistics for the past 20 and in Bayesian image analysis over the last decade. In the last five years, MCMC has been introduced into significance testing, general Bayesian inference and maximum likelihood estimation. This paper presents basic methodology of MCMC, emphasizing the Bayesian paradigm, conditional probability and the intimate relationship with Markov random fields in spatial statistics. Hastings algorithms are discussed, including Gibbs, Metropolis and some other variations. Pairwise difference priors are described and are used subsequently in three Bayesian applications, in each of which there is a pronounced spatial or temporal aspect to the modeling. The examples involve logistic regression in the presence of unobserved covariates and ordinal factors; the analysis of agricultural field experiments, with adjustment for fertility gradients; and processing of low-resolution medical images obtained by a gamma camera. Additional methodological issues arise in each of these applications and in the Appendices. The paper lays particular emphasis on the calculation of posterior probabilities and concurs with others in its view that MCMC facilitates a fundamental breakthrough in applied Bayesian modeling. Comments: Arnoldo Frigessi (41–43), Alan E. Gelfand, Bradley P. Carlin (43–46), Charles J. Geyer (46–48), G. O. Roberts, S. K. Sahu, W. R. Gilks (49–51), Wing Hung Wong (52–53), Bin Yu (54–58), Julian Besag, Peter Green, David Higdon, Kerrie Mengersen (58–66).","title":"Bayesian Computation and Stochastic Systems","id":265620657,"url":"https://www.researchgate.net/publication/265620657_Bayesian_Computation_and_Stochastic_Systems","names":["Julian Besag","Peter Green","David Higdon","Kerrie Mengersen","Statistical Science"],"references":{},"citedIn":{"24063342":"Bayesian analysis of order-statistics models for ranking data","4783178":"On the dangers of modeling through continuous distributions: a Bayesian perspective","221305139":"A Markov Chain Monte Carlo Approach to Stereovision","222434625":"Effects of Low Sample Mean Values and Small Sample Size on the Estimation of the Fixed Dispersion Parameter of Poisson-gamma Models for Modeling Motor Vehicle Crashes: A Bayesian Perspective","284725500":"Simultaneous perturbation gradient approximation based Metropolis adjusted Langevin Markov chain Monte Carlo for inference of ordinary differential equations","227735956":"Bayesian classification of Neolithic tools","284733695":"Surrogate-assisted Bayesian inference inverse material identification method and application to advanced high strength steel","223264094":"Application of MCMC methods for the multiple change-points problem","13620446":"On the use of Bayesian methods for evaluating compartmental neural models. J Comput Neurosci 5:285-314","224176459":"A Monocone-Bicone Collinear Array","47821507":"Bayesian Image Analysis","227037590":"HIV testing and retesting for men and women in Switzerland","3192852":"Bayesian estimation for homogeneous and inhomogeneous Gaussian random fields","38326894":"Burn-in","271561735":"Spatial statistics: A quantitative geographer’s perspective","4816998":"Linear mixed models with skew-elliptical distributions: A Bayesian approach","12019847":"Modeling a Poisson Forest in Variable Elevations: A Nonparametric Bayesian Approach","222817655":"Stochastic spectral method for efficient Bayesian solution of inverse problems","2779163":"Bayesian Radial Basis Functions of Unknown Dimension","222671220":"Bayesian hidden Markov Model for DNA segmentation : A prior sensitivity analysis","13237498":"A New Method for Spectral Decomposition Using a Bilinear Bayesian Approach","225512773":"Investigating Tropical Deforestation Using Two-Stage Spatial Misaligned Regression Models","12970227":"Timing of human immunodeficiency virus type 1 (HIV-1) transmission from mother to child: Bayesian estimation using a mixture","4771967":"Bayesian Analysis of Agricultural Field Experiments (with discussion)","2834451":"Alternating Subspace-Spanning Resampling to Accelerate Markov Chain Monte Carlo Simulation","4985969":"Spatially Adaptive Bayesian Penalized Splines With Heteroscedastic Errors","24055121":"Modeling Probabilities of Patent Oppositions in a Bayesian Semiparametric Regression Framework","2458650":"Tracking of Tagged MR Images by Bayesian Analysis of a Network of Quads","285019330":"O Uso da Estatística Bayesiana no Melhoramento Genético Animal: Uma Breve Explicação","268314554":"Applied Bayesian Models","261170132":"A marked point process for automated tree detection from mobile laser scanning point cloud data","8657101":"Bayesian hierarchical error model for analysis of gene expression data","8124470":"Bayesian Extrapolation of Space-Time Trends in Cancer Registry Data","223823129":"Bayesian models for spatial incidence: A case study of suicide using the BUGS program","24063295":"A latent variable model for discrete multivariate psychometric waiting times","221304161":"Smooth Image Segmentation by Nonparametric Bayesian Inference","5492741":"Repetitive genetic inversion of optical extinction data","291258635":"Introduction to Besag (1974) Spatial Interaction and the Statistical Analysis of Lattice Systems","24063284":"A Bayesian Approach to Non-linear, Latent Variable Models Using the Gibbs Sampler and the Metropolis-Hastings Algorithm","11160822":"Estimating disease prevalence in absence of a gold standard","226295074":"Einführung zu Markov Chain Monte Carlo Verfahren mit Anwendung auf Gesamtschadenmodelle","38326824":"Bayesian Model Averaging: A Tutorial","12876966":"Estimation of Dynamic Parameters from NMR Relaxation Data using the Lipari–Szabo Model-Free Approach and Bayesian Statistical Methods","227848695":"A Bayesian inference approach to the ill‐posed Cauchy problem of steady‐state heat conduction","247062224":"Operation of The Bayes Inference Engine","12154064":"A Competitive-Layer Model for Feature Binding and Sensory Segmentation","2587726":"Bayesian Analysis of Massive Datasets Via Particle Filters","4771875":"A new approach to investigating spatial variations of disease","51236705":"On the use of a PM2.5 exposure simulator to explain birthweight","227662307":"Leukemia clusters in upstate New York: How adding covariates changes the story","38349362":"Hierarchical probability models and Bayesian analysis of mine locations","227581420":"Priors for Bayesian adaptive spline smoothing","2777175":"Sampling from Multimodal Distributions Using Tempered Transitions","271915080":"Building Extraction from LIDAR Point Cloud Data Using Marked Point Process","226100484":"Hierarchical modeling for extreme values observed over space and time. Environ Ecol Stat","273169462":"Inference for identifying outlying health care providers","2459813":"Some Initial Remarks","4772041":"Maximum likelihood estimation for spatial models by Markov Chain Monte Carlo stochastic approximation","51366797":"Frequency and Spatial Distribution of Environmental Campylobacter spp.","227369224":"Simultaneous Confidence Bands for PenalizedÂ SplineÂ Estimators","51975059":"Space-Time Data fusion Under Error in Computer Model Output: An Application to Modeling Air Quality","5845205":"Analysis of Echo Signal from Single Ultrasound Contrast Microbubble Using a reversible jump MCMC Algorithm","38326981":"Discovering Disease Genes: Multipoint Linkage Analysis via a New Markov Chain Monte Carlo Approach","38349510":"Bayesian object recognition with Baddeley\u0027s Delta Loss","224871912":"Marginally Specified Priors for Nonparametric Bayesian Estimation","263613221":"Empirical Bayes Age–Period–Cohort Analysis of Retrospective Incidence Data","236055173":"Benzo(a)pyrene inhibits the role of the bioturbator Tubifex tubifex in river sediment biogeochemistry","263891759":"A Bayesian Approach for Parameter Estimation and Prediction using a Computationally Intensive Model","2532528":"Uncertainty Assessment for Reconstructions Based on Deformable Geometry","234804582":"Spatial modelling for binary data using a hidden conditional autoregressive Gaussian process: A multivariate extension of the probit model","220301753":"Bayesian Identification of Multiple Change Points in Poisson Data.","229734696":"Sample selection in radiocarbon dating","228570371":"Ethnicity, insurgency, and civil war revisited","3085488":"Near-Optimal Detection of Geometric Objects by Fast Multiscale Methods","280665118":"An Introduction to (Generalized (Non)Linear Mixed Models","227621176":"Probabilistic forecasts, calibration and sharpness","13843581":"Markov Chain Monte Carlo Methods for Radiation Hybrid Mapping","227703075":"Mode jumping proposals in MCMC","43449893":"Assessing the impacts of grazing levels on bird density in woodland habitat: A Bayesian approach using expert opinion","2351262":"Recognizing Chromospheric Objects via Markov Chain Monte Carlo","223644137":"A Bayesian hierarchical framework for calibrating aquatic biogeochemical models","285636025":"Temperature and population density determine reservoir regions of seasonal persistence in highland malaria","12360829":"Inference on a collapsed margin in disease mapping","279070817":"MCMC algorithms for Subset Simulation","227711316":"Gender‐specific differences and the impact of family integration on time trends in age‐stratified Swiss suicide rates","227675483":"Penalized Pseudolikelihood Inference in Spatial Interaction Models with Covariates","227672408":"Triple-Goal Estimates in Two-Stage Hierarchical Models","45130367":"Markov Chain Monte Carlo Technology","46494230":"Modelling Small Area Counts in the Presence of Overdispersion and Spatial Autocorrelation","264230762":"JinsongChen Bayesian MCMC 2DMT GPH 2012","228096327":"The Indexing of the SDSS Science Archive","12665892":"Back-calculating the age-specific incidence of recurrent subclinical Haemophilus Influenzae type B infection","26631536":"Attenuating effects of preferential treatment with Student-t mixed linear models: A simulation study","2655439":"An Improved Model for Spatially Correlated Binary Responses","2349258":"A Bayesian analysis of the multiple change-point problem for a Poisson process","282326073":"Roadway Traffic Crash Mapping: A Space-Time Modeling Approach","24063363":"A Bayesian analysis of finite mixtures in the LISREL model","222416300":"Generalized Structured Additive Regression Based on Bayesian P-Splines","277465190":"Stochastic virtual population analysis","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","234813710":"Dependency Networks for Inference, Collaborative Filtering, and Data Visualization","225700231":"Spatial extremes of wildfire sizes: Bayesian hierarchical models for extremes","271670469":"Objective Bayesian Model Selection in Generalized Additive Models With Penalized Splines","234014981":"Modeling of Multivariate Monotone Disease Processes in the Presence of Misclassification","5768352":"Controlling for confounding in the presence of measurement error in hierarchical models: a Bayesian approach","5885088":"Estimating genealogies from linked marker data: A Bayesian approach","274388134":"Quantifying the added value of climate information in a spatio-temporal dengue model","8005764":"A Gibbs sampler for identification of symmetrically structured, spaced DNA motifs with improved estimation of the signal length. Bioinformatics 21, 2240-2245","4993356":"Clustering Using Objective Functions and Stochastic Search","2324769":"Multivariate Regression Analysis of Panel Data with Binary Outcomes applied to Unemployment Data","10609059":"Proper Multivariate Conditional Autoregressive Models for Spatial Data Analysis","281873865":"Bayesian Inference for Parameter Estimation in Transient Heat Transfer Experiments","10609066":"Frailty Modeling for Spatially Correlated Survival Data, with Application to Infant Mortality in Minnesota","221886517":"A spatio-temporal absorbing state model for disease and syndromic surveillance","227688607":"Bayesian analysis of the additive mixed model for randomized block designs","242073443":"Hierarchical Models in Environmental Science","31471855":"Estimating attributable response as a function of a continuous risk factor","257486423":"Bayesian variable selection for correlated covariates via colored cliques","232691918":"Markov Chain Monte Carlo estimation of species distributions: A case study of the swift fox in western Kansas","2454832":"Contributions to the Statistical Modelling of Image Data and Spatial Point Patterns","12200367":"Distinguishing Effects on Tumor Multiplicity and Growth Rate in Chemoprevention Experiments","227197084":"Langevin-Type Models II: Self-Targeting Candidates for MCMC Algorithms*","31471864":"Miscellanea. Peskun\u0027s theorem and a modified discrete-state Gibbs sampler","243102565":"Modelling transport mode decisions using hierarchical logistic regression models with spatial and cluster effects","258524786":"Relative importance of climatic, geographic and socio-economic determinants of malaria in Malawi","283323902":"A Four Dimensional Spatio-Temporal Analysis of an Agricultural Dataset","11266484":"A Bayesian space varying parameter applied to estimating fertility schedules","7236977":"A Model Framework for Mortality and Health Data Classified by Age, Area, and Time","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","2237707":"An Improved Model for Spatially Correlated Binary Responses","245941123":"Hormonally induced modulation in the phosphate metabolites of breast cancer: Analysis ofin vivo31P MRS signals with a modified prony method","260026964":"Bayesian hierarchical age-period-cohort models with time-structured effects: An application to religious voting in the US, 1972–2008","227626173":"Joint inversion of seismic and gravity data for lunar composition and thermal state","11969945":"Bayesian 2-D deconvolution: A model for diffuse ultrasound scattering","271689985":"Infinite Estimates with Fractional Factorial Experiments","237587227":"Applications of Geocoded Traffic Crash Records and Crash-Risk Mapping Technology in Roadway Safety Improvement Projects","256926306":"Adaptive Construction of Surrogates for the Bayesian Solution of Inverse Problems","11159961":"Disease Mapping of Stage-Specific Cancer Incidence Data","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","220056618":"A Bayesian analysis of an agricultural field trial with three spatial dimensions","226980028":"On computational aspects of Bayesian spatial models: Influence of the neighboring structure in the efficiency of MCMC algorithms","4993392":"A hierarchical model for space-time surveillance data on meningococcal disease","220499994":"Bayesian Radial Basis Functions of Variable Dimension","257665567":"Efficient MCMC Sampling in Dynamic Mixture Models","235523905":"Simultaneous confidence intervals for comparing biodiversity indices estimated from overdispersed count data","257557013":"Hierarchical Bayesian strategy for modeling correlated compositional data with observed zero counts","243103533":"Une nouvelle construction de champs Gaussiens à partir de chaînes de Markov","13404574":"A Markov Chain Monte Carlo EM Algorithm for Analyzing Interval-Censored Data under the Cox Proportional Hazards Model","227617986":"Three-dimensional Bayesian image analysis and confocal microscopy","267144888":"Structuring Correlation within Hierarchical Spatio-temporal Models for Disease Rates","256661016":"Bayesian Growth Curves Using Normal Mixtures With Nonparametric Weights","242391847":"Markov Chain Monte Carlo Methods in Molecular Computing","50999901":"Turning the Bayesian Crank","4744465":"Estimation of the Head Sensitivity Function in Scanning Magnetoresistance Microscopy","238398319":"Assessing Psychiatric Morbidity from Community Registers: Methods for Bayesian Adjustment","220603512":"Positron emission tomography by Markov chain Monte Carlo with auxiliary variables","276100372":"Discussion: Statistical Cluster Detection, Epidemiologic Interpretation, and Public Health Policy","24418326":"Predictive Model Assessment for Count Data","258382340":"Investigation of a Stochastic Inverse Method to Estimate an External Force: Applications to a Wave-Structure Interaction","46551973":"Do Buyers’ Characteristics and Personal Relationships Affect Agricultural Land Prices?","230815909":"Assessing variance components of general circulation model output fields","233433231":"Bayesian smoothing with occasional jumps","41562908":"Bayesian estimation of marker dosage in sugarcane and other autopolyploids","5127460":"Simultaneous probability statements for Bayesian P-splines","227651837":"Phase randomization: A convergence diagnostic test for MCMC","225081349":"Coupled MCMC with a randomized acceptance probability","222394417":"Estimation and visualization of confusability matrices from adaptive measurement data","227764450":"Analysis of Competing Risks by Using Bayesian Smoothing","263671491":"Bayesian analysis of measurement error models using integrated nested Laplace approximations","2930010":"Hierarchical Bayesian Models for Inverse Problems in Heat Conduction","11266524":"Test–retest reliability estimation of functional MRI Data","2747729":"Hierarchical Spatio-Temporal Mapping of Disease Rates","279394783":"An Introduction to Monte Carlo Methods for Bayesian Data Analysis","259204619":"Semiparametric Bayesian Commensurate Survival Model for Post-Market Medical Device Surveillance with Non-Exchangeable Historical Data","225775628":"Implementing random scan Gibbs samplers","11912655":"The Use of Mixture Models for Identifying High Risk in Disease Mapping","227727593":"Simultaneous Credible Bands for Latent Gaussian Models","266719896":"Goodness-of-Fit Tests and Model Validity","226118906":"Are there still things to do in Bayesian statistics?","2501030":"A comparison of Bayesian and likelihood-based methods for fitting multilevel models","256374469":"Nonparametric vector autoregressions: Specification, estimation, and inference","257017555":"Simultaneous confidence intervals for multiple comparisons among expected values of log-normal variables","228813863":"The regression analysis of correlated interval-censored data: Review of accelerated failure time models with flexible distributional assumptions","5139914":"Age-period-cohort decomposition of aggregate data: An application to US and Japanese household saving rates","257908443":"Evaluation of the feasibility of recovering the magma chamber’s parameters by 3D Bayesian statistical inversion of synthetic MT data","11924797":"Bayesian Nonparametric Modeling Using Mixtures of Triangular Distributions","8007156":"Bayesian Decomposition Analysis of Bacterial Phylogenomic Profiles","225372414":"Bayesian latent variable models for spatially correlated tooth-level binary data in caries research","258066160":"The Impact of Spatial Scales and Spatial Smoothing on the Outcome of Bayesian Spatial Model","225797350":"Nonparametric Bayesian Image Segmentation","14070083":"Large Hierarchical Bayesian Analysis of Multivariate Survival Data","24083696":"Describing the Dynamics of Attention to TV Commercials: A Hierarchical Bayes Analysis of the Time to Zap an Ad","223415537":"Bayesian adaptive estimation: The next dimension","266194553":"Simultaneous Inference in Risk Assessment; a Bayesian Perspective","7696861":"Probabilistic Segmentation and Intensity Estimation for Microarray Images","51888829":"Sampling decomposable graphs using a Markov chain on junction trees","51190439":"Dynamic linear model analysis of optical imaging data acquired from the human neocortex","242081734":"Space - Time modelling of lightning-caused ignitions in the Blue Mountains, Oregon","24052959":"Bayesian hierarchical linear mixed models for additive smoothing splines","227763235":"Spatio-temporal models for large-scale indicators of extreme weather. Environmetrics","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","261096996":"Overlapping Clustering with Sparseness Constraints","2771356":"Statistical Ideas for Selecting Network Architectures","24065241":"Assessing probabilistic forecasts of multivariate quantities, with applications to ensemble predictions of surface winds","243102663":"Markov Chain Monte Carlo in Stastical Mechanics","2469278":"Inversion Based on Computational Simulations","255249035":"Computationally efficient Bayesian inference for inverse problems","227785810":"Coleman, M. C. \u0026 Block, D. E. Bayesian parameter estimation with informative priors for nonlinear systems. AIChE J. 52, 651-667","2900463":"A Computational Feature Binding Model of Human Texture Perception","40453039":"Bayesian inference for generalized linear models. Biostatistics, 11, 397-412","6885806":"Effectiveness of tibolone on the reduction of menopausal problems - A Bayesian semi-parametric interpretation","222550155":"Generalized linear mixed model with a penalized Gaussian mixture as a random effects distribution","227661917":"Green, P.J.: On Bayesian analysis of mixtures with an unknown number of components (with discussion). J. Roy. Stat. Soc. B. 59, 731-792","263352958":"The choice of spatial scales and spatial smoothness priors for various spatial patterns","261013059":"Two-dimensional probabilistic inversion of plane-wave electromagnetic data: Methodology, model constraints and joint inversion with electrical resistivity data","227222597":"Bayesian Decomposition","284271905":"Spatio-Temporal Hierarchical Models for Analyzing Atlanta Pediatric Asthma ER Visit Rates","229793891":"Non‐Parametric Ecological Regression and Spatial Variation","276030882":"Linear mixed models for multiple outcomes using extended multivariate skew-$t$ distributions","46537493":"Approximate Bayesian Inference for Latent Gaussian Models by Using Integrated Nested Laplace Approximations","51953356":"Issues in Designing Hybrid Algorithms","38363029":"Convergence Control Methods for Markov Chain Monte Carlo Algorithms","223528078":"Adaptive autoregressive priors for area and time structured mortality data","285355231":"Subjective and Objective Bayesian Statistics: Principles, Models, and Applications, Second Edition","2746825":"Hierarchical Bayesian Time Series Models","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","220226754":"Simulation-based methods for blind maximum-likelihood filter identification","227450988":"MCMCpack: Markov chain Monte Carlo in R","291387581":"Bayesian estimation of the dynamics of pandemic (H1N1) 2009 influenza transmission in Queensland: A space–time SIR-based model","37459934":"Two-Dimensional Quasi-Linear Evolution of the Electron-Beam-Plasma Instability","3318229":"A Bayesian approach to characterizing uncertainty in inverse problems using coarse and fine-scale information","50903782":"Bayesian estimation for percolation models of disease spread in plant populations","224843913":"Linking process to pattern: Estimating spatiotemporal dynamics of a wildlife epidemic from cross-sectional data","222435506":"A Markov random field model of contamination source identification in porous media flow","11594052":"Bayesian Modeling of the Level and Duration of Fertility in the Menstrual Cycle","2817500":"Non-Stationary Spatial Modeling","282625312":"Genetic correlation of traits measured by ultrasound at yearling and 18 months of age in Nellore beef cattle","5537193":"A Bayesian hierarchical model for the estimation of two incomplete surveillance data sets","283936017":"Oscillation of Metropolis-Hastings and simulated annealing algorithms around LASSO estimator","226203513":"Bayesian Decomposition Analysis of Gene Expression in Yeast Deletion Mutants","284864254":"Bayesian Simultaneous Intervals for Small Areas: An Application to Variation in Maps","229928881":"Bayesian image decomposition applied to relaxographic imaging","258647404":"Stochastic inversion of magnetotelluric data using a sharp boundary parameterization and application to a geothermal site","220286766":"A flexible statistical and efficient computational approach to object location applied to electrical tomography","238879788":"Simultaneous Posterior Probability Statements From Monte Carlo Output","220325685":"Bayesian deconvolution of noisy filtered point processes.","33028076":"Modeling Transport Mode Decisions Using Hierarchical Binary Spatial Regression Models with Cluster Effects","229447606":"Fast Bayesian approach for parameter estimation","2355775":"A Tutorial on Reversible Jump MCMC with a View toward Applications in QTL-mapping","228625281":"Estimation of Semiparametric Models in the Presence of Endogeneity and Sample Selection","226757543":"A guided walk Metropolis algorithm","279367297":"Applied Spatial Data Analysis with R","10783373":"Exploring heterogeneity in tumour data using Markov chain Monte Carlo","226086739":"Fast music spectrum peak search VIA Metropolis-Hastings sampler","6013559":"Time-domain Bayesian detection and estimation of noisy damped sinusoidal signals applied to NMR spectroscopy","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","227951527":"Likelihood Inference for Gibbs Processes in the Analysis of Spatial Point Patterns*","263607687":"Analysis of bivariate binary data with possible chances of wrong ascertainment","229760901":"Theory \u0026 Methods: An Analysis of Two‐Dimensional Agricultural Field Trials in the Presence of Outliers and Fertility Jumps","266218987":"Calibration for Simultaneity: (Re)Sampling Methods for Simultaneous Inference with Applications to Function Estimation and Functional Data","4743807":"Statistical Interpretation of Species Composition","11018897":"Bayesian Analysis of Population PK/PD Models: General Concepts and Software","51298611":"A Metropolis Monte Carlo Implementation of Bayesian Time-Domain Parameter Estimation: Application to Coupling Constant Estimation from Antiphase Multiplets","227702703":"Analyzing the Relationship Between Smoking and Coronary Heart Disease at the Small Area Level: A Bayesian Approach to Spatial Modeling","2314854":"A Method For Approximate Fully Bayesian Analysis Of Parameters","258385184":"Nonlinear Damping Identification in Nonlinear Dynamic System Based on Stochastic Inverse Approach","232743832":"A Generalized Polynomial Chaos-Based Method for Efficient Bayesian\nCalibration of Uncertain Computational Models","255556976":"Isotropic multiresolution analysis for 3D-textures and applications in cardiovascular imaging - art. no. 67011S","13497985":"Flexible Bayesian Modelling for Survival Data","257196313":"Hit-And-Run enables efficient weight generation for simulation-based multiple criteria decision analysis","2651751":"Discrete Morphological Size Distributions and Densities: Estimation Techniques and Applications","242939947":"Bayesian Mapping of Lichens Growing on Trees","4902430":"A full-factor multivariate GARCH model","237098103":"Spatial moving average risk smoothing","257535247":"Bayesian age-period-cohort models with versatile interactions and long-term predictions: Mortality and population in Finland 1878-2050","225942304":"Statistical approaches in quantitative positron emission tomography","226809823":"A Comparison of Two Sequential Metropolis-Hastings Algorithms with Standard Simulation Techniques in Bayesian Inference in Reliability Models Involving a Generalized Gamma Distribution","229552112":"Bayesian analysis of the multivariate geographical distribution of the socio‐economic environment in England","41719836":"Bayesian 2D Deconvolution: A Model for Diffuse Ultrasound Scattering","228988870":"Sampling for Bayesian Computation with Large Datasets","227646449":"Bayesian model selection for D‐vine pair‐copula constructions","225873687":"Genes Associated with Prognosis in Adenocarcinoma Across Studies at Multiple Institutions","225334031":"A Hierarchical model for the analysis of spatial rainfall extremes","265702835":"Counting Degrees of Freedom in Hierarchical and Other Richly-Parameterised Models","257479997":"Modelling small-area inequality in premature mortality using years of life lost rates","272524884":"Restricted spatial regression in practice: geostatistical models, confounding, and robustness under model misspecification: SPATIAL CONFOUNDING IN GEOSTATISTICAL MODELS","228885448":"Modeling Traffic Crash-Flow Relationships for Intersections: Dispersion Parameter, Functional Form, and Bayes Versus Empirical Bayes Methods","23633671":"Compatibility conditions for a set of conditional Gaussian distributions","238879820":"Semiparametric Modeling and Estimation of Instrumental Variable Models","2645594":"Modelling Heterogeneity With and Without the Dirichlet Process","220309330":"Estimation for Restriction Sites Observed by Optical Mapping Using Reversible-Jump Markov Chain Monte Carlo","225574658":"Spatio-temporal patters in county-level incidence and reporting of Lyme disease in the northeastern United States, 1990–2000","226094860":"Statistical inference and Monte Carlo algorithms","26856431":"A Sequential Monte Carlo Method for Bayesian Analysis of Massive Datasets","227734506":"New Challenges in Integrated Water Quality Modeling","274764315":"Bayesian data analysis for agricultural exper","226367232":"WinBUGS—A Bayesian Modelling Framework: Concepts, Structure, and Extensibility","263688501":"Analysis of binary data with the possibility of wrong ascertainment","227687191":"A Hierarchical Bayesian Model to Predict the Duration of Immunity to Haemophilus Influenzas Type B","221089706":"Counter-Examples for Bayesian MAP Restoration","225760243":"Forecasting interest rates volatilities by GARCH (1,1) and stochastic volatility models","274897642":"Statistical Modeling of the Abundance of Vectors of West African Rift Valley Fever in Barkédji, Senegal","225442788":"Spatial Hierarchical Modeling of Precipitation Extremes From a Regional Climate Model","262358312":"Bayesian learning of finite generalized inverted Dirichlet mixtures: Application to object classification and forgery detection","227055367":"The Joy of Sampling","4788953":"On Block Updating in Markov Random Field Models for Disease Mapping","260417809":"Multivariate receptor models and model uncertainty","5468868":"Small area random effects models for capture/recapture methods with applications to estimating coverage error in the US Decennial Census","229880620":"Bayesian Estimation of Hunting Success Rate and Harvest for Spatially Correlated Post‐stratified Data","3317394":"Joint Bayesian detection and estimation of noisy sinusoids via reversible jump MCMC","7893727":"Reliability estimation of grouped functional imaging data using penalized maximum likelihood","254212495":"Sensitivity analysis in Bayesian generalized linear mixed models for binary data","10600971":"Spatial modeling of multinomial data with latent structure; an application to geographical mapping of human gene and haplotype frequencies. Biostatistics 1: 177-189","33027928":"Semiparametric Analysis of the Socio-Demographic and Spatial Determinants of Undernutrition in Two African Countries","227276601":"An Introduction to MCMC for Machine Learning","222686195":"Using Bayesian statistics in the estimation of heat source in radiation","220914577":"MCMC-Based Algorithm to Adjust Scale Bias in Large Series of Electron Microscopical Ultrathin Sections","284076626":"A Spatial Latent Gaussian Model for Intimate Partner Violence Against Men in Africa","233284389":"Comparison of three-dimensional profiles over time","263144808":"Model-Based Estimation of Unemployment Rates in Small Areas of Portugal","283516462":"An enhanced model for the simulation of infrared sea-surface and land-based clutter and its applications","3316474":"Bayesan estimation of parameters of a damped sinusoidal model by a Markov chain Monte Carlo method","33027903":"Semiparametric Bayesian Time-Space Analysis of Unemployment Duration","227511108":"Semiparametric Spatio-Temporal Frailty Modeling","35038426":"Nonparametric estimation of discontinuous regression functions /","227719006":"Optimal scaling of Metropolis algorithms: Heading toward general target distributions","231049995":"Revised and Extended Analysis of Eight-times Ionized Barium: Ba IX and Nine-times Ionized Barium: Ba X","258161074":"Can CDS indexes signal future turmoils in the stock market? A Markov switching perspective","220227574":"A Bayesian approach to harmonic retrieval with clipped data","7985816":"Multivariate Parametric Spatiotemporal Models for County Level Breast Cancer Survival Data","229752658":"Markov Chain Monte Carlo","4772524":"Binary probability maps using a hidden conditional autoregressive Gaussian process with an application to Finnish common toad data","225874846":"Bayesian Hierarchical Space–time Modeling of Earthquake Data","43518070":"A Bayesian solution to reconstructing centrally censored distributions","253742574":"Bayesian inference and Markov chain Monte Carlo in imaging","24083358":"Bayesian modelling of spatial compositional data. J Appl Stats","229361498":"Predictive modeling of a radiative shock system","31327020":"Computational complexity of Markov chain Monte Carlo methods for finite Markov random fields","24083355":"Spatial modelling of gene frequencies in the presence of undetectable alleles","2504414":"Improved Convergence of Gradient-Based Reconstructions Using Multiscale Models","227731306":"Confocal fluorescence microscopy of leaf cells: An application of Bayesian image analysis","225860489":"A process-convolution approach to modelling temperatures in the North Atlantic Ocean (Disc: P191-192)","227718802":"Bayesian Spatial Survival Models for Political Event Processes","2455335":"Phase transition and simulation for a penalized Ising model with applications in image analysis","251574779":"On the reconstruction of structural and functional properties in random heterogeneous media","220286503":"Estimating and testing zones of abrupt change for spatial data","2693921":"Hierarchical Bayesian Space-Time Models","6899556":"Bayesian spatio-temporal analysis of joint patterns of male and female lung cancer risks in Yorkshire (UK)","4772679":"Statistical image analysis for a confocal microscopy two-dimensional section of cartilage growth","13496301":"Modelling Risk from a Disease in Time and Space","13496300":"Spatio-Temporal Models with Errors in Covariates: Mapping Ohio Lung Cancer Mortality","227123883":"Identifying Carriers of a Genetic Modifier Using Nonparametric Bayesian Methods","44902794":"Smoothed ANOVA with spatial effects as a competitor to MCAR in multivariate spatial smoothing","26333885":"Geographical clustering of lung cancer in the province of Lecce, Italy: 1992–2001","14491635":"Spatial variation of natural radiation and childhood leukaemia incidence in Great Britain","14296052":"A statistical model of transmission of Hib bacteria in a family. Stat Med","220728858":"Hierarchical Annealing for Random Image Synthesis","257199206":"Clustering gene expression time course data using mixtures of multivariate t-distributions","229774980":"A Bayesian criterion for simplicity in inverse problem parametrization","2351898":"Bayesian Modeling of Inseparable Space–Time Variation in Disease Risk","220286495":"Robust variance estimators for fixed-effect estimates with hierarchical-likelihood","29654663":"Bridging the Gap between Different Statistical Approaches: An Integrated Framework for Modelling","285252165":"Surrogate-assisted Bayesian inference inverse material identification method and application to advanced high strength steel","220056152":"Bayesian analysis of the patterns of biological susceptibility via reversible jump MCMC sampling","51527765":"DPpackage: Bayesian Non- and Semi-parametric Modelling in R.","278748118":"Conditional and Intrinsic Autoregressions","230748816":"The development of an early warning system for climate-sensitive disease risk with a focus on dengue epidemics in Southeast Brazil","4742938":"Bayesian Accelerated Failure Time Model With Multivariate Doubly Interval-Censored Data and Flexible Distributional Assumptions","224246280":"Langevin and Hessian with Fisher approximation stochastic sampling for parameter estimation of structured covariance","279373819":"Regression","254287947":"Transmission of Pneumococcal Carriage in Families: A Latent Markov Process Model for Binary Longitudinal Data","258773007":"2D stochastic inversion of radio magnetotelluric and electrical resistivity tomography data: the importance of model regularization","288713302":"The Longevity of Lava Dome Eruptions","227464936":"Bayesian Inference for Multivariate Copulas Using Pair-Copula Constructions","30045859":"Optimal Scaling for Random Walk Metropolis on Spherically Constrained Target Densities","4742946":"Computer Model Calibration Using High-Dimensional Output","229873374":"Parsimonious Bayesian Markov Chain Monte Carlo inversion in a nonlinear geophysical problem","264968357":"The roles of conditioning in inference. With comments and rejoinder","263943374":"Review of Monte Carlo Methods for the Prediction of Distributed Molecular and Morphological Polymer Properties","243768830":"Computing Bayes Factors by Combining Simulation and Asymptotic Approximations","245134817":"A Markov chain Monte Carlo inverse procedure for radioactive contaminant transport in fractured rock: 2. Inverse model","238230860":"Back-calculating the age-specific incidence of recurrent subclinicalHaemophilus influenzae type b infection","227117814":"Zero-Inflated Models with Application to Spatial Count Data","220554919":"Potential approach in marginalizing Gibbs models","220286627":"Bayesian fractional polynomials","243448065":"Probabilistic small area risk assessment using GIS-based data: a case study on Finnish childhood diabetes","288296617":"Disease Mapping Using Bayesian Hierarchical Models","13513545":"Estimation for Restriction Sites Observed by Optical Mapping Using Reversible-Jump Markov Chain Monte Carlo","239059384":"Prior Distributions on Measure Space","247151921":"Spatial Regression Modeling for Compositional Data With Many Zeros","2470839":"Bayesian Image Classification with Baddeley\u0027s Delta Loss","248799558":"Lithologic tomography: From plural geophysical data to lithology estimation","236878221":"Spatio-temporal hierarchical models for mapping relative risks of dengue in the Municipality of Girardot, Aragua State, Venezuela","263230501":"Accounting for Response Misclassification and Covariate Measurement Error Using a Random Effects Logit Model","265425988":"Edge-Preserving Smoothers for Image Processing","7321592":"Disease cluster detection: A critique and a Bayesian proposal","263557165":"Hierarchical Bayes GLMs for the analysis of spatial data: An application to disease mapping","232396353":"Mixtures of modified t-factor analyzers for model-based clustering, classification, and discriminant analysis","222298844":"Optimal acceptance rates for Metropolis algorithms: Movin beyond 0.234","226046683":"Langevin-Type Models I: Diffusions with Given Stationary Distributions and their Discretizations*","227318312":"A comparison of methods for spatial relative risk mapping of human neural tube defects","4741090":"Bayesian Analysis of a Multinomial Sequence and Homogeneity of Literary Style","2257801":"Bayesian inference for ion channel gating mechanisms directly from single channel recordings, using Markov chain Monte Carlo","228355639":"Analysis of Additive Instrumental Variable Models","46541165":"Spatial dependence in agricultural land prices: Does it exist?","261834807":"Improved convergence of gradient-based reconstruction using multi-scale models","229672476":"Prediction of Growth: A Hierarchical Bayesian Approach","31373939":"Bounding the convergence time of the Gibbs sampler in Bayesian image restoration","228615697":"Bayesian function estimation using continuous wavelet dictionaries","225122009":"Jump-preserving surface reconstruction from noisy data","235924920":"Model-based clustering, classification, and discriminant analysis via mixtures of multivariate t-distributions: The tEIGEN family","242997699":"Robust generalized linear mixed models for small area estimation","268066883":"Nonlinear Goal-Oriented Bayesian Inference: Application to Carbon Capture and Storage","220286619":"Slice Gibbs sampling for simulation based fitting of spatial models","220286618":"Metropolis-Hastings algorithms with adaptive proposals","2241439":"General over-relaxation Markov chain Monte Carlo algorithms for Gaussian densities","227686996":"Non‐parametric Bayesian Estimation of a Spatial Poisson Intensity","238337528":"The Bayes Inference Engine","220286700":"Bayesian analysis of nonlinear and non-Gaussian state space models via multiple-try sampling methods","282848020":"Best practices for the provision of prior information for Bayesian stock assessment","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","231132703":"Cosmic Calibration","291261119":"Introduction to Metropolis, Rosenbluth, Rosenbluth, Teller, and Teller (1953) Equations of State Calculations by Fast Computing Machines. J. Chem. Phys.,21, 1087–1092. and Geman and Geman (1984) Stochastic Relaxation, Gibbs Distributions, and the Bayesian Restoration of Images. IEEE Trans. Pattern Anal. Machine Intelligence,6, 721–741.","225248910":"Maximum Likelihood from Spatial Random Effects Models via the Stochastic Approximation Expectation Maximization Algorithm","228657732":"Bayesian Thinking in Spatial Statistics","227991152":"Spatial Econometrics","257165491":"Bayesian estimation ofg-and-k distributions using MCMC","4744096":"Pay Phones, Parking Meters, Vending Machines, and Optimal Bayesian Decisions on Collection Times","24008326":"Spatial stochastic frontier models: Accounting for unobserved local determinants of inefficiency","229766744":"A Loss Function Model for the Restoration of Grey Level Images","216027920":"A Markov random field spatio-temporal analysis of ocean temperature","264974395":"Multimodal Brain-Tumor Segmentation Based on Dirichlet Process Mixture Model with Anisotropic Diffusion and Markov Random Field Prior","23464594":"A Multinomial-Dirichlet Model for Analysis of Competing Hypotheses","12532551":"Localization of a Quantitative Trait Locus via a Bayesian Approach","220286682":"Approximations for Gibbs Distribution Normalising Constants","222539455":"‘Tropical deforestation in Madagascar: Analysis using hierarchical, spatially explicit Bayesian regression models’"},"index":77}