{"abs":"Multiobjective evolutionary algorithms (MOEAs) have shown to be effective in solving a wide range of test problems. However, it is not straightforward to apply MOEAs to complex real-world problems. This paper discusses the major challenges we face in applying MOEAs to complex structural optimization, including the involvement of time-consuming and multi-disciplinary quality evaluation processes, changing environments, vagueness in formulating criteria formulation, and the involvement of multiple sub-systems. We propose that the successful tackling of all these aspects give birth to a systems approach to evolutionary design optimization characterized by considerations at four levels, namely, the system property level, temporal level, spatial level and process level. Finally, we suggest a few promising future research topics in evolutionary structural design that consist in the necessary steps towards a life-like design approach, where design principles found in biological systems such as self-organization, self-repair and scalability play a central role.","title":"A systems approach to evolutionary multiobjective structural optimization and beyond","id":224570930,"url":"https://www.researchgate.net/publication/224570930_A_systems_approach_to_evolutionary_multiobjective_structural_optimization_and_beyond","names":["Yaochu Jin","Bernhard Sendhoff","IEEE Computational Intelligence Magazine"],"references":{"268887300":"Knowledge incorporation in evolutionary computation","220701732":"Multi-cellular Development: Is There Scalability and Robustness to Gain?","224049497":"Evolutionary Optimization of Computationally Expensive Problems via Surrogate Modeling","220693024":"Evolutionary and adaptive computing in engineering design.","222702934":"Robust optimization – A comprehensive survey","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","11440826":"Self-Assembly at All Scales","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","220694079":"The Nurbs Book","235709973":"Representations for Genetic and Evolutionary Algorithms","225869931":"Modeling Regularity to Improve Scalability of Model-Based Multiobjective Optimization Algorithms","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","246122676":"Evolutionary optimization in uncertain environments","3418902":"Efficient search for robust solutions by means of evolutionary algorithms and fitness approximation","220740621":"On Evolutionary Optimization with Approximate Fitness Functions.","226106204":"On Model-Based Evolutionary Computation","221228550":"A Two-Phase Local Search for the Biobjective Traveling Salesman Problem","221228549":"Trade-Off between Performance and Robustness: An Evolutionary Multiobjective Approach","216300751":"The Dead State: A comparison between developmental and direct encodings.","4375919":"An Evolutionary System using Development and Artificial Genetic Regulatory Networks","221228545":"Visualization and Data Mining of Pareto Solutions Using Self-Organizing Map","220701973":"Creating Robust Solutions by Means of Evolutionary Algorithms.","216301009":"Estimation Distribution Algorithms: A New Tool for Evolutionary Computation","266035939":"Multi-Objective Machine Learning. Springer","220176678":"Structure optimization of neural networks for evolutionary design optimization","224330083":"Evolutionary Many-Objective Optimization: A Short Review","245586334":"Modular Self-reconfigurable Robot Systems: Challenges and Opportunities for the Future","227315377":"Representing the Change - Free Form Deformation for Evolutionary Design Optimization","220693604":"Evolutionary Optimization in Dynamic Environments","2999915":"What is evolutionary computation?","227308486":"The development of a dual-agent strategy for efficient search across whole system engineering design hierarchies","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","3903863":"Adaptive encoding for aerodynamic shape optimization using evolution strategies","3418745":"Balance between genetic search and local search in memetic algorithms for multiobjective permutation flowshop scheduling. IEEE Trans Evol Comput","220356207":"Experiments Of Morphogenesis In Swarms Of Simple Mobile Robots.","222403349":"Zhang J. Evolution by gene duplication. Trends Ecol Evol 18: 292-298","6149897":"Innovation and robustness in complex regulatory networks","242712099":"The Self-Made Puzzle: Integrating Self-Assembly and Pattern Formation Under NonRandom Genetic Regulation","225635375":"Integrating generative growth and evolutionary computation for form exploration","225448986":"Real-Coded Adaptive Range Genetic Algorithm Applied to Transonic Wing Optimization","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","264938682":"Effect of Endwall Contouring on Performance of Ultra-Low Aspect Ratio Transonic Turbine Inlet Guide Vanes","233885573":"Dynamic weighted aggregation for evolutionary multi-objective optimization: Why does it work and how?","224645909":"Robustness Analysis in Multi-Objective Optimization Using a Degree of Robustness Concept","220286038":"On Growth, Form and Computers","221228630":"multi-Multi-Objective Optimization Problem and Its Solution by a MOEA","221228629":"Distributed Computing of Pareto-Optimal Solutions with Evolutionary Algorithms","245355038":"Effect of End Wall Contouring on Performance of Ultra-Low Aspect Ratio Transonic Turbine Inlet Guide Vanes","221007790":"Global Shape with Morphogen Gradients and Motile Polarized Cells","245357080":"Hydraulic Turbine Diffuser Shape Optimization by Multiple Surrogate Model Approximations of Pareto Fronts","227090446":"Haftka, R.T.: Multidisciplinary aerospace design optimization: Survey of recent developments. Structural Optimization 14, 1-23","228453399":"Evaluation of Injection Island GA Performance on Flywheel Design Optimisation","233790308":"The Role of Mutation and Recombination in Evolutionary Algorithms","240821719":"Quality Measures for Approximate Models in Evolutionary Computation","10622768":"A Taxonomy for Artificial Embryogeny","225256958":"Direct Manipulation of Free Form Deformation in Evolutionary Design Optimisation","269024925":"Element of Structural Optimisation","3344805":"Self-reconfigurable robots","220739506":"On The Dynamics Of Evolutionary Multi-objective Optimization.","4279261":"Pareto-based Multi-Objective Machine Learning","2615425":"Evolutionary Computation and Convergence to a Pareto Front","221604252":"Robust and Self-Repairing Formation Control for Swarms of Mobile Agents.","3418520":"Genetic algorithms with a robust solution searching scheme","233407300":"Applications of Multi-Objective Evolutionary Algorithms","222538483":"Real-coded adaptive range genetic algorithm applied to transonic wing optimization","2985886":"Interactive Evolutionary Computation: Fusion of the Capacities of EC Optimization and Human Evaluation. Proceedings of the IEEE 89:1275-1296","3419010":"RM-MEDA: A Regularity Model-Based Multiobjective Estimation of Distribution Algorithm","220742559":"Dynamic multi-objective optimization with evolutionary algorithms","242506700":"Evolutionary Computation in Dynamic and Uncertain Environments","220702109":"A Hierarchical Genetic Algorithm Using Multiple Models for Optimization","220739730":"Three dimensional evolutionary aerodynamic design optimization with CMA-ES","226495036":"A NURBS-Based Shape Optimization Method for Hydraulic Turbine Stay Vane","220742632":"A cellular model for the evolutionary development of lightweight material with an inner structure","220741610":"A study on metamodeling techniques, ensembles, and multi-surrogates in evolutionary computation","220701668":"Comparison of Steady-State and Generational Evolution Strategies for Parallel Architectures.","260975178":"Foundations of evolutionary computation","224453033":"Self-adaptive multi-robot construction using gene regulatory networks","216300590":"Metamodel—Assisted Evolution Strategies","216300853":"Evolutionary Optimization in Uncertain Environments---A Survey","221228539":"Prediction-Based Population Re-initialization for Evolutionary Dynamic Multi-objective Optimization.","4074983":"Connectedness, regularity and the success of local search in evolutionary multi-objective optimization","221228534":"Recombination of Similar Parents in EMO Algorithms","261288779":"Developmental Biology","222914963":"Efficient Hierarchical Parallel Genetic Algorithms using Grid computing","4249755":"The Evolution of Structural Design Through Artificial Embryogeny","227093096":"Ensemble of surrogates","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","231026977":"ChemInform Abstract: Challenges and Breakthroughs in Recent Research on Self-Assembly","220285899":"Inverse multi-objective robust evolutionary design","220121329":"Knowledge Extraction from Aerodynamic Design Data and its Application to 3D Turbine Blade Geometries","221162716":"On Evolutionary Optimization of Large Problems Using Small Populations","4375735":"Prediction of Convergence Dynamics of Design Performance using Differential Recurrent Neural Networks","4253878":"Evolutionary Algorithms in the Presence of Noise: To Sample or Not to Sample","225583755":"Individual-based Management of Meta-models for Evolutionary Optimization with Application to Three-Dimensional Blade Optimization","220176614":"Faster convergence by means of fitness estimation","225260695":"Dynamic Multi-objective Optimization and Decision-Making Using Modified NSGA-II: A Case Study on Hydro-thermal Power Scheduling","224301730":"Target shape design optimization by evolving splines","4074688":"Evolutionary multi-objective optimisation with a hybrid representation"},"citedIn":{"234114934":"Gardening Cyber-Physical Systems","47335764":"Emergence of robust regulatory motifs from in silico evolution of sustained oscillation","260622144":"Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering","273229696":"Enhancing the scalability of multi-objective optimization via restricted Boltzmann machine-based estimation of distribution algorithm","221008098":"An investigation on sampling technique for multi-objective restricted Boltzmann machine","271495486":"Solution clustering analysis in brain storm optimization algorithm","221006462":"Incremental approximation of nonlinear constraint functions for evolutionary constrained optimization.","224133518":"Multiobjective evolutionary structural optimization for system identification and controller design","250613411":"Particle Swarm Optimization based Semi-Supervised Learning on Chinese Text Categorization","253348620":"A Grid-Based Evolutionary Algorithm for Many-Objective Optimization","262328308":"An evolution strategy assisted by an ensemble of local Gaussian process models","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","274706503":"An Evolutionary Approach with Surrogate Models and Network Science Concepts to Design Optical Networks","276420898":"Analytics on Fireworks Algorithm Solving Problems with Shifts in the Decision Space and Objective Space","280225064":"Swarm Intelligence in Big Data Analytics","280631909":"Online Diversity Assessment in Evolutionary Multiobjective Optimization: A Geometrical Perspective","224170493":"Diversity Improvement by Non-Geometric Binary Crossover in Evolutionary Multiobjective Optimization","235903469":"Evolutionary Approaches to Expensive Optimisation","280555483":"Population Diversity Based Study on Search Information Propagation in Particle Swarm Optimization","260583851":"An Intelligent Self-Organization Scheme for the Internet of Things","271509065":"Large-Scale Global Optimization via Swarm Intelligence","261460605":"Evolutionary truss layout optimization using the vectorized structure approach","285594735":"Big Data Analytics with Swarm Intelligence","261302712":"Two-objective solution set optimization to maximize hypervolume and decision space diversity in multiobjective optimization","257779632":"A framework for finding robust optimal solutions over time","220701896":"Many-Objective Test Problems to Visually Examine the Behavior of Multiobjective Evolution in a Decision Space","260583847":"Evolutionary Complex Engineering Optimization: Opportunities and Challenges [Guest Editorial]","223648868":"An investigation on noise-induced features in robust evolutionary multi-objective optimization","283667352":"Big data analysis based on mathematical model: A comprehensive survey","250614083":"Population Diversity Based Study on Search Information Propagation in Particle Swarm Optimization","261159332":"Redundancy creates opportunity in developmental representations","220438359":"Multiobjective Synthesis of Six-Bar Mechanisms Under Manufacturing and Collision-Free Constraints","6532182":"Functional brain imaging with BOSS FMRI","257403488":"Exploiting molecular dynamics for multi-objective optimization","261430381":"Recurrent neural network ensembles for convergence prediction in surrogate-assisted evolutionary optimization","221006935":"Structure and parameter identification of nonlinear systems with an evolution strategy","271482645":"Examples initialization in Chinese text categorization"},"index":776}