{"abs":"The Cross Entropy algorithm is a new search method for combinatorial problem. However, it needs considerable com- putational time to achieve good solution quality. To make the Cross Entropy algorithm faster, this paper proposes a leader-based cooperative parallel algorithm. Unlike the widely used coarse-grained parallelization strategy, our meth- od has a leader , which can move around freely, and several controlled followers. To evaluate the performance of the al- gorithm, we implement our algorithm using OpenMPI on MIMD architecture, and has applied it on 25 selected MCP benchmark problems. The speedup and efficiency is ana- lyzed, and the results obtained are compared with those ob- tained by four other best heuristic algorithms, GLS , Edge- AC+LS, EA/G and RLS.","title":"A leader-based parallel cross entropy algorithm for MCP","id":220740737,"url":"https://www.researchgate.net/publication/220740737_A_leader-based_parallel_cross_entropy_algorithm_for_MCP","names":["Zhanhua Bai","Qiang Lv"],"references":{"228940071":"Cross-Entropy Method","2504292":"The Maximum Clique Problem","8639297":"A Graph Theoretical Approach to Predict Common RNA Secondary Structure Motifs Including Pseudoknots in Unaligned Sequences","2598434":"Parallelization Strategies for the Ant System","5589170":"Ant System: Optimization by a colony of cooperating agents. IEEE Trans Syst Man Cybernetics - Part B","12345339":"Combinatorial Approaches to Finding Subtle Signals in DNA Sequences","227120673":"Reactive Local Search for the Maximum Clique Problem1","2362670":"A Survey of Parallel Genetic Algorithms","2484042":"The Cross-Entropy Method for Combinatorial and Continuous Optimization","222819543":"An effective local search for the maximum clique problem","228579310":"Combining swaps and node weights in an adaptive greedy approach for the maximum clique problem","220379953":"Parallel Simulated Annealing Algorithms","242356870":"Adaptation In Natural And Artificial Systems","244439781":"Reducibility among Combinatorial Problems In Complexity of Computer Compu-tations","222407700":"A New Trust Region Technique for the Maximum Weight Clique Problem","221580898":"Reducibility Among Combinatorial Problems","3418828":"An Evolutionary Algorithm With Guided Mutation for the Maximum Clique Problem","222859184":"A parallel simulated annealing algorithm","29463736":"Dynamic Local Search for the Maximum Clique Problem","220045412":"Adoption in Natural and Artificial System","225123313":"A study of ACO capabilities for solving the maximum clique problem","227134964":"Combining Swaps and Node Weights in an Adaptive Greedy Approach for the Maximum Clique Problem","220866932":"Genetic, Iterated and Multistart Local Search for the Maximum Clique Problem","259481321":"Parallelization Strategies for the Ant System"},"citedIn":{},"index":778}