{"abs":"The use of the Gibbs sampler for Bayesian computation is reviewed and illustrated in the context of some canonical examples. Other Markov chain Monte Carlo simulation methods are also briefly described, and comments are made on the advantages of sample-based approaches for Bayesian inference summaries.","title":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","id":242407089,"url":"https://www.researchgate.net/publication/242407089_Bayesian_Computation_Via_the_Gibbs_Sampler_and_Related_Markov_Chain_Monte_Carlo_Methods","names":["AFM Smith","G. O. Roberts","Journal of the Royal Statistical Society. Series B: Methodological"],"references":{"244456594":"Convergence diagnostics of the Gibbs sampler","259014832":"Bayesian Computational Methods","242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","265672532":"Bayesian Inference for Generalized Linear and Proportional Hazards Models via Gibbs Sampling","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","200622065":"Equation of State Calculations by Fast Computing Machines","240205403":"Random polynomial time algorithms for sampling from joint distributions","238684341":"Estimating Normal Means with a Dirichlet Process Prior","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","241228851":"Tools for Statistical Inference: Observed Data and Data Augmentation Methods, Vol. 67 of Lecture Notes in Statistics","229624571":"Reparametrization aspects of numerical Bayesian methodology for autoregressive-moving average models","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","244475332":"On the Convergence of Successive Substitution Sampling","225304570":"Non-Uniform Random Variate Generation","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","239060448":"Bayesian Computations in Survival Models Via the Gibbs Sampler","38357609":"Markov Chains for Exploring Posterior Distributions","227103273":"Effcient generation of random variates via the ratio–of–uniforms method","31102905":"Nonparametric Bayesian Bioassay Including Ordered Polytomous Response","2599041":"How Many Iterations in the Gibbs Sampler?","229100480":"Statistical Analysis of Finite Mixture Distributions.John Wiley \u0026 Sons, New York","235361263":"Bayesian Statistics Without Tears: A Sampling-Resampling Perspective","243776875":"Spatial Statistics and Bayesian Computing","243775915":"Nonparametric Bayesian Bioassay with Prior Constraints on the Shape of the Potency Curve","235013231":"Bayesian Analysis of Constrained Parameter and Truncated Data Problems","245071851":"A single series from the Gibbs sampler provides a false sense of security","242505862":"General Irreducible Markov Chains and Non-Negative Operators","246189727":"Finding Spiral Structures in Images of Galaxies","230872692":"Sampling and Bayes\u0027 Inference in Scientific Modelling and Robustness","265429604":"Stochastic Simulation","226073479":"An iterative Monte Carlo method for nonconjugate Bayesian analysis","246844169":"Model determination using predictive distributions with implementation via sampling-based methods","243689785":"Illustration of Bayesian Inference in Normal Data Models Using Gibbs Sampling"},"citedIn":{"236176917":"Trans-dimensional inverse problems, model comparison and the evidence","13734106":"Using Coupling with the Gibbs Sampler to Assess Convergence in Animal Models","48210639":"A dynamic nonstationary spatio-temporal model for short term prediction\nof precipitation","14016708":"Balding DJ, Nichols RA. Significant genetic correlations among Caucasians at forensic DNA loci. Heredity 78: 583-589","243043944":"Markov models and Bayesian methods in image analysis","228388233":"Bayesian Output Analysis Program (BOA) Version 1.1 User\u0027s Manual","7800929":"The basic reproductive number of tick-borne encephalitis virus: An empirical approach","31123917":"Models for point processes observed with noise","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","13844680":"A Bayesian approach to Weibull survival models?Application to a cancer clinical trial","226596257":"Gibson, G. J. \u0026 Renshaw, E. Likelihood estimation for stochastic compartmental models using Markov chain methods. Statistics and Computing 11, 347-358","258903887":"Implementation of Gaussian Process models for nonlinear system identification","12019859":"Fitting the log-F Accelerated Failure Time Model with Incomplete Covariate Data","266309622":"Bayesian Analysis of Ring-Recovery Data Via Markov Chain Monte Carlo Simulation","2261001":"Estimating and Adjusting for Publication Bias Using Data Augmentation in Bayesian Meta-Analysis","222786934":"Bayesian marginal influence assessment","243775157":"Simulating Ratios of Normalizing Constants via a Simple Identity: A Theoretical Exploration","2834456":"Outperforming the Gibbs sampler empirical estimator for nearest neighbor random fields","264814590":"Separable Monte Carlo combined with importance sampling for variance reduction","11821186":"Bayesian Modeling of the Hemodynamic Response Function in BOLD fMRI","4771967":"Bayesian Analysis of Agricultural Field Experiments (with discussion)","2834451":"Alternating Subspace-Spanning Resampling to Accelerate Markov Chain Monte Carlo Simulation","233725392":"Functional Connectivity and Tuning Curves in Populations of Simultaneously Recorded Neurons","222813447":"Bayesian Poisson log-bilinear mortality projections","227841495":"Daniels, M. J. \u0026 Hughes, M. D. Meta-analysis for the evaluation of potential surrogate markers. Stat. Med. 16, 1965-1982","23564579":"Bayesian simultaneous equation analysis using reduced rank structures","222973197":"A Matrix Exponential Spatial Specification","7682104":"Bayesian Estimation of Diagnostic Tests Accuracy for Semi-Latent Data with Covariates","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","259178274":"Boundary reconstruction in binary images using splines","225162546":"Bayesian inference for clustered extremes","12900510":"A Bayesian approach to modelling the natural history of a chronic condition from observations with intervention","222299421":"On Monte Carlo Methods for Bayesian Inference","264484765":"Modelling Uncertainty in Preventive Maintenance Scheduling","38326824":"Bayesian Model Averaging: A Tutorial","249693827":"Bayesian Analysis of Event History Models with Unobserved Heterogeneity via Markov Chain Monte Carlo: Application to the Explanation of Fertility Decline","4720681":"Full bayesian inference for GARCH and EGARCH models","277946612":"Integrating geological prior information into the inverse gravimetric problem: the Bayesian approach","2625613":"BUGS - Bayesian inference Using Gibbs Sampling Version 0.50","13844661":"A flexible approach to time-varying coeficients in the Cox regression setting","259462941":"Rubbery Polya Tree","279185608":"Markov Chain Monte Carlo Algorithms for the Bayesian Analysis of Phylogenetic Trees","280912081":"Studies on Properties and Estimation Problems for Modified Extension of Exponential Distribution","258150163":"A Straightforward Approach to Markov Chain Monte Carlo Methods for Item Response Models","243047951":"Generalization of discrete-time geometric bounds to convergence rate of Markov processes on Rn","257550124":"Satellite data assimilation and estimation of a 3D coastal sediment transport model using error-subspace emulators","232144302":"Therapeutic Hypothermia: Quantification of the Transition of Core Body Temperature Using the Flexible Mixture Bent-Cable Model for Longitudinal Data","271857741":"Bayesian Methods in Actuarial Science","228816351":"Gibbs sampling in econometric practice","225393938":"Bayesian approach to analysing longitudinal bivariate binary data with informative dropout","2777175":"Sampling from Multimodal Distributions Using Tempered Transitions","13586506":"Bayesian optimal design in population models for haematologic data","38326989":"Computational Advances for and from Bayesian Analysis","226405880":"Random variate transformations in the Gibbs sampler: issues of efficiency and convergence","260407043":"Double ridges on Europa accommodate some of the missing surface contraction","270629030":"Bivariate Nonlinear Diffusion Degradation Process Modeling via Copula and MCMC","241270506":"The fringe patterns with high contrast in electronic speckle pattern interferometry by Monte Carlo Markov chain techniques","2359471":"Nonlinear and Non-Gaussian State-Space Modeling with Monte Carlo Techniques: A Survey and Comparative Study","2652325":"Applications Of Cheeger\u0027s Constant To The Convergence Rate Of Markov Chains On R n","262367022":"Texture analysis and simulations using Markov random field models","223170010":"Advances in the Research of Strategies and Methods for Analyzing Complex Traits","257642433":"A Bayesian analysis of suicide data","39424709":"Modelos multivariantes para variables ordinales: Aplicaciones en estudios de calidad de servicio","222408157":"Testing functional forms in energy modeling: An application of the Bayesian approach to U.S. electricity demand","223681995":"Extreme value modelling of hurricane wind speeds","227423530":"Partially exchangeable processes indexed by the vertices of a k-tree constructed via reinforcement","228939008":"Influential observations in the independent Student-t measurement error model with weak nondifferential error","4790511":"Monetary Policy with a Wider Information Set: A Bayesian Model Averaging Approach","258150346":"The Generalized Multilevel Facets Model for Longitudinal Data","31140209":"The ECME algorithm: a simple extension of EM and ECM with faster convergence","6652105":"Mixture of Normal Distributions in Multivariate Null Intercept Measurement Error Model","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","2359446":"Nonlinear And Non-Gaussian State Estimation: A Quasi-Optimal Estimator","226428363":"Mixture modelling of recurrent event times with long-term survivors: Analysis of Hutterite birth intervals","5931245":"Parsing regulatory DNA: General tasks, techniques, and the PhyloGibbs approach","237426335":"Bandwidth Selection for PET Image Reconstruction by Confidence-Weighted Filtered Backprojection.","257255404":"On simulatingD — distributions","2427038":"Statistical Inference and Perfect Simulation for Point Processes Observed With Noise","256860044":"Crustal constraint through complete model space screening for diverse geophysical datasets facilitated by emulation","226778432":"Spatial-temporal nonlinear filtering based on hierarchical statistical models","45359730":"Multilevel modelling of event history data: comparing methods appropriate for large datasets","229875060":"Estimating the duration of archaeologicalactivity using 14C determinations. Oxford Journal of Archaeology, 13,229-240","2805986":"A Hierarchical Latent Variable Model for Ordinal Data with \"No Answer\" Responses","249865773":"A Monte Carlo approach to the joint estimation of reservoir and elastic parameters from seismic amplitudes","13875224":"Modeling of Trough Plasma Bismuth Concentrations","258230191":"Beta generalized distributions and related exponentiated models: A Bayesian approach","2347247":"Bayesian Inference in Cyclical Component Dynamic Linear Models","260370250":"The environmental correlates of overall and neighborhood based recreational walking (a cross-sectional analysis of the RECORD Study)","26712409":"A New Approach for Handling Longitudinal Count Data with Zero-Inflation and Overdispersion: Poisson Geometric Process Model","45130367":"Markov Chain Monte Carlo Technology","239756954":"To Center or Not to Center: That is Not the Question — An Ancillarity-Sufficiency Interweaving Strategy (ASIS) for Boosting MCMC Efficiency","239859354":"Statistical Analysis For Longitudinal Counting Data in the Presence of a Covariate Considering Different \"Frailty\" Models","252233689":"Preprint of the Book Chapter: \"Bayesian Versus Frequentist Inference","222469520":"Markov chain convergence: From finite to infinite","6471862":"Modeling attainment of steady state of drug concentration in plasma by means of a Bayesian approach using MCMC methods","229756263":"Markov Random Field Models","265479941":"Calibrated Bayes factors for model selection and model averaging","236902089":"Analysis of the response surface of the objective function by the optimum parameter curve: How good can the optimum parameter values be?","2703600":"Dietary Assessment and Estimation of Intake Densities","6189188":"[Advances in researches on application of Bayesian methods to QTL mapping].","227704136":"Wavelet thresholding for some classes of non–Gaussian noise","2302206":"A Forward Monte Carlo Method For Solving Influence Diagrams Using Local Computation","265264913":"A Bayesian Framework and Importance Sampling Methods for Synthesizing Multiple Sources of Evidence and Uncertainty Linked by a Complex Mechanistic Model","227054934":"Comparing the Number of Ozone Exceedances in Different Seasons of the Year in Mexico City","23560581":"Multinormal In Vitro Distribution Model Suitable for the Distribution of Plasmodium falciparum Chemosusceptibility to Doxycycline","273467566":"Multivariate longitudinal data analysis with mixed effects hidden Markov models","233028871":"Statistical inversion of aerosol size measurement data","227308904":"Shape statistics and image analysis","2814157":"A Bayesian Variable-Selection Approach for Analyzing Designed Experiments With Complex Aliasing","2486478":"Bayesian Inference for Multivariate Ornstein-Uhlenbeck Processes in Random Environments","227616125":"Bayesian estimation of cognitive decline in patients with Alzheimer\u0027s disease","229885279":"Using non‐homogeneous Poisson models with multiple change‐points to estimate the number of ozone exceedances in Mexico City","265406268":"MCMC Approach to Classical Estimation with Overidentifying Restrictions","2398423":"Markov chain Monte Carlo analysis of Charpy Impact Energy data","228558185":"A stochastic system for modeling labor force series of small areas","221621711":"Monte Carlo Methods for Absolute Beginners.","227618158":"A Bayesian model for estimating the malaria transition probabilities considering individuals lost to follow-up","243675012":"The Simulation Smoother for Time Series Models","2666794":"A Model-Based Approach for Variable Bandwidth Selection in Kernel Density Estimation","263526071":"Computing Marginal Likelihoods via Posterior Sampling","229031072":"Atmospheric Concentration of Chlorofluorocarbons: Addressing the Global Concern with the Longitudinal Bent-Cable Model","24127607":"Solving for Market Equilibrium using Random Coefficient Random Utility Models","12018111":"A study of deleterious gene structure in plants using Markov chain Monte Carlo","2615595":"Demand or Ideation? Evidence from the Iranian Marital Fertility Decline","2844964":"Modeling Phosphorus Trapping in Wetlands Using Nonparametric Bayesian Regression","4772191":"Bayesian Inference for Non-Gaussian Ornstein-Uhlenbeck Stochastic Volatility Processes","29974739":"Modélisation et estimation de variances hétérogènes dans les modèles non linéaires mixtes","5179732":"Bayesian Analysis of a Cointegration Model Using Markov Chain Monte Carlo.","2867469":"Bayesian Graphical Models for Discrete Data","229706905":"Inference","227617977":"Bayesian and likelihood inference for cure rates based on defective inverse Gaussian regression models","237090568":"An empirical investigation of Bayesian hierarchical modeling with unidimensional IRT models","268328663":"Imputation of missing covariates under a general linear mixed model","44804992":"Bayesian mixture models for the incorporation of prior knowledge to inform genetic association studies","2844935":"Inference in Model-Based Cluster Analysis","243763126":"Estimation of Finite Mixture Distributions Through Bayesian Sampling","1737000":"Variance bounding Markov chains","2750746":"Regeneration in Markov Chain Samplers","230597770":"Parallel Computing with a Bayesian Item Response Model","251899444":"A general method of prior elicitation in Bayesian reliability analysis","223755374":"Metropolis–Hastings from a stochastic population dynamics perspective","4993398":"Bivariate kurtotic distributions of garment fibre data","228748446":"Validation of Software for Bayesian Models Using Posterior Quantiles","4993393":"Assessment of Athens” metro passenger behavior via a multiranked probit model","2777364":"Bounding Convergence Time of the Gibbs Sampler in Bayesian Image Restoration","3152241":"Reliability assessment from fatigue micro-crack data","4897039":"On the influence of the proposal distributions on a reversible jump MCMC algorithm applied to the detection of multiple change-points","235640654":"Spatial analysis of trends in extreme precipitation events in high-resolution climate model results and observations for Germany. J Geophys Res 114:D12113","242552637":"Using Structural Information in Modeling and Multiple Alignments for Phylogenetics","267740860":"Dissecting Genetic Architecture Underlying Seed Traits in Multiple Environments","237629283":"The Bayesian approach to Population pharmacokinetic/pharmacodynamic modeling","2421096":"Bayesian Model Averaging And Model Selection For Markov Equivalence Classes Of Acyclic Digraphs","13404573":"A General Framework for Random Effects Survival Analysis in the Cox Proportional Hazards Setting","247877520":"A BAYESIAN MARGINAL INFERENCE IN ESTIMATING ITEM PARAMETERS USING THE GIBBS SAMPLER","12018145":"Exact Tests of Goodness of Fit of Log‐Linear Models for Rates","226862291":"Bayesian Analysis of the Discovery Process Model Using Markov Chain Monte Carlo","225219632":"A Monte Carlo method for Bayesian analysis of linkage between single markers and quantitative trait loci. I. Methodology","4993296":"On the use of local optimizations within Metropolis-Hastings updates","2355581":"Markov Chain simulations for analysis of marked point processes","220603512":"Positron emission tomography by Markov chain Monte Carlo with auxiliary variables","267419311":"Fighting the Curse of Dimensionality: A method for model validation and uncertainty propagation for complex simulation models","254287433":"Estimation with Selected Binomial Information or Do You Really Believe That Dave Winfield is Batting .471?","4090207":"Pattern recognition in interrelated data: The problem, fundamental assumptions, recognition algorithms","3152211":"A Bayes nonparametric framework for software-reliability analysis","4780333":"Bayes estimates of Markov trends in possibly cointegrated series - an application to US consumption and income","4720941":"Forecasting the Penetration of a New Product: A Bayesian Approach","41562908":"Bayesian estimation of marker dosage in sugarcane and other autopolyploids","227615990":"Daily Exchange Rate Behaviour and Hedging of Currency Risk","241061686":"Modeling and forecasting climate variables using a physical-statistical approach","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","242448131":"Causation, Prediction and Search","4720953":"Bayesian analysis of correlated misclassified binary data","226522354":"Duration dependence models for claim counts","7022872":"Bayesian estimation of community prevalences of Schistosoma japonicum infection in China","2842974":"Geometric Ergodicity and Hybrid Markov Chains","2816351":"Bayesian Analysis of Ordered Categorical Data From Industrial Experiments","8468984":"Detecting DNA regulatory motifs by incorporating positional trends in information content","24016919":"Quantile Regression Analysis of Hedge Fund Strategies","7266797":"Bandyopadhyay, S., Sharan, R. \u0026 Ideker, T.Systematic identification of functional orthologs based on protein network comparison. Genome Res.16, 428-435","226063602":"Spatial Regression Models for Extremes","235933598":"Nonparametric survival regression using the beta-Stacy process","259118846":"Bayesian semiparametric analysis of short- and long-term hazard ratios with covariates","248512348":"Hierarchical Bayesian analysis of true discrimination rates in replicated triangle tests","251273070":"MAT52506 Inverse Problems","228363272":"Bayesian Multivariate Poisson Regression for Models of Injury Count, by Severity","14070083":"Large Hierarchical Bayesian Analysis of Multivariate Survival Data","228592696":"Bayesian Variable Selection and Estimation of Risk Premiums in the APT model","243050460":"Modeling Multilevel Survival Data Using Frailty Models","256452329":"Bayesian random threshold estimation in a Cox proportional hazards cure model","254287497":"The Bayesian Modeling of Covariates for Population Pharmacokinetic Models","225193165":"Mechanistic PK/PD Modeling of Antiretroviral Therapies in AIDS Clinical Trials","2425223":"Priors, Posterior Odds and Lagrange Multiplier Statistics in Bayesian Analyses of Cointegration","2111878":"General state space Markov chains and MCMC algorithms","5143014":"boa: An R Package for MCMC Output Convergence Assessment and Posterior Inference","40707012":"Spatial clustering of mental disorders and associated characteristics of the neighbourhood context in Malm+Â, Sweden, in 2001","271759774":"Bayes Estimates of Markov Trends in Possibly Cointegrated Series: An Application to U.S. Consumption and Income","233303126":"Steady-state ranked Gibbs sampler","225432797":"Non-homogeneous Poisson models with a change-point: An application to ozone peaks in Mexico city","245135151":"Bayesian inference of BWR model parameters by Markov chain Monte Carlo","15628632":"An application of Bayesian population pharmacokinetic/pharmacodynamic models to dose recommendation","8159690":"Bayesian inference for recurrent events data using time-dependent frailty","227132468":"Applying Occam’s razor in modeling cognition: A Bayesian approach","254287511":"Studying Convergence of Markov Chain Monte Carlo Algorithms Using Coupled Sample Paths","236658651":"The role of simulation in modeling spatially correlated data","229708918":"Model Uncertainty","266454575":"INFORMATION FUSION AND SPARSITY PROMOTION USING CHOQUET INTEGRALS","243048371":"An index sampling algorithm for the bayesian analysis of a class of model selection problems","283353393":"Estimation for flexible Weibull extension under progressive Type-II censoring","2218487":"Nonlinear Digital Post-Processing to Mitigate Jitter in Sampling","2599409":"Analyses of Infectious Disease Data from Household Outbreaks by Markov Chain Monte Carlo Methods","223409286":"A comparison of hybrid strategies for Gibbs sampling in mixed graphical models","262354549":"Link analysis ranking: algorithms, theory, and experiments. ACM Trans. Internet Technol. 5(1), 231-297","222655644":"Prior, Posteriors and Bayes Factors for a Bayesian Analysis of Cointegration","229885039":"Bayesian Inference for a Lanchester Type Combat Model","3318224":"Sequential Monte Carlo Methods for Multiple Target Tracking and Data Fusion","254287562":"Modeling Household Purchase Behavior with Logistic Normal Regression","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","220226754":"Simulation-based methods for blind maximum-likelihood filter identification","227617909":"Longitudinal Poisson modeling: an application for CD4 counting in HIV-infected patients","7770522":"Comparison of a Spatial Perspective with the Multilevel Analytical Approach in Neighborhood Studies: The Case of Mental and Behavioral Disorders due to Psychoactive Substance Use in Malmö, Sweden, 2001","229022794":"Bayesian estimation and testing of structural equation models","49740571":"Bayesian evidence computation for model selection in geoacoustic inversion","224881809":"Approaches for Bayesian Variable Selection","246769485":"Markov chain Monte Carlo exact inference for social networks","265549353":"A Bayesian semiparametric model for case-control studies with errors in variables","240434263":"A Bayesian Approach to Parameter Estimation and Pooling in Nonlinear Flood Event Models","248808656":"Regionalization of rainfall-runoff model parameters using Markov Chain Monte Carlo samples","227772308":"Burton P, Tiller K, Gurrin L, Cookson W, Musk A, Palmer LJ. Genetic variance components analysis for binary phenotypes using generalized linear mixed models (GLMMs) and Gibbs sampling. Genet Epidemiol 17: 118-140","7166570":"Spatial clustering of mental disorders and associated characteristics of the neighborhood context in Malmo, Sweden, in 2001","265338327":"Effect of seismic degradation on the fragility of reinforced concrete bridges","283478754":"Bayesian Inference for the Parameters of Weibull Distribution under Progressive Type-I Interval Censored Data with Beta-binomial Removals","2783779":"Importance Sampling Monte-Carlo Algorithms for the Calculation of Dempster-Shafer Belief","51945747":"Modelling the impact of human activity on nitrogen dioxide\nconcentrations in Europe","283871968":"Bayesian calibration of simulation models for supporting management of the elimination of the macroparasitic disease, Lymphatic Filariasis","228954025":"Quantitative bounds for geometric convergence rates of Markov chains","220499752":"An Effective Bayesian Neural Network Classifier with a Comparison Study to Support Vector Machine","220286764":"Markov chain Monte Carlo exact inference for binomial and multinomial logistic regression models","24052576":"Fully Bayesian Analysis of Switching Gaussian State Space Models","4909659":"Reassessing Brand Loyalty, Price Sensitivity, and Merchandising Effects on Consumer Brand Choice","265344450":"Meta-analysis of randomized phase II trials to inform subsequent phase III decisions","221550369":"A dynamic Bayesian analysis of the drivers of Internet firm survival.","226570135":"Hypergroup deformations and Markov chains","2552381":"MCMC Methods for Financial Econometrics","220286778":"Bayesian Neural Networks for non-Linear Time Series Forecasting","267490796":"Degradation Analysis Using Inverse Gaussian Process Model With Random Effects: A Bayesian Perspective","243770531":"Monte Carlo Exact Tests for Square Contingency Tables","27607939":"Recuit simulé par augmentation de données appliqué à la déconvolution bayésienne","10783373":"Exploring heterogeneity in tumour data using Markov chain Monte Carlo","237310991":"Asymptotic Variance and Convergence Rates of Nearly-Periodic MCMC Algorithms","282876662":"Bayesian informative dropout model for longitudinal binary data with random effects using conditional and joint modeling approaches","228317098":"A Markov Chain Quasi-Monte Carlo Method for Bayesian Estimation of Stochastic Volatility Model","225513280":"Pharmacodynamic Analysis of Hematologic Profiles","263607687":"Analysis of bivariate binary data with possible chances of wrong ascertainment","233854918":"Stevenson12 plosCB fncnx","4741744":"Imputation of Binary Treatment Variables With Measurement Error in Administrative Data","254078238":"A Negative Binomial Regression Model for Accuracy Tests","228339623":"Predictive Modeling of Costs for a Chronic Disease With Acute High-Cost Episodes","2488937":"Towards an inclusion driven learning of Bayesian Networks","260838849":"Stochastic partial differential equation based modeling of large space-time data sets","4901403":"Bayesian Analysis of Switching ARCH Models","223000351":"Parameter Estimation and Uncertainty Analysis for a Watershed Model","227704772":"Bayesian Modelling of Prehistoric Corbelled Domes","265551237":"Household Dissolution and Socio Economic Position in rural South Africa","245193925":"Quantification of the uncertainty in the effect of irradiation on Charpy properties","226809823":"A Comparison of Two Sequential Metropolis-Hastings Algorithms with Standard Simulation Techniques in Bayesian Inference in Reliability Models Involving a Generalized Gamma Distribution","14865030":"Stephens D, Smith A. Bayesian inference in multipoint gene mapping. Ann Hum Genet 57: 65-82","230445018":"Theory and Methods: Likelihood‐based Estimation of the Regression Model with Scrambled Responses","2757197":"Adaptation for Self Regenerative MCMC","227647478":"Model-Based Geostatistic","246367431":"Hierarchical Generalized Linear Models in the Analysis of Variations in Health Care Utilization","228577269":"Binary data in the presence of covariates and misclassifications: A Bayesian approach","2277961":"Markov Chain Monte Carlo Methods in Biostatistics","13978302":"The heritability of IQ","13464225":"A development environment for knowledge-based medical applications on the World-Wide Web","13464224":"Modelling behavioral syndromes using Bayesian networks","220309330":"Estimation for Restriction Sites Observed by Optical Mapping Using Reversible-Jump Markov Chain Monte Carlo","226094860":"Statistical inference and Monte Carlo algorithms","30481319":"Essays on Customization Applications in Marketing","246176978":"A review of asymptotic convergence for general state space Markov chains","11238101":"A comparison of rate–response toxicity tests with Aphidius rhopalosiphi (Hymenoptera: Aphidiidae) using glass, leaves and whole plants as substrate","2857641":"Small and Pseudo-Small Sets for Markov Chains","4993736":"Stationary Autoregressive Models via a Bayesian Nonparametric Approach","3318455":"A peak preserving algorithm for the removal of colored noise from signals","2351780":"Geophysical Inversion with a Neighbourhood Algorithm—II. Appraising the ensemble","248257604":"Using all Metropolis-Hastings proposals to estimate mean values","251829641":"Adding Risk in Measuring Customer Value Using Bivariate Hierarchical Bayesian Approach","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","270437010":"New volatility models under a Bayesian perspective: a case study","46821447":"Models of population-based analyses for data collected from large extended families","257017308":"A Bayesian conditional autoregressive geometric process model for range data","255624621":"ANÁLISE BAYESIANA DO DESEMPENHO DE DOIS TESTES DIAGNÓSTICOS QUANDO INDIVÍDUOS COM RESULTADOS NEGATIVOS EM AMBOS OS TESTES NÃO SÃO VERIFICADOS POR UM PADRÃO-OURO","277277204":"Estimação dos Parâmetros de Modelos em Espaço de Estados -- Uma aplicação à calibração do radar meteorológico","227034907":"Regenerative Markov Chain Monte Carlo Methods for Pharmacokinetic/Pharmacodynamic Estimation","3193508":"Bayesian Grid Matching","225464292":"Using stochastic volatility models to analyse weekly ozone averages in Mexico City","10601012":"Inference for an epidemic when susceptibility varies","258147837":"Application of Gibbs sampling for inference in a mixed major gene-polygenic inheritance model in animal populations","4899565":"Stochastic volatility: Bayesian computation using automatic differentiation and the extended Kalman filter","228968214":"Neural network imputation in complex survey design","10600980":"Point-source modelling using case-control data. Biostatistics, 1:89-105","222836721":"Adaptive radial-based direction sampling: Some flexible and robust Monte Carlo integration methods","258385373":"A Bayesian analysis of spectral ARMA model","222394365":"Two Statistical Methods for the Detection of Environmental Thresholds","251561014":"Exploring the core factors and its dynamic effects on oil price: An application on path analysis and BVAR-TVP model","2583278":"Bayesian Variable and Transformation Selection in Linear Regression","4772482":"Venezuelan Rainfall Data Analysed by Using a Bayesian Space-time Model","2896615":"Model uncertainty. Stat Sci","4772506":"Diagnostic checks for discrete data regression models using posterior predictive simulations","282477060":"Sea-surge and wind speed extremes: optimal estimation strategies for planners and engineers","237528315":"of Event History Models With Unobserved Heterogeneity via Markov Chain Monte Carlo","225517476":"A Bayesian Unmasking Method for Locating Multiple Gross Errors Based on Posterior Probabilities of Classification Variables","220227574":"A Bayesian approach to harmonic retrieval with clipped data","228433733":"Actuarial modeling with MCMC and Bugs: additional worked examples","2429695":"Nonconjugate Bayesian Estimation of Covariance Matrices and Its Use in Hierarchical Models","2292418":"Extension of Fill\u0027s perfect rejection sampling algorithm to general chains (Extended abstract) in Monte Carlo Methods","227704694":"Survival analysis with long‐term survivors and partially observed covariates","35700932":"A Bayesian Framework for Target Tracking using Acoustic and Image Measurements","2704064":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","38373539":"Exponential Convergence of Langevin Distributions and Their Discrete Approximations","2302664":"Perfect Simulation Involving a Continuous and Unbounded State Space","255657427":"Exchange Rate Pass-Through and Monetary Policy in a Sectoral Two Country Model","2818757":"Using Prior Probabilities and Density Estimation for Relational Classification","43518070":"A Bayesian solution to reconstructing centrally censored distributions","220057587":"Uncovering Transcriptional Regulatory Networks by Sparse Bayesian Factor Model.","260828517":"PERSiST: the precipitation, evapotranspiration and runoff simulator for solute transport","242986132":"Use of the Gibbs sampler to invert large, possibly sparse, positive definite matrices","267656452":"Bayesian Inference for Two-Parameter Gamma Distribution Assuming Different Noninformative Priors","2263763":"Bayesian Analysis of Stochastically Ordered Distributions of Categorical Variables","24083358":"Bayesian modelling of spatial compositional data. J Appl Stats","24083353":"Bayesian analysis of null intercept errors-in-variables regression for pretest/post-test data","231759658":"A Bound on the Rate of Convergence for the Discrete Gibbs Sampler","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","3807940":"Bayesian wavelet denoising using Besov priors","222340673":"Weibull extension model: A Bayes study using Markov chain Monte Carlo simulation","46494148":"Nonignorable dropout models for longitudinal binary data with random effects: An application of Monte Carlo approximation through the Gibbs output","220286498":"Slice sampling mixture models","229871288":"Bayesian analysis of constant elasticity of variance models","4772679":"Statistical image analysis for a confocal microscopy two-dimensional section of cartilage growth","260215949":"Statistical analysis and modelling of small satellite reliability","44624315":"Bayesian Estimation for Performance Measures of Two Diagnostic Tests in the Presence of Verification Bias","227700359":"Dynamic Rating of Sports Teams","228294274":"Financial Risk Management with Bayesian Estimation of GARCH Models: Theory and Application","14259141":"Implementing the Bayesian paradigm: reporting research results over the World-Wide Web.","2779957":"Representation of Gibbs fields with Synchronous Random Fields.","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","21674595":"Computational aspects of analysing random effects/longitudinal models","47696382":"Uncovering Transcriptional Regulatory Networks by Sparse Bayesian Factor Model","222684783":"Hedge fund pricing and model uncertainty","267562201":"Technical Efficiency and Productivity in Incentive Systems","257391739":"A Bayesian latent variable model with classification and regression tree approach for behavior and credit scoring. Knowledge-Based Systems, 36, 245-252","13194215":"Precis of Statistical Significance: Rationale, Validity, and Utility","4864888":"A Hierarchical Bayes Error Correction Model to Explain Dynamic Effects of Price Changes","277597113":"Construction of sequential Markov random field prior models from training images","238046468":"A Bayesian Approach to Combining Information from a Census, a Coverage Measurement Survey, and Demographic Analysis","239801725":"A New Class of Bayesian Semiparametric Models with Applications to Option Pricing","239799666":"Fundamentals of Applied Statistics and Surveys","2351898":"Bayesian Modeling of Inseparable Space–Time Variation in Disease Risk","228681368":"Bayesian Inference in Public Administration Research: Substantive Differences from Somewhat Different Assumptions","2286432":"Bayesian Modelling of Outstanding Liabilities Incorporating Claim Count Uncertainty","225838644":"Univariate Bayesian nonparametric binary regression with application in environmental management","4789006":"Bayesian Semiparametric Regression for Median Residual Life","265727121":"Bayesian factors","222946821":"The fitting of parameter-constrained demographic models","229920506":"Bayesian solvency analysis with autocorrelated observations","243766743":"A Language and Program for Complex Bayesian Modelling","50903128":"Fitting Bayesian multiple random effects models","2335602":"Sambridge, M. Geophysical inversion with a neighbourhood algorithm - I. Searching a parameter space. Geophys. J. Int. 138, 479-494","261416130":"Unbiased, scalable sampling of closed kinematic chains","225267253":"The Problem of Pattern Recognition in Arrays of Interconnected Objects. Statement of the Recognition Problem and Basic Assumptions","261289160":"Monte Carlo error in the Bayesian estimation of risk ratios using log-binomial regression models: an efficient MCMC method","5182228":"Bayesian analysis of generalized four-parameter Burr distribution via Gibbs sampler","268573532":"A Monte Carlo Simulation of the Kriging Model","246187468":"Conditional Independence Models for Epidemiological Studies withCovariates Measurement Error","261641465":"Effect of the number of categories, number of time-points, and sample size on the recovery of random-effect ordinal regression model parameters","44663242":"The natural history of hepatitis C infection acquired through injection drug use: Meta-analysis and meta-regression","266237115":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","229891797":"Parameter Estimation in the Error‐in‐Variables Models Using the Gibbs Sampler","2261835":"Convergence Rates for Markov Chains","241894657":"Markov Chain Monte-Car o Algorithms for t Calculation of Dempster-Shafer","4920100":"Bayesian Semiparametric Cure Rate Model with an Unknown Threshold","5602081":"Bayesian wavelet networks for nonparametric regression","243768830":"Computing Bayes Factors by Combining Simulation and Asymptotic Approximations","5055286":"Evaluation of Joint Density Forecasts of Stock and Bond Returns: Predictability and Parameter Uncertainty","4743989":"Bayesian Semiparametric Median Regression Modeling","227725037":"Bayesian inference based on partial monitoring of components with applications to preventive system maintenance","226014968":"A Bayesian study for the comparison of generalized gamma model with its components","223667927":"Analysis of parameter uncertainty in semi-distributed hydrological models using bootstrap method: a case study of SWAT model applied to Yingluoxia watershed in northwest China. J Hydrol 385(1-4):76-83","23991021":"Obtaining similar null distributions in the normal linear model using computational methods","227497483":"Change-point alterations of extreme water levels and underlying causes in Pearl River Delta, China","13513545":"Estimation for Restriction Sites Observed by Optical Mapping Using Reversible-Jump Markov Chain Monte Carlo","256095433":"Bayesian Hierarchical Modeling with 3PNO Item Response Models","245079312":"Sample size bounding and context ranking as approaches to the HRA data problem","285463182":"A GPU-Based Gibbs Sampler for a Unidimensional IRT Model","227253787":"Bayesian Versus Frequentist Inference","4914136":"Gibbs Sampling for Bayesian Non-Conjugate and Hierarchical Models by Using Auxiliary Variables","266017871":"Sampling Unnormalized Probabilities: An Alternative to the Metropolis--Hastings Algorithm","221845164":"A Bayesian Approach to Detection of Small Low Emission Sources","263230501":"Accounting for Response Misclassification and Covariate Measurement Error Using a Random Effects Logit Model","258327792":"Automatic Glottal Inverse Filtering with the Markov Chain Monte Carlo Method","255620260":"Bayesian Student-t Stochastic Volatility Models via a Two-stage Scale Mixtures Representation","2440127":"Nonparametric Bayes Inference for Concave Distribution Functions","31144571":"A recursive algorithm for Markov random fields","264844392":"Inference from Heteroscedastic Functional Data, Part I: Identical Sampling Points","15348555":"Hierarchical regression for epidemiologic analyses of multiple exposures","14988098":"Use of the Gibbs sampler to estimate transition rates between grades of coronary disease following cardic transplantation","4746208":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","229672476":"Prediction of Growth: A Hierarchical Bayesian Approach","3091331":"Markov Chain Monte Carlo Posterior Density Approximation for a Groove-Dimensioning Purpose","2214798":"Stability of the Gibbs Sampler for Bayesian Hierarchical Models","5444579":"Multiple Imputation Inference for Multivariate Multilevel Continuous Data with Ignorable Non-Response","2327447":"Bounds for Kac\u0027s Master Equation","245099823":"Gibbs sampling of climatic trends and periodicities","227612196":"Bayesian analysis of two‐component mixture distributions applied to estimating malaria attributable fractions","226219715":"Bayesian analysis of skew-t multivariate null intercept measurement error model","3152781":"A Practical Method for Obtaining Prior Distributions in Reliability","236901854":"Understanding the Metropolis-Hastings Algorithm","228605538":"Non-Centered Parameterisations for Hierarchical Models and Data Augmentation","228597350":"The Practical Implementation of Bayesian Model Selection","257557648":"A Bayesian hierarchical model for assessing the impact of human activity on nitrogen dioxide concentrations in Europe","236625364":"Block-Relaxation Approaches for Fitting the INDCLUS Model","2741222":"Bayesian Density Estimation and Inference Using Mixtures","227513951":"Approaches to Evaluate Water Quality Model Parameter Uncertainty for Adaptive TMDL Implementation","12585745":"Modeling approach to diameter breakpoint determination","228677239":"A new analysis of experimental data on olivine rheology","277791576":"Use of spatial models and the MCMC method for investigating the relationship between road traffic pollution and asthma amongst children","222506651":"A Bayesian bivariate failure time regression model","5372809":"Efficiency of alternative MCMC strategies illustrated using the reaction norm model","12532581":"The Combination of Population Pharmacokinetic Studies","268018722":"Maximum Likelihood Estimation for Probit-Linear Mixed Models with Correlated Random Effects","275618737":"Parameter Estimation in Marshall-Olkin Exponential Distribution Under Type-I Hybrid Censoring Scheme","235890130":"Markov Random Field Modeling in Image Analysis","5567413":"Methods for numerical integration of high-dimensional posterior densities with application to statistical image models","243049886":"Bayesian analysis of hierarchical Poisson models with latent variables","2634701":"Bayesian Inference with Wavelets: Density Estimation","2290631":"Extension of Fill\u0027s perfect rejection sampling algorithm to general chain","14140208":"Bayesian statistical analyses for presence of single genes affecting meat quality traits a crossed pig population","2483138":"Two Convergence Properties of Hybrid Samplers","2689985":"Computing Posterior Distributions for Covariance Matrices","9053026":"Incorporating prior beliefs about selection bias into the analysis of randomized trials with missing data","260717667":"Mixed linear model approach for mapping quantitative trait loci underlying crop seed traits","243776875":"Spatial Statistics and Bayesian Computing","8893291":"Binary latent variable modeling and its application in the study of air pollution in Hong Kong","228916821":"USE OF MIXTURE OF DISTRIBUTIONS FOR THE ERROR IN REGRESSION MODELS FOR LIFETIME DATA","243099020":"Bayesian Assessment of Network Reliability","2237393":"Analysis of a Non-Reversible Markov Chain Sampler","24128133":"Adaptive Learning, Model Uncertainty and Monetary Policy Inertia in a Large Information Environment","2728927":"An extension of Fill\u0027s exact sampling algorithm to non-monotone chains","271889353":"Definition of Homogenous Sections in Road Pavement Measurements","47663402":"Interacting Multiple Try Algorithms with Different Proposal\nDistributions","32889355":"Likelihood-Based Approaches to Flood Frequency Estimation","228392547":"Lecture 6: Matrix Exponential Spatial models","269403149":"Bayesian estimation and testing of structural equation models","228927904":"Image recognition via deformable templates","243118712":"The Evolution of Markov Chain Monte Carlo Methods","12901570":"On Bayesian calculations for mixture likelihoods and priors","241721955":"A Split Questionnaire Survey Design","263545790":"Inverse Gaussian process models for degradation analysis: A Bayesian perspective","251568883":"A Bayesian Approach to Estimate the Prevalence of Schistosomiasis japonica Infection in the Hubei Province Lake Regions, China","220395821":"Effects of Chemical Reaction on Two-Dimensional Turbulence","13620446":"On the use of Bayesian methods for evaluating compartmental neural models. J Comput Neurosci 5:285-314","14408905":"Population Genetics of STR Loci in Caucasians","2649149":"Inference and Hierarchical Modeling in the Social Sciences","10704054":"Statistical inversion for medical X-ray tomography with few radiographs: I. General theory","228604342":"Bayesian Inference and Decision Theory – A Framework for Decision Making in Natural Resource Management","268020710":"Bayesian inference with misspecified models","265778166":"Bayesian Estimation for the Three-Parameter Weibull Distribution with Tree Diameter Data","225550672":"Survival and spatial fidelity of moufl on (Ovis gmelini): A Bayesian analysis of an age-dependent capture-recapture model","4858984":"Markov-Normal analysis of iterative simulations before their convergence","272534552":"Bayesian interpolation of unequally spaced time series","222871904":"Quantification of automobile insurance liability: A Bayesian failure time approach","257799029":"Bayesian analysis for Type-II hybrid censored sample from inverse Weibull distribution","227205536":"Posterior analysis of lognormal regression models using the Gibbs sampler","6841413":"Bayesian statistics in medicine: A 25 year review","265108451":"MCMC Methods in Wavelet Shrinkage: Non-Equally Spaced Regression, Density and Spectral Density Estimation","12360850":"Bayesian modelling of inseparable space-time variation in disease risk","228874635":"Adaptive Reserving using Bayesian revision for the Exponential Dispersion Family","223459683":"Bayesian wavelet denoising: Besov priors and non-Gaussian noises","12360847":"Statistical Issues in the Analysis of Disease Mapping Data","14183660":"A sequential Bayesian algorithm for dose individualisation of carboplatin","2278422":"Physiological Pharmacokinetic Analysis Using Population Modeling and Informative Prior Distributions","261114792":"Quantifying operational flexibility of VSC-HVDC lines and SVCs","3003501":"Tracking Multiple Objects with Particle Filtering","6939689":"Modelling Multivariate Outcomes in Hierarchical Data, with Application to Cluster Randomised Trials","24063295":"A latent variable model for discrete multivariate psychometric waiting times","222689557":"Estimation of unknown parameters in nonlinear and non-Gaussian state-space models","24063293":"Bayesian estimation and testing of structural equation model","241150471":"Markov Chain Simulation for Estimating Accelerated Life Model Parameters","257800964":"A Zero-Inflated Spatial Gamma Process Model With Applications to Disease Mapping","271002747":"Bayesian analysis of loss reserving using dynamic models with generalized beta distribution","11160822":"Estimating disease prevalence in absence of a gold standard","251171494":"A Bayesian analysis of retention functions","13821106":"Bayesian Nonparametric Population Models: Formulation and Comparison with Likelihood Approaches","13821105":"Bayesian Population Pharmacokinetic and Pharmacodynamic Analyses Using Mixture Models","24083724":"A Bayesian Adjustment for Covariate Misclassification with Correlated Binary Outcome Data","233009541":"Choice Between Weibull and Lognormal Models: A Simulation Based Bayesian Study","24063237":"A multidimensional item response model: Constrained latent class analysis using Gibbs sampler and posterior predictive checks","247788206":"Capital Structure Decisions Under Classical and Imputation Tax Systems: A Natural Test for Tax Effects in Australia","242469404":"Ergodicity of Adaptive MCMC and its Applications","43554536":"Inequality constrained normal linear models","4744254":"Markov Chain Monte Carlo Estimation of Classical and Dynamic Switching and Mixture Models","227369457":"Do Leading Indicators Lead Peaks More Than Troughs?","13747375":"Approximate Bayes inference for random effects meta-analysis","2864212":"Possible biases induced by MCMC convergence diagnostics","227424526":"Simple conditions for the convergence of the Gibbs sampler and Metropolis–Hastings algorithm","223926744":"A Bayesian approach to seriation problems in archaeology","227369231":"Learn From Thy Neighbor: Parallel-Chain and Regional Adaptive MCMC","5139660":"Stochastic Frontier Models with Random Coefficients","2469030":"Subsampling the Gibbs Sampler","2847909":"Efficient Use of Exact Samples","26672409":"Analyzing lateral seabed variability with Bayesian inference of seabed reflection data","23631352":"On Robust Bayesian Analysis for Location and Scale Parameters","242254560":"Markov Chain Monte Carlo Methods for Statistical Inference","2520242":"Image Sequence Restoration Using Gibbs Distributions","2327738":"Entropy Filtering Method and Insertion/Deletion Robust Algorithm for Multiple Local Sequence Alignment","38350549":"On The Geometric Ergodicity Of Hybrid Samplers","221663656":"Parametric estimation of hidden stochastic model by contrast\nminimization and deconvolution: application to the Stochastic Volatility\nModel","12704865":"Genome-wide linkage analysis using genetic variance components of alcohol dependency-associated censored and continuous traits","262056761":"Bayesian estimation of nonlinear equilibrium models with random coefficients","222607852":"Approximate Bayes model selection procedures for Gibbs-Markov random fields","2612365":"Bayesian Estimation and Model Choice in Item Response Models","226736430":"Bayesian analysis of contingency tables: A simulation and graphics-based approach","2847898":"Shift-Coupling and Convergence Rates of Ergodic Averages","38348541":"Weighted polynomial models and weighted sampling schemes for finite population","228581674":"A note on first-stage approximation in two-stage hierarchical models","229050641":"Evaluating Predictability of Stock and Bond Returns with Different Density Forecasts1","260637488":"Bayesian Post-Processing Methods for Jitter Mitigation in Sampling","2469023":"Incorporating Toxicity Grade Information in the Continual Reassessment Method","247505531":"Signs of Obsolescence in Psychological Statistics: Significance versus Contemporary Theory","2395290":"A Coupling-Regeneration Scheme for Diagnosing Convergence in Markov Chain Monte Carlo Algorithms","255998972":"Moderating Factors of Immediate, Dynamic, and Long-Run Cross-Price Effects","266474279":"Flexible Bent-Cable Models for Mixture Longitudinal Data","281947147":"Hidden Markov Models for Complex Stochastic Processes: A Case Study in Electrophysiology","228764005":"A Hierarchical Bayes Error Correction Model to Explain Dynamic Effects of Promotions on Sales","232878374":"Bayes Analysis and Comparison of Accelerated Weibull and Accelerated Birnbaum–Saunders Models","4729985":"Markov Chain Monte Carlo Simulation Methods in Econometrics","2747621":"Monte Carlo error estimation for multivariate Markov chains","221397501":"Tripartite Hidden Topic Models for Personalised Tag Suggestion","225796516":"A Bayesian PET reconstruction method using segmented anatomical membrane as priors","227623232":"Markov Chain Monte Carlo Method and its applications","267240250":"Efficient Algorithms for Fitting Bayesian Mixture Models","252953550":"Mean field approximation for PDE-Markov random field models in image analysis","286199277":"Bayesian estimation and prediction for the generalized Lindley distribution under asymmetric loss function","228430207":"Bayesian inference of a linear segmented regression model","46624302":"The Discrete Acyclic Digraph Markov Model in Data Mining","262370131":"Stochastic model-based methods for handling uncertainty in areal interpolation","232851730":"Bayesian Analysis of Masked Series System Lifetime Data","222738864":"Bivariate prior distribution via branching exchangeable sequences","2819293":"Bayesian Separation And Recovery Of Convolutively Mixed Autoregressive Sources","277294192":"Bayesian Time Series: Financial Models And Spectral Analysis","282790946":"Statistics: A data science for the 21st century","228405601":"Statistical inversion and Monte Carlo sampling methods in electrical impedance tomography","222665147":"Seasonality and non-linear price effects in scanner-data-based market-response models","222337471":"Bayesian analysis of seasonal unit roots and seasonal mean shifts","2829613":"Estimating the Long-Term Phosphorus Accretion Rate in the Everglades: A Bayesian Approach with Risk Assessment","14585305":"Statistical analysis of Zidovudine (AZT) effect on CD4 cell counts in HIV disease","38348609":"MCMC convergence diagnosis via multivariate bounds on log-concave densities","24079463":"Bayesian analysis of stochastic volatility models with flexible tails","222208054":"Combining DEA and stochastic frontier models: An empirical Bayes approach","50929155":"Asset allocation in a Bayesian copula-GARCH framework: An application to the ‘passive funds versus active funds’ problem","5285211":"Spatially-explicit risk profiling of Plasmodium falciparum infections at a small scale: A geostatistical modelling approach","225880189":"Inference for circular distributions and processes","226621587":"Spatial Autocorrelation: A Statistician’s Reflections","222525520":"The Bayes factor for inequality and about equality constrained models","261458566":"Uncertainty management in model-based imputation for missing data","227197084":"Langevin-Type Models II: Self-Targeting Candidates for MCMC Algorithms*","261458562":"Model for treatment of incomplete records in preventive maintenance","225136755":"Binary geometric process model for the modeling of longitudinal binary data with trend","6817139":"Recent Increase of Neighborhood Socioeconomic Effects on Ischemic Heart Disease Mortality: A Multilevel Survival Analysis of Two Large Swedish Cohorts","227932297":"Fitting Non-Linear Time Series Models, with Applications to Stochastic Variance Models","226162789":"Multipoint linkage analysis by block Gibbs sampling","243360676":"Estimating Anomalies from Indirect Observations","24065097":"A Bayesian Semiparametric Analysis for Additive Hazard Models With Censored Observations","267107008":"Birth Defects Registered by Double Sampling: A Bayesian Approach Incorporating Covariates and Model Uncertainty","2778374":"Methods for Approximating Integrals in Statistics with Special Emphasis on Bayesian Integration Problems","24083551":"The most-cited statistical papers","220071983":"Quantitative Inference by Qualitative Semantic Knowledge Mining with Bayesian Model Averaging","2356497":"A Simple Method for Finding a Legal Configuration in Complex Bayesian Networks","2612499":"Bayesian Model Averaging for Linear Regression Models","24065113":"Bayesian prediction in threshold autoregressive models with exponential white noise","2813202":"Bayesian Variable Selection with Related Predictors","26631341":"On a multivariate implementation of the Gibbs sampler","222488703":"Monte Carlo inference methods in population genetics","226490433":"Calculation of marginal densities for parameters of multinomial distributions","227190985":"Gibbs sampler by sampling-importance-resampling","239792908":"Reliability estimation in stress-strength models: An MCMC approach","227094725":"Estimation of population pharmacokinetics using the Gibbs sampler","24065059":"Bayesian transformed models for small area estimation","6593832":"Analysis of matched case-control data with ordinal disease states: Possible choices and comparisons","241722150":"A Unified Approach to Identifying Multivariate Time Series Models","225959973":"Riemann sums for MCMC estimation and convergence monitoring","242391847":"Markov Chain Monte Carlo Methods in Molecular Computing","3784047":"Stochastic algorithms for Bayesian model selection of AR processes","227727556":"Markov chain models for extreme wind speeds","228167872":"MCMC Methods for Continuous-Time Financial Econometrics","227141842":"Generating random variates from D-distributions via substitution sampling","225607727":"Demand or Ideation? Evidence from the Iranian Marital Fertility Decline","259717656":"Modelovanie rastu bukových stromov a porastov","2784591":"Inference from a Deterministic Population Dynamics Model for Bowhead Whales: Rejoinder","266613389":"Revisiting Safe Biological Limits in Fisheries","4893990":"Bayesian inference for nonhomogeneous Poisson processes in software reliability models assuming nonmonotonic intensity functions","220661832":"Exact prediction intervals for exponential lifetime based on random sample size","225628162":"Frequentist and Bayesian approaches for interval-censored data","277069299":"Bayesian Post-Processing Methods for Jitter Mitigation in Sampling","2649435":"MCMC Methods For Discrete Sojourn Time Ion Channel Data","49676163":"Neighborhood Effects on Health Correcting Bias From Neighborhood Effects on Participation","2833756":"A note on convergence rates of Gibbs sampling for nonparametric mixtures","271750472":"A Poisson geometric process approach for predicting drop-out and committed first-time blood donors","14314913":"Interpretation of Pooling Experiments Using the Markov Chain Monte Carlo Method","228819160":"A Fully Bayesian Analysis of Multivariate Latent Class Models with an Application to Metric Conjoint Analysis","223678505":"A stochastic model for tropical rainfall at a single location","220170339":"Parameter Identification in Degradation Modeling by Reversible-Jump Markov Chain Monte Carlo","24065262":"Estimation of a normal mixture model through Gibbs sampling and Prior Feedback","227760145":"Trends and abrupt changes of precipitation extremes in the Pearl River basin, China. Atmos Sci Lett","266336860":"The Directional Neighborhoods Approach to Contextual Classification of Images from Noisy Data","46434115":"Bayesian near-boundary analysis in Basic macroeconomic time-series models","46497613":"Mixed frequency models: Bayesian approaches to estimation and prediction","2297257":"Bellman Functions on Trees for Segmentation, Generalized Smoothing, Matching and Multi-Alignment in Massive Data Sets","227686431":"Exchangeable claim sizes in a compound Poisson‐type process","222394575":"Stochastic modelling of ecological processes using hybrid Gibbs samplers","11924795":"Bayesian Inference for a Random Tessellation Process","227577858":"Markov-chain Monte Carlo: Some practical implications of theoretical results","229025840":"Building robust simulation-based filters for evolving data sets","2356660":"A Bayesian Time-Course Model for Functional Magnetic Resonance Imaging Data","13507924":"A Bayesian hierarchical survival model for the institutional effects in a multi-centre cancer clinical trial","241124289":"Soil Total Organic Carbon, δ 13C Values and Their Responses to the Soil Core Transferring Experiment from High to Low-elevation Forest along Natural Altitudinal Transect of Old Temperate Volcanic Forest Soils","24083658":"Influential Observations in the Functional Measurement Error Model","3153305":"Assessing the Value of the Threshold Parameter in the Weibull Distribution Using Bayes Paradigm","2364811":"Gibbs Sampling","12205333":"Hierarchical models in generalized synthesis of evidence: An example based on studies of breast cancer screening","224983256":"A Gibbs sampler for the multidimensional item response model","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","244507428":"The Collapsed Gibbs Sampler in Bayesian Computations with Applications to a Gene Regulation Problem","228665367":"A BAYES COMPARISON OF TWO DIFFERENT CANCER THERAPIES UNDER THE ASSUMPTION OF WEIBULL SURVIVAL MODEL OR ITS SUBFAMILY","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","227639343":"Probabilistic data analysis: An introductory guide","243104706":"Conductance bounds on the L2 convergence rate of Metropolis algorithms on unbounded state spaces","287110364":"Responses to Social Vocalizations in the Dorsal Cochlear Nucleus of Mice","238865405":"A Bayesian Approach for Nonlinear Regression Models with Continuous Errors","229740656":"The Bayesian Approach to the Interpretation of Archaeological Data","261573205":"Statistics for Long-Memory Processes","221870332":"Confidence Regions for Statistical Model Based Shape Prediction From Sparse Observations","241124247":"An autoregressive spatio-temporal precipitation model","2360808":"Simulation-Based Methods for Blind Maximum-Likelihood Filter Identification","277738816":"Non-addictive effects in logistic regression","222838919":"Model selection by MCMC computation","24083644":"Bayesian and Fiducial inference for the inverse Gaussian distribution via Gibbs sampler","261200450":"Multi-view latent variable discriminative models for action recognition","2254324":"Self Regenerative Markov Chain Monte Carlo","223158426":"A Markov chain Monte Carlo method for estimation and assimilation into models. Ecol Model","240489356":"Modeling long-term persistence in hydroclimatic time series using a hidden state Markov model. Water Resour Res","2811376":"Markov Chain Monte Carlo for Statistical Inference","40892340":"The Rise of Markov Chain Monte Carlo Estimation for Psychometric Modeling","235803603":"High Performance Gibbs Sampling for IRT Models Using Row-Wise Decomposition","223097006":"A Bayesian approach to estimate the marginal loss distributions in operational risk management","228292728":"Hedge Fund Return Predictability in the Presence of Model Uncertainty and Implications for Wealth Allocation","2663884":"Bayesian Inference for Semiparametric Binary Regression","261210741":"Baysian Reliability Assessment of Avionic Device Based on Markov Chain Monte Carlo Method","262046329":"A Variational Bayes Discrete Mixture Test for Rare Variant Association","49733393":"Using Stochastic Causal Trees to Augment Bayesian Networks for Modeling eQTL Datasets","240919476":"Generalized linear modeling of susceptibility to landsliding in the central Apennines, Italy. Comput Geosci","229359683":"Determining the number of clusters in cluster analysis","226072720":"Recent trends and developments in computational multivariate analysis","2497999":"Daily Exchange Rate Behaviour and Hedging of Currency Risk","261573244":"Numerical Bayesian Methods Applied to Signal Processing","227663971":"Covariance structure of wavelet coefficients: Theory and models in a Bayesian perspective","255636175":"DURATION OF INTERNET FIRMS: A SEMIPARAMETRIC BAYESIAN SURVIVAL ANALYSIS","226822269":"Geometric Convergence Rates for Time-Sampled Markov Chains","38348723":"Nonparametric hierarchical Bayes via sequential imputation","244956002":"Ecient Use of Exact Samples","5146037":"Inflation and Productivity in Europe: An Empirical Investigation","238689222":"Bayesian Filtering: From Kalman Filters to Particle Filters, and Beyond","245570397":"The Bayesian Inference for Software Reliability Models Based on NHPP","5139889":"Inference in dynamic stochastic frontier models","2311716":"The Variable Selection Problem","2848291":"On convergence rates of Gibbs samplers for uniform distributions","29687759":"Note on the Sampling Distribution for the Metropolis-Hastings Algorithm","278310557":"Spatial Statistics in Environmental Epidemiology","237772832":"Applications of Bayesian networks in ecological modeling","226235248":"Markov Chain Monte Carlo","257147229":"Applications of geometric bounds to the convergence rate of Markov chains on Rn","8943257":"Spatial patterns of infant mortality in Mali: the effect of malaria endemicity","2434614":"Perfect Simulation Involving Functionals of a Dirichlet Process","257147205":"A quasi-ergodic theorem for evanescent processes","259203429":"Reverse engineering and identification in systems biology: Strategies, perspectives and challenges","2733630":"A Hierarchical Approach to Covariance Function Estimation for Time Series","7378542":"Inequality Constrained Analysis of Variance: A Bayesian Approach.","225719147":"Multi-step samplers for improving efficiency in probabilistic geophysical inference","227218345":"Bayes estimation: A novel approach to derivation of internally consistent thermodynamic data for minerals, their uncertainties, and correlations. Part I: Theory","229659538":"Inference for some multivariate ARCH and GARCH models","2788873":"Monte Carlo Exact Conditional Tests for Quasi-independence using Gibbs Sampling","226757543":"A guided walk Metropolis algorithm","226337625":"“Bayesian Inference for Finite Mixture Models of Generalized Linear Models with Random Effects.”","4746860":"A Bayesian Insertion/Deletion Algorithm for Distant Protein Motif Searching via Entropy Filtering","233354188":"A Bayes analysis of modified Weibull distribution via Markov chain MONte Carlo simulation","222485349":"A Method for Simultaneous Variable Selection and Outlier Identification in Linear Regression;","228711302":"A Gibbs sampler for inequality-constrained geostatistical interpolation and inverse modeling","225026894":"Gibbs sampling for 2PNO multi-unidimensional item response theory models","227951527":"Likelihood Inference for Gibbs Processes in the Analysis of Spatial Point Patterns*","5506661":"A statistical model investigating the prevalence of tuberculosis in New York City using counting processes with two change-points","2577940":"Fast Model Search for Designed Experiments with Complex Aliasing","266410450":"dcv : A set of MATLAB functions for blind deconvolution of discrete signals","220066603":"Modeling Internet firm survival using Bayesian dynamic models with time-varying coefficients","35734552":"Convergence of Markov chain Monte Carlo algorithms with applications to image restoration [microform].","5424744":"Constraining the general linear model for sensible hemodynamic response function waveforms","2631273":"General Strategies for Assessing Convergence of MCMC Algorithms Using Coupled Sample Paths","26587091":"Hierarchical Bayesian Approach and Genetic Algorithm in Illustrating Customer Preference and Market Segmentation","2295402":"Blocking Gibbs Sampling in Very Large Probabilistic Expert Systems","13497985":"Flexible Bayesian Modelling for Survival Data","2639462":"Bayesian Analysis of Spatial Point Patterns From Noisy Observations","262941154":"Estimation of diagnostic test accuracy without full verification: A review of latent class methods","2707065":"Bayesian Models for Non-Linear Autoregressions","268296620":"Blocking Gibbs Sampling for Inference in Large and Complex Bayesian Networks With Applications in Genetics","273182233":"LED Lighting System Reliability Modeling and Inference via Random Effects Gamma Process and Copula Function","4902430":"A full-factor multivariate GARCH model","2805375":"A General Bayesian Model for Testlets: Theory and Applications","234812324":"Statistical inference and data mining","225401653":"Predator-prey models: An application for the plankton dynamics of lake Geneva","246868189":"Monte Carlo EM Estimation for Time Series Models Involving Counts","4996640":"Control Variates for the Metropolis-Hastings Algorithm","220451667":"Statistical Themes and Lessons for Data Mining","281464503":"Journal of Geophysical Research: Solid Earth","259141900":"Signal segmentation using changing regression models with application in seismic engineering","223292367":"Autologistic modelling of susceptibility to landsliding in the Central Apennines, Italy","14397017":"Another look at the relationship between protein intake and dialysis dose","263688501":"Analysis of binary data with the possibility of wrong ascertainment","227752720":"Markov Beta and Gamma Processes for Modelling Hazard Rates","267258216":"Bayesian Analysis of Survival Models with Bathtub Hazard Rates Bayesian Analysis of Survival Models with Bathtub Hazard Rates","12639815":"Uncertainty in Estimating Exposure Using a Toxicokinetic Model: The Example of 2,3,7,8-Tetrachlorodibenzo-p-Dioxin","268887681":"Permutation, Parametric, Bootstrap Tests of Hypotheses","11896380":"Quantitative Genetics in the Age of Genomics","222856134":"Bayesian inference for long-term prediction of significant wave height","243765270":"Modelling Complexity: Applications of Gibbs Sampling in Medicine","23633914":"Subsampling the Gibbs sampler: variance reduction","2725563":"Studies of Neurological Transmission Analysis using Hierarchical Bayesian Mixture Models","2827965":"Representations of thermodynamic variability in the automated understanding of FLIR scenes","233077619":"Trend Test and Change-Point Detection for the Annual Discharge Series of the Yangtze River at the Yichang Hydrological Station","216775292":"Observations and stochastic modeling of soil moisture control on evapotranspiration in a Californian oak savanna. Water Resour Res 44:","230873947":"Estimating Risk Determinants of HIV and TB in South Africa","2531002":"Hybrid Propagation in Junction Trees","221305752":"A Unified Framework for Peak Detection and Alignment: Application to HR-MAS 2D NMR Spectroscopy.","2248335":"Bassist - a tool for MCMC simulation of statistical models","220504969":"Posterior Sampling When the Normalizing Constant is Unknown","259045825":"Signal Segmentation Using Changing Regression Models with Application in Seismic Engineering","260632894":"A Bayesian Approach for System Reliability Analysis With Multilevel Pass-Fail, Lifetime and Degradation Data Sets","264956285":"An Iterative Monte Carlo Scheme for Generating Lie Group-Valued Random Variables","227773226":"Constructing First Order Stationary Autoregressive Models via Latent Processes","251152451":"Model Selection in Markov Random Fields for High Spatial Resolution Hyperspectral Data","228541219":"Estimation and Inference via Bayesian Simulation: An Introduction to Markov Chain Monte Carlo","11759119":"Mathematical modeling of Clostridium difficile infection","226077639":"Simulating posterior Gibbs distributions: a comparison of the Swendsen-Wang and Gibbs sampler methods","2520728":"Disaggregation of rainfall time series via Gibbs sampling","233259814":"A Criterion for Optimal Predictive Model Selection","24268725":"Model Uncertainty in Claims Reserving within Tweedie\u0027s Compound Poisson Models","245481576":"Inverse problems: A Bayesian perspective","249866280":"Petrophysical seismic inversion conditioned to well-log data: Methods and application to a gas reservoir","266248467":"BAYESIAN LEARNING FOR NEURAL NETWORKS Bayesian Learning for Neural Networks","222471059":"Receptor modeling of VOCs, CO, NOx, and THC in Taipei","228961142":"Bayesian model selection applied to self-noise geoacoustic inversion","13366803":"Gibbs sampler for the logistic model in the analysis of longitudinal binary data","229573494":"Determination of manatee population trends along the Atlantic coast of Florida using a Bayesian approach: With temperature-adjusted aerial survey data","254333428":"Bayesian Computations for a Class of Reliability Growth Models","221623274":"A statistical framework for biomarker identification of biopsies using HR-MAS HSQC spectroscopy","38005916":"Mitigating timing noise in ADCs through digital post-processing","228469631":"A role for Bayesian inference in cetacean population assessment","38339757":"Analysis of a nonreversible Markov chain sampler","227662717":"‘Steady State Priors for Vector Autoregressions’","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","280536660":"Clustered data analysis under miscategorized ordinal outcomes and missing covariates","3192512":"A unified approach for modeling longitudinal and failure time data, with application in medical monitoring","227425151":"From Metropolis to Diffusions: Gibbs States and Optimal Scaling. Stochastic Process","222944191":"Gibbs sampling for parameters estimation and change-points detection in inverse problems. Application to electromagnetic imaging","243615858":"Stochastic geometry models in high-level vision","243048577":"Bayesian Versus Frequentist Approach of the Frailty Cox Model, Application to Calf Gastroenteritis","220056544":"Approximate forward-backward algorithm for a switching linear Gaussian model","225860489":"A process-convolution approach to modelling temperatures in the North Atlantic Ocean (Disc: P191-192)","221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","226912900":"Reversible algorithm of simulating multivariate densities with multi-hump","2672427":"Parallel computing and Monte Carlo algorithms","226036337":"The Pharmacokinetics of Saquinavir: A Markov Chain Monte Carlo Population Analysis","38339907":"Importance sampling for families of distributions","242577766":"Annealing Markov Chain Monte Carlo with Applications to Ancestral Inference","249047490":"Bayesian mixed‐effects model analysis of a censored normal distribution with animal breeding applications","228573826":"On Adaptive Metropolis-Hastings Methods","255574053":"BIVARIATE STOCHASTIC VOLATILITY MODELS APPLIED TO AIR POLLU TION DATA","13496301":"Modelling Risk from a Disease in Time and Space","246262159":"Full Likelihood Inference in Normal-Gamma Stochastic Frontier Models","220056126":"Bayesian variable selection and model averaging in the arbitrage pricing theory model","243044697":"Exact inference in four-parameter generalized gamma distributions","233798345":"Global Alignment of Protein–Protein Interaction Networks","33027793":"Dynamic Rating of Sports Teams. (REVISED 1999)","238168347":"Extreme hurricane wind speeds: Estimation, extrapolation and spatial smoothing","226564781":"Fast and Robust General Purpose Clustering Algorithms","255653905":"Growth in Thickness of Monumental English Oaks Quercus Oobur, and Their Age, Health Status and Dust Fall in Bayesian Approach","14491634":"MCMC methods for putative pollution source problems in environmental epidemiology","1742645":"Principle of detailed balance and convergence assessment of Markov Chain Monte Carlo methods and simulated annealing","14491630":"Bayesian Estimates of Disease Maps: How Important Are Priors?","2737937":"Bayesian Nonparametric Binary Response Regression Models with Application in Environmental Management","228749981":"Nonparametric Bayes estimators for hazard functions based on right censored data","2852713":"A Simulation Approach to Convergence Rates for Markov Chain Monte Carlo Algorithms","11794416":"An ecological analysis of leukemia incidence around the highest 137Cs concentration in Poland","243044664":"Bayesian Multivariate Poisson Regression","229749495":"Statistical analysis of economic time series via Markov switching models","235606338":"A Review and an Empirical Comparison of Joint Mapping of Multiple Diseases","23635490":"Extended constructions of stationary autoregressive processes","236583254":"A Markov Chain Monte Carlo Scheme for Parameter Estimation and Inference in Conceptual Rainfall-Runoff Modeling","227705537":"A Full Bayesian Non‐parametric Analysis Involving a Neutral to the Right Process","266379443":"The dynamics of household dissolution and change in socio-economic position: A survival model in a rural South Africa","257701892":"Hierarchical Mixture Models in Neurological Transmission Analysis","222552603":"Nonparametric Bayesian estimation from interval-censored data using Monte Carlo methods","2787190":"Analysis of Aerial Survey Data on Florida Manatee Using Markov Chain Monte Carlo","240802107":"Bayesian Inference with Probability Matrix Decomposition Models","227425005":"Geometric ergodicity of Metropolis algorithms","267933851":"Bayesian Nonparametric Estimation of Hazard Rate in Survival Analysis Using Gibbs Sampler","261118198":"Bayesian Estimation Based on Beta Prior in Cure Model","263721171":"Effects of Random Noise and Internal Delay in Nonlinear Psychophysics","256718886":"Simultaneous estimation of spatially distributed thermal conductivity, heat capacity and surface heat transfer coefficient in thermal tomography","15150987":"Assessing the significance of chromosome-loss data: Where are suppressor genes for bladder cancer?","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","2676549":"Statistical Inference For Gravity Models In Transportation Flow Forecasting","243011853":"Expectations for Nonreversible Markov Chains","244967918":"Introducing a parallel transit evaluation method into the sequential Boltzmann machine","271466326":"Cramér-Rao lower bound for breakpoint distance estimation in a path-loss model","2553692":"Diagnostic Measures for Model Criticism","2754390":"Comparing Explanations of Fertility Decline Using Event History Models with Unobserved Heterogeneity","2852694":"Faithful Couplings of Markov Chains: Now Equals Forever","2461528":"A New Method for Coupling Random Fields","228512481":"Evolutionary dynamics on small-world networks","4960201":"Bayesian Prediction with Cointegrated Vector Autoregressions","251187579":"STREAMLINE-BASED HISTORY MATCHING: A REVIEW","220504737":"Sampling Methods for Wallenius\u0027 and Fisher\u0027s Noncentral Hypergeometric Distributions","226245370":"Catalytic Perfect Simulation","2332580":"Adjustment for Publication Bias and Quality Bias in Bayesian Meta-analysis","2430895":"Metropolized Independent Sampling with Comparisons to Rejection Sampling and Importance Sampling","229878307":"A hierarchical model for non-stationary multivariate extremes: A case study of surface-level ozone and NOx data in the UK","248799558":"Lithologic tomography: From plural geophysical data to lithology estimation","4773850":"Bayesian selection of threshold autoregressive models","38350298":"Convergence properties of perturbed Markov chains","2860990":"Combinatorial identities associated with CFTP","262844479":"Trends in epidemiology in the 21st century: Time to adopt Bayesian methods","246921504":"Conditional expectations and residual analysis for the linear model","41371118":"Implementation of gaussian process models for non-linear system identification","227564041":"Simulation‐Based Bayesian Econometric Inference: Principles and Some Recent Computational Advances","226046683":"Langevin-Type Models I: Diffusions with Given Stationary Distributions and their Discretizations*","228084282":"A O(nm log(U/n)) time maximum flow algorithm","2359168":"On Markov Chain Monte Carlo Methods For Nonlinear And Non-Gaussian State-Space Models","2676619":"Modeling the History of Diabetic Retinopathy","224150266":"Improved quantification of MRI relaxation rates using Bayesian estimation","248807795":"Bivariate extreme value distributions: An application of the Gibbs sampler to the analysis of floods","281034600":"Modeling a Mixture of Linear and Changepoint Trajectories for Longitudinal Time-Series Data","51915953":"The inefficiency of re-weighted sampling and the curse of system size inhigh order path integration","14069628":"A statistical model for locating regulatory elements in genomic DNA. J Mol Biol 268, 8-14","222704365":"Bayesian analysis of nested logit models by Markov Chain Monte Carlo","220084915":"Bayesian network management","12334861":"Risk of HIV infection as a function of the duration of intravenous drug use: A non-parametric Bayesian approach","2269073":"MCMC Estimation of Classical and Dynamic Switching and Mixture Models","3319688":"QAM constellation classification based on statistical sampling for linear distortive channels","2862992":"Extremes in Operational Risk Management","234039880":"Monte Carlo Methods In Geophysical Inverse Problems","222143226":"Population heterogeneity and growth","232725015":"ISRN-Gibbs","254288098":"A Nonstationary Multisite Model for Rainfall","5144452":"Bayesian Analysis of the Stochastic Switching Regression Model Using Markov Chain Monte Carlo Methods","238864880":"Modelling correlated count data with covariates","3192829":"Synchronous random fields and image restoration","263346301":"Hierarchical Bayesian Approach to a Multi-Site Hidden Markov Model","220504821":"Bayesian Approach to Multicentre Sparse Data","24172195":"Accelerated test system strength models based on Birnbaum-Saunders distribution: A complete Bayesian analysis and comparison","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","226505300":"Difficulties in the use of auxiliary variables in Markov chain Monte Carlo methods","236167620":"Automated scoring of complex tasks in computer-based testing","222655141":"Bayesian modeling of several covariance matrices and some results on propriety of the posterior for linear regression with correlated and/or heterogeneous errors","230386262":"Statistical analysis and reliability prediction with short fatigue crack data","222646955":"Bayesian estimation of state space models using Metropolis-Hastings algorithm within Gibbs sampling","222663339":"Modeling extreme rainfalls using a modified random pulse Bartlett-Lewis stochastic rainfall model (with uncertainty)","30072383":"Computational statistics with environmental and remote sensing applications","6789010":"Linking data to models: Data regression","12883763":"Optimal design for a study of butadiene toxicokinetics in humans. Toxicol Sci","220578526":"Exact and approximate inference in ProBT"},"index":78}