{"abs":"We present a cross-entropy (CE)-based method to design 2-D zero reference codes (ZRCs) with minimum diffractive effects. Without diffraction effects, the optimum ZRC design problem is known as autocorrelation approximation. However, in high-resolution grating systems, limitations are given by the diffraction in the design of ZRCs. If the diffraction is considered, the output signal registered in the photodiode will widen and degrade, invalidating the autocorrelation approximation for the 2-D ZRC design. To minimize the diffractive effects in the design of 2-D ZRC, this paper first formulates the 2-D ZRC design problem with diffractive effects as a particular combinatorial optimization problem. Next, it proposes the application of the CE method to solve the problem. Compared with the conventional genetic algorithm (GA)-assisted 2-D ZRC design method, the simulation results show that the proposed CE method obtains better 2-D ZRCs that are less sensitive to diffractive effects. About 11.43 times less searching is required for the proposed CE method than for the GA. This indicates that the proposed CE method can obtain good ZRCs with minimum diffractive effects while maintaining low complexity.","title":"Cross-Entropy Method for the Optimization of Optical Alignment Signals With Diffractive Effects","id":246809334,"url":"https://www.researchgate.net/publication/246809334_Cross-Entropy_Method_for_the_Optimization_of_Optical_Alignment_Signals_With_Diffractive_Effects","names":["Jung-Chieh Chen","Sen-Hung Wang","Ming-Kai Lee","Chih-Peng Li","Journal of Lightwave Technology"],"references":{"228940071":"Cross-Entropy Method","224602891":"Receive Antenna Selection for MIMO Systems over Correlated Fading Channels","7093574":"Design of two-dimensional zero reference codes with a genetic algorithm","228989452":"The Cross-Entropy Method for Estimation","245172305":"Alignment measurement of two-dimensional zero-reference marks","49664217":"Optimization of Zero-Reference Grating Considering Tip Distortions for Scanning Probe Microscopy Drift Measurement","3421592":"Enhancing Genetic Feature Selection Through Restricted Search and Walsh Analysis","271513121":"The Cross-Entropy Method","44687801":"Design of two-dimensional zero reference codes with cross-entropy method","221725058":"Introduction To Fourier Optics","224484246":"Design and analysis of two-dimensional zero-reference marks for alignment systems","26265705":"Design of two-dimensional zero reference codes by means of a global optimization method","231101469":"A new method for the design of zero reference marks for grating measurement systems","228673562":"Outage Statistics in a Waveplate Hinge Model of Polarization-Mode Dispersion","40484277":"Design of zero reference codes using cross-entropy method","3244588":"Design of Two-Dimensional Optical Alignment Signals Robust to Diffractive Effects","227724300":"Nanoalignment mask fabricated directly on Si by AFM"},"citedIn":{"272747345":"Self-Organizing Scheme for Machine-to-Machine Networks Based on Cross-Entropy Method","283874475":"Improved OFDM Allocation Scheme for Crosstalk Mitigation in Multiple Free-Space Optical Interconnection Links","260510164":"Cross-Entropy Optimization for the Design of Fiber Bragg Gratings","263128748":"Efficient Identification Method for Power Line Outages in the Smart Power Grid","250000592":"Robust Design of Two-Dimensional Optical Reference Signals Against Diffraction Effects","273618056":"On the benefits of Laplace samples in solving a rare event problem using cross-entropy method","265339656":"Adaptive Resource Allocation Algorithm Based on Cross-Entropy Method for OFDMA Systems","267755180":"Chapter 4. Reducing the Kullback-Leibler Distance: The Cross-Entropy Method for Optimization","275946239":"Optimization of Logistics: Theory \u0026 Practice"},"index":783}