{"abs":"This article is concerned with prediction of a function y(t) over a (multidimensional) domain T, given the function values at a set of “sites” {t , t , …, t } in T, and with the design, that is, with the selection of those sites. The motivating application is the design and analysis of computer experiments, where t determines the input to a computer model of a physical or behavioral system, and y(t) is a response that is part of the output or is calculated from it. Following a Bayesian formulation, prior uncertainty about the function y is expressed by means of a random function Y, which is taken here to be a Gaussian stochastic process. The mean of the posterior process can be used as the prediction function ŷ(t), and the variance can be used as a measure of uncertainty. This kind of approach has been used previously in Bayesian interpolation and is strongly related to the kriging methods used in geostatistics. Here emphasis is placed on product linear and product cubic correlation functions, which yield prediction functions that are, respectively, linear or cubic splines in every dimension. A posterior entropy criterion is adopted for design; this minimizes the expected uncertainty about the posterior process, as measured by the entropy. A computational algorithm for finding entropy-optimal designs on multidimensional grids is described. Several examples are presented, including a two-dimensional experiment on a computer model of a thermal energy storage device and a six-dimensional experiment on an integrated circuit simulator. Predictions are made using several different families of correlation functions, with parameters chosen to maximize the likelihood. For comparison, predictions are also made via least squares fitting of various polynomial and spline models. The Bayesian design/prediction methods, which do not require any modeling of y, produce comparatively good predictions. For some correlation functions, however, the 95% posterior probability intervals do not give adequate coverage of the true values of y at selected test sites. These methods are fairly simple and offer considerable potential for virtually automatic implementation, although further development is needed before they can be applied routinely in practice.","title":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","id":254287318,"url":"https://www.researchgate.net/publication/254287318_Bayesian_Prediction_of_Deterministic_Functions_with_Applications_to_the_Design_and_Analysis_of_Computer_Experiments","names":["Carla Currin","Toby Mitchell","Max Morris","Don Ylvisaker","Journal of the American Statistical Association"],"references":{"227424334":"Existence of smoothed stationary processes on an interval","30975450":"A Bayesian Approach to Prediction Using Polynomials","235051264":"Design Problems for Optimal Surface Interpolation","42635916":"Mathematical Theory of Communication","233373487":"Maximum Entropy Sampling","258194084":"Bayesian Numerical Analysis","269005056":"An Algorithm for the Construction od D-Optimal Experimental Design","30962641":"Problems With Likelihood Estimation of Covariance Functions of Spatial Gaussian Processes","234102591":"An Algorithm for the Construction of “D-Optimal” Experimental Designs","245893283":"Designs for Computer Experiments","38364549":"A Correspondence Between Bayesian Estimation on Stochastic Processes and Smoothing by Splines","228007110":"Maximum Entropy Sampling","30990539":"Model Robust Response Surface Designs: Scaling Two-Level Factorials","38367066":"On the Measure of Information Provided by an Experiment","236534528":"A Bayesian Approach to the Design and Analysis of Computer Experiments","232128911":"Statistical Inference for Spatial Processes. Cambridge University Press, Cambridge","238247273":"Improper Priors, Spline Smoothing and the Problem of Guarding Against Model Errors in Regression","247645784":"Statistics, Data Analysis in Geology","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","245702331":"Comments to `Linear Smoothers and Additive Models","243768225":"A Predictive Approach to Model Selection","38359407":"Uniform Asymptotic Optimality of Linear Predictions of a Random Field Using an Incorrect Second-Order Structure","267670930":"Curve fitting and optimal design for prediction","234814104":"A mathematical theory of communication. AT\u0026T Tech J","222490346":"Minimax and Maximin Distance Designs","38359073":"Optimal Bayesian Experimental Design for Linear Models","254286147":"The Signal Extraction Approach to Nonlinear Regression and Spline Smoothing","38366373":"An Approach to Time Series Analysis","251424976":"Parameter Uncertainty in Estimation of Spatial Functions: Bayesian Analysis","243082003":"Bayes’ Theorem and the Use of Prior Knowledge in Regression Analysis","38360121":"Prediction and Design","267182429":"“Bayes Estimates for the Linear Model.”","230872689":"Discrimination Among Mechanistic Models","261624813":"Statistics and Data Analysis in Geology","37796538":"Applied Statistical Decision Theory","31354848":"Maximum Likelihood Estimation of Models for Residual Covariance in Spatial Regression","31291938":"A Note on Bayes Designs for Inference Using a Hierarchical Linear Model"},"citedIn":{"225120104":"Reliability-based design optimization for crashworthiness of vehicle side impact","271939126":"A two-stage multi-objective optimisation of vehicle crashworthiness under frontal impact","222238011":"A comparative study of boundary-based intelligent sampling approaches for nonlinear optimization","236687903":"A Gaussian Process Emulator Approach for Rapid Contaminant Characterization with an Integrated Multizone-CFD Model","220439339":"Comprehensive multivariate extrapolation modeling of multiprocessor cache miss rates","42606210":"Decision-Theoretic Sensitivity Analysis for Complex Computer Models","265258439":"Evolving Bayesian Emulators for Structured Chaotic Time Series, with Application to Large Climate Models","257821524":"Design of Computer Experiments for Metamodel Generation","229743547":"Fisher information and maximum likelihood estimation of covariance parameter in Gaussian stochastic processes","254042923":"Use of Kriging Models to Approximate Deterministic Computer Models","267010555":"Recent developments in applied probability and statistics. Dedicated to the memory of Jürgen Lehn","242549351":"Derivative Free Surrogate Optimization for Mixed-Integer Nonlinear Black Box Problems in Engineering","257199425":"Projection array based designs for computer experiments","228738485":"Ch. 7. A review of design and modeling in computer experiments","256744276":"Multi-output local Gaussian process regression: Applications to uncertainty quantification","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","264958416":"Two-level fractional factorials and Bayesian prediction","254333234":"Design and Analysis for an Inverse Problem Arising From an Advection—Dispersion Process","242123854":"Analytical Uncertainty Propagation via Metamodels in Simulation-Based Design under Uncertainty","242235985":"Accurate emulators for large-scale computer experiments","222400355":"A new response surface methodology for reliability-based design optimization","4742252":"Empirical Bayesian Analysis for Computer Experiments Involving Finite-Difference Codes","226763682":"Probabilistic Inference for Future Climate Using an Ensemble of Climate Model Evaluations","24083783":"Marginally restricted D-optimal designs for correlated observations","229358467":"Batch sequential designs for computer experiments","267765213":"Fast and optimal nonparametric sequential design for astronomical observations","271511557":"Computer emulation with non-stationary Gaussian processes","263499679":"Estimating Percentiles in Computer Experiments: A Comparison of Sequential-Adaptive Designs and Fixed Designs","227706302":"Efficient Sampling Technique for Optimization Under Uncertainty","238833171":"Global Optimization of Stochastic BlackBox Systems via Sequential Kriging Meta-Models","222523244":"Comparisons of Designs for Computer Experiments","285624630":"Statistical Methods for Data Center Thermal Management","226202442":"D\n-optimal Designs and Equidistant Designs for Stationary Processes","268352972":"Boom Minimization Framework for Supersonic Aircraft Using CFD Analysis","266098159":"Uncertainty And Sensitivity Analysis For Long-Running Computer Codes: A Critical Review","222529398":"Eutrophication Risk Assessment Using Bayesian Calibration of Process-Based Models: Application to a Mesotrophic Lake","4899967":"The Limiting Behavior of the Estimated Parameters in a Misspecified Random Field Regression Model","277932709":"Robust Parameter Design With Computer Experiments Using Orthonormal Polynomials","239808119":"Introducing multivator: A Multivariate Emulator","222427005":"Calculations of Sobol indices for the Gaussian process metamodel","225516876":"Metamodels for Computer-based Engineering Design: Survey and recommendations","220674329":"A comparison of experimental designs in the development of a neural network simulation metamodel","271656975":"Reallocation of testing resources in validating optimal designs using local domains","250754765":"28 Model robust designs","239666185":"An Algorithm using Quadratic Interpolation for Unconstrained Derivative Free Optimization","46538887":"A smoothing algorithm for estimating stochastic, continuous time model parameters and its application to a simple climate model","4742154":"Bayes Linear Calibrated Prediction for Complex Systems","264921993":"Estimating sensitivity indices based on Gaussian process metamodels with compactly supported correlation functions","222532871":"Optimal control","226964942":"Bayesian quadrature with non-normal approximating functions","226609101":"Spatial sampling and the environment: Some issues and directions","225577278":"Frequency distributions of transient regional climate change from perturbed physics ensembles of general circulation model simulations. Clim Dyn","228780015":"Efficient Emulators for Multivariate Deterministic Functions","242307647":"Probabilistic Inference for Future Climate Using an Ensemble of Simulator Evaluations","245093077":"A Surrogate-Model-Based Method For Constrained Optimization","236624980":"Trust region model management in multidisciplinary design optimization","243464915":"ENFOQUE BAYESIANO PARA LA INVERSIÓN NO PARAMÉTRICA DE MEDICIONES DE DISPERSIÓN DE LUZ","268402604":"Spatially adapted experimental design for computer experiments Contents","2242166":"Detecting Near Linearity in High Dimensions","4744220":"Bayesian Forecasting for Complex Systems Using Computer Simulators","233044407":"A Nonstationary Statistical Model for Computationally Intensive Numerical Ordinary Differential Systems","228475851":"Limit Kriging","254331262":"Multivariate Gaussian Process Emulators With Nonseparable Covariance Structures","248999040":"Identification of Elastic Properties of Composite Laminates","266396599":"Computer experiments with functional inputs and scalar outputs by a norm-based approach","228761083":"Inference for Deterministic Simulation Models: The Bayesian Melding Approach","225689898":"A response-modeling approach to global optimization and OUU","220668798":"The Knowledge-Gradient Policy for Correlated Normal Beliefs","223525128":"Optimization of concrete hollow brick using hybrid genetic algorithm combining with artificial neural networks","2738802":"Uncertainty Analysis and other Inference Tools for Complex Computer Codes","220253054":"Determining output uncertainty of computer system models","227704780":"Design and Analysis for the Gaussian Process Model","230378469":"Bayesian process optimization using failure amplification method","280309972":"Surrogate models and mixtures of experts in aerodynamic performance prediction for aircraft mission analysis","228376056":"A Bayesian Approach to the Design and Analysis of Fractionated Experiments","241509888":"Screening the Input Variables to a Computer Model Via Analysis of Variance and Visualization","239340588":"Construction of the radial basis function based on a sequential sampling approach using cross-validation","200018821":"Variable metric methods for unconstrained optimization and nonlinear least squares","220504909":"Generalized Quasi-Regression","228780489":"Predicting Vehicle Crashworthiness: Validation of Computer Models for Functional and Hierarchical Data","228020731":"Modelling with Deterministic Computer Models","222576436":"Reified Bayesian modeling and inference for physical systems","282514598":"Surrogate Preposterior Analyses for Predicting and Enhancing Identifiability in Model Calibration","46267571":"Computer and physical experiments: design, modeling, and multivariate interpolation","254424408":"Bayes Linear Uncertainty Analysis for Oil Reservoirs Based on Multiscale Computer Experiments","257338146":"Contour estimation via two fidelity computer simulators under limited resources","263609282":"Comparing Computer Experiments for the Gaussian Process Model Using Integrated Prediction Variance","226172174":"Bayesian Analysis of Computer Model Outputs","23632158":"Optimal scaling of two-level factorial experiments","226128134":"A Kriging Approach to the Analysis of Climate Model Experiments","229304790":"A Bayesian analysis of the thermal challenge problem","27522014":"An Efficient Robust Concept Exploration Method and Sequential Exploratory Experimental Design","242389519":"Factorial Sampling Plans for Preliminary Computational Experiments","12704835":"Comparison of empirical strategies to maximize GENEHUNTER lod scores","220165020":"Statistical Equivalent Models for Computer Simulators with an Application to the Random Waypoint Mobility Model","268573313":"Sequential Metamodeling in Engineering Design","257159637":"A calibration and data assimilation method using the Bayesian MARS emulator","273835221":"The depth-design: An efficient generation of high dimensional computer experiments","263684415":"Global Sensitivity Analysis for Mixture Experiments","243102965":"Small Sample Bayesian Designs for Complex High-Dimensional Models Based on Information Gained Using Fast Approximations","221527482":"The influence of correlation functions on stochastic kriging metamodels","265974602":"Optimized Experimental Designs for Metamodeling: Algorithm","227413790":"Mechanism-based emulation of dynamic simulation models: Concept and application in hydrology","3422373":"Robustness optimization for vehicular crash simulations","257334727":"Approximation methods in multidisciplinary analysis and optimization: A panel discussion","265471299":"Bayesian inference of a lake water quality model by emulating its posterior density","228420879":"Toward a Reliable Quantification of Uncertainty on Production Forecasts: Adaptive Experimental Designs","228936502":"Computer model calibration or tuning in practice","223123935":"Prediction of deterministic functions: an application of a Gaussian kriging model to a time series outlier problem. Computational Statistics \u0026 Data Analysis, 44, 477-491","227424537":"Integration of covariance kernels and stationarity","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","2368701":"Design Of Spatial Experiments: Model Fitting And Prediction","264182054":"Empirical Optimality of Coverage Design Criteria for Space-Filling Designs","265738058":"Quality assessment of data-based metamodels for multi-objective aeronautic design optimisation","271830191":"Enhancing physiologic simulations using supervised learning on coarse mesh solutions","237623990":"Uncertain reduction and characterization for complex environmental fate and transport models: An empirical Bayesian framework incorporating the stochastic response surface method","226999079":"An engineering design methodology with multistage Bayesian surrogates and optimal sampling","51948989":"Requirements for a New Detector at the South Pole Receiving an\nAccelerator Neutrino Beam","266652482":"Optimization design of NJ shaped guardrail based on collision safety consideration","24083400":"Optimal orthogonal-array-based Latin hypercubes","228020543":"Banking, Statistics in","255948266":"Multiobjective design of aquifer monitoring networks for optimal spatial prediction and geostatistical parameter estimation","254331268":"Sequential Design and Analysis of High-Accuracy and Low-Accuracy Computer Codes","280320538":"A Surrogate-based Adaptive Sampling Approach for History Matching and Uncertainty Quantification","230286088":"Investigation of an adaptive sampling method for data interpolation using radial basis functions","225691072":"Improving multi-objective genetic algorithms with adaptive design of experiments and online metamodeling","46493814":"Unbiased generalized quasi-regression","277932583":"Stochastic Polynomial Interpolation for Uncertainty Quantification With Computer Experiments","4745456":"Nonseparable, Stationary Covariance Functions for Space-Time Data","216301661":"Screening, Predicting, and Computer Experiments","2952852":"A Data-Analytic Approach to Bayesian Global Optimization","245311014":"Optimizing Latin hypercube design for sequential sampling of computer experiments","273067772":"Mercer kernels and integrated variance experimental design: connections between Gaussian process regression and polynomial approximation","229642507":"Design and analysis of computer experiments when the output is highly correlated over the input space","259261876":"An empirical study of the prediction performance of space-filling designs","225123240":"Multiobjective optimization for crash safety design of vehicles using stepwise regression model","225321901":"Comparing and generating Latin Hypercube designs in Kriging models","27539809":"Contributions to computer experiments and binary time series","223573397":"Minimax distance designs in two-level factorial experiments","222224888":"Nonlinear prediction by kriging, with application to noise cancellation","263005546":"Metamodeling in Multidisciplinary Design Optimization: How Far Have We Really Come?","241216681":"Bayesian Guided Pattern Search for Robust Local Optimization","251621940":"A general statistical model for computer experiments with time series output","7851687":"Stepwise mutation likelihood computation by sequential importance sampling in subdivided population models","265987339":"Development and Implementation of Bayesian Computer Model Emulators","247697426":"Taguchi\u0027s Parameter Design: A Panel Discussion","224352142":"A Statistical Framework for the Sensitivity Analysis of Radiative Transfer Models","228781424":"UNCERTAINTY QUANTIFICATION BASED MULTI-OBJECTIVE OPTIMIZATION FOR CRASHWORTHINESS DESIGN","257392005":"A new approach for reliability analysis with time-variant performance characteristics","231537433":"Recursive co-kriging model for Design of Computer experiments with multiple levels of fidelity","267180340":"SEQUENTIAL ADAPTIVE DESIGNS IN COMPUTER EXPERIMENTS FOR RESPONSE SURFACE MODEL FIT","271511799":"Computer emulation with non-stationary Gaussian processes","241061508":"PCA-based dimension reduction for splines","283378238":"Screening","254329843":"Gaussian Surrogates for Computer Models With Time-Varying Inputs and Outputs","222679450":"Convergence properties of the expected improvement algorithm with fixed mean and covariance functions","222135261":"Exploratory Designs for Computational Experiments","252221417":"Probabilistic uncertainty analysis of an FRF of a structure using a Gaussian process emulator","267080969":"Screening. Methods for experimentation in industry, drug dicovery, and genetics","264857903":"Blind Kriging: A New Method for Developing Metamodels","237453504":"Review of Metamodeling Techniques in Support of Engineering Design Optimization","261595007":"Response to James M. Lucas","261373310":"Trend Mining for System Reliability Employing a Novel Heuristic-based Kriging Profiling Method","2243276":"Quasi-Regression","237903552":"An Error Assessment of the Kriging Based Approximation Model Using a Mean Square Error","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","282320956":"Robust aeroelastic design of composite plate wings","263522117":"Asymmetric Nested Lattice Samples","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","277555834":"Designing Efficient Computer Experiments - The Step Beyond Finite Element Modelling","283331095":"An Adaptive Bayesian Sequential Sampling Approach for Global Metamodeling","2365648":"Bayesian Analysis of Computer Code Outputs","268049679":"A representation theorem for stochastic processes with separable covariance functions, and its implications for emulation","277293681":"Adaptive design of supercomputer experiments","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","222205897":"An illustrative case study on application of learning based ordinal optimization approach to complex deterministic problem","280329794":"Emulation of Higher-Order Tensors in Manifold Monte Carlo Methods for Bayesian Inverse Problems","245426264":"Preference-Based Surrogate Modeling in Engineering Design","223912354":"Latin Hypercube Sampling and the Propagation of Uncertainty in Analyses of Complex Systems, Technical Report, SAND2001-0417","227103091":"Unbiased Quasi-regression*","225938314":"Global and mid-range function approximation for engineering optimization","4772685":"Estimating percentiles of uncertain computer code outputs","227227789":"Sequential Design of Computer Experiments for Constrained Optimization","251543032":"Multi-objective crashworthiness optimization of tapered thin-walled tubes with axisymmetric indentations","245582244":"Bayesian Validation of a Computer Model for Vehicle Crashworthiness","260544128":"Calibration and Uncertainty Analysis for Computer Simulations with Multivariate Output","245571499":"Influence of Correlation Functions on Maximum Entropy Experimental Design","222516810":"A survey of truncated-Newton methods","223273540":"Input screening: Finding the important model inputs on a budget","252582913":"Using Statistical and Computer Models to Quantify Volcanic Hazards","251729936":"Building Surrogate Models Based on Detailed and Approximate Simulations","5518662":"Predictive Haemodynamics in a One-Dimensional Human Carotid Artery Bifurcation. Part II: Application to Graft Design","4053807":"Developing efficient simulation methodology for complex queueing networks","222677590":"Evolution and state-of-the-art in integer programming","228725430":"A Dynamic Modelling Strategy for Bayesian Computer Model Emulation","285236758":"Enriched Performance Measure Approach (PMA+) for Reliability-Based Design Optimization","2465599":"Stationary Processes on 2^k for Bayesian Experimental Design","229348534":"Experimental designs for the determination of key reactions in photochemical models: Application to the photochemistry of hydrocarbons in the atmosphere of Titan","231424232":"A grade of membership model for rank data","237548813":"Choosing the Sample Size of a Computer Experiment: A Practical Guide","220259335":"Consistency of Sequential Bayesian Sampling Policies","226923694":"Survey of modeling and optimization strategies to solve high-dimensional design problems with computationally-expensive black-box functions","254363651":"A Bayesian MetaModeling Approach for Gaussian Stochastic Process Models Using a Non Informative Prior","256070253":"Computer emulation with non-stationary Gaussian processes","223072357":"Sampling plans based on balanced incomplete block designs for evaluating the importance of computer model inputs","245314987":"Improving the accuracy of vehicle crashworthiness response predictions using an ensemble of metamodels","228736151":"… characterization for complex environmental fate and transport models: an empirical Bayesian framework incorporating the stochastic response surface method","228974227":"A Statistical Equivalent Model for Random Waypoint Mobility: A Case Study","222687347":"Complementarity problems","220677648":"A numerical study on the fatigue and rolling contact fatigue behaviour of PVD-coated steel and titanium spur gears","264224391":"Bayesian Metamodeling for Computer Experiments Using the Gaussian Kriging Models","233057502":"Reliable Estimation in Computer Experiments on Finite-Element Codes","2499357":"Markov Random Field Modeling in Median Pyramidal Transform Domain for Denoising Applications","226987194":"The Use of Statistical Tools for Evaluating Computer Simulations – An Editorial Essay","228855450":"Reliability-based multidisciplinary design optimization of a full vehicle system","30517394":"Contributions à la planification d\u0027expériences robuste à l\u0027erreur structurelle","2654062":"Optimal Designs Using CP Algorithms","221529726":"Simulation Optimization using Metamodels.","222543379":"Automatic differentiation of algorithms","228522188":"Fast Statistical Surrogates for Dynamical 3D Computer Models of Brain Tumors","264879249":"Bayesian Sequential Optimal Design of Computer Experiments","281291164":"Surrogate-Based Shape Optimization of Stall Margin and Efficiency of a Centrifugal Compressor","6665023":"Functional Network Topology Learning and Sensitivity Analysis Based on ANOVA Decomposition","222869015":"Quasi-regression with shrinkage","2407238":"Bayesian Analysis For Simulation Input And Output","245426626":"Multiresponse and Multistage Metamodeling Approach for Design Optimization","239799597":"Comments on Computer Experiments","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","48907661":"Méthodes d\u0027interpolation à noyaux pour l\u0027approximation de fonctions type boîte noire coûteuses","245366776":"A Clustering-Based Surrogate Model Updating Approach to Simulation-Based Engineering Design","227693306":"Eliciting Gaussian process priors for complex computer codes","268572520":"Survey of Modeling and Optimization Strategies for High-Dimensional Design Problems","227730169":"A Nonstationary Covariance Based Kriging Method for Metamodeling in Engineering Design","242525977":"Convergence to Global Optimality with Sequential Bayesian Sampling Policies","4815652":"The computational order of a DACE dynamical model","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","1899891":"Computer model validation with functional output","258229268":"A Review of Bayesian Variable Selection Methods: What, How and Which.","230752432":"Supersaturated designs for computer experiments: Comparison of construction methods and new methods of treatment adapted to the high dimensional problem","216756632":"Sequential Design of Computer Experiments to Minimize Integrated Response Functions","23527952":"Assessing Uncertainty in Urban Simulations Using Bayesian Melding","239348028":"An adaptive design and interpolation technique for extracting highly nonlinear response surfaces from deterministic models","271667017":"Physical Experimental Design in Support of Computer Model Development","269289845":"Sequential tuning of complex computer models","271667016":"Surrogate Modeling of Computer Experiments With Different Mesh Densities","229881038":"Empirical Kriging models and their applications to QSAR","4749622":"An efficient methodology for modeling complex computer codes with Gaussian processes","243102979":"Data Analytic Tools for Understanding Random Field Regression Models","228339939":"Diagnostics for Gaussian Process Emulators","225904882":"Computer experiments: A review","283634530":"A Random Process Metamodel Approach for Time-Dependent Reliability","236583327":"Analyzing input and structural uncertainty of nonlinear dynamic models with stochastic, time-dependent parameters","261730837":"Engineering Statistics","254463654":"Bayesian Kriging Analysis and Design for Stochastic Simulations","216756580":"Orthogonal Column Latin Hypercubes and Their Application in Computer Experiments","245314832":"Response surface method for solution of structural identification problems","34954629":"Bayesian Treed Gaussian Process Models","228561934":"Bayesian Networks, Influence Diagrams, and Games in Simulation Meta-modeling","254071478":"Enriched Performance Measure Approach (PMA+) for Reliability-Based Design","276174308":"Emulator Model–Based Analytical Solution for Reliability Sensitivity Analysis","269228953":"Surrogate Models and Mixtures of Experts in Aerodynamic Performance Prediction for Mission Analysis","225513703":"Sequential kriging optimization using multiple-fidelity evaluations","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","267454058":"Sensitivity Analysis for Computationally Expensive Models using Optimization and Objective-oriented Surrogate Approximations","234061935":"Comparing sampling strategies for aerodynamic Kriging surrogate models","263599147":"Modeling 3‐D spatio‐temporal biogeochemical processes with a forest of 1‐D statistical emulators","260391448":"Automating Emulator Construction for Geophysical Hazard Maps","257335027":"A multiparametric strategy for the two step optimization of structural assemblies. Struct Multi Optim","228382260":"Emulating the sensitivity of the HadSM3 climate model using ensembles from different but related experiments","241730501":"Follow-Up Experimental Designs for Computer Models and Physical Processes","228864523":"Integrated Analysis of Computer and Physical Experiments","11452190":"Chemical Library Subset Selection Algorithms: A Unified Derivation Using Spatial Statistics","228348453":"Analysis of Computer Experiments Using Penalized Likelihood in Gaussian Kriging Models","220385432":"A Bayesian Approach for Integration of Physical and Computer Experiments for Quality Improvement in Nano-composite Manufacturing","222548735":"Bayesian analysis of computer code outputs: A tutorial","275559340":"Radial basis function-based shape optimization of centrifugal impeller using sequential sampling","245078879":"Reducing computational costs for reliability indicators of electric power generating systems","268580299":"A Sequential Information-Theoretic Approach to Design of Computer Experiments","239667584":"A Framework for Validation of Computer Models","257774743":"Multi-objective structural optimization of a HAWT composite blade based on ultimate limit state analysis","259128509":"Maximin distance optimal designs for computer experiments with time-varying inputs and outputs","257153694":"Adaptive value function approximation for continuous-state stochastic dynamic programming","5142913":"Introducing BACCO, an R Bundle for Bayesian Analysis of Computer Code Output","222006516":"Aspects of smoothing and model inadequacy in generalized regression","27532917":"A concept exploration method for product family design","266376755":"Sequential Design with Mutual Information for Computer Experiments (MICE): Emulation of a Tsunami Model","251379496":"Extended Gaussian Kriging for computer experiments in engineering design","27529840":"A Systematic Process for Adaptive Concept Exploration","216300850":"On Sequential Sampling for Global Metamodeling in Engineering Design","279263090":"Kernel interpolation methods for estimating expensive black box functions","256744084":"Multi-output separable Gaussian process: Towards an efficient, fully Bayesian paradigm for uncertainty quantification","222540952":"Algorithmic Construction of Symmetric Latin Hypercube Designs","221527784":"Simulation Metamodels.","262371966":"A surrogate-based optimization method with RBF neural network enhanced by linear interpolation and hybrid infill strategy","222571161":"Spatial sampling design for parameter estimation of the covariance function","228939384":"Customer behavior model for quality-of-service environments with many service levels","232959548":"Analysis of Computer Experiments With Functional Response","38363031":"Bayesian Experimental Design: A Review","222846615":"Neural networks and response surface polynomials for design of vehicle joints","254282952":"Fast regression surrogates for computer models with time-dependent outputs","257017520":"Calibration of computer models with multivariate output","228736065":"The Stochastic Quantization method and its application to the numerical simulation of volcanic conduit dynamics under random conditions","222400676":"Optimal experimental design and some related control problems","264818734":"Engine block soundproofing: On meta-models of poroelastic materials for acoustic absorption and head injury criterion","222006993":"Finding maximin latin hypercube designs by Iterated Local Search heuristics","226736744":"Approximation of multiresponse deterministic engineering simulations: A dependent metamodeling approach","243712874":"COMBINATION OF SEM AND LIGHT SCATTERING DATA FOR THE INVERSE ESTIMATION OF PARTICLE SIZE DISTRIBUTION USING A BAYESIAN APPROACH","271621056":"A multi-objective optimization method based on Gaussian process simultaneous modeling for quality control in sheet metal forming","244348258":"Sampling Strategies for Computer Experiments: Design and Analysis","268441586":"IMPROVING ACCURACY AND COMPENSATING FOR UNCERTAINTY IN SURROGATE MODELING","227500156":"Bayesian meta-modeling of engineering design simulations: A sequential approach with adaptation to irregularities in the response behavior","278781801":"Iterative Designs of experiments for constraint approximation","220056297":"Non linear methods for Inverse Statistical Problems","242330501":"Surrogate-based Design Optimization with Adaptive Sequential Sampling","266406422":"Final Version -JBME Manuscript 98-055 Robust Optimization of Total Joint Replacements Incorporating Environmental Variables","266497050":"SEQUENTIAL–ADAPTIVE DESIGN OF COMPUTER EXPERIMENTS FOR THE ESTIMATION OF PERCENTILES","228948061":"Universally optimal designs for computer experiments","254333650":"Three Technomefrics Experimental Design Classics","228528739":"Prediction for Computer Experiments Having Quantitative and Qualitative Input Variables","5769125":"Mining data from hemodynamic simulations via Bayesian emulation","277697904":"Design and Analysis of Experiments: Special Designs and Applications, Volume 3","264691256":"Science-based parameterizations for dynamical spatiotemporal models"},"index":793}