{"abs":"We prove a functional central limit theorem for additive functionals of stationary reversible ergodic Markov chains under virtually no assumptions other than the necessary ones. We use these results to study the asymptotic behavior of a tagged particle in an infinite particle system performing simple excluded random walk.","title":"Central limit theorem for additive functionals of reversible Markov processes and applications to simple exclusion, Commun. Math. Phys. 106, 1-19","id":38329826,"url":"https://www.researchgate.net/publication/38329826_Central_limit_theorem_for_additive_functionals_of_reversible_Markov_processes_and_applications_to_simple_exclusion_Commun_Math_Phys_106_1-19","names":["C. Kipnis","S. R. S. Varadhan","Communications in Mathematical Physics"],"references":{"265333008":"Central Limit Theorems for Martingales with Discrete or Continuous Time","38361673":"The Motion of a Tagged Particle in the Simple Symmetric Exclusion System on $Z$","226050635":"Microscopic basis for Fick\u0027s law of self-diffusion","227095230":"Self-diffusion for particles with stochastic collisions in one dimension"},"citedIn":{"38360648":"Central Limit Theorem for a Random Walk with Random Obstacles in $\\mathrm{R}^d$","281161921":"An SDE approach to leafwise diffusions on foliated spaces and its applications","230570426":"Comment on a theorem of M. Maxwell and M. Woodroofe","2207780":"Hydrodynamic limit of zero range processes among random conductances on the supercritical percolation cluster","226885004":"Self-Diffusion in Simple Models: Systems with Long-Range Jumps","45913782":"Diffusive limit for the myopic (or \"true\") self-avoiding random walk in three and more dimension","1775633":"Averaged large deviations for random walk in a random environment","220354866":"Nonstandard Central Limit Theorems for Markov Chains.","1773577":"Large deviations for random walk in a random environment","51969792":"Spectral Gaps for a Metropolis-Hastings Algorithm in Infinite Dimensions","48196289":"A New Condition for the Invariance Principle for Stationary Random\nFields","38357609":"Markov Chains for Exploring Posterior Distributions","227423662":"Regularity of the diffusion coefficient matrix for generalized exclusion process","38352495":"Central Limit Theorem for Zero-Range Processes","43938487":"Marches aléatoires réversibles en milieu aléatoire","23636289":"The law of the iterated logarithm for additive functionals of Markov chains","238115355":"Scaling Limits in Models of Statistical Mechanics","2676740":"Ordering, Slicing And Splitting Monte Carlo Markov Chains","268227537":"Lipschitz Regularity for Elliptic Equations with Random Coefficients","5110883":"On the computational complexity of MCMC-based estimators in large samples","47733480":"Diffusive Limit for a Quantum Linear Boltzmann Dynamics","2135056":"Diffusive variance for a tagged particle in d ≤ 2 asymmetric simple exclusion","227704227":"Gibbs Measures on Brownian Currents","228618642":"On some method for diagnosing convergence in MCMC setups via atoms and renewal sets","225384796":"Functional Central Limit Theorem for Additive Functionals of α-stable Processes","226917809":"Exclusion Processes with Degenerate Rates: Convergence to Equilibrium and Tagged Particle","283531473":"A central limit theorem for stochastic heat equations in random environment","45907590":"Asymptotic analysis for the generalized Langevin equation","226207047":"Quenched invariance principles for walks on clusters of percolation or among random conductances.Probab Theory Relat Fields","1736743":"The quenched invariance principle for random walks in random environments admitting a bounded cycle representation","50853690":"On the rate of convergence in the martingale central limit theorem","2116704":"Empirical processes of dependent random variables","223618327":"A limit theorem for tagged particles in a class of self—organizing particle systems. Stoch. Proc. Appl. 47, 1-16","266677152":"Pointwise two-scale expansion for parabolic equations with random coefficients","2306150":"On the Convergence of Monte Carlo Maximum Likelihood Calculations","233530798":"Almost Sure Invariance Principle for Continuous-Space Random Walk in Dynamic Random Environment","50229944":"On the central limit theorem for some birth and death process","13313178":"Dynamical scaling and decay of correlations for spinodal decomposition at T c","226932180":"Dynamic structure factor in a random diffusion model","276102177":"Central Limit Theorem for Leafwise Brownian Motions on Mapping Tori","227286490":"Convection–diffusion equation with space–time ergodic random flow","38329876":"Bulk transport properties and exponent inequalities for random resistor and flow networks","47518346":"Efficient Markov Chain Monte Carlo Methods for Decoding Neural Spike Trains","46581412":"Suppressed Dispersion for a Randomly Kicked Quantum Particle in a Dirac Comb","41222678":"Limit theorems for additive functionals of a Markov chain. Ann. Appl. Probab","45933279":"Energy Transfer and Joint Diffusion","225157384":"Spectral measure and approximation of homogenized coefficients","238722654":"CENTRAL LIMIT THEOREM FOR MARKOV CHAINS ON COMPACT ABELIAN GROUPS","45900502":"Bernstein-type Concentration Inequalities for Symmetric Markov Processes","45864661":"Nonasymptotic bounds on the estimation error for regenerative MCMC algorithms","24304899":"Infrared Divergence of a Scalar Quantum Field Model on a Pseudo Riemannian Manifold","279968982":"Fast sampling in a linear-Gaussian inverse problem","222513466":"Diffusions in random environment and ballistic behavior. Ann Inst H Poincaré Prob Statist","226316551":"An invariance principle for non-symmetric Markov processes and reflecting diffusions in random domains","38360630":"Frank Spitzer\u0027s Pioneering Work on Interacting Particle Systems","48180829":"Large deviations for the current and tagged particle in 1D nearest-neighbor symmetric simple exclusion","47719003":"Stochastic Analysis of the Motion of DNA Nanomechanical Bipeds","242331381":"Tracer diffusion at low temperature in kinetically constrained models","251463291":"Course 4 Random motions in random media","51967903":"Recent progress on the Random Conductance Model","263116578":"On Viscosity and Fluctuation-Dissipation in Exclusion Processes: In Honor of Gianni Jona-Lasinio\u0027s 70th Birthday","51939208":"An invariance principle for the law of the iterated logarithm for some\nMarkov chains","242254560":"Markov Chain Monte Carlo Methods for Statistical Inference","226864407":"Slowdown and neutral pockets for a random walk in random environment","266546037":"From particle systems to partial differential equations. Proceedings of the conference ‘Particle systems and partial differential equations I’, Braga, Portugal, December 5–7, 2012","235357841":"First-order expansion of homogenized coefficients under Bernoulli\nperturbations","236203657":"Quenched Invariance Principles via Martingale Approximation","227425552":"A note on Variance Bounding for continuous time Markov chains","48204415":"Central limit theorem for Markov processes with spectral gap in the\nWasserstein metric","228813063":"An introduction to multiscale methods","227423529":"Martingale approximations for continuous-time and discrete-time stationary Markov processes","227423523":"Regularity of diffusion coefficient for nearest neighbor asymmetric simple exclusion on ℤ","38330085":"Towards a unified dynamical theory of the Brownian particle in an ideal gas","227895589":"Some familiar examples for which the large deviation principle does not hold","264385395":"Occupation times of long-range exclusion and connections to KPZ class exponents","45920783":"Einstein relation for reversible diffusions in random environment","31135087":"On the Applicability of Regenerative Simulation in Markov Chain Monte Carlo","226682164":"Time Reversal of Degenerate Diffusions","24103380":"An Extreme Value Approach to Estimating Volatility and Value at Risk","277170232":"Complex boundaries for the Totally Asymmetric Simple Exclusion process","1762469":"On Martingale Approximations","227423567":"Einstein relation for random walks in random environments","258884527":"Performance of the Metropolis algorithm on a disordered tree: the Einstein relation","228738411":"The central limit theorem for stationary Markov processes with normal generator-with applications to hypergroups","51963857":"On Functional CLT for Reversible Markov Chains with nonlinear growth of the Variance","250404390":"Expressions for the Markov Chain CLT Variance","2613484":"Slowdown Estimates And Central Limit Theorem For Random Walks In Random Environment","278733910":"Variance Reduction using Nonreversible Langevin Samplers","233405756":"Quenched invariance principle for multidimensional ballistic random walk in a random environment with a forbidden direction","45902442":"Asymptotic Analysis of the Green-Kubo Formula","50599897":"Quantitative Version Of The Kipnis-Varadhan Theorem And Monte Carlo Approximation Of Homogenized Coefficients","259335082":"A Sobolev Inequality and the Individual Invariance Principle for Diffusions in a Periodic Potential","265882424":"The self-avoiding walk. Reprint of the 1996 edition","228561277":"S.: A note on the central limit theorem for two-fold stochastic random walks in a random environment","38351530":"Finite-dimensional approximation of the self-diffusion coefficient for the exclusion process","48419334":"A central limit theorem for reversible processes with nonlinear growth of variance","223104426":"On the equivalence of the static and dynamic points of view for diffusions in a random environment","273788091":"On the functional CLT for stationary Markov Chains started at a point","48166450":"Absence of ground state for the Nelson model on static space-times","226749804":"Cooperative Behavior of Kinetically Constrained Lattice Gas Models of Glassy Dynamics","251479567":"Analysis of radiative transport in a cylindrical enclosure—An application of the modified discrete ordinate method","226446729":"Pressure in Classical Statistical Mechanics and Interacting Brownian Particles in Multi-dimensions","242331270":"An invariance principle for Brownian motion in random scenery","221663681":"Trapping in the Random Conductance Model","283034662":"Bayesian Inference of Online Social Network Statistics via Lightweight Random Walk Crawls","227423600":"On homogenization of space-time dependent and degenerate random","46180926":"Stochastic Models for Large Interacting Systems and Related Correlation Inequalities","225725835":"Homogenization of divergence-form operators with lower-order terms in random media","30861527":"Stationary Random Walks and Isotonic Regression.","225045614":"Asymptotic properties for linear processes of functionals of reversible\nMarkov Chains","225947760":"Abstracts from the international conference on mathematical problems from the physics of fluids","226788493":"On estimating the derivatives of symmetric diffusions in stationary random environment, with applications to ∇ϕ interface model","251328490":"On central limit theorem for continuous additive functional of zero energy","23634041":"Smoothed Langevin proposals in Metropolis-Hastings algorithms","221669413":"Enhanced Binding in Quantum Field Theory","263891625":"Generalized Exclusion Processes: Transport Coefficients","266685168":"High dimensional probability VI. The Banff volume. Proceedings of the sixth high dimensional probability conference (HDP VI), Banff, Canada, October 9–14, 2011","2135349":"A functional CLT for the occupation time of a state-dependent branching random walk","225977455":"Functional law of iterated logarithm for additive functionals of reversible Markov processes","260161179":"Asymptotic Efficiency of the Sample Mean in Markov Chain Monte Carlo Schemes","45929383":"Random Dirichlet environment viewed from the particle in dimension $d\\ge 3$","1941766":"Dynamical Arrest, Tracer Diffusion and Kinetically Constrained Lattice Gases","270676281":"The Central Limit Theorem for th-Order Nonhomogeneous Markov Information Source","227423378":"Homogenization of a bond diffusion in a locally ergodic random environment","260678293":"Langevin Dynamics with Space-Time Periodic Nonequilibrium Forcing","280221101":"Equilibrium Fluctuations for a Discrete Atlas Model","222250017":"On ballistic diffusions in random environment","225160309":"Martingale Approximation and Optimality of Some Conditions for the Central Limit Theorem","45907865":"Universality of KPZ equation","2091319":"Periodic Homogenization for Hypoelliptic Diffusions","41218909":"Nonequilibrium scaling limit for a tagged particle in the simple exclusion process with long jumps","281227759":"A central limit theorem for fluctuations in one dimensional stochastic homogenization","2721048":"Stochastic Pin-Ball","38351736":"An equivalence of $H_{-1}$ norms for the simple exclusion process","233281750":"Random walk in random environment, corrector equation and homogenized coefficients: From theory to numerics, back and forth","1737000":"Variance bounding Markov chains","262264466":"Asymptotic Variance of Stationary Reversible and Normal Markov Processes","261065403":"Fluctuations in a kinetic transport model for quantum friction","38351740":"Transience of second-class particles and diffusive bounds for additive functionals in one-dimensional asymmetric and exclusion processes","2134295":"Law of the Iterated Logarithm for stationary processes","2133272":"Anomalous heat-kernel decay for random walk among bounded random conductances","2483486":"A Functional Central Limit Theorem For Markov Additive Processes","223823895":"Mobility and Einstein Relation for a tagged particle in asymmetric mean zero random walk with simple exclusion","235726671":"Correction: Variable transformation to obtain geometric ergodicity in the random-walk Metropolis algorithm","2129261":"Tail estimates for homogenization theorems in random media","45895665":"Adaptive Gibbs samplers","251408299":"An Introduction to Markov Chain Monte Carlo Methods","51892812":"A quantitative central limit theorem for the random walk among random\nconductances","223796234":"Random walk in dynamic environment with mutual influence","45898720":"Fluctuations for the Ginzburg-Landau ∇ φ Interface Model on a Bounded Domain","222674968":"Finite volume approximation of the effective diffusion matrix: The case of independent bond disorder","243113760":"Ergodicity for an infinite particle system in $R^{d}$ of jump type with hard core interaction","259010094":"Green-Kubo formula for weakly coupled system with dynamical noise","225608721":"An almost sure invariance principle for random walks in a space-time random environment.Probab Theory Relat Fields","250754966":"Ch. 9. Empirical estimators based on MCMC data","2125124":"Recent Advances in Invariance Principles for Stationary Processes","240985915":"Certain Random Motion of a Ball Colliding with Infinite Particles of Jump Type","225555478":"The central limit theorem for Markov chains started at a point.Probab Theory Relat Fields","231016621":"On the drift and diffusion of a rod in a lattice fluid","1898864":"From Ballistic to Diffusive Behavior in Periodic Potentials","258233867":"On the functional central limit theorem for reversible Markov chains with nonlinear growth of the variance","30515361":"Marches aléatoires en milieux aléatoires: Etude de quelques modèles multidimensionnels","1851756":"Jamming Percolation and Glassy Dynamics","24056862":"Estimating the stationary distribution of a Markov chain","23716893":"Current and density fluctuations for interacting particle systems with anomalous diffusive behavior","2842974":"Geometric Ergodicity and Hybrid Markov Chains","236215146":"Weak Convergence Approach to a Parabolic Equation with Large Random Potential","225128686":"Approximation of the effective conductivity of ergodic media by periodization","271924656":"Quantification of ergodicity in stochastic homogenization: optimal bounds via spectral gap on Glauber dynamics","2708911":"Limit Theorems for Tagged Particles","45879093":"On the functional central limit theorem via martingale approximation","225812728":"Central Limit Theorem Started at a Point for Stationary Processes and Additive Functionals of Reversible Markov Chains","51948182":"On the Infinite Swapping Limit for Parallel Tempering","38330310":"Nonlinear diffusion limit for a system with nearest neighbor interactions","251170665":"Asymptotic variance of functionals of discrete time Markov chains via the Drazin inverse","2131379":"An invariance principle for the law of the iterated logarithm for vector-valued additive functionals of Markov Chains","227423258":"Regularity of the diffusion coefficient for lattice gas reversible under Bernoulli measures","221703342":"Kantorovich distance in the martingale CLT and quantitative\nhomogenization of parabolic equations with random coefficients","45887269":"Simple Random Walk on Long Range Percolation Clusters II: Scaling Limits","2124217":"Limit velocity and zero-one laws for diffusions in random environment.Ann Appl Probab","228928572":"A Martingale Proof of Dobrushin\u0027s Theorem for Non-Homogeneous Markov Chains","50908819":"Almost Sure Invariance Principles via Martingale Approximation","223685832":"The Einstein relation for the displacement of a test particle in a random environment. Stoch. Proc. Appl. 54, 183-196","243039197":"A. N. Kolmogorov - Founder of the theory of reversible Markov processes","230608924":"Excursions and path functionals for stochastic processes with asymptotically zero drifts","279347460":"Hydrodynamic Equation of Symmetric Simple Exclusion Processes","257882875":"Quenched invariance principle for simple random walk on clusters in correlated percolation models","2111878":"General state space Markov chains and MCMC algorithms","34032557":"Genetic linkage analysis based on identity by descent using Markov chain Monte Carlo sampling on large pedigrees [microform].","2091440":"Gibbs Measures on Brownian Paths: Theory and Applications","36420507":"Gibbs measures relative to Brownian motion and Nelson\u0027s model","284096861":"The Correlated Pseudo-Marginal Method","238195590":"Suppressed dispersion for a quantum particle in a periodic $\\delta$-potential with random momentum kicks","272382346":"Large deviations for one-dimensional random walks on discrete point processes","225978575":"Erratum to: Convergence to fractional kinetics for random walks associated with unbounded conductances","2121186":"Recurrence for persistent random walks in two dimensions","228448341":"Probabilistic approach to Perron root, the group inverse, and applications","225814719":"Chaotic time dependence in a disordered spin system","2406891":"On Homogenization of Time-Dependent Random Flows","265554436":"Explicit LDP for a slowed RW driven by a symmetric exclusion process","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","265455110":"A limit theorem for Brownian motion in a random scenery","258144949":"Remarks on limit theorems for reversible Markov processes","266310151":"Regularity of Self-Diffusion Coefficient","2119162":"Uniqueness and multiplicity of infinite clusters","2811376":"Markov Chain Monte Carlo for Statistical Inference","38363029":"Convergence Control Methods for Markov Chain Monte Carlo Algorithms","45897570":"Invariance Principle For The Random Conductance Model With Unbounded Conductances","225387656":"An invariance principle for isotropic diffusions in random environments.Invent Math","1769970":"Random Close Packing of Granular Matter","265585215":"On the Satic and Dynamic Points of View for Certain Random Walks in Random Environment","227423331":"Spectral homogenization of reversible random walks on \\( { \\mathbb{Z}^d } \\) in a random environment.Stoch Proc App","243103625":"Regularity of the diffusion coefficient matrix for the lattice gas with energy","2350550":"Symmetric Simple Exclusion Process: Regularity Of The Self Diffusion Coefficient","225154205":"Recurrence times and rates of mixing. Isr J Math","2337245":"Asymptotic Behavior Of A Tagged Particle In Simple Exclusion Processes","222522177":"Special Examples of Diffusions in Random Environment","23740258":"Broken Ergodicity and the Geometry of Rugged Landscapes","247317686":"Chapter 15 Monte carlo simulation and numerical integration","231513027":"A stochastic Burgers equation from a class of microscopic interactions","275896928":"Finite horizon Markov decision problems and a central limit theorem for total reward","23644026":"A central limit theorem for random walk in random environment on marked\nGalton-Watson trees","276796013":"Limiting models for equations with large random potential: A review","228925373":"Billiard Models and Energy Transfer","259764578":"Homogenization of Heat Equation with Large Time-dependent Random Potential","233402356":"The Point of View of the Particle on the Law of Large Numbers for Random Walks in a Mixing Random Environment","51916038":"An Invariance Principle for the Tagged Particle Process in Continuum\nwith Singular Interaction Potential","228558720":"Symmetric random walk in random environment in one dimension","281366246":"Limit theorems for Markov chains by the symmetrization method","281808623":"Stochastic Averaging and Sensitivity Analysis for Two Scale Reaction Networks","237310991":"Asymptotic Variance and Convergence Rates of Nearly-Periodic MCMC Algorithms","225779544":"Regularity of the Diffusion Coefficient Matrix for Lattice Gas Reversible under Gibbs Measures with Mixing Condition","242381890":"relative to Brownian motion and Nelson\u0027s model","47342818":"Marches Aléatoires avec Conductances Aléatoires","225456961":"Homogenization of random semilinear PDEs","51948844":"Behavior of random walk on discrete point processes","225233744":"Extremal Reversible Measures for the Exclusion Process","221667080":"Relaxed sector condition","273482355":"Fluctuations of parabolic equations with large random potentials","267214290":"A Quantitative Central Limit Theorem for the Effective Conductance on the Discrete Torus","256846094":"Nonlinear Fluctuations of Weakly Asymmetric Interacting Particle Systems","200707508":"Simulation of the Annual Loss Distribution in Operational Risk via Panjer Recursions and Volterra Integral Equations for Value at Risk and Expected Shortfall Estimation.","45888760":"Harmonic functions, h-transform and large deviations for random walks in\nrandom environments in dimensions four and higher","232994731":"The Bayesian Framework for Inverse Problems in Heat Transfer","1901140":"Large deviations for random walk in a space--time product environment","232062873":"Efficient implementation of Markov chain Monte Carlo when using an unbiased likelihood estimator","225572640":"Diffusive limits for “true” (or myopic) self-avoiding random walks and self-repellent Brownian polymers in d ≥ 3","229544956":"Diffusion of color in the simple exclusion process","51887428":"Central limit theorems for additive functionals of ergodic Markov\ndiffusions processes","1757775":"Random Walk in deterministically changing environment","227424219":"Tagged particle motion in a clustered random walk system. Stoch. Proc. Appl. 30, 225-252","263801327":"ERGODICITY FOR INFINITE PARTICLE SYSTEMS WITH LOCALLY CONSERVED QUANTITIES","2388605":"Homogenization Of Random Walk In Asymmetric Random Environment","238879844":"Pointwise ergodic theorems with rate and application to the CLT for Markov chains","264951187":"CLT for Stationary Normal Markov Chains via Generalized Coboundaries","2134651":"Functional CLT for random walk among bounded conductances","238879839":"Quenched non-equilibrium central limit theorem for a tagged particle in the exclusion process with bond disorder","2096762":"Random walks with strongly inhomogeneous rates and singular diffusions: Convergence, localization and aging in one dimension","50353513":"T. E. Harris’ contributions to Interacting Particle Systems and Percolation","226163479":"A dynamical theory of Brownian motion for the Rayleigh gas","242078722":"Diffusive limit of a tagged particle in asymmetric simple exclusion processes","278048483":"Mixing Time Estimation in Reversible Markov Chains from a Single Sample Path","1917551":"Quenched Large Deviations for Random Walk in a Random Environment","225647360":"Fractional Poisson equations and Ergodic theorems for fractional coboundaries","235915388":"RANDOM WALK IN RANDOM ENVIRONMENT, CORRECTOR EQUATION, AND HOMOGENIZED COEFFICIENTS: FROM THEORY TO NUMERICS, BACK AND FORTH","228704219":"On Variance Conditions for Markov Chain CLTs","247331015":"Rank-Based Inference in the Proportional Hazards Model for Interval Censored Data","222520127":"On diffusivity of a tagged particle in asymmetric zero-range dynamics","256376121":"Random mass splitting and a quenched invariance principle","275055333":"On a generalization of the preconditioned Crank-Nicolson Metropolis algorithm","227337988":"The central limit theorem for Markov chains with normal transition operators, started at a point","24168421":"Pointwise ergodic theorems with rate and application to limit theorems for stationary processes","251763098":"Marches aléatoires sur le cercle, théorème central limite et irrationnalité","1771136":"Distributional Limits for the Symmetric Exclusion Process","225556461":"Homogenization of Ornstein-Uhlenbeck Process in Random Environment","263352622":"Moment bounds for the corrector in stochastic homogenization of a percolation model","222699483":"Nonequilibrium Central Limit Theorem for a Tagged Particle in Symmetric Simple Exclusion","2706103":"A Central Limit Theorem For Random Walks In Random Labyrinths","1747588":"Random Loose Packing in Granular Matter","2091648":"Mott Law as Lower Bound for a Random Walk in a Random Environment","2134656":"Diffusivity in one-dimensional generalized Mott variable-range hopping models","272377500":"Asymptotic behavior of a tagged particle in the exclusion process on parallel lattices","273328878":"Green-Kubo Formula for Weakly Coupled Systems with Noise","226085841":"Tracer dynamics in Dyson\u0027s model of interacting Brownian particles","225161153":"Scaling Limits of a Tagged Particle in the Exclusion Process with Variable Diffusion Coefficient","263882007":"HILBERTIAN INVARIANCE PRINCIPLE FOR EMPIRICAL PROCESS ASSOCIATED WITH A MARKOV PROCESS","254352793":"Large Deviations via Almost Sure CLT for Functionals of Markov Processes","259441094":"Uniform Ergodicity of the Iterated Conditional SMC and Geometric Ergodicity of Particle Gibbs samplers","264927611":"Limit theorems in probability, statistics and number theory. In honor of Friedrich Götze on the occasion of his 60th birthday. Selected papers based on the presentations at the workshop, Bielefeld, Germany, August 4–6, 2011","222974972":"An invariance principle for Markov processes and Brownian particles with singular interaction","225503178":"Stochastic Interface Models","251007048":"Central limit theorem for an additive functional of a Markov process, stable in the Wesserstein metric","284251727":"Improving efficiency of data augmentation algorithms using Peskun’s theorem","48198752":"Adaptive Gibbs samplers and related MCMC methods","35500253":"Heavy traffic limit theorems for the closed Lu-Kumar network /","235638983":"Diffusivity in multiple scattering systems","221659129":"Limit theorems for stationary Markov processes with L2-spectral gap","228667246":"Random walks on disordered media and their scaling limits","51957197":"Disorder, entropy and harmonic functions","222306198":"Forward-backward martingale decomposition and compactness results for additive functionals of stationary ergodic Markov processes","237775093":"Maximum Likelihood Estimation for a Parametric Dispersal Model for Haploid Organisms Technical Report # 362","265819396":"THEORETICAL AND METHODOLOGICAL DEVELOPMENTS FOR MARKOV CHAIN MONTE CARLO ALGORITHMS FOR BAYESIAN REGRESSION","243036320":"Limit theorem for a random walk in a reversible random environment","2344643":"Percolation","267216136":"EINSTEIN RELATION FOR A TAGGED PARTICLE IN THE SIMPLE EXCLUSION PROCESS WITH ADSORPTION/DESORPTION","38322349":"Estimating the Second Largest Eigenvalue of a Markov Transition Matrix","276296338":"An invariance principle for stochastic heat equations with periodic coefficients","47546418":"Subdiffusive heat-kernel decay in four-dimensional i.i.d. random\nconductance models","2417359":"Homogenization In A Periodic And Time-Dependent Potential","270825167":"Quenched Large Deviations for Simple Random Walks on Supercritical Percolation Clusters","241279117":"Edge Universality of Beta Ensembles","45926477":"Helffer - Sjostrand Representation for Conservative Dynamics","243036297":"Limit theorems for a random walk in a random environment","50425336":"Scaling Limits of Additive Functionals of Interacting Particle Systems","226139009":"Gibbs Measures for Brownian Paths Under the Effect of an External and a Small Pair Potential","51942884":"A limit theorem to a time-fractional diffusion","23962514":"Variance decay for functionals of the environment viewed by the particle","235432200":"Dimension-Independent MCMC Sampling for Inverse Problems with Non-Gaussian Priors","228814499":"The central limit theorem for stationary Markov chains under invariant splittings","1922844":"Exactness of martingale approximation and the central limit theorem","48176604":"Conditional central limit theorem via martingale approximation","220286501":"Imaging convex quadrilateral inclusions in uniform conductors from electrical boundary measurements","38339907":"Importance sampling for families of distributions","268996359":"Variance bounding Markov chains, L 2 -uniform mean ergodicity and the CLT","227277467":"Exponential Integrability and DLR Consistence of Some Rough Functionals","226991762":"Book review: Large scale dynamics of interacting particles","250046975":"An Analysis of the Variation in the RED Algorithm","225945196":"An invariance principle for reversible Markov processes. Applications to random motions in random environments.J Stat Phys","2655031":"Information bounds for Gibbs samplers","259845208":"Homogenization of Lateral Diffusion on a Random Surface","225284681":"Symmetric exclusion as a model of non-elliptic dynamical random\nconductances","266497221":"MCMC (ε − α)−APPROXIMATION UNDER DRIFT CONDITION WITH APPLICATION TO GIBBS SAMPLERS FOR A HIERARCHICAL RANDOM EFFECTS MODEL","222821999":"Periodic homogenization for inertial particles","45876629":"Diffusive Behavior for Randomly Kicked Newtonian Particles in a Spatially Periodic Medium","38339936":"Homogenization for time-dependent two-dimensional incompressible Gaussian flows","225835614":"A Conditional CLT which Fails for Ergodic Components","41220443":"Diffusion in a locally stationary random environment","258229332":"Discussion: Markov Chains for Exploring Posterior Distributions","243000655":"On the diffusive behavior of isotropic diffusions in a random environment","252454970":"A multiscale approach to Brownian motors","2129687":"Nonequilibrium density fluctuations for the zero range process with colour","51021878":"An optimal variance estimate in stochastic homogenization of discrete\nelliptic equations","225897032":"Tracer diffusion in lattice gases","270223194":"On the equilibrium state of the one-dimensional near-symmetric simple exclusion process","260932810":"Quenched invariance principles for simple random walk on percolation clusters.Probab Theory Relat Fields","4920066":"Convergence of Heavy-tailed Monte Carlo Markov Chain Algorithms","237092206":"Invariance principle for the random conductance model in a degenerate ergodic environment","2124655":"Homogenization of Parabolic Equations with a Continuum of Space and Time Scales","250665379":"Mathematical theory of queuing networks","260340945":"Random Perturbation to the Geodesic Equation","228862706":"Implementations of the MCEM algorithm","48205193":"CLTs and Asymptotic Variance of Time-Sampled Markov Chains","227727045":"Laws of the iterated logarithm and large deviations for a class of diffusionl processes","222674463":"Ideal gas approximation for a two-dimensional rarefied gas under Kawasaki dynamics","45881822":"Limit theorems for some adaptive MCMC algorithms with subgeometric kernels: Part II","229755603":"Propagation of chaos for symmetric simple exclusions","227425005":"Geometric ergodicity of Metropolis algorithms","266237115":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","45853150":"Tagged particle processes and their non-explosion criteria","266006719":"Stable Limit Laws for Harmonic Mean Estimators of Marginal Likelihoods","51932286":"A quenched invariance principle for non-elliptic random walk in I.I.D. balanced random environment","38339886":"Turbulent diffusion Markovian flows","259312669":"Comparison of quenched and annealed invariance principles for random conductance model: Part II","273398560":"On kernel estimators of density for reversible Markov chains","245630420":"Central Limit Theorems for Tagged Particles and for Diusions in Random Environment","30514849":"Comportements Asymptotiques des Processus Stationnaires et des Processus Empiriques dans des Systèmes Dynamiques","2820954":"Statistical Properties of Dynamical Systems with Some Hyperbolicity","251725947":"Comparison of COX2 Selective and Traditional NSAIDs on Experimental Gastric Ulcer Healing in Humans","227716841":"Geodesics of Random Riemannian Metrics","38331701":"Evolution of tagged particles in non-reversible particle systems. Commun. Math. Phys. 165, 1-32","268451711":"Central limit theorem for random walks in divergence-free random drift field: \"H-minus-one\" suffices","45926716":"Equilibrium Fluctuations for a Non Gradient Energy Conserving Stochastic Model","273787858":"Density fluctuations for exclusion processes with long jumps","272422840":"From Feynman-Kac Formulae to Numerical Stochastic Homogenization in Electrical Impedance Tomography","2310052":"Ordering Monte Carlo Markov Chains","2328484":"Notes on Central Limit Theorems for Tagged Particles and Diffusions in Random Environment","237811108":"Asymmetric Simple Exclusion Processes","38360513":"Equilibrium Fluctuations of a One-Dimensional Nongradient Ginzburg-Landau Model","38329794":"Equilibrium fluctuations for interacting Brownian particles","259044605":"A Note on Central Limit Theorem for Heat Equation with Large, Highly Oscillatory, Random Potential","234228347":"Long-Time Average of Field Measured by an Ornstein-Uhlenbeck Wanderer","225683197":"Diffusive Limits on the Penrose Tiling","1922963":"Hydrodynamic limit of particle systems with long jumps","225670909":"Einstein Relation for a Tagged Particle in Simple Exclusion Processes","230775374":"Regularization by noise and stochastic Burgers equations","38360518":"Large Deviations for a Random Walk in Random Environment","237000112":"Quenched Invariance Principles for Random Walks and Elliptic Diffusions in Random Media with Boundary","225499872":"Upper bound on the occupation time in the simple exclusion process","47663431":"Nonequilibrium fluctuations for a tagged particle in one-dimensional sublinear rate zero-range processes","243047917":"A functional central limit theorem for Markov additive processes with an application to the closed Lu?Kumar network","233408125":"An almost sure invariance principle for additive functionals of Markov chains","225346296":"Large deviations for the symmetric simple exclusion process in dimension d 3. Preprint","38351313":"Central limit theorems for additive functionals of the simple exclusion process","45862180":"Heat Kernel Upper Bounds on Long Range Percolation Clusters","227031592":"On Mobility and Einstein Relation for Tracers in Time-Mixing Random Environments","2108288":"A central limit theorem for Gibbs measures relative to Brownian motion","47161711":"Bayesian-Analysis of Mixed Linear-Models Via Gibbs Sampling with an Application to Litter Size in Iberian Pigs","275974097":"Efficient numerical calculation of drift and diffusion coefficients in the diffusion approximation of kinetic equations","237242754":"Invariance principle for diffusions in random environment","242361818":"ON MARTINGALE APPROXIMATIONS1","38351329":"Central limit theorems for additive functionals of Markov chains","4746208":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","274137086":"Annealed invariance principle for random walks on random graphs generated by point processes in $\\mathbb{R}^d$","261289021":"Information-Geometric Markov Chain Monte Carlo Methods Using Diffusions","228057637":"A Metropolis-Type Optimization Algorithm on the Infinite Tree","225588938":"Equilibrium Fluctuations for a Model of Coagulating-Fragmenting Planar Brownian Particles","222685944":"On The Sector Condition And Homogenization Of Diffusions With A Gaussian Drift.","46582137":"Multiplicative random walk Metropolis-Hastings on the real line","30513687":"Modèles variationnels et bayésiens pour le débruitage d\u0027images : de la variation totale vers les moyennes non-locales","226041523":"Exponential convergence to equilibrium for a class of random-walk models","257690766":"Limit theorems for the position of a tagged particle in the stirring-exclusion process","255526120":"Some remarks on the central limit theorem for stationary Markov processes","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","45848931":"Quenched invariance principle for the Knudsen stochastic billiard in a random tube Ann. Probab","45916518":"Random walk on discrete point processes","226873945":"Persistent random walks in random environment","265511950":"Convergence of hybrid slice sampling via spectral gap","38351274":"Equilibrium Fluctuations for $\\nabla_{\\varphi}$ Interface Model","45922650":"Quenched Central Limit Theorems for Sums of Stationary Processes","48419082":"Scaling limit for a class of gradient fields with nonconvex potentials","45879639":"Hydrodynamic limit for two-species exclusion processes","45891922":"Invariance principle for Mott variable range hopping and other walks on point processes","51944684":"Quenched invariance principle for simple random walk on discrete point processes","236589548":"Limit laws for occupation times of stable processes","26406507":"On the Markov chain central limit theorem","2207710":"Random walk in Markovian environment"},"index":80}