{"abs":"The problem of searching for a model-based scene interpretation is analyzed within a probabilistic framework. Object models are formulated as generative models for range data of the scene. A new statistical criterion, the truncated object probability, is introduced to infer an optimal sequence of object hypotheses to be evaluated for their match to the data. The truncated probability is partly determined by prior knowledge of the objects and partly learned from data. Some experiments on sequence quality and object segmentation and recognition from stereo data are presented. The article recovers classic concepts from object recognition (grouping, geometric hashing, alignment) from the probabilistic perspective and adds insight into the optimal ordering of object hypotheses for evaluation. Moreover, it introduces point-relation densities, a key component of the truncated probability, as statistical models of local surface shape.","title":"Probabilistic Search for Object Segmentation and Recognition.","id":221305047,"url":"https://www.researchgate.net/publication/221305047_Probabilistic_Search_for_Object_Segmentation_and_Recognition","names":["Ulrich Hillenbrand","Gerd Hirzinger"],"references":{"3191953":"Space and time bounds on indexing 3D models from 2D images","215458581":"Random Sample Consensus: A Paradigm for Model Fitting with Applications To Image Analysis and Automated Cartography","247608673":"Special purpose automatic programming for 3D model-based vision","221111274":"Geometric Hashing: A General And Efficient Model-based Recognition Scheme.","220182326":"Robot Vision Using a Feature Search Strategy Generated from a 3-D Object Model","220693676":"Object Recognition by Computer: The Role of Geometric Constraints","2240462":"Graded Learning for Object Detection","222442253":"Generalizing the Hough Transform to Detect Arbitrary Shapes","235172182":"Perceptual Organization and Visual Recognition","21022899":"Three-dimensional Object Recognition","246520645":"Intrinsic and extrinsic surface characteristics","3192038":"Surface parametrization and curvature measurement of arbitrary 3-D objects: Five practical methods","222564722":"MLESAC: A New Robust Estimator with Application to Estimating Image Geometry","220660284":"Recognizing solid objects by alignment with an image","243686365":"Object recognition using alignment. In: ICCV","216360856":"Mixture model for pose clustering"},"citedIn":{"4040363":"Surflet-pair-relation histograms: A statistical 3D-shape representation for rapid classification"},"index":815}