{"abs":"Optimizing the hypervolume indicator within evolutionary multiobjective optimizers has become popular in the last years. Recently, the indicator has been generalized to the weighted case to incorporate various user preferences into hypervolume-based search algorithms. There are two main open questions in this context: (i) how does the specified weight influence the distribution of a fixed number of points that maximize the weighted hypervolume indicator? (ii) how can the user articulate her preferences easily without specifying a certain weight distribution function? In this paper, we tackle both questions. First, we theoretically investigate optimal distributions of μ points that maximize the weighted hypervolume indicator. Second, based on the obtained theoretical results, we propose a new approach to articulate user preferences within biobjective hypervolume-based optimization in terms of specifying a desired density of points on a predefined (imaginary) Pareto front. Within this approach, a new exact algorithm based on dynamic programming is proposed which selects the set of μ points that maximizes the (weighted) hypervolume indicator. Experiments on various test functions show the usefulness of this new preference articulation approach and the agreement between theory and practice.","title":"Investigating and Exploiting the Bias of the Weighted Hypervolume to Articulate User Preferences","id":216457232,"url":"https://www.researchgate.net/publication/216457232_Investigating_and_Exploiting_the_Bias_of_the_Weighted_Hypervolume_to_Articulate_User_Preferences","names":["Anne Auger","Johannes Bader","Dimo Brockhoff","Eckart Zitzler"],"references":{"220741544":"Reference Point Based Multi-Objective Optimization Using Evolutionary Algorithms","216300868":"Scalable Test Problems for Evolutionary Multi-Objective Optimization","216300934":"On metrics for comparing non-dominated sets","3949503":"Scalable multi-objective optimization test problems","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","262405508":"On Set-Based Multiobjective Optimization","220742944":"Articulating User Preferences in Many-Objective Problems by Sampling the Weighted Hypervolume","220741729":"Interactive evolutionary multi-objective optimization and decision-making using reference direction method","247442902":"Introduction To Algorithms","216457263":"Lecture Notes in Computer Science","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","224645801":"Preference Incorporation in Multi-objective Evolutionary Algorithms: A Survey","235709918":"Nonlinear Multiobjective Optimization","3864942":"Handling preferences in evolutionary multiobjective optimization: A survey","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","251388270":"Effects of 1Greedy S \\mathcal{S} -Metric-Selection on Innumerably Large Pareto Fronts","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","2811965":"Guidance in Evolutionary Multi-Objective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","216457240":"Effects of 1-Greedy S-Metric-Selection on Innumerably Large Pareto Fronts"},"citedIn":{"216457248":"The maximum hypervolume set yields near-optimal approximation","262292324":"Population size matters: Rigorous runtime results for maximizing the hypervolume indicator","220742944":"Articulating User Preferences in Many-Objective Problems by Sampling the Weighted Hypervolume","235709701":"Recent Developments in Derivative-Free Multiobjective Optimisation","266656111":"Two-dimensional subset selection for hypervolume and epsilon-indicator","225624893":"Optimal k-Level Planarization and Crossing Minimization","281777178":"A Bayesian Approach to Portfolio Selection in Multicriteria Group Decision Making","216457268":"Indicator-based evolutionary algorithm with hypervolume approximation by achievement scalarizing functions","47750094":"Theoretically Investigating Optimal μ-Distributions for the Hypervolume Indicator: First Results For Three Objectives","272037344":"Bi-objective hypervolume-based Pareto optimization","283073414":"Multi Objective Design Interface","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","255564256":"Microsoft-CNRS Chair \"Optimization for Sustainable Development\", Activity Report 2009-2011","261276238":"Preference-Based Evolutionary Multi-objective Optimization","221271214":"The logarithmic hypervolume indicator","265268712":"Optimization According to Interactively Quantified User Preferences","268167251":"On Reference Point Free Weighted Hypervolume Indicators based on Desirability Functions and their Probabilistic Interpretation","235709863":"Automatically Improving the Anytime Behaviour of Optimisation Algorithms","263586138":"R 2 Indicator-Based Multiobjective Search","280851276":"Optimal μ-Distributions for the Hypervolume Indicator for Problems With Linear Bi-Objective Fronts: Exact and Exhaustive Results","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","47750112":"Lecture Notes in Computer Science","220701597":"Tight Bounds for the Approximation Ratio of the Hypervolume Indicator","256660343":"Approximation quality of the hypervolume indicator","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","222889399":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications"},"index":816}