{"abs":"Markov chain Monte Carlo (MCMC) algorithms, such as the Gibbs sampler, have provided a Bayesian inference machine in image analysis and in other areas of spatial statistics for several years, founded on the pioneering ideas of Ulf Grenander. More recently, the observation that hyperparameters can be included as part of the updating schedule and the fact that almost any multivariate distribution is equivalently a Markov random field has opened the way to the use of MCMC in general Bayesian computation. In this paper, we trace the early development of MCMC in Bayesian inference, review some recent computational progress in statistical physics, based on the introduction of auxiliary variables, and discuss its current and future relevance in Bayesian applications. We briefly describe a simple MCMC implementation for the Bayesian analysis of agricultural field experiments, with which we have some practical experience.","title":"Spatial Statistics and Bayesian Computing","id":243776875,"url":"https://www.researchgate.net/publication/243776875_Spatial_Statistics_and_Bayesian_Computing","names":["J. E. Besag","P. J. Green","Journal of the Royal Statistical Society. Series B: Methodological"],"references":{"244456594":"Convergence diagnostics of the Gibbs sampler","38363016":"Geometric Bounds for Eigenvalues of Markov Chains","235014147":"Exploring Posterior Distributions Using Markov Chains","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","220611043":"A Markov random field approach to data fusion and colour segmentation","231909716":"Improving Stochastic Relaxation for Gussian Random Fields","226041523":"Exponential convergence to equilibrium for a class of random-walk models","3191805":"Boundary detection by contrained optimization","243774088":"Analysis of Field Experiments by Least Square Smoothing","236736531":"Toward automated image understanding","21244246":"A Monte Carlo Method for Bayesian Inference in Frailty Models","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","223822273":"Iterative simulation methods","38362960":"Optimal Spectral Structure of Reversible Stochastic Matrices, Monte Carlo Methods and the Simulation of Markov Random Fields","13298387":"Simulations without critical slowing down: Ising and three-state Potts models","29517400":"A modified heat bath method suitable for Monte Carlo simulations on vector and parallel processors","239066019":"Random Fields and Inverse Problems in Imaging","243667034":"Statistical methods for tomographic image reconstruction","243082273":"A New Class of Resolvable Incomplete Block Designs","242609128":"Structural Image Restoration Through Deformable Templates","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","3220206":"Green, P.J.: Bayesian reconstructions from emission tomography data using a modified EM algorithm. IEEE Trans. Med. Imaging 9(1), 84-93","13251989":"Simulations without critical slowing down","13250154":"Collective Monte Carlo Updating for Spin Systems","231878192":"Some Generalized Order-Disorder Transformations","243043807":"Reconstruction of polygonal images","2759693":"Monte Carlo Methods in Statistical Mechanics: Foundations and New Algorithms","232128380":"Generalized Monte Carlo Significance Tests","13330658":"Generalization of the Fortuin-Kasteleyn-Swendsen-Wang representation and Monte Carlo algorithm. Phys. Rev. D 38: 2009-2012","224839692":"Spatial Interaction and the Statistical Analysis of Lattice Systems","24052037":"Bayesian Image Restoration With Two applications In Spatial Statistics","243769067":"“Representations of Knowledge in Complex Systems.”","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","234806928":"Hands. A pattern theoretic study of biological shapes","246189727":"Finding Spiral Structures in Images of Galaxies","247641846":"Statistical Analysis of Field Experiments Using Neighbouring Plots","14686420":"On the Irreducibility of a Markov Chain Defined on a Space of Genotype Configurations by a Sampling Scheme","235194034":"Statistical Shape Models in Image Analysis"},"citedIn":{"246566064":"Iterative and Non-iterative Simulation Algorithms","226203513":"Bayesian Decomposition Analysis of Gene Expression in Yeast Deletion Mutants","228927904":"Image recognition via deformable templates","265369049":"Slice sampling. (With discussions and rejoinder)","223069507":"Bayesian methods in plant conservation biology","228280215":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","49458431":"A tutorial on adaptive MCMC","31123925":"Generalised Gibbs sampler and multigrid Monte Carlo for Bayesian computation","242530427":"A generalized risk-based approach to segmentation based on hidden Markov models","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","243043944":"Markov models and Bayesian methods in image analysis","226481515":"A Spatial Analysis of the Demographic and Socio-Economic Variables Associated with Cardiovascular Disease in Calgary (Canada)","2254903":"Mining Spatial Data via Clustering","4899423":"Implementing componentwise Hastings algorithms","38326864":"Ordering and Improving the Performance of Monte Carlo Markov Chains","229790634":"Efficiency and Convergence Properties of Slice Samplers","51963137":"Asymptotic Theory of Cepstral Random Fields","33028076":"Modeling Transport Mode Decisions Using Hierarchical Binary Spatial Regression Models with Cluster Effects","2552381":"MCMC Methods for Financial Econometrics","265339852":"An h-likelihood method for spatial mixed linear models based on intrinsic auto-regressions","247470302":"Seeking Efficient Data Augmentation Schemes via Conditional and Marginal Augmentation","268020710":"Bayesian inference with misspecified models","233253831":"A frequency domain algorithm for maximum likelihood estimation of gaussian fields","226596257":"Gibson, G. J. \u0026 Renshaw, E. Likelihood estimation for stochastic compartmental models using Markov chain methods. Statistics and Computing 11, 347-358","227218345":"Bayes estimation: A novel approach to derivation of internally consistent thermodynamic data for minerals, their uncertainties, and correlations. Part I: Theory","4858984":"Markov-Normal analysis of iterative simulations before their convergence","240764027":"Analysis of a Bose–Einstein Markov chain","2255361":"Markov Chain Monte Carlo and Related Topics","2598914":"The Number of Iterations, Convergence Diagnostics and Generic Metropolis Algorithms","243043930":"Multiple-site updates in maximum a posteriori and marginal posterior modes image estimation","237128715":"A Variational Principle for Graphical Models","266309622":"Bayesian Analysis of Ring-Recovery Data Via Markov Chain Monte Carlo Simulation","237310991":"Asymptotic Variance and Convergence Rates of Nearly-Periodic MCMC Algorithms","220785411":"Image Indexing by Focus Map.","2676740":"Ordering, Slicing And Splitting Monte Carlo Markov Chains","237651973":"DISCUSSION PAPER EQUI-ENERGY SAMPLER WITH APPLICATIONS IN STATISTICAL INFERENCE AND STATISTICAL MECHANICS1,2,3","222434674":"Assessing the validity of autologistic regression","227951527":"Likelihood Inference for Gibbs Processes in the Analysis of Spatial Point Patterns*","13237498":"A New Method for Spectral Decomposition Using a Bilinear Bayesian Approach","2278422":"Physiological Pharmacokinetic Analysis Using Population Modeling and Informative Prior Distributions","6869084":"Hierarchical Bayesian Methods for Estimation of Parameters in a Longitudinal HIV Dynamic System","1866282":"Cluster Monte Carlo algorithms and their applications","4771967":"Bayesian Analysis of Agricultural Field Experiments (with discussion)","2834451":"Alternating Subspace-Spanning Resampling to Accelerate Markov Chain Monte Carlo Simulation","35734552":"Convergence of Markov chain Monte Carlo algorithms with applications to image restoration [microform].","239442556":"Bayesian Analysis of Errors-in-Variables Regression Models","3315721":"Multiple Target Direction of Arrival Tracking","227687340":"A mixture model approach to analyzing major element chemistry data of the Changjiang (Yangtze River)","2333283":"Detecting Network Intrusion Using a Markov Modulated Nonhomogeneous Poisson Process","223835411":"Application of azo dyes as dosimetric indicators for enhanced photocatalytic solar disinfection (ENPHOSODIS)","11672823":"Spatial statistical methods in health","4996613":"Bayesian Survival Analysis in Proportional Hazard Models with Logistic Relative Risk","251799880":"A Gibbs sampling approach to maximum a posteriori time delay and amplitude estimation","13747359":"The future of biostatistics: Expecting the unexpected","24063295":"A latent variable model for discrete multivariate psychometric waiting times","3328610":"Image Segmentation Using Hidden Markov Gauss Mixture Models","243464915":"ENFOQUE BAYESIANO PARA LA INVERSIÓN NO PARAMÉTRICA DE MEDICIONES DE DISPERSIÓN DE LUZ","42539736":"MODELOS DE ÁRBOL DE REGRESIÓN BAYESIANO: UN ESTUDIO DE CASO","242389024":"BuildingRobustSimulation-basedFilters forEvolvingDataSets","2695803":"Aspects Of Spatial Statistics, Stochastic Geometry And Markov Chain Monte Carlo Methods","233460152":"Bayesian analysis of contaminated quarter plane moving average models","242295337":"Advances in Markov chain Monte Carlo methods","223654665":"Consideration sets, intentions and the inclusion of “don\u0027t know” in a two-stage model for voter choice","7452716":"Relative focus map estimation using blind deconvolution","2348099":"Bayesian Methods for Hidden Markov Models: Recursive Computing in the 21st Century","220457282":"Statistical and Information-Theoretic Methods for Self-Organization and Fusion of Multimodal, Networked Sensors","14865030":"Stephens D, Smith A. Bayesian inference in multipoint gene mapping. Ann Hum Genet 57: 65-82","5127721":"Metropolis Algorithm and equienergy sampling for two mean field spin systems","227647478":"Model-Based Geostatistic","228553206":"Physiological and Statistical Approaches to Modeling of Synaptic Responses","32247685":"An Efficient Markov Chain Model for the Simulation of Heterogeneous Soil Structure","2277961":"Markov Chain Monte Carlo Methods in Biostatistics","246868189":"Monte Carlo EM Estimation for Time Series Models Involving Counts","216633988":"Fitting and testing stochastic models with application in plant epidemiology","222444851":"Information geometry of the EM and em algorithm for neural networks","2645594":"Modelling Heterogeneity With and Without the Dirichlet Process","262528465":"Gaussian Process Modeling and Optimization of Profile Response Experiments","266088872":"High-resolution imaging of the Pyrenees and Massif Central from the data of the PYROPE and IBERARRAY portable array deployments","268013454":"Použití metody sekvenční stochastické aproximace pro detekci a diagnostiku poruch","4215351":"Motion-based flexible camera registration","227424526":"Simple conditions for the convergence of the Gibbs sampler and Metropolis–Hastings algorithm","4772041":"Maximum likelihood estimation for spatial models by Markov Chain Monte Carlo stochastic approximation","2896046":"Spatial Statistics Models for Stochastic Inverse Problems in Heat Conduction","2469030":"Subsampling the Gibbs Sampler","226405880":"Random variate transformations in the Gibbs sampler: issues of efficiency and convergence","3729073":"Statistical modelling of the chest radiograph and simulation in aBayesian framework","262358312":"Bayesian learning of finite generalized inverted Dirichlet mixtures: Application to object classification and forgery detection","2767014":"Some Adaptive Monte Carlo Methods for Bayesian Inference","228778284":"Transformed and parameter-expanded Gibbs samplers for multilevel linear and generalized linear models","51938199":"An Adaptive Interacting Wang-Landau Algorithm for Automatic Density Exploration","242254560":"Markov Chain Monte Carlo Methods for Statistical Inference","35969205":"Markov random field image modelling /","2859706":"Convergence of Slice Sampler Markov Chains","2725563":"Studies of Neurological Transmission Analysis using Hierarchical Bayesian Mixture Models","23633914":"Subsampling the Gibbs sampler: variance reduction","285397910":"Bioinformatics - From Genomes to Therapies","2372273":"Bayesian Variable Selection and the Swendsen-Wang Algorithm","2827965":"Representations of thermodynamic variability in the automated understanding of FLIR scenes","225304570":"Non-Uniform Random Variate Generation","226788627":"Data Integration using the Probability Perturbation Method","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","2327738":"Entropy Filtering Method and Insertion/Deletion Robust Algorithm for Multiple Local Sequence Alignment","4772050":"Perfect slice samplers","3193514":"Graphical Gaussian Shape Models and Their Application to Image Segmentation","239061667":"Variance Reduction in Gibbs Sampler Using Quasi Random Numbers","264759643":"Spatial Bayesian inversion with localized likelihoods: An exact sampling alternative to MCMC: WALKER AND CURTIS","2333886":"Accumulating Evidence of Fraud Using a Continuous Time Hidden Markov Model","242399981":"Quantitative methods: Bayesian inference, Bayesian thinking","220481920":"Mathematical analysis of the recoil growth algorithm to generate multi-polymer systems","2787469":"Markov Chain Monte Carlo Methods Based on `Slicing\u0027 the Density Function","269021871":"Bayesian estimation of parameters in regression models with spatially autocorrelated errors","241494723":"Partially Collapsed Gibbs Samplers: Illustrations and Applications","271943325":"Dynamic image analysis using Bayesian shape and texture models","222607852":"Approximate Bayes model selection procedures for Gibbs-Markov random fields","220504969":"Posterior Sampling When the Normalizing Constant is Unknown","1759412":"A variant of the Recoil Growth algorithm to generate multi-polymer systems","220110254":"Evaluating the Use of Alternative Distance Metrics in Spatial Regression Analysis of Health Data: A Spatio-Temporal Comparison","227703075":"Mode jumping proposals in MCMC","33519437":"Spatial applications of Markov chain Monte Carlo for Bayesian inference","2120858":"Equi-energy sampler with applications in statistical inference and statistical mechanics","2469023":"Incorporating Toxicity Grade Information in the Continual Reassessment Method","235410098":"Statistical mechanics and information theory. Report, abstracts, bibliography of a workshop.","247389188":"Reparameterizing the generalized linear model to accelerate Gibbs sampler convergence","3720322":"Constrained image restoration with a multinomial prior","1958049":"Bayesian Restoration of Digital Images Employing Markov Chain Monte Carlo a Review","228541219":"Estimation and Inference via Bayesian Simulation: An Introduction to Markov Chain Monte Carlo","224661977":"Gibbs sampling via neural network probability estimation","226077639":"Simulating posterior Gibbs distributions: a comparison of the Swendsen-Wang and Gibbs sampler methods","2395290":"A Coupling-Regeneration Scheme for Diagnosing Convergence in Markov Chain Monte Carlo Algorithms","12360829":"Inference on a collapsed margin in disease mapping","2753768":"Markov chain Monte Carlo and Rao--Blackwellization","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","1771219":"Bédard, M.: Weak convergence of metropolis algorithms for non-i.i.d. target distributions. Ann. Appl. Probab. 17, 1222-1244","2896615":"Model uncertainty. Stat Sci","263263098":"Support Vector Machine for Spatial Variation","2747621":"Monte Carlo error estimation for multivariate Markov chains","227719006":"Optimal scaling of Metropolis algorithms: Heading toward general target distributions","277285450":"Conditional-loglikelihood MDL and Evolutionary MCMC","2634470":"Issues in Bayesian Analysis of Neural Network Models","231049995":"Revised and Extended Analysis of Eight-times Ionized Barium: Ba IX and Nine-times Ionized Barium: Ba X","2257650":"Prior Information and Generalized Questions","227623232":"Markov Chain Monte Carlo Method and its applications","280883820":"Bayesian Estimation of the Parameters of Regression Model with Spatially Auto correlated Errors","5589639":"Beyond the Binary Boltzmann Machine","3315937":"Conditional-mean estimation via jump-diffusion processes in multiple target tracking/recognition","2368759":"A Different Construction Of Gaussian Fields From Markov Chains: Dirichlet Covariances","229762405":"Local Forms of Spatial Analysis","229756263":"Markov Random Field Models","255645675":"Gaussian random field models for spatial data","280589920":"Metropolized Randomized Maximum Likelihood for sampling from multimodal distributions","26359115":"Mapas de taxas epidemiológicas: uma abordagem Bayesiana","34906319":"Determining the cross-channel effects of informational web sites [electronic resource] /","247707171":"Regional Inequality in the Risk of Acute Myocardial Infarction in Finland: A Case Study of 35- to 74YearOld Men","220785096":"Use of Human Motion Biometrics for Multiple-View Registration","277877361":"Automated Target Tracking and Recognition Using Jump-Diffusion Processes.","237634254":"Modellierung der Art-Habitat-Beziehung - ein ¨ Uberblick ¨ uber die Verfahren der Habitatmodellierung","267409685":"9 HSTFMG*aeechj+ Bayesian Spatial and Temporal Epidemiology of Non-communicable Diseases and Mortality","38322349":"Estimating the Second Largest Eigenvalue of a Markov Transition Matrix","38373539":"Exponential Convergence of Langevin Distributions and Their Discrete Approximations","221607897":"Learning to recognize valuable tags","3597510":"Lie group parametrization for dynamics based prior in ATR","5954219":"Phylogenetic tree construction using sequential stochastic approximation Monte Carlo","51320318":"Issues in Bayesian Analysis of Neural Network Models","2469075":"Auxiliary Variable Methods for Markov Chain Monte Carlo with Applications","227643751":"Perfect slice samplers","243615858":"Stochastic geometry models in high-level vision","282790946":"Statistics: A data science for the 21st century","255570375":"The modes of posterior distributions for mixed linear models","225860489":"A process-convolution approach to modelling temperatures in the North Atlantic Ocean (Disc: P191-192)","2666794":"A Model-Based Approach for Variable Bandwidth Selection in Kernel Density Estimation","226912900":"Reversible algorithm of simulating multivariate densities with multi-hump","2516768":"Algorithms Based on Data Augmentation: A Graphical Representation and Comparison","222538820":"A different construction of Gaussian fields from Markov chains: Dirichlet covariances","38339907":"Importance sampling for families of distributions","11159972":"A Nonparametric Bayesian Modeling Approach for Cytogenetic Dosimetry","225547903":"A new strategy for speeding Markov chain Monte Carlo algorithms","2830139":"Recent Progress on Computable Bounds and the Simple Slice Sampler","223528000":"Bayesian Inference for Multivariate Survival Data with a Cure Fraction","242577766":"Annealing Markov Chain Monte Carlo with Applications to Ancestral Inference","227197084":"Langevin-Type Models II: Self-Targeting Candidates for MCMC Algorithms*","23634047":"V-Subgeometric ergodicity for a Hastings-Metropolis algorithm","225800813":"The Probability Perturbation Method: A New Look at Bayesian Inverse Modeling","247011232":"On Markov Chain Monte Carlo Acceleration","227932297":"Fitting Non-Linear Time Series Models, with Applications to Stochastic Variance Models","228573826":"On Adaptive Metropolis-Hastings Methods","2779957":"Representation of Gibbs fields with Synchronous Random Fields.","11266484":"A Bayesian space varying parameter applied to estimating fertility schedules","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","228928643":"Generalizing Swendsen–Wang for Image Analysis","222541412":"Efficiency of finite state space Monte Carlo Markov chains","222726254":"Bayesian analysis of regression models with spatially correlated errors and missing observations","2465037":"Bayesian Phylogenetic Inference via Markov Chain Monte Carlo Methods","2778374":"Methods for Approximating Integrals in Statistics with Special Emphasis on Bayesian Integration Problems","11969945":"Bayesian 2-D deconvolution: A model for diffuse ultrasound scattering","243763126":"Estimation of Finite Mixture Distributions Through Bayesian Sampling","2750746":"Regeneration in Markov Chain Samplers","229760130":"Gibbs Sampling","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","229464731":"A review of point pattern methods for spatial modelling of events around sources of pollution","222488703":"Monte Carlo inference methods in population genetics","220286492":"Bayesian Analysis of the Unobserved ARCH Model","221654024":"Harnessing Graphical Structure in Markov Chain Monte Carlo Learning.","2777364":"Bounding Convergence Time of the Gibbs Sampler in Bayesian Image Restoration","46434299":"Retrieving Unobserved Consideration Sets from Household Panel Data","27468515":"An efficient MCMC method for distributions with intractable normalising constants","47934875":"Adaptive Markov Chain Monte Carlo Algorithms with Geophysical Applications","243103037":"Evolutionary Simulated Annealing With Application to Image Restoration","3317619":"A Bayesian approach to geometric subspace estimation","2286432":"Bayesian Modelling of Outstanding Liabilities Incorporating Claim Count Uncertainty","222482945":"Maximum likelihood restoration and choice of smoothing parameter in deconvolution of image data subject to Poisson noise","4897039":"On the influence of the proposal distributions on a reversible jump MCMC algorithm applied to the detection of multiple change-points","4745984":"On Khintchines Theorem and its Place in Random Variate Generation","2421096":"Bayesian Model Averaging And Model Selection For Markov Equivalence Classes Of Acyclic Digraphs","254287975":"Missing data: Dial M for","50903128":"Fitting Bayesian multiple random effects models","254296186":"Structured Markov Chain Monte Carlo","227413724":"Smooth-CAR Mixed Models for Spatial Count Data","248808832":"A Comparative Study of Markov Chain Monte Carlo Methods for Conceptual Rainfall-Runoff Modeling","229886694":"Variable smoothing in Bayesian intrinsic autoregressions","257701892":"Hierarchical Mixture Models in Neurological Transmission Analysis","2574717":"Controlled MCMC for optimal sampling","263167730":"Retrieval of forest stand attributes using optical airborne remote sensing data","220603512":"Positron emission tomography by Markov chain Monte Carlo with auxiliary variables","246187468":"Conditional Independence Models for Epidemiological Studies withCovariates Measurement Error","227425005":"Geometric ergodicity of Metropolis algorithms","2645324":"On the Use of Auxiliary Variables in Markov Chain Monte Carlo Sampling","250754966":"Ch. 9. Empirical estimators based on MCMC data","2784591":"Inference from a Deterministic Population Dynamics Model for Bowhead Whales: Rejoinder","266237115":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","259624991":"A new class of flexible link functions with application to species co-occurrence in Cape Floristic Region","254287439":"Bayesian Faces via Hierarchical Template Modeling","225754643":"Bayesian and non-bayesian analysis of gamma stochastic frontier models by Markov Chain Monte Carlo methods","267260039":"Encyclopaedia of Biostatistics: Image analysis and tomography","30045859":"Optimal Scaling for Random Walk Metropolis on Spherically Constrained Target Densities","10681800":"Markov Chain Monte Carlo Approaches to Analysis of Genetic and Environmental Components of Human Developmental Change and G × E Interaction","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","228716237":"Using Redundant Parameterizations to Fit Hierarchical Models","3326301":"Nonlinear Image Recovery with Half-Quadratic Regularization","2428234":"Automatic Target Recognition via the Simulation of Infrared Scenes","277289463":"Optimal scaling of Metropolis algorithms: is 0.234 as robust as believed?","243011853":"Expectations for Nonreversible Markov Chains","2649435":"MCMC Methods For Discrete Sojourn Time Ion Channel Data","45930440":"A generalized risk approach to path inference based on hidden Markov models","2538835":"Shape reconstruction in X-ray tomography from a small number of projections using deformable models","2930010":"Hierarchical Bayesian Models for Inverse Problems in Heat Conduction","220416605":"Graphical Models, Exponential Families, and Variational Inference","24065262":"Estimation of a normal mixture model through Gibbs sampling and Prior Feedback","227644434":"On the Flexibility of Metropolis–Hastings Acceptance Probabilities in Auxiliary Variable Proposal Generation","266336860":"The Directional Neighborhoods Approach to Contextual Classification of Images from Noisy Data","243448065":"Probabilistic small area risk assessment using GIS-based data: a case study on Finnish childhood diabetes","5127626":"Ordering and improving Monte Carlo Markov chains performance","259580158":"Bayesian Nonparametric Inference for the Power Likelihood","243103227":"Sampling Schemes for Bayesian Variable Selection in Generalized Linear Models","246983999":"Numerical Analysis For Statisticians","2310052":"Ordering Monte Carlo Markov Chains","2620334":"Error of Kernel Estimator: Monitoring Convergence of Markov Samplers","51887262":"Cross-Fertilizing Strategies for Better EM Mountain Climbing and DA\nField Exploration: A Graphical Guide Book","237680032":"Towards an integrated approach to stochastic process-based modelling: With applications to animal behaviour and spatio-temporal spread","2430895":"Metropolized Independent Sampling with Comparisons to Rejection Sampling and Importance Sampling","220602541":"A version of the Swendsen-Wang algorithm for restoration of images degraded by Poisson noise","237419946":"Web Appendix Retrieving Unobserved Consideration Sets from Household Panel Data","222394575":"Stochastic modelling of ecological processes using hybrid Gibbs samplers","271412130":"Consideration sets, intentions and the inclusion of ?don\u0027t know? in a two-stage model for voter choice","226329837":"Prediction by conditional simulation: models and algorithms","4914136":"Gibbs Sampling for Bayesian Non-Conjugate and Hierarchical Models by Using Auxiliary Variables","2590645":"Fast Simulation of Markov Cluster Processes","229025840":"Building robust simulation-based filters for evolving data sets","246921504":"Conditional expectations and residual analysis for the linear model","238515119":"Hit and Run as a Unifying Device","13507924":"A Bayesian hierarchical survival model for the institutional effects in a multi-centre cancer clinical trial","2440127":"Nonparametric Bayes Inference for Concave Distribution Functions","222298844":"Optimal acceptance rates for Metropolis algorithms: Movin beyond 0.234","23489734":"Ecogeographic Genetic Epidemiology","31144571":"A recursive algorithm for Markov random fields","47161711":"Bayesian-Analysis of Mixed Linear-Models Via Gibbs Sampling with an Application to Litter Size in Iberian Pigs","229222921":"11 Spatial statistical methods for environmental epidemiology","23524551":"\"Bayesian Analysis of Poisson Mixtures\"","226046683":"Langevin-Type Models I: Diffusions with Given Stationary Distributions and their Discretizations*","267718230":"Statistical Restoration of Images Using a Hybrid Bayesian Approach","23633613":"The efficiency of ordinary least squares in designed experiments subject to spatial or temporal variation, Statistics \u0026 Probability Letters 41","14988098":"Use of the Gibbs sampler to estimate transition rates between grades of coronary disease following cardic transplantation","4746208":"Asymptotic Variance and Convergence Rates of Nearly-Periodic Markov Chain Monte Carlo Algorithms","241527245":"Computation Intensive Methods: State of the Art","222704365":"Bayesian analysis of nested logit models by Markov Chain Monte Carlo","266747978":"Control Functionals for Quasi-Monte Carlo Integration","2364811":"Gibbs Sampling","271759773":"Bayesian Methods for Hidden Markov Models","257940719":"Monte Carlo Methods in Bayesian Statistics","228722193":"Prediction of nonlinear spatial functionals","228611091":"Model-based analysis to improve the performance of iterative simulations","24053980":"Semiparametric estimation of mean and variance functions for non-Gaussian data","2763166":"Von Mises type statistics for single site updated local interaction random fields","245099823":"Gibbs sampling of climatic trends and periodicities","244507428":"The Collapsed Gibbs Sampler in Bayesian Computations with Applications to a Gene Regulation Problem","2462098":"Cluster Algorithms for Spatial Point Processes with Symmetric and Shift Invariant Interactions","2601375":"Estimating Ratios of Normalizing Constants for Densities with Different Dimensions","254672533":"A Statistical Approach to an Ocean Circulation Inverse Problem","230268929":"Convergence and Mixing in Markov Chain Monte Carlo","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","220286619":"Slice Gibbs sampling for simulation based fitting of spatial models","2295197":"The Polar Slice Sampler","227639343":"Probabilistic data analysis: An introductory guide","241724374":"Conditioning in Markov Chain Monte Carlo","254287511":"Studying Convergence of Markov Chain Monte Carlo Algorithms Using Coupled Sample Paths","23977647":"Controlled MCMC for Optimal Sampling","228597350":"The Practical Implementation of Bayesian Model Selection","233163823":"A Bayesian nonparametric density estimator","3192829":"Synchronous random fields and image restoration","227687007":"Markov Chain Monte Carlo Methods for Fitting Spatiotemporal Stochastic Models in Plant Epidemiology","2741222":"Bayesian Density Estimation and Inference Using Mixtures","283154737":"Spatial Distribution of TDS in Drinking Water of Tehsil Jampur using Ordinary and Bayesian Kriging","241140108":"Bayesian approach for investigating the relationship between road traffic pollution and asthma among children","226505300":"Difficulties in the use of auxiliary variables in Markov chain Monte Carlo methods","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","2737661":"Spatial Stochastic Models for Seabed Object Detection","2128884":"General Design Bayesian Generalized Linear Mixed Models","51953356":"Issues in Designing Hybrid Algorithms","223409286":"A comparison of hybrid strategies for Gibbs sampling in mixed graphical models","37678054":"Computational methods for complex problems in extreme value theory.","2811376":"Markov Chain Monte Carlo for Statistical Inference","248132886":"Towards Automatic Reversible Jump Markov Chain Monte Carlo","265511950":"Convergence of hybrid slice sampling via spectral gap","2700790":"Statistical Mechanics and Information Theory","2468858":"Spatially Disaggregated Real Estate Indices","5567413":"Methods for numerical integration of high-dimensional posterior densities with application to statistical image models","243049886":"Bayesian analysis of hierarchical Poisson models with latent variables","2663884":"Bayesian Inference for Semiparametric Binary Regression","31313973":"Estimating parameters in stochastic compartmental models using Markov Chain methods","4744096":"Pay Phones, Parking Meters, Vending Machines, and Optimal Bayesian Decisions on Collection Times","258654339":"A novel Bayesian strategy for the identification of spatially varying material properties and model validation: An application to static elastography","228968008":"Marginal Markov Chain Monte Carlo Methods","2682821":"Markov Chain Monte Carlo Convergence Diagnostics: A Comparative Review","2333132":"Shape reconstruction in X-ray tomography from a small number of projections using deformable models","222435506":"A Markov random field model of contamination source identification in porous media flow","277742459":"Essays on the Bayesian Inequality Restricted Estimation","30838316":"Bayesian Nonparametric and Covariate Analysis of Failure Time Data","2504666":"Markov Chain Monte Carlo in Practice: A Roundtable Discussion","244220786":"A Computational Statistics Approach to Stochastic Inverse Problems and Uncertainty Quantication in Heat Transfer","3192270":"An Empirical Study of the Simulation of Various Models Used for Images","221118163":"Cells In Silico (CIS): A biomedical simulation framework based on Markov random field."},"index":82}