{"abs":"We consider the problem of maximizing a real-valued continuous function $f$ using a Bayesian approach. Since the early work of Jonas Mockus and Antanas \\v{Z}ilinskas in the 70\u0027s, the problem of optimization is usually formulated by considering the loss function $\\max f - M_n$ (where $M_n$ denotes the best function value observed after $n$ evaluations of $f$). This loss function puts emphasis on the value of the maximum, at the expense of the location of the maximizer. In the special case of a one-step Bayes-optimal strategy, it leads to the classical Expected Improvement (EI) sampling criterion. This is a special case of a Stepwise Uncertainty Reduction (SUR) strategy, where the risk associated to a certain uncertainty measure (here, the expected loss) on the quantity of interest is minimized at each step of the algorithm. In this article, assuming that $f$ is defined over a measure space $(\\mathbb{X}, \\lambda)$, we propose to consider instead the integral loss function $\\int_{\\mathbb{X}} (f - M_n)_{+}\\, d\\lambda$, and we show that this leads, in the case of a Gaussian process prior, to a new numerically tractable sampling criterion that we call $\\rm EI^2$ (for Expected Integrated Expected Improvement). A numerical experiment illustrates that a SUR strategy based on this new sampling criterion reduces the error on both the value and the location of the maximizer faster than the EI-based strategy.","title":"A new integral loss function for Bayesian optimization","id":264936662,"url":"https://www.researchgate.net/publication/264936662_A_new_integral_loss_function_for_Bayesian_optimization","names":["Emmanuel Vazquez","Julien Bect"],"references":{"242922491":"Bayesian Approach to Global Optimization--Theory and Applications","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","258831560":"Fast Computation of the Multi-Points Expected Improvement with Applications in Batch Selection","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","248818761":"The application of Bayesian methods for seeking the extremum","257299288":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction"},"citedIn":{"282570552":"A Bayesian approach to constrained single- and multi-objective optimization"},"index":84}