{"abs":"This paper investigates conditions under which the Gibbs sampler (Gelfand and Smith, 1990; Tanner and Wong, 1987; Geman and Geman, 1984) converges at a geometric rate. The main results appear in Sections 2 and 3, where geometric convergence results are established, with respect to total variation and supremum norms under fairly natural conditions on the underlying distribution. For ease of exposition, we shall concentrate on the two most commonly encountered situations, where the state space is finite or continuous. All our results will establish uniform convergence, a strong form of geometric convergence, under appropriate regularity conditions. Uniform convergence is a useful property in its own right but also happens to be a sufficient condition for certain ergodic central limit theorems. Such results are important for estimation in Markov chain simulation but will not be considered in detail here","title":"On the Geometric Convergence of the Gibbs Sampler","id":2554222,"url":"https://www.researchgate.net/publication/2554222_On_the_Geometric_Convergence_of_the_Gibbs_Sampler","names":["Gareth O. Roberts","O. Robertst","Nicholas G. Polson","Journal of the Royal Statistical Society. Series B: Methodological"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","235014147":"Exploring Posterior Distributions Using Markov Chains","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","242505862":"General Irreducible Markov Chains and Non-Negative Operators","242443041":"Non-Negative Matrices and Markov Chains","230872806":"Linear Operators, Part I: General Theory","258306977":"Finite Markov Chain","200622065":"Equation of State Calculations by Fast Computing Machines","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741"},"citedIn":{"227424526":"Simple conditions for the convergence of the Gibbs sampler and Metropolis–Hastings algorithm","226912900":"Reversible algorithm of simulating multivariate densities with multi-hump","266750309":"An Adaptive Random Search for Unconstrained Global Optimization","220504737":"Sampling Methods for Wallenius\u0027 and Fisher\u0027s Noncentral Hypergeometric Distributions","41415920":"Bayesian Inference Based on Stationary Fokker-Planck Sampling","24148216":"Component-Wise Markov Chain Monte Carlo: Uniform and Geometric Ergodicity under Mixing and Composition","250356324":"Notes on Perfect Simulation","289526601":"gsgs-paper","4986693":"Fixed-Width Output Analysis for Markov Chain Monte Carlo","23418348":"Batch Means and Spectral Variance Estimation in Markov Chain Monte Carlo","226235248":"Markov Chain Monte Carlo","288059815":"Nonlinear Filtering with Population Codes","233866237":"Optimisation via Slice Sampling","242282749":"with Sparse Kernels","261305884":"Automatic Segmentation of Molecular Pathology Images Using a Robust Mixture Model with Markov Random Fields","225653731":"Additivity, Convexity and Beyond: Application of Minkowski Functionals in Statistical Physics","227577858":"Markov-chain Monte Carlo: Some practical implications of theoretical results","222605911":"Geometric Ergodicity of Gibbs and Block Gibbs Samplers for a Hierarchical Random Effects Model","265528000":"Monte Carlo Standard Errors for Markov Chain Monte Carlo","2520242":"Image Sequence Restoration Using Gibbs Distributions","4859487":"Bayesian Analysis of Contingent Claim Model Error","225469285":"Stochastic Models as Tools for the Analysis of Decomposition and Crystallisation Phenomena in Solids","227716616":"On the Geometric Ergodicity of Two-Variable Gibbs Samplers","274615492":"Bridge Remaining Strength Prediction Integrated with Bayesian Network and In Situ Load Testing","2552381":"MCMC Methods for Financial Econometrics","257435719":"Bayesian learning of inverted Dirichlet mixtures for SVM kernels generation","2655031":"Information bounds for Gibbs samplers","268025947":"Convergence of Conditional Metropolis-Hastings Samplers, with an Application to Inference for Discretely-Observed Diffusions","226337625":"“Bayesian Inference for Finite Mixture Models of Generalized Linear Models with Random Effects.”","257940719":"Monte Carlo Methods in Bayesian Statistics","243763126":"Estimation of Finite Mixture Distributions Through Bayesian Sampling","229760130":"Gibbs Sampling","224123886":"Bayesian non-parametric simulation of hazard functions","264925564":"Convergence of conditional Metropolis-Hastings samplers","36156304":"Hierarchical Bayesian modelling for the analysis of the lactation of dairy animals /","2395290":"A Coupling-Regeneration Scheme for Diagnosing Convergence in Markov Chain Monte Carlo Algorithms","2777364":"Bounding Convergence Time of the Gibbs Sampler in Bayesian Image Restoration","48198752":"Adaptive Gibbs samplers and related MCMC methods","244473554":"Novel approaches to image reconstruction in diffusion tomography","221497331":"A Randomized Approximation of the MDL for Stochastic Models with Hidden Variables.","237176163":"Bayesian estimation of humpback whale (Megaptera novaeangliae) population abundance and movement patterns in southeastern Alaska","242429873":"Models and simulation techniques from stochastic geometry","243103678":"[Bayesian Computation and Stochastic Systems]: Rejoinder","257169559":"Recovery of hidden information from stock price data: A semiparametric approach","2900335":"A Primer on Perfect Simulation","281240839":"Application of survival analysis methods to study under-five child mortality in Uganda.","239442563":"Bayesian Analysis of Finite Mixture Distributions","51928158":"Hierarchical Bayesian estimation of inequality measures with\nnonrectangular censored survey data with an application to wealth\ndistribution of French households","228890604":"Maximum Expected Utility via MCMC","38349441":"Perfect simulation of some point processes for the impatient user","241713312":"An optimal bound for inverses of triangular matrices with monotone entries","229867642":"Slow convergence of the Gibbs sampler","2136938":"Markov Chain Monte Carlo: Can We Trust the Third Significant Figure?","1771088":"Stationary probability density of stochastic search processes in global optimization","225613631":"Basic Ideas ofSpatial Statistics","45895665":"Adaptive Gibbs samplers","51916105":"An estimation of distribution algorithm with adaptive Gibbs sampling for unconstrained global optimization","227623232":"Markov Chain Monte Carlo Method and its applications","226539729":"Convergence assessment techniques for Markov chain Monte Carlo","244475332":"On the Convergence of Successive Substitution Sampling","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","220136521":"Random Variate Generation for Multivariate Unimodal Densities.","38348447":"Convergence and accuracy of Gibbs sampling for conditional distributions in generalized linear models","228167872":"MCMC Methods for Continuous-Time Financial Econometrics","38350870":"Sensitivity and convergence of uniformly ergodic Markov chains","250754966":"Ch. 9. Empirical estimators based on MCMC data","289526692":"Gradient Scan Gibbs Sampler: an efficient algorithm for high-dimensional Gaussian distributions","239294884":"Functional Compatibility, Markov Chains, and Gibbs Sampling with Improper Posteriors","2261835":"Convergence Rates for Markov Chains","240925111":"MCMC Methods to Estimate Bayesian Parametric Models","222404142":"Characterization of the convergence of stationary Fokker–Planck learning","270277358":"Geometric Ergodicity of Random Scan Gibbs Samplers for Hierarchical One-Way Random Effects Models","222606257":"Validation of reliability computational models using Bayes networks. Reliab Eng Syst Saf","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","26406507":"On the Markov chain central limit theorem","226882559":"Bounding convergence rates for Markov chains: An example of the use of computer algebra","228539746":"The EM algorithm","264929335":"Numerical Methods of Statistics","268339584":"BAYESIAN INFERENCE ON DYNAMICS OF INDIVIDUAL AND POPULATION HEPATOTOXICITY VIA STATE SPACE MODELS","233470612":"Equations of convolution type with monotone coefficients"},"index":840}