{"abs":"There has been a recent interest in determining high statistical reliability in risk assessment of aircraft components. The potential consequences are identified of incorrectly assuming a particular statistical distribution for stress or strength data used in obtaining the high reliability values. The computation of the reliability is defined as the probability of the strength being greater than the stress over the range of stress values. This method is often referred to as the stress-strength model. A sensitivity analysis was performed involving a comparison of reliability results in order to evaluate the effects of assuming specific statistical distributions. Both known population distributions, and those that differed slightly from the known, were considered. Results showed substantial differences in reliability estimates even for almost nondetectable differences in the assumed distributions. These differences represent a potential problem in using the stress-strength model for high reliability computations, since in practice it is impossible to ever know the exact (population) distribution. An alternative reliability computation procedure is examined involving determination of a lower bound on the reliability values using extreme value distributions. This procedure reduces the possibility of obtaining nonconservative reliability estimates. Results indicated the method can provide conservative bounds when computing high reliability. An alternative reliability computation procedure is examined involving determination of a lower bound on the reliability values using extreme value distributions. This procedure reduces the possibility of obtaining nonconservative reliability estimates. Results indicated the method can provide conservative bounds when computing high reliability.","title":"Uncertainties in obtaining high reliability from stress-strength models","id":234373301,"url":"https://www.researchgate.net/publication/234373301_Uncertainties_in_obtaining_high_reliability_from_stress-strength_models","names":["Donald M. Neal","William T. Matthews","Mark Vangel"],"references":{},"citedIn":{"253883313":"Reliability-Based Aircraft Structural Design Pays, Even with Limited Statistical Data","253488707":"Aircraft structural safety: Effects of explicit and implicit safety measures and uncertainty reduction mechanisms","267411401":"Conservative estimations of reliability with limited sampling","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions"},"index":853}