{"abs":"It was recently proven that sets of points maximizing the hypervolume indicator do not give a good multiplicative approximation of the Pareto front. We introduce a new \"logarithmic hypervolume indicator\" and prove that it achieves a close-to-optimal multiplicative approximation ratio. This is experimentally verified on several benchmark functions by comparing the approximation quality of the multi-objective covariance matrix evolution strategy (MO-CMA-ES) with the classic hypervolume indicator and the MO-CMA-ES with the logarithmic hypervolume indicator.","title":"The logarithmic hypervolume indicator","id":221271214,"url":"https://www.researchgate.net/publication/221271214_The_logarithmic_hypervolume_indicator","names":["Tobias Friedrich","Karl Bringmann","Thomas Voß","Christian Igel"],"references":{"3880857":"On the approximability of trade-offs and optimal access of Web sources","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","3949503":"Scalable multi-objective optimization test problems","220743243":"G-Metric: an M-ary quality indicator for the evaluation of non-dominated sets","221228555":"Steady-State Selection and Efficient Covariance Matrix Update in the Multi-objective CMA-ES","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","216457248":"The maximum hypervolume set yields near-optimal approximation","262405508":"On Set-Based Multiobjective Optimization","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","41786737":"Efficient Covariance Matrix Update for Variable Metric Evolution Strategies","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","216457303":"Indicator-Based Selection in Multiobjective Search","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","216457232":"Investigating and Exploiting the Bias of the Weighted Hypervolume to Articulate User Preferences","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","220701597":"Tight Bounds for the Approximation Ratio of the Hypervolume Indicator","45229385":"Improved step size adaptation for the MO-CMA-ES","216300984":"Running Time Analysis of a Multiobjective Evolutionary Algorithm on Simple and Hard Problems","4074752":"Bounded archiving using the Lebesgue measure","47843204":"Multiplicative Approximations and the Hypervolume Indicator"},"citedIn":{"266422899":"Hypervolume-based Metaheuristics for Multiobjective Optimization","254462104":"GECCO 2012 tutorial on evolutionary multiobjective optimization","280046850":"Multi-objective Monte-Carlo Tree Search","261030283":"Multiplicative Approximations, Optimal Hypervolume Distributions, and the Choice of the Reference Point","259084900":"Speeding up many-objective optimization by Monte Carlo approximations","280534066":"Bi-goal evolution for many-objective optimization problems","256660343":"Approximation quality of the hypervolume indicator"},"index":859}