{"abs":"Fitness landscape analysis aims to understand the geometry of a given optimization problem in order to design more efficient search algorithms. However, there is a very little knowledge on the landscape of multiobjective problems. In this work, following a recent proposal by Zitzler et al. (2010), we consider multiobjective optimization as a set problem. Then, we give a general definition of set-based multiobjective fitness landscapes. An experimental set-based fitness landscape analysis is conducted on the multiobjective NK-landscapes with objective correlation. The aim is to adapt and to enhance the comprehensive design of set-based multiobjective search approaches, motivated by an a priori analysis of the corresponding set problem properties.","title":"Set-based Multiobjective Fitness Landscapes: A Preliminary Study","id":50842467,"url":"https://www.researchgate.net/publication/50842467_Set-based_Multiobjective_Fitness_Landscapes_A_Preliminary_Study","names":["Sebastien Verel","Clarisse Dhaenens","Arnaud Liefooghe"],"references":{"3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","223087337":"A study of local search algorithms for the biobjective QAP with correlated flow matrices","4941389":"A parametric approach to solving bicriterion shortest path problems","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","262405508":"On Set-Based Multiobjective Optimization","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","220981282":"Towards Landscape Analyses to Inform the Design of Hybrid Local Search for the Multiobjective Quadratic Assignment Problem.","23740259":"Evolutionary Algorithms, Fitness Landscapes and Search","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","48416169":"Analyzing the Effect of Objective Correlation on the Efficient Set of MNK-Landscapes","239666311":"The Origins of Order","225505633":"Fitness landscapes","216457303":"Indicator-Based Selection in Multiobjective Search","8357641":"Advanced Fitness Landscape Analysis and the Performance of Memetic Algorithms","224472154":"Plateau Connection Structure and Multiobjective Metaheuristic Performance","221608778":"Multiobjective Landscape Analysis and the Generalized Assignment Problem","223562060":"Working principles, behavior, and performance of MOEAs on MNK-landscapes"},"citedIn":{"254462104":"GECCO 2012 tutorial on evolutionary multiobjective optimization","259523293":"A hybrid metaheuristic for multiobjective unconstrained binary quadratic programming","266653730":"On set-based local search for multiobjective combinatorial optimization","282530911":"Many-Objective Evolutionary Algorithms"},"index":860}