{"abs":"A major challenge to the successful full-scale development of modern aerospace systems is to address competing objectives such as improved performance, reduced costs, and enhanced safety. Accurate, high-fidelity models are typically time consuming and computationally expensive. Furthermore, informed decisions should be made with an understanding of the impact (global sensitivity) of the design variables on the different objectives. In this context, the so-called surrogate-based approach for analysis and optimization can play a very valuable role. The surrogates are constructed using data drawn from high-fidelity models, and provide fast approximations of the objectives and constraints at new design points, thereby making sensitivity and optimization studies feasible. This paper provides a comprehensive discussion of the fundamental issues that arise in surrogate-based analysis and optimization (SBAO), highlighting concepts, methods, techniques, as well as practical implications. The issues addressed include the selection of the loss function and regularization criteria for constructing the surrogates, design of experiments, surrogate selection and construction, sensitivity analysis, convergence, and optimization. The multi-objective optimal design of a liquid rocket injector is presented to highlight the state of the art and to help guide future efforts.","title":"Surrogate-based analysis and optimization","id":223564511,"url":"https://www.researchgate.net/publication/223564511_Surrogate-based_analysis_and_optimization","names":["Nestor V Queipo","Raphael Haftka","Wei Shyy","Tushar Goel","Rajkumar Vaidyanathan","P. Kevin Tucker","Progress in Aerospace Sciences"],"references":{"243098492":"Analysis of Discrete Ill-Posed Problems by Means of the L-Curve","242375537":"Comparison of Approximation Models with Merit Functions for Design Optimization","243679109":"Estimating the Error Rate of a Prediction Rule: Improvement on Cross-Validation","268633088":"Orthogonal Array: Theory and Applications","259234423":"Response Surface Techniques for Diffuser Shape Optimization","245893283":"Designs for Computer Experiments","51992084":"Numerical Methods for Unconstrained Optimization and Nonlinear Equations. SIAM, Philadelphia","254042923":"Use of Kriging Models to Approximate Deterministic Computer Models","38363487":"The Design and Analysis of Computer Experiments","255619878":"Computational-Fluid-Dynamics-Based Design Optimization for Single-Element Rocket Injector","254333749":"Orthogonal Arrays: Theory and Applications","239059746":"Response Surface Models Combining Linear and Euler Aerodynamics for Supersonic Transport Design","245078917":"Importance Measures in Global Sensitivity Analysis of Nonlinear Models","2630664":"Dennis Jr, J.E.: A pattern search filter method for nonlinear programming without derivatives. SIAM J. Optim. 14(4), 980-1010","226218074":"New formulation of a minimum-bias experimental design based on Gauss quadrature","254287372":"Kriging and Splines: An Empirical Comparison of Their Predictive Performance in Some Applications","229881241":"JMP Statistical Discovery Software, ver 5.1","24302175":"Improving the Unsteady Aerodynamic Performance of Transonic Turbines using Neural Networks","238342681":"Principles of geostatistics. Econ Geol (Lancaster)","267421663":"Multiple Surrogates for the Shape Optimization of Bluff Body-Facilitated Mixing","262956700":"Optimal Aeroacoustic Shape Design Using the Surrogate Management Framework: Surrogate Optimization (Guest Editors: Charles Audet, John E. Dennis and Luis N. Vicente)","215721451":"Neural Networks For Pattern Recognition","226620850":"Infill sampling criteria to locate extremes. Math Geol 27: 589-608","243587760":"A Quantitative Model-Independent Method for Global Sensitivity Analysis of Model Output","261584545":"Applied Regression Analysis","241158759":"Global design optimization for aerodynamics and rocket propulsion components","45622657":"Statistical Learning Theory","2347550":"A Trust Region Framework For Managing Approximation Models In Engineering Optimization","221997061":"Solution of Ill-Posed Problems","238688634":"AIAA 2004-4007 GLOBAL SENSITIVITY AND TRADE-OFF ANALYSES FOR MULTI-OBJECTIVE LIQUID ROCKET INJECTOR DESIGN","223182606":"Surrogate Modeling-Based Optimization for the Integration of Static and Dynamic Data Into a Reservoir Description","222526471":"Validation of regression metamodels in simulation: Bootstrap approach","2710628":"Using Approximations To Accelerate Engineering Design Optimization","245093077":"A Surrogate-Model-Based Method For Constrained Optimization","243042867":"Sensitivity Analysis and Related Analyses: A Review of Some Statistical Techniques","233801151":"Generalized Cross-Validation as a Method for Choosing a Good Ridge Parameter","242369057":"First-order model management with variable-fidelity physics applied to multi-element airfoil optimization","226281257":"Convergence of trust region augmented Lagrangian methods using variable fidelity approximation data","2317176":"Comparative Studies Of Metamodeling Techniques Under Multiple Modeling Criteria","2582140":"Nonlinear programming without a penalty function. Math. Program. Ser. A 91, 239-269","223786763":"Surrogate modeling-based optimization of SAGD processes","260406235":"Projection Pursuit Regression","225225523":"Smoothing Noisy Data with Spline Functions","2675063":"A Comparison Of Approximation Modeling Techniques: Polynomial Versus Interpolating Models","11287753":"Identification and Review of Sensitivity Analysis Methods","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","225347080":"A Minimum Bias Latin Hypercube Design","13587623":"An Equivalence Between Sparse Approximation And Support Vector Machines","38360101":"On the Bootstrap of Confidence Intervals","23886337":"Unified Navier-Stokes flowfield and performance analysis of liquid rocket engines","268567666":"Interaction between Grid and Design Space Refinement for Bluff Body-Facilitated Mixing","216756632":"Sequential Design of Computer Experiments to Minimize Integrated Response Functions","270446185":"Applied Regression Analysis","24298249":"Investigation of gaseous propellant combustion and associated injector/chamber design guidelines","242389519":"Factorial Sampling Plans for Preliminary Computational Experiments","230930365":"The role of non-linearity in inversion","4234176":"The Mathematics of Learning: Dealing With Data","243781121":"Bayesian\u0027\u0027Confidence Intervals\u0027\u0027for the Cross-Validated Smoothing Spline","216213861":"Statistical Regularization of Inverse Problems","243048186":"A Distribution-Free Approach to Inducing Rank Correlation Among Input Variates","2749603":"On the Convergence of Pattern Search Algorithms. SIAM J on Optimization 7: 1-25","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","2385583":"A Rigorous Framework for Optimization of Expensive Functions by Surrogates","216756581":"Controlling Correlations in Latin Hypercube Samples","216756580":"Orthogonal Column Latin Hypercubes and Their Application in Computer Experiments","23630072":"A Comparison of Kriging With Nonparametric Regression Methods","216756602":"Large Sample Properties of Simulations Using Latin Hypercube Sampling","243098095":"Methods for Solving Incorrectly Posed Problems (V. A. Morozov)","216756606":"Orthogonal Array-Based Latin Hypercubes","216756605":"Orthogonal Arrays for Computer Experiments, Integration and Visualization","227319575":"Comparative Studies of Metamodeling Techniques Under Multiple Modeling Criteria","220694713":"Statistical Learning Theory","245992758":"E卤cient global optimization of expensive black-box functions","237109635":"Linear and Nonlinear Programming","2841737":"Complete Cross-Validation for Nearest Neighbor Classifiers","24083400":"Optimal orthogonal-array-based Latin hypercubes","222490346":"Minimax and Maximin Distance Designs","23827395":"Neural Network and Response Surface Methodology for Rocket Engine Component Optimization","200033861":"Neural Networks for Pattern Recognition","216301385":"Metamodeling Sampling Criteria in a Global Optimization Framework","27290896":"Linear and Nonlinear Programming","230872695":"A Basis for the Selection of a Response Surface Design","23844567":"Preliminary Design Optimization For A Supersonic Turbine For Rocket Propulsion","2438296":"When Networks Disagree: Ensemble Methods for Hybrid Neural Networks","242376908":"An Introduction to The Bootstrap","269224627":"Response surface model development for global/local optimization using radial basis functions","254512621":"Efficient Global Optimization For Hydraulic Fracturing Treatment Design","2799076":"Convergence of trust region augmented Lagrangian methods using variable fidelity approximation data","4233872":"The Mathematics of Learning: Dealing with Data","38359195":"Some Model Robust Designs in Regression","229193594":"Linear Statistical Inference and Its Applications, Second Edition","236843208":"Kriging Models for Global Approximation in Simulation-Based Multidisciplinary Design Optimization","229792613":"An Investigation Of Uncertainty And Sensitivity Analysis Techniques For Computer-Models","222540952":"Algorithmic Construction of Symmetric Latin Hypercube Designs","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","23588998":"Constrained Aeroacoustic Shape Optimization Using the Surrogate Management Framework","223009704":"An optimization methodology of alkaline-surfactant-polymer flooding processes using field scale numerical simulation and multiple surrogates. J Pet Sci Eng","224839810":"An Introduction to the Boot-Strap","216300044":"Approximation and Model Management in Aerodynamic Optimization With Variable-Fidelity Models","225792670":"The Mathematics of Learning: Dealing with Data *","240092833":"Linear and Non-linear Programming","222544049":"Response Surface Approximation of Pareto Optimal Front in Multi-objective Optimization","4681393":"CFD-Based Design Optimization for Single Element Rocket Injector","223711907":"Bootstrapping R 2 and adjusted R 2 in regression analysis. Econ Model","245435225":"Shape Optimization of Supersonic Turbines Using Global Approximation Methods","222244032":"Sensitivity analysis of model output. Performance of the iterated fractional factorial design method"},"citedIn":{"273292362":"Strategic Planning for Drought Mitigation under Climate Change","258569064":"Model Reduction of Computational Aerothermodynamics for Hypersonic Aerothermoelasticity","261246867":"Multi-objective design optimization of planar Yagi antenna using surrogate models","273957973":"Rigorous design of distillation columns using surrogate models based on Kriging interpolation","258807656":"Accelerated parameter identification in a 3D marine biogeochemical model using surrogate-based optimization","262937508":"Worst Multiple Perturbation Load Approach of stiffened shells with and without cutouts for improved knockdown factors","285764865":"Computationally Efficient Multi-Fidelity Multi-Grid Design Optimization of Microwave Structures","251551474":"Subjectivity and objectivity in design decisions","268558350":"Comparison of Energy- and Exergy-Based Analyses and Advanced Visualization of a Steadily-Operating Refrigeration System","242549351":"Derivative Free Surrogate Optimization for Mixed-Integer Nonlinear Black Box Problems in Engineering","51461891":"Dynamics of Pseudomonas aeruginosa association with anionic hydrogel surfaces in the presence of aqueous divalent-cation salts","271480892":"Fast multi-objective antenna design through variable-fidelity EM simulations","228784561":"Making the Most Out of Surrogate Models: Tricks of the Trade","224372044":"Development of Wireless MEMS Inclination Sensor System for Swing Monitoring of Large-Scale Hook Structures","279230640":"Social Welfare Maximization of Multimodal Transportation: Theory, Metamodel, and Application to Tianjin Ecocity, China","224401782":"Fast Space Mapping with Variable Weight Coefficients for Microwave Device Modeling","271409204":"Initial sampling methods in metamodel-assisted optimization","260801425":"Aircraft noise prediction","228563332":"Global sensitivity analysis of Alkali-Surfactant-Polymer enhanced oil recovery processes","225023346":"A framework for surrogate-based aerodynamic optimization","265788361":"Bootstrap techniques for sensitivity analysis and model selection in building thermal performance analysis","225386830":"A nonlinear interval-based optimization method with local-densifying approximation technique","275378253":"Model Selection Among Physics-Based Models","265162730":"Optimization of the Aerodynamic and Aeroacoustic Performance of an Axial-Flow Fan","222297363":"Parametric free-form shape design with PDE models and reduced basis method. Comput Meth Appl Mech Eng 199(23-24):1583-1592","269389856":"Multiscale structural topology optimization with an approimate constitutive model for local material microstructure","267502558":"Multi-Objective Optimization of Film-Cooling Holes Considering Heat Transfer and Aerodynamic Loss","223886711":"Surrogate model for proton exchange membrane fuel cell (PEMFC)","258835293":"Aerodynamic Optimization of a Transonic Axial Compressor with a Casing Groove Combined with Tip Injection","258326356":"Spatial Nyquist Fidelity Method for Structural Models of Opto-Mechanical Systems","251947829":"Multi-fidelity optimization of microwave structures using low-order local Cauchy-Approximation surrogates","251947830":"Improved microwave circuit design using multipoint-response-correction space mapping and trust Regions","260197296":"A surrogate-based particle swarm optimization algorithm for solving optimization problems with expensive black box functions","261044156":"A Parallel and Distributed Surrogate Model Implementation for Computational Steering","267578311":"Design Optimization of Micro-Channel for Micro Electronic Cooling","222654832":"Improving the Hydrodynamic Performance of Diffuser Vanes via Shape Optimization","258806616":"Multi-Objective Optimization of a Row of Film Cooling Holes Using an Evolutionary Algorithm and Surrogate Modeling","225435993":"Evaluation of surrogate models for optimization of herringbone groove micromixer","251876154":"Lightweight design of vehicle parameters under crashworthiness using conservative surrogates","263665549":"An evaluation of adaptive surrogate modeling based optimization with two benchmark problems","252068668":"Evaluation of a patient-specific cost function to predict theinfluenceoffootpathonthekneeadductiontorqueduringgait","268458043":"Quantifying Regional Error in Surrogates by Modeling its Relationship with Sample Density","269330486":"Multi-objective design of UWB antennas using surrogate-based optimization","257335145":"Performance of an ensemble of ordinary, universal, non-stationary and limit Kriging predictors","283011230":"Application of Multiple-Surrogate Model to Optimization of a Dimpled Channel","251876162":"Using Cross Validation to Design Conservative Surrogates","258569000":"Surrogate-Based Optimum Design for Stiffened Shells with Adaptive Sampling","280914175":"Surrogate-assisted design optimization of photonic directional couplers","229897716":"Enhanced multi‐objective optimization of a dimpled channel through evolutionary algorithms and multiple surrogate methods","226943438":"Global Optimization with Expensive Functions - Sample Turbomachinery Design Application","256919327":"A dedicated multiparametric strategy for the fast construction of a cokriging metamodel","255661935":"Multi-Objective Design Exploration for Aerodynamic Configurations","257392388":"A computational intelligence algorithm for expensive engineering optimization problems","245385971":"Building Smaller Sized Surrogate Models of Complex Bipartite Networks Based on Degree Distributions","258739007":"Reduced-Order Dynamic Stall Modeling with Swept Flow Effects Using a Surrogate-Based Recurrence Framework","269785167":"Surrogate-Based Optimization of Electrothermal Wing Anti-Icing Systems","230547942":"Antenna modeling using space-mapping corrected Cauchy-approximation surrogates","276104238":"Rapid design of microstrip antenna arrays by means of surrogate-based optimisation","224563518":"Efficient Optimization of Microwave Circuits Using Shape-Preserving Response Prediction","263609322":"Condition-Based Maintenance via Simulation and a Targeted Bayesian Network Metamodel","263665621":"Inverse airfoil design using variable-resolution models and shape-preserving response prediction","254230340":"A novel algorithm of maximin Latin hypercube design using successive local enumeration","51484533":"Correction: Statistical Metamodeling for Revealing Synergistic Antimicrobial Interactions","264025051":"Optimization of Rotor Blade Stacking Line Using Three Different Surrogate Models","228917709":"Surrogate based sensitivity analysis of process equipment","277587170":"Procedia Computer Science","263666650":"Variable-fidelity model selection for stochastic simulation","286544250":"Wing aerodynamic shape optimization by space mapping","261108707":"Shape-preserving response prediction with adjoint sensitivities for microwave design optimization","260124658":"Surrogate-Based Optimization of Expensive-to-Evaluate Objective for Optimal Highway Toll Charges in Transportation Network","222182730":"Combining metamodelling and stochastic dynamic programming for the design of reservoir release policies","224236840":"Role of constraints in surrogate-based design optimisation of microwave structures","228526569":"An algorithm for fast optimal Latin hypercube design of experiments","261193703":"Robust space mapping optimization exploiting EM-based models with adjoint sensitivities","258568990":"Convergence Error and Higher-Order Sensitivity Estimations","228420071":"Turbulence Modeling for Isothermal and Cryogenic Cavitation","258841361":"Multicast performance bounds exploiting cooperative Physical Layer Network Coding","44219103":"Improved Methodologies for Maneuver Design of Aircraft Stability and Control Simulations","283045024":"Optimization of Microchannel Heat Sink Using Neural Network","260836339":"Derivative-free optimization for expensive constrained problems using a novel expected improvement objective function","263471925":"Expected improvement in efficient experimental design supported by a global optimizer","276971520":"Optimization of ejection angles of double-jet film-cooling holes using RBNN model","223896026":"Proton exchange membrane fuel cell modelling based on a mixed moving least squares technique","268458116":"New Hybrid Optimization for Design of Active Twist Rotors","245357080":"Hydraulic Turbine Diffuser Shape Optimization by Multiple Surrogate Model Approximations of Pareto Fronts","251848587":"Surrogate Modeling for Characterizing the Performance of Dielectric Barrier Discharge Plasma Actuator","227625243":"Modeling of microwave devices with space mapping and radial basis functions","241715938":"Adaptive surrogate-based design optimization with expected improvement used as infill criterion","257505237":"Surrogate-based modeling and dimension reduction techniques for multi-scale mechanics problems","268562573":"Surrogate-Based Shape Optimization of Low-Speed Wind Tunnel Contractions","253518738":"APPROXIMATE INVERSE AND IMPLICIT FUNCTIONS USING AN M/NSET VARIATION","288972200":"Design Space Reduction for Expedited Multi-Objective Design Optimization of Antennas in Highly Dimensional Spaces","250587772":"Zur Zuordnung des1H- und des13C-NMR-Spektrums des N-Methylchinolinium-ions","277287956":"CONTENTS CONTENTS Contents","226460139":"Modeling of turbulent, isothermal and cryogenic cavitation under attached conditions","224124359":"Implicit space mapping with adaptive selection of preassigned parameters","236630663":"Increased Convergence Rates in Multi-agent Transport Simulations with Pseudo-simulation","267496272":"Shape Optimization of Turbomachinery Blade Using Multiple Surrogate Models","275379405":"Optimization of a Hybrid Double-Side Jet Impingement Cooling System for High-Power Light Emitting Diodes","227252526":"Variable-Fidelity Aerodynamic Shape Optimization","51154858":"Impacts of a fuel oil spill on seagrass meadows in a subtropical port, Gladstone, Australia – The value of long-term marine habitat monitoring in high risk areas","258569167":"Alternative Cokriging Model for Variable-Fidelity Surrogate Modeling","271480969":"EM-driven tuning of substrate integrated waveguide filters exploiting feature-space surrogates","257778677":"Development of a numerical optimization approach to ventilation system design to control airborne contaminant dispersion and occupant comfort","264561516":"A modified PANS model for computations of unsteady turbulence cavitating flows","262903553":"Reduced‐cost design optimization of antenna structures using adjoint sensitivity","228637963":"Innovative Fusion of Experiment and Analysis for Missile Design and Flight Simulation","268478638":"A Novel Surrogate Modeling Technique for Parametric Uncertainty Quantification in Simulation-Based Design","43292197":"Optimisation globale de systèmes mécaniques","3665030":"Robust controller design method and application to underwatervehicle autopilot","254230419":"Robust optimization of front members in a full frontal car impact","257777640":"Surrogate-Based Optimization of Expensive Flowsheet Modeling for Continuous Pharmaceutical Manufacturing","277675061":"Multifidelity Multidisciplinary Whole-Engine Thermomechanical Design Optimization","267659087":"Structural optimization. With CD-Rom","221534600":"Toward an Optimal Ensemble of Kernel-based Approximations with Engineering Applications","277899311":"A kind of balance between exploitation and exploration on kriging for global optimization of expensive functions","285548993":"A novel implementation of computational aerodynamic shape optimisation using Modified Cuckoo Search","257335187":"Determination of realistic worst imperfection for cylindrical shells using surrogate model","273641610":"Multi-fidelity information fusion based on prediction of kriging","3479795":"Considerations of accuracy and uncertainty with kriging surrogate models in single-objective electromagnetic design optimisation","224251285":"Simulation-driven design of dielectric resonator antenna with reduced board noise emission","263490428":"Decomposition, Response Surface Approximations, and Space Mapping for EM‐Driven Design of Microwave Filters","256484227":"Sirocco Fan Design for Residential Ventilation Through Multi-Objective Optimization to Enhance Aerodynamic Performance","272591090":"Reliability-based design optimization for vehicle occupant protection system based on ensemble of metamodels","267489056":"Turning Black-Box Into White Functions","253519822":"The impact of uncertainty on shape optimization of idealized bypass graft models in unsteady flow","261531456":"Reliable em-driven microwave design optimization using manifold mapping and adjoint sensitivity","266475323":"Evolutionary algorithms and other metaheuristics in water resources: Current status, research challenges and future directions","220677626":"Multiobjective global surrogate modeling, dealing with the 5-percent problem","267490066":"Sampling-Based RBDO Using Probabilistic Sensitivity Analysis and Virtual Support Vector Machine","264695589":"Design of broadband transitions for substrate integrated circuits","289988011":"Probability of corrosion failure analysis using an adaptive sampling approach","254230467":"Fast dynamic performance optimization of complicated beam-type structures based on two new reduced physical models","258569100":"Physical Insight into Scramjet Inlet Behavior via Multi-Objective Design Optimization","273911990":"An Iterative Modeling and Trust-Region Optimization Method for Batch Processes","222559653":"Uncertainty analysis for rolling contact fatigue failure probability of silicon nitride ball bearings","242261655":"Space Mapping for Engineering Optimization1","226080146":"Space Mapping Optimization and Modeling of Microwave Devices with MEFiSTo","277007465":"Reduced order models for rapid EOR simulation in fractured carbonate reservoirs","261102463":"Sobol′ sensitivity analysis of NAPL-contaminated aquifer remediation process based on multiple surrogates","273501373":"Compression of Fluid-Filled Polymeric Capsules and Inverse Analysis to Determine Nonlinear Viscoelastic Properties","225581440":"A shape optimization study for tool design in resistance welding","261547875":"A Surrogate-Based Multi-Scale Model for Mass Transport and Electrochemical Kinetics in Lithium-Ion Battery Electrodes","265000765":"An Optimization Method for an Aircraft Rear-end Conceptual Design Based on Surrogate Models","282184742":"An Integrated Performance Measure Approach for System Reliability Analysis","289250756":"Efficient methodologies for reliability-based design optimization of composite panels","275241118":"Adaptive Kriging surrogate model for the optimization design of a dense non-aqueous phase liquid-contaminated groundwater remediation process","225711496":"Comparing error estimation measures for polynomial and kriging approximation of noise-free functions","262077283":"Emulating facial biomechanics using multivariate partial least squares surrogate models","242402956":"CFD Driven Optimization of Hydraulic Turbine Draft Tubes using Surrogate Models","275026075":"Hybrid Framework for Reliability-Based Design Optimization of Imperfect Stiffened Shells","258569110":"Hierarchical Kriging Model for Variable-Fidelity Surrogate Modeling","242330481":"An Adaptive Hybrid Surrogate Model","261480085":"Low-cost design optimization of antennas using adjoint sensitivity","261480084":"Robust design of UWB antennas using response surface approximations and manifold mapping","270159128":"Environmental Software Systems Volume 8, Second Edition","242330483":"Adaptive Hybrid Surrogate Modeling for Complex Systems","3427632":"Combining Coarse and Fine Models for Optimal Design","242330485":"Improving the Accuracy of Surrogate Models Using Inverse Transform Sampling","221135915":"An Execution Model for Committed-Choice Non-Deterministic Languages.","242330484":"Comparison of Surrogate Models Used for Adaptive Optimal Control of Active Thermoelectric Windows","257430110":"Generation of a cokriging metamodel using a multiparametric strategy","230649017":"An Efficient Response Surface Based Optimisation Method for Non-Deterministic Harmonic and Transient Dynamic Analysis","278717850":"Marine Ecosystem Model Calibration through Enhanced Surrogate-Based Optimization","261038729":"Low-cost design of SIW cavity antennas using surrogate-based optimization","260246149":"Automated metamodel generation for Design Space Exploration and decision-making–A novel method supporting performance-oriented building design and retrofitting","243970950":"Efficient Simulation-Driven Design Optimization of Antennas Using Co-Kriging","254230058":"Fast simulation-driven design of microwave structures using improved variable-fidelity optimization technique","230381738":"Computationally efficient design optimization of wideband planar antennas using Cauchy approximation and space mapping","260288155":"A Surrogate Based Approach to Reduced-Order Dynamic Stall Modeling","267490025":"Reliability Based Design Optimization Considering Future Redesign With Different Epistemic Uncertainty Treatments","252053023":"Design of dielectric resonator antennas using surrogate optimization","242330475":"Surrogate Modeling of Complex Systems Using Adaptive Hybrid Functions","242330474":"A New Robust Surrogate Model: Reliability Based Hybrid Functions","242330478":"Domain Segmentation based on Uncertainty in The Surrogate (DSUS)","4375906":"Automatic Model Type Selection with Heterogeneous Evolution: An application to RF circuit block modeling","280102289":"Optimization of Curvilinearly Stiffened Panels with Single Cutout Concerning the Collapse Load","226923694":"Survey of modeling and optimization strategies to solve high-dimensional design problems with computationally-expensive black-box functions","259167834":"Marine ecosystem model calibration with real data using enhanced surrogate-based optimization","270944527":"WITHDRAWN: Variable Fidelity Optimization with Design Space Reduction","279070091":"A double-loop adaptive sampling approach for sensitivity-free dynamic reliability analysis","237522691":"Multi-objective design of water quality rehabilitation interventions by response surfaces","240185213":"2011 04 Elsevier AMM Surrogate based sensitivity analysis of process equipment","268469550":"Surrogate-based Aerodynamic Shape Optimization with Application to Wind Turbine Airfoils","222814327":"Recent advances in surrogate-based optimization","224373869":"Space Mapping With Adaptive Response Correction for Microwave Design Optimization","252036656":"Improved variable-fidelity optimization algorithm for simulation-driven design of antennas","254063123":"Demystifying Surrogate Modeling for Circuits and Systems","267559626":"Rapid antenna design optimization using shape-preserving response prediction","263269002":"An analysis of the impact of the initial sample on evolutionary metamodel-assisted optimization","224219235":"Space-mapping modelling of microwave devices using multi-fidelity electromagnetic simulations","248809365":"A multiobjective response surface approach for improved water quality planning in lakes and reservoirs","228880614":"Adaptively Adjusted Design Specifications for Efficient Optimization of Microwave Structures","255603327":"A Surrogate Model Approach in 2-D Versus 3-D Flapping Wing Aerodynamic Analysis","283045275":"Optimization of Film-Cooling Holes Using Surrogate Modeling","261308117":"A study on fitness inheritance for enhanced efficiency in real-coded genetic algorithms","224133147":"Coarse models for efficient space mapping optimisation of microwave structures","224172059":"Efficient design optimization of UWB antennas using Cauchy approximation and space mapping","254230112":"Non-Stationary Kriging For Design Optimization","270597479":"Efficient adaptive response surface method using intelligent space exploration strategy","280319485":"CIGRECanada2013","3131750":"Heat Conduction in Microwave Devices With Orthotropic and Temperature-Dependent Thermal Conductivity","290481180":"Multiscale modeling of lithium-ion battery electrodes based on nano-scale X-ray computed tomography","220249197":"Mixture surrogate models based on Dempster-Shafer theory for global optimization problems","272591218":"Accurate predictions from noisy data: replication versus exploration with applications to structural failure","257549832":"A general framework for Dynamic Emulation Modelling in environmental problems","223897612":"Analysis and optimization of a micromixer with a modified Tesla structure","263893740":"Efficient reduced-order modeling of unsteady aerodynamics robust to flight parameter variations","220308603":"Simulation-Driven Design of Antennas Using Coarse-Discretization Electromagnetic Models","259994149":"Identification of material parameters for low bond strength masonry","263380713":"A hybrid variable-fidelity global approximation modelling method combining tuned radial basis function base and kriging correction","268298912":"Simulation-Based Design of Multi-Modal Systems","282553738":"Robust optimization of subsurface flow using polynomial chaos and response surface surrogates","259139116":"The use of partially converged simulations in building surrogate models","273898764":"A survey on handling computationally expensive multiobjective optimization problems using surrogates: non-nature inspired methods","224183356":"Shape-Preserving Response Prediction for Microwave Design Optimization","30861493":"Active/Passive Optimization of Helicopter Rotor Blades for Improved Vibration, Noise, and Performance Characteristics.","252036710":"Computationally efficient simulation-driven antenna design using coarse-discretization electromagnetic models","229333192":"Computational design and optimization of fuel cells and fuel cell systems: A review","260501221":"Reliable Space-Mapping Optimization Integrated With EM-Based Adjoint Sensitivities","224172088":"Efficient optimization of microwave structures through design specifications adaptation","285782114":"Identification of material properties using nanoindentation and surrogate modeling","260954854":"Development of a Multilevel Multidisciplinary-Optimization Capability for an Industrial Environment","251967081":"A reliable algorithm of rock detection and avoidance for safe spacecraft landing","278648310":"Effect of error metrics on optimum weight factor selection for ensemble of metamodels","262358733":"Application of neural networks in space-mapping optimization of microwave filters","268563823":"Power and design optimization of electro-thermal anti-icing systems via FENSAP-ICE","281859491":"Efficient Global Optimization method for a multipoint airfoil Design","267502211":"Numerical Investigation on the Labyrinth Seal Design for a Low Flow Coefficient Centrifugal Compressor","252026482":"Low-cost modeling of microwave structures using shape-preserving response prediction","279805402":"Enhancing the Structural Performance of Additively Manufactured Objects Through Build Orientation Optimization","224916508":"Evolution by Adapting Surrogates","263507657":"Using self-adaptive optimisation methods to perform sequential optimisation for low-energy building design","228722909":"Multi-objective Design Exploration Using Efficient Global Optimization","258738707":"Surrogate-Based Aerodynamic Shape Optimization by Variable-Resolution Models","235961233":"Multiparametric analysis within the proper generalized decomposition framework","268059256":"Performance Estimate and Simultaneous Application of Multiple Surrogates","235961234":"A rational strategy for the resolution of parametrized problems in the PGD framework","271963575":"Application of Multi Objective Optimization Techniques to Improve the Aerodynamic Performance of a Tunnel Ventilation Jet Fan","272568765":"Optimal Shape Design of Multi-Element Trawl-Doors Using Local Surrogate Models","268458374":"Dynamic Design Space Partitioning for Optimization of an Integrated Thermal Protection System","51750546":"Cyclosporine A suppresses immunoglobulin G biosynthesis via inhibition of cyclophilin B in murine hybridomas and B cells","51014274":"Optimisation multi-objectifs à base de métamodèle pour les procédés de mise en Forme","233303150":"The development of a hybridized particle swarm for kriging hyperparameter tuning","229091373":"Multi-Objective Optimization of a Centrifugal Compressor Impeller through Evolutionary Algorithms","275536352":"Surrogate-based Sensitivity Analysis for Safety Assessment of General Aviation Heavy-fueled Engines","259584756":"Effect of cycling rate, particle size and transport properties on lithium-ion cathode performance","264052273":"Minimizing Part Warpage in Injection Molding by Optimizing Wall Thickness Distribution","275890684":"Statistical Surrogate Formulations for Simulation-Based Design Optimization","263123488":"An algorithm for computationally expensive engineering optimization problems","277027085":"Determination of the Polymer-Solvent Interaction Parameter for PEG Hydrogels in Water: Application of a Self Learning Algorithm","220308656":"Multi-Fidelity Design Optimization of Transonic Airfoils Using Shape-Preserving Response Prediction","229091381":"Performance Enhancement of Axial Fan Blade through Multi-Objective Optimization Techniques","230765657":"High-Order Integration of Fatigue Crack Growth Using Surrogate Model","230765659":"Doubly weighted moving least squares and its application to structural reliability analysis","283747699":"A lagrangian propagator for artificial neural networks in constraint programming","267454058":"Sensitivity Analysis for Computationally Expensive Models using Optimization and Objective-oriented Surrogate Approximations","260635176":"Derivative-free microwave design optimisation using shape-preserving response prediction and space mapping","270345661":"Thermal Performance Analysis and Optimization of Microjet Cooling of High-Power Light-Emitting Diodes","224249087":"Constrained parameter extraction for microwave design optimisation using implicit space mapping","224328957":"Wideband extinction measurements for thin and planar samples","260526628":"Fast EM Modeling Exploiting Shape-Preserving Response Prediction and Space Mapping","230275089":"Rapid Design Optimization of Antennas Using Space Mapping and Response Surface Approximation Models","224083186":"Application of surrogate modeling to generate compact and PVT-sensitive IBIS models","263172614":"Computational Optimization and Applications in Engineering and Industry","277709095":"Shape Optimization of Trawl-doors Using Variable-fidelity Models and Space Mapping","234829906":"Review: Non-probabilistic finite element analysis for parametric uncertainty treatment in applied mechanics: Recent advances","269330848":"Desing optimization of omnidirectional antennas using the AADS technique and kriging","258177741":"Surrogate model for aerodynamic shape optimization of a tractor-trailer in crosswinds","277191978":"Variable-Fidelity Design Optimization of Microwave Devices Using Multi-Dimensional Cauchy Approximation and Coarsely Discretized Electromagnetic Models","238366618":"A Geostatistical Perspective for the Surrogate-Based Integration of Variable Fidelity Models","263246367":"A framework combining meshfree analysis and adaptive kriging for optimization of stiffened panels","281197933":"Feasibility and flexibility analysis of black-box processes Part 1: Surrogate-based feasibility analysis","254456475":"Comparison of surrogate models for turbomachinery design","241706969":"Worst-case global optimization of black-box functions through Kriging and relaxation","271458716":"Impact of weather dependency on planning decisions in the Australian national electricity market","243970872":"Pareto-Based Multi-output Metamodeling with Active Learning","275771869":"The effect of the percentage of steered plies on the bending-induced buckling performance of a variable stiffness composite cylinder","229040149":"Efficient RDO using sample recycling","282482021":"Rapid design and size reduction of microwave couplers using variable‐fidelity EM‐driven optimization","257720041":"Physics-Based Surrogates for Low-Cost Modeling of Microwave Structures","226876467":"Assessing the value of another cycle in Gaussian process surrogate-based optimization","257720042":"Shape-Preserving Response Prediction for Engineering Design Optimization","243970877":"Surrogate modeling of microwave structures using kriging, co-kriging, and space mapping","257720043":"Multi-Level CFD-Based Airfoil Shape Optimization With Automated Low-Fidelity Model Selection","281965942":"Application of Surrogate-based Optimization Techniques to Aerodynamic Design Cases","258474705":"Surrogate Modeling of High-Fidelity Fracture Simulations for Real-Time Residual-Strength Predictions","283196760":"Feature-based surrogates for low-cost microwave modelling and optimisation","273182194":"Fast Multiobjective Optimization of Narrowband Antennas Using RSA Models and Design Space Reduction","257720039":"Computational Optimization, Modelling and Simulation: Recent Trends and Challenges","263358990":"An Efficient Heuristic Algorithm of Surrogate-Based Optimization for Global Optimal Design Problems","3885563":"Evaluation of rehabilitation effect with a three-dimensional angle sensor","230283378":"Reliable Design Optimization of Microwave Structures Using Multipoint-Response-Correction Space Mapping and Trust Regions","263257723":"Hexagonal honeycomb cell optimisation by way of meta-model techniques","241456040":"Low-Reynolds-Number Aerodynamics of a Flapping Rigid Flat Plate","261093954":"Space mapping and beyond: Knowledge-driven microwave design optimization","261093953":"CPU-budget-driven automated microwave design optimization using variable-fidelity electromagnetic simulations","225542306":"Simulation-Driven Design in Microwave Engineering: Methods","271302143":"A Method for the Identification of Mechanical Properties Using Surrogate Models","257511052":"Surrogate-based parameter optimization and optimal control for optimal trajectory of Halo orbit rendezvous","228787323":"Disciplinary interaction variable elimination (DIVE) approach for mdo","262903411":"Embroidered wearable antenna for ultrawideband applications","228662397":"Recent Progress in Flapping Wing Aerodynamics and Aeroelasticity","227549296":"The State of the Art of Microwave CAD: EM-Based Optimization and Modeling","225025160":"Surrogate-enhanced simulation of aircraft in trimmed state","220308677":"Inverse Design of Transonic Airfoils Using Variable-Resolution Modeling and Pressure Distribution Alignment","224607364":"Surrogate-based optimization of microwave structures using space mapping and kriging","47806257":"Surrogate models based on function and derivative values for aerodynamic global optimization","262367823":"Improved Particle Swarm Optimization Method in Inverse Design Problems","268049943":"Application of a Weighted Average Surrogate Approach to Helicopter Rotor Blade Vibration Reduction","224151730":"Robust Trust-Region Space-Mapping Algorithms for Microwave Design Optimization","273192376":"Effectiveness of meta-models for multi-objective optimization of centrifugal impeller","281278770":"Multi-objective hydraulic optimization and analysis in a minipump","228637778":"Surrogate Model-Based Strategy for Cryogenic Cavitation Model Validation and Sensitivity Evaluation","228798545":"Multi-Objective Design Exploration and its Applications","242330501":"Surrogate-based Design Optimization with Adaptive Sequential Sampling","254015195":"Antenna design through variable-fidelity simulation-driven optimization","265058871":"Two-stage size-layout optimization of axially compressed stiffened panels","273490358":"Research on optimization of the suction parameters of an automotive wind tunnel","220249308":"Optimization of aircraft structural components by using nature-inspired algorithms and multi-fidelity approximations","257511077":"Computational approximation of nonlinear unsteady aerodynamics using an aerodynamic model hierarchy","261507688":"A Method for Assessing the Environmental Benefit of Future Aviation Technologies","254015196":"Rapid optimization of dielectric resonator antennas using surrogate models","225852278":"Combustion engine optimization: a multiobjective approach","266761703":"An efficient optimization of well placement and control for a geothermal prospect under geological uncertainty","259176819":"Error Metrics and the Sequential Refinement of Kriging Metamodels","237998124":"Ensemble of surrogates with recursive arithmetic average","227533706":"Efficient non-linear model reduction via a least-squares Petrov-Galerkin projection and compressive tensor approximations. Int J Numer Meth Eng","277590670":"Rapid design of miniaturised branch-line couplers through concurrent cell optimisation and surrogate-assisted fine-tuning","215502558":"Optimization of a Transonic Axial Compressor Considering Interaction of Blade and Casing Treatment to Improve Operating Stability","279235234":"Some considerations regarding the use of multi-fidelity Kriging in the construction of surrogate models","269044238":"Error Measures for Noise-Free Surrogate Approximations","262876588":"Shape Optimization of Inlet Part of a Printed Circuit Heat Exchanger Using Surrogate Modeling","269567513":"Efficient Multipoint Aerodynamic Design Optimization Via Cokriging","272477751":"MULTIDISCIPLINARY DESIGN OPTIMIZATION OF TRANSONIC AIRFOIL SECTIONS USING MULTIOBJECTIVE OPTIMIZATION AND COMPUTATIONAL INTELLIGENCE TOOLS","253347090":"Aeroelastic and Aerothermoelastic Analysis in Hypersonic Flow: Past, Present, and Future","259176825":"Multiresponse Metamodeling in Simulation-Based Design Applications","257378650":"Performance analysis and design optimization of micro-jet impingement heat sink","229091254":"Axial-Flow Ventilation Fan Design Through Multi-Objective Optimization to Enhance Aerodynamic Performance","245426354":"Can Tip Vortices Enhance Lift of a Flapping Wing?","260641179":"Design optimisation of antennas using electromagnetic simulations and adaptive response correction technique","245439668":"Microchannel Heat Sink with Designed Roughness: Analysis and Optimization","264051112":"Rapid EM-based microwave design optimization exploiting shape-preserving response prediction and adjoint sensitivities","45416610":"Dealing with asynchronicity in parallel Gaussian Process based global optimization","277714586":"Aerodynamic Design with Physics-Based Surrogates","224716669":"Probabilistic Modelling of Demand Diversity and its Relationship with Electricity Market Outcomes","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","229091260":"Analysis and Optimization of a Vaned Diffuser in a Mixed Flow Pump to Improve Hydrodynamic Performance","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","266030584":"Weight Indexing for Wing-Shape Multi-Objective Optimization","258157894":"Automatic design of marine structures by using successive response surface method","260522401":"Metamodel-assisted optimization based on multiple kernel regression for mixed variables","260660640":"Multi-Objective Design of Antennas Using Variable-Fidelity Simulations and Surrogate Models","289373973":"Recent Advances on Topology Optimization of Multiscale Nonlinear Structures","273452640":"A FUZZY FINITE ELEMENT ALGORITHM BASED ON RESPONSE SURFACE METHOD FOR FREE VIBRATION ANALYSIS OF STRUCTURE","228670349":"Product design optimization with microstructure-property modeling and associated uncertainties","268553772":"Multi-Objective Design Optimization of Fuel Injection for Mixing Enhancement in Scramjets by Using Surrogate-Assisted Evolutionary Algorithms","243970213":"Inverse modelling of an aneurysm\u0027s stiffness using surrogate-based optimization and fluid-structure interaction simulations","261461434":"Accurate modeling of wideband antennas using variable-fidelity simulations, kriging and parameterized response correction","276163138":"Micromechanics of Composites Using a Two-Parameter Model and Response Surface Predictions","267578827":"Enhanced Multi-Objective Optimization of a Microchannel Heat Sink Using Multiple Surrogates Modeling","268478011":"Conservative Predictions Using Surrogate Modeling","225371986":"Multi-objective optimization of a dimpled channel for heat transfer augmentation","273869422":"Characterizing Uncertainty Attributable to Surrogate Models","215502488":"Design Optimization of an Axial Fan Blade Through Multi-Objective Evolutionary Algorithm","262974956":"Focused Ultrasonic Therapy Planning: Metamodeling, Optimization, Visualization","251542716":"Computational strategy for multiobjective optimization of composite stiffened panels","236461146":"An efficient framework for optimization and parameter sensitivity analysis in arterial growth and remodeling computations","224991018":"A New Cokriging Method for Variable-Fidelity Surrogate Modeling of Aerodynamic Data","282711708":"Aerodynamic shape optimization of civil structures: A CFD-enabled Kriging-based approach","255483260":"Optimization of LiMn2O4 electrode properties in a gradient-and surrogate-based framework","262921699":"A framework for efficient simulation-based multidisciplinary robust design optimization with application to a keel fin of a racing sailboat","225640250":"Surrogate Model-Based Optimization Framework: A Case Study in Aerospace Design","244478171":"On the generation of flight dynamics aerodynamic tables by computational fluid dynamics","280929015":"A dual-purpose memory approach for dynamic particle swarm","264138229":"Design Optimization of a Fan-Shaped Film-Cooling Hole Using a Radial Basis Neural Network Technique","224213777":"Fast microwave design optimisation using shape-preserving response prediction and coarse-discretisation EM models","226920395":"Ensemble of Metamodels with Optimized Weight Factors","215502486":"High-Performance Design of a Centrifugal Compressor Impeller","225584956":"Compression moulding simulations of SMC using a multiobjective surrogate-based inverse modeling approach","266489265":"The AVINOR Aeroelastic Simulation Code and its Application to Reduced Vibration Composite Rotor Blade Design","269785666":"Using Cross-Validation to Design Trend Function in Kriging Surrogate Modeling","282487424":"Efficient Knowledge-Based Optimization of Expensive Computational Models Using Adaptive Response Correction","273474071":"Surrogate assisted-hybrid differential evolution algorithm using diversity control","239037539":"An adjoint for likelihood maximization","229464049":"Computationally efficient simulation‐driven design of a printed 2.45 GHz Yagi antenna","233294777":"Optimization of a Cylindrical Film Cooling Hole using Surrogate Modeling","4037213":"Radiated immunity testing of a device with an external wire: repeatability of reverberation chamber results and correlation with anechoic chamber results","287292286":"Knowledge-Based Surrogate Modeling in Engineering Design Optimization","278309620":"Handbook of Battery Materials, Second Edition","269785718":"Efficient Global Optimization with Adaptive Target Setting","287292285":"Space Mapping for Electromagnetic-Simulation-Driven Design Optimization","4035161":"RAF: a dynamic and efficient approach to fusion for multitarget tracking in CCTV surveillance","51517812":"Design of Optimal Treatments for Neuromusculoskeletal Disorders using Patient-Specific Multibody Dynamic Models.","280360659":"RBCC-Based Suborbital TSTO Systems: Part 1 - Optimisation and Uncertainty Analysis","30514102":"Optimisation de Forme Multi-Objectif sur Machines Parallèles avec\nMéta-Modèles et Coupleurs. Application aux Chambres de Combustion Aéronautiques.","222112602":"Adaptive Accuracy Trust Region: Using Cross-Validation in the Optimization Process","3131972":"Interpolated Coarse Models for Microwave Design Optimization With Space Mapping","257526066":"Fast solution of direct and inverse design problems concerning furnace operation conditions in steel industry","262404556":"Dynamic substructuring and reanalysis methods in a surrogate-based design optimization environment","245426395":"Cross Validation Can Estimate How Well Prediction Variance Correlates with Error","228326368":"Formation and evolution of the hardening precipitates in a Mg–Y–Nd alloy","245443805":"Evaluation of Surrogate Models in Optimization of Wire-Wrapped Fuel Assembly","233678737":"Helicopter Vibration Reduction throughout the Entire Flight Envelope Using Surrogate-Based Optimization","272702145":"Unified Framework for Training Point Selection and Error Estimation for Surrogate Models","223248335":"Stochastic design optimization: Application to reacting flows","284077674":"Data-driven construction of Convex Region Surrogate models","267500920":"Stacking and Thickness Optimization of a Compressor Blade Using Weighted Average Surrogate Model","269331076":"Design optimization of microstrip antenna arrays using surrogate-based methodology","23804897":"Nested Maximin Latin Hypercube Designs","260007412":"A response surface approach for structural reliability analysis using evidence theory","261486878":"Reconstructing Core Dumps","257634775":"Adaptive optimal design of active thermoelectric windows using surrogate modeling","220430254":"Multi-fidelity design optimization of transonic airfoils using physics-based surrogate modeling and shape-preserving response prediction","241972449":"Real-time characterization of partially observed epidemics using surrogate models","241724645":"Global Optimization Using Mixed Surrogates and Space Elimination in Computationally Intensive Engineering Designs","225624061":"Airfoil Shape Optimization Using Variable-Fidelity Modeling and Shape-Preserving Response Prediction","262895930":"Multipoint Response Correction for Reduced‐Cost EM‐Simulation‐Driven Design of Antenna Structures","269209242":"PREDICTION OF INTERNAL COMBUSTION ENGINES PERFORMANCE RELATED TO FUEL PROPERTIES USING RADIAL BASIS FUNCTIONS","228805424":"Nonlinear programming by mesh adaptive direct searches","236833934":"Surrogate-based optimization of hydraulic fracturing in pre-existing fracture networks","263285026":"Adaptive sequential sampling for surrogate model generation with artificial neural networks","222682065":"A method for stochastic constrained optimization using derivative-free surrogate pattern search and collocation","232823670":"Offshore Polymer Flooding Optimization Using Surrogate-Based Methodology","235255965":"Sampling-Based Stochastic Sensitivity Analysis Using Score Functions for RBDO Problems With Correlated Random Variables","255994331":"Equivalent target probability of failure to convert high-reliability model to low- reliability model for efficiency of sampling- based RBDO","235255966":"A Novel Second-Order Reliability Method (SORM) Using Noncentral or Generalized Chi-Squared Distributions","267647336":"Optimization of a Fan-Shaped Hole for Film Cooling Using a Surrogate Model","232395591":"Recent advances in the aerothermodynamics of spiked hypersonic vehicles","245572668":"Design Optimization of a Cylindrical Film-Cooling Hole Using Neural Network Techniques","264464732":"Reduced-cost microwave component modeling using space mapping-enhanced electromagnetic-based kriging surrogates","243971115":"Cost-efficient EM-simulation-driven antenna design using co-kriging","228350776":"Multifidelity Optimization for Variable-Complexity Design","224472004":"The Pareto-Following Variation Operator as An Alternative Approximation Model","40892617":"LANL* V1.0: A radiation belt drift shell model suitable for real-time and reanalysis applications","221006731":"A Similarity-based Surrogate Model for Expensive Evolutionary Optimization with Fixed Budget of Simulations","220430212":"Surrogate-based optimization of climate model parameters using response correction","263202071":"A comprehensive measure of the energy resource: Wind power potential (WPP)","257196540":"Error estimation properties of Gaussian process models in stochastic simulations","5903091":"Evaluation of a patient-specific cost function to predict the influence of foot path on the knee adduction torque during gait","257588720":"Setting targets for surrogate-based optimization","46267499":"Self-reconfigurable ship fluid-network modeling for simulation-based design","259135964":"Uncertainty in developing supervisory demand-side controls in buildings: A framework and guidance","234867536":"Intercalation-Induced Stress and Heat Generation within Single Lithium-Ion Battery Cathode Particles","262903067":"Multiobjective Optimization of a Counterrotating Type Pump-Turbine Unit Operated at Turbine Mode","221008798":"Kriging/RBF-Hybrid Response Surface Methodology for Highly Nonlinear Functions","257334757":"Constrained efficient global optimization with support vector machines","291418088":"Application of computational fluid dynamics and surrogate-coupled evolutionary computing to enhance centrifugal-pump performance","280065547":"Simulation and Surrogate-Based Design of Rectangular Vortex Generators for Tiltrotor Aircraft Wings","44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","220320738":"Evolutionary Model Type Selection for Global Surrogate Modeling","231645962":"Surrogate-Based Modeling of the Optical Response of Metallic Nanostructures†","267490612":"Design of Nonlinear Dynamic Systems Using Surrogate Models of Derivative Functions","252051907":"Fast design of UWB antennas using electromagnetic models","277902934":"Multi-Objective Design Optimization of Planar Yagi-Uda Antenna Using Physics-Based Surrogates and Rotational Design Space Reduction","263005546":"Metamodeling in Multidisciplinary Design Optimization: How Far Have We Really Come?","286651346":"EM-driven multi-objective optimization of antenna structures in multi-dimensional design spaces","258442670":"Assessing the Value of Another Cycle in Surrogate-Based Optimization","260764992":"Un enfoque práctico para la optimización de procesos de inyección de ASP usando modelos de superficie de respuesta cuadrática y diseño de experimentos","282936854":"Ensemble of surrogates-based optimization for identifying an optimal surfactant-enhanced aquifer remediation strategy at heterogeneous DNAPL-contaminated sites","267500862":"Optimization of a Channel Roughened by Dimples on Opposite Surfaces for Heat Transfer Enhancement","234467126":"CFD-based surrogate modeling of liquid rocket engine components via design space refinement and sensitivity assessment","274406025":"Dynamic stall control optimization of rotor airfoil via variable droop leading-edge","245426291":"Multiple-Surrogate Approach to Helicopter Rotor Blade Vibration Reduction","223754117":"Optimization of a microchannel heat sink with temperature dependent fluid properties","268483283":"Transonic Airfoil Shape Optimization Using Variable-Resolution Models and Pressure Distribution Alignment","239350929":"Shape optimization of a fan-shaped hole to enhance film-cooling effectiveness","257719690":"Object-Oriented Discrete Event Simulation Modeling Environment for Aerospace Vehicle Maintenance and Logistics Process","277902919":"Fast Optimization of Integrated Photonic Components Using Response Correction and Local Approximation Surrogates","282921477":"Decomposition and Space Mapping for Reduced-Cost Modeling of Waveguide Filters","48927792":"Modeling of Turbulent Cavitating Flows.","265174292":"Bayesian quantification of thermodynamic uncertainties in dense gas flows","228987771":"Improving Tree-Based Trajectories Through Order Reduction/Expansion and Surrogate Models","290510734":"Wettability, hysteresis and fracture–matrix interaction during CO2 EOR and storage in fractured carbonate reservoirs","3132144":"A Space-Mapping Approach to Microwave Device Modeling Exploiting Fuzzy Systems","46488613":"Building a metamodel of an irrigation district distributed-parameter model","224197564":"Multiobjective Optimization of a Grooved Micro-Channel Heat Sink","259122583":"Crashworthiness optimization design for foam-filled multi-cell thin-walled structures","30861105":"Pitfalls of using a single criterion for selecting experimental designs","221035467":"Hybrid powertrain control using optimization and cycle based predictive control algorithms","233205518":"Experimental and finite element robustness studies of a bumper system subjected to an offset impact loading","266996992":"Time domain methods in electrodynamics. A tribute to Wolfgang J. R. Hoefer. Proceedings of the symposium on time domain methods in modern engineering electrodynamics, München, Germany, May 16–17, 2007","4111060":"Microwave emission of foam with Kelvin\u0027s structure based on fast solutions of wave equations","229643098":"Modeling and optimization of microwave structures using quick space mapping with variable weight coefficients","265047334":"Metamaterial Design by Mesh Adaptive Direct Search","241112243":"Aerodynamic design prediction using surrogate-based modeling in genetic algorithm architecture","282651191":"Hybrid Framework for Reliability-Based Design Optimization of Imperfect Stiffened Shells","257705395":"An Optimization Algorithm Employing Multiple Metamodels and Optimizers","283331095":"An Adaptive Bayesian Sequential Sampling Approach for Global Metamodeling","258886043":"Proper Orthogonal Decomposition, surrogate modelling and evolutionary optimization in aerodynamic design","269785826":"Optimization of Flexible Flapping-Wing Kinematics in Hover","262114661":"Multilevel Microwave Design Optimization with Automated Model Fidelity Adjustment","281675312":"Surrogate model-based optimization for the headform design of an axisymmetric body","224158303":"Robust multi-fidelity simulation-driven design optimization of microwave structures","264819917":"On the use of multiple surrogates within a differential evolution procedure for high-lift airfoil design","227062413":"Knowledge-Based Variable-Fidelity Optimization of Expensive Objective Functions through Space Mapping","224154202":"Rapid surrogate-based optimization of UWB planar antennas","254883897":"Optimizing the dynamic behavior of structures using substructuring and surrogate modeling","225161826":"A similarity-based surrogate model for enhanced performance in genetic algorithms","237148463":"Efficient surrogate construction by combining response surface methodology and reduced order modeling","274739063":"Fast EM-Driven Size Reduction of Antenna Structures By Means of Adjoint Sensitivities and Trust Regions","235944200":"Multiple Surrogate Modeling for Axial Compressor Blade Shape Optimization","250205680":"Towards an Adaptive and Flexible Metamodeling Toolbox","276077392":"Stepwise sensitivity analysis from qualitative to quantitative: Application to the terrestrial hydrological modeling of a Conjunctive Surface-Subsurface Process (CSSP) land surface model","235944245":"Application of Surrogate Modeling to Design of a Compressor Blade to Optimize Stacking and Thickness","3811103":"Modeling and Control of a Titania Aerosol Reactor","223314536":"Modelling the characteristics of turbocompressors for fuel cell systems using hybrid method based on moving least squares","254353409":"A New Approach for the Development of Fast-analysis Proxies for Petroleum Reservoir Simulation","257405053":"DS-DPSO: A dual surrogate approach for intelligent watermarking of bi-tonal document image streams","224561736":"Distributed fine model evaluation for rapid space-mapping optimisation of microwave structures","5334906":"Improved assay-dependent searching of nucleic acid sequence databases","235944251":"Shape Optimization of a Dimpled Channel to Enhance Heat Transfer Using a Weighted Average Surrogate Model","277355429":"Predictive quantification of surrogate model fidelity based on modal variations with sample density","225423936":"MDO: Assessment and direction for advancement-an opinion of one international group","241565014":"Reduced-Order Nonlinear Unsteady Aerodynamic Modeling Using a Surrogate-Based Recurrence Framework","269228856":"Optimization when Cost of Optimization is Comparable to the Objective Function","258792538":"Variable-Fidelity Electromagnetic Simulations and Co-Kriging for Accurate Modeling of Antennas","261247140":"Multi-point response correction for cost-efficient antenna and microwave design optimization","262914204":"Hybridization of Multi-Objective Evolutionary Algorithms and Artificial Neural Networks for Optimizing the Performance of Electrical Drives","229380763":"Aerodynamic optimization for low pressure turbine exhaust hood using Kriging surrogate model","225984066":"Surrogate Based Optimization of Helicopter Rotor Blades for Vibration Reduction in Forward Flight","267760846":"Multi-objective design optimization of variable stiffness composite cylinders","284077011":"The optimization of fin-tube heat exchanger with longitudinal vortex generators using response surface approximation and genetic algorithm","269698896":"An efficient variable screening method for effective surrogate models for reliability-based design optimization","291101210":"Numerically Efficient Approach to Simulation-Driven Design of Planar Microstrip Antenna Arrays By Means of Surrogate-Based Optimization","262914287":"An Effective Ensemble-Based Method for Creating On-the-Fly Surrogate Fitness Functions for Multi-Objective Evolutionary Algorithms","241105179":"Double-stage Metamodel and Its Application in Aerodynamic Design Optimization","266577062":"Aerodynamic optimization of vehicles using computational fluid dynamics and response surface methodology","224343577":"Blind deconvolution technique for de-noising of Non-stationary seismic signals using DWT","258540590":"Uncertainty Quantification of a Flapping Airfoil with Stochastic Velocity Deviations Using the Response Surface Method","225434151":"Computational Optimization: An Overview","287759983":"Universal Prediction Distribution for Surrogate Models","265338010":"Effect of structural parameters on design of variable-stiffness composite cylinders made by fiber steering","269565789":"Optimization of Rotating Cooling Channel with Pin Fins Downstream of Turning Region","266486958":"MODEL REDUCTION AND LEVEL SET METHODS FOR SHAPE OPTIMIZATION PROBLEMS A B TEKNILLINEN KORKEAKOULU","262401263":"Accurate low-cost microwave component models using shape-preserving response prediction","253548627":"Global Optimization Using Mixed Surrogate Models for Computation Intensive Designs","263172350":"Computational Optimization, Methods and Algorithms","267691175":"Computationally Efficient Simulation-Driven Design Optimization of Microwave Structures","235944262":"Surrogate Based Optimization Techniques for Aerodynamic Design of Turbomachinery","267505831":"Optimization of a Dimpled Channel Using a Surrogate Model","236852553":"A Global Optimization Algorithm for Electromagnetic Devices by Combining Adaptive Taylor Kriging and Particle Swarm Optimization","254526580":"An Efficient Response Surface Approach for the Optimization of ASP Flooding Processes: ASP Pilot Project LL03 Reservoir","284763046":"Multi-objective optimization of a low specific speed centrifugal pump using an evolutionary algorithm","276270870":"Simulation-based design of power electronic systems using surrogate modelling techniques","245426626":"Multiresponse and Multistage Metamodeling Approach for Design Optimization","226671334":"Estimating training data boundaries in surrogate-based modeling","262865103":"Reliable reduced cost modeling and design optimization of microwave filters using co‐kriging","274438974":"Analysis and Optimization of Double-Jet Film-Cooling Holes","279254990":"Safety margins for conservative surrogates","224154167":"Numerically efficient design optimization of a printed 2.45 GHz Yagi antenna","263245022":"Multi-objective aerodynamic shape optimization of small livestock trailers","257099836":"Characterising geotechnical model uncertainty by hybrid Markov Chain Monte Carlo simulation","258517021":"Setting Targets for Surrogate-Based Optimization","272042818":"Influence of ensemble surrogate models and sampling strategy on the solution quality of algorithms for computationally expensive black-box global optimization problems","270621526":"Reliability-based design optimization of fluid-solid interaction problems","236176745":"Multi-Objective Design Exploration and Its Application to Regional-Jet Wing Design","226202112":"Cost optimization of a hybrid composite flywheel rotor with a split-type hub using combined analytical/numerical models","227210998":"On Similarity-Based Surrogate Models for Expensive Single- and Multi-objective Evolutionary Optimization","230537921":"Accurate modeling of microwave devices using Kriging-corrected space-mapping surrogates","271481680":"Low-cost feature-based modeling of microwave structures","287356578":"Ensemble of metamodels: the augmented least squares approach","268582790":"Finite-Difference Sensitivity Calculation in Iteratively Solved Problems","267716720":"Dimensionnement et justification des structures composites: vers une optimisation des campagnes de simulation","270596007":"Simulation-Driven Design of Low-Speed Wind Tunnel Contraction","252036237":"Fast simulation-driven design of antennas using shape-preserving response prediction","280711985":"Comparison of surrogate models with different methods in groundwater remediation process","226630153":"Sampling-Based RBDO Using the Dynamic Kriging (D-Kriging) Method and Stochastic Sensitivity Analysis","3131296":"Space-Mapping Optimization With Adaptive Surrogate Model","269564801":"Optimal Design of Unitized Structures Using Response Surface Approaches","220674742":"Modeling and simulation for damage analysis of intelligent, self-reconfigurable ship fluid systems in early design phase","261601283":"Expedited EM-Driven Multiobjective Antenna Design in Highly Dimensional Parameter Spaces","269228954":"Global Search for Diverse Competitive Designs","282626894":"Thrust augmentation optimization through supersonic after-burning in scramjet engine nozzles via surrogate-assisted evolutionary algorithms","264240168":"A reduced multiscale model for nonlinear structural topology optimization","241040837":"Efficient design of experiments for structural optimization using significance screening","224244421":"Accurate modelling of microwave structures using shape-preserving response prediction","252041372":"Data fusion of multi-fidelity model and its application in low speed reflexed airfoil shape optimization","269228951":"Optimistic Bias in Surrogate Prediction near Surrogate Optima","257719489":"Scaling Properties of Multi-Fidelity Shape Optimization Algorithms","257719490":"Low-Fidelity Model Mesh Density and the Performance of Variable-Resolution Shape Optimization Algorithms","257719491":"Computational Optimization, Modelling and Simulation: Smart Algorithms and Better Models","261398580":"Analysis of the effect of chirp parameters on image quality of synthetic aperture RADAR","271502223":"Accurate modeling of microwave structures using generalized shape-preserving response prediction","232411769":"Data-driven dynamic emulation modeling for the optimal management of environmental systems","255597727":"Intercalation-induced Stress and Heat Generation inside Lithium-Ion Battery Cathode Particles under Potentiodynamic Control","242216395":"DESIGN OF THE RESISTANCE WELDING TOOL USING OPTIMIZATION TECHNIQUES","258475212":"Aeronautic Conceptual Design Optimization Method Based on High-Order Singular Value Decomposition","268477350":"The Suited Airliner for an Existing Airline Network","258343105":"Comparison of Adaptive Sampling Methods for Generation of Surrogate Aerodynamic Models","258475200":"Control-Oriented Design Using Surrogate-Based Optimization and Existence Conditions for Robust Performance","225734365":"Various approaches for constructing an ensemble of metamodels using local measures","228367926":"Reliability-Based Structural Optimization Using a Multiscale Material Model","225410756":"Simulation-Driven Design in Microwave Engineering: Application Case Studies","245439757":"Surrogate Modeling for Optimization of Dimpled Channel to Enhance Heat Transfer Performance","258475205":"Enhancement of a Flapping Wing Using Path and Dynamic Topology Optimization","233193046":"Infill sampling criteria for surrogate-based optimization with constraint handling","226427598":"Computational Tool for a Mini-Windmill Study with SOFT","264154127":"DESIGN OPTIMIZATION OF UPPER PLENUM OF PBMR USING RESPONSE SURFACE APPROXIMATION","272239499":"Aerodynamic Shape Optimization by Variable-Fidelity Computational Fluid Dynamics Models: A Review of Recent Progress","222968568":"A sequential nonlinear interval number programming method for uncertain structures","260510772":"Multiobjective Optimization and CFD Simulation for a High-Voltage Circuit Breaker","251910331":"QUALITY OPTIMIZATION USING LOCALLY REFINED METAMODELS","224374501":"Accelerated Microwave Design Optimization With Tuning Space Mapping","239399416":"Thermal Optimization of a Microchannel Heat Sink With Trapezoidal Cross Section","259562694":"Effective Transport Properties of LiMn2O4 Electrode via Particle-Scale Modeling","49652021":"Statistical Metamodeling for Revealing Synergistic Antimicrobial Interactions","284131119":"Reduced Cost Mission Design Using Surrogate Models","282320658":"Damage tolerance optimization of composite stringer run-out under tensile load","268478403":"Effective Tests for Discovering Unexpected Structural Failure Modes","287127262":"Simulation-Driven Antenna Design Using Surrogate-Based Optimization","24190645":"Two-Dimensional Surrogate Contact Modeling for Computationally Efficient Dynamic Simulation of Total Knee Replacements","224158361":"Shape-preserving response prediction for microwave circuit modeling","229910130":"Composite right/left‐handed band‐pass filters with wide fractional bandwidth based on dual‐metal‐plane structure","223105675":"Enhanced multi-objective optimization of a microchannel heat sink through evolutionary algorithm coupled with multiple surrogate models","277903192":"Design optimization using hyper-reduced-order models","257432721":"An efficient differential evolution using speeded-up k-nearest neighbor estimator","227318336":"Quality assessment of coarse models and surrogates for space mapping optimization","245426541":"Surrogate-Based Optimization Using Multifidelity Models with Variable Parameterization and Corrected Space Mapping","224158353":"Adaptively constrained parameter extraction for robust space mapping optimization of microwave circuits","227879512":"Recent advances in space‐mapping‐based modeling of microwave devices","261365850":"A Maximum Confidence Enhancement Based Sequential Sampling Scheme for Simulation-Based Design","280208253":"Sequential RBF Surrogate-based Efficient Optimization Method for Engineering Design Problems with Expensive Black-Box Functions","268235820":"Fast Simulation-Driven Antenna Design Using Response-Feature Surrogates","264580119":"Rapid optimisation of omnidirectional antennas using adaptively adjusted design specifications and kriging surrogates","276117414":"Optimized design of linear cascades for turbomachinery applications","233935399":"An Algorithm to Determine Sample Sizes for Optimization with Artificial Neural Networks","263244902":"Constrained optimization by radial basis function interpolation for high-dimensional expensive black-box problems with infeasible initial points","254303472":"Enabling exploration in the conceptual design and optimisation of complex systems","3426285":"Shape Optimization of Micro-Channel Heat Sink for Micro-Electronic Cooling","269387735":"An adaptive-topology ensemble algorithm for engineering optimization problems","276852572":"Fast surrogate-assisted simulation-driven optimisation of add-drop resonators for integrated photonic circuits","224247426":"Accurate and Scalable IO Buffer Macromodel Based on Surrogate Modeling","227093096":"Ensemble of surrogates","253257979":"Constrained polynomial fitting for recovery of regional gravity","231004711":"Extraction of design rules from multi-objective design exploration (MODE) using rough set theory","224196282":"Rapid design optimisation of microwave structures through automated tuning space mapping","252004579":"Optimization of UWB planar antennas using adaptive design specifications","5496756":"Closed-loop control of cellular functions using combinatory drugs guided by a stochastic search algorithm","261049444":"Enhanced fidelity modeling of microwave structures combining shape-preserving response prediction with space mapping","281710372":"Experimental study of redesigned draft tube of an Agnew microhydro turbine","278781801":"Iterative Designs of experiments for constraint approximation","220199655":"An efficient multi-objective optimization method for black-box functions using sequential approximate technique. Appl Soft Comput","236954085":"Energy Density Comparison of Li-ion Cathode Materials Using Dimensional Analysis","289693374":"Efficient Optimization of Cylindrical Stiffened Shells with Reinforced Cutouts by Curvilinear Stiffeners","269567978":"Kinematic Optimization of a Flapping Motion for Maneuverability and Sustainability Flights","236954083":"Optimization of a Single Lithium-Ion Battery Cell with a Gradient-Based Algorithm","253788383":"A SOFTWARE TOOL FOR REGRESSION MODELLING USING VARIOUS MODELLING METHODS","271445970":"Multiobjective optimisation on a budget: Exploring surrogate modelling for robust multi-reservoir rules generation under hydrological uncertainty","291557023":"A kriging surrogate model coupled in simulation-optimization approach for identifying release history of groundwater sources"},"index":861}