{"abs":"This work presents a new approach of evolutionary multi-objective optimization algorithms augmented by collective intelligence interaction. In particular, we describe the extension of some well-known algorithms (NSGA-II, SMS-EMOA) to include collective online preferences and collaborative solutions into the optimization process. These innovative methods allow groups of decision makers to highlight the regions of Pareto frontier that are more relevant to them as to focus the search process mainly on those areas. Additionally, interactive and cooperative genetic algorithms work on users\u0027 collaborative preferences to improve the reference points and the population quality throughout the evolutionary progress. Rather than a unique or small group of decision makers provided with unilateral preferences, this paper promotes dynamic group preferences to aggregate consistent collective reference points and creative solutions to enhance multi-objective results. As part of this work we test the algorithms efficiency when face with some synthetic problem as well as a real-world case scenario.","title":"Collaborative preferences in multi-objective evolutionary algorithms.","id":280492354,"url":"https://www.researchgate.net/publication/280492354_Collaborative_preferences_in_multi-objective_evolutionary_algorithms","names":["Daniel Cinalli","Luis Martí","Nayat Sánchez-Pi","A. C. B. Garcia"],"references":{"220741544":"Reference Point Based Multi-Objective Optimization Using Evolutionary Algorithms","216300582":"Multicriteria Optimization","226558594":"A Survey of Web-Based Collective Decision Making Systems","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","257141716":"Evolving Decision Trees with Beam Search-based Initialization and Lexicographic Multi-Objective Evaluation","51651228":"Crystal Structure of a Monomeric Retroviral Protease Solved by Protein Folding Game Players","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220200145":"Interactive Genetic Algorithm with Mixed Initiative Interaction for multi-criteria ground water monitoring design","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","224133139":"The r-Dominance: A New Dominance Relation for Interactive Evolutionary Multicriteria Decision Making","220739706":"Reference point based multi-objective evolutionary algorithms for group decisions","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","200773230":"The Wisdom of Crowds","225232566":"Interleaving Guidance in Evolutionary Multi-Objective Optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","216300483":"Multiobjective Optimization. Principles and Case Studies","282059174":"A survey and annotated bibliography of multiobjective combinatorial optimization","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","228139892":"Harnessing Crowds: Mapping the Genome of Collective Intelligence","2681561":"Evolutionary Design and Multi-objective Optimisation","267404163":"Group Preference-based Evolutionary Multi-objective Optimization with Non-Equally Important Decision Makers: Application to the Portfolio Selection Problem","224177572":"An Interactive Evolutionary Multiobjective Optimization Method Based on Progressively Approximated Value Functions","243690687":"Springer Lecture Notes in Economics and Mathematical Systems","265303019":"Handbook of Metaheuristics","272174855":"An Aspiration Set EMOA Based on Averaged Hausdorff Distances","26768807":"A Preference-Based Evolutionary Algorithm for Multi-Objective Optimization"},"citedIn":{},"index":862}