{"abs":"In estimating a response surface over a design region of interest, mean squared error can arise both from sampling variance and bias introduced by model inadequacy. The criterion adopted here for experimental design attempts to protect against bias resulting from a large class of deviations from the assumed model. Two algorithms are proposed for the construction of either approximate or exact designs and an example is given.","title":"A Mean Squared Error Criterion for the Design of Experiments","id":31102562,"url":"https://www.researchgate.net/publication/31102562_A_Mean_Squared_Error_Criterion_for_the_Design_of_Experiments","names":["William J. Welch","Biometrika"],"references":{"230872695":"A Basis for the Selection of a Response Surface Design","230872693":"The Choice of a Second Order Rotatable Design","269005056":"An Algorithm for the Construction od D-Optimal Experimental Design","254331972":"Time and Space-Saving Computer Methods, Related to Mitchell\u0027s DETMAX, for Finding D-Optimum Designs","241735669":"Minimum Bias Estimation and Experimental Design for Response Surfaces","254284326":"Experimental Design Considerations Based on a New Approach to Mean Square Error Estimation of Response Surfaces"},"citedIn":{"268973952":"Recent Developments in the Methods of Optimum and Related Experimental Designs","229563172":"Response surface approximations for structural optimization","245893283":"Designs for Computer Experiments","250754686":"Response Surface Designs","257334727":"Approximation methods in multidisciplinary analysis and optimization: A panel discussion","233106416":"Admissible minimum bias estimation of response surfaces","234102498":"A Simple Bayesian Modification of D-Optimal Designs to Reduce Dependence on an Assumed Model","266054604":"Pointwise RMS bias error estimates for design of experiments","29616987":"Asymptotic criteria for designs in nonlinear regression with model errors","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","257017423":"Model-Robust Designs for Split-Plot Experiments","4993388":"An experimental design criterion for minimizing meta-model prediction errors applied to die casting process design","266474306":"BAYESIAN AND SEMI-BAYESIAN REGRESSION APPLIED TO MANUFACTURING WOODEN PRODUCTS","23990988":"Orthogonal-column Latin hypercube designs with small samples","250754768":"9 Computer experiments","222672481":"Response Surface Design Evaluation and Comparison","243102937":"Graphical Tools for Assessing the Sensitivity of Response Surface Designs to Model Misspecification","48829007":"Optimal design for generalized linear models with a multinomial response","254332431":"Computer-Aided Design of Experiments for Response Estimation","257644284":"Comparison of designs for generalized linear models under model misspecification","239142249":"The estimation of knock-points of fuels by a weighted mean square error criterion","227722555":"Generalized pointwise bias error bounds for response surface approximation","239590120":"UNCERTAINTY ANALYSIS FOR COMPUTER SIMULATIONS THROUGH VALIDATION AND CALIBRATION","10600976":"Should we take measurements at an intermediate design point?","229945223":"THE CONSTRUCTION OF EQUILEVERAGE DESIGNS FOR MULTIPLE LINEAR REGRESSION","228693908":"Designing experiments under random contamination with application to polynomial spline regression","228972691":"Pointwise Bias Error Bounds for Response Surface Approximations and Min-Max Bias Design","236412716":"Discussion of “Response Surface Design Evaluation and Comparison” by C.M. Anderson-Cook, C.M. Borror, and D.C Montgomery","229924361":"Generating information for real‐time optimization","222299007":"Model-robust and model-sensitive designs","283131680":"Minimax designs for linear regression models with bias in a reproducing kernel Hilbert space in a discrete set","264973071":"A Novel Method to Predict Traffic Features Based on Rolling Self-Structured Traffic Patterns","267672113":"Introduction to engineering statistics and lean Six Sigma—Statistical quality control and design of experiments and systems. New York: Springer","24052136":"Treating Bias as Variance for Experimental Design Purposes","28358138":"A note on all-bias designs with applications in spline regression models","226681161":"Experimental design for estimating the optimum point in a response surface","279373802":"Mechanisms and Dynamic Systems","239590677":"Mighty: A \u0027Rip-Up and Reroute\u0027 Detailed Router","261933390":"Efficient Designs With Minimal Aliasing","235101399":"Statistical Design of MOS VLSI (Very Large Scale Integrated) Circuits with Designed Experiments","267482407":"Experiments with Mixtures: DESIGNS, Models and the Analysis of Mixture Data","237577589":"Perspectives on Prediction Variance and Bias in Developing, Assessing, and Comparing Experimental Designs","3225452":"Statistical Performance Modeling and Parametric Yield Estimation of MOS VLSI","254329847":"Model-Robust Two-Level Designs Using Coordinate Exchange Algorithms and a Maximin Criterion","245366776":"A Clustering-Based Surrogate Model Updating Approach to Simulation-Based Engineering Design","30861105":"Pitfalls of using a single criterion for selecting experimental designs","254086988":"Stavex: A Sophisticated but User-Friendly Expert System for the Design and Analysis of Experiments","228939983":"Exchange Algorithms for Constructing Model-Robust Experimental Designs","2412105":"A Framework for Managing Models in Nonlinear Optimization of Computationally Expensive Functions","269015655":"Introduction to Engineering Statistics and Six Sigma: Statistical Quality Control and Design of Experiments and Systems","267003930":"Optimal Designs for Contaminated Linear Regression","6065700":"Computer experiments.","220402142":"PYFS—A Statistical Optimization Method for Integrated Circuit Yield Enhancement","4049344":"Neuro-based adaptive controller for longitudinal flight control"},"index":865}