{"abs":"Multi-objective optimization algorithms aim at finding Pareto-optimal solutions. Recovering Pareto fronts or Pareto sets from a limited number of function evaluations are challenging problems. A popular approach in the case of expensive-to-evaluate functions is to appeal to metamodels. Kriging has been shown efficient as a base for sequential multi-objective optimization, notably through infill sampling criteria balancing exploitation and exploration such as the Expected Hypervolume Improvement. Here we consider Kriging metamodels not only for selecting new points, but as a tool for estimating the whole Pareto front and quantifying how much uncertainty remains on it at any stage of Kriging-based multi-objective optimization algorithms. Our approach relies on the Gaussian process interpretation of Kriging, and bases upon conditional simulations. Using concepts from random set theory, we propose to adapt the Vorob’ev expectation and deviation to capture the variability of the set of non-dominated points. Numerical experiments illustrate the potential of the proposed workflow, and it is shown on examples how Gaussian process simulations and the estimated Vorob’ev deviation can be used to monitor the ability of Kriging-based multi-objective optimization algorithms to accurately learn the Pareto front.","title":"Quantifying uncertainty on Pareto fronts with Gaussian Process conditional simulations","id":272891057,"url":"https://www.researchgate.net/publication/272891057_Quantifying_uncertainty_on_Pareto_fronts_with_Gaussian_Process_conditional_simulations","names":["Mickaël Binois","David Ginsbourger","Olivier Roustant","European Journal of Operational Research"],"references":{"44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","225123240":"Multiobjective optimization for crash safety design of vehicles using stepwise regression model","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","269420296":"Fast Update of Conditional Simulation Ensembles","221228390":"Lecture Notes in Computer Science","41781559":"Gaussian Process for Machine Learning","267109921":"Theory of Random Sets","255484593":"Invariances of random fields paths, with applications in Gaussian Process Regression","253294995":"The Attainment-Function Approach to Stochastic Multiobjective Optimizer Assessment and Comparison","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","221228387":"Exploring the Performance of Stochastic Multiobjective Optimisers with the Second-Order Attainment Function","281015536":"Fast uncertainty reduction strategies relying on Gaussian process models","235709918":"Nonlinear Multiobjective Optimization","224839797":"Model-Based Geostatistics","245285450":"Kriging and Conditional Simulation of Gaussian Field","34019472":"Bayesian uncertainty analysis for complex computer codes.","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","252060894":"A fast and elitist multiobjective genetic algorithm: NSGA-II, IEEE Trans. on Evol","245426181":"Statistical Improvement Criteria for Use in Multiobjective Design Optimization","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","216457295":"On Expected-Improvement Criteria for Model-based Multi-objective Optimization","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","247644014":"Interpolation of Spatial Data: Some Theory of Kriging","227022372":"A Review of Techniques for Handling Expensive Functions in Evolutionary Multi-Objective Optimization","238342681":"Principles of geostatistics. Econ Geol (Lancaster)","260947747":"Multivariate versus Univariate Kriging Metamodels for Multi-Response Simulation Models","261054334":"Hypervolume-based expected improvement: Monotonicity properties and exact computation","272929205":"Nonlinear Multiobjective Optimization","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","221024792":"Introduction to Evolutionary Multiobjective Optimization","243768499":"A Bayesian Analysis of Kriging","216457235":"A SEQUENTIAL DESIGN FOR APPROXIMATING THE PARETO FRONT USING THE EXPECTED PARETO IMPROVEMENT FUNCTION","221025114":"Lecture Notes in Computer Science","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","234168780":"Cross Validation and Maximum Likelihood estimation of hyper-parameters of Gaussian processes with model misspecification","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","247861883":"Geostatistics for Conditional Simulation of Ore Bodies","222889399":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications"},"citedIn":{"281946744":"Quantifying and reducing uncertainties on excursion sets under a gaussian random field prior","269420296":"Fast Update of Conditional Simulation Ensembles","270539639":"On the estimation of Pareto fronts from the point of view of copula theory","282448042":"Statement of Problem of Pareto Frontier Management and Its Solution in the Analysis and Synthesis of Optimal Systems"},"index":869}