{"abs":"When facing a real world, optimization problems mainly become multi-objective i.e. they have several criteria of excellence. A multi-criteria problem submitted for multi-criteria evaluation is a complex problem, as usually there is no optimal solution, and no alternative is the best one according to all criteria. However, if a metaheuristic algorithm is combined with a Multi-Criteria Decision-Making method then, instead of submitting all solutions, only near-optimal solutions are submitted for multi-criteria evaluation, i.e. compared and ranked using a priori decision-maker preferences. It is called an a priori approach to multi-objective optimization. This paper presents this approach using a specially designed HUMANT (HUManoid ANT) algorithm derived from Ant Colony Optimization and the PROMETHEE method. The preliminary results of this optimization algorithm are presented for the Single-Objective Traveling Salesman Problem (TSP), Shortest Path Problem (SPP) and the Multi-Objective Partner Selection Problem (PSP). Additionally, the multi-objective approach of the HUMANT algorithm to single-objective optimization problems is presented using the Shortest Path Problem (SPP).","title":"Single-objective and multi-objective optimization using the HUMANT algorithm","id":283319834,"url":"https://www.researchgate.net/publication/283319834_Single-objective_and_multi-objective_optimization_using_the_HUMANT_algorithm","names":["Marko Mladineo","Ivica Veza","Nikola Gjeldum"],"references":{"216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","271847409":"The Analytic Hierarchy Process, Planning, Piority Setting, Resource Allocation","220535213":"Equivalent Information for Multiobjective Interactive Procedures","220741729":"Interactive evolutionary multi-objective optimization and decision-making using reference direction method","220118677":"Optimization by Simulated Annealing","272802313":"Optimization of the selection of competence cells in regional production network","237009136":"Progressive Multi-Objective Optimization","268394349":"Integrating the decision maker\u0027s preferences into Multiobjective Ant Colony Optimization","259128291":"Approximating PROMETHEE II\u0027s net flow scores by piecewise linear value functions","220669042":"SSPMO: A Scatter Tabu Search Procedure for Non-Linear Multiobjective Optimization","233573684":"Decision Aids for Selection Problems","242159030":"Application of the Ant Colony Optimization Metaheuristic to Multi-objective Optimization Problems","220535036":"An Interactive Evolutionary Metaheuristic for Multiobjective Combinatorial Optimization","220579768":"Metaheuristic Optimization","268719779":"Metaheuristics: From Design to Implementation","216143243":"Bi-Criterion Optimization with Multi Colony Ant Algorithms","45904853":"Firefly Algorithms for Multimodal Optimization","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","225969431":"Approach to partner selection in agile manufacturing","45918028":"Engineering Optimisation by Cuckoo Search","243770678":"PROMETHEE: a new family of outranking methods in multicriteria analysis","242356870":"Adaptation In Natural And Artificial Systems","273453883":"Particle Swarm Optimization","235439153":"Ant sytem: Optimization by a colony of cooperating agents","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","272804669":"Sustainability through Production Networks"},"citedIn":{},"index":870}