{"abs":"Data augmentation and Gibbs sampling are two closely related, sampling-based approaches to the calculation of posterior moments. The fact that each produces a sample whose constituents are neither independent nor identically distributed complicates the assessment of convergence and numerical accuracy of the approximations to the expected value of functions of interest under the posterior. In this paper methods from spectral analysis are used to evaluate numerical accuracy formally and construct diagnostics for convergence. These methods are illustrated in the normal linear model with informative priors, and in the Tobit-censored regression model. Keywords and phrases: Data augmentation, Gibbs sampling, Mixed estimation, Monte Carlo integration, Tobit model This paper was prepared as an invited presentation at the Fourth Valencia International Meeting on Bayesian Statistics, Peiscola, Spain, April 15-20, 1991. Financial support from National Science Foundation Grant SES-8908365 and re...","title":"Evaluating the Accuracy of Sampling-Based Approaches to the Calculation of Posterior Moments","id":2352607,"url":"https://www.researchgate.net/publication/2352607_Evaluating_the_Accuracy_of_Sampling-Based_Approaches_to_the_Calculation_of_Posterior_Moments","names":["John Geweke","Forthcoming In"],"references":{"243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","19651885":"Mixed-Model Analysis of a Censored Normal Distribution with Reference to Animal Breeding","4895745":"Bayesian Inference in Econometric Models Using Monte Carlo Integration","256557505":"Tobit Models: A Survey","243082003":"Bayes’ Theorem and the Use of Prior Knowledge in Regression Analysis","2335219":"Efficient Simulation from the Multivariate Normal and Student-t Distributions Subject to Linear Constraints and the Evaluation of Constraint Probabilities","243766391":"Efficient Simulation from the Multivariate Normal and Student-t Distributions Subject to Linear Constraints","4897883":"Bayesian Estimates of Equation System Parameters: An Application of Integration by Monte Carlo.","222291755":"Antithetic Acceleration of Monte Carlo Integration in Bayesian Inference","245582229":"Bayesian Marginal Inference","222351959":"“Bayes Inference in the Tobit Censored Regression Model.”","225304570":"Non-Uniform Random Variate Generation","31413541":"Approximate Bayesian Analysis of Censored Survival Data","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","51992999":"Limited-Dependent And Qualitative Variables In Econometrics","4860053":"Estimation of Relationship for Limited Dependent Variables"},"citedIn":{},"index":878}