{"abs":"In parametric estimation of covariance function of Gaussian processes, it is often the case that the true covariance function does not belong to the parametric set used for estimation. This situation is called the misspecified case. In this case, it has been observed that, for irregular spatial sampling of observation points, Cross Validation can yield smaller prediction errors than Maximum Likelihood. Motivated by this comparison, we provide a general asymptotic analysis of the misspecified case, for independent observation points with uniform distribution. We prove that the Maximum Likelihood estimator asymptotically minimizes a Kullback-Leibler divergence, within the misspecified parametric set, while Cross Validation asymptotically minimizes the integrated square prediction error. In a Monte Carlo simulation, we show that the covariance parameters estimated by Maximum Likelihood and Cross Validation, and the corresponding Kullback-Leibler divergences and integrated square prediction errors, can be strongly contrasting. On a more technical level, we provide new increasing-domain asymptotic results for the situation where the eigenvalues of the covariance matrices involved are not upper bounded.","title":"Asymptotic analysis of covariance parameter estimation for Gaussian processes in the misspecified case","id":269280638,"url":"https://www.researchgate.net/publication/269280638_Asymptotic_analysis_of_covariance_parameter_estimation_for_Gaussian_processes_in_the_misspecified_case","names":["François Bachoc"],"references":{"45857961":"On the consistent separation of scale and variance for Gaussian random fields","234140352":"Calibration And Improved Prediction Of Computer Models By Universal Kriging","257016708":"The effect of the nugget on Gaussian process emulators of computer models","234168781":"Asymptotic analysis of the role of spatial sampling for hyper-parameter estimation of Gaussian processes","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set"},"citedIn":{"277895584":"Asymptotic properties of multivariate tapering for estimation and prediction"},"index":88}