{"abs":"An extension of the synchronous parallel kinetic Monte Carlo (spkMC) algorithm developed by Martinez et al. [J. Comp. Phys. 227 (2008) 3804] to discrete lattices is presented. The method solves the master equation synchronously by recourse to null events that keep all processors’ time clocks current in a global sense. Boundary conflicts are resolved by adopting a chessboard decomposition into non-interacting sublattices. We find that the bias introduced by the spatial correlations attendant to the sublattice decomposition is within the standard deviation of serial calculations, which confirms the statistical validity of our algorithm. We have analyzed the parallel efficiency of spkMC and find that it scales consistently with problem size and sublattice partition. We apply the method to the calculation of scale-dependent critical exponents in billion-atom 3D Ising systems, with very good agreement with state-of-the-art multispin simulations.","title":"Billion-atom Synchronous Parallel Kinetic Monte Carlo Simulations of Critical 3D Ising Systems","id":222645446,"url":"https://www.researchgate.net/publication/222645446_Billion-atom_Synchronous_Parallel_Kinetic_Monte_Carlo_Simulations_of_Critical_3D_Ising_Systems","names":["Enrique Martinez","Paul R Monasterio","Jaime Marian","Journal of Computational Physics"],"references":{"242325872":"Communications of the acm 39","228669984":"Semirigorous synchronous sublattice algorithm for parallel kinetic Monte Carlo simulations of thin film growth","225410027":"“An Overview of Spatial Microscopic and Accelerated Kinetic Monte Carlo Methods","6524965":"First-Passage Monte Carlo Algorithm: Diffusion without All the Hops","1939738":"Algorithms for faster and larger dynamic Metropolis simulations","1859867":"Monte Carlo Simulations of Short-Time Critical Dynamics","225173987":"Bond dilution in the 3D Ising model: A Monte Carlo study","230992526":"Cellular automata as microcanonical simulators","223046273":"Net-Event Kinetic Monte Carlo for Overcoming Stiffness in Spatially Homogeneous and Distributed Systems","232355218":"Damage spreading and critical exponents for “model A” Ising dynamics","6449325":"Synchronous relaxation algorithm for parallel kinetic Monte Carlo simulations of thin film growth","224877366":"Rigorous synchronous relaxation algorithm for parallel kinetic Monte Carlo simulations of thin film growth","224877243":"Theoretical Foundations of Dynamic Monte Carlo Simulations","242484906":"The Theory of Stochastic Processes, Methuen, London","260888594":"Monte Carlo Studies of the Three-Dimensional Ising Model in Equilibrium","228525505":"Hybrid asynchronous algorithm for parallel kinetic Monte Carlo simulations of thin film growth","225828439":"Monte Carlo Methods","220420294":"LogP: A Practical Model of Parallel Computation.","222531045":"Synchronous parallel kinetic Monte Carlo for continuum diffusion-reaction systems","13288419":"Monte Carlo renormalization-group study of the three-dimensional Ising model","222673132":"Local and cluster critical dynamics of the 3d random-site Ising model","2759171":"Crossovers in the Two Dimensional Ising Spin Glass with ferromagnetic next-nearest-neighbor interactions","224877198":"A New Algorithm for Monte Carlo Simulation of King Spin Systems","226940076":"Introduction to the kinetic Monte Carlo method","222121943":"Relaxation of Ising models near and away from criticality","46946016":"Parallel Algorithms in Computational Science","228108149":"The Theory of Stochastic Processes","2429451":"An In-Depth Analysis of the Communication Costs of Parallel Finite Element Applications","51547939":"Parallel kinetic Monte Carlo simulations of Ag(111) island coarsening using a large database","226225993":"The dynamic critical exponent of the three-dimensional Ising model","220136424":"Synchronous Relaxation for Parallel Simulations with Applications to Circuit-Switched Networks.","46620991":"Monte Carlo Methods in Statistical Physics","234970937":"A Monte Carlo method for large reaction–diffusion systems","234996798":"Time‐Dependent Statistics of the Ising Model"},"citedIn":{"247153209":"Order parameter of a three-dimensional Ising-like system in the simplest and higher non-Gaussian approximations","260679850":"A Path Factorization Approach to Stochastic Simulations","229219106":"“A Review of Multiscale Modeling of Metal-Catalyzed Reactions: Mechanism Development for Complexity and Emergent Behavior","268233971":"Kinetic modelling of heterogeneous catalytic systems","269040696":"Computationally-efficient stochastic cluster dynamics method for modeling damage accumulation in irradiated materials","287356881":"Massively parallel kinetic Monte Carlo simulations of charge carrier transport in organic semiconductors","50235628":"Critical phenomena and phase transitions in large lattices within Monte-Carlo based non-perturbative approaches","235523450":"Nanovoid nucleation by vacancy aggregation and vacancy-cluster coarsening in high-purity metallic single crystals","263854828":"Sublattice Parallel Replica Dynamics","264122756":"A rigorous sequential update strategy for parallel kinetic Monte Carlo simulation","51489099":"Determination of raloxifene and its glucuronides in human urine by liquid chromatography-tandem mass spectrometry assay","275421169":"Parallelized Meso-Scale Kinetic Monte Carlo Simulations for SOFC Characterization","265416909":"Kinetic Monte Carlo Simulations and Molecular Conductance Measurements of the Bacterial Decaheme Cytochrome MtrF","273478706":"Synchronous parallel Kinetic Monte Carlo: Implementation and results for object and lattice approaches","280936096":"Computationally-efficient stochastic cluster dynamics method for modeling damage accumulation in irradiated materials"},"index":884}