{"abs":"Response surface method is a convenient tool to assess reliability for a wide range of structural mechanical problems. More specifically, adaptive schemes which consist in iteratively refine the experimental design close to the limit state have received much attention. However, it is generally difficult to take into account a lot of variables and to well handle approximation error. The method, proposed in this paper, addresses these points using sparse response surface and a relevant criterion for results accuracy. For this purpose, a response surface is built from an initial Latin Hypercube Sampling (LHS) where the most significant terms are chosen from statistical criteria and cross-validation method. At each step, LHS is refined in a region of interest defined with respect to an importance level on probability density in the design point. Two convergence criteria are used in the procedure: The first one concerns localization of the region and the second one the response surface quality. Finally, a bootstrap method is used to determine the influence of the response error on the estimated probability of failure. This method is applied to several examples and results are discussed.","title":"A new adaptive response surface method for reliability analysis","id":257101719,"url":"https://www.researchgate.net/publication/257101719_A_new_adaptive_response_surface_method_for_reliability_analysis","names":["Nicolas Roussouly","Frank Petitjean","M. Salaun","Probabilistic Engineering Mechanics"],"references":{"265619863":"Subset Selection in Regression","278634527":"Adaptive sparse polynomial chaos expansions for uncertainty propagation and sensitivity analysis","7836850":"Prediction error estimation: A comparison of resampling","222934337":"An examination of methods for approximating implicit limit state functions from the viewpoint of statistical learning theory","273134799":"Estimating the Dimension of a Model","223592988":"A new look at the response surface approach for reliability analysis","250693054":"Realistic and efficient reliability estimation for aerospace structures","233801150":"Springer Series in Statistics","223416196":"“Response surface method using vector projeted sampling points”","38358303":"‘Estimating the Dimension of A Model,’","38363487":"The Design and Analysis of Computer Experiments","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","223934351":"Structural reliability analysis for implicit functions using artificial neural networks","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","51890126":"Metamodel-based importance sampling for structural reliability analysis","243766494":"Improvements on Cross-Validation: The 632+ Bootstrap Method","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","229328945":"Cumulative formation of response surface and its use in reliability analysis","245284547":"A Response Surface Approach for Reliability Analysis","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","222933783":"Asymptotic sampling for high-dimensional reliability analysis","240445429":"Sparse polynomial chaos expansions and adaptive stochastic finite element using a regression approach","224839810":"An Introduction to the Boot-Strap","223079085":"An adaptive algorithm to build up sparse polynomial chaos expansions for stochastic finite element analysis","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","241080889":"Applications of asymptotic sampling on high dimensional structural dynamic problems","27610573":"Le test du maximum fort: une façon efficace de valider la qualité d\u0027un point de conception.","223590203":"Reliability Analysis of Structure Using Neural Network method","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","220049076":"An Introduction To The Bootstrap","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","245185072":"An efficient response surface method using moving least squares approximation for structural reliability analysis","222548334":"Reliability-based structural optimization using neural networks and Monte Carlo simulation","222553900":"Structural reliability analysis by univariate decomposition and numerical integration","228494572":"Adaptive Response Surface Method Using Inherited Latin Hypercube Design Points","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","236660847":"Exact and Invariant Second Moment Code Format","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","38358385":"Bootstrap Methods: Another Look at the Jack-Knife","245186087":"Adaptive response surface method based on a double weighted regression technique","225516876":"Metamodels for Computer-based Engineering Design: Survey and recommendations","223906278":"Application of Kriging method to structural reliability","251544513":"Efficient estimation of first passage probability of high-dimensional nonlinear systems","257007022":"System reliability analysis by enhanced Monte Carlo simulation"},"citedIn":{"283752170":"A response surface approach for reliability analysis of 2.5D C/SiC composites turbine blade","277721304":"Capabilities of stochastic response surface method and response surface method in reliability analysis","282255333":"Sequential reliability estimation correction (SREC) with univariate revolving integration (URI)","265136660":"Construction of bootstrap confidence intervals on sensitivity indices computed by polynomial chaos expansion","280310254":"Estimating the small failure probability of a nuclear passive safety system by means of an efficient Adaptive Metamodel-Based Subset Importance Sampling method","264425465":"Comparative analysis of failure probability for ethylene cracking furnace tube using Monte Carlo and API RBI technology","274196844":"Probabilistic Life Assessment on Fatigue Crack Growth in Mixed-mode by Coupling of Kriging Model and Finite Element Analysis","282015571":"A fast decoupled reliability-based design optimization of structures using B-spline interpolation curves","274096027":"Multivariate Function Approximations Using D-MORPH Algorithm","276930014":"A New Sampling Approach for Response Surface Method Based Reliability Analysis and Its Application","282500121":"The optimization of the loading path for T-shape tube hydroforming using adaptive radial basis function"},"index":892}