{"abs":"Given a function depending both on decision parameters and nuisance variables, we consider the issue of estimating and quantifying uncertainty on profile optima and/or optimal points as functions of the nuisance variables. The proposed methods base on interpolations of the objective function constructed from a finite set of evaluations. Here the functions of interest are reconstructed relying on a kriging model, but also using Gaussian field conditional simulations, that allow a quantification of uncertainties in the Bayesian framework. Besides, we elaborate a variant of the Expected Improvement criterion, that proves efficient for adaptively learning the set of profile optima and optimizers. The results are illustrated on a toy example and through a physics case study on the optimal packing of polydisperse frictionless spheres.","title":"Bayesian Adaptive Reconstruction of Profile Optima and Optimizers","id":278619330,"url":"https://www.researchgate.net/publication/278619330_Bayesian_Adaptive_Reconstruction_of_Profile_Optima_and_Optimizers","names":["David Ginsbourger","Jean Baccou","Clément Chevalier","Frederic Perales","Nicolas Garland","Yann Monerie"],"references":{"230837892":"The Intrinsic Random Functions and Their Applications","4784065":"The Correct Kriging Variance Estimated by Bootstrapping","267109921":"Theory of Random Sets","242358078":"The Elements Of Statistical Learning","267437693":"Geostatistic: Modeling Spatial Uncertainty","281015536":"Fast uncertainty reduction strategies relying on Gaussian process models","226501199":"Bayesian Approach to Global Optimization","280697460":"Packing of Compressible Granular Materials","247646420":"Statistics for Spatial Data, Rev. Ed","263160696":"A Taxonomy of Global Optimization Methods Based on Response Surfaces","10988336":"Granular Segregation as a Critical Phenomenon","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","11397877":"Phase diagram of highly asymmetric binary hard-sphere mixtures","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","248217046":"Unilateral Contact and Dry Friction in Finite Freedom Dynamics","215992257":"Genetic Optimization Using Derivatives: The rgenoud Package for R","222679450":"Convergence properties of the expected improvement algorithm with fixed mean and covariance functions","216301381":"The Design and Analysis Computer Experiments","223706615":"The Non-smooth contact dynamics method","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","38359717":"Profile Likelihood and Conditionally Parametric Models","247644014":"Interpolation of Spatial Data: Some Theory of Kriging","226757289":"The Bayesian bridge between simple and universal kriging. Math Geol","262236687":"Noisy kriging-based optimization methods: A unified implementation within the DiceOptim package","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","40896900":"Close packing density of polydisperse hard spheres","5617775":"Internal states of model isotropic granular packings. III. Elastic properties","239635060":"Sands, Powders, and Grains: An Introduction to the Physics of Granular Materials","278821472":"DiceKriging, DiceOptim: two R packages for the analysis of computer experiments by kriging-based metamodelling and optimization","226716412":"Kriging Is Well-Suited to Parallelize Optimization"},"citedIn":{"269420296":"Fast Update of Conditional Simulation Ensembles","280076463":"Learning Feature-Parameter Mappings for Parameter Tuning via the Profile Expected Improvement"},"index":893}