{"abs":"Consider a system of particles moving on the integers with a simple exclusion interaction: each particle independently attempts to execute a simple symmetric random walk, but any jump which would carry a particle to an already occupied site is suppressed. For the system running in equilibrium, we analyze the motion of a tagged particle. This solves a problem posed in Spitzer\u0027s 1970 paper \"Interaction of Markov Processes.\" The analogous question for systems which are not one-dimensional, nearest-neighbor, and either symmetric or one-sided remains open. A key tool is Harris\u0027s theorem on positive correlations in attractive Markov processes. Results are also obtained for the rightmost particle in the exclusion system with initial configuration $Z^-$, and for comparison systems based on the order statistics of independent motions on the line.","title":"The Motion of a Tagged Particle in the Simple Symmetric Exclusion System on $Z$","id":38361673,"url":"https://www.researchgate.net/publication/38361673_The_Motion_of_a_Tagged_Particle_in_the_Simple_Symmetric_Exclusion_System_on_Z","names":["Richard Arratia","The Annals of Probability"],"references":{},"citedIn":{"10726049":"Single-file Diffusion of Atomic and Colloidal Systems: Asymptotic Laws","2315040":"Some Properties of K-Step Exclusion Processes","38361166":"A Correlation Inequality for the Symmetric Exclusion Process","226885004":"Self-Diffusion in Simple Models: Systems with Long-Range Jumps","45849015":"Current fluctuations of a system of one-dimensional random walks in random environment","2135341":"On a randomized PNG model with a columnar defect","5915223":"Tagged Particle Correlations in the Asymmetric Simple Exclusion Process: Finite Size Effects","263891625":"Generalized Exclusion Processes: Transport Coefficients","225945196":"An invariance principle for reversible Markov processes. Applications to random motions in random environments.J Stat Phys","226210656":"Driven Tracer Particle in One Dimensional Symmetric Simple Exclusion","46422757":"Single file diffusion of macroscopic charged particles","225284681":"Symmetric exclusion as a model of non-elliptic dynamical random\nconductances","2814732":"On the Hydrodynamic Equilibrium of a Rod in a Lattice Fluid","45902487":"A limit theorem for particle current in the symmetric exclusion process","2135056":"Diffusive variance for a tagged particle in d ≤ 2 asymmetric simple exclusion","226982326":"Invariance principle for a solid-on-solid interface model","1885485":"One-dimensional Brownian particle systems with rank dependent drifts","47733484":"Concentration of measure for Brownian particle systems interacting through their ranks","231859428":"Single-file diffusion in periodic energy landscapes: The role of hydrodynamic interactions","275587931":"Hammersley\u0027s harness process: invariant distributions and height fluctuations","226917809":"Exclusion Processes with Degenerate Rates: Convergence to Equilibrium and Tagged Particle","2094885":"On the Hydrodynamic Equilibrium of a Rod in a Lattice Fluid","225897032":"Tracer diffusion in lattice gases","225595725":"Exact results for the 1D asymmetric exclusion process and KPZ fluctuations","279539177":"Distribution of the position of a driven tracer in a hardcore lattice gas","243356352":"Tracer diffusion in stochastic lattice gases","270223194":"On the equilibrium state of the one-dimensional near-symmetric simple exclusion process","253393756":"TOPICAL REVIEW: Critical phenomena and universal dynamics in one-dimensional driven diffusive systems with two species of particles","236946517":"Dynamics of Repulsion Processes","222682126":"Multi-species simple exclusion processes. Phys A","235930204":"Biased Tracer Diffusion in Hard-Core Lattice Gases: Some Notes on the Validity of the Einstein Relation","259695403":"Non-Markovian effects in the first-passage dynamics of obstructed tracer particle diffusion in one-dimensional systems","250665379":"Mathematical theory of queuing networks","227424219":"Tagged particle motion in a clustered random walk system. Stoch. Proc. Appl. 30, 225-252","49751215":"Mixing of diffusing particles","222674463":"Ideal gas approximation for a two-dimensional rarefied gas under Kawasaki dynamics","30017168":"Structure and Dynamics of Equilibrium and Non-Equilibrium Systems - Colloidal Suspensions in Confining Light Fields","275588407":"Relation between structure of blocked clusters and relaxation dynamics in kinetically constrained models","2216572":"On fractional Brownian motion limits in one dimensional nearest-neighbor symmetric simple exclusion","225225009":"Randomized polynuclear growth with a columnar defect","2369147":"Stretched Exponential Fixation In Stochastic Ising Models At Zero Temperature","262072058":"Large Deviations in Single File Diffusion","38361377":"Central Limit Theorems for Infinite Series of Queues and Applications to Simple Exclusion","2098505":"Flux Fluctuations in the One Dimensional Nearest Neighbors Symmetric Simple Exclusion Process","50353513":"T. E. Harris’ contributions to Interacting Particle Systems and Percolation","250173312":"A biased intruder in a dense quiescent medium: Looking beyond the force-velocity relation","239530538":"RANGE PROCESS","242078722":"Diffusive limit of a tagged particle in asymmetric simple exclusion processes","23716893":"Current and density fluctuations for interacting particle systems with anomalous diffusive behavior","43020008":"Diffusion of finite-sized hard-core interacting particles in a one-dimensional box: Tagged particle dynamics","222520127":"On diffusivity of a tagged particle in asymmetric zero-range dynamics","38360630":"Frank Spitzer\u0027s Pioneering Work on Interacting Particle Systems","48180829":"Large deviations for the current and tagged particle in 1D nearest-neighbor symmetric simple exclusion","38362827":"The Net Output Process of a System with Infinitely many Queues","263390513":"Universal Large Deviations for the Tagged Particle in Single File Motion","2708911":"Limit Theorems for Tagged Particles","237811108":"Asymmetric Simple Exclusion Processes","268650123":"Stochastic Comparisons of Density Profiles for the Road-Hog Process","38329794":"Equilibrium fluctuations for interacting Brownian particles","6524653":"Fractional diffusion interpretation of simulated single-file systems in microporous materials","26285057":"Strong Mobility in Weakly Disordered Systems","221668005":"How to squeeze the toothpaste back into the tube","38360541":"Current Fluctuations for the Asymmetric Simple Exclusion Process","262974776":"Exclusion Processes with Avalanches","1771136":"Distributional Limits for the Symmetric Exclusion Process","1895808":"A phase transition behavior for Brownian motions interacting through their ranks","23558395":"Single-file dynamics with different diffusion constants","24008947":"Current Fluctuations of the One Dimensional Symmetric Simple Exclusion Process with Step Initial Condition","222699483":"Nonequilibrium Central Limit Theorem for a Tagged Particle in Symmetric Simple Exclusion","268973718":"Interacting Particle Systems and Random Media: An Overview","272377500":"Asymptotic behavior of a tagged particle in the exclusion process on parallel lattices","227218218":"Self-diffusion in one-dimensional lattice gases in the presence of an external field, J. Stat. Phys. 38, 603-613","279347460":"Hydrodynamic Equation of Symmetric Simple Exclusion Processes","23678669":"Fluctuations of the empirical quantiles of independent Brownian motions","14797893":"The correlation structure of epidemic models","38329826":"Central limit theorem for additive functionals of reversible Markov processes and applications to simple exclusion, Commun. Math. Phys. 106, 1-19","225161153":"Scaling Limits of a Tagged Particle in the Exclusion Process with Variable Diffusion Coefficient","253365686":"Number of distinct sites visited by random walks in lattice gases","1861553":"Statistical properties of single-file diffusion front","235903648":"Active Transport in Dense Diffusive Single-File Systems","2098323":"A Dynamic One-Dimensional Interface Interacting with a Wall","275216350":"Analysis of Individual Cell Trajectories in Lattice-Gas Cellular Automaton Models for Migrating Cell Populations","247198727":"Poissonian Approximation for the Tagged Particle in Asymmetric Simple Exclusion","222744827":"Local equilibrium for a one dimensional zero range process","277170232":"Complex boundaries for the Totally Asymmetric Simple Exclusion process","26328623":"Kinetic theories of dynamics and persistent caging in a one-dimensional lattice gas","23315622":"Lévy flights in nonhomogeneous media: Distributed-order fractional equation approach","43020374":"Longest excursion of fractional Brownian motion: Numerical evidence of non-Markovian effects","236085982":"Impaired heme oxygenase-1 induction in the gastric antrum induces disruption of the interstitial cells of Cajal network in a rat model of streptozotocin-induced diabetes","46582548":"First-Passage Exponents of Multiple Random Walks","257690766":"Limit theorems for the position of a tagged particle in the stirring-exclusion process","38360733":"Clustering in the One-Dimensional Three-Color Cyclic Cellular Automaton","225883809":"Pointwise ergodic theorems for the symmetric exclusion process","227425108":"Equilibrium fluctuations for a driven tracer particle dynamics","24163244":"Power law Plya\u0027s urn and fractional Brownian motion","2099964":"Regularity of quasi-stationary measures for simple exclusion in\ndimension d \u003e\u003d 5","38361493":"Symmetric Exclusion Processes: A Comparison Inequality and a Large Deviation Result","1888963":"Phase transition in the two-component symmetric exclusion process with open boundaries","277723245":"Tagged Particle in Single-File Diffusion","13291815":"Tag diffusion in driven systems, growing interfaces, and anomalous fluctuations","259445401":"Meteor process on ${\\mathbb Z}^d$","235724028":"Asymmetric Particle Systems on ℝ","2337245":"Asymptotic Behavior Of A Tagged Particle In Simple Exclusion Processes","46180926":"Stochastic Models for Large Interacting Systems and Related Correlation Inequalities"},"index":894}