{"abs":"Color diffusion in a classical fluid composed of two species differingonly by color is intimately connected with the asymptotic behavior of trajectories of test particles in the equilibrium system. We investigate here such behavior in a one-dimensional system of hard points with densityp and velocities 1. Colliding particles reflect each other with probabilityp and pass through each other with probability 1 –p. We show that forp \u003e 0 the appropriately scaled trajectories ofn particles converge to p–1b(t)+ (1-p)(p)–1bj(t),j \u003d 1, ...,n. Theb(t),b j (t) are standard, independent Brownian motions. The common presence ofb(t) means that motions are not independent and hence that the macroscopic state of the colored system isnot in local equilibrium with respect to color.","title":"Self-diffusion for particles with stochastic collisions in one dimension","id":227095230,"url":"https://www.researchgate.net/publication/227095230_Self-diffusion_for_particles_with_stochastic_collisions_in_one_dimension","names":["C. Kipnis","Joel Lebowitz","E. Presutti","Herbert Spohn","Journal of Statistical Physics"],"references":{"226050635":"Microscopic basis for Fick\u0027s law of self-diffusion","38361917":"On the Effect of Collisions on the Motion of an Atom in $R^1$","38329133":"Nonequilibrium measures which exhibit a temperature gradient: Study of a model","243355223":"Solution de l\u0027equation de Boltzmann pour des batonnets durs unidimensionnels","265362365":"Diffusion with \"Collisions\" between Particles","243705209":"Kinetic Equations and Density Expansions: Exactly Solvable One-Dimensional System"},"citedIn":{"226346526":"Reaction-diffusion equations for interacting particle systems","45933279":"Energy Transfer and Joint Diffusion","238683740":"Bibliography on stable distributions, processes and related topics","226483255":"Microscopic derivation of a Markovian Master equation in a deterministic model of chemical reaction","226972781":"Persistent random walks in a one-dimensional random environment","38329826":"Central limit theorem for additive functionals of reversible Markov processes and applications to simple exclusion, Commun. Math. Phys. 106, 1-19","225805050":"Self-diffusion as an example for the hydrodynamic limit","247554158":"Small deviations from local equilibrium for a process which exhibits hydrodynamical behavior. I","13392931":"Finite hard-rod systems and their thermodynamic limit: Survey of methods and results","238658966":"Phase Diagram of a Partially Asymmetric Exclusion Model with Open Boundaries: Numerical Study","231082550":"Exact solution of a 1D asymmetric exclusion model using a matrix formulation. J. Phys. A 26, 1493-1517","225641602":"Diffusions and random walks in random media","226050635":"Microscopic basis for Fick\u0027s law of self-diffusion","290042173":"Phase diagram of a partially asymmetric exclusion model with open boundaries: Numerical study","225400795":"The effect of mixture lengths of vehicles on the traffic flow behaviour in one-dimensional cellular automaton","243356822":"Correlated motion of two particles in a dense fluid of hard rods","228013741":"On the time evolution of macroscopic systems","225945196":"An invariance principle for reversible Markov processes. Applications to random motions in random environments.J Stat Phys","225116240":"A simulation study of an asymmetric exclusion model with open and periodic boundaries for parallel dynamics","2348189":"Diffusive Behavior Of Interacting Particle Systems."},"index":895}