{"abs":"I developed a spectrum synthesis method to investigate the physical properties of hot OB main sequence (MS) stars, which are often rapid rotators. The code realistically simulates the surface conditions of rapidly rotating stars, considering the rotationally-deformed stellar shape and gravity darkening effect. Comparing the synthesized absorption line profiles (of He I ll4026, 4387, 4471 and Mg II l4481) with the observed spectra of the member stars of 19 young Galactic clusters, I determined the projected rotational velocities of 496 stars. The average surface temperature and gravity for most of these objects were then derived from Hg line fits. The polar gravity of each star was estimated as a good indicator of the evolutionary status of the star. The derived parameters show that massive rotators spin down during their MS phase. The He abundance data (measured by fitting the He I lines) also favor the theoretical prediction that rotationally-induced mixing can gradually enrich the surface helium abundance through the MS phase. A quicker spin-down is evident in the lower mass star group where a large portion of helium peculiar stars are found. This correlation implies that strong stellar magnetic fields may exist on the surface of these lower mass stars. The same method is also applied to interferometric observations from the CHARA Array of a nearby rapid rotator, Regulus. By combining results from spectroscopic and interferometric analysis, the shape, space orientation, mass, and surface temperature distribution of Regulus are firmly determined. This analysis provides the first evidence of the gravity darkening phenomenon among stars that are not components of an eclipsing binary system. The surprisingly high luminosity determined for Regulus appears to agree with the theoretical prediction that rapid rotator can become more luminous as rotationally-induced mixing brings fresh hydrogen down to the core. Finally I present an extension of the model that simulates the shape, velocity, and temperature variations of a star experiencing nonradial pulsation. I simulated and analyzed the line profile variations in the spectra of e Per, a B0.7 III star with strong evidence of nonradial pulsation (NRP). A comparison of the model simulations and observations indicates that the pulsations of e Per have a corresponding local temperature variation that is out of phase with the radial oscillation (a non-adiabatic phase lag).","title":"Spectral line synthesis for hot stars","id":241463844,"url":"https://www.researchgate.net/publication/241463844_Spectral_line_synthesis_for_hot_stars","names":["Wenjin Huang"],"references":{},"citedIn":{"225653394":"Characteristics of Anthropogenic Sulfate and Carbonaceous Aerosols over East Asia: Regional Modeling and Observation","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","225333059":"Helium in stellar atmospheres","230915070":"A practical approach to robust impulsive lag synchronization between different chaotic systems"},"index":896}