{"abs":"Updating the structural model of complex structures is time-consuming due to the large size of the finite element model (FEM). Using conventional methods for these cases is computationally expensive or even impossible. A two-level method, which combined the Kriging predictor and the component mode synthesis (CMS) technique, was proposed to ensure the successful implementing of FEM updating of large-scale structures. In the first level, the CMS was applied to build a reasonable condensed FEM of complex structures. In the second level, the Kriging predictor that was deemed as a surrogate FEM in structural dynamics was generated based on the condensed FEM. Some key issues of the application of the metamodel (surrogate FEM) to FEM updating were also discussed. Finally, the effectiveness of the proposed method was demonstrated by updating the FEM of a real arch bridge with the measured modal parameters.","title":"Model Updating of Complex Structures Using the Combination of Component Mode Synthesis and Kriging Predictor","id":260842977,"url":"https://www.researchgate.net/publication/260842977_Model_Updating_of_Complex_Structures_Using_the_Combination_of_Component_Mode_Synthesis_and_Kriging_Predictor","names":["Yang Liu","Yan Li","Dejun Wang","Shaoyi Zhang","The Scientific World Journal"],"references":{"266196888":"Plane Answers to Complex Questions: The Theory of Linear Models","234488828":"Improved Component-Mode Representation for Structural Dynamic Analysis","245893283":"Designs for Computer Experiments","254042923":"Use of Kriging Models to Approximate Deterministic Computer Models","244456834":"Cross-Validation of Regression Models","239061034":"Model Updating In Structural Dynamics: A Survey","240205958":"Rate of change of eigenvalues and 797 eigenvectors","260048536":"Finite-element model updating using experimental test data: Parametrization and regularization","250696744":"Component mode synthesis for large-scale structural eigenanalysis","261656580":"The 2 k — p Fractional Factorial Designs","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","280939936":"\u0027On the Experimental Attainment Optimum Conditions\u0027","23858510":"Rates of change of eigenvalues and eigenvectors. AIAA J 6:2426-2429","38363114":"Titterington, D.M.: Neural Networks: A Review from a Statistical Perspective. Statistical Science 9(1), 2-54","245315385":"A Review of: “Experiments: Planning, Analysis, and Parameter Design Optimization”","239063319":"FE Model Updating in Structural Dynamics","242595292":"Springer Series in Statistics","238212185":"Coupling of substructures for dy-namic analysis","245420622":"Coupling of substructures for dynamic analysis. AIAA J","286387262":"The 2k-p fractional factorial designs","266217389":"Principles of Statistical Inference","216301661":"Screening, Predicting, and Computer Experiments","23826769":"A Lanczos eigenvalue method on a parallel computer","38363122":"[Neural Networks: A Review from Statistical Perspective]: Rejoinder","23596822":"An Eigensystem Realization Algorithm for Modal Parameter Identification and Model Reduction"},"citedIn":{"276242165":"Multi-Direction Bridge Model Updating Using Static and Dynamic Measurement","282163113":"A novel finite element model updating method based on substructure and response surface model","283744244":"Performance parameter optimization of excavator cab shock absorbers based on Kriging method"},"index":907}