{"abs":"Two new heuristic models are developed for motion planning of point robots in known environments. The first model is a combination of an improved particle swarm optimization (PSO) algorithm used as a global planner and the probabilistic roadmap (PRM) method acting as a local obstacle avoidance planner. For the PSO component, new improvements are proposed in initial particle generation, the weighting mechanism, and position- and velocity-updating processes. Moreover, two objective functions which aim to minimize the path length and oscillations, govern the robot’s movements towards its goal. The PSO and PRM components are further intertwined by incorporating the best PSO particles into the randomly generated PRM. The second model combines a genetic algorithm component with the PRM method. In this model, new specific selection, mutation, and crossover operators are designed to evolve the population of discrete particles located in continuous space. Thorough comparisons of the developed models with each other, and against the standard PRM method, show the advantages of the PSO method.","title":"Multi-objective robot motion planning using a particle swarm optimization model","id":220479978,"url":"https://www.researchgate.net/publication/220479978_Multi-objective_robot_motion_planning_using_a_particle_swarm_optimization_model","names":["Ellips Masehian","D. Sedighizadeh","Journal of Zhejiang University: Science C"],"references":{"223255055":"A modified particle swarm optimization for economic dispatch with non-smooth cost functions","4109181":"Path planning for mobile robot using the particle swarm optimization with mutation operator","4041400":"Extracting optimal paths from roadmaps for motion planning","236235921":"Particle swarm optimization. ISTE","232657048":"Using Genetic Algorithm for a Mobile Robot Path Planning","247161853":"Robot Motion Planning","221006372":"Efficient and Safe Path Planning for a Mobile Robot Using Genetic Algorithm","2639200":"Rapidly-Exploring Random Trees: A New Tool for Path Planning","4184500":"Obstacle avoidance with multi-objective optimization by PSO in dynamic environment","220566702":"Gross Motion Planning - A Survey.","251857416":"Path Planning For Mobile Robot Based on Particle Swarm Optimization","3585405":"Generation of collision-free paths, a genetic approach","4355150":"A new algebraic method for robot motion planning and real geometry","247116854":"Particle swarm optimization with fuzzy adaptive inertia weight","224773224":"Principles of robot motion: Theory, algorithms, and implementations. MIT Press, Cambridge, MA","24112738":"Repulsive Particle Swarm Method on Some Difficult Test Problems of Global Optimization","3418746":"Chaotic sequences to improve the performance of evolutionary algorithms","3344482":"Path planning with multiple objectives","224677110":"Smooth Path Planning of a Mobile Robot Using Stochastic Particle Swarm Optimization","224585718":"Optimal Trajectory of A Mobile Robot by a Genetic Design Fuzzy Logic Controller","220421366":"An Algorithm for Planning Collision Free Paths Among Polyhedral Obstacles","220870898":"Multi-Objective Optimal Trajectory Planning of Space Robot Using Particle Swarm Optimization","3503661":"Robot programming with a genetic algorithm","232636806":"Path Planning for Mobile Robot Based on Chaos Genetic Algorithm","232614854":"Visibility-polygon search and euclidean shortest paths","235890196":"A Comparison of Particle Swarm Optimization and the Genetic Algorithm","220849655":"Path Planning for Mobile Robots in Dynamic Environments Using Particle Swarm Optimization","220474555":"Multiobjective Navigation of a Guide Mobile Robot for the Visually Impaired Based on Intention Inference of Obstacles","3979164":"A Voronoi method for the piano-movers problem","4294243":"Real-time Obstacle Avoidance Strategy for Mobile Robot Based On Improved Coordinating Potential Field with Genetic Algorithm","3298646":"Probabilistic Roadmaps for Path Planning in High-Dimensional Configuration Spaces","3979224":"Real-time obstacle avoidance for manipulators and mobile robots. Int J Robot Res 5:90-98","284741022":"Minimum Decompositions of Polygonal Objects","221006278":"Robot Path Planning in Uncertain Environments Based on Particle Swarm Optimization","224441613":"High-Quality Path Planning for Autonomous Mobile Robots with eta(3)-Splines and Parallel Genetic Algorithms","220981830":"Optimum Path Planning for Mobile Robots Based on a Hybrid Genetic Algorithm.","247343827":"Real-Time Obstacle Avoidance System for Manipulators and Mobile Robots","220648392":"A Voronoi diagram-visibility graph-potential field compound algorithm for robot path planning","239552565":"The Complexity of Robot Motion Planning","3267267":"A Particle Swarm Optimization for Economic Dispatch With Nonsmooth Cost Functions","249714449":"Classic and Heuristic Approaches in Robot Motion Planning - A Chronological Review","3344960":"Roadmap-Based Path Planning - Using the Voronoi Diagram for a Clearance-Based Shortest Path","4113354":"Path planning for a mobile robot using genetic algorithms","3604419":"Robotic Motion Planning by Genetic Algorithm with Fuzzy Critic","273453883":"Particle Swarm Optimization","3604428":"Integration of the artificial potential field approach with simulated annealing for robot path planning","221503688":"Robot Path Planning using Particle Swarm Optimization of Ferguson Splines","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization."},"citedIn":{"281753563":"Solving the multi-objective path planning problem in mobile robotics with a firefly-based approach","261195968":"Based on Tabu Search and Particle Swarm Optimization Algorithms Solving Job Shop Scheduling Optimization Problems","278397004":"Performance-driven assignment and mapping for reliable networks-on-chips","282839006":"Multi-objective Trajectory Planning of FFSM Carrying a Heavy Payload","261460946":"Robot path planning in an environment with many terrains based on interval multi-objective PSO","281297987":"Load maximization trajectory optimization for free-floating space robot using multi-objective particle swarm optimization algorithm","279314223":"MOSFLA-MRPP: Multi-Objective Shuffled Frog-Leaping Algorithm applied to Mobile Robot Path Planning","268025077":"Multi-objective optimization grasping planning for multifingered robot hand"},"index":909}