{"abs":"The global sensitivity analysis of a complex numerical model often calls for the estimation of variance-based importance measures, named Sobol\u0027 indices. Metamodel-based techniques have been developed in order to replace the cpu time-expensive computer code with an inexpensive mathematical function, which predicts the computer code output. The common metamodel-based sensitivity analysis methods are well-suited for computer codes with scalar outputs. However, in the environmental domain, as in many areas of application, the numerical model outputs are often spatial maps, which may also vary with time. In this paper, we introduce an innovative method to obtain a spatial map of Sobol\u0027 indices with a minimal number of numerical model computations. It is based upon the functional decomposition of the spatial output onto a wavelet basis and the metamodeling of the wavelet coefficients by the Gaussian process. An analytical example is presented to clarify the various steps of our methodology. This technique is then applied to a real hydrogeological case: for each model input variable, a spatial map of Sobol\u0027 indices is thus obtained.","title":"Global sensitivity analysis for models with spatially dependent outputs","id":45882790,"url":"https://www.researchgate.net/publication/45882790_Global_sensitivity_analysis_for_models_with_spatially_dependent_outputs","names":["Amandine Marrel","Bertrand Iooss","Michel Jullien","Béatrice Laurent","Elena Volkova","Environmetrics"],"references":{"222707783":"Global sensitivity analysis of computer models with functional inputs","50193599":"Mise en oeuvre et exploitation du métamodèle processus gaussien pour l\u0027analyse de modèles numériques—Application à un code de transport hydrogéologique","225197743":"Wavelet-vaguelette decomposition of spatiotemporal random fields","5207179":"Bayesian inference for the uncertainty distribution of computer model outputs. Biometrika","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","220650094":"Sensitivity analysis of spatial models","260278602":"Design and Modeling for Computer Experiments","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","228077459":"Geostatistics: Modeling Spatial Uncertainty. Wiley, New York","267437693":"Geostatistic: Modeling Spatial Uncertainty","2335212":"Bayesian Inference for the Uncertainty Distribution","254042923":"Use of Kriging Models to Approximate Deterministic Computer Models","38363487":"The Design and Analysis of Computer Experiments","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","234372399":"Knowledge Discovery in Aerodynamic Design Space for Flyback-Booster Wing Using Data Mining","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","245078917":"Importance Measures in Global Sensitivity Analysis of Nonlinear Models","2737289":"The Vaguelette-Wavelet Decomposition Approach To Statistical Inverse Problems","45893917":"Numerical studies of the metamodel fitting and validation processes","250754768":"9 Computer experiments","227576371":"Sensitivity Analysis","2791753":"Wavelet Decomposition Approaches to Statistical Inverse Problems","227124398":"Rehabilitation of the radioactively contaminated objects and territory of the Russian Science Center Kurchatov Institute","222197462":"Uncertainty and Sensitivity Analysis Techniques for Use in Performance Assessment for Radioactive Waste Disposal","245079217":"Sensitivity analysis when model outputs are functions","4742946":"Computer Model Calibration Using High-Dimensional Output","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","1899891":"Computer model validation with functional output","222402096":"Making best use of model evaluations to compute sensitivity indices. Comput Phys Commun","223457440":"Multivariate global sensitivity analysis for dynamic crop models","222689332":"A Methodology for Fitting and Validating Metamodels in Simulation","227805863":"Statistical sensitivity analysis of packed column reactors for contaminated wastewater","225502020":"Global sensitivity analysis for a numerical model of radionuclide migration from the RRC “Kurchatov Institute” radwaste disposal site","220257174":"Variance based sensitivity analysis of model output. Design and estimator for the total sensitivity index. Comput Phys Commun","38358705":"The Jackknife Estimate of Variance","267107923":"Case Studies in Environmental Statistics","7075602":"Model Selection For Geostatistical Models","248403063":"Wavelet Toolbox User s Guide","216301661":"Screening, Predicting, and Computer Experiments","242868867":"The computer experience","222427005":"Calculations of Sobol indices for the Gaussian process metamodel","4749622":"An efficient methodology for modeling complex computer codes with Gaussian processes","6015460":"Gaussian Process Functional Regression Modeling for Batch Data"},"citedIn":{"281808457":"Stochastic simulators based optimization by Gaussian process metamodels - Application to maintenance investments planning issues","258387246":"Understanding Crop Response to Climate Variability with Complex Agroecosystem Models","235932824":"Dynamic sensitivity analysis of long-running landslide models through basis set expansion and meta-modelling","263055270":"Neural Network─Based Sensitivity Analysis of Summertime Convection over the Continental United States","236159069":"Sensitivity analysis of computer models","45341244":"Revue sur l\u0027analyse de sensibilité globale de modèles numériques","273193753":"Large-scale Impact of CO2 Storage Operations: Dealing with Computationally Intensive Simulations for Global Sensitivity Analysis","235932802":"A meta-modelling strategy to identify the critical offshore conditions for coastal flooding","261512645":"A Review on Global Sensitivity Analysis Methods","262209400":"Spatially-explicit sensitivity analysis of an agent-based model of land use change","257550080":"An approach for global sensitivity analysis of a complex environmental model to spatial inputs and parameters: A case study of an agro-hydrological model","248607627":"Computer experiments with functional outputs: Global sensitivity analysis and metamodeling","264006115":"Multi-scale spatial sensitivity analysis of a model for economic appraisal of flood risk management policies","288687061":"Spatial Global Sensitivity Analysis of High Resolution classified topographic data use in 2D urban flood modelling","47386033":"Screening and metamodeling of computer experiments with functional outputs. Application to thermal-hydraulic computations","257550842":"Reduced order models for many-query subsurface flow applications","281778222":"The Volatility of Data Space: Topology Oriented Sensitivity Analysis","256610275":"Characterisation factors for life cycle impact assessment of sound emissions","224965441":"Detecting Aircraft With a Low-Resolution Infrared Sensor","283621709":"The Complexities of Agent-Based Modeling Output Analysis","260520106":"Combining meta-modeling and categorical indicators for global sensitivity analysis of long-running flow simulators with spatially dependent inputs","261475640":"Spatially-explicit integrated uncertainty and sensitivity analysis of criteria weights in multicriteria land suitability evaluation","260233004":"Spatial and temporal variability of in-stream water quality parameter influence on dissolved oxygen and nitrate within a regional stream network","259996108":"Global Sensitivity Analysis for multivariate output using Polynomial Chaos Expansion","256720185":"Change of Support in Spatial Variance-Based Sensitivity Analysis","268817657":"Development of a surrogate model and sensitivity analysis for spatio-temporal numerical simulators","274572771":"Partial validation of cellular automata based model simulations of urban growth: An approach to assessing factor influence using spatial methods"},"index":915}