{"abs":"We test globally corrected hybrid updating algorithms for various lattice theories: a chain of coupled harmonic oscillators, pure SU(3) theory, and QCD with four flavors of dynamical staggered quarks. Systematic errors, acceptance, and time correlations are studied as functions of discretization step size, momentum refreshing frequency, volume, coupling and fermion-matrix-inversion residue.","title":"Tests of globally corrected hybrid updating","id":13330565,"url":"https://www.researchgate.net/publication/13330565_Tests_of_globally_corrected_hybrid_updating","names":["H Gausterer","S Sanielevici","Physical review D: Particles and fields"],"references":{"13330569":"Tuning the hybrid Monte Carlo algorithm","222018937":"Hybrid Monte Carlo","13331273":"Testing an exact algorithm for simulation of fermionic QCD","258091296":"Finite-Temperature Phase Transitions in SU(3) Lattice Gauge Theory with Dynamical, Light Fermions","13333352":"Langevin simulation of lattice field theories. Phys. Rev. D 32, 2736","13333608":"Fast algorithm for Monte Carlo simulations of systems with fermions","223932187":"Stochastic quantization versus the microcanonical ensemble: Getting the best of both worlds","200105001":"Equation of State by Fast Computing Machines","223037294":"A numerical study of Langevin QCD with dynamical quarks","29512773":"A proposal for Monte Carlo simulations of fermionic systems","13331680":"Numerical tests of Langevin lattice QCD","13256705":"Comparison of an Exact Fermion Monte Carlo Algorithm with the Pseudofermion Method Using Staggered Fermions","13257569":"Langevin Simulation Including Dynamical Quark Loops","13255494":"Clear Evidence for a First-Order Chiral Transition in QCD","13331261":"Hybrid-molecular-dynamics algorithms for the numerical simulation of quantum chromodynamics","13257853":"Hybrid Stochastic Differential Equations Applied to Quantum Chromodynamics","222729054":"Monte Carlo integration for lattice gauge theories with fermions. Phys. Lett. B 99, 333","13333009":"Reducing the number of flavors in the microcanonical method","13348759":"New algorithm for the numerical simulation of fermions","258090109":"Method for Performing Monte Carlo Calculations for Systems with Fermions"},"citedIn":{"243352481":"Monte Carlo algorithms for QCD","13330569":"Tuning the hybrid Monte Carlo algorithm","222470694":"Multi-grid Monte Carlo (III). Two-dimensional O(4)-symmetric non-linear σ-model","238947256":"Trying to understand the QCD phase transition(s)","13277506":"Multigrid Monte Carlo method. Conceptual foundations","13328994":"Biased Monte Carlo algorithms on unitary groups","223194918":"Lattice gauge theories and Monte Carlo algorithms","243268115":"Breaking of chiral symmetry in compact QED in the strong coupling limit","222622057":"Lattice QCD simulations beyond the quenched approximation","256600698":"Multi-grid Monte Carlo (II). Two-dimensional XY model","13329150":"Higher-order discretizations and the Metropolis step","223119833":"How to beat critical slowing-down: 1990 update","13277591":"Remarks on global Monte Carlo algorithms","13275252":"Comparison of exact hybrid and Langevin algorithms for QCD with Kogut-Susskind fermions","222717720":"The Hybrid Monte Carlo algorithm on parallel computers"},"index":918}