{"abs":"We apply the hybrid Monte Carlo algorithm to pure gauge QCD and to QCD with four flavors of staggered dynamical fermions. We show how the acceptance in the global Metropolis step depends upon the parameters of the algorithm. By tuning the values of the coupling constants in the algorithm to be different from those in the global Metropolis step, we find that the acceptance can be kept large without having to make the step size prohibitively small. We give an analytic discussion of the tuning, and argue that the algorithm requires computer time growing proportional to V5/4.","title":"Tuning the hybrid Monte Carlo algorithm","id":13330569,"url":"https://www.researchgate.net/publication/13330569_Tuning_the_hybrid_Monte_Carlo_algorithm","names":["Rajan Gupta","GW Kilcup","Stephen R. Sharpe","Physical review D: Particles and fields"],"references":{"13330570":"Finite-temperature transition for QCD with heavy quarks","222018937":"Hybrid Monte Carlo","13333352":"Langevin simulation of lattice field theories. Phys. Rev. D 32, 2736","223932187":"Stochastic quantization versus the microcanonical ensemble: Getting the best of both worlds","13331471":"Empirical study of the hybrid-molecular-dynamics approach to the simulation of QCD","200105001":"Equation of State by Fast Computing Machines","235588835":"Lattice gauge theory in the microcanonical ensemble","222461641":"The theory of hybrid stochastic algorithms","13330566":"Global Monte Carlo algorithms for many-fermion systems","13330565":"Tests of globally corrected hybrid updating","243471149":"Microcanonical Simulation of Fermionic Systems","13331261":"Hybrid-molecular-dynamics algorithms for the numerical simulation of quantum chromodynamics","13257853":"Hybrid Stochastic Differential Equations Applied to Quantum Chromodynamics","13348759":"New algorithm for the numerical simulation of fermions","13330964":"Chiral-symmetry breaking in lattice QCD with two and four fermion flavors"},"citedIn":{"222281277":"Complex zeros of the partition function for lattice QCD","1990811":"Full QCD on APE100 Machines","222698944":"Performance studies of the two-step multiboson algorithm in compact lattice QED","226762755":"An investigation of the 2D attractive Hubbard model","13277506":"Multigrid Monte Carlo method. Conceptual foundations","13277507":"QCD with dynamical Wilson fermions","222337609":"A comparison of numerical algorithms for dynamical fermions","252099724":"Higher order hybrid Monte Carlo","256600897":"Complex zeros of the partition function for compact lattice QED","222455245":"The acceptance probability in the hybrid Monte Carlo method. Phys. Lett. B 242, 437","258987902":"Hadron spectrum in QCD at 6/g2\u003d5.6","29523027":"Dynamical critical properties of the Hybrid Monte Carlo algorithm","13323994":"Observation of a two-stage melting transition in two dimensions","222559825":"HMC algorithm with multiple time scale integration and mass preconditioning","220418231":"Hybrid Monte Carlo: An Efficient Algorithm for Condensed Matter Simulation.","223119833":"How to beat critical slowing-down: 1990 update","37990484":"Study of instanton physics in lattice QCD","229540277":"Hybrid Monte Carlo simulations theory and initial comparison with molecular dynamics","222493017":"Chronological inversion method for the Dirac matrix in hybrid Monte Carlo","222862548":"Hamiltonian evolution for the hybrid Monte Carlo algorithm","1987330":"Polynomial Hybrid Monte Carlo algorithm for lattice QCD with an odd number of flavors","243352481":"Monte Carlo algorithms for QCD","222459618":"Hybrid Molecular Dynamics for lattice supersymmetry","259186003":"Testing and tuning symplectic integrators for Hybrid Monte Carlo algorithm in lattice QCD","243352613":"Some recent results on lattice fermions","225608278":"Dynamical fermions","239667564":"Acceptances and autocorrelations in hybrid Monte Carlo","222449508":"Critique of practical methods for computer evaluation of the hadron spectrum","222015900":"Introduction to algorithms for Monte Carlo simulations and their application to QCD","13328994":"Biased Monte Carlo algorithms on unitary groups","235565475":"Hadron spectrum in QCD at 6/g^{2}\u003d 5.6","222468841":"Hybrid Monte Carlo and topological modes of full QCD","222622057":"Lattice QCD simulations beyond the quenched approximation","256600698":"Multi-grid Monte Carlo (II). Two-dimensional XY model","1990703":"Measure of Autocorrelation Times of Local Hybrid Monte Carlo Algorithm for Lattice QCD","1799464":"Grazing Incidence Optics for Wide-field X-ray Survey Imaging: A Comparison of Optimization Techniques","13329150":"Higher-order discretizations and the Metropolis step","231023088":"Two Algorithms and Lattice U(1) Model","238906763":"Determining the nature of the finite temperature transition of QCD with dynamical fermions","242329161":"Lattice gauge action suppressing near-zero modes of HW","29522811":"A generalized guided Monte Carlo algorithm","222524792":"Exploring the HMC trajectory-length dependence of autocorrelation times in lattice QCD","13275255":"QCD with dynamical Wilson fermions. II","13275252":"Comparison of exact hybrid and Langevin algorithms for QCD with Kogut-Susskind fermions","1992224":"Decorrelating the topology in full QCD","13330570":"Finite-temperature transition for QCD with heavy quarks","7173676":"Testing and tuning symplectic integrators for the hybrid Monte Carlo algorithm in lattice QCD.","1993949":"Choice of Integrator in the Hybrid Monte Carlo Algorithm","222635265":"QED — A lattice investigation of the chiral phase transition and the nature of the continuum limit","222497413":"Full QCD with the Lüscher local bosonic action","222303367":"Critical dynamics of the Hybrid Monte Carlo algorithm","13288578":"Hybrid Monte Carlo method for Condensed-Matter Systems","35661164":"The step scaling function of QCD at negative flavor number [Elektronische Ressource] /","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","13330566":"Global Monte Carlo algorithms for many-fermion systems","223402525":"Status of lattice gauge theory calculations","13330565":"Tests of globally corrected hybrid updating","234201253":"Physics Goals of the QCD Teraflop Project","13229592":"Computer Simulation Study of the Melting Transition in Two Dimensions","2047053":"Monte Carlo studies of the IIB matrix model at large N","253738060":"Dynamics of Langevin Simulations","222443669":"Hybrid Monte Carlo algorithm as applied to dynamical Wilson fermion","40825273":"The finite temperature phase transition in four flavour QCD on an 8×12 3 lattice","256625171":"Hybrid Monte Carlo simulation of four flavour QCD at finite temperature","1987522":"The step scaling function of QCD at negative flavor number","13277591":"Remarks on global Monte Carlo algorithms","255212139":"Extracting F π from small lattices: Unquenched results","222474652":"Progress in Lattice Field Theory Algorithms","1990720":"The Kramers equation simulation algorithm I. Operator analysis","51913798":"Large-N reduction in QCD with two adjoint Dirac fermions","238947169":"Simulating QCD with dynamical Wilson and staggered fermions","1990398":"Global Demons in Field Theory : Critical Slowing Down in the Xy Model","1990910":"Hybrid Monte Carlo Simulation of Polymer Chains","230991524":"Numerical simulations in particle physics","1741435":"2+1 Flavor Lattice QCD toward the Physical Point","222470694":"Multi-grid Monte Carlo (III). Two-dimensional O(4)-symmetric non-linear σ-model","228571511":"Bayesian Adaptive Hamiltonian Monte Carlo with an Application to High-Dimensional BEKK GARCH Models","223194918":"Lattice gauge theories and Monte Carlo algorithms","3676499":"Lattice QCD: Commercial vs. Home-Grown Parallel Computers","220359113":"Status and prospects of the computational approach to high-energy physics","1986415":"Instability in the Molecular Dynamics Step of Hybrid Monte Carlo in Dynamical Fermion Lattice QCD Simulations","243352437":"Looking for the effects of dynamical quarks","260846328":"The Theory of Hybrid Stochastic Algorithms","13270460":"Lee-Yang zeros and the chiral phase transition in compact lattice QED","243207816":"Coarse grid Yukawa interaction for staggered fermions","235558525":"Kramers equation simulation algorithm. II. Application to the Gross-Neveu model","229226323":"First results from the third-generation Columbia parallel processor","13250356":"Higher-order hybrid Monte Carlo algorithms"},"index":925}