{"abs":"Let T be a two-dimensional region, and let X be a surface dejined on T. The values of X on T, constitute an image, or pattern. The true value of X at any point on T cannot be directly observed, but data can be recorded which provide information about X. The aim is to reconstruct X using the prior knowledge that X will vary smoothly over most of T, but may exhibit jump discontinuities over line segments. This information can be incorporated via Bayes\u0027 theorem, using a polygonal Markov random field on T as prior distribution. Under this continuum model, X may in principle be estimated according to standard criteria. In practice, the techniques rely on simulation of the posterior distribution. A natural family of conjugate priors is identified, and a class of spatial-temporal Markov processes is constructed on the uncountable state space; simulation then proceeds by a method of analogous to the Gibbs sampler.","title":"Reconstruction of polygonal images","id":243043807,"url":"https://www.researchgate.net/publication/243043807_Reconstruction_of_polygonal_images","names":["Peter Clifford","R. D. Middleton","Journal of Applied Statistics"],"references":{"38365640":"A Random Set Process in the Plane with a Markovian Property","7200078":"Random Polygons Determined by Random Lines in a Plane: I","200105001":"Equation of State by Fast Computing Machines","200622065":"Equation of State Calculations by Fast Computing Machines","227063907":"Markov fields with polygonal realizations","23916737":"Measuring the sea ice floe distribution","246868729":"Monte Carlo Calculations of the Radial Distribution Functions for a Proton?Electron Plasma","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","232128993":"Stochastic Geometry and Its Application","248511285":"On the Distinction Between the Conditional Probability and the Joint Probability Approaches in the Specification of Nearest-Neighbour Systems","244426187":"Exact MAP estimation for binary images","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","254206745":"Aggregation and refinement in binary image restoration"},"citedIn":{"266252348":"Locally Specified Polygonal Markov Fields for Image Segmentation","3078922":"Stochastic processes that generate polygonal and related random fields","259556220":"Discrete Multicolour Random Mosaics with an Application to Network Extraction","229088078":"MCMC in image analysis","227498630":"Disagreement Loop and Path Creation/Annihilation Algorithms for Binary Planar Markov Fields with Applications to Image Segmentation","243776875":"Spatial Statistics and Bayesian Computing","241872570":"Applications of Stochastic Geometry in Image Analysis","266216940":"A Spatial Markov Property for Nearest-Neighbour Markov Point Processes","225934245":"Consistent Polygonal Fields","243043944":"Markov models and Bayesian methods in image analysis","221355941":"An Algorithm for Binary Image Segmentation Using Polygonal Markov Fields","229181471":"Parallel Version of Image Segmentation Algorithm Using Polygonal Markov Fields","254759865":"An introduction to planar random tessellation models","227684392":"Markov Random Fields with Higher‐order Interactions","24052917":"Image segmentation by polygonal Markov Fields","223966947":"Multi-colour random fields with polygonal realisations","2355288":"Markov chain Monte Carlo in image analysis","2118555":"A polyhedral Markov field - pushing the Arak-Surgailis construction into three dimensions","4789234":"Perfect Simulation for Length-interacting Polygonal Markov Fields in the Plane"},"index":932}