{"abs":"We give a simple explanation of the Swendsen-Wang algorithm for Potts models in terms of a joint model of Potts spin variables interacting with bond occupation variables. We then show how to generalize this representation, as well as the corresponding Monte Carlo algorithm, to arbitrary models. We give initial results of tests of the new algorithm on the two-dimensional XY model.","title":"Generalization of the Fortuin-Kasteleyn-Swendsen-Wang representation and Monte Carlo algorithm. Phys. Rev. D 38: 2009-2012","id":13330658,"url":"https://www.researchgate.net/publication/13330658_Generalization_of_the_Fortuin-Kasteleyn-Swendsen-Wang_representation_and_Monte_Carlo_algorithm_Phys_Rev_D_38_2009-2012","names":["Robert G. Edwards","AD Sokal","Physical review D: Particles and fields"],"references":{"253517661":"Erratum: The Potts model","13251951":"Lattice field theory as a percolation process","13256204":"Multigrid Monte Carlo Method for Lattice Field Theories","241508674":"Critical behaviour of an isotropic spin system. I","224509449":"Dynamical critical exponent of the 3D Ising model","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","235502311":"Dynamic critical exponent z in some two-dimensional models","258277328":"Critical dynamics of the four-state Potts model","13353662":"Dynamic correlations in the three-dimensional Ising model","13346588":"Critical behavior of a new class of statistical-mechanical models with continuous variables and discretely valued interactions","243621149":"On the random-cluster model III. The simple random-cluster model","226797020":"Sokal, A.D.: The pivot algorithm: A highly efficient Monte Carlo method for the self-avoiding walk. J. Stat. Phys.50, 109-186","226682143":"Discontinuity of the Magnetization in One-Dimensional 1~Ix _y[2 Ising and Potts Models","13251989":"Simulations without critical slowing down","222771928":"On the random-cluster model II. The percolation model"},"citedIn":{"2142752":"Phase transition and percolation in Gibbsian particle models","225384299":"Slab percolation for the Ising model","51931933":"Tethered Monte Carlo: Managing Rugged Free-Energy Landscapes with a Helmholtz-Potential Formalism","222454084":"High precision renormalization group study of the roughening transition","265369049":"Slice sampling. (With discussions and rejoinder)","2613294":"Gibbs states of graphical representations of the Potts model with external fields. J. Math. Phys. 41: 1170-1210","227314565":"Dynamic critical behavior of the Swendsen-Wang algorithm: The two-dimensional three-state Potts model revisited","38322242":"Coupling and Bernoullicity in random-cluster and Potts models","265675739":"Stochastic Geometric Methods in Statistical Mechanics","45863604":"Cooperative behaviour in complex systems","13324505":"Invaded cluster algorithm for Potts models, Phys","258542971":"Rugged free-energy landscapes in disordered spin systems","227130266":"A Percolation-theoretic Approach to Spin Glass Phase Transitions","225469285":"Stochastic Models as Tools for the Analysis of Decomposition and Crystallisation Phenomena in Solids","10842803":"Neuron recognition by parallel Potts segmentation","226946462":"The random-cluster model on a homogeneous tree","229790634":"Efficiency and Convergence Properties of Slice Samplers","267020790":"Spin glasses: Statics and dynamics, summer school, Paris, France, June 25 to July 6, 2007","2103869":"Separated-occurrence inequalities for dependent percolation and Ising models","2103870":"Lower bounds for boundary roughness for droplets in Bernoulli percolation","243043930":"Multiple-site updates in maximum a posteriori and marginal posterior modes image estimation","2759693":"Monte Carlo Methods in Statistical Mechanics: Foundations and New Algorithms","1824306":"Chromatic Roots are Dense in the Whole Complex Plane","1950772":"Universal Amplitude Ratios in the Critical Two-Dimensional Ising Model on a Torus","225027392":"Entropy-Driven Phase Transition in Low-Temperature Antiferromagnetic Potts Models","228585396":"Strict inequality for phase transition between ferromagnetic and frustrated systems","222403434":"Dynamic critical behavior of the Swendsen–Wang algorithm for the three-dimensional Ising model","23314248":"Monte Carlo study of the triangular lattice gas with first- and second-neighbor exclusions","2676740":"Ordering, Slicing And Splitting Monte Carlo Markov Chains","233947100":"Rapid mixing of Swendsen-Wang dynamics in two dimensions","228458419":"The Conditional-Potts Clustering Model","237651973":"DISCUSSION PAPER EQUI-ENERGY SAMPLER WITH APPLICATIONS IN STATISTICAL INFERENCE AND STATISTICAL MECHANICS1,2,3","2106384":"Random Surfaces","231068151":"On the Kertész line: Thermodynamic versus Geometric Criticality","1866282":"Cluster Monte Carlo algorithms and their applications","13277426":"Dynamic critical behavior of Wolff\u0027s collective-mode Monte Carlo algorithm for the two-dimensional O(n) nonlinear model","38351475":"Entropy for translation-invariant random-cluster measures","2411039":"Mixing Properties of the Swendsen-Wang Process on the Complete Graph and Narrow Grids","38331509":"Strict inequality for critical values of Potts models and random-cluster processes","269286962":"Bayesian Analysis of Asymmetric Stochastic Conditional Duration Model","1940573":"The Potts Model Built on Sand","234109879":"Swendsen-Wang dynamics for Potts model on a dynamically triangulated random surface.","251222205":"Advanced Topics in MCMC","45894395":"Phase Separation in Random Cluster Models I: Uniform Upper Bounds on Local Deviation","2471522":"Graphical Representations For Ising Systems In External Fields","51958096":"First-Order Transition in Potts Models with \"Invisible\" States: Rigorous Proofs","13249158":"Rigorous lower bound on the dynamic critical exponents of the Swendsen-Wang algorithm","225613631":"Basic Ideas ofSpatial Statistics","222585611":"Cluster Monte Carlo Algorithms","230795150":"The critical temperature for the Ising model on planar doubly periodic\ngraphs","2775160":"On the possible failure of the Gibbs property for measures on lattice systems","1956431":"Dempster-Shafer clustering using Potts spin mean field theory","267751335":"Flowers, Forests and Fields in Physics","229316088":"Cluster algorithms for the generalized 3d, 3q Potts model","38351388":"Explicit Isoperimetric Constants and Phase Transitions in the Random-Cluster Model","259483425":"Crossing Probabilities in Topological Rectangles for the Critical Planar FK-Ising model","230975900":"Percolation in the random cluster process and Q-state Potts model","1946180":"Meta-analysis of the risks of hypertension and QTc prolongation in patients with advanced non-small cell lung cancer who were receiving vandetanib","2541692":"Mixing Properties And Exponential Decay For Lattice Systems In Finite Volumes","5915649":"Dynamic Critical Behavior of the Worm Algorithm for the Ising Model","228540865":"Aspects Of Spatial Statistics, Stochastic Geometry And Markov Chain Monte Carlo Methods","227185642":"On weak mixing in lattice models","51966330":"Topics on abelian spin models and related problems","251286174":"Fun with Hard Spheres","2102853":"Swendsen-Wang dynamics on Z^d for disordered non ferromagnetic systems","2141765":"The random geometry of equilibrium phases","273159213":"On the Ornstein–Zernike Behaviour for the Supercritical Random-Cluster Model on Zd, d≥3","6331398":"Microcanonical Approach to the Simulation of First-Order Phase Transitions","5127721":"Metropolis Algorithm and equienergy sampling for two mean field spin systems","2118731":"The multivariate Tutte polynomial (alias Potts model) for graphs and matroids","221498718":"Mixing Time Power Laws at Criticality","251272343":"Stochastic Geometry of Classical and Quantum Ising Models","51916662":"A power law of order 1/4 for critical mean-field Swendsen-Wang dynamics","245947078":"Disordered Ising Systems and Random Cluster Representations","2093681":"Reflection Positivity and Phase Transitions in Lattice Spin Models","2114640":"Translation invariant Gibbs states for the Ising model","249930388":"Course Notes: Probability on Trees and Networks, Fall 2004","230990262":"Binder, K. Applications of Monte Carlo methods to statistical physics. Rep. Prog. Phys. 60, 487-559","46433968":"Neural network based approximations to posterior densities: a class of flexible sampling methods with applications to reduced rank models","13273791":"Spectral properties and lattice-size dependences in cluster algorithms","12238543":"Cluster update algorithm and recognition","227071486":"On the Swendsen-Wang dynamics. I. Exponential convergence to equilibrium","13383348":"Coherent-incoherent transition and relaxation in condensed-phase tunneling systems","251463301":"Course 16 Simulation of statistical mechanics models","2126425":"On the 2D Ising Wulff crystal near criticality","2355288":"Markov chain Monte Carlo in image analysis","258329880":"Microcanonical Method for the Study of First-Order Transitions","222464317":"Virtual Bond Percolation for Ising Cluster Dynamics","223111631":"Improved estimators for a cluster updating of O(n) spin models","51967903":"Recent progress on the Random Conductance Model","1950869":"Bounds on the Complex Zeros of (Di)Chromatic Polynomials and Potts-Model Partition Functions","222219191":"Chromatic polynomials, Potts models and all that","13244486":"Application of cluster algorithms to spin glasses","234974861":"The Potts model and the Tutte polynomial","2217647":"The covariance matrix of the Potts model: A random cluster analysis","2621606":"Multiplicity Of Phase Transitions And Mean-Field Criticality On Highly Non-Amenable Graphs","51938199":"An Adaptive Interacting Wang-Landau Algorithm for Automatic Density Exploration","33517423":"Learning and inference in collective knowledge bases","242254560":"Markov Chain Monte Carlo Methods for Statistical Inference","2113200":"Slab Percolation and Phase Transitions for the Ising Model","225653731":"Additivity, Convexity and Beyond: Application of Minkowski Functionals in Statistical Physics","2859706":"Convergence of Slice Sampler Markov Chains","1825935":"Monte Carlo and Quasi-Monte Carlo Methods 2000","223119833":"How to beat critical slowing-down: 1990 update","51933583":"Dynamic Critical Behavior of the Chayes-Machta Algorithm for the Random-Cluster Model. I. Two Dimensions","2109112":"Linear speed large deviations for percolation clusters","4772050":"Perfect slice samplers","3193514":"Graphical Gaussian Shape Models and Their Application to Image Segmentation","6524664":"Short-time dynamics of percolation observables","239155422":"Cluster Sampling and its Applications to Segmentation, Stereo and Motion","13250154":"Collective Monte Carlo Updating for Spin Systems","225307597":"Slow Dynamics for the Dilute Ising Model in the Phase Coexistence Region","13247080":"Cluster dynamics for fully frustrated systems","49750612":"Reformulation of the stochastic potential switching algorithm and a generalized Fourtuin-Kasteleyn representation","215990907":"Markov Logic Networks","220481920":"Mathematical analysis of the recoil growth algorithm to generate multi-polymer systems","13293167":"Three-state antiferromagnetic Potts models: A Monte Carlo study","2800783":"The Mean Field Theory for Percolation Models of the Ising Type","2459776":"Efficient Exact Sampling From the Ising Model Using Swendsen-Wang","264960364":"Regularity properties and pathologies of position-space renormalization-group transformations: Scope and limitations of Gibbsian theory","1749180":"Transfer Matrices and Partition-Function Zeros for Antiferromagnetic Potts Models. V. Further Results for the Square-Lattice Chromatic Polynomial","1990329":"Simulated Tempering: A New Monte Carlo Scheme","2787469":"Markov Chain Monte Carlo Methods Based on `Slicing\u0027 the Density Function","279310850":"Graphical Representations for Ising and Potts Models in General External Fields","247384599":"Relaxation Times of Markov Chains in Statistical Mechanics and Combinatorial Structures","2165391":"Critical dynamics of two-replica cluster algorithms","1759412":"A variant of the Recoil Growth algorithm to generate multi-polymer systems","1809076":"Transfer Matrices and Partition-Function Zeros for Antiferromagnetic Potts Models I. General Theory and Square-Lattice Chromatic Polynomial","33956535":"Exploiting graph cutsets for sampling-based approximations in Bayesian networks /","226467790":"A parallel multigrid algorithm for percolation clusters","2336912":"Cube-Root Boundary Fluctuations For Droplets In Random Cluster Models","245675537":"Cluster Sampling and Its Applications in Image Analysis","245576214":"Efficient Exact Sampling for the Ising Model at all Temperatures","279571484":"Bounds on the Complex Zeros of (Di)Chromatic Polynomials and Potts-Model Partition Functions","231402365":"Electrostatic analogy for surfactant assemblies","2120858":"Equi-energy sampler with applications in statistical inference and statistical mechanics","227197744":"Surface order large deviations for Ising, Potts and percolation models","1958049":"Bayesian Restoration of Digital Images Employing Markov Chain Monte Carlo a Review","45891584":"Connection Probabilities and RSW-Type Bounds for the Two-Dimensional FK Ising Model","2094754":"A Remark on the Notion of Robust Phase Transitions","226077639":"Simulating posterior Gibbs distributions: a comparison of the Swendsen-Wang and Gibbs sampler methods","259324850":"Transfer Matrices and Partition-Function Zeros for Antiferromagnetic Potts Models. IV. Chromatic Polynomial with Cyclic Boundary Conditions","29635852":"On the Kert́sz line: Some rigorous bounds","242404538":"PERCOLATIVE PROBLEMS","228952940":"Algorithms for the Ising Model","226154416":"Phase transition in continuum Potts models","2320105":"Percolation and Deconfinement in SU(2) Gauge Theory","222909318":"Mass gap, scaling and universality in the d \u003d 2 O(3) σ-model","227623232":"Markov Chain Monte Carlo Method and its applications","1882317":"Spanning Forests and the q-State Potts Model in the Limit q →0","46434325":"Simulation based bayesian econometric inference: principles and some recent computational advances","246546532":"A Vectorized Algorithm for Cluster Formation in the Swendsen-Wang Dynamics","1773261":"Irreversible Monte Carlo Algorithms for Efficient Sampling","2926832":"The Random Geometry of Equilibrium Phases","225822633":"The High Temperature Ising Model on the Triangular Lattice is a Critical Bernoulli Percolation Model","281670167":"The worm process for the Ising model is rapidly mixing","1867518":"Percolation and cluster Monte Carlo dynamics for spin models","222484902":"Regularity Properties and Pathologies of Position-Space Renormalization-Group Transformations","47796799":"Tight Bounds for Mixing of the Swendsen-Wang Algorithm at the Potts Transition Point","247779875":"The Art of Data Augmentation","241492611":"A model study of the deconfining phase transition","225735571":"Transfer Matrices and Partition-Function Zeros for Antiferromagnetic Potts Models VI. Square Lattice with Extra-Vertex Boundary Conditions","221619164":"Modelling Uncertainty in the Game of Go.","229088078":"MCMC in image analysis","2102478":"The Random-Cluster Model","1844979":"Cluster Monte Carlo Algorithms for Dissipative Quantum Systems","231108918":"A simple stochastic cluster dynamics: Rigorous results","237067984":"Computational Statistics: Second Edition","45931597":"A probabilistic interpretation of the MacDonald polynomials","226355087":"Critical behavior in a model of correlated percolation","243356274":"Clusters in the three-dimensional Ising model with a magnetic field","2777817":"The Swendsen-Wang process does not always mix rapidly","230700340":"Divergence of the correlation length for critical planar FK percolation with 1 \u003c\u003d q \u003c\u003d 4 via parafermionic observables","222655409":"Lebowitz inequalities for Ashkin–Teller systems","2469075":"Auxiliary Variable Methods for Markov Chain Monte Carlo with Applications","227643751":"Perfect slice samplers","229336412":"Single cluster dynamics for the infinite range O(n) model","268211973":"Examples of DLR States Which are Not Weak Limits of Finite Volume Gibbs Measures with Deterministic Boundary Conditions","250361878":"Random even graphs and the Ising model","243103367":"Multivariate Normal Slice Sampling","226909053":"Single-cluster Monte Carlo dynamics for the Ising model","1864930":"Generalization of the Fortuin-Kasteleyn transformation and its application to quantum spin simulations,","227272052":"Join- and-cut algorithm for self-avoiding walks with variable length and free endpoints","29603523":"Le modèle d\u0027Ising","226555522":"Reflection Positivity of the Random-Cluster Measure Invalidated for Noninteger q","225341036":"Stability of Interfaces and Stochastic Dynamics in the Regime of Partial Wetting","222480961":"Graphical representations and cluster algorithms II","1896729":"The Percolation Signature of the Spin Glass Transition","255953479":"Improving the efficiency of Monte Carlo simulations of systems that undergo temperature-driven phase transitions","38339904":"Positive correlations in the fuzzy Potts model","38360387":"The Stochastic Random-Cluster Process and the Uniqueness of Random-Cluster Measures","50996224":"Handbook of Monte Carlo Methods","222486606":"Wolff-type embedding algorithms for general nonlinear σ-models","227296384":"Description of ordering and phase transitions in terms of local connectivity: Proof of a novel type of percolated state in the general clock model","42638726":"Spatially Adaptive Mixture Modeling for Analysis of fMRI Time Series","221660218":"Swendsen-Wang Is Faster than Single-Bond Dynamics","277979549":"Phase transition for the dilute clock model","7641977":"Generalizing Swendson-Wang to sampling arbitrary posterior probabilities","277854593":"Percolation in half spaces and Markov fields on branching planes.","2830139":"Recent Progress on Computable Bounds and the Simple Slice Sampler","2356023":"The Asymmetric Random Cluster Model And Comparison Of Ising And Potts Models","230971088":"Measurement-based quantum computation in a two-dimensional phase of matter","227142303":"On two correlation inequalities for Potts models","267701484":"Gibbs Measures and Phase Transitions in Potts and Beach Models","261700738":"Phase transition for the clock model via random-cluster percolation","6331261":"Cluster Simulations of Loop Models on Two-Dimensional Lattices","229047942":"1 Markov Logic: A Unifying Framework for Statistical Relational Learning","2105093":"Critical Region for Droplet Formation in the Two-Dimensional Ising Model","228928643":"Generalizing Swendsen–Wang for Image Analysis","48169977":"Exact Sampling for the Ising Model at all Temperatures","1878843":"The number of link and cluster states: The core of the 2D q state Potts model","226867885":"The Single Droplet Theorem for Random Cluster Models","259347039":"Gibbsian and Non-Gibbsian Properties of the Generalized Mean-Field Fuzzy Potts-Model","222268436":"Critical slowing down","222114832":"Acceleration methods for Monte Carlo computer simulations","1986353":"Percolation and Magnetization in the Continuous Spin Ising Model","256600698":"Multi-grid Monte Carlo (II). Two-dimensional XY model","7524166":"Wang-Landau Monte Carlo simulation of isotropic-nematic transition in liquid crystals","23578194":"Auxilliary Variables for Markov Random Fields with Higher Order Interactions","2732319":"Dynamical Analysis Of Low Temperature Monte Carlo Cluster Algorithms","222678143":"Percolation and Deconfinement in SU(2) Gauge Theory","265039088":"POTTS MODEL CLUSTERING FOR DISCOVERING PATTERNS OF EPIGENETIC MARKS","281487355":"Bridges in the random-cluster model","2097949":"Winterbottom Construction For Finite Range Ferromagnetic Models: An L_1-Approach","220286492":"Bayesian Analysis of the Unobserved ARCH Model","23419482":"Limit Theorems and Coexistence Probabilities for the Curie-Weiss Potts Model with an external field","2637675":"Mathematical Foundations of the Markov Chain Monte Carlo Method","23230500":"Phase Transition in the Three-State Potts Antiferromagnet on the Diced Lattice","44610542":"Equilibriumlike invaded cluster algorithm: Critical exponents and dynamical properties","243375046":"Phase coexistence in partially symmetric q -state models","221618815":"Nested sampling for Potts models","2124653":"Phase coexistence of gradient Gibbs states","1845074":"Random Cluster Models on the Triangular Lattice","226279475":"Uniqueness of the infinite component in a random graph with applications to percolation and spin glasses","254287975":"Missing data: Dial M for","234201253":"Physics Goals of the QCD Teraflop Project","262213360":"Synthesis of Tiled Patterns Using Factor Graphs","222782997":"The random cluster process","269877056":"Dynamics for the mean-field random-cluster model","222432279":"On the shape of posterior densities and credible sets in instrumental variable regression models with reduced rank: An application of flexible sampling methods using neural networks","1872715":"Percolation and Cluster Formalism in Continuous Spin Systems","1993542":"Testing the efficiency of different improvement programs","1919303":"Surface Tension in the Dilute Ising Model. The Wulff Construction","51892300":"Comparison of Swendsen-Wang and Heat-Bath Dynamics","220603512":"Positron emission tomography by Markov chain Monte Carlo with auxiliary variables","250754966":"Ch. 9. Empirical estimators based on MCMC data","13383082":"Numerical study of phase transitions in Potts models","1853306":"Continuous phase transition of a fully frustrated XY model in three dimensions","251481499":"PO07MO10 Rhinocerebral mucormycosis: a case report","285236326":"Thermodynamics for spatially inhomogeneous magnetization and Young-Gibbs measures","230913198":"A Multi-Grid Cluster Labeling Scheme","6447890":"Ferromagnetic Phase Transition for the Spanning-Forest Model ( q → 0 Limit of the Potts Model) in Three or More Dimensions","223705127":"Graphical representations and cluster algorithms I. Discrete spin systems","234140295":"Structure and eigenvalues of heat-bath Markov chains","2134358":"Uniqueness and non-uniqueness in percolation theory","258201112":"Dynamic connectivity algorithms for Monte Carlo simulations of the random-cluster model","13291956":"General cluster Monte Carlo dynamics","227192330":"Almost sure quasilocality fails for the random-cluster model on a tree","6329825":"A New Monte Carlo Method and Its Implications for Generalized Cluster Algorithms","227644434":"On the Flexibility of Metropolis–Hastings Acceptance Probabilities in Auxiliary Variable Proposal Generation","246983999":"Numerical Analysis For Statisticians","13277506":"Multigrid Monte Carlo method. Conceptual foundations","225501946":"Comparison and disjoint-occurrence inequalities for random-cluster models","220602541":"A version of the Swendsen-Wang algorithm for restoration of images degraded by Poisson noise","2853799":"Auxiliary Variables for Markov Random Fields with Higher Order Interactions Robin D. Morris","265453660":"ON THREE TECHNIQUES FOR RIGOROUS PROOFS OF FIRST-ORDER PHASE TRANSITIONS","11955494":"Simulations on Infinite-Size Lattices","26284545":"Mean-value identities as an opportunity for Monte Carlo error reduction","222394067":"Zero-free regions for multivariate Tutte polynomials (alias Potts-model partition functions) of graphs and matroids","222559953":"The statistical mechanics of belief sharing in multi-agent systems","51945099":"Conformal invariance of lattice models","4914140":"An Analysis of Swendsen-Wang and Related Sampling Methods","13249885":"Scaling Ansatz for Swendsen-Wang Dynamics","2384819":"Mixing Properties of the Swendsen-Wang Process on Classes of Graphs","238515119":"Hit and Run as a Unifying Device","227564041":"Simulation‐Based Bayesian Econometric Inference: Principles and Some Recent Computational Advances","225421041":"The Wulff Construction in Three and More Dimensions","251381605":"Local Porosity Theory and Stochastic Reconstruction for Porous Media","38351337":"On the Wulff crystal in the Ising model","45900573":"Extending canonical Monte Carlo methods II","222507238":"Parallel Cluster Labeling for Large-Scale Monte Carlo Simulations","225142990":"Phase Transition and Percolation in Gibbsian Particle Models","45900570":"Extending canonical Monte Carlo methods","221667472":"Rapid mixing of Swendsen-Wang and single-bond dynamics in two dimensions","220320394":"The Block Diagonal Infinite Hidden Markov Model","251758765":"On Potts Model Clustering, Kernel K Means and Density Estimation","3832214":"Torpid mixing of some Monte Carlo Markov chain algorithms instatistical physics","1987506":"Cluster Percolation and Chiral Phase Transition","27342863":"Clustering and uniqueness in mathematical models of percolation phenomena","222613236":"Generalized Wolff-type embedding algorithms for nonlinear σ-models","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","2462098":"Cluster Algorithms for Spatial Point Processes with Symmetric and Shift Invariant Interactions","252559541":"Acceleration Algorithms in Monte Carlo Simulations in Statistical Physics","230268929":"Convergence and Mixing in Markov Chain Monte Carlo","226915903":"Constrained variational problem with applications to the Ising model","258373855":"SLE boundary visits","243764029":"New monte carlo methods for improved efficiency of computer simulations in statistical mechanics","2295197":"The Polar Slice Sampler","49836344":"C 4: Exploring Multiple Solutions in Graphical Models by Cluster Sampling","1991127":"Simulation of Field Theories in Wavelet Representation","226041523":"Exponential convergence to equilibrium for a class of random-walk models","2684386":"Data Clustering Using a Model Granular Magnet","13271814":"Swendsen-Wang update algorithm for the Symanzik improved σ model","225171110":"The “Burnside Process” Converges Slowly","231097355":"Intermediate phases in mixed nematic/Heisenberg spin models","226755156":"A study of simulated annealing and a revised cascade algorithm for image reconstruction","264673813":"Complete graph asymptotics for the Ising and random cluster models on 5D grids with cyclic boundary","226800722":"The random-cluster model on the complete graph","5913996":"Critical Behavior of the Chayes–Machta–Swendsen–Wang Dynamics","239631775":"Framework and properties of cluster algorithms","2811376":"Markov Chain Monte Carlo for Statistical Inference","265511950":"Convergence of hybrid slice sampling via spectral gap","225443505":"Dynamic critical behavior of a Swendsen-Wang-Type algorithm for the Ashkin-Teller model","226324127":"Asymptotics in High Dimensions For the Fortuin-Kasteleyn Random Cluster Model","220320451":"Exact and Approximate Sampling by Systematic Stochastic Search","226742369":"The 2d-Ising model near criticality: A FK-percolation analysis, ArXiv","1860090":"Dynamic critical behavior of cluster algorithms for 2D Ashkin-Teller and Potts models","30770227":"Lieb-Schultz-Mattis theorem for quasitopological systems","1911291":"Phase transition in the 3-state Potts antiferromagnet on the diced lattice","230610007":"Territorial Developments Based on Graffiti: a Statistical Mechanics\nApproach","26720893":"Cluster Monte Carlo algorithm with a conserved order parameter","240925111":"MCMC Methods to Estimate Bayesian Parametric Models","227808895":"Treatment of missing values in process data analysis","44683586":"Layered Graph Matching with Composite Cluster Sampling","243776875":"Spatial Statistics and Bayesian Computing","45894481":"Critical Ising on the Square Lattice Mixes in Polynomial Time","228968008":"Marginal Markov Chain Monte Carlo Methods","225427586":"Grimmett, G.: Potts models and random-cluster processes with many-body interactions. J. Statist. Phys. 75(1-2), 67-121","1991663":"Dynamic Critical Behavio(u)r of a Cluster Algorithm for the Ashkin--Teller Model","2352593":"The Spectral Gap Of The 2-D Stochastic Ising Model With Nearly Single-Spin Boundary Conditions","226388108":"Dobrushin–Kotecký–Shlosman Theorem up to the Critical Temperature","257813166":"Efficient simulation of the random-cluster model","222707378":"The random cluster representation for the infinite-spin Ising model: Application to QCD pure gauge theory","24163461":"Sharp thresholds for the random-cluster and Ising models","226594420":"Coexistence of Partially Disordered/Ordered Phases in an Extended Potts Model","265986093":"Rigorous lower bound on the dynamic critical exponent of some multilevel Swendsen-Wang algorithms","225371799":"Universality of the ratio of the critical amplitudes of the magnetic susceptibility in a two-dimensional Ising model with nonmagnetic impurities","227264113":"Monte Carlo study of the ising model phase transition in terms of the percolation transition of “physical clusters”"},"index":938}