{"abs":"We consider the parameter estimation of Markov chain when the unknown transition matrix belongs to an exponential family of transition matrices. Then, we show that the sample mean of the generator of the exponential family is an asymptotically efficient estimator. Further, we also define a curved exponential family of transition matrices. Using a transition matrix version of the Pythagorean theorem, we give an asymptotically efficient estimator for a curved exponential family.","title":"Information Geometry Approach to Parameter Estimation in Markov Chains","id":259764474,"url":"https://www.researchgate.net/publication/259764474_Information_Geometry_Approach_to_Parameter_Estimation_in_Markov_Chains","names":["Masahito Hayashi","Shun Watanabe"],"references":{"259764570":"Finite-length Analysis on Tail probability and Simple Hypothesis Testing for Markov Chain","3084173":"Large Deviations, Hypotheses Testing, and Source Coding for Finite Markov Chains","258306977":"Finite Markov Chain","233971671":"Large Deviation Techniques and Applications","257201073":"Non-Asymptotic and Asymptotic Analyses on Markov Chains in Several Problems","269001295":"On Sequential Maximum Likelihood Estimation for Exponential Families of Stochastic Processes","222812623":"The Relaxation Method of Finding the Common Point of Convex Sets and Its Application to the Solution of Problems in Convex Programming","260222859":"Stochastic Models: Analysis and Applications by B. R. Bhat","221669789":"Probability and Computing: Randomized Algorithms and Probabilistic Analysis","229673791":"Large Sample Inference for Markovian Exponential Families with Application to Branching Processes with Immigration","3078207":"On the Converse Theorem in Statistical Hypothesis Testing for Markov Chains","224605778":"-Divergence Is Unique, Belonging to Both -Divergence and Bregman Divergence Classes","38357499":"Explicit Limit Results for Minimal Sufficient Statistics and Maximum Likelihood Estimators in Some Markov Processes: Exponential Families Approach","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","268838960":"On exponential and curved exponential families in stochastic processes","223464521":"On exponential families of Markov processes","260161179":"Asymptotic Efficiency of the Sample Mean in Markov Chain Monte Carlo Schemes","38358706":"Conditional Exponential Families and a Representation Theorem for Asympotic Inference","235409843":"Methods of Information Geometry","266215488":"Exponential Families of Stochastic Processes: A Unifying Semimartingale Approach"},"citedIn":{"259764570":"Finite-length Analysis on Tail probability and Simple Hypothesis Testing for Markov Chain","273704371":"Uniform Random Number Generation from Markov Chains: Non-Asymptotic and Asymptotic Analyses","257201073":"Non-Asymptotic and Asymptotic Analyses on Markov Chains in Several Problems"},"index":940}