{"abs":"Strength Pareto Evolutionary Algorithm 2 (SPEA2) has achieved great success for handling multiobjective optimization problems. However, it has been widely reported that SPEA2 gets subjected to a huge amount of computational effort while pursuing a good distribution of approximated solutions. This paper explores a new way to keep the good properties of SPEA2 and reduce its high computational burden simultaneously, with the aid of predefined preference information. By incorporating preference information, the proposed fast SPEA (FSPEA) can efficiently perform individuals\u0027 density estimation and environmental selection, thus speeding up the whole running time of the evolution process. Empirical studies show that the proposed FSPEA algorithm can obtain very competitive performance on a number of multiobjective test problems considered in this paper.","title":"A Fast Strength Pareto Evolutionary Algorithm Incorporating Predefined Preference Information","id":280554772,"url":"https://www.researchgate.net/publication/280554772_A_Fast_Strength_Pareto_Evolutionary_Algorithm_Incorporating_Predefined_Preference_Information","names":["Shouyong Jiang","Shengxiang Yang"],"references":{"4282944":"Multi-objective planning for workflow execution on Grids","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","224302549":"Cooperative coevolution for Pareto multiobjective optimization: An empirical study using SPEA2","253359061":"Shift-Based Density Estimation for Pareto-Based Algorithms in Many-Objective Optimization","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","220701941":"SPEA2+: Improving the Performance of the Strength Pareto Evolutionary Algorithm 2","47366464":"Improved Strength Pareto Evolutionary Algorithm with Local Search Strategies for Optimal Reactive Power Flow","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2335418":"A Combined Genetic Adaptive Search (GeneAS) for Engineering Design","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2460803":"Normal-Boundary Intersection: A New Method for Generating the Pareto Surface in Nonlinear Multicriteria Optimization Problems","220265479":"Comparative Application of Multi-Objective Evolutionary Algorithms to the Voltage and Reactive Power Optimization Problem in Power Systems","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","4251694":"Use of the WFG toolkit and PISA for comparison of MOEAs","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","278663461":"Lecture Notes in Computer Science","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","257312809":"An Improved Strength Pareto Evolutionary Algorithm 2 with application to the optimization of distributed generations"},"citedIn":{},"index":950}