{"abs":"Abstract Modern compilers present a great and ever increasing number of options which can modify the features and behavior of a compiled program. Many of these options are often wasted due to the required comprehensive knowledge about both the underlying architecture and the internal processes of the compiler. In this context, it is usual, not having a single design goal but a more complex set of objectives. In addition, the dependencies between different goals are difficult to be a priori inferred. This paper proposes a strategy for tuning the compilation of any given application. This is accomplished by using an automatic variation of the compilation options by means of multi-objective optimization and evolutionary computation commanded by the NSGA-II algorithm. This allows finding compilation options that simultaneously optimize different objectives. The advantages of our proposal are illustrated by means of a case study based on the well-known Apache web server. Our strategy has demonstrated an ability to find improvements up to 7.5% and up to 27% in context switches and L2 cache misses, respectively, and also discovers the most important bottlenecks involved in the application performance.","title":"Tuning compilations by multi-objective optimization: Application to Apache web server","id":272015474,"url":"https://www.researchgate.net/publication/272015474_Tuning_compilations_by_multi-objective_optimization_Application_to_Apache_web_server","names":["Antonio Martínez-Álvarez","Sergio Cuenca-Asensi","Andrés Ortiz","Jorge Calvo-Zaragoza","Luis Alberto Vivas Tejuelo","Applied Soft Computing"],"references":{"3418741":"Considerations in engineering parallel multiobjective evolutionary algorithms. IEEE Trans Evol Comput","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","228357905":"Analyzing nic overheads in network-intensive workloads","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","243798361":"An Overview of the Intel® IA64 Compiler","220799163":"COLE: Compiler Optimization Level Exploration","221392742":"PSFGA: A Parallel Genetic Algorithm for Multiobjective Optimization.","223184920":"Performance evaluation of efficient multi-objective evolutionary algorithms for design space exploration of embedded computer systems","222681939":"The performance analysis of linux networking – Packet receiving","236984310":"Leveraging Bandwidth Improvements to Web Servers through enhanced Network Interfaces","223893583":"Network interfaces for programmable NICs and multicore platforms","222729118":"Pettersson F., Chakraborti N. and Saxén H.: ‘A genetic algorithms based multi-objective neural net applied to noisy blast furnace data’, Appl. Soft Comput.","223564873":"A predictive and probabilistic load-balancing algorithm for cluster-based web servers","236984314":"Affinity-Based Network Interfaces for Efficient Communication on Multicore Architectures","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","239062948":"PESA-II: Region-based selection in evolutionary multiobjective optimization","4099228":"Statistical selection of compiler options","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","3418697":"Jaszkiewicz, A.: On the Performance of Multiple-Objective Genetic Local Search on the 0/1 Knapsack Problem - A Comparative Experiment. IEEE Trans. on Evolutionary Computation 6, 402-412","216457304":"Lecture Notes in Computer Science"},"citedIn":{"277309583":"On the Automatic Tuning of a Retina Model by Using a Multi-objective Optimization Genetic Algorithm"},"index":952}