{"abs":"In this paper, we propose a novel hybrid multi-objective immune algorithm with adaptive differential evolution, named ADE-MOIA, in which the introduction of differential evolution (DE) into multi-objective immune algorithm (MOIA) combines their respective advantages and thus enhances the robustness to solve various kinds of MOPs. In ADE-MOIA, in order to effectively cooperate DE with MOIA, we present a novel adaptive DE operator, which includes a suitable parent selection strategy and a novel adaptive parameter control approach. When performing DE operation, two parents are respectively picked from the current evolved and dominated population in order to provide a correct evolutionary direction. Moreover, based on the evolutionary progress and the success rate of offspring, the crossover rate and scaling factor in DE operator are adaptively varied for each individual. The proposed adaptive DE operator is able to improve both of the convergence speed and population diversity, which are validated by the experimental studies. When comparing ADE-MOIA with several natural-inspired heuristic algorithms, such as NSGA-II, SPEA2, AbYSS, MOEA/D-DE, MIMO and D2MOPSO, simulations show that ADE-MOIA performs better on most of 21 well-known benchmark problems.","title":"A novel Hybrid multi-objective immune algorithm with adaptive differential evolution","id":275257952,"url":"https://www.researchgate.net/publication/275257952_A_novel_Hybrid_multi-objective_immune_algorithm_with_adaptive_differential_evolution","names":["Qiuzhen Lin","Qingling Zhu","Peizhi Huang","Jianyong Chen","Zhong Ming","Jianping Yu","Computers \u0026 Operations Research"],"references":{"261718425":"A new approach for maintenance scheduling of generating units in electrical power systems based on their operational hours","220286112":"Solving Multiobjective Optimization Problems Using an Artificial Immune System","3949503":"Scalable multi-objective optimization test problems","220470562":"GISMOO: A new hybrid genetic/immune strategy for multiple-objective optimization","3419059":"AbYSS: Adapting Scatter Search to Multiobjective Optimization","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220381225":"A review of multiobjective test problems and a scalable test problem toolkit.","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","259135845":"ADEMO/D: Multiobjective optimization by an adaptive differential evolution algorithm","220288054":"An evolutionary artificial immune system for multi-objective optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","2634673":"Multiobjective Optimization Using Evolutionary Algorithms --- A Comparative Case Study","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","254061113":"On the negative selection and the danger theory inspired security for heterogeneous networks","259513943":"A knowledge-based evolutionary algorithm for the multiobjective vehicle routing problem with time windows","224378746":"Multiobjective Evolutionary Decision Support for Design–Supplier–Manufacturing Planning","3412753":"A Novel Intelligent Multiobjective Simulated Annealing Algorithm for Designing Robust PID Controllers","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","230712168":"Multiple Populations for Multiple Objectives: A Coevolutionary Technique for Solving Multiobjective Optimization Problems","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","4173717":"Multi-objective evolutionary decision support for design-supplier-manufacturing planning","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","266562508":"An Iterated Local Search heuristic for the Split Delivery Vehicle Routing Problem","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","220381079":"A Novel Immune Clonal Algorithm for MO Problems","224330344":"Differential Evolution Algorithm With Strategy Adaptation for Global Numerical Optimization","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","257153646":"A novel micro-population immune multiobjective optimization algorithm","222048386":"A multiobjective immune algorithm based on a multiple-affinity model","260081215":"A knowledge-based evolutionary algorithm for the multiobjective vehicle routing problem with time windows","260621899":"A Hybrid Multiobjective Evolutionary Algorithm for Multiobjective Optimization Problems","289048825":"Multi-objective Optimization Immune Algorithm Using Clustering","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","5303061":"Multiobjective Immune Algorithm with Nondominated Neighbor-Based Selection","261140826":"A Multipopulation Coevolutionary Strategy for Multiobjective Immune Algorithm","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","260622151":"The Automatic Design of Multiobjective Ant Colony Optimization Algorithms","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","243764822":"Learning Using an Artificial Immune System","220742266":"A new proposal for multi-objective optimization using differential evolution and rough sets theory","220312947":"Adaptive strategy selection in differential evolution for numerical optimization: An Empirical Study","12197865":"Architecture for an Artificial Immune System","220380790":"Artificial immune system architecture for computer security applications","257153541":"MOEA/D + uniform design: A new version of MOEA/D for optimization problems with many objectives","2631294":"A Niched Pareto Genetic Algorithm for Multiobjective Optimization","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","292056369":"Immune networks using genetic algorithm for adaptive production scheduling","3949542":"An Artificial Immune Network for Multimodal Function Optimization. Evolutionary Computatio","256456340":"Adaptive Operator Selection With Bandits for a Multiobjective Evolutionary Algorithm Based on Decomposition","222302494":"DEMORS: a hybrid multi-objective optimization algorithm using differential evolution and rough sets for constrained problems. Comput Oper Res","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","4817058":"\"MOSS\" multiobjective scatter search applied to non-linear multiple criteria optimization","46491433":"A hybrid immune multiobjective optimization algorithm","224177966":"The jMetal framework for multi-objective optimization: Design and architecture","3418695":"Learning and Optimization Using the Clonal Selection Principle","220470352":"WBMOAIS: A novel artificial immune system for multiobjective optimization","268019597":"A new hybrid genetic algorithm for job shop scheduling problem","236327278":"D(2)MOPSO: MOPSO based on Decomposition and Dominance with Archiving using Crowding Distance in Objective and Solution Spaces.","259131784":"Multiguiders and Nondominate Ranking Differential Evolution Algorithm for Multiobjective Global Optimization of Electromagnetic Problems","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","261859559":"D 2 MOPSO: Multi-Objective Particle Swarm Optimizer Based on Decomposition and Dominance"},"citedIn":{"288932175":"Adaptive Composite Operator Selection and Parameter Control for Multiobjective Evolutionary Algorithm","283565951":"A differential evolution algorithm with self-adaptive strategy and control parameters based on symmetric Latin hypercube design for unconstrained optimization problems"},"index":953}