{"abs":"We investigate the possibility of extending Chrobak normal form to the probabilistic case. While in the nondeterministic case a unary automaton can be simulated by an automaton in Chrobak normal form without increasing the number of the states in the cycles, we show that in the probabilistic case the simulation is not possible by keeping the same number of ergodic states. This negative result is proved by considering the natural extension to the probabilistic case of Chrobak normal form, obtained by replacing nondeterministic choices with probabilistic choices. We then propose a different kind of normal form, namely, cyclic normal form, which does not suffer from the same problem: we prove that each unary probabilistic automaton can be simulated by a probabilistic automaton in cyclic normal form, with at most the same number of ergodic states. In the nondeterministic case there are trivial simulations between Chrobak normal form and cyclic normal form, preserving the total number of states in the automata and in their cycles.","title":"Normal forms for unary probabilistic automata","id":256738170,"url":"https://www.researchgate.net/publication/256738170_Normal_forms_for_unary_probabilistic_automata","names":["Maria Paola Bianchi","Giovanni Pighizzini","RAIRO - Theoretical Informatics and Applications"],"references":{"220994509":"Optimal Simulations Between Unary Automata.","222991528":"Magic numbers in the state hierarchy of finite automata","263981567":"THE STRUCTURE AND COMPLEXITY OF MINIMAL NFA’S OVER A UNARY ALPHABET","220444775":"On the Size of Unary Probabilistic and Nondeterministic Automata","242790140":"Errata to: “Finite Automata and Unary Languages”","220520705":"Tight Bounds on the Simulation of Unary Probabilistic Automata by Deterministic Automata.","23625229":"Preprint submitted Unary finite automata vs. arithmetic progressions","221467455":"On the Succinctness of Deterministic, Nondeterministic, Probabilistic and Quantum Finite Automata.","221150144":"Regularity of One-Letter Languages Acceptable by 2-Way Finite Probabilistic Automata.","44478088":"Non-negative matrices and markov chains / E. Seneta","220180815":"The Structure and Complexity of Minimal NFA\u0027s over a Unary Alphabet.","222813168":"Finite automata and unary languages","220248377":"Probabilistic Automata","239547549":"Markov Chains: Theory and Applications","216301243":"Introduction to Probabilistic Automata"},"citedIn":{},"index":962}