{"abs":"The reliability analysis of large and complex structural requires approximate techniques in order to reduce computational efforts to an acceptable level. Since it is, from an engineering point of view, desirable to make approximative assumptions at the level of the mechanical rather than the probabilistic modeling, simplifications should be carried out in the space of physically meaningful system- or loading variables.Within the context of this paper, a new adaptive interpolation scheme is suggested which enables fast and accurate representation of the system behavior by a response surface (RS). This response surface approach utilizes elementary statistical information on the basic variables (mean values and standard deviations) to increase the efficiency and accuracy. Thus the RS obtained is independent of the type of distribution or correlations among the basic variables which enables sensitivity studies with respect to these parameters without much computational effort.Subsequently, the response surface is utilized in conjunction with advanced Monte Carlo simulation techniques (importance sampling) to obtain the desired reliability estimates.Numerical examples are carried out in order to show the applicability of the suggested approach to structural systems reliability problems. The proposed method is shown to be superior both in efficiency and accuracy to existing approximate methods, i.e., the first order reliability methods.","title":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","id":244955839,"url":"https://www.researchgate.net/publication/244955839_A_Fast_Efficient_Response_Surface_Approach_for_Structural_Reliability_Problems","names":["Christian Bucher","Bourgund UA","Structural Safety"],"references":{"222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","271795222":"Inverse Polynomials, a Useful Group of Multi-Factor Response Functions","244445737":"Time Variant Reliability Analysis Utilizing Response Surface Approach","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126"},"citedIn":{},"index":975}