{"abs":"In this paper we compute and analyse the transition rates and duration of reactive trajectories of the stochastic 1-D Allen-Cahn equations for both the Freidlin-Wentzell regime (weak noise or temperature limit) and finite-amplitude white noise, as well as for small and large domain. We demonstrate that extremely rare reactive trajectories corresponding to direct transitions between two metastable states are efficiently computed using an algorithm called adaptive multilevel splitting. This algorithm is dedicated to the computation of rare events and is able to provide ensembles of reactive trajectories in a very efficient way. In the small noise limit, our numerical results are in agreement with large-deviation predictions such as instanton-like solutions, mean first passages and escape probabilities. We show that the duration of reactive trajectories follows a Gumbel distribution like for one degree of freedom systems. Moreover, the mean duration growths logarithmically with the inverse temperature. The prefactor given by the potential curvature grows exponentially with size. The main novelty of our work is that we also perform an analysis of reactive trajectories for large noises and large domains. In this case, we show that the position of the reactive front is essentially a random walk. This time, the mean duration grows linearly with the inverse temperature and quadratically with the size. Using a phenomenological description of the system, we are able to calculate the transition rate, although the dynamics is described by neither Freidlin--Wentzell or Eyring--Kramers type of results. Numerical results confirm our analysis.","title":"Computing transition rates for the 1-D stochastic Ginzburg--Landau--Allen--Cahn equation for finite-amplitude noise with a rare event algorithm","id":280243098,"url":"https://www.researchgate.net/publication/280243098_Computing_transition_rates_for_the_1-D_stochastic_Ginzburg--Landau--Allen--Cahn_equation_for_finite-amplitude_noise_with_a_rare_event_algorithm","names":["Joran Rolland","Freddy Bouchet","Eric Simonnet","Journal of Statistical Physics"],"references":{"45860283":"Uniform Estimates for Metastable Transition Times in a Coupled Bistable System","221662006":"Sharp estimates for metastable lifetimes in parabolic SPDEs: Kramers\u0027\nlaw and beyond","279968686":"Generalisation of the Eyring-Kramers transition rate formula to irreversible diffusion processes","2543141":"Metastability In Reversible Diffusion Processes I. Sharp Asymptotics For Capacities And Exit Times","264854211":"Combinatorial analysis of the adaptive last particle method","27684652":"Bimodal Behavior of the Kuroshio and the Gulf Stream","242386046":"Estimation of Particle Transmission by Random Sampling","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","232384843":"Long-wavelength modulation of turbulent shear flows","6825981":"Illustration of transition path theory on a collection of simple examples","225187578":"On the length of one-dimensional reactive paths","235481374":"Shift in the velocity of a front due to a cutoff","227116446":"Slow motion manifold, dormant instability and singular perturbation","38351825":"Strong solutions to the stochastic quantization equations. Ann Probab","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","3772320":"RESTART: A straightforward method of fast simulation of rare event","226586776":"Interface Fluctuations and Couplings in the D\u003d1 Ginzburg–Landau Equation with Noise","1741440":"The Eyring-Kramers law for potentials with nonquadratic saddles","227425044":"Weak Approximation of Killed Diffusions Using Euler Schemes","267338867":"Efficient Computation of Instantons for Multi-Dimensional Turbulent Flows with Large Scale Forcing","222307937":"Brownian Motion In A Field Of Force And The Diffusion Model Of Chemical Reactions","256846445":"Arclength Parametrized Hamilton\u0027s Equations for the Calculation of Instantons","252716340":"Handbook of Stochastic Methods: For Physics, Chemistry and the Natural Sciences","227733047":"Statistical hydrodynamics of the thermohaline circulation in a two‐dimensional model","241253195":"Theory of Nucleation Rates","269417762":"Statistical behavior of adaptive multilevel splitting algorithms in simple models","226031060":"Sequential Monte Carlo for rare event estimation","257685237":"Proper Orthogonal Decomposition investigation of turbulent Rayleigh-Bénard convection in a rectangular cavity","1917614":"Touchette, H.: The large deviation approach to statistical mechanics. Phys. Rep. 478, 1-69","24358343":"Random Changes of Flow Topology in Two-Dimensional and Geophysical Turbulence","230934774":"Magnetic ﬁeld reversals in an experimental turbulent dynamo","232028781":"Multiple equilibria in two-dimensional thermohaline flow","225229521":"The scaling limit for a stochastic PDE and the separation of phases","224877273":"Reaction-Rate Theory: Fifty Years After Kramers","261836709":"Large deviations for white-noise driven, nonlinear stochastic PDEs in two and three dimensions","263037330":"Large deviations for white-noise driven, nonlinear stochastic PDEs in two and three dimensions","246204013":"Fluctuations and irreversible processes. II. Phys Rev","1864798":"Theory of Phase Ordering Kinetics","260482629":"Langevin Dynamics, Large Deviations and Instantons for the Quasi-Geostrophic Model and Two-Dimensional Euler Equations","231076737":"Large deviations for a nonlinear heat equation with noise","225481525":"Rare Events in Stochastic Partial Differential Equations on Large Spatial Domains","51914078":"Susceptibility divergence, phase transition and multistability of a\nhighly turbulent closed flow","49819199":"A multiple replica approach to simulate reactive trajectories","231037453":"Study of the noise-induced transition and the exploration of the phase space for the Kuramoto–Sivashinsky equation using the minimum action method","221659005":"Sharp asymptotics of metastable transition times for one dimensional\nSPDEs","200104742":"Theory of Dynamic Critical Phenomena","227666013":"Minimum Action Method for the Study of Rare Events","224043541":"Pattern Formation Outside of Equilibrium","264955291":"An Introduction to Stochastic Partial Differential Equations","226469677":"Singular Limit for Stochastic Reaction-Diffusion Equation and Generation of Random Interfaces","224877234":"The Activated Complex in Chemical Reactions","243690590":"Initial Recombination of Ions","229876585":"Action minimization and sharp‐interface limits for the stochastic Allen‐Cahn equation","234258576":"Spells of Low-Frequency Oscillations and Weather Regimes in the Northern Hemisphere","230945060":"Random Perturbations of Dynamical Systems","246868698":"Rosenbluth, M. N. \u0026 Rosenbluth, A. W. Monte Carlo calculation of the average extension of molecular chains. J. Chem. Phys. 23, 356","279458630":"The instanton method and its numerical implementation in fluid mechanics","40811550":"Mapping the Network of Pathways of CO Diffusion in Myoglobin","224861591":"Non-classical large deviations for a noisy system with non-isolated\nattractors","234028544":"Invariant measure of the stochastic Allen-Cahn equation: The regime of small noise and large system size","51454439":"Forward Flux Sampling for rare event simulations","8195078":"Domain wall propagation and nucleation in a metastable two-level system","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","224043815":"Stochastic Process in Physics and Chemistry"},"citedIn":{},"index":98}