{"abs":"Covariance parameter estimation of Gaussian processes is analyzed in an asymptotic framework. The spatial sampling is a randomly perturbed regular grid and its deviation from the perfect regular grid is controlled by a single scalar regularity parameter. Consistency and asymptotic normality are proved for the Maximum Likelihood and Cross Validation estimators of the covariance parameters. The asymptotic covariance matrices of the covariance parameter estimators are deterministic functions of the regularity parameter. By means of an exhaustive study of the asymptotic covariance matrices, it is shown that the estimation is improved when the regular grid is strongly perturbed. Hence, an asymptotic confirmation is given to the commonly admitted fact that using groups of observation points with small spacing is beneficial to covariance function estimation. Finally, the prediction error, using a consistent estimator of the covariance parameters, is analyzed in details.","title":"Asymptotic analysis of the role of spatial sampling for hyper-parameter estimation of Gaussian processes","id":234168781,"url":"https://www.researchgate.net/publication/234168781_Asymptotic_analysis_of_the_role_of_spatial_sampling_for_hyper-parameter_estimation_of_Gaussian_processes","names":["François Bachoc","Journal of Multivariate Analysis"],"references":{"38348940":"Maximum likelihood estimation under a spatial sampling scheme","38359424":"Bounds on the Efficiency of Linear Predictions Using an Incorrect Covariance Function","38360256":"Asymptotically Efficient Prediction of a Random Field with a Misspecified Covariance Function","41781559":"Gaussian Process for Machine Learning","38349189":"Fixed-domain asymptotics for a subclass of Matérn-type Gaussian random fields","220695863":"Numerical Recipes in FORTRAN: the art of scientific computing","229896035":"Kriging and cross‐validation for massive spatial data","232128903":"Spatial Statistics","45857961":"On the consistent separation of scale and variance for Gaussian random fields","223636674":"Asymptotic properties of a maximum likelihood estimator with data from a Gaussian process","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","38359824":"Maximum Likelihood Estimation of Parameters under a Spatial Sampling Scheme","227544009":"Spatial sampling design under infill asymptotic framework","245992758":"E卤cient global optimization of expensive black-box functions","45870308":"Fixed-domain asymptotic properties of tapered maximum likelihood estimators","38322281":"On the Effect of Covariance Function Estimation on the Accuracy of Kriging Predictors","257017520":"Calibration of computer models with multivariate output","216301381":"The Design and Analysis Computer Experiments","256198631":"The Geometry of Random Fields, New York","23630794":"The Asymptotic Distribution of REML Estimators","2394753":"Toeplitz and Circulant Matrices: A Review","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","38359407":"Uniform Asymptotic Optimality of Linear Predictions of a Random Field Using an Incorrect Second-Order Structure","261001961":"Numerical Recipes in C—The Art of Scientific Computing","238677918":"Random Number Generation and Quasi-Monte Carlo Methods. SIAM, Philadelphia","4746787":"Inconsistent Estimation and Asymptotically Equal Interpolations in Model-Based Geostatistics","216075149":"Design of computer experiments: Space filling and beyond","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","200656985":"Design and Analysis of Experiments (2nd Ed)","4788839":"Estimating the Prediction Mean Squared Error in Gaussian Stochastic Processes with Exponential Correlation Structure","38358630":"Uniform Asymptotic Normality of the Maximum Likelihood Estimator","38348345":"Estimating structured correlation matrices in smooth Gaussian random field models","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","226970613":"Cross validation of Kriging in a unique neighborhood","24052764":"Asymptotic distributions of M-estimators in a spatial regression model under some fixed and stochastic spatial sampling designs","252030066":"Geostatistical sampling optimization of contaminated premises","220685215":"Near-Optimal Signal Recovery From Random Projections: Universal Encoding Strategies?","11977806":"Predictive Approaches for Choosing Hyperparameters in Gaussian Processes","234168780":"Cross Validation and Maximum Likelihood estimation of hyper-parameters of Gaussian processes with model misspecification","3086165":"Near-Optimal Signal Recovery From Random Projections: Universal Encoding Strategies?","245630430":"Central Limit Theorems for Weighted Sums of a Spatial Process under a Class of Stochastic and Fixed Designs","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","31354848":"Maximum Likelihood Estimation of Models for Residual Covariance in Spatial Regression"},"citedIn":{"277895584":"Asymptotic properties of multivariate tapering for estimation and prediction","269280638":"Asymptotic analysis of covariance parameter estimation for Gaussian processes in the misspecified case","272845206":"Adaptive numerical designs for the calibration of computer codes","260014423":"Compatibility results for conditional distributions","272350067":"Polynomial-Chaos-Based Kriging"},"index":980}