{"abs":"The main factors governing the design of composite laminates are the geometrical dimensions, the stacking sequence –including ply thickness and orientation angles–, the mechanical properties of the materials, the applied loads and the performance requirements. Most of these factors are commonly affected by uncertainty and this should be taken into account when designing these structures. Thus, uncertainty quantification should be used to evaluate the performance requirements and a reliability-based procedure is advisable when the design is optimized. However, these methods present several drawbacks, like the lack of trustworthy information about the uncertainty present in the variables of the model or the high computational cost required to apply the algorithms to medium to large models. This paper evaluates several methodologies for design optimization of composite panels under uncertainty. The uncertainty quantification is performed using stochastic expansion and limit state approximation methods. Monte Carlo sampling is also used to verify reliability results. The optimization process is carried out using gradient-based and genetic algorithms, with either continuous or discrete design variables. Surrogate methods, including polynomial, kriging, multivariate adaptive regression splines, and artificial neural networks, as well as parallel computing, have been leveraged to keep analysis times under acceptable levels. An application example of a stiffened composite panel of an aircraft fuselage is presented to demonstrate the computational performance and the accuracy of the methods. Results show major improvement in analysis time without compromising on precision.","title":"Efficient methodologies for reliability-based design optimization of composite panels","id":289250756,"url":"https://www.researchgate.net/publication/289250756_Efficient_methodologies_for_reliability-based_design_optimization_of_composite_panels","names":["Jacobo Diaz","Miguel Cid Montoya","Santiago Hernandez","Advances in Engineering Software"],"references":{"222620870":"Reliability based optimization: A safety index approach","233256802":"An Approach for the Reliability Based Design Optimization of Laminated Composite Plates","264548545":"Comparison of reliability based structural optimization methodologies in the design of aircraft structures","230872901":"Stochastic Finite Elements","245310871":"Probabilistic optimal design of laminates using improved particle swarm optimization","265366105":"Determination des distribution dont les marges sont donnees","223844318":"Multi-objective optimization in dynamics of the structures with nonlinear behavior: Contributions of the metamodels","223564511":"Surrogate-based analysis and optimization","267462397":"Elements of structural optimization. 3. revised and expanded ed","222301005":"Reliability analysis of spacecraft structures under static and dynamic loading","222580298":"Reliability-based design and optimization of adaptive marine structures","222992453":"Reliability considerations in composite laminate tailoring","232395592":"Review of uncertainty-based multidisciplinary design optimization methods for aerospace vehicles","245062029":"Uncertainty quantification and robust design of aircraft components under thermal loads","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","222832976":"Error and uncertainty in modeling and simulation","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","51991936":"The Wiener--Askey Polynomial Chaos for Stochastic Differential Equations","223030481":"Reliability design of fiber reinforced composites","227319575":"Comparative Studies of Metamodeling Techniques Under Multiple Modeling Criteria","268168164":"Biologically inspired optimization methods: An introduction","262980232":"Optimized parallel computing for cellular automaton-finite element modeling of solidification grain structures","223657330":"Reliability-based optimization of fibrous laminated composites","236169144":"A survey of non-gradient optimization methods in structural engineering","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","258112076":"Reliability in composites – A selective review and survey of current development","235979455":"Nature-Inspired Metaheuristic Algorithms","288737434":"Advances in Metaheuristic Algorithms for Optimal Design of Structures","226311758":"Comparison of global and local response surface techniques in reliability-based optimization of composite structures","238184454":"A New Study on Reliability-Based Design Optimization","265351524":"Design under uncertainty employing stochastic expansion methods","222239371":"Talatahari, S.: Particle swarm optimizer, ant colony strategy and harmony search scheme hybridized for optimization of truss structures. Comput. Struct. 87, 267-283","247580543":"Some basic hypergeometric polynomials that generalize Jacobi polynomials","232389990":"Reliability-based load and resistance factor design of composite pressure vessel under external hydrostatic pressure","251542716":"Computational strategy for multiobjective optimization of composite stiffened panels","257424784":"Parallelization of lattice modelling for estimation of fracture process zone extent in cementitious composites","263427700":"Multiscale reliability analysis of a composite stiffened panel","245423592":"Application of lamination parameters to reliability-based stiffness design of composites","234014394":"The Monte Carlo method","238188927":"Selecting Probabilistic Approaches for Reliability-Based Design Optimization","243787593":"Hybrid Analysis Method for Reliability-Based Design Optimization","251620910":"Efficient surrogate models for reliability analysis of systems with multiple failure modes","222358674":"Parallel processing, neural networks and genetic algorithms","234127014":"Multilayered composite structure design optimisation using distributed/parallel multi-objective evolutionary algorithms","222778386":"Parallel computing techniques applied to the simultaneous design of structure and material","225144510":"A Logical Calculus of the Idea Immanent in Nervous Activity","282714892":"The Homogeneous Chaos","220695920":"Parallel Programming: Techniques and Applications Using Networked Workstations and Parallel Computers","228981886":"An Investigation of Nonlinearity of Reliability-Based Design Optimization Approaches","265682441":"Probabilistic Reliability — An Engineering Approach","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","248205461":"An approach for reliability-based robust design optimisation of angle-ply composites","234541989":"Reliability-based Structural Design","224982284":"A logical Calculus of Ideas Immanent in Nervous Activity","233868697":"Optimization of composite stiffened panels under mechanical and hygrothermal loads using neural networks and genetic algorithms","241080885":"Reliability based optimization of laminated composite structures using genetic algorithms and Artificial Neural Networks","220292047":"Stochastic subset optimization incorporating moving least squares response surface methodologies for stochastic sampling","256972863":"Probabilistic assessment of the structural failure of single-lap bonded joints","257424952":"Parallelisation of nonlinear structural analysis using dual partition super elements","279031121":"A multi-objective reliability-based optimization of the crashworthiness of a metallic-GFRP impact absorber using hybrid approximations","38359483":"Multivariate Adaptive Regression Spline","271644099":"Introduction To Optimum Design","248204863":"A hierarchical genetic algorithm for reliability based design of geometrically non-linear composite structures","236660847":"Exact and Invariant Second Moment Code Format","220179686":"An Anisotropic Sparse Grid Stochastic Collocation Method for Partial Differential Equations with Random Input Data","225547403":"Laminate optimization incorporating analysis and model parameter uncertainties for predictable failure","268478716":"Survey of Reliability Analysis Methods for Design Optimization of Aircraft Structures","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand","223062836":"Optimization of ply angles in laminated composite structures by a hybrid, asynchronous, parallel evolutionary algorithm","262569817":"A parallel finite-element framework for large-scale gradient-based design optimization of high-performance structures"},"citedIn":{},"index":99}