{"abs":"We develop an efficient, Bayesian Uncertainty Quantification framework using a novel treed Gaussian process model. The tree is adaptively constructed using information conveyed by the observed data about the length scales of the underlying process. On each leaf of the tree, we utilize Bayesian Experimental Design techniques in order to learn a multi-output Gaussian process. The constructed surrogate can provide analytical point estimates, as well as error bars, for the statistics of interest. We numerically demonstrate the effectiveness of the suggested framework in identifying discontinuities, local features and unimportant dimensions in the solution of stochastic differential equations.","title":"Multi-output local Gaussian process regression: Applications to uncertainty quantification","id":256744276,"url":"https://www.researchgate.net/publication/256744276_Multi-output_local_Gaussian_process_regression_Applications_to_uncertainty_quantification","names":["Ilias Bilionis","Nicholas Zabaras","Journal of Computational Physics"],"references":{"227196170":"Improved Multilevel Monte Carlo Convergence using the Milstein Scheme","222714823":"Handbook of Mathematical Function: With Formulas, Graphs, and Mathematical Tables","222581573":"Bayesian emulation of complex multi-output and dynamic computer models","226296703":"Modelling of Multiscale Structures in Flow Simulations for Petroleum Reservoirs","2609572":"Monte Carlo Implementation of Gaussian Process Models for Bayesian Regression and Classification","221619254":"Kernels for Multi--task Learning.","4772045":"Bayesian Calibration of Computer Models","261823251":"Practical Methods of Optimization by R. Fletcher","224839791":"The Linear Coregionalization Model and the Product-Sum Space-Time Variogram","230873416":"Quadrature and Interpolation formulas for tensor products of certain classes of functions","244934536":"Multi-Element Generalized Polynomial Chaos for Arbitrary Probability Measures","222504913":"Neural Network Exploration Using Optimal Experiment Design","221932969":"Statistics For Spatial Data","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","51991950":"A stochastic collocation method for elliptic partial differential equations with random input data","2320571":"Gaussian Processes for Regression","51991936":"The Wiener--Askey Polynomial Chaos for Stochastic Differential Equations","228642363":"Efficient collocation approach for parametric uncertainty analysis","222540638":"The multi-element probabilistic collocation method (MEPCM): Error analysis and applications. J Comput Phys","228396544":"On the low-rank approximation by the pivoted Cholesky decomposition","238297001":"Practial Methods of Optimization","2455557":"Information--Based Objective Functions for Active Data Selection","216301381":"The Design and Analysis Computer Experiments","226007130":"Linear coregionalization model: tools for estimation and choice of cross-variogram matrix. Math Geol 24 (3): 269-286","45888917":"Dynamic Trees for Learning and Design","220179382":"A Sparse Grid Stochastic Collocation Method for Partial Differential Equations with Random Input Data","224839754":"Explaining the Gibbs sampler. Am Stat","226794920":"Mixed Discontinuous Galerkin Methods for Darcy Flow","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","222223111":"The ubiquitous Kronecker product","216301661":"Screening, Predicting, and Computer Experiments","267176277":"Numerical Methods for Stochastic Computations: A Spectral Method Approach","45931398":"Cases for the Nugget in modelling computer experiments","49459407":"Semiparametric Latent Factor Models","220343522":"Bayesian Treed Models","224817317":"Matrix Differential Calculus with Applications in Statistics and Econometrics, John Wiley, New York","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","5207179":"Bayesian inference for the uncertainty distribution of computer model outputs. Biometrika","200105001":"Equation of State by Fast Computing Machines","220411369":"High-Order Collocation Methods for Differential Equations with Random Inputs","238394232":"Small Sample Sensitivity Analysis Techniques For Computer-Models, With An Application To Risk Assessment","2837349":"On the Finite Element Solution of the Pure Neumann Problem","226294957":"Multivariable variogram and its application to the linear model of coregionalization","226715991":"A Mixed Finite Element Method for Second Order Elliptic Problems","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","222409879":"An adaptive hierarchical sparse grid collocation algorithm for the solution of stochastic differential equations","224513847":"Pattern Recognition and Machine Learning (Information Science and Statistics)","213879912":"An overview of the Trilinos Project","2354046":"Bayesian Interpolation","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","220244349":"Multilevel Monte Carlo Path Simulation","2450683":"Bayesian CART model search","38363031":"Bayesian Experimental Design: A Review","222652964":"An adaptive multi-element generalized polynomial chaos method for stochastic diffential equations","221618903":"Dependent Gaussian Processes.","237067972":"Applied Smoothing Techniques for Data Analysis: The Kernel Approach with S-PLUS Illustrations","261001961":"Numerical Recipes in C—The Art of Scientific Computing","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","4742946":"Computer Model Calibration Using High-Dimensional Output","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","239666609":"Bayesian Learning for Neural Networks PhD thesis","31223586":"Some Matrix-Variate Distribution-Theory - Notational Considerations and a Bayesian Application","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","220179808":"A Stochastic Collocation Method for Elliptic Partial Differential Equations with Random Input Data"},"citedIn":{"265723990":"Multidimensional Adaptive Relevance Vector Machines for Uncertainty Quantification","260723305":"A nonparametric belief propagation method for uncertainty quantification with applications to flow in random porous media","270104828":"Uncertainty propagation using infinite mixture of Gaussian processes and variational Bayesian inference","259518271":"Uncertainty quantification for multiscale disk forging of polycrystal materials using probabilistic graphical model techniques","266135607":"Data-driven model for solar irradiation based on satellite observations","269193285":"Kriging-model-based uncertainty quantification in computational fluid dynamics","274426699":"Adaptive Locally Weighted Projection Regression Method for Uncertainty Quantification","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","266376755":"Sequential Design with Mutual Information for Computer Experiments (MICE): Emulation of a Tsunami Model","264492720":"Sparse multiresolution regression for uncertainty propagation","268458452":"Dynamic Adaptive Sampling Based on Kriging Surrogate Models for Efficient Uncertainty Quantification","282514304":"Low-cost multi-dimensional Gaussian process with application to uncertainty quantification","260166806":"Efficient Localization of Discontinuities in Complex Computational Simulations","280329794":"Emulation of Higher-Order Tensors in Manifold Monte Carlo Methods for Bayesian Inverse Problems","262491613":"Uncertainty analysis of flood inundation modeling using GLUE with surrogate models in stochastic sampling","256744084":"Multi-output separable Gaussian process: Towards an efficient, fully Bayesian paradigm for uncertainty quantification"},"index":997}