{"abs":"A new simulation approach, called ‘subset simulation’, is proposed to compute small failure probabilities encountered in reliability analysis of engineering systems. The basic idea is to express the failure probability as a product of larger conditional failure probabilities by introducing intermediate failure events. With a proper choice of the conditional events, the conditional failure probabilities can be made sufficiently large so that they can be estimated by means of simulation with a small number of samples. The original problem of calculating a small failure probability, which is computationally demanding, is reduced to calculating a sequence of conditional probabilities, which can be readily and efficiently estimated by means of simulation. The conditional probabilities cannot be estimated efficiently by a standard Monte Carlo procedure, however, and so a Markov chain Monte Carlo simulation (MCS) technique based on the Metropolis algorithm is presented for their estimation. The proposed method is robust to the number of uncertain parameters and efficient in computing small probabilities. The efficiency of the method is demonstrated by calculating the first-excursion probabilities for a linear oscillator subjected to white noise excitation and for a five-story nonlinear hysteretic shear building under uncertain seismic excitation.","title":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","id":222546544,"url":"https://www.researchgate.net/publication/222546544_Estimation_of_Small_Failure_Probabilities_in_High_Dimensions_by_Subset_Simulation","names":["Siu-Kui Au","James L. Beck","Probabilistic Engineering Mechanics"],"references":{"239387109":"Optimal Importance-Sampling Density Estimator","225828439":"Monte Carlo Methods","216637003":"Stochastic Process","245301372":"Basic Analysis of Structural Safety","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","200105001":"Equation of State by Fast Computing Machines","268312154":"Monte Carlo: Concepts, Algorithms, and Applications. Springer Series in Operations Research","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","229811935":"Asymptotic Expansion","221669734":"Equations of State Calculations by Fast Computing Machines","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","254333373":"Monte Carlo: Concepts, Algorithms, and Applications","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","245285867":"Asymptotic Expansions for Reliability and Moments of Uncertain Systems","222780925":"A new adaptive importance sampling scheme","240115410":"Methods for reliability assessment of non-linear systems under stochastic loading-A review","248560911":"Importance sampling in structural system","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{},"index":3}