{"abs":"We review adaptive Markov chain Monte Carlo algorithms (MCMC) as a mean to optimise their performance. Using simple toy examples we review their theoretical underpinnings, and in particular show why adaptive MCMC algorithms might fail when some fundamental properties are not satisfied. This leads to guidelines concerning the design of correct algorithms. We then review criteria and the useful framework of stochastic approximation, which allows one to systematically optimise generally used criteria, but also analyse the properties of adaptive MCMC algorithms. We then propose a series of novel adaptive algorithms which prove to be robust and reliable in practice. These algorithms are applied to artificial and high dimensional scenarios, but also to the classic mine disaster dataset inference problem.","title":"A tutorial on adaptive MCMC","id":49458431,"url":"https://www.researchgate.net/publication/49458431_A_tutorial_on_adaptive_MCMC","names":["Christophe Andrieu","Johannes Thoms","Statistics and Computing"],"references":{"2699816":"Stochastic Volatility: Likelihood Inference And Comparison With Arch Models","2762543":"Adaptive proposal distribution for random walk Metropolis algorithm. Comput Stat","224627813":"Stability of Stochastic Approximation under Verifiable Conditions","246427191":"Implementation and performance issues in the Bayesian and likelihood fitting of multilevel models. Computational Stat","2133547":"Does waste-recycling really improve Metropolis-Hastings Monte Carlo algorithm?","236736791":"A Stochastic Approximation Method","228280215":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","2767014":"Some Adaptive Monte Carlo Methods for Bayesian Inference","239064242":"Topics in controlled Markov chains","242577766":"Annealing Markov Chain Monte Carlo with Applications to Ancestral Inference","222990169":"A stationary stochastic approximation method","227197084":"Langevin-Type Models II: Self-Targeting Candidates for MCMC Algorithms*","270363787":"Adaptive Direction Sampling","1737229":"On the Ergodicity of the Adaptive Metropolis Algorithm on Unbounded Domains","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","2369980":"Delayed Rejection in Reversible Jump Metropolis-Hastings","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","247011232":"On Markov Chain Monte Carlo Acceleration","222298844":"Optimal acceptance rates for Metropolis algorithms: Movin beyond 0.234","225105014":"Waste-Recycling Monte Carlo","235541803":"Monte Carlo simulation of a many-fermion study","243104985":"Coupling and ergodicity of adaptive Markov chain Monte Carlo algorithms. J Appl Probab","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","227009696":"Adaptive Importance Sampling in General Mixture Classes","228789130":"Examples of adaptive MCMC","225166786":"Stochastic adaptive selection of weights in the simulated tempering algorithm. J. Ital. Stat. Soc. 7(1), 27-55","4788962":"On an adaptive version of the Metropolis-Hastings algorithm with independent proposal distribution","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","246323870":"Gilks WR: Efficient Metropolis jumping rules","4725113":"Efficient Bayesian Inference for Multiple Change-Point and Mixture Innovation Models","2750746":"Regeneration in Markov Chain Samplers","4771963":"Probabilistic Principal Component Analysis","3792908":"Adaptive stochastic approximation by the simultaneous perturbation method","45622656":"Monte Carlo Statistical Methods","3938437":"Simple adaptive algorithms for Cholesky, LDL/sup T/, QR, and eigenvalue decompositions of autocorrelation matrices for sensor array data","222356347":"Convergence and robustness of the Robbins-Monro algorithm truncated at randomly varying bounds","38322292":"An Adaptive Metropolis Algorithm","225195472":"An Application of Adaptive Independent Chain Metropolis–Hastings Algorithms in Bayesian Hazard Rate Estimation","244509996":"The Multiple-Try Method and Local Optimization in Metropolis Sampling","227604783":"Improving Convergence of the Hastings–Metropolis Algorithm with an Adaptive Proposal","5207408":"Adaptive sampling for Bayesian variable selection","2267623":"Population Markov Chain Monte Carlo","220258662":"Stability of Stochastic Approximation under Verifiable Conditions","1771219":"Bédard, M.: Weak convergence of metropolis algorithms for non-i.i.d. target distributions. Ann. Appl. Probab. 17, 1222-1244","2491114":"Em algorithms for pca and spca","2131950":"On the ergodic properties of some adaptive MCMC algorithms","38322438":"On adaptive Markov chain Monte Carlo algorithms","266216335":"A Stochastic Approximation Algorithm with Varying Bounds","4772123":"Efficient construction of reversible MCMC proposal distributions","3023867":"Spall, J.C.: Adaptive stochastic approximation by the simultaneous perturbation method. IEEE Trans. Autom. Contr. 45, 1839-1853","228910961":"The Wang-Landau algorithm in general state spaces: applications and convergence analysis","220343668":"Population Markov Chain Monte Carlo","245810545":"Coupling and Ergodicity of Adaptive MCMC","4993300":"MCMC methods for high dimensional inversion in remote sensing","2574717":"Controlled MCMC for optimal sampling","24111924":"An Adaptive Version for the Metropolis Adjusted Langevin Algorithm with a Truncated Drift","220286586":"Dram: efficient adaptive MCMC","248132886":"Towards Automatic Reversible Jump Markov Chain Monte Carlo","243739482":"Efficient Metropolis Jumping Rules","228636543":"On the Containment Condition for Adaptive Markov Chain Monte Carlo Algorithms","226385182":"Componentwise adaptation for high dimensional MCMC. Comput Stat","222446496":"Posterior simulation and Bayes factors in panel count data model","2757197":"Adaptation for Self Regenerative MCMC","1742454":"Limit theorems for some adaptive MCMC algorithms with subgeometric kernels (II","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","2834503":"Trans-Dimensional Markov Chain Monte Carlo","243776875":"Spatial Statistics and Bayesian Computing","267463325":"Accelerated Stochastic Approximation","3114818":"A Stochastic Approximation Method","45870805":"Optimal scaling of the random walk Metropolis on elliptically symmetric unimodal targets","10896456":"A Constrained EM Algorithm for Principal Component Analysis","220769734":"On the efficiency of adaptive MCMC algorithms","4203185":"An em-based subspace tracker for wireless communication applications","4995513":"Stochastic Volatility: Likelihood Inference and Comparison with ARCH Models","3022552":"General results on the convergence of stochastic algorithms","23630879":"Convergence of Adaptive Direction Sampling","234807431":"Adaptive Algorithms and Stochastic Approximation","37146447":"A Stochastic Approximation Algorithm with Step-Size Adaptation","234108809":"Variational MCMC","38366903":"Accelerated Stochastic Approximation","2351453":"General Results on the Convergence of Stochastic Algorithms"},"citedIn":{"277959058":"Gradient-free Hamiltonian Monte Carlo with Efficient Kernel Exponential Families","51969309":"Fluctuations of Interacting Markov Chain Monte Carlo Models","280932795":"State-dependent swap strategies and automatic reduction of number of temperatures in adaptive parallel tempering algorithm","279458734":"Leave Pima Indians alone: binary regression as a benchmark for Bayesian computation","228337292":"Adaptive Markov Chain Monte Carlo for Bayesian Variable Selection","266871035":"lgcp – An R Package for Inference with Spatial and Spatio-Temporal Log-Gaussian Cox Processes","228338569":"An Adaptive Sequential Monte Carlo Method for Approximate Bayesian Computation","232143555":"Observing the Galaxy\u0027s massive black hole with gravitational wave bursts","1737229":"On the Ergodicity of the Adaptive Metropolis Algorithm on Unbounded Domains","259441004":"Spatial and Spatio-Temporal Log-Gaussian Cox Processes: Extending the Geostatistical Paradigm","258229112":"A Bayesian linear model for the high-dimensional inverse problem of seismic tomography","277726097":"Optimized sampling distribution based on nonparametric learning for improved compressive sensing performance","228573826":"On Adaptive Metropolis-Hastings Methods","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","228573824":"Tuning of Markov chain Monte Carlo algorithms using copulas","221008179":"Gaussian Adaptation as a unifying framework for continuous black-box optimization and adaptive Monte Carlo sampling","256117860":"Adaptive Metropolis Algorithm Using Variational Bayesian Adaptive Kalman Filter","224133501":"A tutorial on stochastic approximation algorithms for training Restricted Boltzmann Machines and Deep Belief Nets","256680558":"Bayesian parameter estimation for a jet-milling model using Metropolis–Hastings and Wang–Landau sampling","273706611":"Evaluation of a MISR-based high-resolution aerosol retrieval method using AERONET DRAGON campaign data","46583525":"Estimating Discrete Markov Models From Various Incomplete Data Schemes","225080398":"Identifying targets of multiple co-regulating transcription factors from expression time-series by Bayesian model comparison","262732940":"Kinematic modelling of the Milky Way using the RAVE and GCS stellar surveys","255971684":"Adaptive Sticky Generalized Metropolis","45916313":"An Adaptive Sequential Monte Carlo Sampler","278005943":"Parameters estimation for jump-diffusion process based on low and high frequency data","267764947":"Stochastic Recognition of Regular Structures in Facade Images","270913282":"A Bayesian mixed shrinkage prior procedure for spatial–stochastic basis selection and evaluation of gPC expansions: Applications to elliptic SPDEs","51871039":"Global Parameter Identification of Stochastic Reaction Networks from Single Trajectories","240838259":"Estimation of Failure Probability and Its Applications in Reliability Data Analysis","236640823":"A Method for Efficiently Sampling From Distributions With Correlated Dimensions","259695434":"Exact Bayesian Inference for the Bingham Distribution","264499699":"Probabilistic identification of simulated damage on the Dowling Hall footbridge through Bayesian finite element model updating","45882765":"Kernel estimators of asymptotic variance for adaptive Markov chain Monte\nCarlo","251318222":"Time-Varying Sparsity in Dynamic Regression Models","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","220308244":"A Monte Carlo Method for High-Dimensional Volume Estimation and Application to Polytopes","275211346":"Hierarchical Bayesian model updating for structural identification","260524720":"Time-dependent reliability analysis using Bayesian MCMC on the reduction of reservoir storage by sedimentation","224907102":"Adaptive parallel tempering algorithm","234979645":"Simultaneous Sampling and Multi-Structure Fitting with Adaptive Reversible Jump MCMC","270593820":"Auxiliary Variable Markov Chain Monte Carlo for Spatial Survival and Geostatistical Models","271855369":"Bayesian computation: a perspective on the current state, and sampling backwards and forwards","263156975":"Annealed Importance Sampling Reversible Jump MCMC Algorithms","277931219":"Parametric preference functionals under risk in the gain domain: A Bayesian analysis","258247200":"Second-order Particle MCMC for Bayesian Parameter Inference","220183385":"Robust Adaptive Photon Tracing Using Photon Path Visibility","232994731":"The Bayesian Framework for Inverse Problems in Heat Transfer","235903559":"PReMiuM: An R Package for Profile Regression Mixture Models using Dirichlet Processes","228102867":"Adaptive Equi-Energy Sampler : Convergence and Illustration","256716289":"Wang G, Chen S.. A review on parameterization and uncertainty in modeling greenhouse gas emissions from soil. Geoderma 170: 206-216","278629589":"Simulation Based Nearest Neighbor Entropy Estimation for (Adaptive) MCMC Evaluation","236124482":"On the particle Gibbs sampler","267986090":"Smoothness of Metropolis-Hastings algorithm and application to entropy estimation","268474963":"Extracting the Italian output gap: a Bayesian approach","228261326":"Density-Tempered Marginalized Sequential Monte Carlo Samplers","45860846":"Riemannian Manifold Hamiltonian Monte Carlo","228902898":"Distributed Markov chain Monte Carlo","51949121":"lgcp An R Package for Inference with Spatio-Temporal Log-Gaussian Cox\nProcesses","24167977":"Divide and Conquer: A Mixture-Based Approach to Regional Adaptation for MCMC","257338124":"Parameter estimation in stochastic differential equations with Markov chain Monte Carlo and non-linear Kalman filtering","283104388":"Constructing optimal transition matrix for Markov chain Monte Carlo","235755603":"Performance of a new dynamic model for predicting diurnal time courses of stomatal conductance at the leaf level","228547327":"New Hybrid Monte Carlo Methods for Efficient Sampling: from Physics to Biology and Statistics","45934557":"Combining spatial information sources while accounting for systematic\nerrors in proxies","45881822":"Limit theorems for some adaptive MCMC algorithms with subgeometric kernels: Part II","222094681":"Global Parameter Identification of Stochastic Reaction Networks from Single Trajectories","47637681":"Discussion of \"Riemann manifold Langevin and Hamiltonian Monte Carlo methods\u0027\u0027 by M. Girolami and B. Calderhead","275248384":"Quantitative rheological model selection: Good fits versus credible models using Bayesian inference","254212174":"A General Purpose Sampling Algorithm for Continuous Distributions (the t-walk)","257419070":"A general algorithm scheme mixing computational intelligence with Bayesian simulation","233842332":"1105.1508v2","51914869":"Efficient emulators of computer experiments using compactly supported correlation functions, with application to cosmology","247152854":"The Containment Condition and AdapFail algorithms","268441712":"ON THE CONVERGENCE OF UNCONSTRAINED ADAPTIVE MARKOV CHAIN MONTE CARLO ALGORITHMS","259505922":"Selection of polynomial chaos bases via Bayesian model uncertainty methods with applications to sparse approximation of PDEs with stochastic inputs","280496847":"Gradient-based MCMC samplers for Dynamic Causal Modelling","252341360":"Adaptive Markov Chain Monte Carlo: Theory and Methods","45903815":"Free Energy Methods for Bayesian Inference: Efficient Exploration of\nUnivariate Gaussian Mixture Posteriors","276259852":"Efficient computational strategies for Bayesian social networks","234019982":"Markov chain Monte Carlo inference for Markov jump processes via the linear noise approximation","45924545":"Adaptive Optimal Scaling of Metropolis-Hastings Algorithms Using the Robbins-Monro Process","283457432":"Real-time automated EEG tracking of brain states using neural field theory","280050382":"Joint estimation of quantile planes over arbitrary predictor spaces","236687972":"Adaptive Metropolis-Hastings Sampling using Reversible Dependent Mixture Proposals","279633109":"Robbins-Monro with Random Truncations in a Hilbert Space for Relative Entropy Minimization","50893706":"Automatic Step Size Selection in Random Walk Metropolis Algorithms","227522317":"Particle Markov Chain Monte Carlo . . .","227369231":"Learn From Thy Neighbor: Parallel-Chain and Regional Adaptive MCMC","256376004":"Quantitative convergence rates for sub-geometric Markov chains","281849935":"SMELLY PARALLEL MCMC CHAINS","271387816":"Adaptive Scheduling in MCMC and Probabilistic Programming","233174112":"E-Bayesian Estimation and Hierarchical Bayesian Estimation of Failure Probability","51538583":"Mesoporous silica SBA-15 sheet with perpendicular nanochannels","50283897":"Estimation of Failure Probability and Its Applications in Lifetime Data Analysis","260270341":"Modelling the continental-scale spread of Schmallenberg virus in Europe: Approaches and challenges","51644819":"Efficient characterization of high-dimensional parameter spaces for systems biology. Submitted to BMC Systems Biology","259953913":"Inference for reaction networks using the linear noise approximation","267656829":"Comparison of Frequentist and Bayesian Confidence Analysis Methods on a Viscoelastic Stenosis Model","51946386":"The Wang-Landau algorithm reaches the Flat Histogram criterion in finitetime","232244573":"A Copula Based Bayesian Approach for Paid-Incurred Claims Models for\nNon-Life Insurance Reserving","51917204":"Sequential Monte Carlo EM for multivariate probit models","265295453":"Efficient Gaussian Sampling for Solving Large-Scale Inverse Problems using MCMC","24166398":"On the stability and ergodicity of adaptive scaling Metropolis algorithms. Stochastic Process","258753506":"Geometrically Constructed Markov Chain Monte Carlo Study of Quantum Spin-phonon Complex Systems","51938199":"An Adaptive Interacting Wang-Landau Algorithm for Automatic Density Exploration","265209665":"Augmentation Schemes for Particle MCMC","258553083":"Using discharge data to reduce structural deficits in a hydrological model with Bayesian inference approach and the implications for the prediction of critical source areas","228677431":"Convergence of adaptive MCMC algorithms: Ergodicity and law of large numbers","51916417":"A central limit theorem for adaptive and interacting Markov chains","272482980":"PReMiuM: An R Package for Profile Regression Mixture Models using Dirichlet Processes","251726491":"To Screen or Not to Screen: Colon Cancer Rates in a County System Without Screening Colonoscopies for the Underprivileged Population","51893132":"Approximate inference via variational sampling","230826588":"Adaptive Markov chain Monte Carlo forward projection for statistical analysis in epidemic modelling of human papillomavirus","231177305":"Parallel Markov chain Monte Carlo - Bridging the gap to high-performance Bayesian computation in animal breeding and genetics","47819641":"Robust adaptive Metropolis algorithm with coerced acceptance rate","262841099":"Forgetting the starting distribution in finite interacting tempering","261198640":"On the Fully Bayesian Treatment of Latent Gaussian Models using Stochastic Simulations","260790825":"Parallel Inverse Modeling and Uncertainty Quantification for Computationally Demanding Groundwater-Flow Models Using Covariance Matrix Adaptation","272745189":"Polynomial Chaos based on the parallelized ensamble Kalman filter to estimate precipitation states","279260160":"The Nearest Neighbor entropy estimate: an adequate tool for adaptive MCMC evaluation","44597005":"Reinforcement Learning with Limited Reinforcement: Using Bayes Risk for Active Learning in POMDPs.","51181481":"A Bayesian Framework for Parameter Estimation in Dynamical Models","221700496":"Convergence of adaptive and interacting Markov chain Monte Carlo\nalgorithms","280330526":"Geometric ergodicity of the Random Walk Metropolis with position-dependent proposal covariance","51956659":"The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian\nMonte Carlo","254778500":"Bayesian tests on components of the compound symmetry covariance matrix","263288090":"Simulated Stochastic Approximation Annealing for Global Optimization With a Square-Root Cooling Schedule","45923857":"Free Energy Sequential Monte Carlo, Application to Mixture Modelling","258229450":"Comment on Article by Schmidl et al","232063589":"Adaptive MCMC with online relabeling (Extended version)","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","241095403":"Detecting community structure using biased random merging","45882123":"Can the Adaptive Metropolis Algorithm Collapse Without the Covariance\nLower Bound?","256114931":"The Importance and Challenges of Bayesian Parameter Learning in Systems Biology","255655296":"Adaptive Monte Carlo for Binary Regression with Many Regressors","254401172":"Free Energy Methods for Efficient Exploration of Mixture Posterior Densities","254401175":"Adaptive Monte Carlo on Multivariate Binary Sampling Spaces","279070817":"MCMC algorithms for Subset Simulation","228095582":"Bayesian Posterior Sampling via Stochastic Gradient Fisher Scoring","263306103":"Selecting Parameters for Bayesian Calibration of a Process-Based Model: A Methodology Based on Canonical Correlation Analysis","258715043":"Modeling and Bayesian Parameter Estimation for Shape Memory Alloy Bending Actuators","233532195":"Computational Aspects of Bayesian Spectral Density Estimation","259212728":"A method for importance sampling through Markov chain Monte Carlo with post sampling variational estimate","273703579":"Gradient-free MCMC Methods for Dynamic Causal Modelling.","277967965":"Adaptive MCMC with online relabeling","263888759":"Adaptive Markov chain Monte Carlo sampling and estimation in Mata","220286447":"A computational framework for empirical Bayes inference","233720865":"MCMC inference for Markov Jump Processes via the Linear Noise\nApproximation","272017380":"Posterior inference on parameters of stochastic differential equations via non-linear Gaussian filtering and adaptive MCMC","221662690":"INLA or MCMC? A Tutorial and Comparative Evaluation for Spatial\nPrediction in log-Gaussian Cox Processes","261136709":"Convergence of Markovian Stochastic Approximation with discontinuous dynamics","45932394":"Parametric families on large binary spaces","263048571":"Bayesian Benchmark Dose Analysis","236251596":"Bayesian characterization of uncertainty in intra-subject non-rigid registration","228385856":"Adaptive Monte Carlo for Bayesian Variable Selection in Regression Models","237842928":"Astrometric orbit of a low-mass companion to an ultracool dwarf","233354806":"Probabilistic Forecast and Uncertainty Assessment of Hydrologic Design Values Using Bayesian Theories","228636543":"On the Containment Condition for Adaptive Markov Chain Monte Carlo Algorithms","262345340":"On spectral invariance of randomized hessian and covariance matrix adaptation schemes","234005037":"Moving Average Stochastic Volatility Models with Application to Inflation Forecast","230795296":"Adaptive Markov Chain Monte Carlo confidence intervals","260231779":"Bayesian Model-Averaged Benchmark Dose Analysis Via Reparameterized Quantal-Response Models","46494247":"Grapham: Graphical models with adaptive random walk Metropolis algorithms","230531934":"Manifold MCMC for Mixtures","262642767":"Emulating and calibrating the multiple-fidelity Lyon–Fedder–Mobarry magnetosphere–ionosphere coupled computer model","50425579":"On the Stability of Sequential Monte Carlo Methods in High Dimensions","221986001":"Hierarchical multispectral galaxy decomposition using a MCMC algorithm with multiple temperature simulated annealing","261456511":"Reliability analysis of an electric control system based on type I censored test zero-failure data using Bayesian methods","241092277":"E-Bayesian estimation of the reliability derived from Binomial distribution","282570552":"A Bayesian approach to constrained single- and multi-objective optimization","236627438":"A Bayesian analysis pipeline for continuous GW sources in the PTA band","48198951":"Sequential Monte Carlo on large binary sampling spaces","259657607":"A Statistical Approach To The Inverse Problem In Magnetoencephalography","280946496":"An adaptive independence sampler MCMC algorithm for infinite-dimensional bayesian inference","283709975":"Anisotropic Gaussian Mutations for Metropolis Light Transport through Hessian-Hamiltonian Dynamics","228204645":"Facebook for Patients: Examining the Antecedents and Consequences of Medical Disclosure on Healthcare Social Media","263747143":"Skew mixture models for loss distributions: A Bayesian approach"},"index":4}