{"abs":"A Stepwise Uncertainty Reduction (SUR) strategy aims at constructing a sequence X 1 (f), X 2 (f), . . . of evaluation points of a function f : R d → R in such a way that the residual uncertainty about a quantity of interest S(f) given the information provided by the evaluation results is small. In Bect, Ginsbourger, Li, Picheny and Vazquez, Statistics and Computing, 2011, several SUR approaches have been shown to be particularly efficient for the problem of estimating the volume of an excursion set of a function f above a threshold. Here, we build upon these results and we present fast implementations of some SUR strategies, which are based on two ideas. The first idea is to take advantage of update formulas for kriging. The second idea is to derive closed-form expressions for some integrals that appear in the SUR criteria. We are able to demonstrate significant speed-ups and we illustrate our algorithms on a nuclear safety application.","title":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","id":228438518,"url":"https://www.researchgate.net/publication/228438518_Fast_Parallel_Kriging-Based_Stepwise_Uncertainty_Reduction_With_Application_to_the_Identification_of_an_Excursion_Set","names":["Clément Chevalier","Julien Bect","David Ginsbourger","Victor Picheny","Yann Richet","Emmanuel Vazquez","Technometrics"],"references":{},"citedIn":{"290480885":"Active learning surrogate models for the conception of systems with multiple failure modes","283762016":"ABC for climate: dealing with expensive simulators","262369166":"KrigInv: An efficient and user-friendly implementation of batch-sequential inversion strategies based on Kriging","277608966":"Selection Criterion Based on an Exploration-Exploitation Approach for Optimal Design of Experiments","257299288":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction","282570552":"A Bayesian approach to constrained single- and multi-objective optimization","281895996":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","258831644":"Estimating and quantifying uncertainties on level sets using the Vorob’ev expectation and deviation with gaussian process models","269280638":"Asymptotic analysis of covariance parameter estimation for Gaussian processes in the misspecified case","272891057":"Quantifying uncertainty on Pareto fronts with Gaussian Process conditional simulations","281946744":"Quantifying and reducing uncertainties on excursion sets under a gaussian random field prior","272040385":"Construction and Efficient Implementation of Adaptive Objective-Based Designs of Experiments","266829244":"Chinese translation of [Design and Analysis of Simulation Experiments]","264936662":"A new integral loss function for Bayesian optimization","284330223":"Estimating and Quantifying Uncertainties on Level Sets Using the Vorob’ev Expectation and Deviation with Gaussian Process Models"},"index":9}