{"abs":"Hidden conditional random fields (HCRFs) are discriminative latent variable models which have been shown to successfully learn the hidden structure of a given classification problem. An Infinite hidden conditional random field is a hidden conditional random field with a countably infinite number of hidden states, which rids us not only of the necessity to specify a priori a fixed number of hidden states available but also of the problem of overfitting. Markov chain Monte Carlo (MCMC) sampling algorithms are often employed for inference in such models. However, convergence of such algorithms is rather difficult to verify, and as the complexity of the task at hand increases the computational cost of such algorithms often becomes prohibitive. These limitations can be overcome by variational techniques. In this paper, we present a generalized framework for infinite HCRF models, and a novel variational inference approach on a model based on coupled Dirichlet Process Mixtures, the HCRF-DPM. We show that the variational HCRF-DPM is able to converge to a correct number of represented hidden states, and performs as well as the best parametric HCRFs—chosen via cross-validation—for the difficult tasks of recognizing instances of agreement, disagreement, and pain in audiovisual sequences.","title":"Variational Infinite Hidden Conditional Random Fields","id":273488773,"url":"https://www.researchgate.net/publication/273488773_Variational_Infinite_Hidden_Conditional_Random_Fields","names":[],"references":{"224680516":"On the Goldstein-Levitin-Polyak gradient projection method","3027596":"On the Goldstein-Levitin-Polyak gradient projection method","44572779":"The Infinite Hidden Markov Random Field Model","32896369":"Hierarchical Dirichlet Processes","254212736":"Variational inference for Dirichlet process mixtures. Bayesian Anal 1:121-144","224088060":"OpenEAR - Introducing the Munich open-source emotion and affect recognition toolkit","221345210":"Beam sampling for the infinite hidden Markov model","222430190":"Social Signal Processing: Survey of an Emerging Domain","260353896":"Infinite Hidden Conditional Random Fields for Human Behavior Analysis","224238096":"Modeling hidden dynamics of multimodal cues for spontaneous agreement and disagreement recognition","221292544":"Painful data: The UNBC-McMaster shoulder pain expression archive database","225797350":"Nonparametric Bayesian Image Segmentation","221344933":"An HDP-HMM for systems with state persistence","6139655":"Hidden Conditional Random Fields"},"citedIn":{},"index":4}