{"abs":"Stochastic variational inference (SVI) is emerging as the most promising candidate for scaling inference in Bayesian probabilistic models to large datasets. However, the performance of these methods has been assessed primarily in the context of Bayesian topic models, particularly latent Dirichlet allocation (LDA). Deriving several new algorithms, and using synthetic, image and genomic datasets, we investigate whether the understanding gleaned from LDA applies in the setting of sparse latent factor models, specifically beta process factor analysis (BPFA). We demonstrate that the big picture is consistent: using Gibbs sampling within SVI to maintain certain posterior dependencies is extremely effective. However, we find that different posterior dependencies are important in BPFA relative to LDA. Particularly, approximations able to model intra-local variable dependence perform best.","title":"An Empirical Study of Stochastic Variational Algorithms for the Beta Bernoulli Process","id":279309917,"url":"https://www.researchgate.net/publication/279309917_An_Empirical_Study_of_Stochastic_Variational_Algorithms_for_the_Beta_Bernoulli_Process","names":["Amar Shah","David A. Knowles","Zoubin Ghahramani"],"references":{"228095582":"Bayesian Posterior Sampling via Stochastic Gradient Fisher Scoring","228095632":"Variational Bayesian Inference with Stochastic Search","221346425":"Bayesian Learning via Stochastic Gradient Langevin Dynamics","228083473":"Fixed-Form Variational Posterior Approximation through Stochastic Linear Regression","41781559":"Gaussian Process for Machine Learning","220848162":"Infinite Sparse Factor Analysis and Infinite Independent Components Analysis","221618878":"Non-Parametric Bayesian Dictionary Learning for Sparse Image Representations.","220320618":"Nonparametric Bayesian Matrix Factorization by Power-EP.","230996489":"A Bayesian Nonparametric Approach to Image Super-Resolution","38359431":"Nonparametric Bayes Estimators Based on Beta Processes in Models for Life History Data","267805753":"Spike and Slab Variational Inference for Multi-Task and Multiple Kernel Learning","47843669":"Nonparametric Bayesian sparse factor models with application to gene\nexpression modeling","2522345":"Bayesian Factor Regression Models in the \"Large p, Small n\" Paradigm","221346465":"Nonparametric factor analysis with Beta process priors","247935319":"Bayesian Nonparametric Models","2468788":"Estimating Mixture of Dirichlet Process Models","228095627":"Sparse Stochastic Inference for Latent Dirichlet allocation","259400035":"Auto-Encoding Variational Bayes","220270203":"Infinite Latent Feature Models and the Indian Buffet Process","243766298":"Exchangeability and Related Topics","221620392":"Large Scale Nonparametric Bayesian Inference: Data Parallelisation in the Indian Buffet Process","221619411":"Sharing Clusters among Related Groups: Hierarchical Dirichlet Processes.","2239690":"Variational Inference for Bayesian Mixtures of Factor Analysers","221618332":"Online Learning for Latent Dirichlet Allocation","268079632":"Beta Process Non-negative Matrix Factorization with Stochastic Structured Mean-Field Variational Inference","236661557":"Scaling the Indian Buffet Process via Submodular Maximization","222817462":"Mean-field variational approximate Bayesian inference for latent variable models","5606886":"Image denoising using scale mixtures of Gaussians in the wavelet domain","2433873":"Natural Gradient Works Efficiently in Learning","220320085":"The Indian Buffet Process: An Introduction and Review","228092206":"Stochastic Variational Inference","228914332":"Bounded Approximations for Marginal Likelihoods","254295504":"Regression Density Estimation With Variational Methods and Stochastic Approximation","45865922":"The Infinite Hierarchical Factor Regression Model"},"citedIn":{},"index":6}