{"abs":"We show that a multilayer perceptron (MLP) with arbitrary depth and nonlinearities, with dropout applied after every weight layer, is mathematically equivalent to an approximation to a well known Bayesian model. This interpretation offers an explanation to some of dropout\u0027s key properties, such as its robustness to over-fitting. Our interpretation allows us to reason about uncertainty in deep learning, and allows the introduction of the Bayesian machinery into existing deep learning frameworks in a principled way. This document is an appendix for the main paper \"Dropout as a Bayesian Approximation: Representing Model Uncertainty in Deep Learning\" by Gal and Ghahramani, 2015.","title":"Dropout as a Bayesian Approximation: Appendix","id":277959103,"url":"https://www.researchgate.net/publication/277959103_Dropout_as_a_Bayesian_Approximation_Appendix","names":["Yarin Gal","Zoubin Ghahramani"],"references":{"257069490":"Gaussian Processes for Big Data","11216584":"Marginalized kernels for biological sequences","246546737":"Dropout Training as Adaptive Regularization","259367763":"Playing Atari with Deep Reinforcement Learning","260089482":"Distributed Variational Inference in Sparse Gaussian Process Regression and Latent Variable Models","221619263":"Gaussian Process Dynamical Models.","232805135":"Deep Gaussian Processes","13853244":"Long Short-term Memory","273388187":"Latent Gaussian Processes for Distribution Estimation of Multivariate Categorical Data","201976635":"On the Likelihood That One Unknown Probability Exceeds Another in View of the Evidence of Two Samples","267706055":"Practical Variational Inference for Neural Networks","259400035":"Auto-Encoding Variational Bayes","269996418":"Gaussian Processes for Machine Learning (Adaptive Computation and Machine Learning)","228092206":"Stochastic Variational Inference","262991675":"Stochastic Backpropagation and Approximate Inference in Deep Generative Models","239666609":"Bayesian Learning for Neural Networks PhD thesis","30771436":"MacKay, D.J.C.: A Practical Bayesian Framework for Backprop Networks. Neural Computation 4(3), 448-472","220320635":"Bayesian Gaussian Process Latent Variable Model.","277022910":"Weight Uncertainty in Neural Networks","267960550":"ImageNet Classification with Deep Convolutional Neural Networks"},"citedIn":{},"index":9}