{"abs":"To account for measurement error (ME) in explanatory variables, Bayesian approaches provide a flexible framework, as expert knowledge can be incorporated in the prior distributions. Recently, integrated nested Laplace approximations have been proven to be a computationally convenient alternative to sampling approaches for Bayesian inference in latent Gaussian models. We show how the most common approaches to adjust for ME, the classical and the Berkson ME, fit into this framework. This is achieved through a reformulation with augmented pseudo-observations and a suitable extension of the latent Gaussian field. Two specific classes are described, which allow for a particularly simple implementation using integrated nested Laplace approximations. We present three applications within the framework of generalized linear (mixed) models with ME. To illustrate the practical feasibility, R code is provided in on-line supplementary material.","title":"Bayesian analysis of measurement error models using integrated nested Laplace approximations","id":263671491,"url":"https://www.researchgate.net/publication/263671491_Bayesian_analysis_of_measurement_error_models_using_integrated_nested_Laplace_approximations","names":["Stefanie Muff","Andrea Riebler","Leonhard Held","Håvard Rue","Philippe Saner","Journal of the Royal Statistical Society Series C Applied Statistics"],"references":{},"citedIn":{"279634298":"Analysis of massive marked point patterns with stochastic partial differential equations","260946444":"Penalising model component complexity: A principled, practical approach to constructing priors","281679886":"Network meta-analysis with integrated nested Laplace approximations","281809563":"Consequences of measurement error for inference in cross‐lagged panel design—the example of the reciprocal causal relationship between subjective health and socio‐economic status","280307068":"Measurement error modelling for accelerometer activity data using Bayesian integrated nested Laplace approximation","273761323":"Reverse Attenuation in Interaction Terms due to Covariate Measurement Error"},"index":1004}