{"abs":"We connect known results about diffusion limits of Markov chain Monte Carlo (MCMC) algorithms to the Computer Science notion of algorithm complexity. Our main result states that any diffusion limit of a Markov process implies a corresponding complexity bound (in an appropriate metric). We then combine this result with previously-known MCMC diffusion limit results to prove that under appropriate assumptions, the Random-Walk Metropolis (RWM) algorithm in $d$ dimensions takes $O(d)$ iterations to converge to stationarity, while the Metropolis-Adjusted Langevin Algorithm (MALA) takes $O(d^{1/3})$ iterations to converge to stationarity.","title":"Complexity Bounds for MCMC via Diffusion Limits","id":267812048,"url":"https://www.researchgate.net/publication/267812048_Complexity_Bounds_for_MCMC_via_Diffusion_Limits","names":["Gareth O. Roberts","Jeffrey S. Rosenthal"],"references":{"232276216":"Optimal scaling of random walk Metropolis algorithms with discontinuous\ntarget densities","38323880":"A Class of Wasserstein Metrics for Probability Distributions","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","45856473":"Conditions for Rapid Mixing of Parallel and Simulated Tempering on Multimodal Distributions","2111878":"General state space Markov chains and MCMC algorithms","221591101":"The Complexity of Theorem-Proving Procedures","30045859":"Optimal Scaling for Random Walk Metropolis on Spherically Constrained Target Densities","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","45870805":"Optimal scaling of the random walk Metropolis on elliptically symmetric unimodal targets","38363224":"Inference From Iterative Simulation Using Multiple Sequences","225635105":"Optimal Scaling of Random Walk Metropolis Algorithms with Non-Gaussian Proposals","2842974":"Geometric Ergodicity and Hybrid Markov Chains","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","2129242":"Optimal scaling for partially updating MCMC algorithms","222298844":"Optimal acceptance rates for Metropolis algorithms: Movin beyond 0.234","2113436":"Sufficient burn-in for Gibbs samplers for a hierarchical random effects model.The Annals of Statistics, 32(2):784-817"},"citedIn":{"279309732":"Efficiency of delayed-acceptance random walk Metropolis algorithms"},"index":1007}