{"abs":"Covariation between vital rates is recognized as an important pattern to be accounted for in demographic modeling. We recently introduced a model for estimating vital rates and their covariation as a function of known and unknown effects, using generalized linear mixed models (GLMM\u0027s) implemented in a hierarchical Bayesian framework (Evans et al., 2010) In particular, this model included a model-wide year effect (YEAR) influencing all vital rates, which we used to estimate covariation between vital rates due to exogenous factors not directly included in the model. This YEAR effect connected the GLMMs of vital rates into one large model; we refer to this as the \"connected GLMMs\" approach. Here we used a simulation study to evaluate the performance of a simplified version of this model, compared to separate GLMMs of vital rates, in terms of their ability to estimate correlations between vital rates. We simulated data from known relationships between vital rates and a covariate, inducing correlations among the vital rates. We then estimated those correlations from the simulated data using connected vs. separate GLMMs with year random effects. We compared precision and accuracy of estimated vital rates and their correlations under three scenarios of the pervasiveness of the exogenous effect (and thus true correlations). The two approaches provide equally good point estimates of vital rate parameters, but connected GLMMs provide better estimates of covariation between vital rates than separate GLMMs, both in terms of accuracy and precision, when the common influence on vital rates is pervasive. We discuss the situations where connected GLMMs might be best used, as well as further areas of investigation for this approach.","title":"Estimating covariation between vital rates: A simulation study of connected vs. separate generalized linear mixed models (GLMMs)","id":223978298,"url":"https://www.researchgate.net/publication/223978298_Estimating_covariation_between_vital_rates_A_simulation_study_of_connected_vs_separate_generalized_linear_mixed_models_GLMMs","names":["Margaret E K Evans","Kent Holsinger","Theoretical Population Biology"],"references":{},"citedIn":{"246546435":"Metapopulation viability of a globally endangered gazelle on the Northeast Qinghai–Tibetan Plateau","233749853":"Structured Population Models: Introduction","232219577":"Structured-Population Models: Many Methods, a Few Basic Concepts"},"index":1009}