{"abs":"The assessment of the functional failure probability of a thermal-hydraulic (T-H) passive system can be done by Monte Carlo (MC) sampling of the uncertainties affecting the T-H system model and its parameters. The computational effort associated to this approach can be prohibitive because of the large number of lengthy T-H code simulations necessary for the accurate and precise quantification of the (typically small) failure probability. To overcome this issue, in the present paper we propose an Adaptive Metamodel-Based Subset Importance Sampling (AM-SIS) approach that originally and efficiently combines the powerful features of several advanced computational methods of literature: in particular, Subset Simulation (SS) and fast-running Artificial Neural Network (ANN) metamodels are coupled within an adaptive MC-based Importance Sampling (IS) scheme. The objective is to construct a fully nonparametric estimator of the ideal, zero-variance Importance Sampling Density (ISD) and iteratively refine it, in such a way that: (i) the accuracy and precision of the corresponding failure probability estimates are improved and (ii) the number of burdensome T-H code runs is reduced, along with the associated computational cost. The method is demonstrated on a case study of an emergency passive decay heat removal system of a Gas-cooled Fast Reactor (GFR). A thorough comparison is made with respect to several advanced MC methods of literature.","title":"Estimating the small failure probability of a nuclear passive safety system by means of an efficient Adaptive Metamodel-Based Subset Importance Sampling method","id":280310254,"url":"https://www.researchgate.net/publication/280310254_Estimating_the_small_failure_probability_of_a_nuclear_passive_safety_system_by_means_of_an_efficient_Adaptive_Metamodel-Based_Subset_Importance_Sampling_method","names":["Nicola Pedroni","Enrico Zio"],"references":{"226439292":"Approximation by superpositions of a sigmoidal function. Math Cont Sig Syst (MCSS) 2:303-314","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","257101719":"A new adaptive response surface method for reliability analysis","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","263281405":"Markov analysis for time dependent success criteria of passive decay heat removal system","265727384":"Stochastic Simulation: Algorithms and Analysis","281770821":"Engineering Risk Assessment with Subset Simulation","272101816":"A new surrogate modeling technique combining Kriging and polynomial chaos expansions – Application to uncertainty analysis in computational dosimetry","239348049":"An optimized Line Sampling method for the estimation of the failure probability of nuclear passive systems","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","51890126":"Metamodel-based importance sampling for structural reliability analysis","256816914":"How to effectively compute the reliability of a thermal–hydraulic nuclear passive system","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","222885227":"Quantitative functional failure analysis of a thermal–hydraulic passive system by means of bootstrapped Artificial Neural Networks","257665533":"Markov chain importance sampling with applications to rare event probability analysis","222378983":"The role of the design point for calculating failure probabilities in view of dimensionality and structural nonlinearities","241947137":"The Impact of Uncertainties on the Performance of Passive Systems","270788488":"Reliability Study of a Special Decay Heat Removal System of a Gas-Cooled Fast Reactor Demonstrator","259518746":"AK-SYS: An adaptation of the AK-MCS method for system reliability","222431471":"Reliability analysis of a passive cooling system using a response surface with an application to the flexible conversion ratio reactor","256080947":"Extreme quantile estimation with nonparametric adaptive importance sampling","223287356":"Filtered importance sampling with support vector margin: A powerful method for structural reliability analysis","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","260217145":"Integration of the functional reliability of two passive safety systems to mitigate a SBLOCA+BO in a CAREM-like reactor PSA","220286431":"Efficient Monte Carlo simulation via the generalized splitting method"},"citedIn":{},"index":101}