{"abs":"1. Wildlife managers are limited in the inferences they can draw about low density populations. These limits are imposed by biases in monitoring data not regularly accounted for. 2. We developed a Bayesian hierarchical model to correct biases arising from imperfect detection and spatial autocorrelation. Our analysis incorporated model selection uncertainty by treating model probabilities as parameters to be estimated in the context of model fitting. We fitted our model to count data from a monitoring programme for the mountain plover Charadrius montanus, a low density bird species in Nebraska, USA. 3. Our results demonstrated that previous accounts of the abundance and distribution of plovers in Nebraska were impacted by low detection probabilities (∼5–20%). Uncorrected relative abundance estimates showed that the average number of birds per agricultural section increased over time, whereas corrected estimates showed that average abundance was stable. 4. Our method spatially interpolated relative abundance to produce distribution maps. These predictions suggested that birds were selecting some sites more frequently than others based on some habitat feature not explored in our study. Variation in mountain plover abundance appeared more heavily influenced by changes in the number of individuals occupying a few high quality sites, rather than from changes in abundance across many sites. Thus, conservation efforts may not be as efficient when focusing on low to moderate quality sites. 5. Synthesis and applications. Managers who must make decisions based on data-poor systems should adopt rigorous statistical approaches for drawing inferences. Spatial predictions provide information for deciding where to implement management, which is just as important as knowing what kind of management to apply. Our approach provides a step in the direction of making the biological signal in data-poor monitoring programmes more informative for conservation and management.","title":"Making better sense of monitoring data from low density species using a spatially explicit modeling approach","id":229913218,"url":"https://www.researchgate.net/publication/229913218_Making_better_sense_of_monitoring_data_from_low_density_species_using_a_spatially_explicit_modeling_approach","names":["Max Post van der Burg","Bartholomew Bly","Tammy VerCauteren","Andrew J. Tyre","Journal of Applied Ecology"],"references":{},"citedIn":{},"index":1011}