{"abs":"In this paper, we describe four sequential sampling strategies for estimating the quantile of Y \u003d f(X), where X has a known distribution in and f is a deterministic unknown, expensive-to-evaluate real-valued function. These approaches all consist in modeling f as a sample of a well-chosen Gaussian process and aim at estimating the quantile by using as few evaluations of f as possible. The different methodologies are first compared through various numerical experiments. Then, in the framework of the ANR-JST FETUS project, we apply our strategies to a real example corresponding to the exposure of a Japanese pregnant-woman model and her 26-week-old fetus to a plane wave. Finally, we compare our methodologies on a simplified geometric model designed for modeling the fetus exposure to plane waves.","title":"Sequential Design of Computer Experiments for the Assessment of Fetus Exposure to Electromagnetic Fields","id":277977174,"url":"https://www.researchgate.net/publication/277977174_Sequential_Design_of_Computer_Experiments_for_the_Assessment_of_Fetus_Exposure_to_Electromagnetic_Fields","names":["Marjorie Jala","Céline Lévy-Leduc","Eric Moulines","Emmanuelle Conil","Joe Wiart","Technometrics"],"references":{"4772685":"Estimating percentiles of uncertain computer code outputs","40686890":"Computational dosimetry in embryos exposed to electromagnetic plane waves over the frequency range of 10 MHz-1.5 GHz","44709664":"Évaluation d\u0027un risque d\u0027inondation fluviale par planification séquentielle d\u0027expériences","5871689":"An anatomically realistic whole-body pregnant-woman model and specific absorption rates for pregnant-woman exposure to electromagnetic plane waves from 10 MHz to 2 GHz. Phys","222504913":"Neural Network Exploration Using Optimal Experiment Design","6343989":"Dominant factors influencing whole-body average SAR due to far-field exposure in whole-body resonance frequency and GHz regions","269996418":"Gaussian Processes for Machine Learning (Adaptive Computation and Machine Learning)","261121095":"Sequential design of computer experiments for parameter estimation with application to numerical dosimetry","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","224184453":"Influence of Plane-Wave Incidence Angle on Whole Body and Local Exposure at 2100 MHz","6173764":"SAR in the mother and foetus for RF plane wave radiation","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","222679450":"Convergence properties of the expected improvement algorithm with fixed mean and covariance functions","2455557":"Information--Based Objective Functions for Active Data Selection","5293491":"Analysis of RF exposure in the head tissues of children and adults","48166394":"A Tutorial on Bayesian Optimization of Expensive Cost Functions, with Application to Active User Modeling and Hierarchical Reinforcement Learning","41910485":"Statistical Analysis of the Whole Body Absorption Depending on Anatomical Human Characteristics at the Frequency of 2.1 GHz","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","8689078":"Development of realistic high-resolution whole-body voxel models of Japanese adult males and females of average height and weight, and application of models to radio-frequency electromagnetic dosimetry","228095659":"Exponential Regret Bounds for Gaussian Process Bandits with\nDeterministic Observations","241638164":"Information-Theoretic Regret Bounds for Gaussian Process Optimization in the Bandit Setting","270367529":"Handbook of Mathematical Functions with Formulas, Graphs, and Mathematical Tables","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","5484331":"Variability analysis of SAR from 20 MHz to 2.4 GHz for different adult and child models using FDTD","220692253":"Engineering Design via Surrogate Modelling: A Practical Guide"},"citedIn":{},"index":104}