{"abs":"A general approach to hierarchical Bayes changepoint models is presented. In particular, desired marginal posterior densities are obtained utilizing the Gibbs sampler, an iterative Monte Carlo method. This approach avoids sophisticated analytic and numerical high dimensional integration procedures. We include an application to changing regressions, changing Poisson processes and changing Markov chains. Within these contexts we handle several previously inaccessible problems.","title":"Hierarchical Bayesian Analysis of Change Point Problems","id":244464104,"url":"https://www.researchgate.net/publication/244464104_Hierarchical_Bayesian_Analysis_of_Change_Point_Problems","names":["Bradley P. Carlin","Alan E. Gelfand","Adrian F. M. Smith","Applied Statistics"],"references":{},"citedIn":{"241817192":"BAYESIAN ORDER RESTRICTED METHODS WITH BIOMEDICAL APPLICATIONS","252406537":"The Use of Backpropagating Neural Networks in Coordination with Logistic Spline Coefficients to Obtain the Change Point","226031482":"Bayesian methods for estimating multi-segment rating curves","6925418":"Ma B, Lawson AB, Liese AD, Bell RA, Mayer-Davis EJDairy, magnesium, and calcium intake in relation to insulin sensitivity: approaches to modeling a dose-dependent association. Am J Epidemiol 164: 449-458","8241273":"Identifying multiple changepoints in heterogeneous binary data with an application to molecular genetics","273328716":"Comparison between change point detection methods with synthetic rainfall data and application in South Korea","227369355":"Online Model-Based Clustering for Crisis Identification in Distributed Computing","259684221":"Monitoring of Proportional-Integral Controlled Processes using a Bayesian Time Series Analysis Method","259504511":"Contrasting records of sea-level change in the eastern and western North Atlantic during the last 300 years","4783680":"Forecasting Time Series Subject to Structural Breaks","238684723":"A Simulation Study of a Bayesian Hierarchical Changepoint Model with Covariates","233293292":"A Bayesian Analysis of a Structural Change in the Parameters of a Time Series","222201651":"Change-point analysis of hydrological time series using grey relational method. J Hydrol","222821193":"Extreme value analysis of decadal variations in storm surge elevations","228463501":"Change Point Analysis of Cancer Mortality Rates for US States using Functional Dirichlet Processes","221560609":"Change-point detection for black-box services","261801356":"Geometric ergodicity of the Gibbs sampler for the Poisson change-point model","227352464":"Stick-breaking autoregressive processes","224545149":"Change point detection based on call detail records","227603343":"The Equity Premium and Structural Breaks","255991654":"Dynamic patterns of infant-parent interactions during Face-to-Face and Still-Face episodes","227390373":"Introduction to Bayesian Econometrics","4274792":"Bayesian Changepoint Detection Through Switching Regressions: Contact Point Determination in Material Indentation Experiments","239327848":"A Hierarchical Bayesian Approach to Seasonal Hurricane Modeling","242318940":"Bayesian Inference on Change Point","38326886":"Statistical Methods for DNA Sequence Segmentation","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","277294773":"1. Research Category and Sorting Code: Understanding Ecological Thresholds in Aquatic Systems through Retrospective Analysis, 2004-STAR-K2 2. Title: Eutrophication Thresholds-- Assessment, Mitigation and Resilience in Landscapes and Lakes","266862548":"Least square and Empirical Bayes Approaches for Estimating Random Change Points","5139578":"“US Deficit Sustainability: A New Approach Based on Multiple Endogenous Breaks.”","41453133":"Non-iterative sampling-based Bayesian methods for identifying changepoints in the sequence of cases of Haemolytic uraemic syndrome","2769436":"Bayesian Inference and Sidescan Restoration","277688506":"Quasi-log concavity conjecture and its applications in statistics","233072092":"Hybrid regions for post-change mean in a sequence of normal variables","239442556":"Bayesian Analysis of Errors-in-Variables Regression Models","238802434":"Bayesian inference for partially accelerated life tests using Gibbs sampling","41415755":"Dynamic Infant-Parent Affect Coupling During the Face-to-Face/Still-Face","253989149":"Bayesian Inference of Structural Breaks in Time-Varying Volatility Models","260157375":"A consistent on-line Bayesian procedure for detecting change points","227349449":"Prior elicitation in multiple change-point models","228984290":"Structural Breaks in Panel Data Models: A New Approach","220636513":"Likelihood-ratio changepoint features for consumer-behaviour models.","228747240":"Bayesian inference for the skew-normal shape parameter: An application to change point problems","268227511":"A Bayesian approach to modeling two-phase degradation using change-point regression","223515422":"From inspection to process understanding and monitoring: a view on computer vision in manufacturing","241698852":"Bayesian Inference on Mixture-of-Experts for Estimation of Stochastic Volatility","51962709":"A Bayesian Joinpoint regression model with an unknown number of\nbreak-points","265688473":"Quantifying the contribution of sediment compaction to late Holocene salt-marsh sea-level reconstructions, North Carolina, USA","255572331":"Modelling variability in longitudinal data using random change point models","266197901":"Bayesian Computation with R (Use R)","265017242":"Modeling Longitudinal Data with a Random Change Point and No Time-Zero: Applications to Inference and Prediction of the Labor Curve","235423324":"Bayesian semi-parametric analysis of Poisson change-point regression models: Application to policy-making in Cali, Colombia","225101631":"Exact and efficient Bayesian inference for multiple changepoint","267236280":"Application of Lifting Transform to Detect Change Points","262291447":"Discretization-based direct random sample generation","268299691":"THEORETICAL AND ALGORITHMIC DEVELOPMENTS IN MARKOV CHAIN MONTE CARLO","220321143":"Exact Bayesian curve fitting and signal segmentation","26823118":"Dhabhar FS, Saul AN, Daugherty C et al.Short-term stress enhances cellular immunity and increases early resistance to squamous cell carcinoma. Brain Behav Immun 24:127-137","250056368":"Spatiotemporal Bayesian Analysis of Lyme Disease in New York State, 1990–2000","235278943":"Structural Change as an Alternative to Long Memory in Financial Time Series","220347203":"An examination of Bayesian statistical approaches to modeling change in cognitive decline in an Alzheimer\u0027s disease population.","236783742":"Bayesian multivariate linear regression with application to change point models in hydrometeorological variables. In: Water Resources Research 43, W08401","5140013":"Learning, Forecasting and Structural Breaks","277791466":"Bayesian Hierarchical Methods and the Use of Ecological Thresholds and Changepoints for Habitat Selection Models","228315646":"An Alternative Bayesian Approach to Structural Breaks in Time Series Models","267681170":"Statistical Change-point Methods for Closed-loop Delay Estimation","246290120":"Gaussian paired comparison models","233360259":"A Gibbs Sampling Algorithm for a Changing Regression Model with Pooled Binary Response Data","259251998":"Longitudinal assessment of blood–brain barrier leakage during epileptogenesis in rats. A quantitative MRI study","51235704":"Climate Related Sea-level Variations over the Past Two Millennia","235293306":"Boosting-Based Frameworks in Financial Modeling: Application to Symbolic Volatility Forecasting","270664798":"Timing and effect of a safe routes to school program on child pedestrian injury risk during school travel hours: Bayesian changepoint and difference-in-differences analysis","266862997":"Forecasting Time Series Subject to Structural Breaks: A Bayesian Regime Averaging Approach","248808619":"Bayesian Estimation of change points using the general linear model","258662378":"Statistical analysis of the relationships between faults attributes","239939788":"A Nonparametric Approach for Multiple Change Point Analysis of Multivariate Data","265672532":"Bayesian Inference for Generalized Linear and Proportional Hazards Models via Gibbs Sampling","51094410":"Hidden Markov Models for zero-inflated Poisson counts with an application to substance use","4993230":"A joint latent class changepoint model to improve the prediction of time to graft failure","4719819":"Testing for a Shift in Mean Without Having to Estimate Serial-Correlation Parameters","222543303":"The use of cumulative sums for detection of changepoints in the rate parameter of a Poisson Process","228657446":"A simple Bayesian approach to multiple change-points","233375586":"An Application of EM Algorithm to a Change-Point Problem","30998357":"Bayesian Approaches for Limited Dependent Variable Change Point Problems","51364225":"A Bayesian approach to prediction of stallion daily sperm output","228811058":"Changepoint Analysis of Binary and Ordinal Probit Models: An Application to Bank Rate Policy Under the Interwar Gold Standard","12620372":"Models for longitudinal biomarkers of disease onset","228615988":"Recursion-Based Multiple Changepoint Detection in Multivariate Linear Regression and Application to River Streamflows","233363325":"Bayesian approach to change point problems","235665566":"Assessing the Response of Snow Avalanche Runout Altitudes to Climate Fluctuations Using Hierarchical Modeling: Application to 61 Winters of Data in France","2620592":"BUGS Examples - Version 0.5 Volume 1","266884977":"Binary Tree Algorithms for Change-Point Detection in Normal Datasets","2327738":"Entropy Filtering Method and Insertion/Deletion Robust Algorithm for Multiple Local Sequence Alignment","257642433":"A Bayesian analysis of suicide data","265004880":"Hierarchical Spatial Regression Models for Change Point Analysis","242201332":"Variable Selection of a Bayesian hierarchical changepoint Model for longitudinal biomarkers of Prostate Cancer","259737063":"Adaptive change-point mixed models applied to data on outpatient tetracycline use in Europe","228743996":"Particle Markov Chain Monte Carlo for Multiple Change-point Problems","245079044":"Bayesian models and ageing indicators for analysing random changes in failure occurrence","274560765":"Combining longitudinal studies of PSA","227413806":"Classification in segmented regression problems","14647421":"Modeling and decision making using Bayesian hierarchical models","13713522":"Assessing Placebo Response Using Bayesian Hierarchical Survival Models","251726245":"Inter-Reviewer Agreement for Measurement of Esophageal Wall Distensibility With Functional Luminal Imaging Probe (Endoflip®)","241115897":"46/ System zarządzania i weryfikacji lantis jako podstawa organizacji zakładu radioterapii","23155142":"Multilevel Spatio-Time Dual Changepoint Models for Relating Alcohol Outlet Destruction and Changes in Neighborhood Rates of Assaultive Violence","222284693":"Baysian analysis of a change-point in exponential families with applications","2590348":"Detecting a Change in School Performance: A Bayesian Analysis for a Multilevel Join Point Problem","245576718":"Approximate simulation free multiple changepoint analysis with Gaussian Markov random field segment models","224248306":"Yield Prediction for Integrated Circuits Manufacturing Through Hierarchical Bayesian Modeling of Spatial Defects","228495153":"Bayesian Inference from Continuously Arriving Informant Reports, with Application to Crisis","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","235275447":"A MODERN TIME SERIES ASSESSMENT OF “A STATISTICAL MODEL FOR SUNSPOT ACTIVITY” BY C. W. J. GRANGER (1957)","41453257":"An examination of Bayesian statistical approaches to modeling change in cognitive decline in an Alzheimer\u0027s disease population","236020896":"Modelling the effects of sediment compaction on salt marsh reconstructions of recent sea-level rise","289327500":"The Global Diffusion of Regulatory Agencies: Channels of Transfer and Stages of Diffusion","228813584":"Use of a Bayesian changepoint model to estimate effects of a graduated driver\u0027s licensing program","228476717":"Changepoint Detection in Multinomial Logistic Regression with Application to Sky-Cloudiness Conditions in Canada","243049670":"Bayesian analysis for a change in the intercept of simple linear regression","222394365":"Two Statistical Methods for the Detection of Environmental Thresholds","254312852":"Change-Point Problems: Bibliography and Review","5141646":"Subset threshold autoregression","223191439":"Bayesian Change-Point Analysis in Hydrometeorological Time Series. Part 2. Comparison of Change-Point Models and Forecasting","257805215":"Fast and efficient Bayesian semi-parametric curve-fitting and clustering in massive data","225897394":"Exploring the Dynamics of Dyadic Interactions via Hierarchical Segmentation","228800869":"Bayesian Flexible Shape Matching with Applications to Structural Proteomics","240669855":"Timing and magnitude of recent accelerated sea-level rise (North Carolina, United States)","4729985":"Markov Chain Monte Carlo Simulation Methods in Econometrics","222535049":"‘On time series with randomized unit root and randomized season unit root’","238866673":"On a bayesian approach for the shiftpoint problem","237758181":"INTERBANK RATE BEHAVIOR AND FINANCIAL CRISIS: The Case of Hong Kong","5104287":"Evaluation of Soil Test Information in Agricultural Decision Making, An","4772507":"Detecting homogeneous segments in DNA sequences by using hidden Markov models","268988123":"Leveraging Cloud Data to Mitigate User Experience from \"Breaking Bad\"","290898818":"Introduction to MCMC","24052661":"A General Class of Change Point and Change Curve Modeling for Life Time Data","253384128":"Bayesian change-point analysis of heat spell occurrences in Montreal, Canada","237625589":"Spatio-temporal change-point modeling","227369297":"Bayesian Random Segmentation Models to Identify Shared Copy Number Aberrations for Array CGH Data","285637090":"An exact approach to Bayesian sequential change point detection","229012803":"Objective Bayesian Analysis of Multiple Changepoints for Linear Models","225701782":"An application of the mixed linear model and the Dirichlet process prior in veterinary medicine research","276438684":"The Dynamics of Interbank Rate Behavior Under Alternative Monetary Regimes: The Case of Hong Kong","12665896":"Kim HJ, Fay MP, Feuer EJ, Midthune DNPermutation tests for joinpoint regression with applications to cancer rates. Stat Med 19: 335-351","225670552":"A Bayesian approach to selection and ranking procedures: the unequal variance case","227616125":"Bayesian estimation of cognitive decline in patients with Alzheimer\u0027s disease","229885279":"Using non‐homogeneous Poisson models with multiple change‐points to estimate the number of ozone exceedances in Mexico City","221346270":"Sequential Bayesian prediction in the presence of changepoints","232980748":"Applications of random walks on graphs to Gibbs samplers","228489068":"Analysis of panel data with change-points","228428137":"Switching Regressions for Bayesian Changepoint Analysis in Material Indentation Experiments","228149100":"The Global Diffusion of Regulatory Agencies","45091910":"Developmental changes in cerebral grey and white matter volume fom infancy to adulthood","4772532":"Analysing the interevent time distribution to identify seismicity phases: A Bayesian nonparametric approach to the multiple-changepoint problem","8500349":"Combining longitudinal studies of PSA","6893716":"Spatiotemporal Bayesian Analysis of Lyme Disease in New York State, 1990-2000","226073479":"An iterative Monte Carlo method for nonconjugate Bayesian analysis","241095007":"Detection of structural breaks in a time-varying heteroskedastic regression model","226912900":"Reversible algorithm of simulating multivariate densities with multi-hump","263760059":"Bayesian Time Series Analysis of Structural Changes in Level and Trend","3359029":"Multiresolution and hybrid Bayesian algorithms for automatic detection of change points","259635839":"Exact Bayesian inference via data augmentation","24052326":"Bayesian calibration in the estimation of the age of rhinoceros","46494156":"Multiple change-point detection of multivariate mean vectors with the Bayesian approach","35658540":"Spatial small area analyses of disease risk around sources of environmental pollution : modelling tools for a system using high resolution register data /","9078170":"A Bayesian method of estimating kinetic parameters for the inactivation of Cryptosporidium parvum oocysts with chlorine dioxide and ozone","225289852":"Multilevel spatiotemporal change-point models for evaluating the effect of an alcohol outlet control policy on changes in neighborhood assaultive violence rates","241772413":"Stock Assessment of Petrale Sole: 2004","228825783":"Sequential change-point detection for time series models: assessing the functional dynamics of neuronal networks.","227222173":"Bayesian isotonic changepoint analysis","220286521":"Bayesian inference and model comparison for asymmetric smooth transition heteroskedastic models","225413238":"Bayesian multiple change-point estimation with annealing stochastic approximation Monte Carlo","279413177":"Detecting Shifts in Hurricane Rates Using a Markov Chain Monte Carlo Approach","24014448":"Fast Bayesian Semiparametric Curve-Fitting and Clustering in Massive Data With Application to Cosmology","247819237":"Monte Carlo EM with importance reweighting and its applications in random effects models 1 1 This work was partially supported by Project FONDECYT 1960915 and by a visiting professorship grant from DIPUC","13683187":"Temporal dynamics of verbal object comprehension","260161190":"Predictive Updating Methods with Application to Bayesian Classification","263736976":"A Bayesian Method of Change-point Estimation with Recurrent Regimes: Application to GARCH Models","254893592":"A change-point analysis for modeling incomplete burn-in for light displays","275973976":"Dirichlet Process Hidden Markov Multiple Change-point Model","5048160":"Whatever happened to the business cycle? a Bayesian analysis of jobless recoveries","229750431":"Bayesian Analysis of Autoregressive Time Series Via the Gibbs Sampler","227369148":"Bayesian Analysis of Cancer Rates From SEER Program Using Parametric and Semiparametric Joinpoint Regression Models","50387506":"On-line changepoint detection and parameter estimation with application to genomic data","26866347":"An assessment of a TNF polymorphic marker for the risk of HCV infection: Meta-analysis and a new clinical study design","232391400":"A review of statistical chronology models for high-resolution, proxy-based Holocene palaeoenvironmental reconstruction","257343077":"When did modern rates of sea-level rise start?","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","4744061":"Screening Based on the Risk of Cancer Calculation From Bayesian Hierarchical Changepoint and Mixture Models of Longitudinal Markers","4993402":"Models for longitudinal data with censored changepoints","221653518":"Event Detection from Time Series Data.","243049798":"Bayesian analysis of bilinear time series models: A Gibbs sampling approach","271590156":"Evaluation of treatment efficacy using a Bayesian mixture piecewise linear model of longitudinal biomarkers","271855369":"Bayesian computation: a perspective on the current state, and sampling backwards and forwards","221619211":"Prediction and Change Detection.","242383693":"TheJuvenileHomicideEpidemic: Spatio-TemporalDynamicsof HomicideinAmericanCities","287119394":"Using PSA to detect prostate cancer onset: An application of Bayesian retrospective and prospective changepoint identification","229012710":"Objective Bayes Estimation and Hypothesis Testing: the reference-intrinsic approach","228972260":"Bayesian analysis of structural changes: Historical changes in US presidential uses of force abroad","255650429":"Introduction to MCMC (Markov Chain Monte Carlo)","259553849":"Inference for single and multiple change-points in time series","227528396":"The Limits of Ecological Inference: The Case of Split‐Ticket Voting","225796150":"A spatio-temporal modelling framework for assessing the fluctuations of avalanche occurrence resulting from climate change: Application to 60 years of data in the Northern French Alps","23775278":"TIME-SERIES MODEL WITH PERIODIC STOCHASTIC REGIME SWITCHING","4897039":"On the influence of the proposal distributions on a reversible jump MCMC algorithm applied to the detection of multiple change-points","243049785":"Detecting change points and monitoring biomedical data","228344025":"Modeling Structural Changes: Bayesian Estimation of Multiple Changepoint Models and State Space Models","229618406":"Bayesian Time Series Analysis","228582613":"Bayesian change point analysis in hydrometerological time series. Part 1: The normal model revisited. J Hydrol","5071622":"The Equity Premium And Structural Breaks","5162757":"Forecasting and Estimating Multiple Change-point Models with an Unknown Number of Change-points","228278992":"Climate Change and Modelling of Extreme Temperatures in Switzerland","227094725":"Estimation of population pharmacokinetics using the Gibbs sampler","11977210":"Single-Dose Gabapentin Pharmacokinetics and Safety in Healthy Infants and Children","260745926":"Bayesian methodology for the analysis of spatial–temporal surveillance data","254296166":"The Bayesian Change Point and Variable Selection Algorithm: Application to the δO Proxy Record of the Plio-Pleistocene","259179068":"A Bayesian structural-change analysis via the stochastic approximation Monte Carlo and Gibbs sampler A Bayesian structural-change analysis via the stochastic approximation Monte Carlo and Gibbs sampler","243766743":"A Language and Program for Complex Bayesian Modelling","24083517":"Change-point estimation in a multinomial sequence and homogeneity of literary style","2660734":"Monte Carlo EM with importance reweighting and its application in random effects models","23776828":"A State-Level Analysis of the Great Moderation","4914450":"Bayesian model selection for join point regression with application to age-adjusted cancer rates","222586397":"Hybrid Bayesian procedures for automatic detection of change-points","241761077":"Markov Chain Monte Carlo Random Effects Modeling in Magnetic Resonance Image Processing Using the BRugs Interface to WinBUGS","222446621":"Estimation and Comparison of Multiple Change-Point Models","222555682":"Bayesian and profile likelihood change point methods for modeling cognitive function over time","47820728":"Approximate simulation-free Bayesian inference for multiple changepointmodels with dependence within segments","23742991":"Overlaying Time Scales in Financial Volatility Data","51974268":"Semiparametric Bayesian approaches to joinpoint regression for population-based cancer survival data","235306348":"Estimation of Long-Memory Time Series Models: a Survey of Different Likelihood-Based Methods","45440472":"An application of change-point recursive models to the relationship between litter size and number of stillborns in pigs","4920612":"An exact non-iterative sampling procedure for discrete missing data problems","243767797":"Markov chain Monte Carlo for dynamic generalised liner models","227690209":"Estimation of bivariate measurements having different change points, with application to cognitive aging","276949493":"Detecting a Change in School Performance: A Bayesian Analysis for a Multilevel Join Point Problem","4883774":"A Spatiotemporal Autoregressive Price Index for the Paris Office Property Market","272376136":"Stepwise Signal Extraction via Marginal Likelihood","226856691":"Bayesian Analysis of Outlier Problems Using the Gibbs Sampler","225682955":"Statistical Analysis of the Completeness of a Seismic Catalogue","48309656":"Three essays in political methodology","250716045":"An Introduction to process segmentation","224762905":"Modelling distortions in seroprevalence data using change-point fractional polynomials","274730467":"Long signal change-point detection","273400271":"SIMD parallel MCMC sampling with applications for big-data Bayesian analytics","222005941":"Bayesian variable window scan statistics","4816856":"EM-type algorithms for computing restricted MLEs in multivariate normal distributions and multivariate -distributions","2165680":"Bayesian Blocks: Divide and Conquer, MCMC, and Cell Coalescence Approaches","243102700":"\"Turning Points\" in the Iraq Conflict: Reversible Jump Markov Chain Monte Carlo in Political Science","227658244":"Structural Change in U.S. Presidents\u0027 Use of Force","23660796":"Variations in mouse mitochondrial DNA copy number from fertilization to birth are associated with oxidative stress","5165529":"Échantillonnage de Gibbs et autres applications économétriques des chaînes markoviennes","222951633":"Estimating joinpoints in continuous time scale for multiple change-point models","13727053":"Change-Point Analysis of Neuron Spike Train Data","235281830":"Flexible Seasonal Time Series Models","256452329":"Bayesian random threshold estimation in a Cox proportional hazards cure model","3803035":"Recognizing anomalies in weather radar images","270253501":"A Dynamic Changepoint Model for Detecting the Onset of Growth in Bacteriological Infections","4741090":"Bayesian Analysis of a Multinomial Sequence and Homogeneity of Literary Style","232858190":"Bayesian Analysis of Change-Point Hazard Rate Problem","5155839":"A Bayesian methodology for simultaneously detecting and estimating regime change points and variable selection in multiple regression models for marketing research","225432797":"Non-homogeneous Poisson models with a change-point: An application to ozone peaks in Mexico city","12473096":"A change-point model for estimating the onset of cognitive in preclinical Alzheimer\u0027s disease","5478891":"Hierarchical Changepoint Models for Biochemical Markers Illustrated by Tracking Postradiotherapy Prostate-Specific Antigen Series in Men With Prostate Cancer","2722192":"Nonlinearity, Structural Breaks Or Outliers In Economic Time Series?","242958785":"Application of MCMC to change point detection","246157584":"Facilitating the Gibbs Sampler: The Gibbs Stopper and the Griddy-Gibbs Sampler","7566798":"Martino S, Disch D, Dowsett SA, Keech CA, Mershon J. Safety assessment of raloxifene over eight years in a clinical trial setting","4986866":"A Bayesian Time Series Model of Multiple Structural Changes in Level, Trend, and Variance","228450850":"HANDFIT: an algorithm for automatic fitting of continuous piecewise regression, with application to feature extraction from remote sensing time series data","227828779":"Bayesian inference of threshold autoregressive models","2249185":"Bootstrap Confidence Regions For The Intensity Of A Poisson Point Process","2260449":"The Juvenile Homicide Epidemic: Spatio-Temporal Dynamics of Homicide in American Cities","2590692":"A Bayesian On-Line Change Detection Algorithm With Process Monitoring Applications","235254735":"Asymmetric Predictive Abilities of Nonlinear Models for Stock Returns: Evidence from Density Forecast Comparison","47646492":"Semi-parametric dynamic time series modelling with applications to detecting neural dynamics","5179778":"U.S. Deficit Sustainability: A New Approach Based on Multiple Endogenous Breaks","235272136":"Time Series Mean Level and Stochastic Volatility Modeling by Smooth Transition Autoregressions: A BAYESIAN Approach","257287301":"Bayes pre-test estimation for the change point of the changing one parameter exponential family","23451829":"Exploring Biological Relationships Between Calving Traits in Primiparous Cattle with a Bayesian Recursive Model","40820159":"Factors Influencing the Association Between CYP17 T34C Polymorphism and the Risk of Breast Cancer: Meta-Regression and Subgroup Analysis","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","44692347":"Possible risk modifications in the association between MnSOD Ala-9Val polymorphism and breast cancer risk: Subgroup analysis and evidence-based sample size calculation for a future trial","2737661":"Spatial Stochastic Models for Seabed Object Detection","235286994":"A New Class of Tail-dependent Time-Series Models and Its Applications in Financial Time Series","27814013":"Bayesian off-line detection of multiple change-points corrupted by multiplicative noise: Application to SAR image edge detection","235269074":"Evaluating the “Fed Model” of Stock Price Valuation: An Out-of-Sample Forecasting Perspective","224224897":"Socioscope: Human Relationship and Behavior Analysis in Social Networks","265325069":"Bayesian reasoning. Modeling and inference","281378072":"BAYESIAN CHANGE POINT ANALYSIS USING THE PHASE DISTRIBUTION OF COMPLEX SIGNALS","259179180":"Bayesian Multiple Change-Point Estimation and Segmentation","2603000":"Multiple-order Markov Chain Monte Carlo Sampling Methods with Application to a Changepoint Model","220286657":"A comparison of estimators for regression models with change points","46544679":"Bayesian Inference of Trend and Difference-Stationarity","222282459":"Piecewise exponential survival curves with smooth transitions","243775842":"Bayesian Analysis of Constrained Parameter and Truncated Data Problems Using Gibbs Sampling","230340701":"Poisson Regression with Change‐Point Prior in the Modelling of Disease Risk around a Point Source","228313200":"Investigating the Dynamic Effects of Counterfeits with a Random Changepoint Simultaneous Equation Model","229703263":"Bayesian detection and analysis of changing transition matrices of stationary Markov chains","233501189":"Extracting the temporal signal from a winter and summer mass-balance series: Application to a six-decade record at Glacier de Sarennes, French Alps","257249978":"Probabilistic Estimation of Mechanical Properties of Biomaterials Using Atomic Force Microscopy","238227907":"Estimation of Electoral Disproportionality and Thresholds via MCMC1","264058444":"Default Bayesian Method for Detecting the Changes in Sequences of Independent Exponential and Poisson Random Variates","3151811":"Bayes Computation for Life Testing and Reliability Estimation","7371141":"Bayesian Inferences on Umbrella Orderings","228698713":"An iterative algorithm for automatic fitting of continuous piecewise linear models","227653227":"Bayesian change‐point analysis for atomic force microscopy and soft material indentation","268880891":"Fitting Nonlinear Ordinary Differential Equation Models with Random Effects and Unknown Initial Conditions Using the Stochastic Approximation Expectation–Maximization (SAEM) Algorithm"},"index":107}