{"abs":"Computer simulation has become the standard tool in many engineering fields for designing and optimizing systems, as well as for assessing their reliability. To cope with demanding analysis such as optimization and reliability, surrogate models (a.k.a meta-models) have been increasingly investigated in the last decade. Polynomial Chaos Expansions (PCE) and Kriging are two popular non-intrusive meta-modelling techniques. PCE surrogates the computational model with a series of orthonormal polynomials in the input variables where polynomials are chosen in coherency with the probability distributions of those input variables. On the other hand, Kriging assumes that the computer model behaves as a realization of a Gaussian random process whose parameters are estimated from the available computer runs, i.e. input vectors and response values. These two techniques have been developed more or less in parallel so far with little interaction between the researchers in the two fields. In this paper, PC-Kriging is derived as a new non-intrusive meta-modeling approach combining PCE and Kriging. A sparse set of orthonormal polynomials (PCE) approximates the global behavior of the computational model whereas Kriging manages the local variability of the model output. An adaptive algorithm similar to the least angle regression algorithm determines the optimal sparse set of polynomials. PC-Kriging is validated on various benchmark analytical functions which are easy to sample for reference results. From the numerical investigations it is concluded that PC-Kriging performs better than or at least as good as the two distinct meta-modeling techniques. A larger gain in accuracy is obtained when the experimental design has a limited size, which is an asset when dealing with demanding computational models.","title":"Polynomial-Chaos-based Kriging","id":272359280,"url":"https://www.researchgate.net/publication/272359280_Polynomial-Chaos-based_Kriging","names":["Roland Schöbi","B. Sudret","Joe Wiart"],"references":{"227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","255173563":"A weighted L1-minimization approach for sparse polynomial chaos expansions","268443151":"PC-Kriging: A new meta-modelling method and its application to quantile estimation","255813676":"Dimensionality reduction for complex models via Bayesian compressive sensing","269996418":"Gaussian Processes for Machine Learning (Adaptive Computation and Machine Learning)","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","209436387":"A Tutorial on Support Vector Regression","223472072":"Efficient computation of global sensitivity indices using sparse polynomial chaos expansions. Reliab Eng Syst Saf","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","220395581":"Beyond Wiener–Askey Expansions: Handling Arbitrary PDFs","240445429":"Sparse polynomial chaos expansions and adaptive stochastic finite element using a regression approach","223037033":"Hierarchical parallelisation for the solution of stochastic finite element equations","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","268572455":"Design Under Uncertainty Employing Stochastic Expansion Methods","2423042":"Support Vector Machines for Classification and Regression. Technical Report","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","264385644":"Enhancing -minimization estimates of polynomial chaos expansions using basis selection","221900823":"Cross Validity Choice and Assessment of Statistical Predictions","248065894":"The Wiener-Askey polynomial chaos for stochastic di eren-tial equations","51912106":"ANOVA kernels and RKHS of zero mean functions for model-based\nsensitivity analysis","222526449":"Global sensitivity analysis using polynomial chaos expansion","234140352":"Calibration And Improved Prediction Of Computer Models By Universal Kriging","240978407":"A stochastic finite element procedure for moment and reliability analysis","220692253":"Engineering Design via Surrogate Modelling: A Practical Guide","260145082":"Uncertainty propagation and sensitivity analysis in mechanical models -- Contributions to structural reliability and stochastic spectral methods","2833559":"Least Angle Regression","223906278":"Application of Kriging method to structural reliability","228382047":"Fast Numerical Methods for Stochastic Computations: A Review","242068651":"Recent Advances in Non-Intrusive Polynomial Chaos and Stochastic Collocation Methods for Uncertainty Analysis and Design","31248148":"R, “A New Approach to Variable Metric Algorithms,” Computer J., 13, 317","245286228":"Stochastic Finite-Element Analysis of Seismic Soil–Structure Interaction","220411369":"High-Order Collocation Methods for Differential Equations with Random Inputs","251620910":"Efficient surrogate models for reliability analysis of systems with multiple failure modes","221997039":"Regression shrinkage and selection via the LASSO. J R Stat Soc B","51959501":"Additive Covariance Kernels for High-Dimensional Gaussian Process\nModeling","224839856":"The Predictive Sample Reuse Method with Application","220411897":"Physical Systems with Random Uncertainties: Chaos Representations with Arbitrary Probability Measure","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","222652964":"An adaptive multi-element generalized polynomial chaos method for stochastic diffential equations","225734295":"The Elements of Statistical Learning, Second Edition: Data Mining, Inference, and Prediction","223079085":"An adaptive algorithm to build up sparse polynomial chaos expansions for stochastic finite element analysis","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","51966320":"Additive Gaussian Processes","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","266323381":"Combining polynomial chaos expansions and Kriging for solving structural reliability problems","251012102":"Stochastic finite element: A non intrusive approach by regression","223307324":"A Stochastic Projection Method for Fluid Flow: II. Random Process","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","261652197":"A Statistical Approach to Some Mine Valuations and Allied Problems at the Witwatersrand","242389519":"Factorial Sampling Plans for Preliminary Computational Experiments","4749622":"An efficient methodology for modeling complex computer codes with Gaussian processes"},"citedIn":{"282247205":"Fusing simulation results from multifidelity aero-servo-elasticsimulators - Application to extreme loads on wind turbine"},"index":109}