{"abs":"In recent years, a gradual increase in the sophistication of multiobjective evolutionary algo- rithms (MOEAs) for Pareto optimization has been seen, accompanied by an ever-growing list of applications. Despite this trend, however, the proposition that methods based on local search may be a good alternative approach -- with the advantages of ease-of-use and lower computational overhead -- has not been thoroughly tested. In this thesis we develop a novel, local-sear\u0026 algorithm for Pareto optimization, called PAES, enabling us to test and compare MOEAs against this philosophically different search method.","title":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","id":2570964,"url":"https://www.researchgate.net/publication/2570964_Local-Search_and_Hybrid_Evolutionary_Algorithms_for_Pareto_Optimization","names":["Joshua Damian Knowles"],"references":{"201976841":"Memetic Algorithms: A Short Introduction","23740136":"When Will a Genetic Algorithm Outperform Hill-Climbing?","2247968":"The Royal Road for Genetic Algorithms: Fitness Landscapes and GA Performance","222482116":"Parallel recombinative simulated annealing: A genetic algorithm","2359458":"The Link and Node Biased Encoding Revisited: Bias and Adjustment of Parameters","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","236389661":"Heuristics: Intelligent Search Strategies for Computer Problem Solving","220118677":"Optimization by Simulated Annealing","2642725":"Evaluating the Quality of Approximations to the Non-Dominated Set","2295598":"Fitness Landscapes and Memetic Algorithm Design","221619640":"Stochastic Hillclimbing as a Baseline Mathod for Evaluating Genetic Algorithms.","2357164":"A New Evolutionary Approach to the Degree Constrained Minimum Spanning Tree Problem","2280242":"Future Generation Computer Systems","228057735":"Computers and Intractability: A Guide to NP-Completeness","2333106":"Simulated Binary Crossover for Continuous Search Space","225218685":"A New Genetic Algorithm for the Optimal Communication Spanning Tree Problem","224839796":"Using Genetic Algorithms to Solve a Multi-Objective Ground-Water Monitoring Problem","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","2316980":"Reducing Local Optima in Single-Objective Problems by Multi-objectivization","2365630":"A Hybrid Multi-Objective Evolutionary Approach to Engineering Shape Design","200622062":"Knapsack Problems: Algorithms and Computer Implementation","239062948":"PESA-II: Region-based selection in evolutionary multiobjective optimization","220403516":"Comparison of Algorithms for the Degree Constrained Minimum Spanning Tree","225964648":"Lin, C.-Y.: Genetic search strategies in multicriterion optimal design. Struct. optim. 4(2), 99-107","220885642":"Genetic Algorithms with Sharing for Multimodalfunction Optimization.","2426244":"A Basis for Future Successes in Multiobjective Combinatorial Optimization","3334416":"Topological Design of local-area networks using Genetic Algorithms","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","2364041":"Multi-Objective Optimisation Based on Relation Favour","220800153":"Local Search in Combinatorial Optimization.","2633240":"Multi-Objective Evolutionary Algorithms: Introducing Bias Among Pareto-Optimal Solutions","220616851":"Low-Degree Spanning Trees of Small Weight","30873058":"Genetic + Data Structures \u003d Evolution Programs","222044938":"Multi-objective genetic algorithm and its application to flowshop scheduling. Comput Ind Eng","225783245":"Selective breeding in a multiobjective genetic algorithm","30869230":"Handbook Of Genetic Algorithms","216300639":"Compaction of Symbolic Layout using Genetic Algorithms","2690834":"Niching Methods for Genetic Algorithms","225510861":"Designing and Reporting on Computational Experiments with Heuristic Methods","2464921":"The Nature of Niching: Genetic Algorithms and the Evolution of Optimal, Cooperative Populations","243769275":"Order-based genetic algorithms and the graph coloring problem","201976649":"Analyzing Deception in Trap Functions","2584549":"Why Ants are Hard","200105001":"Equation of State by Fast Computing Machines","2249323":"Evolutionary Algorithms for Multi-Criterion Optimization in Engineering Design","220702189":"Climbing up NP-hard hills","234807858":"Computation: Finite and Infinite Machines","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","201976026":"The Only Challenging Problems are Deceptive: Global Search by Solving Order-1 Hyperplanes","226336299":"Greedy Randomized Adaptive Search Procedures","3642862":"Useful diversity via multiploidy","221032054":"Multi-Objective Genetic Local Search Algorithm.","2827504":"A few remarks on the history of MST-problem","2626292":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","3642856":"Genetic algorithms with dynamic niche sharing for multimodal function optimization","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","225125391":"Investigating evolutionary approaches to adaptive database management against various quality of service metrics","30822323":"Adaptive search using simulated evolution","5583923":"An Introduction to Simulated Evolutionary Optimization","222405031":"Jaszkiewicz, A.: Genetic Local Search for Multi-Objective Combinatorial Optimization. European Journal of Operational Research 137, 50-71","220471363":"Degree-constrained minimum spanning tree","220662479":"Random-tree Diameter and the Diameter-constrained MST","220742721":"A Variable Radius Niching Technique for Speciation in Genetic Algorithms.","2782915":"A Variant of Evolution Strategies for Vector Optimization","2363085":"A Comparison of Encodings and Algorithms for Multiobjective Minimum Spanning Tree Problems","35578608":"An Analysis of the Behavior of a Class of Genetic Adaptive Systems","2713564":"Generating a Diversity of Good Solutions to a Practical Combinatorial Problem using Vectorized Simulated Annealing","221001819":"A Weighted Coding in a Genetic Algorithm for the Degree-Constrained Minimum Spanning Tree Problem","2369759":"Controlled Elitist Non-dominated Sorting Genetic Algorithms for Better Convergence","213878721":"Shortest Connection Networks And Some Generalizations"},"citedIn":{"228945572":"Optimizing Multiple Objectives on Multicast Networks using Memetic Algorithms","221091119":"Parallel strategies for a multi-criteria GRASP algorithm","221230893":"The Bi-objective Problem of Distribution of Oil Products by Pipeline Networks Approached by a Particle Swarm Optimization Algorithm","224207966":"Diversity Management in Evolutionary Many-Objective Optimization","261431187":"Transgenetic algorithm for the biobjective oil derivatives distribution problem","224645738":"Particle Swarm Optimization for the Bi-objective Degree constrained Minimum Spanning Tree","220249385":"Convergence of Stochastic Search Algorithms to Finite Size Pareto Set Approximations","216300271":"Systematic analyses of multi-objective evolutionary algorithms applied to real-world problems using statistical design of experiments","225577599":"Memetic Algorithms for Multiobjective Optimization: Issues, Methods and Prospects","228572559":"Multi-case multi-objective simulated annealing (MC-MOSA): New approach for adapt simulated annealing to multi-objective optimization","272007206":"GRASP-ASP: An algorithm for the CVRP with route balancing","2949694":"Improving the Performance of Trajectory-Based Multiobjective Optimisers by Using Relaxed Dominance","221196603":"Reference Set Metrics for Multi-Objective Algorithms","37413423":"Scalable intelligent electronic catalogs","221228599":"Minimal Sets of Quality Metrics","220312632":"The multi-criteria minimum spanning tree problem based genetic algorithm","223413837":"Minimization of voltage deviation and power losses in power networks using Pareto optimization methods","265170130":"Multiobjective GRASP with path relinking","50832920":"Computerized Decision Support System for Mass Identification in Breast Using Digital Mammogram: A Study on GA-Based Neuro-Fuzzy Approaches","263074225":"Speed Up Reliability Model Optimization With Hypervolume Contribution Calculating Algorithm","4075036":"Particle Swarm Optimizers for Pareto Optimization with Enhanced Archiving Techniques","225223496":"A flexible three-level logistic network design considering cost and time criteria with a multi-objective evolutionary algorithm. J Intell Manuf","226165840":"Evolutionary Algorithms for the Multi Criterion Minimum Spanning Tree Problem","3112451":"Optimization of Cost Functions Using Evolutionary Algorithms With Local Learning and Local Search","258401097":"A PSO-Optimized Minimum Spanning Tree-Based Topology Control Scheme for Wireless Sensor Networks","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","250682564":"ε-DANTE: An ant colony oriented depth search procedure","272408331":"Generic Constraints Handling Techniques in Constrained Multi-criteria Optimization and its Application","251320259":"An Efficient Nearest Neighbor Classifier","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","3113235":"Multiobjective Memetic Algorithms With Quadratic Approximation-Based Local Search for Expensive Optimization in Electromagnetics","4074752":"Bounded archiving using the Lebesgue measure","220702233":"Multiobjectivization by Decomposition of Scalar Cost Functions","3418741":"Considerations in engineering parallel multiobjective evolutionary algorithms. IEEE Trans Evol Comput","4376833":"Hybridizing the Pareto Multi-Objective Optimization Evolutionary Algorithms by Means of Multi-Objective Local Search","222540032":"Lecture Notes in Computer Science","5303060":"Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","4376837":"A Hybridised Evolutionary Algorithm for Multi-Criterion Minimum Spanning Tree Problems","224301847":"Indicator-based multi-objective local search","47843222":"Don\u0027t be greedy when calculating hypervolume contributions","238660725":"Multi-objective site selection and analysis for GSM cellular network planning","220381049":"A Fast Way of Calculating Exact Hypervolumes","47843204":"Multiplicative Approximations and the Hypervolume Indicator","221608788":"Multi-Objective Optimization with an Adaptive Resonance Theory-Based Estimation of Distribution Algorithm: A Comparative Study.","228912070":"Handling Uncertainty in Indicator-Based Multiobjective Optimization","258163201":"Fast calculation of multiobjective probability of improvement and expected improvement criteria for Pareto optimization","216300934":"On metrics for comparing non-dominated sets","4129884":"State-of-the-art multiobjective metaheuristic for redistricting","233533320":"Hybrid softcomputing model for lesion identification and information combination: some case studies","46590893":"Optimización de tensión en redes de distribución utilizando técnicas evolutivas [Power network voltage optimization using evolutive algorithms]","224579855":"On the Complexity of Computing the Hypervolume Indicator","4294446":"A New Evolutionary Algorithm for the Bi-objective Minimum Spanning Tree","237391958":"Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods","216301719":"A Tutorial on Evolutionary Multiobjective Optimization","1765486":"Stochastic convergence of random search to fixed size Pareto set\napproximations","265908652":"Local Optimal Sets and Bounded Archiving on Multi-objective NK-Landscapes with Correlated Objectives","28358342":"Gradient-based/Evolutionary Relay Hybrid for Computing Pareto Front Approximations Maximizing the S-Metric","221025114":"Lecture Notes in Computer Science","224330024":"An Improved CHSO Algorithm for Multi-Objective Optimization Problem","261360366":"Self-adaptive Differential Evolution Based Multi-objective Optimization Incorporating Local Search and Indicator-Based Selection","216300191":"KEA---A Software Package for Development, Analysis, and Application of Multiple Objective Evolutionary Algorithms","224177959":"A fast many-objective hypervolume algorithm using iterated incremental calculations","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","221007953":"A new transgenetic approach for the biobjective spanning tree problem.","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","220048542":"Evolutionary Computation in Combinatorial Optimization","4201672":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","224609001":"A PSO-Based Topology Control Algorithm in Wireless Sensor Networks","220048534":"Evolutionary Computation in Combinatorial Optimization","47394396":"Results of Evolution Supervised by Genetic Algorithms","261307906":"Applying the WFG algorithm to calculate incremental hypervolumes","221109438":"Design and Analysis of a MST-Based Topology Control Scheme with PSO for Wireless Sensor Networks.","221006521":"Multi-objective DE and PSO Strategies for Production Scheduling","220289972":"Stochastic convergence of random search methods to fixed size Pareto front approximations","221006522":"Local search with quadratic approximation in Genetic Algorithms for expensive optimization problems","220867249":"A Memetic Algorithm for the Biobjective Minimum Spanning Tree Problem","227003420":"Multiobjective Combinatorial Optimization — Theory, Methodology, and Applications","220867761":"A Plasmid Based Transgenetic Algorithm for the Biobjective Minimum Spanning Tree Problem","250199156":"Multi-criteria Decision Making in Embedded System Design","2830262":"No Free Lunch and Free Leftovers Theorems for Multiobjective Optimisation Problems","241687239":"IJCIA PAPER","224309500":"A Fast Incremental Hypervolume Algorithm","224594625":"Correction to “A Fast Incremental Hypervolume Algorithm” [Dec 08 714-723]","225871061":"Pareto archived simulated annealing for job shop scheduling with multiple objectives. Int J Adv Manuf Technol","225593046":"Transgenetic Algorithm: A New Endosymbiotic Approach for Evolutionary Algorithms","227136812":"A Convergence Acceleration Technique for Multiobjective Optimisation","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","37245588":"Metaheuristic and Multiobjective Approaches for Space Allocation","251407953":"Bounded Pareto Archiving: Theory and Practice","36146583":"Traffic engineering in MPLS networks with multiple objectives : modeling and optimization /","220741273":"Scaling up indicator-based MOEAs by approximating the least hypervolume contributor: A preliminary study","216457303":"Indicator-Based Selection in Multiobjective Search","261120557":"An algorithm for calculating the hypervolume contribution of a set","3351694":"Modular design space exploration framework for embedded systems","224645854":"A Knowledge-Based Evolution Strategy for the Multi-Objective Minimum Spanning Tree Problem","220606363":"A Study on Genetic Algorithm Based Hybrid Softcomputing Model for Benignancy/Malignancy Detection of Masses Using Digital Mammogram.","242323150":"Se han utilizado las siguientes claves para denotar los tipos de publicaciones en que cada trabajo fue referenciado: LIB ING \u003d Libro en ing´ es, JOUR INT \u003d Journal Internacional, CONG INT \u003d Congreso Internacional, CONG NAC \u003d Congreso Na","277291832":"Evolutionary Computation Group","238682874":"Title of Dissertation ENTROPY APPROACH TO METAMODELING, MULTI-OBJECTIVE GENETIC ALGORITHM, AND QUALITY ASSESSMENT OF SOLUTION SETS FOR","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","261460816":"Evolutionary algorithms for a three-objectives oil derivatives network problem","266653730":"On set-based local search for multiobjective combinatorial optimization","224301970":"Multilevel optimization strategies based on metamodel-assisted evolutionary algorithms, for computationally expensive problems","221007328":"Hybridizing PSO and DE for improved vector evaluated multi-objective optimization","225563839":"The efficiency of indicator-based local search for multi-objective combinatorial optimisation problems","27544426":"A multi-objective stochastic approach to combinatorial technology space exploration","220654825":"Hybrid genetic algorithm for dual selection","222670484":"The influence of the fitness evaluation method on the performance of multiobjective search algorithms","251983319":"Improved Multi-Objective PSO algorithm for Optimization Problems","222650769":"The Speciating Island Model: An alternative parallel evolutionary algorithm","3949545":"On metrics for comparing nondominated sets","221228538":"On Sequential Online Archiving of Objective Vectors","220403444":"Target aiming Pareto search and its application to the vehicle routing problem with route balancing","250735657":"How to Maintain at Most N Well-Distributed, Non-dominated Solutions to a Pareto Optimization Problem","225836716":"A Hypervolume-Based Optimizer for High-Dimensional Objective Spaces","3418862":"A faster algorithm for calculating hypervolume","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","40906642":"Computing Gap Free Pareto Front Approximations with Stochastic Search Algorithms","224472197":"Interval Robust Multi-Objective Evolutionary Algorithm","4074967":"Evolutionary many-objective optimisation: an exploratory analysis","2616014":"Multicriteria Optimization with Export Rules for Mechanical Design","220121333":"A Multiobjective Hybrid Metaheuristic Approach for GIS-based Spatial Zoning Model","226000279":"An Intelligent GIS-Based Spatial Zoning System with Multiobjective Hybrid Metaheuristic Method","263525189":"Comparison and Evaluation of Multiple Objective Genetic Algorithms for the Antenna Placement Problem: Algorithmic Solutions for Wireless, Mobile, Ad Hoc and Sensor Networks (Guest Editors: Amotz Bar-Noy, Alan A. Bertossi, Cristina M. Pinotti and Cauligi S. Raghavendra)","232274985":"Annealing-tabu PAES: a Multi-objective Hybrid Meta-heuristic","220702165":"Multiobjective Optimization on a Limited Budget of Evaluations Using Model-Assisted $\\mathcal{S}$ -Metric Selection","271952070":"Multi-objective variable neighborhood search: an application to combinatorial optimization problems","4201396":"A hybrid multi-objective evolutionary algorithm using an inverse neural network for aircraft control system design","237233109":"MOMBES Multiobjective Modelbased Evolution Strategy","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","220462554":"A GRASP algorithm for the multi-criteria minimum spanning tree problem","238344911":"The Good of the Many Outweighs the Good of the One: Evolutionary Multi Objective Optimization","261430382":"Issues with performance measures for dynamic multi-objective optimisation","225620108":"Constrained Optimization Based on Quadratic Approximations in Genetic Algorithms","271445970":"Multiobjective optimisation on a budget: Exploring surrogate modelling for robust multi-reservoir rules generation under hydrological uncertainty"},"index":112}