{"abs":"We consider the problems of variable selection and accounting for model uncertainty in linear regression models. Conditioning on a single selected model ignores model uncertainty, and thus leads to the underestimation of uncertainty when making inferences about quantities of interest. The complete Bayesian solution to this problem involves averaging over all possible models when making inferences about quantities of interest. This approach is often not practical. In this paper we offer two alternative approaches. First we describe a Bayesian model selection algorithm called \"Occam\u0027s Window\" which involves averaging over a reduced set of models. Second, we describe a Markov chain Monte Carlo approach which directly approximates the exact solution. Both these model averaging procedures provide better predictive performance than any single model which might reasonably have been selected. In the extreme case where there are many candidate predictors but there is no relationship between any...","title":"Model Selection and Accounting for Model Uncertainty in Linear Regression Models","id":2299598,"url":"https://www.researchgate.net/publication/2299598_Model_Selection_and_Accounting_for_Model_Uncertainty_in_Linear_Regression_Models","names":["Adrian Raftery","David Madigan","Jennifer Hoeting","Journal of the American Statistical Association"],"references":{"243766950":"Reliability of subjective probability forecasts of precipitation and temperature. J R Stat Soc C Appl Stat","234262803":"Data Analysis and Regression: A Second Course In Statistics","239029977":"On assessing Prior Distributions and Bayesian Regression Analysis with g-Prior Distributions","24106822":"Crime and Punishment: An Economic Aproach","38359714":"Elicitation of Prior Distributions for Variable-Selection Problems in Regression","246498362":"Interactive Elicitation of Opinion of a Normal Linear Model","239065043":"The Analysis And Selection Of Variables In Linear Regression","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","261654839":"Subset Selection in Regression","239065040":"A Note on Screening Regression Equations","230872692":"Sampling and Bayes\u0027 Inference in Scientific Modelling and Robustness","261793645":"Selection of Subsets of Regression Variables","245581819":"Bayes Factors and Model Uncertainty","238727682":"Variable Selection Via Gibbs Sampling","238655585":"Bayesian Variable Selection in Linear Regression","242504973":"Markov Chains with Stationary Probabilities","37796538":"Applied Statistical Decision Theory","247116263":"Participation in illegitimate activities: Ehrlich revisited","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models"},"citedIn":{"2260257":"Learning Bayesian Networks is NP-Hard","2592036":"Strategies for Graphical Model Selection","2358055":"ATutorial on Learning With Bayesian Networks","3411762":"Causal independence for probability assessment and inference using Bayesian networks","2760236":"Learning Bayesian Networks from Data: An Efficient Approach Based on Information Theory","2301995":"Relaxing the Local Independence Assumption for Quantitative Learning in Acyclic Directed Graphical Models through Hierarchical Partition Models","4970563":"Analytic methods for examining race and ethnic disparity in the juvenile courts","254260526":"Thermal conductance and basal metabolic rate are part of a coordinated system for heat transfer regulation","45114554":"Bayesian Variable Selection in Cost-Effectiveness Analysis","234158840":"Gene Expression-Based Classifiers Identify Staphylococcus aureus Infection in Mice and Humans","2594870":"Graphical Explanation in Belief Networks","225965669":"Mixture model for inferring susceptibility to mastitis in dairy cattle: a procedure for likelihood-based inference","44709816":"Approche bayésienne variationnelle pour l\u0027agrégation de modèles en classification.","242372709":"E-ciency Determinants of Paper Machine Wet-End Performance","2790973":"Bayesian Model Averaging in Proportional Hazard Models: Assessing Stroke Risk","51816975":"Bayesian Multimodel Inference for Geostatistical Regression Models","228925886":"Smoothing Balanced Single-Error-Term Analysis of Variance","257586756":"Can specific policy indicators identify reform priorities?","2504967":"Bayesian Variable Selection Using the Gibbs Sampler","2814475":"Regression with Multiple Candidate Models: Selecting or Mixing?","226859687":"District magnitude and representation of the majority’s preferences: Evidence from popular and parliamentary votes","2555394":"Minimum Message Length Inference: Theory and Applications","262786957":"The Continual Reassessment Method for Multiple Toxicity Grades: A Bayesian Model Selection Approach","221653534":"Applying General Bayesian Techniques to Improve TAN Induction","276210526":"Bayesian Population Forecasting: Extending the Lee-Carter Method","24065350":"A Simulation-Intensive Approach for Checking Hierarchical Models","258794309":"Quantifying the Objective Cost of Uncertainty in Complex Dynamical Systems","2708482":"Framework for a Generic Knowledge Discovery Toolkit","257575025":"Distributed data mining: A survey","2844935":"Inference in Model-Based Cluster Analysis","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","3411717":"Model uncertainty: Theory and practical implications","248808928":"Reply to Comment by B. Renard et al. on “An integrated hydrologic Bayesian multimodel combination framework: Confronting input, parameter, and model structural uncertainty in hydrologic prediction”","2612499":"Bayesian Model Averaging for Linear Regression Models","2244378":"Perfect simulation for Bayesian curve and surface fitting","2813202":"Bayesian Variable Selection with Related Predictors","2622481":"Accounting for Model Uncertainty in Survival Analysis Improves Predictive Performance","234140104":"Being Bayesian about Network Structure","2462744":"Too many Variables? A Comment on Bartels\u0027 Model-Averaging Proposal","220283932":"Collective Mining of Bayesian Networks from Distributed Heterogeneous Data","220642658":"Parameter Learning in Object-Oriented Bayesian Networks","237131111":"Nonparametric regression using Bayesian variable selection","24171318":"Bayesian model averaging in meta-analysis: Vitamin E supplementation and mortality","281642127":"Association of climate drivers with rainfall in New South Wales, Australia, using Bayesian Model Averaging","265727121":"Bayesian factors","253421651":"Understanding the Cell Phone Effect on Motor Vehicle Fatalities Using Classical and Bayesian Methods","273573124":"Latent Feature Decompositions for Integrative Analysis of Multi-Platform Genomic Data","243770060":"Model Selection: An Integral Part of Inference","2704240":"Learning Belief Networks in Pseudo-independent Domains","2585469":"A Graphical Characterization of Lattice Conditional Independence Models","4898064":"Parallel coordinates for exploratory modelling analysis","226884574":"Learning Bayesian Networks: The Combination of Knowledge and Statistical Data","2747511":"Approximate Bayes Factors and Accounting for Model Uncertainty in Generalized Linear Models","2427515":"Efficient Model Determination for Discrete Graphical Models","235764332":"Orthogonalizations and Priors for Orthogonalized Model Mixing","277731308":"Predicting Primary Flight Grades by Averaging Over Linear Regression Models: Part I","4720681":"Full bayesian inference for GARCH and EGARCH models","2583364":"A survey of Bayesian Data Mining - Part I: Discrete and semi-discrete Data Matrices","2784591":"Inference from a Deterministic Population Dynamics Model for Bowhead Whales: Rejoinder","2807884":"Bayesian Regression With Multivariate Linear Splines","241759502":"Capital Punishment and Deterrence: Understanding Disparate Results","2335556":"Data Splitting Strategies for Reducing the Effect of Model Selection on Inference","2619712":"Multiple Shrinkage and Subset Selection in Wavelets","3885909":"Bayesian methods for simulation","220451667":"Statistical Themes and Lessons for Data Mining","242916874":"Linearly Combining Density Estimators via Stacking","2590804":"Model Selection for Generalized Linear Models via GLIB, with Application to Epidemiology","278395364":"Development of a genetic linkage map for Pinus radiata and detection of pitch canker disease resistance associated QTLs","3296583":"A Guide to the Literature on Learning Probabilistic Networks from Data","2244693":"Perfect Simulation for orthogonal model mixing","223978016":"CSF-Biomarkers in Olympic Boxing: Diagnosis and Effects of Repetitive Head Trauma","43334894":"Is the most likely model likely to be the correct model?","237458599":"BAYESIAN VARIABLE SELECTION IN LINEAR REGRESSION AND A COMPARISON","246048559":"Eliciting prior information to enhance the predictive performance of Bayesian graphical models","250826100":"ENHANCING THE PREDICTIVE PERFORMANCE OF BAYESIAN GRAPHICAL l\\IlODELS","2469295":"Prediction Via Orthogonalized Model Mixing","2468777":"Strategies for Model Mixing in Generalized Linear Models","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","266307153":"A simulation study for some biased estimation methods","44581158":"Learning Patient-Specific Predictive Models from Clinical Data","2590647":"A Characterization of Markov Equivalence Classes for Acyclic Digraphs","232395592":"Review of uncertainty-based multidisciplinary design optimization methods for aerospace vehicles","224947707":"Integrating biological knowledge into variable selection: an empirical Bayes approach with an application in cancer biology","239560914":"Special Issue on Bayesian Function Estimation","5233370":"Bayesian Variable and Model Selection Methods for Genetic Association Studies","261755393":"Fast Bayesian inference for gene regulatory networks using ScanBMA","26321422":"Maximum-Likelihood Model Averaging To Profile Clustering of Site Types across Discrete Linear Sequences","249961030":"Finite Sample Performance of Robust Bayesian Regression","24023498":"Cross-Study Projections of Genomic Biomarkers: An Evaluation in Cancer Genomics","2614914":"Hypothesis Testing and Model Selection Via Posterior Simulation","221304469":"Concerning Bayesian Motion Segmentation, Model, Averaging, Matching and the Trifocal Tensor.","221638303":"OFDM CIR Estimation with Unknown Length via Bayesian Model Selection and Averaging","2771356":"Statistical Ideas for Selecting Network Architectures","43015206":"A Bayesian Approach to Nonparametric Bivariate Regression","2469266":"Bayesian Model Averaging and Model Search Strategies","247090433":"Bayesian Piecewise Linear Regression Using Multivariate Linear Splines","8649528":"Bayesian model averaging in EEG/MEG imaging","2744553":"Simulation Based Model Checking for Hierarchical Models","263613815":"Bayes factors","267819572":"Expanding the Capabilities of Bayesian Regression With Interactions and Smooth Effects","2718442":"Bayesian inference for nondecomposable graphical Gaussian models","2639852":"Bayesian Information Criterion for Censored Survival Models","11611253":"Variable selection and Bayesian model averaging in case-control studies","2642415":"Decomposable Graphical Gaussian Model Determination","225128354":"Model Selection for Two View Geometry:A Review","225149862":"A Tutorial on Learning With Bayesian Networks","257796752":"Bayesian regression model for seasonal forecast of precipitation over Korea","257684629":"A new approach for Bayesian model averaging","222303888":"Construction of Bayesian Network Structures From Data: A Brief Survey and an Efficient Algorithm","2718463":"Stacked Density Estimation","259625903":"Model averaging for genome-enabled prediction with reproducing kernel Hilbert spaces: A case study with pig litter size and wheat yield","2807030":"Generalized Nonlinear Modelling With Multivariate Smoothing Splines.","265773622":"Bayesian variable selection in linear regression and a comparison","225133704":"The Posterior Probability of Bayes Nets with Strong Dependences","26638704":"Seeking for the rational basis of the Median Model: The optimal combination of multi-model ensemble results","2766796":"Bayes Factors and BIC: Comment on Weakliem","261741940":"Bayesian Regression Modeling with Interactions and Smooth Effects","237065934":"A Two-Stage Bayesian Model Selection Strategy for Supersaturated Designs","45098048":"Online Prediction Under Model Uncertainty via Dynamic Model Averaging: Application to a Cold Rolling Mill","23184016":"Developments in statistical analysis in quantitative genetics","2250449":"Bayesian Graphical Modeling for Intelligent Tutoring Systems","224881809":"Approaches for Bayesian Variable Selection","8928127":"Mixture model for inferring susceptibility to mastitis in dairy cattle: A procedure for likelihood-based inference","226916477":"A “Microscopic” Study of Minimum Entropy Search in Learning Decomposable Markov Networks","221526472":"Bayesian Ideas and Discrete Event Simulation: Why, What and How","282608932":"Weighted Score Tests Implementing Model-Averaging Schemes in Detection of Rare Variants in Case-Control Studies","26714984":"Pers TH, Albrechtsen A, Holst C, Sørensen TIA, Gerds TA. The validation and assessment of machine learning: a game of prediction from high-dimensional data. PLoS One 4: e6287"},"index":120}