{"abs":"An ordinal and binary regression model with parametric link is introduced. The link is a member of a one-parameter family of “mixture links”, a family that comprises smooth mixtures of the extreme minimum-value, extreme maximum-value, and logistic distributions. A Bayesian version of this flexible model serves as a vehicle for introducing a priori information regarding the choice of link. Owing to non-conjugacy, posterior and predictive distributions are approximated using Markov chain Monte Carlo simulation methods. Link-independent, Bayesian interpretations of covariate effects are described. The method is illustrated through the analyses of several data sets.","title":"Bayesian ordinal and binary regression models with a parametric family of mixture links","id":4893891,"url":"https://www.researchgate.net/publication/4893891_Bayesian_ordinal_and_binary_regression_models_with_a_parametric_family_of_mixture_links","names":["Joseph B. Lang","Computational Statistics \u0026 Data Analysis"],"references":{"227907701":"The Calculation of the Dosage-Mortality Curve,\u0027\u0027","38357609":"Markov Chains for Exploring Posterior Distributions","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","222266491":"Bayesian inference of binary regression models with parametric link","240166806":"Parameter orthogonality and approximate conditional inference. J Roy Stat Soc Ser B","284300888":"Monte Carlo Bayesian methods for discrete regression models and categorical time series","227764760":"Goodness‐of‐link testing in ordinal regression models","22146202":"A Generalization of the Probit and Logit Methods for Dose Response Curves","19860867":"A General Regression Methodology for ROC Curve Estimation","233111242":"Norm Restricted Maximum Likelihood Estimators for Binary Regression Models with Parametric Link.Comm. Statist.—Theor. Meth. 22, No. 8, 2259-2274","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","245071851":"A single series from the Gibbs sampler provides a false sense of security","221995881":"Bayesian Data Analysis, London","229645382":"Orthogonalizing Link Transformation Families in Binary Regression Analysis.Canad. J. Statist. 20, No. 1, 51-62","286694496":"Orthogonalizing parametric link transformation families in binary regression analysis","254286847":"Generalized Logistic Models","243049376":"On the small sample properties of restricted maximum likelihood estimators for logistic regression models.Comm. Statist.-Theor. Meth. 18, 959-989","236853411":"“Regression Models for Ordinal Data (with Discussion),”","271076887":"Markov Chain Monte Carlo In Practice"},"citedIn":{"274094950":"Bayesian Model Choice in Cumulative Link Ordinal Regression Models","253983395":"PREDICTING DEFAULT PROBABILITIES USING BALANCE SHEET INDICATORS","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","12826180":"Agresti A. Modelling ordered categorical data: recent advances and future challenges. Stat Med 18: 2191-2207","24065127":"The Analysis of Ordered Categorical Data: An Overview and a Survey of Recent Developments","220363786":"Bayesian Inference for Categorical Data Analysis","29749119":"Meta-Analysis of Diagnostic Test Data: Modern Statistical Approaches","233786292":"On generalized multinomial models and joint percentile estimation","248761160":"Generalized extreme value regression for ordinal response data","254672465":"Bayesian Generalized Polychotomous Response Models and Applications","222552269":"Bayesian clustering for row effects models"},"index":121}