{"abs":"A subroutine for automatic numerical integration is presented. The subroutine is developed by changing the basic rule used in an algorithm of P. van Dooren and L. de Ridder. Comparative test results are given.","title":"Remarks on algorithm 006: An adaptive algorithm for numerical integration over an N-dimensional rectangular region","id":223113521,"url":"https://www.researchgate.net/publication/223113521_Remarks_on_algorithm_006_An_adaptive_algorithm_for_numerical_integration_over_an_N-dimensional_rectangular_region","names":["Alan Genz","A.A. Malik","Journal of Computational and Applied Mathematics"],"references":{"222734022":"An adaptive algorithm for numerical integration over an n-dimensional cube","242609350":"An algorithm for automatic integration","235202471":"An Adaptive Algorithm for Multivariate Approximation Giving Optimal Convergence Rates","268705746":"Numerical integration over an N-dimensional rectangular region","220493218":"Local Versus Global Strategies for Adaptive Quadrature","220432536":"A Metalgorithm for Adaptive Quadrature","242607595":"Approximate Calculation of Multiple Integral"},"citedIn":{"261368980":"Sample Size Determination in Shared Frailty Models for Multivariate Time-to-Event Data","226734977":"Fully symmetric integration rules for the 4-cube","242730111":"Sparse Grid Quadrature in High Dimensions With Applications in Finance and Insurance","254756391":"Influence of wind conditions on wind turbine loads and measurement of turbulence using LIDARs","216300269":"An Adaptive Algorithm for the Approximate Calculation of Multiple Integrals","238687280":"A Package for Testing Multiple Integration Subroutines","247317686":"Chapter 15 Monte carlo simulation and numerical integration","226527630":"Hyper-Rectangle Distribution Algorithm for Parallel Multidimensional Numerical Integration","258250346":"Stable He- can Exist in a Strong Magnetic Field","220104977":"Global adaptive quadrature for the approximate computation of multidimensional integrals on a distributed-memory multiprocessor","233898723":"Strongly interacting fermions in an optical lattice","257338181":"Estimating standard errors in regular vine copula models","239677274":"A Non-Gaussian Spatial Generalized Linear Latent Variable Model","222854493":"On an interpolatory method for high dimensional integration","1756173":"Leading Yukawa corrections to Higgs production associated with a tagged bottom-antibottom pair in the standard model at the CERN LHC","261165449":"An Efficient Deterministic Parallel Algorithm for Adaptive Multidimensional Numerical Integration on GPUs","2457917":"Numerical Integration using Sparse Grids","226283109":"Small-Amplitude Perturbation Theory for One-Dimensionally Rough Surfaces","228713144":"Generalized Linear Latent Variable Models with Flexible Distribution of Latent Variables","256938057":"The dual-quadrature method of generalized moments using automatic integration packages","222545763":"Cubature formulas for function spaces with moderate smoothness","225408846":"Simple Method for Solving Transport Equations Describing the Propagation of Cosmic-Ray Nucleons in the Atmosphere","24071758":"Valuation of Performance-Dependent Options","256938098":"Solution of the population balance equation using parallel adaptive cubature on GPUs","243838125":"On the thermodynamic characteristics of the benzene ⋯ Ar2 complex: An application of the Ab initio intermolecular potential","289613413":"On Efficient Computational Schemes to Calculate Structural Failure Probabilities","283754191":"Robust adaptive numerical integration of irregular functions with applications to Basket and other multi-dimensional exotic options","225658708":"Development of a parallel and distributed integration package — Part I","235663651":"A response surface methodology for Bayesian analysis of univariate and multivariate stochastic volatility models","220492301":"CUBPACK++: a C++ package for automatic two-dimensional cubature","226914223":"Numerical integration on distributed-memory parallel systems","243095895":"On the Construction of Higher Degree Three-Dimensional Embedded Integration Rules","220074037":"Hyper-Rectangle Selection and Distribution Algorithm for Parallel Adaptive Numerical Integration.","2778374":"Methods for Approximating Integrals in Statistics with Special Emphasis on Bayesian Integration Problems","266043126":"Estimating the systematic er- rors in turbulence sensed by wind lidars","221448478":"Distributed Quasi Monte-Carlo Methods in a Heterogeneous Environment.","3722262":"Adaptive multivariate integration using MPI","232969680":"Evaluation and Simulation of Random Sequential Packing Density for a Small Square","2461719":"An Adaptive Numerical Integration Algorithm for Simplices","220389905":"Adaptive integration for multi-factor portfolio credit loss models","226983347":"High Dimensional Integration of Smooth Functions over Cubes","2739229":"Adaptive Multivariate Integration using MPI","8988338":"Components of visual prior entry","259884865":"Observation of single top quark production and measurement of | V t b | with CDF","273736556":"Distributed and multi-core computation of 2-loop integrals","234892613":"Linear scaling computation of the Fock matrix. V. Hierarchical Cubature for numerical integration of the exchange-correlation matrix","230672629":"Prediction of particle type from measurements of particle location: A physicist\u0027s approach to Bayesian classification","238011749":"Spherical aberration and the electromagnetic field in high-aperture systems","232455317":"Confusable and Discriminable Stimuli: Comment on Nosofsky (1986) and Shepard (1986)","19923552":"Models for the Duo-Trio and Triangular Methods","256196629":"High-dimensional numerical problems","267228604":"Turbulence measurements by wind lidars","41882924":"Adaptive Integration and Approximation over hyper-rectangular regions with applications to basket options pricing","227756224":"Numerical calculation of overlap and kinetic integrals in prolate spheroidal coordinates","268262057":"Non-Linear Models of Composite Laminates","280329952":"Bayesian Time-of-Flight for Realtime Shape, Illumination and Albedo","51893568":"About the ground state of the H+3 hydrogen molecular ion","222492698":"Parallel globally adaptive algorithms for multi-dimensional integration","256028187":"Nearly Exact Option Price Simulation Using Characteristic Functions","230568158":"On the Use of Multipole Expansion in Time Evolution of Non-linear\nDynamical Systems and Some Surprises Related to Superradiance","222136926":"Numerical multiple integration on parallel computers","241001790":"Validation and Applications","5142824":"Numerical integration in S-PLUS or R: a survey","263408602":"A Numerical Likelihood-Based Approach to Combining Correlation Matrices","262974661":"Quasi-Monte Carlo point sets with small $t$-values and WAFOM","2821184":"Work Anomaly In Distributed Adaptive Partitioning Algorithms","277940990":"Adaptive Integration for 3-loop Feynman Diagrams with Massless Propagators","262919902":"Numerical Integration of Discontinuous Functions in Many Dimensions","257982485":"Protecting orbital-angular-momentum photons from decoherence in a turbulent atmosphere","220492882":"An adaptive numerical cubature algorithm for simplices","232405677":"Batch sequential design to achieve predictive maturity with calibrated computer models","277289981":"Sparse Grid Quadrature Methods for Computational Finance","225045267":"Is there significant time-variation in multivariate copulas?","37684803":"Sparse Grids","263967684":"High-energy neutrino fluxes and flavor ratio in the Earth\u0027s atmosphere","24062958":"A simple multivariate probabilistic model for preferential and triadic choices","2497701":"Large Scale Parallel Numerical Integration","267195754":"Adaptive Numerical Integration on Message-Passing Systems","227064335":"Density Estimation by Spatially Explicit Capture–Recapture: Likelihood-Based Methods","220277161":"A parallelization of adaptive task partitioning algorithms","261987861":"A Memory Efficient Algorithm for Adaptive Multidimensional Integration with Multiple GPUs","2705829":"Use of ParInt for Parallel Computation of Statistics Integrals","226967307":"Two-center overlap integrals, three dimensional adaptive integration, and prolate ellipsoidal coordinates","26678043":"Evaluation of a lithium formate EPR dosimetry system for dose measurements around 192Ir brachytherapy sources.","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","236198299":"The Ground State of the H3(+) Molecular Ion: Physics Behind.","252934275":"Evaluation of a lithium formate EPR dosimetry system for dose measurements around (192)Ir brachytherapy sources","261006621":"Modeling multisite streamflow dependence with maximum entropy copula","280088102":"Modelagem e Determinação de Custos para Serviços TI","225560297":"An adaptive numerical integration algorithm for simplices","251153504":"Dimension-wise Quadrature","266599295":"The Integration of the Multivariate Normal Density Function for the Triangular Method","220855989":"Parallel High-Dimensional Integration: Quasi-Monte Carlo versus Adaptive Cubature Rules","275088122":"Computationally Efficient Imprecise Uncertainty Propagation","231688301":"Corrections: Spectrum of Light Quasielastically Scattered from Solutions of Very Long Rods at Dilute and Semidilute Regimes","223663606":"Error trends in Quasi-Monte Carlo integration","277296164":"High-Dimensional Numerical Integration on Parallel Computers","239060380":"Statistics Applications of Subregion Adaptive Multiple Numerical Integration","228919553":"Shift-nets and Salzburg tables: Power computing in number-theoretical numerics","257406195":"Derivatives and Fisher information of bivariate copulas","231688554":"Spectrum of light quasi-elastically scattered from solutions of semiflexible filaments in the dilute and semidilute regimes","257853940":"High-energy cosmic ray muons in the Earth’s atmosphere","277808165":"The Ninth Workshop on Heterogeneous Computing: HCW 2000","226667049":"Meson cascade in the atmosphere, uncertainties in calculating the fluxes of high-energy muons, and data of direct measurements","1815735":"Bayesian Analysis of the Polarization of Distant Radio Sources: Limits on Cosmological Birefringence","221650331":"A Comparison of Parallel Algorithms for Multi-Dimensional Integration.","253265578":"Can Wind Lidars Measure Turbulence?","220348310":"Monte Carlo algorithms for evaluating Sobol\u0027 sensitivity indices","220493459":"Algorithm 824:","275059420":"Verification of fluid-dynamic codes in the presence of shocks and other discontinuities","237176037":"Accounting for fish shoals in single- and multi-species survey data using mixture distribution models","257219475":"A comparison between (quasi-)Monte Carlo and cubature rule based methods for solving high-dimensional integration problems","258662829":"Measurement of turbulence spectra using scanning pulsed wind lidars","228665961":"Numerical Approximation of Some Infinite Gaussian Series and Integrals","222326411":"Numerical evaluation of overlap integrals between atomic orbitals","221434110":"A Fast Integration Method and Its Application in a Medical Physics Problem","220594678":"An evaluation of adaptive numerical integration algorithms on parallel systems","229756771":"Numerical calculation of overlap and kinetic integrals in prolate spheroidal coordinates. II","247509267":"Sharper error estimates in adaptive quadrature","2582515":"Efficiency Of Distributed Priority Queues In Parallel Adaptive Integration","255947156":"Measurement of the $WW+WZ$ Production Cross Section Using a Matrix Element Technique in Lepton + Jets Events","235663582":"Revisiting Herding Behavior: Likelihood Evidence","275965611":"Quality Control of Antenna Alignment and Receiver Calibration Using the Sun: Adaptation to Midrange Weather Radar Observations at Low Elevation Angles","2044613":"The Metropolis algorithm for on-shell four-momentum phase space","257519800":"Fourier series based reliability analysis of aeroengine turbine blade under linear fuzzy safety state","228981062":"Optimal Communication Frequency for Parallel Adaptive Integration Routines","242979230":"Practical error estimation in adaptive multidimensional quadrature routines","258176645":"On the numerical modeling of laser shearing of glass sheets used to optimize production methods","270107646":"Performance of cubature formulae in probabilistic model analysis and optimization","2446799":"Numerical Integration","226860399":"Extrapolation and Adaptivity in Software for Automatic Numerical Integration on a Cube","262356557":"Dimension?Adaptive Tensor?Product Quadrature","223415742":"A multivariate model for discrimination methods","2892765":"A Hybrid Symbolic-Numeric Method for Multiple Integration Based on Tensor-Product Series Approximations","226425484":"Application of Rice’s theory to recurrence statistics of concentration fluctuations in dispersing plumes","225227166":"Doubly Adaptive Quadrature Routines Based on Newton–Cotes Rules","220171756":"On the Power of Adaption","264349237":"Functional renormalization group study of fluctuation effects in fermionic superfluids","26320486":"Cyclorotation Models for Eyes and Cameras","2258906":"A Comparison of Parallel Algorithms for Multi-dimensional Integration"},"index":128}