{"abs":"Scaling of proposals for Metropolis algorithms is an important practical problem in MCMC implementation. Criteria for scaling based on empirical acceptance rates of algorithms have been found to work consistently well across a broad range of problems. Essentially, proposal jump sizes are increased when acceptance rates are high and decreased when rates are low. In recent years, considerable theoretical support has been given for rules of this type which work on the basis that acceptance rates around 0.234 should be preferred. This has been based on asymptotic results that approximate high dimensional algorithm trajectories by diffusions. In this paper, we develop a novel approach to understanding 0.234 which avoids the need for diffusion limits. We derive explicit formulae for algorithm efficiency and acceptance rates as functions of the scaling parameter. We apply these to the family of elliptically symmetric target densities, where further illuminating explicit results are possible. Under suitable conditions, we verify the 0.234 rule for a new class of target densities. Moreover, we can characterise cases where 0.234 fails to hold, either because the target density is too diffuse in a sense we make precise, or because the eccentricity of the target density is too severe, again in a sense we make precise. We provide numerical verifications of our results. Comment: Published in at http://dx.doi.org/10.3150/08-BEJ176 the Bernoulli (http://isi.cbs.nl/bernoulli/) by the International Statistical Institute/Bernoulli Society (http://isi.cbs.nl/BS/bshome.htm)","title":"Optimal scaling of the random walk Metropolis on elliptically symmetric unimodal targets","id":45870805,"url":"https://www.researchgate.net/publication/45870805_Optimal_scaling_of_the_random_walk_Metropolis_on_elliptically_symmetric_unimodal_targets","names":["Chris Sherlock","Gareth Roberts","Bernoulli"],"references":{"242609012":"Principles of multivariate analysis : a user\u0027s perspective. oxford","248859766":"A mathematical analysis of Go","200105001":"Equation of State by Fast Computing Machines","233807017":"Mathematical Analysis","1771219":"Bédard, M.: Weak convergence of metropolis algorithms for non-i.i.d. target distributions. Ann. Appl. Probab. 17, 1222-1244","247689736":"Symmetric Multivariate and Related Distributions","239593783":"Methodology for Inference on the Markov Modulated Poisson Process and Theory for Optimal Scaling of the Random Walk Metropolis","221669734":"Equations of State Calculations by Fast Computing Machines","227425151":"From Metropolis to Diffusions: Gibbs States and Optimal Scaling. Stochastic Process","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","247069216":"Optimal Metropolis algorithms for product measures on the vertices of a hypercube","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","235331100":"Principles of Multivariate Analysis: A User\u0027s Perspective","243739482":"Efficient Metropolis Jumping Rules"},"citedIn":{"232276216":"Optimal scaling of random walk Metropolis algorithms with discontinuous\ntarget densities","269814261":"A Bayesian approach for identifying drip emitter insertion head loss coefficients","221940987":"A coupled hidden Markov model for disease interactions","269998132":"Particle Metropolis adjusted Langevin algorithms","45916313":"An Adaptive Sequential Monte Carlo Sampler","267812048":"Complexity Bounds for MCMC via Diffusion Limits","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","49458431":"A tutorial on adaptive MCMC","24166398":"On the stability and ergodicity of adaptive scaling Metropolis algorithms. Stochastic Process","259314843":"Efficiency and time-dependent cross correlations in multivariable Monte Carlo updating","261289021":"Information-Geometric Markov Chain Monte Carlo Methods Using Diffusions","268441712":"ON THE CONVERGENCE OF UNCONSTRAINED ADAPTIVE MARKOV CHAIN MONTE CARLO ALGORITHMS","263052989":"A Semiparametric Bayesian Model for Detecting Synchrony Among Multiple Neurons","258384375":"A Class of Spherical and Elliptical Distributions with Gaussian-Like Limit Properties","45866217":"Optimal scalings for local Metropolis--Hastings chains on nonproduct targets in high dimensions","47843593":"The Random Walk Metropolis: Linking Theory and Practice Through a Case Study","256663380":"Spherical Hamiltonian Monte Carlo for Constrained Target Distributions","251726491":"To Screen or Not to Screen: Colon Cancer Rates in a County System Without Screening Colonoscopies for the Underprivileged Population","242014423":"A Semiparametric Bayesian Model for Neural Coding","258234143":"Optimal scaling of the random walk Metropolis: general criteria for the 0.234 acceptance rule","228385856":"Adaptive Monte Carlo for Bayesian Variable Selection in Regression Models","255655296":"Adaptive Monte Carlo for Binary Regression with Many Regressors","258247482":"Analysis of the Gibbs Sampler for Hierarchical Inverse Problems"},"index":129}