{"abs":"Markov chain Monte Carlo methods for Bayesian computation have until recently been restricted to problems where the joint distribution of all variables has a density with respect to some fixed standard underlying measure. They have therefore not been available for application to Bayesian model determination, where the dimensionality of the parameter vector is typically not fixed. This paper proposes a new framework for the construction of reversible Markov chain samplers that jump between parameter subspaces of differing dimensionality, which is flexible and entirely constructive. It should therefore have wide applicability in model determination problems. The methodology is illustrated with applications to multiple change-point analysis in one and two dimensions, and to a Bayesian comparison of binomial experiments.","title":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","id":2670104,"url":"https://www.researchgate.net/publication/2670104_Reversible_Jum_Markov_Chain_Monte_Carlo_Computation_and_Bayesian_Model_Determination","names":["Peter J. Green","Biometrika"],"references":{"243103678":"[Bayesian Computation and Stochastic Systems]: Rejoinder","38359626":"Product Partition Models for Change Point Problems","243765444":"Bayesian Retrospective Multiple Change-Point Identification","200105001":"Equation of State by Fast Computing Machines","200622065":"Equation of State Calculations by Fast Computing Machines","265975519":"Simulation and likelihood inference for spatial processes","254287396":"Model Selection and Accounting for Model Uncertainty in Graphics Models Using Occam\u0027s Window","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","243764505":"Bayesian Model Choice via Markov Chain Monte Carlo","38357609":"Markov Chains for Exploring Posterior Distributions","265620657":"Bayesian Computation and Stochastic Systems","228434680":"Bayesian analysis of a change-point Poisson process","38357612":"Discussion: Markov Chains for Exploring Posterior Distributions","239744365":"A Bayesian Analysis of Change Point Problems","247601450":"Spatial birth-and-death processes","2299598":"Model Selection and Accounting for Model Uncertainty in Linear Regression Models","254287622":"A Bayesian Method for Combining Results from Several Binomial Experiments","243786039":"Combining Minimax Shrinkage Estimators","224910615":"Nonparametric Bayesian inference for right-censored survival data, using the Gibbs sampler","2740958":"Bayesian Inference By Simulation in a Stochastic Model From Hematology","244464104":"Hierarchical Bayesian Analysis of Change Point Problems","265564270":"Representations of knowledge in complex systems. (With discussion)","271674892":"Bayesian Analysis of a Poisson Process with a Change-Point","31048548":"Computing Dirichlet Tessellations in the Plane"},"citedIn":{},"index":13}