{"abs":"A mixed-Dirichlet prior was previously used to model the hypotheses of \"independence\" and \"dependence\" in contingency tables, thus leading to a Bayesian test for independence. Each Dirichlet has a main hyperparameter $\\kappa$ and the mixing is attained by assuming a hyperprior for $\\kappa$. This hyperparameter can be regarded as a flattening or shrinking constant. We here review the method, generalize it and check the robustness and sensitivity with respect to variations in the hyperpriors and in their hyperhyperparameters. The hyperpriors examined included generalized log-Students with various numbers of degrees of freedom $\\nu$. When $\\nu$ is as large as 15 this hyperprior approximates a log-normal distribution and when $\\nu \u003d 1$ it is a log-Cauchy. Our experiments caused us to recommend the log-Cauchy hyperprior (or of course any distribution that closely approximates it). The user needs to judge values for the upper and lower quartiles, or any two quantiles, of $\\kappa$, but we find that the outcome is robust with respect to fairly wide variations in these judgments.","title":"The Robustness and Sensitivity of the Mixed-Dirichlet Bayesian Test for \"Independence\" in Contingency Tables","id":38360171,"url":"https://www.researchgate.net/publication/38360171_The_Robustness_and_Sensitivity_of_the_Mixed-Dirichlet_Bayesian_Test_for_Independence_in_Contingency_Tables","names":["I. J. Good","J. F. Crook","The Annals of Statistics"],"references":{},"citedIn":{"263613815":"Bayes factors","47511383":"Testing Hardy-Weinberg Equilibrium: an Objective Bayesian Analysis","233286947":"The maximum of a Bayes factor against ‘independence’ in a contingency table, and generalizations to higher dimensions","265727121":"Bayesian factors","242996845":"Good\u0027s work in probability, statistics and the philosophy of science","243787601":"Grade of membership and latent structure models with application to disability survey data","2641407":"Bayesian Selection of Log-Linear Models","245581819":"Bayes Factors and Model Uncertainty","229676586":"Bayesian Methods for Contingency Tables","249693823":"A Critique of the Bayesian Information Criterion for Model Selection","42366808":"Intrinsic test of independence in contingency tables","2128190":"Bayesian analysis for reversible Markov chains","8054491":"Intrinsic Meta-Analysis of Contingency Tables","227700400":"Bayes factors based on test statistics","227682801":"The History of the Dirichlet and Liouville Distributions","233126720":"C276. On terminology for matrices of special forms","239666284":"Inferences from multinomial data: Learning about a bag of marbles","229571336":"A Bayesian test for a two-way contingency table using independence priors","220363786":"Bayesian Inference for Categorical Data Analysis","227369188":"Assessing Robustness of Intrinsic Tests of Independence in Two-Way Contingency Tables","228564598":"Objective Bayesian Analysis of Contingency Tables","233070989":"C368. On the exact distribution of pearson\u0027s X2 for the lady tasting beer","233182039":"C333. On the judgement of ”numerological“ assertions","233480665":"C272. A flexible bayesian model for comparing two treatments","242996877":"Speculations concerning the future of statistics","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","233315743":"C370. A compromise between credibility and subjective probability","250755141":"Bayesian Methods and Simulation-Based Computation for Contingency Tables","226417408":"An overview of robust Bayesian analysis","2730071":"Markov Chain Monte Carlo Model Determination for Hierarchical and Graphical Log-linear Models"},"index":133}