{"abs":"The full Bayesian analysis of multinomial data using informative and flexible prior distributions has, in the past, been restricted by the technical problems involved in performing the numerical integrations required to obtain marginal densities for parameters and other functions thereof. In this paper it is shown that Gibbs sampling is suitable for obtaining accurate approximations to marginal densities for a large and flexible family of posterior distributions—the family. The method is illustrated with a three-way contingency table. Two alternative Monte Carlo strategies are also discussed.","title":"Calculation of marginal densities for parameters of multinomial distributions","id":226490433,"url":"https://www.researchgate.net/publication/226490433_Calculation_of_marginal_densities_for_parameters_of_multinomial_distributions","names":["Jonathan J. Forster","Allan M. Skene","Statistics and Computing"],"references":{"245581923":"Bayesian estimation methods for two-way contingency tables","261625017":"Density Estimation for Statistics and Data Analysis","265672532":"Bayesian Inference for Generalized Linear and Proportional Hazards Models via Gibbs Sampling","31102587":"Aitchison J. Principal component analysis of compositional data. Biometrika 70: 57-65","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","245872004":"Derivative-free adaptive rejection sampling for Gibbs sampling","243553632":"Using the SIR algorithm to simulate posterior distributions","230663803":"Distributions in Statistics: Continuous Univariate Distribution-II","254287149":"Generalized Linear Models With Random Effects; A Gibbs Sampling Approach","230752870":"Algorithm AS 287: Adaptive Rejection Sampling from Log-Concave Density Functions","19923545":"Incorporating Prior Information into the Analysis of Contingency Tables","38363224":"Inference From Iterative Simulation Using Multiple Sequences","31086728":"Bayesian Log Linear Estimates for Three-Way Contingency Tables","224910613":"Adaptive Rejection Sampling for Gibbs Sampling","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","38365855":"The Bayesian Analysis of Contingency Tables","225304570":"Non-Uniform Random Variate Generation","265325703":"A General class of distributions on the simplex","271760261":"Progress with Numerical and Graphical Methods for Practical Bayesian Statistics","44366367":"Density Estimation For Statistics And Data Analysis","269797000":"Distributions In Statistics Continuous Univariate Distributions - 2","224839673":"The Statistical Analysis of Compositional Data"},"citedIn":{"30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","220363786":"Bayesian Inference for Categorical Data Analysis","273730105":"A hybrid prediction model for no-shows and cancellations of outpatient appointments","226736430":"Bayesian analysis of contingency tables: A simulation and graphics-based approach","2730071":"Markov Chain Monte Carlo Model Determination for Hierarchical and Graphical Log-linear Models","12442290":"Combining Contingency Tables with Missing Dimensions"},"index":134}