{"abs":"A default prior distribution is proposed for the Bayesian analysis of contingency tables. The prior is specified to allow for dependence between levels of the factors. Different dependence structures are considered, including conditional autoregressive and distance correlation structures. To demonstrate the prior distribution, a dataset is considered which involves estimating the number of injecting drug users in the eleven National Health Service board regions of Scotland using an incomplete contingency table where the dependence structure relates to geographical regions.","title":"A default prior distribution for contingency tables with dependent factor levels","id":261766519,"url":"https://www.researchgate.net/publication/261766519_A_default_prior_distribution_for_contingency_tables_with_dependent_factor_levels","names":["Antony M Overstall","Ruth King","Statistical Methodology"],"references":{"263613815":"Bayes factors","237014562":"Injecting drug users in Scotland, 2006: Listing, number, demography, and opiate-related death-rates","225100712":"Reversible jump methods for generalised linear models and generalised linear mixed models","233774377":"Kendall’s Advanced Theory of Statistics","222572162":"Bayesian inference for Poisson and multinomial log-linear models","19923545":"Incorporating Prior Information into the Analysis of Contingency Tables","259111130":"Incomplete contingency tables with censored cells with application to estimating the number of people who inject drugs in Scotland","247932523":"The Multiple Recapture Census for Closed Populations and Incomplete 2 k Contingency Tables","271205402":"Bayes Factor","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","221995881":"Bayesian Data Analysis, London","245345867":"An Introduction to Categorical Data Analysis 18-26","226261640":"Efficient sampling from the posterior distribution in generalized linear mixed models. Statistics and Computing, 7, 57-68","243787602":"A Note on the Bayesian Analysis of Population Size","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","233139026":"Matrix Algebra. Theory, Computations, and Applications in Statistics","220449179":"Mapping rates associated with polygons","45933889":"Hyper-g Priors for Generalized Linear Models","252572883":"Kendall\u0027s Advanced Theory of Statistics, Vol. 2B: Bayesian Inference","247003431":"On Deriving the Inverse of a Sum of Matrices"},"citedIn":{"262875505":"conting: An R Package for Bayesian Analysis of Complete and Incomplete Contingency Tables","265644521":"On the correspondence between Bayesian log-linear and logistic regression models with g-priors","271140726":"Fully Bayesian Binary Markov Random Field Models: Prior Specification and Posterior Simulation"},"index":143}