{"abs":"Smooth mixtures, i.e. mixture models with covariate-dependent mixing weights, are very useful flexible models for conditional densities. Previous work shows that using too simple mixture components for modeling heteroscedastic and/or heavy tailed data can give a poor fit, even with a large number of components. This paper explores how well a smooth mixture of symmetric components can capture skewed data. Simulations and applications on real data show that including covariate-dependent skewness in the components can lead to substantially improved performance on skewed data, often using a much smaller number of components. Furthermore, variable selection is effective in removing unnecessary covariates in the skewness, which means that there is little loss in allowing for skewness in the components when the data are actually symmetric. We also introduce smooth mixtures of gamma and log-normal components to model positively-valued response variables.","title":"Modeling Conditional Densities Using Finite Smooth Mixtures","id":228312370,"url":"https://www.researchgate.net/publication/228312370_Modeling_Conditional_Densities_Using_Finite_Smooth_Mixtures","names":["Robert Kohn","Feng Li","Mattias Villani","SSRN Electronic Journal"],"references":{"265620884":"Bayesian mixture of splines for spatially adaptive nonparametric regression","46494854":"Regression density estimation using smooth adaptive Gaussian mixtures","243103227":"Sampling Schemes for Bayesian Variable Selection in Generalized Linear Models","46523277":"Gas or Electricity, which is Cheaper? An Econometric Approach with Application to Australian Expenditure Data","47278489":"Approximation of conditional densities by smooth mixture of regressions","252069260":"Parametric and Nonparametric Regression-Hierarchical mixtures-of-experts for exponential family regression models: Approximation and maximum likelihood estimation","2675235":"Bayesian Analysis of Mixture Models With an Unknown Number of Components – An Alternative to Reversible Jump Methods","227661917":"Green, P.J.: On Bayesian analysis of mixtures with an unknown number of components (with discussion). J. Roy. Stat. Soc. B. 59, 731-792","2741222":"Bayesian Density Estimation and Inference Using Mixtures","2763514":"Computational and Inferential Difficulties With Mixture Posterior Distributions","3769512":"Hierarchical Mixtures of Experts and the EM Algorithm","222708116":"Interpretation and inference in mixture models: Simple MCMC works","227390047":"Semiparametric Regression","10832944":"Density Estimation Through Convex Combinations of Densities: Approximation and Estimation Bounds","2660592":"Bayesian Inference in Mixtures-of-Experts and Hierarchical Mixtures-of-Experts Models With an Application to Speech Recognition","222666782":"Smoothly Mixing Regressions","220286588":"A general approach to heteroskedastic regression","12881703":"On the approximation rate of hierarchical mixtures-of-experts for generalized linear models","222822628":"Flexible modeling of conditional distributions using smooth mixtures of asymmetric Student t densities","229927128":"Locally weighted least squares kernel regression and statistical evaluation of LIDAR measurements. Environmetrics, 7, 401-416","243102928":"Bayesian Methods for Nonlinear Classification and Regression:Bayesian Methods for Nonlinear Classification and Regression","256843360":"Non Parametric Regression and Generalized Linear Models: A Roughness Penalty Approach","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","38327033":"Markov Chain Monte Carlo Methods and the Label Switching Problem in Bayesian Mixture Modeling","243763126":"Estimation of Finite Mixture Distributions Through Bayesian Sampling","252233659":"Estimation of impurity profiles in ion-implanted amorphous targets using joined half-Gaussian distributions","226261640":"Efficient sampling from the posterior distribution in generalized linear mixed models. Statistics and Computing, 7, 57-68","233806999":"Adaptive Mixture of Local Expert","225241873":"Kohn R, Smith M, Chan D. Nonparametric regression using linear combinations of basis functions. Stat Comput 11: 313-322"},"citedIn":{"259757304":"Dynamic Mixture-of-Experts Models for Longitudinal and Discrete-time Survival Data","236897032":"Bayesian Modeling of Conditional Densities"},"index":144}