{"abs":"The differential and total cross sections for elastic scattering of electrons by atomic hydrogen are calculated below the threshold for excitation of the second target quantum level (10.2 ev). A close-coupling approximation is used in which the total wave function is expanded in hydrogen eigenstates, and only terms corresponding to the ls, 2s, and 2p states are retained; the wave function is symmetrized or antisymmetrized explicitiy. The coupled set of integro-differential equations resufting from the approximate wave function is integrated numerically subject to standard boundary conditions, to yield the phase shift in each total spin and total angular-momentum state. The solution involves an iteration procedure to treat the integral terms, and a specialized integration scheme, including an asymptotic expansion of the solution, to overcome certain numerical difficuities associated with low-incident-electron energy. A striking feature of the results is the appearance in many of the spin and angularmomentum states of pronounced, extremely narrow BreitWigner resonances at energies slightly below the second quantum excitation threshold. The resonance lying lowest in energy is analyzed in detail; it occurs in the singlet S state. lt is found to have a full width at half maximum of 0,109 ev, and to be centered at 9.6l ev. The long-range polarization effect is found to be dominant only at and very near zero energy for S and P states; for D states it is important up to 6 or 7 ev, and for F states it is of central importance for almost the entire range of energy below threshold. (auth)","title":"Elastic Scattering of Low-Energy Electrons by Atomic Hydrogen","id":255893432,"url":"https://www.researchgate.net/publication/255893432_Elastic_Scattering_of_Low-Energy_Electrons_by_Atomic_Hydrogen","names":["P.G. Burke","H.M. Schey","Physical Review"],"references":{"234228727":"Collisions of Electrons with Hydrogen Atoms. VI. Angular Distribution in Elastic Scattering","243697797":"Multiple Scattering by Quantum-Mechanical Systems","252209932":"The 1s-2s Excitation of Hydrogen Atoms by Electron Impact","239041467":"Optical-Model Analysis of Low-Energy Electron-Hydrogen Scattering","239041464":"Variational Treatment of Electron-Hydrogen Atom Elastic Scattering","264966849":"Scattering of Electrons by Neutral Atoms","239041333":"A Note on the Scattering of Electrons from Atomic Hydrogen","241471604":"Collisions of Electrons with Hydrogen Atoms. III. Elastic Scattering","253484234":"Excitation Of H 2s by Electron Impact","257963185":"Application of the Method of Polarized Orbitals to the Scattering of Electrons from Hydrogen","243692949":"Variational Methods in Nuclear Collision Problems","252363550":"Scattering of Low-Energy Electrons by Atomic Hydrogen","238541027":"Theory of the Scattering of Slow Electrons","243689745":"The Effect of Exchange on the Scattering of Slow Electrons from Atoms","239657823":"Calculation of the 1s-2s Electron Excitation Cross Section of Hydrogen","257963257":"Electron Scattering from Hydrogen","234939289":"Modification of Effective-Range Theory in the Presence of a Long-Range Potential","253440826":"Effect of Virtual Excitation of the 2s State on the Elastic Scattering of Electrons by Atomic Hydrogen","261143411":"On the Theory of Elastic Collisions Between Electrons and Hydrogen Atoms","243700195":"Effect of Virtual Excitations on the Elastic Scattering of Electrons and Positrons by Atomic Hydrogen","231787576":"The partial wave theory of electron-hydrogen atom collisions","239039446":"On the Behavior of Cross Sections Near Thresholds","243681967":"The Application of Variational Methods to Atomic Scattering Problems. V. The Zero Energy Limit of the Cross-Section for Elastic Scattering of Electrons by Hydrogen Atoms","252389473":"Scattering of Charged Particles by Neutral Atoms","243700011":"Elastic and Inelastic Scattering of Electrons from the S States of Atomic Hydrogen","243699816":"Upper Bounds on Electron-Atomic Hydrogen Scattering Lengths","243681396":"The Scattering of Protons by Deuterons","270544724":"Capture of Slow Neutrons","232323629":"Inelastic scattering","257962777":"Upper Bounds on Scattering Lengths for Static Potentials","234554689":"The Motion of an Electron in the Hartree Field of a Hydrogen Atom."},"citedIn":{"243705477":"Static Green\u0027s Function for Elastic Electron-Hydrogen Scattering and Resonances","227303055":"Resonances in the dtµ molecular ion between tµ(n\u003d2) and dµ(n\u003d2) thresholds","243701378":"Collisions of Slow Electrons and Positrons with Atomic Hydrogen","231063232":"The variable-phase method in multichannel electron-atom or electron-ion scattering","258098281":"Atomic physics","255877198":"Electron—Alkali-Atom Interaction Potential and Elastic-Scattering Cross Section","30765767":"Extension of the Schwinger variational principle beyond the static-exchange approximation","258976637":"The Numerical Solution of the Equations of Molecular Scattering","222804306":"The Jovian ionosphere: Composition and temperatures","272951378":"Asymptotic solution of coupled equations for electron scattering","279426238":"Recent Measurements on Charge Transfer","222226727":"Long-standing themes in computational chemical dynamics","253524739":"Accurate width and position of lowest 1S resonance in H - calculated from real-valued stabilization graphs","13374958":"Computation of exchange probability in one-dimensional electron-hydrogen scattering","235485994":"Projection-Operator Approximation for Autoionization States in the Inelastic Scattering Region","231057382":"Electron scattering from hydrogen atoms. II. Elastic scattering at low energies from 0.5 to 8.7 eV","235471661":"Choosing Pseudostates in the Close-Coupling Formalism for the Electron—Atomic-Hydrogen System","236437297":"The Low-Energy Scattering of Electrons and Positrons by Hydrogen Atoms","229268621":"Numerical asymptotic functions in variational scattering theory","231099873":"A narrow resonance in the elastic scattering of electrons by helium","235460129":"Two-Photon Decay Rate of the 2^{1} S_ {0} Metastable State of Helium","235584803":"Electron-Excitation Cross Sections of Sodium by the Method of Close Coupling","226503337":"Treatment of the positron-hydrogen system in hyperspherical coordinates","253500976":"Upper and Lower Bounds on s-Wave Electron-Hydrogen Scattering. I","239758950":"Gaussian basis set techniques for calculating electronic resonance positions and widths: Analytic continuation and complex stabilization methods","235541799":"Electron scattering by nonspherically symmetric atoms: Zero-energy limit","239639654":"Classification of Two-Electron Excitation Levels of Helium","235470375":"Semiclassical Theory for Low-Energy Molecular Collisions. H^{+}-H_ {2} Vibrational Excitation","253576493":"Algebraic close coupling calculation of electron hydrogen scattering","230969588":"Effect of Virtual Excitation of the 2s and 2p States on the Elastic Scattering of Electrons by Atomic Hydrogen","234991152":"Close Coupled Calculations of Electron‐Hydrogen Atom Scattering Using a Noniterative Integral Equation Technique","255873906":"Theory of Low-Energy Scattering of Electrons by Hydrogen Atoms","255831307":"Positron-hydrogen scattering using an integral approach","234241987":"Radiative Transitions Involving the (2p2) 3Pe Metastable Auto-Detaching State of H-","277487551":"Electron scattering from atoms in the presence of a laser field","243385787":"Low-Energy Electron-Atom and Electron-Molecule Scattering Theory circa 1964","243247684":"Stossfrequenzen der neutralteilchen in wasserstoffund argonplasmen","231095288":"Differential cross sections for the elastic scattering of electrons from atomic hydrogen at low energies","2180638":"Electron exchange model potential: Application to positronium-helium scattering","13378958":"Direct numerical approach to electron-hydrogen scattering","235480397":"Low-Energy Electron Scattering in the Random-Phase Approximation","242806591":"The calculation of molecular multiphoton processes using the R-matrix-Floquet method","231049868":"Adiabatic limit and nonadiabatic effects in the second order transition potential: Semi-empirical analysis","13379718":"Variational close-coupling calculation for positron-hydrogen scattering at low energies","13376902":"Erratum: Direct numerical approach to electron-hydrogen scattering. II. L\u003e0","251185331":"Electron-Atom Resonances","13392256":"High-energy forward elastic scattering of electrons: Partial-wave approximations","23858721":"Absorption of Infrared Radiation by Electrons in the Field of a Neutral Hydrogen Atom - I","230997641":"Oscillation theory and computational procedures for matrix Sturm-Liouville eigenvalue problems, with an application to the hydrogen molecular ion","243453389":"Calculation of Autoionization Levels in He","253118020":"Asymptotic approximations, with error estimates, of the scattering matrix for quantal Coulomb excitation by means of a nonlinear (Riccati) matrix differential equation","235528794":"Graphic Analysis of Perturbed Rydberg Series","222840604":"KANTBP: A program for computing energy levels, reaction matrix and radial wave functions in the coupled-channel hyperspherical adiabatic approach","290085405":"Hole-Projection Method for Calculating Feshbach Resonances and Inner-Shell Vacancies","229254641":"Application of the Harris-Nesbet method to a dipole coupling potential","223024151":"A parallel R-matrix program PRMAT for electron–atom and electron–ion scattering calculations","243453151":"Electron-Hydrogen Phase Shifts Just Below the Inelastic Threshold","45885921":"Resonant States of Open Quantum Systems","255057491":"Resonances in Electron Atom and Molecule Scattering","253015157":"Semiclassical theory for low-energy molecular collisions II. Atomic exchange reactions","257216566":"Elastic-scattering cross-section for electrons and positrons from atomic hydrogen","243701475":"Empirical Analysis of the H − Photodetachment Cross Section","231094446":"Excitation of highly excited hydrogenic ions and atoms by charged particles. II","235585889":"Momentum-space coupled-channels optical method for electron-atom scattering","241598474":"Measurements of the (3p2)1D state of H- by electron transmission spectroscopy","229811935":"Asymptotic Expansion","225978389":"Calculations on some excited states of He−","258094610":"Recent Progress in Theoretical Methods for Atomic Collisions","230904243":"A classical model for the (p+e-+e+) system","230965684":"Quantum defect theory III. Electron scattering by He+","290073401":"Polarized-Beams Studies of Spin Exchange in Electron-Hydrogen Collisions","256153148":"Analytical evaluation of integrals over Coulomb wave functions","245066211":"Close-coupling calculations of low-energy positron-alkali collisions","13374645":"Two-dimensional R -matrix propagator: Application to electron-hydrogen scattering","227142896":"Physics of atomic collisions in retrospect","251134850":"Electron Collisions with Atoms and Ions","30769582":"Rearrangement Collisions: Effect of Core Terms, Nonorthogonality, and Conservation of Particle Flux on Approximate Theories","234346891":"Electron-Atom, Electron-Ion, and Electron-Molecule Collisions","235553418":"Distorted-wave reaction theory with long-range multipole potentials","241593573":"Polarization Potentials for Low-Energy Scattering: e+-H and e--Li","253407647":"Elastic eH Scattering at Low Energies","223105482":"The linear algebraic method for the scattering of electrons from atoms and molecules: Computational techniques","230964291":"Continuum processes involving atomic systems with configurations 1s2...2pq","231156302":"R-matrix-Floquet theory of molecular multiphoton processes","260581656":"Electron Atom Scattering Theory","253809330":"Properties of resonance states in H/-","230962006":"Cross sections for the excitation of 3s,3p,3d,4p, and 4s manifolds in e-Ne collisions","235544985":"Self-Consistent-Field Calculations for the Elastic Scattering of Electrons from Hydrogenlike Systems","257189312":"Atomic system under synchrotron and laser radiation","13383771":"Close-coupling calculation for the Σ u + 2 state of H 2","234266735":"Continuum States of H^{-} and the Free-Free Absorption Coefficient.","285052769":"Electron—Atom Scattering Theory and Calculations","275920620":"Optical Potential Study of Electron Scattering by Rubidium","241217729":"Calculations on the Scattering of Electrons by Atomic Systems with Configurations 2pq","235473581":"Improved bound-state method for calculating resonance eigenvectors and properties","279345154":"Resonances in Atomic Physics","235598511":"Simplified variational method for P-wave electron-hydrogen scattering","231135587":"Low energy elastic scattering of electrons by Li and Na","222772974":"Solution of the relativistic asymptotic equations in electron-ion scattering","30415227":"R-Matrix Theory of Atomic, Molecular and Optical Processes","243447853":"Low-Energy PhotoIonization of the 11S and 21S States of He","258937024":"Inelastic Vibrational and Rotational Quantum Collisions","231002475":"Developments in atomic structure calculations","234927794":"Coupled channel operator approach to e‐H scattering","259241671":"Experimental Studies of Electron-Atom Resonances","230911863":"Electron scattering by complex atoms","231080306":"The excitation of atomic hydrogen by electron impact","234977460":"Evaluation of Approximations Used in the Calculation of Excitation by Collision. I. Vibrational Excitation of Molecules","225129181":"Self-consistent field theory of collisions I. Scattering channels","243706686":"Coupled-States Method for Scattering Calculations","241012452":"Multichannel Collision Theory","228056107":"Electron Scattering by Atoms, Ions, and Molecules","231070840":"Asymptotic solutions of the coupled equations of electron-atom collision theory for the case of some channels closed","239934963":"LETTER TO THE EDITOR: The terminating of doubly excited 1,3Po resonances in H- below the n \u003d 2 H threshold","263856900":"Collisions of electrons with hydrogen atoms I. Package outline and high energy code","253457624":"Recent developments in R-matrix programs for electron-atom scattering","231031808":"Low-energy electron scattering by atomic hydrogen: I. The close-coupling approximation","43133015":"Application of the R-matrix method to photoionization of molecules","46424578":"Observation of Threshold Effects in Positron Scattering from the Noble Gases","1788892":"Spin Exchange Rates in Electron-Hydrogen Collisions","270679018":"Reconciliating the Vertical and Horizontal Gradients of the Sunspot Magnetic Field","243707981":"Many-Electron Pseudopotential Formalism for Atomic and Molecular Excited-State Calculations","234272571":"Thermal Generation of Hydromagnetic Waves in Sunspots","23824549":"Generalized Pseudopotential Approach for Electron-Atom Scattering","30866180":"Quantum-mechanical and semiclassical study of the collinear three-body Coulomb problem: Inelastic collisions below the three-body disintegration threshold","235486938":"Elastic Scattering of Positrons from Hydrogen: An Optical Potential Calculation","238487011":"Resonances and Threshold Behaviour","243702099":"2s and 2p Electron Impact Excitation in Atomic Hydrogen","253072067":"Polarization and Correlation of Electron Spin in Low-Energy Elastic Electron-Hydrogen Collisions","243453012":"Resonance in the Elastic Scattering of Electrons in Helium","253803510":"Modified Optical-Potential Approach to Low-Energy Electron-Helium Scattering","243702616":"Final-State Effects in Atomic Processes: Photodetachment","253074378":"Low-Energy Electron Collisions with Complex Atoms and Ions","235600874":"Many-Body Theory of the Elastic Scattering of Electrons from Atoms and Molecules","252205288":"Electron collision frequencies and energy transfer rates","231009572":"Scattering of electrons by ionized helium","253539581":"Recent Developments of the Frame Transformation Theory of Electron Molecule Processes","231407403":"Variational basis-set calculations of accurate quantum mechanical reaction probabilities","222439584":"Collision frequencies and energy transfer: Electrons","252429036":"Asymptotic solution for coupled-channel Coulomb excitation","227979633":"Advances in Chemical Physics, Volume 25","224520841":"Calculation of Photon‐Absorption Coefficient in Laser‐Produced Hydrogen Plasmas","241621390":"Computational study of channel coupling arrays: Low energy e−–H scattering parameters in the 1S approximation","255325405":"The Calculation of Elect Ron-Atom Excitation Cross Sections","235523810":"Application of the Quasiminimum Principle to Calculations on Electron Scattering by Atomic Hydrogen","235555553":"Variational lower bound on the scattering length","253676018":"High-Energy Behaviour of eH Scattering Cross Section","222307250":"Matrix variational method for electron-atom scattering","231052092":"Doubly excited resonant states in H- below the n\u003d2 hydrogen threshold","223834286":"Electron–molecule collision calculations using the R-matrix method","253997528":"Method for Treating Long Range Interactions in the Noniterative Integral Equation Formalism. Application to Electron-Hydrogen Atom Scattering","13380400":"15-State R-matrix investigation of resonances in elastic scattering of electrons from atomic hydrogen at low energies","13378352":"Secular perturbation theory of long-range interactions"},"index":154}