{"abs":"1. Understanding the relationships between flow regime and the distribution of biota is critical for managing flows in regulated rivers. In northern Victoria, Australia, efforts are presently underway to restore a natural, intermittent flow regime to several streams which, for over 100 years, have received perennial diversions as part of a stock, irrigation and domestic water supply. 2. Bayesian, model-averaged, binomial regression was used to predict probabilities of occurrence for 13 fish species, including five non-native species, based on hydrologic variables characterising both the current and modelled future flow regimes at 10 sites representing a range of hydrologic regimes (categorised here as heavily regulated, moderately regulated and unregulated). 3. Regression models accurately predicted present probabilities of occurrence for most species across all sites. The models predicted a reduced likelihood of large, native, flow-dependent species occurring at regulated sites following flow restoration. Predictions regarding the future distribution of widespread species including two small-bodied native and four exotic species were less certain as current distributions of these widespread species were unrelated to hydrologic variables we examined and thus unlikely to be significantly affected by flow restoration. The distributions of two small native species currently restricted to unregulated sites are predicted to increase throughout the system. 4. This study illustrates the effects of artificially induced perennial flow on lowland fish distributions. Furthermore, the combination of pre-restoration data together with predictive modelling provides valuable insights into the likely outcomes of flow regime shifts. 5. This study clearly demonstrates the value of combining empirical research and modelling in guiding environmental flow and ecosystem restoration decisions. Knowledge from the study is now helping guide management decisions and the development of mitigation strategies to protect highly valued species in the system from potential future threats.","title":"Modelling the impacts of flow regulation on fish distributions in naturally intermittent lowland streams: an approach for predicting restoration responses","id":230248353,"url":"https://www.researchgate.net/publication/230248353_Modelling_the_impacts_of_flow_regulation_on_fish_distributions_in_naturally_intermittent_lowland_streams_an_approach_for_predicting_restoration_responses","names":["Nick Bond","Damien McMaster","PAUL REICH","JAMES R. THOMSON","P. S. LAKE","Freshwater Biology"],"references":{"2523045":"Calibration and Empirical Bayes Variable Selection","216900072":"Clarke KR.. Non-parametric multivariate analysis of change in community structure. Aust J Ecol 18: 117-143","2311716":"The Variable Selection Problem","229685564":"Flow Variability and Macroinvertebrate Community Response Within Riverine Systems","227497728":"Theory, methods and tools for determining environmental flows for riparian vegetation: Riparian vegetation-flow response guilds","240311239":"How Much Water Does a River Need?","227545607":"Linking Ecological Theory with Stream Restoration","229519668":"Ontogenetic patterns of habitat use by fish within the main channel of an Australian floodplain river","242077773":"Ecological Theory and Community Restoration Ecology","201996330":"Bray JR, Curtis JT.. An Ordination of the Upland Forest Communities of Southern Wisconsin. Ecol Monogr 27: 326-349","6304835":"Predicting Bird Species Distributions in Reconstructed Landscapes","229895184":"Examining the ecological consequences of restoring flow intermittency to artificially perennial lowland streams: Patterns and predictions from the Broken—Boosey creek system in northern Victoria, Australia","223170790":"Introduction of Lake Trout (Salvelinus namaycush) to Inland Lakes of Ontario, Canada: Factors Contributing to Successful Colonization","31373938":"Calibration and Empirical Bayes Variable Selection","247932778":"The Natural Flow Regime: A Paradigm for River Conservation and Restoration","226997930":"Fish, Flows and Flood Plains: Links between Freshwater Fishes and their Environment in the Murray-Darling River System, Australia","229988506":"Functional heterogeneity of dry-season fish refugia across a Mediterranean catchment: The role of habitat and predation","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","271205402":"Bayes Factor","2612499":"Bayesian Model Averaging for Linear Regression Models","223185401":"Can bird atlas data be used to estimate population size? A case study using Namibian endemics","6486998":"Management by Assertion: Beavers and Songbirds at Lake Skinner (Riverside County, California)","240010233":"Functional Organization of Stream Fish Assemblages in Relation to Hydrologic Variability","12251405":"Using probabilities of persistence to identify important areas for conservation","238727682":"Variable Selection Via Gibbs Sampling","264236295":"Vegan: Community Ecology Package. R Package Version 1.8-8","29455736":"Spatial and temporal variation in fish assemblage structure in isolated waterholes during the 2001 dry season of an arid-zone river, Cooper Creek, Australia","248887191":"McMaster D and Bond NR. A field and experimental study on the tolerances of fish to Eucalyptus camaldulensis leachate and low dissolved oxygen concentrations. Mar Freshwater Res","11611253":"Variable selection and Bayesian model averaging in case-control studies","268314554":"Applied Bayesian Models","38013441":"Bayesian model averaging for harmful algal bloom prediction","227611225":"Redundancy and the Choice of Hydrologic Indices for Characterizing Stream Flow Regimes","235554502":"Predictive Models of Fish Species Distributions: A Note on Proper Validation and Chance Predictions","236533975":"Adaptive Management of Renwable Resources","227544769":"River regulation and fish larvae: Variation through space and time","7235135":"A Bayesian toolkit for genetic association studies","7080760":"Adaptation to Natural Flow Regimes","265047577":"The Natural Flow Regime","243766494":"Improvements on Cross-Validation: The 632+ Bootstrap Method","227778121":"River Restoration in Victoria, Australia: Change is in the Wind, and None too Soon","255578592":"The Use of Bayesian Model Averaging to Better Represent Uncertainty in Ecological Models","255654114":"A Managed Flood on the Colorado River: Background, Objectives, Design, and Implementation","228623812":"Adaptive Bayesian criteria in variable selection for generalized linear models","227674100":"A Probabilistic Model Characterizing Fish Assemblages of French Rivers: A Framework for Environmental Assessment","221943388":"Understanding AIC and BIC in model selection","229744344":"Relationships Between Benthic Biota and Hydrologic Indices in New Zealand Streams","227730424":"Fish Response to Modified Flow Regimes in Regulated Rivers: Research Methods, Effects and Opportunities, effects and opportunities","247954605":"Spawning behaviour and early development of the Clanwilliam yellowfish(Barbus capensis; Cyprinidae), linked to experimental dam releases in the Olifants River, South Africa","10990921":"Basic Principles and Ecological Consequences of Altered Flow Regimes for Aquatic Deflation Basin Lakes","29457343":"Flow Restoration and Protection in Australian Rivers","251312388":"Fish larvae and the management of regulated rivers","226367232":"WinBUGS—A Bayesian Modelling Framework: Concepts, Structure, and Extensibility"},"citedIn":{"276940101":"Using species distribution models to infer potential climate change-induced range shifts of freshwater fish in south-eastern Australia. Mar Freshw Res","274997568":"Ecological responses to altered flow regimes: Synthesis report.","232732312":"Environmental Flows: Saving Rivers in the Third Millennium","260950081":"Constraints upon the Response of Fish and Crayfish to Environmental Flow Releases in a Regulated Headwater Stream Network","230719119":"Detecting range shifts among Australian fishes in response to climate change","263082140":"Managed and natural inundation: benefits for conservation of native fish in a semi-arid wetland system","232613326":"How is the impact of climate change on river flow regimes related to the impact on mean annual runoff? A global-scale analysis","264789917":"Systematic revision of the Mountain Galaxias Galaxias olidus Günther, 1866 species complex (Teleostei: Galaxiidae) in eastern Australia. PhD Thesis, University of Canberra, Canberra.","261330853":"Determining appropriate instream flows for anadromous fish passage on an intermittent mainstem river, coastal southern California, USA","255682628":"Fish assemblages in non-regulated and regulated rivers from permanent and temporary Iberian systems","275546517":"Human effects on ecological connectivity in aquatic ecosystems: Integrating scientific approaches to support management and mitigation","261107371":"Dispersal and recruitment of fish in an intermittent stream network","280255048":"Ecological research and management of intermittent rivers: An historical review and future directions","270292225":"Fifteen from one: A revision of the Galaxias olidus Günther, 1866 complex (Teleostei, Galaxiidae) in south-eastern Australia recognises three previously described taxa and describes 12 new species"},"index":155}