{"abs":"We obtain necessary and sufficient conditions for the regular variation of the variance of partial sums of functionals of discrete and continuous-time stationary Markov processes with normal transition operators. We also construct a class of Metropolis-Hastings algorithms which satisfy a central limit theorem and invariance principle when the variance is not linear in $n$.","title":"Asymptotic Variance of Stationary Reversible and Normal Markov Processes","id":262264466,"url":"https://www.researchgate.net/publication/262264466_Asymptotic_Variance_of_Stationary_Reversible_and_Normal_Markov_Processes","names":["George Deligiannidis","Magda Peligrad","Sergey Utev","ELECTRONIC JOURNAL OF PROBABILITY"],"references":{"230570426":"Comment on a theorem of M. Maxwell and M. Woodroofe","225517686":"Moment Inequalities for Sums of Dependent Random Variables under Projective Conditions","227337988":"The central limit theorem for Markov chains with normal transition operators, started at a point","228738411":"The central limit theorem for stationary Markov processes with normal generator-with applications to hypergroups","256504640":"Probability and Measure","51963857":"On Functional CLT for Reversible Markov Chains with nonlinear growth of the Variance","224983650":"Variance of partial sums of stationary sequences","247735182":"Théorie Asymptotique des Processus Aléatoires Faiblement Dépendants","265324060":"Limit theorems for functionals of random walks","2113581":"A new maximal inequality and invariance principle for stationary sequences","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","240500739":"A remark about a Markov process with normal transition operator","238879844":"Pointwise ergodic theorems with rate and application to the CLT for Markov chains","236578501":"A strictly stationary -mixing process satisfying the central limit theorem but not the weak invariance principle","226873945":"Persistent random walks in random environment","226783322":"Solution of the Cesàro summability problem for power-series and Fourier series","228057717":"An Introduction to Probability Theory and Its Applications II","50385250":"Rosenthal-type inequalities for the maximum of partial sums of\nstationary processes and examples","48419334":"A central limit theorem for reversible processes with nonlinear growth of variance","239667180":"The Functional Central Limit Theorem for Strongly Mixing Processes","2111878":"General state space Markov chains and MCMC algorithms","221936093":"Time Series: Theory and Methods","265351095":"Regularly varying functions","227423529":"Martingale approximations for continuous-time and discrete-time stationary Markov processes","38351329":"Central limit theorems for additive functionals of Markov chains","38359008":"Canonical Correlations of Past and Future for Time Series: Definitions and Theory","38329826":"Central limit theorem for additive functionals of reversible Markov processes and applications to simple exclusion, Commun. Math. Phys. 106, 1-19","258233867":"On the functional central limit theorem for reversible Markov chains with nonlinear growth of the variance","245630420":"Central Limit Theorems for Tagged Particles and for Diusions in Random Environment","245768466":"Conformally invariant processes in the plane","225939457":"Asymptotic variance of the self-intersections of stable random walks using Darboux-Wiener theory","2103641":"Spectral Theory and Limit Theorems for Geometrically Ergodic Markov Processes","228704219":"On Variance Conditions for Markov Chain CLTs"},"citedIn":{},"index":163}