{"abs":"An estimation of the immunity coverage needed to prevent future outbreaks of an infectious disease is considered for a community of households. Data on outbreak size in a sample of households from one epidemic are used to derive maximum likelihood estimates and confidence bounds for parameters of a stochastic model for disease transmission in a community of households. These parameter estimates induce estimates and confidence bounds for the basic reproduction number and the critical immunity coverage, which are the parameters of main interest when aiming at preventing major outbreaks in the future. The case when individuals are homogeneous, apart from the size of their household, is considered in detail. The generalization to the case with variable infectivity, susceptibility and/or mixing behaviour is discussed more briefly. The methods are illustrated with an application to data on influenza in Tecumseh, Michigan.","title":"Estimating the immunity coverage required to prevent epidemics in a community of households","id":10601016,"url":"https://www.researchgate.net/publication/10601016_Estimating_the_immunity_coverage_required_to_prevent_epidemics_in_a_community_of_households","names":["T Britton","N G Becker","Biostatistics"],"references":{"4771948":"Statistical studies of infectious disease incidence","46846144":"Infectious Diseases of Humans; Dynamics and Control","264969249":"Reproduction Numbers and Critical Immunity Levels for Epidemics in a Community of Households","243770732":"Branching Processes with Biological Applications, John Wiley \u0026 Sons","13829528":"The effect of community structure on the immunity coverage required to prevent epidemics","38350500":"On critical vaccination coverage in multitype epidemics","13338939":"The effect of random vaccine response to prevent epidemics","22338950":"An Influenza Simulation model for immunization studies","229193594":"Linear Statistical Inference and Its Applications, Second Edition","14234541":"Preventing epidemics in a community of households","21414239":"A Generalized Stochastic Model for the Analysis of Infectious Disease Final Size Data","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods","14488768":"Immunization levels for preventing epidemics in a community of households made up of individuals of various types","38339926":"Epidemics with two levels of mixing. Ann Appl Probab"},"citedIn":{"267467410":"Stochastic Multitype Epidemics in a Community of Households: Estimation of threshold parameter R* and secure vaccination coverage","265345236":"Estimates of the reproduction number for seasonal, pandemic, and zoonotic influenza: A systematic review of the literature","229884054":"Inference for Epidemics with Three Levels of Mixing: Methodology and Application to a Measles Outbreak","256097382":"Increasing Herd Immunity with Influenza Revaccination","4993322":"Bayesian inference for stochastic multitype epidemics in structured populations via random graphs","46109271":"Introduction and snapshot review: Relating infectious disease transmission models to data","228865608":"Epidemics in Heterogeneous Communities: modelling, estimation and control","5264766":"Increasing Influenza Vaccination Rates: The Need to Vaccinate Throughout the Entire Influenza Season","11073831":"General model for stochastic SIR epidemics with two levels of mixing","227677218":"Epidemics in heterogeneous communities: Estimation of R0 and secure vaccination coverage","26323939":"Reproductive numbers, epidemic spread and control in a community of households","47567367":"Household epidemic models with varying infection response","11403102":"Optimal vaccination policies for stochastic epidemics among a population of households","26710624":"Bayesian inference for stochastic multitype epidemics in structured populations using sample data","256057972":"On the Epidemic of Financial Crises","238723648":"Expanding the Influenza Vaccination Season: A New Paradigm for Increasing Immunization Rates","4789107":"Bayesian inference for epidemics with two levels of mixing","6893266":"Smallpox transmission and control: Spatial dynamics in Great Britain","240770406":"Aplicación del teorema del umbral estocástico de Whittle a un brote de varicela","24418187":"Model answers or trivial pursuits? The role of mathematical models in influenza pandemic preparedness planning"},"index":166}