{"abs":"A broad range of studies of preventive measures in infectious diseases gives rise to incidence data from close contact groups. Parameters of common interest in such studies include transmission probabilities and efficacies of preventive or therapeutic interventions. We estimate these parameters using discrete-time likelihood models. We augment the data with unobserved pairwise transmission outcomes and fit the model using the EM algorithm. A linear model derived from the likelihood based on the augmented data and fitted with the iteratively re-weighted least squares method is also discussed. Using simulations, we demonstrate the comparable accuracy and lower sensitivity to initial estimates of the proposed methods with data augmentation relative to the likelihood model based solely on the observed data. Two randomized household-based trials of zanamivir, an influenza antiviral agent, are analyzed using the proposed methods.","title":"A Data-Augmentation Method for Infectious Disease Incidence Data from Close Contact Groups","id":23171806,"url":"https://www.researchgate.net/publication/23171806_A_Data-Augmentation_Method_for_Infectious_Disease_Incidence_Data_from_Close_Contact_Groups","names":["Yang Yang","Ira M Longini","M Elizabeth Halloran","Computational Statistics \u0026 Data Analysis"],"references":{"21839886":"A Discrete-Time Model for the Statistical Analysis of Infectious Disease Incidence Data","8667202":"Containing Pandemic Influenza with Antiviral Agents","229612392":"The Design and Analysis Aspects of Cluster Randomized Trials","13846235":"Study Designs for Evaluating Different Efficacy and Effectiveness Aspects of Vaccines","9022403":"Estimating Vaccine Effects on Transmission of Infection from Household Outbreak Data","236853525":"Louis TA. Finding the observed information matrix when using the EM algorithm. J R Stat Soc B 44: 226-233","11579452":"Perspectives on antiviral use during pandemic influenza","11020964":"Zanamivir Prophylaxis: An Effective Strategy for the Prevention of Influenza Types A and B within Households","7681272":"Containing Pandemic Influenza at the Source","239955229":"Inhaled Zanamivir for the Prevention of Influenza in Families","221995817":"Maximum Likelihood from Incomplete Data Via EM Algorithm","4791195":"What are the Advantages of MCMC Based Inference in Latent Variable Models?","22338950":"An Influenza Simulation model for immunization studies","12153578":"Oseltamivir Post Exposure Prophylaxis Investigator Group: Effectiveness of oseltamivir in preventing influenza in household contacts: a randomized controlled trial","236853451":"Finding the Observed Information Matrix When Using the EM Algorithm","21414239":"A Generalized Stochastic Model for the Analysis of Infectious Disease Final Size Data","4746449":"Estimating Vaccine Efficacy From Secondary Attack Rates","6709434":"Antiviral Effects on Influenza Viral Transmission and Pathogenicity: Observations from Household-based Trials","7193648":"Mitigation Strategies for Pandemic Influenza in the United States","12818851":"A likelihood method of identifying contaminated lots of blood product","227689907":"Some aspects of the design and analysis of cluster randomized trials","15081156":"Analysis of Infectious Disease Data from Partner Studies with Unknown Source of Infection","8211096":"A Bayesian MCMC approach to study transmission of Influenza: application to household longitudinal data","227696503":"Estimation in Epidemics with Incomplete Observations","247779875":"The Art of Data Augmentation","16115806":"Household and Community Transmission Parameters from Final Distributions of Infections in Households","227605819":"Design and evaluation of prophylactic interventions using infectious disease incidence data from close contact groups","227687008":"Bayesian inference for partially observed stochastic epidemics","265543328":"A Frailty Mixture Model for Estimating Vaccine Efficacy","12019854":"Efficiency of Estimating Vaccine Efficacy for Susceptibility and Infectiousness: Randomization by Individual Versus Household","4772531":"Analyses of infectious disease data from household outbreaks by Markov Chain Monte Carlo methods"},"citedIn":{"225308108":"Data Processing using Artificial Neural Networks to Improve the Simulation of Lung Motion","259119094":"Simulation-based Bayesian inference for epidemic models","237408145":"Design and Analysis of Vaccine Studies","26803378":"The Transmissibility and Control of Pandemic Influenza A (H1N1) Virus","221716204":"Modeling within-household contact networks from egocentric data","224050967":"A Hybrid EM and Monte Carlo EM Algorithm and Its Application to Analysis of Transmission of Infectious Diseases","255736433":"A penalized likelihood approach to estimate within-household contact networks from egocentric data"},"index":167}