{"abs":"This work considers black-box Bayesian inference over high-dimensional parameter spaces. The well-known adaptive Metropolis (AM) algorithm of (Haario etal. 2001) is extended herein to scale asymptotically uniformly with respect to the underlying parameter dimension for Gaussian targets, by respecting the variance of the target. The resulting algorithm, referred to as the dimension-independent adaptive Metropolis (DIAM) algorithm, also shows improved performance with respect to adaptive Metropolis on non-Gaussian targets. This algorithm is further improved, and the possibility of probing high-dimensional targets is enabled, via GPU-accelerated numerical libraries and periodically synchronized concurrent chains (justified a posteriori). Asymptotically in dimension, this GPU implementation exhibits a factor of four improvement versus a competitive CPU-based Intel MKL parallel version alone. Strong scaling to concurrent chains is exhibited, through a combination of longer time per sample batch (weak scaling) and yet fewer necessary samples to convergence. The algorithm performance is illustrated on several Gaussian and non-Gaussian target examples, in which the dimension may be in excess of one thousand.","title":"Accelerated dimension-independent adaptive Metropolis","id":278733347,"url":"https://www.researchgate.net/publication/278733347_Accelerated_dimension-independent_adaptive_Metropolis","names":["Yuxin Chen","David Keyes","Kody Law","Hatem Ltaief"],"references":{"235432200":"Dimension-Independent MCMC Sampling for Inverse Problems with Non-Gaussian Priors","221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","2120097":"Multiprocess parallel antithetic coupling for backward and forward Markov Chain Monte Carlo","239062462":"Prediction and Regulation: By Linear Least-Square Methods","227369231":"Learn From Thy Neighbor: Parallel-Chain and Regional Adaptive MCMC","200622065":"Equation of State Calculations by Fast Computing Machines","46494018":"Efficient parallelisation of Metropolis-Hastings algorithms using a prefetching approach","220411311":"Fast Algorithms for Bayesian Uncertainty Quantification in Large-Scale Linear Inverse Problems Based on Low-Rank Partial Hessian Approximations.","260716186":"Robust and scalable Bayes via a median of subset posterior measures","38363224":"Inference From Iterative Simulation Using Multiple Sequences","263736747":"Solving Large-Scale PDE-constrained Bayesian Inverse Problems with Riemann Manifold Hamiltonian Monte Carlo","46579536":"Understanding GPU Programming for Statistical Computation: Studies in Massively Parallel Massive Mixtures","1737229":"On the Ergodicity of the Adaptive Metropolis Algorithm on Unbounded Domains","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","51916417":"A central limit theorem for adaptive and interacting Markov chains","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","268881052":"A general construction for parallelizing Metropolis-Hastings algorithms","51991941":"Inverse Problem Theory and Model Parameter Estimation","239384155":"General Methods for Monitoring Convergence of Iterative Simulations","267124979":"Proposals which speed up function-space MCMC","47819641":"Robust adaptive Metropolis algorithm with coerced acceptance rate","268227549":"Dimension-independent likelihood-informed MCMC","241612615":"Brownian dynamics as smart Monte Carlo simulation","266619078":"KBLAS: An Optimized Library for Dense Matrix-Vector Multiplication on GPU Accelerators","278702782":"Numerical Solution of Stochastic Differential Equations","236235190":"Austerity in MCMC Land: Cutting the Metropolis-Hastings Budget","47373174":"Using Parallel Computation to Improve Independent Metropolis–Hastings Based Estimation","243104985":"Coupling and ergodicity of adaptive Markov chain Monte Carlo algorithms. J Appl Probab","221700496":"Convergence of adaptive and interacting Markov chain Monte Carlo\nalgorithms","227375782":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods","237651973":"DISCUSSION PAPER EQUI-ENERGY SAMPLER WITH APPLICATIONS IN STATISTICAL INFERENCE AND STATISTICAL MECHANICS1,2,3","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","251503179":"SPDE Limits of the Random Walk Metropolis Algorithm in High Dimensions","38322292":"An Adaptive Metropolis Algorithm","271076887":"Markov Chain Monte Carlo In Practice","1866589":"Exchange Monte Carlo Method and Application to Spin Glass Simulations","261065671":"Firefly Monte Carlo: Exact MCMC with subsets of data","50235701":"Optimal scaling and diffusion limits for the Langevin algorithm in high dimensions. Ann. Appl. Probab. 22, 2320-2356","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","266248467":"BAYESIAN LEARNING FOR NEURAL NETWORKS Bayesian Learning for Neural Networks","235726913":"The Bayesian Approach To Inverse Problems","2131950":"On the ergodic properties of some adaptive MCMC algorithms","267473441":"A Stochastic Newton MCMC Method for Large-Scale Statistical Inverse Problems with Application to Seismic Inversion","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","41222435":"Monte Carlo Statistical Method","220286586":"Dram: efficient adaptive MCMC","243739482":"Efficient Metropolis Jumping Rules","226385182":"Componentwise adaptation for high dimensional MCMC. Comput Stat","38373539":"Exponential Convergence of Langevin Distributions and Their Discrete Approximations","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","260946552":"Likelihood-informed dimension reduction for nonlinear inverse problems","220457311":"The International Exascale Software Project: a Call To Cooperative Action By the Global High-Performance Community","280794560":"Convergence rate of posterior distributions","228405601":"Statistical inversion and Monte Carlo sampling methods in electrical impedance tomography","230690364":"Efficient MCMC for Climate Model Parameter Estimation: Parallel Adaptive Chains and Early Rejection","35881310":"Spatial variation; stochastic models and their application to some problems in forest surveys and other sampling investigations.","4993330":"Sequential Monte Carlo Samplers"},"citedIn":{},"index":170}