{"abs":"Satellite-retrieved aerosol optical depth (AOD) can potentially provide an effective way to complement the spatial coverage limitation of a ground particulate air-pollution monitoring network such as the U.S. Environment Protection Agency\u0027s regulatory monitoring network. One of the current state-of-the-art AOD retrieval methods is the National Aeronautics and Space Administration\u0027s Multiangle Imaging SpectroRadiometer (MISR) operational algorithm, which has a spatial resolution of 17.6 km $times$ 17.6 km. Although the MISR\u0027s aerosol products lead to exciting research opportunities to study particle composition at a regional scale, its spatial resolution is too coarse for analyzing urban areas, where the air pollution has stronger spatial variations and can severely impact public health and the environment. Accordingly, a novel AOD retrieval algorithm with a resolution of 4.4 km $times$ 4.4 km has been recently developed, which is based on hierarchical Bayesian modeling and the Monte Carlo Markov chain (MCMC) inference method. In this paper, we carry out detailed quantitative and qualitative evaluations of the new algorithm, which is called the HB-MCMC algorithm, using recent AErosol RObotic NETwork (AERONET) Distributed Regional Aerosol Gridded Observation Networks (DRAGON) campaign data obtained in the summer of 2011. These data, which were not available in a previous study, contain spatially dense ground measurements of the AOD and other aerosol particle characteristics from the Baltimore–Washington, DC region. Our results show that the HB-MCMC algorithm has 16.2% more AOD retrieval coverage and improves the root-mean-square error by 38.3% compared with the MISR operational algorithm. Our detailed analyses with various metrics show that the improvement of our scheme is coming from the novel mo- eling and inference method. Furthermore, the map overlay of the retrieval results qualitatively confirms the findings of the quantitative analyses.","title":"Evaluation of a MISR-based high-resolution aerosol retrieval method using AERONET DRAGON campaign data","id":273706611,"url":"https://www.researchgate.net/publication/273706611_Evaluation_of_a_MISR-based_high-resolution_aerosol_retrieval_method_using_AERONET_DRAGON_campaign_data","names":["Taesup Moon","Yueqing Wang","Yang Liu","B. Yu","IEEE Transactions on Geoscience and Remote Sensing"],"references":{"258738924":"Aerosol airmass type mapping over the Urban Mexico City Region from space-based multi-angle imaging","236157588":"Bay breeze influence on surface ozone at Edgewood, MD during July 2011","258405293":"Multiangle Imaging SpectroRadiometer global aerosol product assessment by comparison with the Aerosol Robotic Network","228604075":"Wavelength dependence of optical depth of biomass burning, urban, and desert dust aerosols","51917396":"A Hierarchical Bayesian Approach for Aerosol Retrieval Using MISR Data","49458431":"A tutorial on adaptive MCMC","38363224":"Inference From Iterative Simulation Using Multiple Sequences","222694676":"Cloud-Screening and Quality Control Algorithms for the AERONET Database","234036512":"Eyjafjalljökull Volcano Plume Particle-Type Characterization from Space-Based Multi-angle Imaging","225089726":"2006 Critical Review -- Health Effects of Fine Particulate Air Pollution: Lines that Connect.","251881751":"Atmospheric Aerosol Properties and Climate Impacts, Chapter 2","233939366":"Lim SS, Vos T, Flaxman AD, Danaei G, Shibuya K, Adair-Rohani H et al. A comparative risk assessment of burden of disease and injury attributable to 67 risk factors and risk factor clusters in 21 regions, 1990-2010: a systematic analysis for the Global Burden of Disease Study 2010. Lancet 2012; 380: 2224-2260","228967165":"A flexible inversion algorithm for retrieval of aerosol optical properties from Sun and sky radiance measurements","223576395":"Lagrangian sampling of 3-D air quality model results for regional transport contributions to sulfate aerosol concentrations at Baltimore, MD, in summer 2004","228372291":"Multiangle Imaging Spectroradiometer (MISR) global aerosol optical depth validation based on 2 years of coincident Aerosol Robotic Network (AERONET) observations. J. Geophys. Res. 110, D10S04","252592849":"Validation of Multiangle Imaging Spectroradiometer (MISR) aerosol optical thickness measurements using Aerosol Robotic Network (AERONET) observations over the contiguous United States. J. Geophys. Res. 109(D06205)","38357609":"Markov Chains for Exploring Posterior Distributions","51899253":"An empirical relationship between PM2.5 and aerosol optical depth in Delhi Metropolitan","3201874":"Techniques for the retrieval of aerosol properties over land and ocean using multiangle imaging. IEEE Trans. Geosci. Remote Sens. 36: 1212-1227","268209561":"M Carlo Statistical Methods","47446004":"AERONET-A Federated Instrument Network and Data Archive for aerosol characterization","4700270":"A Modified Linear-Mixing Method for Calculating Atmospheric Path Radiances of Aerosol Mixtures","3201881":"Multiangle Imaging SptectrRadiometer (MISR) description and experiment overview","44645760":"Global Estimates of Ambient Fine Particulate Matter Concentrations from Satellite-Based Aerosol Optical Depth: Development and Application","7814619":"Estimating Ground-Level PM 2.5 in the Eastern United States Using Satellite Remote Sensing","253993036":"Level 2 Ancillarv Products and Datasets Algorithm The6retical Basis","224588749":"MISR Aerosol product attributes, and statistical comparison with MODIS","259093825":"Estimating ground-level PM2.5 concentrations in the Southeastern United States using MAIAC AOD retrievals and a two-stage model","6980120":"Health Effects of Fine Particulate Air Pollution: Lines that Connect","258748312":"MODIS 3 km aerosol product: Applications over land in an urban/suburban region","258495263":"Mapping annual mean ground-level PM 2.5 concentrations using Multiangle Imaging Spectroradiometer aerosol optical thickness over the contiguous United States","225531021":"Review of the applications of Multiangle Imaging SpectroRadiometer to air quality research","228990427":"Comparison of MISR aerosol optical thickness with AERONET measurements in Beijing metropolitan area"},"citedIn":{},"index":179}