{"abs":"We propose a conjugate and conditional conjugate Bayesian analysis of models of marginal independence with a bi-directed graph representation. We work with Markov equivalent directed acyclic graphs (DAGs) obtained using the same vertex set with the addition of some latent vertices when required. The DAG equivalent model is characterised by a minimal set of marginal and conditional probability parameters. This allows us to use compatible prior distributions based on products of Dirichlet distributions. For models with DAG representation on the same vertex set, the posterior distribution and the marginal likelihood is analytically available, while for the remaining ones a data augmentation scheme introducing additional latent variables is required. For the latter, we estimate the marginal likelihood using Chib’s (1995) estimator. Additional implementation details including identifiability of such models is discussed. For all models, we also provide methodology for the computation of the posterior distributions of the marginal log-linear parameters based on a simple transformation of the simulated values of the probability parameters. We illustrate our method using a popular 4-way dataset.","title":"Conjugate and Conditional Conjugate Bayesian Analysis of Discrete Graphical Models of Marginal Independence","id":254440969,"url":"https://www.researchgate.net/publication/254440969_Conjugate_and_Conditional_Conjugate_Bayesian_Analysis_of_Discrete_Graphical_Models_of_Marginal_Independence","names":["Ioannis Ntzoufras","Claudia Tarantola","Computational Statistics \u0026 Data Analysis"],"references":{"5182222":"On applications of marginal models for categorical data","220319840":"The Hidden Life of Latent Variables: Bayesian Learning with Mixed Graph Models","261418449":"Graphical methods for inequality constraints in marginalized DAGs","221404728":"Learning Bayesian Networks: The Combination of Knowledge and Statistical Data","2321640":"Dealing With Label-Switching in Mixture Models","234054520":"On the Testable Implications of Causal Models with Hidden Variables","1760661":"Wishart distributions for decomposable graphs","228091991":"Inequality Constraints in Causal Models with Hidden Variables","220320689":"Factorial Mixture of Gaussians and the Marginal Independence Model.","243081582":"A Statistical Paradox","2799161":"When Can Association Graphs Admit A Causal Interpretation?","51940814":"Log-mean linear models for binary data","2515569":"Optimal Predictive Model Selection","2545265":"Compatible Prior Distributions for DAG models","46541214":"Parameterizations and Fitting of Bi-directed Graph Models to Categorical Data","243764509":"Marginal likelihood from the Gibbs output. J Am Stat Assoc","226884574":"Learning Bayesian Networks: The Combination of Knowledge and Statistical Data","4772180":"Compatible prior distributions for DAG models","243081761":"A Comment on D. V. Lindley\u0027s Statistical Paradox","266515263":"Some observations on inverse probability including a new indifference rule. J Inst Actuaries 73: 285-334","4993362":"Binary models for marginal independence","236587707":"Linear Dependencies Represented by Chain Graphs","38348328":"Marginal models for categorical data","1759608":"Graphical methods for efficient likelihood inference in Gaussian covariance models","226358488":"Parameterization and Fitting of a Class of Discrete Graphical Models","51917054":"A Sequence of Relaxations Constraining Hidden Variable Models","256334176":"Marginal log-linear parameters for graphical Markov models","221665118":"Bayesian inference through encompassing priors and importance samplingfor a class of marginal models for categorical data","4788961":"Markov Properties for Acyclic Directed Mixed Graphs","19923545":"Incorporating Prior Information into the Analysis of Contingency Tables","238879895":"Transdimensional Markov Chains","17280685":"The Marke-Nyman Temperament Scale","220286477":"Model based labeling for mixture models","48208240":"Compatibility of Prior Specifications Across Linear Models","235771042":"An Artificial Allocations Based Solution to the Label Switching Problem in Bayesian Analysis of Mixtures of Distributions","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","243763126":"Estimation of Finite Mixture Distributions Through Bayesian Sampling","38327033":"Markov Chain Monte Carlo Methods and the Label Switching Problem in Bayesian Mixture Modeling","2269073":"MCMC Estimation of Classical and Dynamic Switching and Mixture Models","50316171":"Wishart distributions for decomposable covariance graph models","2758302":"Theory Refinement on Bayesian Networks","4741693":"Transdimensional Markov Chains: A Decade of Progress and Future Perspectives","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","236586849":"Model Search Among Multiplicative Models","41953532":"Approximating the marginal likelihood in mixture models"},"citedIn":{"256543003":"Graphical marginal log-linear models: a Bayesian perspective","259288160":"Bayesian transformation family selection: Moving toward a transformed Gaussian universe"},"index":184}