{"abs":"A new class of multivariate threshold GARCH models is proposed for the analysis and modelling of volatility asymmetries in financial time series. The approach is based on the idea of a binary tree where every terminal node parametrizes a (local) multivariate GARCH model for a specific partition of the data. A Bayesian stochastic method is developed and presented for the analysis of the proposed model consisting of parameter estimation, model selection and volatility prediction. A computationally feasible algorithm that explores the posterior distribution of the tree structure is designed using Markov chain Monte Carlo stochastic search methods. Simulation experiments are conducted to assess the performance of the proposed method, and an empirical application of the proposed model is illustrated using real financial time series. Copyright Royal Economic Society 2007","title":"Modelling volatility asymmetries: A Bayesian analysis of a class of tree structured multivariate GARCH models","id":4899343,"url":"https://www.researchgate.net/publication/4899343_Modelling_volatility_asymmetries_A_Bayesian_analysis_of_a_class_of_tree_structured_multivariate_GARCH_models","names":["Ioannis D. Vrontos","Petros Dellaportas","Econometrics Journal"],"references":{"5141770":"Average Conditional Correlation and Tree Structures for Multivariate GARCH Models","4992328":"‘On The Relation Between The Expected Value and The Volatility of The Nominal Excess Return On Stocks’","4889230":"Asymmetric Dynamics in the Correlation of Global Equity and Bond Returns","4830337":"Threshold heteroskedastic models. J Econ Dyn Control","4992327":"‘Measuring and Testing The Impact of News On Volatility’","2771364":"A Reference Bayesian Test for Nested Hypotheses And its Relationship to the Schwarz Criterion","5216769":"Modeling Asymmetric Comovement of Asset Returns","275206313":"Asymmetric Volatility and Risk in Equity Markets","36381432":"Estimating and predicting multivariate volatility thresholds in global stock markets","4993247":"Tree-structured generalized autoregressive conditional heteroscedastic models","4902430":"A full-factor multivariate GARCH model","4895838":"Conditional Heteroskedasticity in Asset Returns: A New Approach","5139862":"Multivariate GARCH models: a survey","268489049":"ARCH models and Financial Applications","2808695":"Bayesian CART model search","265505742":"Assessment and Propagation of Model Uncertainty (with Discussion)","5000337":"Dynamic Conditional Correlation - A Simple Class of Multivariate GARCH Models","2450683":"Bayesian CART model search","4986899":"Dynamic Conditional Correlation: A Simple Class of Multivariate Generalized Autoregressive Conditional Heteroskedasticity Model","38357609":"Markov Chains for Exploring Posterior Distributions","36387274":"Tree-structured GARCH models","223130285":"Autoregressive Conditional Heteroscedasticity with Estimates of the Variance of U.K. Inflation","4895208":"Autoregressive Conditional Heteroskedasticity With Estimates of the Variance of U.K. Inflation","5216813":"Asymmetric Volatility and Risk in Equity Markets","243102928":"Bayesian Methods for Nonlinear Classification and Regression:Bayesian Methods for Nonlinear Classification and Regression","5139872":"Estimating and Predicting Multivariate Volatility Thresholds in Global Stock Markets","2585239":"Bayesian Variable and Link Determination for Generalised Linear Models","271205402":"Bayes Factor","5213502":"Asymmetric Dynamics in the Correlations of Global Equity and Bond Returns","2612499":"Bayesian Model Averaging for Linear Regression Models","30967982":"Markov chain Monte Carlo model determination for hierarchical and graphical log-linear model","4991803":"Recent Theoretical Results for Time Series Models with GARCH Errors","265776238":"Bayesian Methods for Nonlinear classification and Regression. Wiley, New York","4856560":"Generalized Conditional Heteroscedasticity","24094867":"Modeling the Coherence in Short-Run Nominal Exchange Rates: A Multivariate Generalized ARCH Model","4726133":"The impact of general non-parametric volatility functions in multivariate GARCH models","243655672":"A Bayesian CART algorithm","4857460":"‘ARCH Modelling in Finance: A Review of the Theory and Empirical Evidence’","23948434":"Multivariate GARCH models: a survey"},"citedIn":{"228821826":"Bayesian semiparametric multivariate GARCH modeling","228292728":"Hedge Fund Return Predictability in the Presence of Model Uncertainty and Implications for Wealth Allocation","259553132":"Bayesian inference methods for univariate and multivariate garch models: A survey","222851453":"A Bayesian approach to detecting nonlinear risk exposures in hedge fund strategies","228203309":"Evidence for Hedge Fund Predictability from a Multivariate Student-T Full-Factor GARCH Model","228571511":"Bayesian Adaptive Hamiltonian Monte Carlo with an Application to High-Dimensional BEKK GARCH Models","24016919":"Quantile Regression Analysis of Hedge Fund Strategies","222804829":"Modelling Nonlinearities and Heavy Tails Via Threshold Normal Mixture GARCH Models","222684783":"Hedge fund pricing and model uncertainty","251947503":"RETRACTED ARTICLE: Tree structured DCC-multivariate GARCH model and its application in volatility correlation analysis of Shanghai, Shenzhen and Hong Kong Stock markets"},"index":192}