{"abs":"Monte Carlo with Importance Sampling (MCIS) has been used to both evaluate the failure probability and search for the dominant failure modes of the system. Information generated from other schemes such as the First- and Second-Order Reliability Methods, and knowledge of the dominant modes, has been used to construct effective sampling densities to estimate failure probabilities. The implications of this information are discussed. In a system problem, a stratified density was used. Such a density tends to bound the weights and hence not cause the variance of the estimator to diverge. Also, the informationsused implies the knowledge of the unimportant random variables. The lack of this knowledge can lead to bad estimates. The use of the estimated coefficient of variation (COV) of the estimator is discussed. The estimated COV arising from densities contructed with the previously mentioned information tends to be small, i.e., the estimator is accurate. However, the COV can be misleading. In the second application, it is shown easily that MCIS can give erroneous answers.","title":"Observations on applications of importance sampling in structural reliability analysis","id":222165116,"url":"https://www.researchgate.net/publication/222165116_Observations_on_applications_of_importance_sampling_in_structural_reliability_analysis","names":["Yaacob Ibrahim","Structural Safety"],"references":{"245211421":"Discussion to: Harbitz, A., An efficient sampling method to probability of failure calculation Structural safety, 3 (1986) 109–115","273800355":"Probability Integration by Directional Simulation","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","223239917":"An efficient sampling method for probability of failure calculations. Structural Safety 3:109-115","245301372":"Basic Analysis of Structural Safety","245211433":"Discussion to Schuëller, G.I. and Stix, R., A critical appraisal of methods to determine failure probabilities Structural Safety, 4 (1987) 293–309","285033945":"METHODOLOGIES FOR LIMIT STATE RELIABILITY ANALYSIS OF OFFSHORE JACKET PLATFORMS.","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","285033594":"A Sampling Distribution for System Reliability Assessment","284237487":"EFFICIENT AND ACCURATE PROBABILITY OF FAILURE CALCULATION BY USE OF THE IMPORTANCE SAMPLING TECHNIQUE."},"citedIn":{"261104273":"Estimation of first excursion probabilities for uncertain stochastic linear systems subject to Gaussian load","273895762":"A fast and robust method for estimating the failure probability of structures","239373191":"Application of low-discrepancy sampling method in structural reliability analysis","223059021":"Adaptive simulation for system reliability analysis of large structures","261440659":"The uncertainty importance measures of the structural system in view of mixed uncertain variables","245161168":"Assessment of industrial components in high temperature plant using the “ALIAS-HIDA” – A case study","282563227":"A new learning function for Kriging and its applications to solve reliability problems in engineering","259123040":"Reliability-based optimization using bridge importance sampling","272910359":"Practical Expressions of Elastoplastic Contact between Rough Surfaces","275386428":"A Time-Variant Reliability Analysis Method Based on Stochastic Process Discretization","267439660":"Surrogate Based Method for Evaluation of Failure Probability under Multiple Constraints","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","245424642":"Adaptive Monte Carlo Simulation for Time-Variant Reliability Analysis of Brittle Structures","278121201":"Safety of historical stone arch bridges","241105149":"Reliability Sensitivity Algorithm Based on Stratified Importance Sampling Method for Multiple Failure Modes Systems","223700913":"Ductile structural system reliability analysis using adaptive importance sampling","257006965":"A new efficient simulation method to approximate the probability of failure and most probable point","281687084":"Efficient reliability updating of slope stability by reweighting failure samples generated by Monte Carlo simulation","283633536":"A local Kriging approximation method using MPP for reliability-based design optimization","283542543":"Assessment of polynomial correlated function expansion for high-fidelity structural reliability analysis","258176778":"Reliability sensitivity based on first-order reliability method","277877115":"Primary and deformation-induced high and low cycle fatigue reliability of infrastructure with updating through non-destructive inspection.","222763114":"Time-dependent system reliability analysis by adaptive importance sampling","239390836":"Reliability Estimation with Time-Variant Loads and Resistances","258177297":"Reliability analysis of structural system with multiple failure modes and mixed uncertain input variables","223287356":"Filtered importance sampling with support vector margin: A powerful method for structural reliability analysis","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","257517229":"Advanced response surface method for mechanical reliability analysis","258177110":"Addition laws of failure probability and their applications in reliability analysis of structural system with multiple failure modes","269784812":"New Linear Programming-Based Bound Method for Structural System Reliability","238179912":"Quasi-Monte Carlo Simulation with Low-Discrepancy Sequence for Reinforced Soil Slopes"},"index":194}