{"abs":"We investigate Bayesian non-parametric inference for $\\Lambda$-coalescent processes parametrised by probability measures on the unit interval, and provide an implementable, provably consistent MCMC inference algorithm. We give verifiable criteria on the prior for posterior consistency when observations form a time series, and prove that any non-trivial prior is inconsistent when all observations are contemporaneous. We then show that the likelihood given a data set of size $n \\in \\mathbb{N}$ is constant across $\\Lambda$-measures whose leading $n - 2$ moments agree, and focus on inferring truncated sequences of moments. We provide a large class of functionals which can be extremised using finite computation given a credibility region of posterior truncated moment sequences, and a pseudo-marginal Metropolis-Hastings algorithm for sampling the posterior. Finally, we compare the efficiency of the exact and noisy pseudo-marginal algorithms with and without delayed acceptance acceleration using a simulation study.","title":"Bayesian non-parametric inference for $\\Lambda$-coalescents: consistency and a parametric method","id":285648009,"url":"https://www.researchgate.net/publication/285648009_Bayesian_non-parametric_inference_for_Lambda-coalescents_consistency_and_a_parametric_method","names":["Jere Koskela","Paul A. Jenkins","Dario Spanò"],"references":{"237184419":"Mitochondrial DNA Variation in Introduced Populations of Pacific Oyster, Crassostrea gigas, in British Columbia","238879805":"Markov chain Monte Carlo Using an Approximation","7322223":"Coalescent Processes When the Distribution of Offspring Number Among Individuals Is Highly Skewed","5357460":"Estimation of 2Nes From Temporal Allele Frequency Data","233995572":"Genealogies of rapidly adapting populations","38350464":"The general coalescent with asynchronous mergers of ancestral lines","38385347":"On sampling distributions for coalescent processes with simultaneous multiple collisions","242929777":"Extreme Points of Moment Sets","38357634":"A Bayesian Analysis of Some Non-Parametric Problems","269997659":"Non-parametric Bayesian inference for multi-dimensional compound Poisson processes","8579916":"Mitochondrial Cytochrome b DNA Variation in the High-Fecundity Atlantic Cod: Trans-Atlantic Clines and Shallow Gene Genealogy","220286771":"Computational methods for complex stochastic systems: A review of some alternatives to MCMC","233394225":"Analysis of DNA sequence variation within marine species using Beta-coalescents","45895205":"The genealogy of branching Brownian motion with absorption","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","7903330":"An Efficient Monte Carlo Method for Estimating Ne From Temporally Spaced Samples Using a Coalescent-Based Likelihood","235357661":"Consistent nonparametric Bayesian inference for discretely observed\nscalar diffusions","283043712":"The site frequency spectrum for general coalescents","228393730":"Measure-valued diffusions, general coalescents and population genetic inference","5444915":"Minin VN, Bloomquist EW, Suchard MA. Smooth Skyride through a rough Skyline: Bayesian coalescent-based inference of population dynamics. Mol Biol Evol 25: 1459-1471","38367787":"Inversion Formulae for the Distribution of Ratios","2318977":"Coalescents With Multiple Collisions","283043450":"Nonparametric Bayesian posterior contraction rates for discretely observed scalar diffusions","38348844":"Theory and numerical analysis for exact distributions of functionals of a Dirichlet process","5504245":"Computing likelihoods for coalescents with multiple collisions in the infinitely many sites model","229100417":"A Constructive Definition of the Dirichlet Prior","234105948":"Estimating Selection Coefficients in Spatially Structured Populations from Time Series Data of Allele Frequencies","230864811":"Strong consistency of nonparametric Bayes density estimation on compact metric spaces with applications to specific manifolds","38359970":"On the Consistency of Bayes Estimates","243103635":"Stochastic flows associated to coalescent processes II: Stochastic differential equations","2115854":"A coalescent model for the effect of advantageous mutations on the genealogy of a population","38359078":"On a Class of Bayesian Nonparametric Estimates: I. Density Estimates","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","38361853":"Distributional Results for Random Functionals of a Dirichlet Process","279632926":"Rigorous results for a population model with selection II: genealogy of the population","272406986":"Brittleness of Bayesian inference under finite information in a continuous world","258839899":"Computational inference beyond Kingman\u0027s coalescent","239666097":"Lévy Processes and Infinitely Divisible Distributions","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","227423862":"Regularity of semigroups generated by Lévy type operators via coupling","49812418":"Importance sampling for Lambda-coalescents in the infinitely many sites model","230592964":"Estimating Allele Age and Selection Coefficient from Time-Serial Data","2258270":"Particle Representations for Measure-Valued Population Models","8030150":"Bayesian Coalescent Inference of Past Population Dynamics from Molecular Sequences","226872696":"Stochastic flows associated to coalescent processes","259960320":"The Equilibrium Allele Frequency Distribution for a Population with Reproductive Skew","278390377":"Consistency of Bayesian nonparametric inference for discretely observed jump-diffusions","51945127":"Convergence of latent mixing measures in finite and infinite mixture models"},"citedIn":{},"index":215}