{"abs":"Polymorphic enzyme and minisatellite loci were used to estimate the degree of inbreeding in experimentally bottlenecked populations of the butterfly, Bicyclus anynana (Satyridae), three generations after founding events of 2, 6, 20, or 300 individuals, each bottleneck size being replicated at least four times. Heterozygosity fell more than expected, though not significantly so, but this traditional measure of the degree of inbreeding did not make full use of the information from genetic markers. It proved more informative to estimate directly the probability distribution of a measure of inbreeding, sigma2, the variance in the number of descendants left per gene. In all bottlenecked lines, sigma2 was significantly larger than in control lines (300 founders). We demonstrate that this excess inbreeding was brought about both by an increase in the variance of reproductive success of individuals, but also by another process. We argue that in bottlenecked lines linkage disequilibrium generated by the small number of haplotypes passing through the bottleneck resulted in hitchhiking of particular marker alleles with those haplotypes favored by selection. In control lines, linkage disequilibrium was minimal. Our result, indicating more inbreeding than expected from demographic parameters, contrasts with the findings of previous (Drosophila) experiments in which the decline in observed heterozygosity was slower than expected and attributed to associative overdominance. The different outcomes may both be explained as a consequence of linkage disequilibrium under different regimes of inbreeding. The likelihood-based method to estimate inbreeding should be of wide applicability. It was, for example, able to resolve small differences in sigma2 among replicate lines within bottleneck-size treatments, which could be related to the observed variation in reproductive viability.","title":"Inbreeding of bottlenecked butterfly populations: Estimation using the likelihood of changes in marker allele frequencies","id":13240248,"url":"https://www.researchgate.net/publication/13240248_Inbreeding_of_bottlenecked_butterfly_populations_Estimation_using_the_likelihood_of_changes_in_marker_allele_frequencies","names":["Ilik Saccheri","Ian J Wilson","Richard Alan Nichols","Michael W Bruford","P M Brakefield","Genetics"],"references":{"48376994":"Introduction To Quantitative Genetics","6085849":"The Cheetah Is Depauperate in Genetic Variation","15194658":"Rumball W, Franklin IR, Frankham R, Sheldon BL. Decline in heterozygosity under full-sib and double first-cousin inbreeding in Drosophila melanogaster. Genetics 136: 1039-1049","18342546":"Elephant Seals: Genetic Variation and Near Extinction","223189194":"The Bottleneck Effect and Genetic Variability in Natural Populations","20798455":"Loss of electrophoretic variation in serially bottlenecked populations","25449160":"Introduction to Quantitative Genetics","16690287":"Tavare, S. Line-of-descent and genealogical processes, and their applications in population genetics models. Theor. Popul. Biol. 26, 119-164","20165986":"Individual specific “fingerprints” of human DNA. Nature, Lond. 316, 76-79","246459299":"Individual-speci c\u0027\u0027ngerprints\u0027\u0027of human DNA","15278590":"Genetic variation of microsatellite loci in a bottlenecked species-the Northern Hairy-Nosed Wombat, Lasiorhinus krefftii","227631942":"Genetic Analysis of Founder Bottlenecks in the Rare British Butterfly Plebejus argus","22093705":"Population genetics of a “colonising” lizard: Natural selection for allozyme morphs in Anolis grahami","258315452":"Effects on heterozygosity and reproductive fitness of inbreeding with and without selection on fitness in Drosophila melanogaster. Theoretical and Applied Genetics","17216860":"Lewontin RC, Hubby JL. A molecular approach to the study of heterozygosity in natural populations II. Amount of variation and degree of heterozygosity in natural popula-tions of Drosophila pseudoobscura. Genetics","6554047":"Estimation of Average Heterozygosity and Genetic Distance from A Small Number of Individuals","17216859":"Hubby, J. L. \u0026 Lewontin, R. C. A molecular approach to the study of genic heterozygosity in natural populations. I. The number of alleles at different loci in Drosophila pseudoobscura. Genetics 54, 203-215","19106557":"Maruyama T, Fuerst PA.. Population bottlenecks and non equilibrium models in population genetics. II. Number of alleles in a small population that was formed by a recent bottleneck. Genetics 111: 675-689","228816835":"Relationship of Genetic Variation to Population Size in Wildlife","249431549":"Case Study of a Population Bottleneck: Lions of the Ngorongoro Crater","14479226":"Gene genealogies within mutant allelic classes","15081472":"Microsatellites and their application to population genetics","14529015":"Houlden BA, England PR, Taylor AC, Greville WD, Sherwin WB.. Low genetic variability of the koala Phascolarctos cinereus in south-eastern Australia following a severe population bottleneck. Mol Ecol 5: 269-281","15278597":"Genetic variation of the St. Lawrence Beluga whale population assessed by DNA fingerprinting","15492803":"Reduced genetic load revealed by slow inbreeding in Drosophila melanogaster","18345126":"Sampling Variances of Heterozygosity and Genetic Distance","264656437":"Rassmann K, Arnold W, Tautz D.. Low genetic-variability in a natural alpine marmot population (Marmota marmota, Sciuridae revealed by dna-fingerprinting. Mol Ecol 3: 347-353","15592600":"Balding DJ, Nichols RA. A method for quantifying differentiation between populations at multi-allelic loci and its implications for investigating identity and paternity. Genetica 96: 3-12","263331140":"Low Genetic Variability in the Hawaiian Monk Seal","270359527":"Statistical Analysis of Heterozygosity Data: Independent Sample Comparisons","28648015":"Guidelines in conservation genetics and the use of population cage experiments with butterflies to investigate the effects of genetic drift and inbreeding","15258899":"An Experimental-study of inbreeding depression in a natural habitat","239954674":"E ects of population bottlenecks on genetic diversity as measured by allozyme electrophoresis"},"citedIn":{"11499631":"Likelihood-Based Estimation of the Effective Population Size Using Temporal Changes in Allele Frequencies: A Genealogical Approach","227091211":"Inbreeding, inbreeding depression and extinction","34487628":"Effects of geographic distance, landscape features and host association on genetic differentiation of checkerspot butterflies [electronic resource] /","5678933":"Increased Life Span in a Polyphenic Butterfly Artificially Selected for Starvation Resistance*","11981552":"Saccheri IJ, Nichols RA, Brakefield PM. Effects of bottlenecks on quantitative genetic variation in the butterfly Bicyclus anynana. Genet Res 77: 167-181","11867827":"Reed DH, Frankham R. How closely correlated are molecular and quantitative measures of genetic variation? A meta-analysis. Evolution 55: 1095-1103","23178217":"Inference of structure in subdivided populations at low levels of genetic differentiation. The correlated alleles model revisited","225180003":"Conservation genetics of population bottlenecks: The role of chance, selection, and history","227706846":"Effective population size, reproductive success and sperm precedence, the butterfly, Bicyclus anynana, in captivity","259209023":"Do Ecological Niche Model Predictions Reflect the Adaptive Landscape of Species?: A Test Using Myristica malabarica Lam., an Endemic Tree in the Western Ghats, India","227621215":"Reed DH, Frankham R. How closely correlated are molecular and quantitative measures of genetic variation? A meta-analysis. Evolution 55: 1095-1103","229684414":"Conservation Genetics","7864493":"Saccheri IJ, Lloyd HD, Helyar SJ, Brakefield PM. Inbreeding uncovers fundamental differences in the genetic load affecting male and female fertility in a butterfly. Proc Roy Soc B 272: 39-46","216613694":"Effects of bottlenecks on quantitative genetic variation in the butterfly Bicyclus anynana","228740794":"Correlation between Fitness and Genetic Diversity","8625053":"On the neutrality of molecular genetic markers: Pedigree analysis of genetic variation in fragmented populations","11792979":"Mating system and reproductive skew in the black rhinoceros","7436946":"Neiman, M. \u0026 Linksvayer, T. A. The conversion of variance and the evolutionary potential of restricted recombination. Heredity 96, 111-121","249341311":"Erratum to: Microsatellite-based evidences of genetic bottlenecks in the cryptic species “Andrographis paniculata Nees”: a potential anticancer agent","10757506":"Genetic diversity and population history of golden monkeys (Rhinopithecus roxellana","233809225":"¿CÓMO UNA ESPECIE EXÓTICA SE CONVIERTE EN INVASORA?","223907184":"Monteiro, A. \u0026 Pierce, N. Phylogeny of Bicyclus (Lepidoptera: Nymphalidae) inferred from COI, COII, and EF1- gene sequences. Mol. Phylogenet. Evol. 18, 264-281","262872832":"Morphological differentiation following experimental bottlenecks in the butterfly Bicyclus anynana (Nymphalidae)","12275223":"Experimental evaluation of the usefulness of microsatellite DNA for detecting demographic bottlenecks. Mol Ecol 9:1517-1528","12929321":"Statistic analysis of microsatellite DNA data","12207126":"Wijngaarden PJ, Brakefield PM. The genetic basis of eyespot size in the butterfly Bicyclus anynana: an analysis of line crosses. Heredity 85: 471-479","227331105":"Species limits and population differentiation in New Zealand snipes (Scolopacidae: Coenocorypha) Conserv","8660534":"Beaumont, M. A. Recent developments in genetic data analysis: what can they tell us about human demographic history? Heredity 92, 365-379","7658374":"Detecting historical bottlenecks using temporal genetic data.","12383882":"Inbreeding depression and genetic load in laboratory populations of the butterfly Bicyclus anynana","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","246339415":"Grant proposal for the construction of four lepidopteran BAC libraries","225762634":"Signatures of demographic bottlenecks in European wolf Populations"},"index":221}