{"abs":"Multiobjective evolutionary algorithms have become prevalent and efficient approaches for solving multiobjective optimization problems. However, their performances deteriorate severely when handling many-objective optimization problems (MaOPs) due to the loss of selection pressure to drive the search toward the Pareto front and the ineffective design in diversity maintenance mechanism. This paper proposes a many-objective evolutionary algorithm (MaOEA) based on directional diversity (DD) and favorable convergence (FC). The main features are the enhancement of two selection schemes to facilitate both convergence and diversity. In the algorithm, a mating selection based on FC is applied to strengthen selection pressure while an environmental selection based on DD and FC is designed to balance diversity and convergence. The proposed algorithm is tested on 64 instances of 16 MaOPs with diverse characteristics and compared with seven state-of-the-art algorithms. Experimental results show that the proposed MaOEA performs competitively with respect to chosen state-of-the-art designs.","title":"A Many-Objective Evolutionary Algorithm With Enhanced Mating and Environmental Selections","id":276175392,"url":"https://www.researchgate.net/publication/276175392_A_Many-Objective_Evolutionary_Algorithm_With_Enhanced_Mating_and_Environmental_Selections","names":["Jixiang Cheng","Gary G. Yen","Gexiang Zhang","IEEE Transactions on Evolutionary Computation"],"references":{"269275405":"A Knee Point Driven Evolutionary Algorithm for Many-Objective Optimization","224207966":"Diversity Management in Evolutionary Many-Objective Optimization","261141269":"Multi-Objective Optimization by Using Evolutionary Algorithms: The $p$-Optimality Criteria","261141271":"Fuzzy-Based Pareto Optimality for Many-Objective Evolutionary Algorithms","220381221":"A Pareto Corner Search Evolutionary Algorithm and Dimensionality Reduction in Many-Objective Optimization Problems.","4201415":"Evolutionary many-objective optimisation: Many once or one many?","28358328":"Lecture Notes in Computer Science","221228454":"Substitute Distance Assignments in NSGA-II for Handling Many-objective Optimization Problems","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","253348620":"A Grid-Based Evolutionary Algorithm for Many-Objective Optimization","224472313":"Effects of Using Two Neighborhood Structures on the Performance of Cellular Evolutionary Algorithms for Many-Objective Optimization","2335418":"A Combined Genetic Adaptive Search (GeneAS) for Engineering Design","262211715":"A New Multi-Objective Evolutionary Algorithm Based on a Performance Assessment Indicator","224301948":"MSOPS-II: A general-purpose Many-Objective optimiser","260721697":"Performance Metric Ensemble for Multiobjective Evolutionary Algorithms","2364041":"Multi-Objective Optimisation Based on Relation Favour","216457303":"Indicator-Based Selection in Multiobjective Search","272031116":"MOEA/D with uniform decomposition measurement for many-objective problems","224330083":"Evolutionary Many-Objective Optimization: A Short Review","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","216457304":"Lecture Notes in Computer Science","3904004":"Failure of Pareto-based MOEAs: Does non-dominated really mean near to optimal?","220887407":"Ranking Methods for Many-Objective Optimization","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","253359061":"Shift-Based Density Estimation for Pareto-Based Algorithms in Many-Objective Optimization","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","260621912":"Preference-Inspired Coevolutionary Algorithms for Many-Objective Optimization","241637687":"A Multiobjective Evolutionary Algorithm That Diversifies Population by Its Density","221006844":"Constraint handling in multi-objective evolutionary optimization","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","224606514":"A Favorable Weight-Based Evolutionary Algorithm for Multiple Criteria Problems","278707151":"An Improved Adaptive Approach for Elitist Nondominated Sorting Genetic Algorithm for Many-Objective Optimization","257153541":"MOEA/D + uniform design: A new version of MOEA/D for optimization problems with many objectives","260360285":"A survey on multi-objective evolutionary algorithms for many-objective problems","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","3958375":"On the optimal solution definition for many-criteria optimization problems","224214406":"A Pareto Corner Search Evolutionary Algorithm and Dimensionality Reduction in Many-Objective Optimization Problems","264387359":"An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point-Based Nondominated Sorting Approach, Part I: Solving Problems With Box Constraints","220045504":"Multiple Criteria Optimization: Theory, Computation and Application. N.Y., Wiley","281339301":"Pareto-, aggregation-, and indicator-based methods in many-objective optimization","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","225132675":"Controlling Dominance Area of Solutions and Its Impact on the Performance of MOEAs","228928332":"On finding Pareto-optimal solutions through dimensionality. Reduction for certain large-dimensional multi-objective optimization problems","4074711":"Multiple single objective Pareto sampling","23249682":"A New Evolutionary Algorithm for Solving Many-Objective Optimization Problems","46255412":"Cultural-Based Multiobjective Particle Swarm Optimization","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","261054322":"R2-IBEA: R2 indicator based evolutionary algorithm for multiobjective optimization","220742614":"Objective reduction using a feature selection technique","222889399":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications"},"citedIn":{"289825861":"A Reference Vector Guided Evolutionary Algorithm for Many-Objective Optimization","286412505":"Ensemble of many-objective evolutionary algorithms for many-objective problems"},"index":223}