{"abs":"We present a new way to make a maximum likelihood estimate of the parameter 4N mu (effective population size times mutation rate per site, or theta) based on a population sample of molecular sequences. We use a Metropolis-Hastings Markov chain Monte Carlo method to sample genealogies in proportion to the product of their likelihood with respect to the data and their prior probability with respect to a coalescent distribution. A specific value of theta must be chosen to generate the coalescent distribution, but the resulting trees can be used to evaluate the likelihood at other values of theta, generating a likelihood curve. This procedure concentrates sampling on those genealogies that contribute most of the likelihood, allowing estimation of meaningful likelihood curves based on relatively small samples. The method can potentially be extended to cases involving varying population size, recombination, and migration.","title":"Estimating Effective Population Size and Mutation Rate From Sequence Data Using Metropolis-Hastings Sampling","id":15699884,"url":"https://www.researchgate.net/publication/15699884_Estimating_Effective_Population_Size_and_Mutation_Rate_From_Sequence_Data_Using_Metropolis-Hastings_Sampling","names":["Mary K Kuhner","J Yamato","J Felsenstein","Genetics"],"references":{"3081191":"Error Bounds For Convolutional Codes And An Asymptotically Optimum Decoding Algorithm.","226316885":"Evaluation of the Maximum-Likelihood Estimate of the Evolutionary Tree Topologies from DNA-Sequence Data, and the Branching Order in Hominoidea","225791231":"Maximum-Likelihood Inference of Protein Phylogeny and the Origin of Chloroplasts","22009153":"Watterson GA. Number of segregating sites in genetic models without recombination. Theor Popul Biol 7: 256-276","15734590":"A Simple Method for Estimating Evolutionary Rate of Base Substitutions Through Comparative Studies of Nucleotide Sequences","15049547":"A phylogenetic estimate of population size or mutation rate","271687518":"Likelihood Analysis of Mitochondrial Restriction-Cleavage Patterns for the Human-Chimpanzee-Gorilla Trichotomy","21868509":"Estimating Effective Population-Size from Samples of Sequences - a Bootstrap Monte-Carlo Integration Method","221669734":"Equations of State Calculations by Fast Computing Machines","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","248540518":"Kimura, M. A simple method for estimating evolutionary rate of base substitution through comparative studies of nucleotide sequences. J Mol Evol","223115706":"The Coalescent","247176845":"Phylogenies from Restriction Sites: A Maximum-Likelihood Approach","15397917":"Sampling Theory for Neutral Alleles in a Varying Environment","239052708":"On the Genealogy of Large Populations","21526551":"Felsenstein J. Estimating effective population size from samples of sequences: inefficiency of pairwise and segregating sites as compared to phylogenetic estimates. Genet Res 59: 139-147","21473304":"Extensive mitochondrial DNA diversity within a single Amerindian tribe"},"citedIn":{"7696500":"Using the Quantitative Genetic Threshold Model for Inferences between and within Species","51119886":"Combining contemporary and ancient DNA in population genetic and phylogeographic studies","23997804":"Nielsen R, Beaumont MA. Statistical inferences in phylogeography. Mol Ecol 18: 1034-1047","5937240":"Genetic variation and phylogeography of free-living mouse species (genus Mus) in the Balkans and the Middle East","3961407":"Methods for estimation of demographic parameters from DNA sequence samples","7696497":"Approximating the coalescent with recombination","235760648":"Palaeodistribution modelling and genetic evidence highlight differential post-glacial range shifts of a rain forest conifer distributed across a latitudinal gradient","229795764":"Mitochondrial cytochrome b DNA sequence variation of Atlantic cod Gadus morhua, from Norway","13960914":"Coalescent theory for a partially selfing population","7696498":"Wang JL. Estimation of effective population sizes from data on genetic markers. Philos Trans R Soc Lond B 360: 1395-1409","49758459":"Rousset, F, Raymond, M. Statistical analyses of populaton genetic data: new tools, old concepts. Trends Ecol Evol, 12: 313-317","242183264":"A genealogical view of geographical variation","6520946":"Phylogeography and population history of the crab‐eating fox (Cerdocyon thous)","227676548":"Conservation genetics of the endangered Shenandoah salamander (Plethodon shenandoah, Plethodontidae)","11040434":"A vectorized method of importance sampling with applications to models of mutation and migration","7903330":"An Efficient Monte Carlo Method for Estimating Ne From Temporally Spaced Samples Using a Coalescent-Based Likelihood","11066036":"Potential Applications and Pitfalls of Bayesian Inference of Phylogeny","6528126":"Test of Genetical Isochronism for Longitudinal Samples of DNA Sequences","228017077":"Enhancement of Pacific Threadfin (Polydactylus Sexfilis) in Hawaii: Interactions between Aquaculture and Fisheries","6833227":"Robustness of Coalescent Estimators to Between-Lineage Mutation Rate Variation","242369617":"\"I See Dead People:\" Gene Mapping Via Ancestral Inference","11786903":"Mutations as missing data: Inferences on the ages and distributions of nonsynonymous and synonymous mutations","1952312":"Biological evolution through mutation, selection, and drift: An introductory review","5642352":"Population genetic inference using a fixed number of segregating sites: A reassessment","222656355":"Revealing the demographic histories of species using DNA sequences. Trends Ecol Evol","23443779":"Importance Sampling for the Infinite Sites Model","14398204":"Tajima, F. The amount of DNA polymorphism maintained in a finite population when the neutral mutation rate varies among sites. Genetics","7842384":"On the Number of New World Founders: A Population Genetic Portrait of the Peopling of the Americas","40268353":"Diversité génétique et taille efficace chez les populations de poissons sauvages : le cas du saumon atlantique un poisson migrateur amphihalin menacé","257549681":"Identification of metapopulation dynamics among Northern Goshawks of the Alexander Archipelago, Alaska, and Coastal British Columbia","228018110":"Modeling human genetic history","261839282":"An analytical framework in the general coalescent tree setting for analyzing polymorphisms created by two mutations","242157125":"Preliminary Aspects of Genetic Management for Pacific Threadfin Polydactylus sexfilis Stock Enhancement Research in Hawaii","7880787":"Historical demography, selection, and coalescence of mitochondrial and nuclear genes in Prochilodus species of Northern South America","51508029":"Joint Inference of Population Assignment and Demographic History","6820932":"A Geometric Approach to Tree Shape Statistics","237105164":"Argos: An efficient algorithm for simulating the coalescent with recombination","44608152":"Topologies of the Conditional Ancestral Trees and Full-Likelihood-Based Inference in the General Coalescent Tree Framework","26860457":"How Robust Are \"Isolation with Migration\" Analyses to Violations of the IM Model? A Simulation Study","7004251":"Comparative phylogeography of woodland reptiles in California: Repeated patterns of cladogenesis and population expansion","232006118":"Long-term effective population size of three endangered Colorado River fishes","11021979":"DNA Polymorphism in a Worldwide Sample of Human X Chromosomes","222545781":"Measurably evolving populations","14003426":"The coalescent process with selfing","14163680":"The Wilhelmine E. Key 1994 invitational Lecture. Plant genetic diversity and the struggle to measure selection.","36442644":"Conservation Genetics of the Comal Springs Riffle Beetle (Heterelmis comalensis) Populations in Central Texas, with Examination of Molecular and Morphological Variation in Heterelmis Sp. Throughout Texas","26755489":"Population genetic analysis reveals a long-term decline of a threatened endemic Australian marsupial","235390014":"Intercoalescence Time Distribution of Incomplete Gene Genealogies in Temporally Varying Populations, and Applications in Population Genetic Inference","34552372":"Phylogenetic tree construction using markov chain monte carlo /","264853493":"TREES OF GENES IN POPULATIONS","225777993":"A New Method for Locating Changes in a Tree Reveals Distinct Nucleotide Polymorphism vs Divergence Patterns in Mouse Mitochondrial Control Region","240001139":"CO13 - Le serum humain facilite l’infection par le virus de l’hépatite C et les réponses neutralisantes sont inversement corrélées aux cinétiques de réplication du vhc au cours de l’hépatite C aiguë","229521296":"Analysis of Genetic Diversity in Geographically Structured Populations: A Bayesian Perspective","23974226":"Approximate Bayesian Computation Without Summary Statistics: The Case of Admixture","11652337":"Kreitman M. Methods to detect selection in populations with applications to the human. Annu Rev Genom Hum Genet 1: 539-559","6811686":"Marjoram P, Tavaré S. Modern computational approaches for analysing molecular genetic variation data. Nat Rev Genet 7: 759-770","226764229":"Population Geetics of HIV: Parameter Estimation Using Genealogy-based Methods","23718699":"Revealing the hidden complexities of mtDNA inheritance. Mol Ecol","13766289":"Conservation genetics of endangered Pampas deer (Ozotoceros bezoarticus)","12851335":"Long, A.D. \u0026 Langley, C.H. The power of association studies to detect the contribution of candidate genetic loci to variation in complex traits. Genome Res. 9, 720-731","229457902":"Sharpe RG, Harbach RE, Butlin RK. Molecular variation and phylogeny of members of the Minimus Group of Anopheles subgenus Cellia (Diptera: Culicidae). System Entomol 25: 263-272","7617075":"A test of founder effect speciation using multiple loci in the Auklets (Aethia spp.)","225111841":"North American montane red foxes: Expansion, fragmentation, and the origin of the Sacramento Valley red fox","5637147":"On the inadmissibility of Waterson\u0027s estimator","7617082":"Likelihoods From Summary Statistics: Recent Divergence Between Species","30017925":"Population genetic analysis of Arapaima gigas, one of the largest freshwater fishes of the Amazon basin: Implications for its conservation","5344798":"A Fast and Reliable Computational Method for Estimating Population Genetic Parameters","12344557":"Kuhner MK, Beerli P, Yamato J, Felsenstein J. Usefulness of single nucleotide polymorphism data for estimating population parameters. Genetics 156: 439-447","7932456":"Bayesian Coestimation of Phylogeny and Sequence Alignment","12344554":"The age of a unique event polymorphism","8889041":"Vlax Roma history: What do coalescent-based methods tell us?","236323956":"Regional coupling of red hind spawning aggregations to oceanographic processes in the eastern Caribbean","221959001":"Phylogeny estimation and hypothesis using Maximum Likelihood. Ann. Rev. Ecol. Syst. 28:437-466","7405590":"Accuracy of Coalescent Likelihood Estimates: Do We Need More Sites, More Sequences, or More Loci?","226443541":"Invasion Genetics of New World Medflies: Testing Alternative Colonization Scenarios","279185608":"Markov Chain Monte Carlo Algorithms for the Bayesian Analysis of Phylogenetic Trees","12738222":"Substitution rate variation among sites in mitochondrial hypervariable region I of Humans and Chimpanzees","227683838":"MANAGEDPOP: A computer simulation to project allelic diversity in managed populations with overlapping generations","12383954":"Mechanisms of population differentiation in Marbled Murrelets: historical versus contemporary processes","226186004":"Retrospective coalescent methods and the reconstruction of metapopulation histories in the sea","11242202":"The Genealogy of a Sequence Subject to Purifying Selection at Multiple Sites","8369165":"Application of Coalescent Methods to Reveal Fine-Scale Rate Variation and Recombination Hotspots","11867841":"Geographic patterns of genetic differentiation within the restricted range of the endangered Stephens’ Kangaroo Rat Dipodomys stephensi","227642854":"Mechanisms of population differentiation in Marbled Murrelets: historical versus contemporary processes","7179802":"Molecular characterization of the HIV-I gag nucleocapsid gene associated with vertical transmission","266332583":"Ancestral Inference in Molecular Biology","7745037":"Estimating the total genetic diversity of a spatial field population from a sample and implications of its dependence on habitat area","6748189":"Counting All Possible Ancestral Configurations of Sample Sequences in Population Genetics","227621869":"Testing hypotheses of speciation in the Plethodon jordani species complex with allozymes and mitochondrial DNA sequences","227743214":"GEOGRAPHIC PATTERNS OF GENETIC DIFFERENTIATION WITHIN THE RESTRICTED RANGE OF THE ENDANGERED STEPHENS’KANGAROO RAT DIPODOMYS STEPHENSI","6441503":"A Step Toward Barcoding Life: A Model-Based, Decision-Theoretic Method to Assign Genes to Preexisting Species Groups","226370817":"Phylogeography and Pleistocene demographic history of the endangered marsh deer (Blastocerus dichotomus) from the Río de la Plata Basin","227875093":"Phylogeographic variation in the quokka, Setonix brachyurus (Marsupialia: Macropodidae): Implications for conservation","227201801":"Beyond FST: Analysis of population genetic data for conservation","11886642":"Estimation of Admixture Proportions: A Likelihood-Based Approach Using Markov Chain Monte Carlo","6504676":"Hey J, Nielsen R.. Integration within the Felsenstein equation for improved Markov chain Monte Carlo methods in population genetics. Proc Natl Acad Sci USA 104: 2785-2790","5488340":"Does Fish Ecology Predict Dispersal Across a River Drainage Divide?","10641962":"Genetic and phylogeographic structure of populations of Pulex simulans (Siphonaptera) in Peru inferred from two genes (CytB and CoII)","237047465":"Chapter 4: Neutral patterns of genetic variation and applications to conservation in conifer species.","255590837":"POPULATION GENETICS MODELS FOR THE STATISTICS OF DNA SAMPLES UNDER DIFFERENT DEMOGRAPHIC SCENARIOS—MAXIMUM LIKELIHOOD VERSUS APPROXIMATE METHODS","281226831":"A new method for estimating the demographic history from DNA sequences: an importance sampling approach","12698700":"Different Models, Different Trees: The Geographic Origin of PTLV-I","12331058":"Long-Distance Seed Dispersal in Plant Populations","226821392":"Subspecific Relationships and Genetic Structure in the Spotted Owl","41011943":"In defence of model-based inference in phylogeography","280092710":"Congdon et al. - 2000 - Mechanisms of population differentiation in marbled murrelets historical versus contemporary processes","12483625":"Detecting bottlenecks and selective sweeps from DNA sequence polymorphism","9065501":"Patterns of Human Genetic Diversity: Implications for Human Evolutionary History and Disease. Ann Rev Genomics Hum Genet 4:293-340","261214982":"2008 Grober-Dunsmore and Keller, editors, Caribbean Connectivity: Implications for Marine Protected Area Management Marine Sanctuaries Conservation Series ONMS-08-07 National Oceanic and Atmospheric Administration Office of National Marine Sanctuaries","282643520":"Amphibian molecular ecology and how it has informed conservation","51870607":"Does History Repeat Itself? Wavelets and the Phylodynamics of Influenza A","261067030":"Multilocus coalescent analyses reveal the demographic history and speciation patterns of mouse lemur sister species","45827105":"Peter BM, Wegman D, Excoffier L.. Distinguishing between population bottleneck and population subdivision by a Bayesian model choice procedure. Mol Ecol 19: 4648-4660","224285634":"The Lattice Project: a Grid research and production environment combining multiple Grid computing models","8923158":"Godoy JA, Negro JJ, Hiraldo F, Donazar JA. Phylogeography, genetic structure and diversity in the bearded vulture (Gypaetus barbatus, L.), as revealed by mitochondrial DNA. Mol Ecol 13: 371-390","224285633":"The Lattice Project: A Multi-model Grid Computing System","228393730":"Measure-valued diffusions, general coalescents and population genetic inference","11791889":"Slatkin, M. Simulating genealogies of selected alleles in a population of variable size. Genet. Res. 78, 49-57","225285582":"Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities - Discussion","8077528":"A multilocus sequence survey in Arabidopsis thaliana reveals a genome-wide departure from a neutral model of DNA sequence polymorphism","12681319":"Mitochondrial DNA phylogeography and population history of the grey wolf Canis lupus. Mol Ecol 8:2089-2103","225285578":"Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities - Discussion","230218003":"Comparative phylogeography as an integrative approach to historical biogeography. Journal of Biogeography 28: 819-825","11579423":"Genetic Characterization of HIV Type 1 gag p17 Matrix Genes in Isolates from Infected Mothers Lacking Perinatal Transmission","7155394":"Using Approximate Bayesian Computation to Estimate Tuberculosis Transmission Parameters From Genotype Data","8660534":"Beaumont, M. A. Recent developments in genetic data analysis: what can they tell us about human demographic history? Heredity 92, 365-379","7899851":"Deffontaine V, Libois R, Kotlík P, Sommer R, Nieberding C, Paradis E et al.. Beyond the Mediterranean peninsulas: evidence of central European glacial refugia for a temperate forest mammal species, the bank vole (Clethrionomys glareolus). Mol Ecol 14: 1727-1739","6966489":"Using coalescent simulation to test the impact of Quaternary climate cycles on divergence in an alpine plant-insect association","266595159":"On composite likelihood in statistical genetics","221462406":"Exact Computation of Coalescent Likelihood under the Infinite Sites Model.","47621731":"Exact Computation of Coalescent Likelihood for Panmictic and Subdivided Populations under the Infinite Sites Model","222577149":"Grid Services Base Library: A high-level, procedural application programming interface for writing Globus-based Grid services","233729364":"effectivesizeAnCons99","5591279":"Phylogeography of a Sahelian rodent species Mastomys huberti: A Plio-Pleistocene story of emergence and colonization of humid habitats","11869199":"Patterns of population subdivision, gene flow and genetic variability in the African wild dog (Lycaon pictus). Mol Ecol 10:1703-1723","44685843":"Bertorelle, G., Benazzo, A. \u0026 Mona, S. ABC as a flexible framework to estimate demography over space and time: some cons, many pros. Mol. Ecol. 19, 2609-2625","7273173":"Population genetics of microbial pathogens estimated from Multilocus Sequence Typing (MLST) data","6750936":"Derivation of primary sequences and secondary structures of rev responsive element from HIV-1 infected mothers and infants following vertical transmission","13700206":"Maximum Likelihood Estimation of Population Growth Rates Based on the Coalescent","7966396":"Hue S, Pillay D, Clewley JP, Pybus OG. Genetic analysis reveals the complex structure of HIV-1 transmission within defined risk groups. Proc Natl Acad Sci USA 102: 4425-4429","14230033":"Inferring patterns of migration from gene frequencies under equilibrium conditions","51711967":"Profound Differences in Virus Population Genetics Correspond to Protection from CD4 Decline Resulting from Feline Lentivirus Coinfection","255604727":"Mesoamerican reef spawning aggregation as sources: A review of the state of connectivity research and future priorities for science and management","266008342":"HIV-1 Evolution Is Largely Consistent With A Molecular Clock","14230036":"Statistical properties of a DNA sample under the finite-sites model","254434276":"Coalescents, Phylogenies, and Likelihoods","11788412":"Perfect Simulation from Population Genetic Models with Selection","276058299":"Evolutionary ecology of plant-plant interactions: an empirical modelling approach. Aarhus University Press, Aarhus","10809460":"Nielsen, R. \u0026 Signorovitch, J. Correcting for ascertainment bias when analyzing SNP data: applications to the estimation of linkage disequilibrium. Theor. Popul. Biol. 63, 245-255","23263155":"Genetic structuring and migration patterns of Atlantic bigeye tuna, Thunnus obesus (Lowe, 1839)","46587412":"The Time Machine: A Simulation Approach for Stochastic Trees","7546528":"One step beyond lethal equivalents: Characterization of deleterious loci in the rapid cycling Brassica rapa L. base population","4771483":"Wilson IJ, Weale ME, Balding DJ. Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities. J Roy Stat Soc Ser A 166: 155-188","10809459":"Exact moment calculations for genetic models with migration, mutation, and drift","50269736":"Evolution and Population Genetics of Exotic and Re-Emerging Pathogens: Novel Tools and Approaches","232678149":"Conservation Genetics of Delphinium Newtonianum Dw. Moore (Moore\u0027s Delphinium) [Ranunculaceae], A Rare Endemic of The Interior Highlands","226311073":"Detecting a genetic bottleneck in Gilbert\u0027s Potoroo (Potorous gilbertii) (Marsupialia: Potoroidae), inferred from microsatellite and mitochondrial DNA sequence data","7550638":"A likelihood ratio test for species membership based on DNA sequence data. Philos Trans R Soc Lond B Biol Sci","9012308":"Bayesian Spatial Modeling of Haplotype Associations","227601229":"Historical demography, selection, and coalescence of mitochondrial and nuclear genes in Prochilodus species of northern South America","287491071":"Model misspecification confounds the estimation of rates and exaggerates their time dependency","12638752":"A Coalescent Approach to Study Linkage Disequilibrium between Single-Nucleotide Polymorphisms","221313489":"Bayesian Phylogenetic Inference under a Statistical Insertion-Deletion Model","225615255":"Rannala, B. \u0026 Yang, Z. Probability distribution of molecular evolutionary trees: a new method of phylogenetic inference. J. Mol. Evol. 43, 304-311","273559211":"Kelleher, AD, Long, C, Holmes, EC, Allen, RL, Wilson, J, Conlon, C et al.. Clustered mutations in HIV-1 gag are consistently required for escape from HLA-B27-restricted cytotoxic T lymphocyte responses. J Exp Med 193: 375-386","10752065":"Mes THM. Demographic expansion of parasitic nematodes of livestock based on mitochondrial DNA regions that conflict with the infinite-sites model. Mol Ecol 12: 1555-1566","8636006":"Brownian models and coalescent structures","265481013":"MOLECULAR MECHANISMS OF HIV-1 INFECTION: VIRAL AND HOST DETERMINANTS IN TRANSMISSION AND PATHOGENESIS","13673527":"Long, A.D., Lyman, R.F., Langley, C.H. \u0026 Mackay, T.F.C. Two sites in the Delta gene region contribute to naturally occurring variation in bristle number in Drosophila melanogaster. Genetics 149, 999−1017","12860451":"Fu, Y.-X. \u0026 Li, W.-H. Coalescing into the 21st century: an overview and prospects of coalescent theory. Theor. Popul. Biol. 56, 1-10","221891025":"Coalescent-Based DNA Barcoding: Multilocus Analysis and Robustness","230010718":"Conservation genetics: beyond the maintenance of marker diversity. Mol Ecol 3:423-435","49697306":"Recovering Population Parameters from a Single Gene Genealogy: An Unbiased Estimator of the Growth Rate","12967976":"Parallel evolution of drug resistance in HIV: failure of nonsynonymous/synonymous substitution rate ratio to detect selection. Mol Biol Evol","227498337":"Historical biogeography of two alpine butterflies in the Rocky Mountains: Broad-scale concordance and local-scale discordance","268328208":"Statistical inference in population genetics using microsatellites","12308564":"Schierup MH, Hein J. Consequences of recombination on traditional phylogenetic analysis. Genetics 156: 879-891","8618098":"Giant tortoises are not so slow: Rapid diversification and biogeographic consensus in the Galapagos","227980130":"Expanding the Reach of Grid Computing: Combining Globus‐ and BOINC‐Based Systems","12437579":"An Integrated Framework for the Inference of Viral Population History From Reconstructed Genealogies","229803844":"Living in a tilted world: Climate change and geography limit speciation in Old World anchovies (Engraulis; Engraulidae)","11627078":"Estimating Recombination Rates from Population Genetic Data","228799322":"Inferring Process from Pattern in Fungal Population Genetics","6576286":"Gene Sampling Strategies for Multi-Locus Population Estimates of Genetic Diversity","271205590":"In defence of model-based inference in phylogeography","255649728":"ESTIMATING CONSUMER BEHAVIOUR IN AN ENERGY-ECONOMY POLICY MODEL","235654902":"Contrasting population structures in two sympatric fishes in the Baltic Sea basin","26690921":"Host sequence motifs shared by HIV predict response to antiretroviral therapy","2261724":"Markov Chain Monte Carlo For The Bayesian Analysis Of Evolutionary Trees From Aligned Molecular Sequences","242077551":"27 Spatial Modeling of Multilocus Data","237657385":"Mesoamerican Reef Spawning Aggregations Help Maintain Fish Populations: A Review of Connectivity Research and Priorities for Science and Management","6155102":"Multi-locus phylogeography of the dusky dolphin (Lagenorhynchus obscurus): Passive dispersal via the west-wind drift or response to prey species and climate change?","7377779":"Shallow mtDNA Coalescence in Atlantic Pygmy Angelfishes (Genus Centropyge) Indicates a Recent Invasion from the Indian Ocean","276058482":"2005 Book - Evolutionary ecology","6746977":"Stochastic or deterministic: what is the effective population size of HIV-1?","220694048":"Bioinformatics","289817676":"Gene genealogy in a population of variable size","6755692":"Li HP, Stephan W. Inferring the demographic history and rate of adaptive substitution in Drosophila. PLoS Genet 2: 1580-1589","12720591":"Detecting Population Expansion and Decline Using Microsatellites","11965880":"Bayesian Selection of Continuous-Time Markov Chain Evolutionary Models","258871905":"Conducting Phylogenetic Comparative Studies When the Phylogeny is not Known","275057002":"Re-colonization by common eiders (Somateria mollissima) in the Aleutian Archipelago following removal of introduced arctic foxes (Vulpes lagopus)","14160328":"Analysis of HIV-1 env gene sequences reveals evidence for a low effective number in the viral population","7739239":"Genome-wide scans for loci under selection in humans","7266681":"Comparing Likelihood and Bayesian Coalescent Estimation of Population Parameters","6274887":"Busch JD, Waser PM, DeWoody JA. Recent demographic bottlenecks are not accompanied by a genetic signature in banner-tailed kangaroo rats (Dipodomys spectabilis). Mol Ecol 16: 2450-2462","34678537":"Appraisal of the consequences of the DDT-induced bottleneck on the level and distribution of neutral genetic variation in Canadian peregrine falcons, Falco peregrinus [microform].","236692739":"A Continuous Method for Gene Flow","12910045":"Estimation of Past Demographic Parameters From the Distribution of Pairwise Differences When the Mutation Rates Vary Among Sites: Application to Human Mitochondrial DNA","241217404":"Pearse D, Crandall KA. Beyond FST: Analysis of population genetic data for conservation. Conserv Genet 5: 585-602","267685608":"Biodiversity and Genetic Patterns in Marine Invertebrates","11556781":"Experimental Phylogeny of Neutrally Evolving DNA Sequences Generated by a Bifurcate Series of Nested Polymerase Chain Reactions","7345518":"Exact coalescent for the Wright–Fisher model","254308407":"Estimating tuberculosis transmission parameters from genotype data using approximate Bayesian computation","40029565":"Importance sampling and the two-locus model with subdivided population structure","270763779":"Lack of support for the time-dependent molecular evolution hypothesis","229449868":"On the roles of selection, mutation and drift in the evolution of mitochondrial DNA diversity in British Mytilus edulis (Mytilidae; Mollusca) populations","13362665":"Population Dynamics of HIV-1 Inferred From Gene Sequences","14083061":"Rannala, B. Gene genealogy in a population of variable size. Heredity 78, 417-423","41397586":"An examination of genetic diversity and effective population size in Atlantic salmon","265136363":"Genetic diversity of Schistosoma haematobium parasite IS NOT associated with severity of disease in an endemic area in Sudan","23315013":"Comparison of Species Tree Methods for Reconstructing the Phylogeny of Bearded Manakins (Aves: Pipridae, Manacus) from Multilocus Sequence Data","11824028":"Hughes, A. L. \u0026 Verra, F. Very large long-term effective population size in the virulent human malaria parasite Plasmodium falciparum. Proc. R. Soc. London B Biol. Sci. 268, 1855-1860","38349665":"Importance sampling on coalescent histories. I","51570751":"Inference of Population Mutation Rate and Detection of Segregating Sites from Next-Generation Sequence Data","243769770":"Statistical Inference from Genetic Data on Pedigrees","12394896":"Thomas SC \u0026 Hill WG.Estimating quantitative genetic parameters using sibships reconstructed from marker data. Genetics 155: 1961−1972","11909531":"Palumbi SR, Cipriano F, Hare MP. Predicting nuclear gene coalescence from mitochondrial data: the three-times rule. Evolution 55: 859-868","13667838":"Maximum Likelihood Estimation of Population Divergence Times and Population Phylogenies under the Infinite Sites Model","12172694":"Clustered Mutations in HIV-1 Gag Are Consistently Required for Escape from Hla-B27–Restricted Cytotoxic T Lymphocyte Responses","11920774":"The Inference of Stepwise Changes in Substitution Rates Using Serial Sequence Samples","12931569":"Some Statistical Improvements for Estimating Population Size and Mutation Rate from Segregating Sites in DNA Sequences","269176639":"A hidden Markov model for investigating recent positive selection through haplotype structure","5571426":"Geological Dates and Molecular Rates: Fish DNA Sheds Light on Time Dependency","227076274":"Spatial and temporal patterns of genetic diversity in an endangered Hawaiian honeycreeper, the Hawaii Akepa (Loxops coccineus coccineus)","5331306":"The Allele Frequency Spectrum in Genome-Wide Human Variation Data Reveals Signals of Differential Demographic History in Three Large World Populations","8238914":"Molecular clock-like evolution of human immunodeficiency virus type 1","8070969":"Hey J, Won Y-J, Sivasundar A, Nielsen R, Markert JA. Using nuclear haplotypes with microsatellites to study gene flow between recently separated Cichlid species. Mol Ecol 13: 909-919","260291264":"ejhg20142a","7771954":"Maximum-Likelihood Methods for Detecting Recent Positive Selection and Localizing the Selected Site in the Genome","6965039":"Characterization of HIV-I envelope gp4I genetic diversity and functional domains following perinatal transmission","236999526":"Phylogeography, Postglacial Gene Flow, and Population History of North American Northern Goshawks (Accipiter gentilis)","242224438":"Research Article submission","44843498":"Optimisation de potentiels statistiques pour un modèle d\u0027évolution soumis à des contraintes structurales","14352284":"Estimating long-term mating systems using DNA sequences","224541221":"Molecular Population Genetics: Coalescent Methods Based on Summary Statistics","7910192":"Evolution of the Equine Infectious Anemia Virus Long Terminal Repeat during the Alteration of Cell Tropism","10821614":"Mitochondrial phylogeography of the Woodmouse (Apodemus sylvaticus) in the Western Palearctic Region","227646682":"Multilocus phylogeography and population structure of common eiders breeding in North America and Scandinavia","49758650":"Statistical test of neutrality in the age of weak selection","8070965":"Wakeley J.. Metapopulation models for historical inference. Mol Ecol 13: 865-875","11240421":"Human Migrations and Population Structure: What We Know and Why it Matters","12432877":"Advances in understanding the evolution of HIV","12042727":"Nielsen R, Mattila DK, Clapham PJ, Palsbøll PJ. Statistical approaches to paternity analysis in natural populations and applications to the North Atlantic Humpback whale. Genetics 157: 1673-1682","30758532":"Studies on the population genetics of Euphausiids: a comparison of patterns in plagic taxa displaying different distributions and life-histories.","11333630":"Genetic Effective Size of a Wild Primate Population: Influence of Current and Historical Demography","14292873":"The effects of variable mutation rates across sites on the phylogenetic estimation of effective population size or mutation rate of DNA sequences","4993311":"Stopping-time resampling for sequential Monte Carlo methods","8067374":"Inference of demographic history from genealogical trees using reversible jump Markov chain Monte Carlo","237017973":"Identity by Descent: Variation in Meiosis, Across Genomes, and in Populations","6393655":"Estimating the Number of Ancestral Lineages Using a Maximum-Likelihood Method Based on Rejection Sampling","224546362":"Advances in understanding the evolution of HIV","51625034":"Genetic Differentiation of the Western Capercaillie Highlights the Importance of South-Eastern Europe for Understanding the Species Phylogeography","44625395":"Gompert Z, Forister ML, Fordyce JA, Nice CC, Williamson RJ, Buerkle CA.. Bayesian analysis of molecular variance in pyrosequences quantifies population genetic structure across the genome of Lycaeides butterflies. Mol Ecol 19: 2455-2473","237098362":"Inferring Demographic History from a Spectrum of Shared Haplotype Lengths","227662542":"Predicting nuclear gene coalescence from mitochondrial DNA data: the three-times rule","11261385":"Empirical and Hierarchical Bayesian Estimation of Ancestral States","266480257":"Likelihood-Based Inference of Phylogeny","216640394":"Genetic diversity and molecular epidemiology of HIV transmission","38339885":"The ages of mutation in gene trees","11635157":"Exploring the Demographic History of DNA Sequences Using the Generalized Skyline Plot","255619673":"Inferences about the structure and history of populations: coalescents and intraspecific phylogeography","265074346":"American Indian mtDNA and Y Chromosome Genetic Data: A Comprehensive Report of their Use in Migration and Other Anthropological Studies","285220967":"The study of structured populations--new hope for a difficult and divided science","38093613":"Estimating Divergence Parameters With Small Samples From a Large Number of Loci","51845244":"Molecular Phylodynamics and Protein Modeling of Infectious Salmon Anemia Virus (ISAV)","12272075":"Sampling among haplotype resolutions in a coalescent-based genealogy sampler","10575825":"Morrell PL, Lundy KE, Clegg MT. Distinct geographic patterns of genetic diversity are maintained in wild barley (Hordeum vulgare ssp. Spontaneum) despite migration. Proc Natl Acad Sci USA 100: 10812-10817","291408431":"Inferring the Demographic History and Rate of Adaptive Substitution in Drosophila","11261401":"Stochastic Search Strategy for Estimation of Maximum Likelihood Phylogenetic Trees","260148979":"Microsatellite data show recent demographic expansions in sedentary but not in nomadic human populations in Africa and Eurasia","259288576":"Spatial genetic structure and asymmetrical gene flow within the Pacific walrus","12944829":"Beerli, P. \u0026 Felsenstein, J. Maximum likelihood estimation of migration rates and effective population numbers in two populations. Genetics 152, 763-773","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","23720465":"Accurate Computation of Likelihoods in the Coalescent with Recombination via Parsimony.","6258467":"Fast and Accurate Estimation of the Population-Scaled Mutation Rate, , From Microsatellite Genotype Data","232257194":"Contrasting Evolutionary Dynamics and Information Content of the Avian Mitochondrial Control Region and ND2 Gene","225406481":"Exact Computation of Coalescent Likelihood under the Infinite Sites Model","249431902":"Neutrality Tests of Molecular Markers and the Connection Between DNA Polymorphism, Demography, and Conservation Biology","12524351":"Times on Trees, and the Age of an Allele","12026678":"A comparative study of asymmetric migration events across a marine biogeographic boundary. Evolution","238725563":"Co-speciation: a framework for the study of molecular evolutionary rates","44227363":"Analysis of host-pathogen interactions: a bioinformatics approach","227170825":"Part I: Ancestral Inference in Population Genetics","272006064":"On the roles of selection, mutation and drift in the evolution of mitochondrial DNA diversity in British Mytilus edulis (Mytilidae; Mollusca) populations","12660039":"Nielsen, R. Estimation of population parameters and recombination rates from single nucleotide polymorphisms. Genetics 154, 931-942","2853283":"Genealogies from Time-Stamped Sequence Data","12272947":"Limited Heterogeneity of HIV Type 1 in Infected Mothers Correlates with Lack of Vertical Transmission","222403789":"Landscape structure affects dispersal in the greater white-toothed shrew: Inference between genetic and simulated ecological distances","12893515":"The mid-depth method and HIV-1: A practical approach for testing hypotheses of viral epidemic history","26725895":"Coalescents in Full Bloom","233217652":"Genetic Population Structure of Remnant Lake Sturgeon Populations in the Upper Great Lakes Basin","11928868":"High-Resolution Multipoint Linkage-Disequilibrium Mapping in the Context of a Human Genome Sequence","12262691":"Maximum Likelihood Estimation of Recombination Rates From Population Data","14149966":"Nuclear DNA-based markers for plant evolutionary biology","11091763":"Selection for Human Immunodeficiency Virus Type 1 Recombinants in a Patient with Rapid Progression to AIDS","6650878":"Extreme Patterns of Variance in Small Populations: Placing Limits on Human Y-Chromosome Diversity through Time in the Vanuatu Archipelago","232276036":"Integrated Nested Laplace Approximation for Bayesian Nonparametric\nPhylodynamics","12262695":"The effects of rate variation on ancestral inference in the coalescent","26768901":"Wang IJ. Fine-scale population structure in a desert amphibian: landscape genetics of the black toad (Bufo exsul). Mol Ecol 18: 3847-3856","232028746":"Effective population sizes: missing measures and missing concepts","12045608":"Beerli P, Felsenstein J.. Maximum likelihood estimation of a migration matrix and effective population sizes in subpopulations by using a coalescent approach. Proc Natl Acad Sci USA 98: 4563-4568","24171730":"Methods for Human Demographic Inference Using Haplotype Patterns From Genomewide Single-Nucleotide Polymorphism Data","240630772":"Geological Dates and Molecular Rates: Fish DNA Sheds Light on","14479224":"New Statistical Tests of Neutrality for DNA Samples From a Population","228458553":"ECOLOGY OF AQUACULTURE SPECIES AND ENHANCEMENT OF STOCKS","13565798":"Measuring spontaneous deleterious mutation","51865789":"The joint allele frequency spectrum of multiple populations: A coalescent theory approach","8967973":"The Evolution of Molecular Markers – Just a Matter of Fashion?","8619822":"Influence of random genetic drift on human immunodeficiency virus type 1 env evolution during chronic infection","41104348":"The “Expansion-Contraction” model of Pleistocene biogeography: Rocky shores suffer a sea change?","7452098":"Beerli P.. Comparison of Bayesian and maximum-likelihood inference of population genetic parameters. Bioinformatics 22: 341-345","223900908":"MtDNA genetic diversity and population history of a dwindling raptorial bird, the Red Kite (Milvus milvus)","26822700":"An information-theoretic approach to phylogeography","224542932":"Effective population sizes: Missing measures and missing concepts","226752571":"Mitochondrial phylogeography, subspecific taxonomy, and conservation genetics of Sandhill crane (Grus canadensis; Aves:Gruidae)","6313947":"The Evolutionary Forest Algorithm","49758538":"Statistical analyses of population genetic data","242442675":"pattern of DNA substitutions among individuals","11245930":"Estimating Mutation Parameters, Population History and Genealogy Simultaneously From Temporally Spaced Sequence Data","237619690":"Running Title: Computational Method for Population Genetic Parameters","13559565":"Genealogical Inference From Microsatellite Data","249442589":"Patterns of population subdivision, gene flow and genetic variability in the African wild dog (Lycaon pictus): POPULATION STRUCTURE IN AFRICAN WILD DOGS","12698377":"No BLUE among phylogenetic estimators","264889344":"PHYLOGEOGRAPHY OF BROWN AND RED-FOOTED BOOBIES: A COMPLEX HISTORY OF ISOLATION AND GENE FLOW","268428854":"Coalescent-based inference from DNA sequence data us- ing MCMC","228055134":"Coalescent Theory","259729585":"Genetic Structure of the Common Eider in the Western Aleutian Islands Prior to Fox Eradication (Estructura Genética de Somateria mollissima en las Islas Aleutianas del Oeste Antes de la Erradicación del Zorro)","241697190":"Inferring Selection Intensity and Allele Age from Multi-Locus Haplotype Structure.","8579916":"Mitochondrial Cytochrome b DNA Variation in the High-Fecundity Atlantic Cod: Trans-Atlantic Clines and Shallow Gene Genealogy","6547373":"Landscape-scale variation in a forest outbreak species, the mountain pine beetle Dendroctonus ponderosae","3749878":"Design and experiments of the tactile sensor for robot hands utilizing a suspension shell","228362835":"Genetic characterization of Common Eiders breeding in the Yukon-Kuskokwim Delta, Alaska","12756242":"Genealogical Evidence for Positive Selection in the nef Gene of HIV-1","228777590":"Estimation of migration rates and population sizes in geographically structured populations","284067128":"Probability Distribution of Molecular Evolutionary Trees: A New Method of Phylogenetic Inference","245538682":"Frequent Coinfection Reduces RNA Virus Population Genetic Diversity","7831982":"Russell AL, Medellín RA, McCracken GF. Genetic variation and migration in the Mexican free-tailed bat (Tadarida brasiliensis mexicana). Mol Ecol 14: 2207-2222","8422237":"Phylogeographic history of the Yellow-necked fieldmouse (Apodemus flavicollis) in Europe and in the Near and Middle East","26879556":"On the Use of Bootstrapped Topologies in Coalescent-Based Bayesian MCMC Inference: A Comparison of Estimation and Computational Efficiencies","41056684":"Dynamic Networks from Hierarchical Bayesian Graph Clustering","264203361":"An Efficient Estimator of the Mutation Parameter and Analysis of Polymorphism from the 1000 Genomes Project","11936084":"Distinguishing Migration From Isolation: A Markov Chain Monte Carlo Approach","11450187":"Griswold CK, Baker AJ. Time to the most recent common ancestor and divergence times of populations of common chaffinches (Fringilla coelebs) in Europe and North Africa: insights into pleistocene refugia and current levels of migration. Evolution 56: 143-153","11562838":"Nested Cladistic Analysis of Brazilian Populations of Drosophila serido","11381061":"Genealogical Trees, Coalescent Theory and the Analysis of Genetic Polymorphisms","2581454":"Phylogenetic Tree Construction Using Markov Chain Monte Carlo","7880081":"Human Serum Facilitates Hepatitis C Virus Infection, and Neutralizing Responses Inversely Correlate with Viral Replication Kinetics at the Acute Phase of Hepatitis C Virus Infection","260229736":"Examination of ten thousand years of mitochondrial DNA diversity and population demographics in bowhead whales (Balaena mysticetus) of the Central Canadian Arctic","13603619":"Probability of a Segregating Pattern in a Sample of DNA Sequences","12929321":"Statistic analysis of microsatellite DNA data","229075531":"Inferring the History of Population Size Change from Genome-Wide SNP Data","7362461":"Kuhner MK. LAMARC 2.0: maximum likelihood and Bayesian estimation of population parameters. Bioinformatics 22: 768-770","50286866":"Interpreting the estimated timing of migration events between hybridizing species","7658374":"Detecting historical bottlenecks using temporal genetic data.","26270309":"Lundemo S, Falahati-Anbaran M, Stenoien HK.. Seed banks cause elevated generation times and effective population sizes of Arabidopsis thaliana in northern Europe. Mol Ecol 18: 2798-2811","10681172":"Hey, J. \u0026 Machado, C.A. The study of structured populations-new hope for a difficult and divided science. Nat. Rev. Genet. 4, 535-543","230580809":"La variabilidad genética de las especies: aspectos conceptuales y sus aplicaciones y perspectivas en México","14156578":"A Coalescent Estimator of the Population Recombination Rate","226664062":"Genetic divergence, phylogeography and conservation units of giant tortoises from Santa Cruz and Pinzon, Galapagos Islands. Conserv. Genet., 4, 31-46","10929498":"Phylogeny Shape and the Phylogenetic Comparative Method"},"index":224}