{"abs":"A novel framework for the design of state-space models (SSMs) is proposed whereby the state-transition function of the model is parametrized using reproducing kernels. The nature of SSMs requires learning a latent function that resides in the state space and for which input-output sample pairs are not available, thus prohibiting the use of gradient-based supervised kernel learning. To this end, we then propose to learn the mixing weights of the kernel estimate by sampling from their posterior density using Monte Carlo methods. We first introduce an offline version of the proposed algorithm, followed by an online version which performs inference on both the parameters and the hidden state through particle filtering. The accuracy of the estimation of the state-transition function is first validated on synthetic data. Next, we show that the proposed algorithm outperforms kernel adaptive filters in the prediction of real-world time series, while also providing probabilistic estimates, a key advantage over standard methods.","title":"Unsupervised State-Space Modeling Using Reproducing Kernels","id":281127386,"url":"https://www.researchgate.net/publication/281127386_Unsupervised_State-Space_Modeling_Using_Reproducing_Kernels","names":["Felipe Tobar","Petar M Djuric","Danilo P. Mandic","IEEE Transactions on Signal Processing"],"references":{"50402307":"Gaussian Processes for Machine Learning (GPML) toolbox","3361206":"Novel Approach to Nonlinear/Non-Gaussian Bayesian State Estimation","221619762":"Linear Support Vector Regression Machines","3318965":"The Kernel Recursive Least Squares Algorithm","2644768":"A Generalized Representer Theorem","224839919":"A New Approach To Linear Filtering and Prediction Problems","266926311":"Conditional Markov Processes","260712731":"Multikernel Least Mean Square Algorithm","250955751":"On the Differential Equations Satisfied by Conditional Probability Densities of Markov Processes","224352843":"Online Prediction of Time Series Data With Kernels","237145783":"Bayesian Inference and Learning in Gaussian Process State-Space Models with Particle MCMC","209436387":"A Tutorial on Support Vector Regression","4202585":"Time Series Filtering, Smoothing and Learning using the Kernel Kalman Filter","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","2836914":"On the Influence of the Kernel on the Consistency of Support Vector Machines","283374585":"Stochastic Modelling and Applied Probability","3321490":"Particle Filtering","258655691":"Adaptive Frequency Estimation in Smart Grid Applications: Exploiting Noncircularity and Widely Linear Adaptive Estimators","221995160":"Theory of reproducing kernels. Trans Am Math Soc","220500224":"Nonlinear Component Analysis as a Kernel Eigenvalue Problem","220320263":"Unsupervised Multiple Kernel Learning.","264576108":"Estimation of deer population dynamics using a Bayesian state-space model with multiple abundance indices","220041140":"Learning with kernels - support vector machines, regularization, optimization, and beyond.","221618590":"Risk Sensitive Particle Filters","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","264967033":"Theoretical Foundations of the Potential Function Method in Pattern Recognition Learning","221933062":"Fundamentals of Adaptive Filtering","38367114":"Remarks on Some Non-Parametric Estimates of a Density Function","3316982":"Asymptotic MAP criteria for model selection","248590871":"An introduction to sup - port vector machines and other kernel - based methods","261198167":"The quaternion kernel least squares","3086056":"An Explicit Description of the Reproducing Kernel Hilbert Spaces of Gaussian RBF Kernels","264593675":"Comparison of Approximate Methods for Handling Hyperparameters","242074018":"Some Properties of Gaussian Reproducing Kernel Hilbert Spaces and Their Implications for Function Approximation and Learning Theory","221497340":"Lecture Notes in Computer Science","227093337":"Kernel Principal Component Analysis","265434369":"Adaptive Filtering Prediction and Control","221719662":"Robust Filtering and Smoothing with Gaussian Processes","260541917":"Risk Measures for Particle-Filtering-Based State-of-Charge Prognosis in Lithium-Ion Batteries","2491202":"Learning Nonlinear Dynamical Systems using an EM Algorithm","3320661":"The Kernel Least-Mean-Square Algorithm","233154829":"Exact Finite-Dimensional Filters for Certain Diffusions with Nonlinear Drift","243689579":"A Resource-Allocating Network for Function Interpolation","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","243133455":"Sequential Monte Carlo Methods in Practice","224439571":"Extended Kernel Recursive Least Squares Algorithm","4995513":"Stochastic Volatility: Likelihood Inference and Comparison with ARCH Models","12545482":"Sequential Monte Carlo Methods to Train Neural Network Models","265967011":"Analyzing Sparse Dictionaries for Online Learning With Kernels","221612495":"A Hilbert Space Embedding for Distributions","221112273":"Sparse Online Greedy Support Vector Regression"},"citedIn":{},"index":226}