{"abs":"A variety of results for genealogical and line-of-descent processes that arise in connection with the theory of some classical selectively neutral population genetics models are reviewed. While some new results and derivations are included, the principle aim is to demonstrate the central importance and simplicity of genealogical Markov chains in this theory. Considerable attention is given to \"diffusion time scale\" approximations of such genealogical processes. A wide variety of results pertinent to (diffusion approximations of) the classical multiallele single-locus Wright-Fisher model and its relatives are simplified and unified by this approach. Other examples where such genealogical processes play an explicit role, such as the infinite sites and infinite alleles models, are discussed.","title":"Tavare, S. Line-of-descent and genealogical processes, and their applications in population genetics models. Theor. Popul. Biol. 26, 119-164","id":16690287,"url":"https://www.researchgate.net/publication/16690287_Tavare_S_Line-of-descent_and_genealogical_processes_and_their_applications_in_population_genetics_models_Theor_Popul_Biol_26_119-164","names":["Simon Tavaré","Theoretical Population Biology"],"references":{"22140881":"Reversibility and the age of an allele. I. Moran’s infinitely- many neutral alleles model, Theoret. Population Biol. 10, 239-253","222714823":"Handbook of Mathematical Function: With Formulas, Graphs, and Mathematical Tables","18499356":"Addendum to a paper of W. Ewens","242912370":"The Characteristic Values and Vectors for a Class of Stochastic Matrices Arising in Genetics","22140888":"Loss of alleles in a haploid population with varying environment","275936635":"Exact Results for the Moran Neutral Allele Model","222853058":"How probable is it to be first born? and other branching-process applications to kinship problems","18405394":"The age of a neutral mutant persisting in a finite population. Genetics","266512878":"The Number of Alleles and Segregating Sites in a Sample from the Infinite-Alleles Model","22009153":"Watterson GA. Number of segregating sites in genetic models without recombination. Theor Popul Biol 7: 256-276","235710979":"An Introduction to Population Genetic Theory","266694903":"On the past History of an Allele Now Known to Have Frequency p","231852739":"Random processes in genetics","265367881":"Application of the Galton-Watson Process to the Kin Number Problem","22292172":"Li W-H. Distribution of nucleotide differences between two randomly chosen cistrons in a finite population. Genetics 85: 331-337","267184117":"Notes on Information in Population Genetics","239052708":"On the Genealogy of Large Populations","15765355":"Loss of selectively neutral alleles in small populations and regular mating systems","266997105":"On Some Stochastic Models in Genetics","265367882":"Exact Distributions of Kin Numbers in a Galton-Watson Process","6555647":"The Average Number of Generations until Fixation of a Mutant Gene in a Finite Population","243740187":"Exchangeability and the evolution of large populations","268246625":"Mutant Substitutions at Linked Nucleotide Sites","231886799":"Digenic measures for finite populations. –","251219047":"On the Genealogy of Nested Subsamples from a Haploid Population","240109520":"Mathematical Population Genetics: I","268825892":"Substitution Times for Mutant Nucleotides","16340570":"Simulating allele frequencies in a population and the genetic differentiation of populations under mutation pressure. Theoret Pop Biol (in press)","22447091":"Ages, extinction times, and first passage probabilities for a multiallele diffusion model with irreversible mutation","25450668":"Stochastic Models in Population Genetics","18005690":"The rate of loss of multiple alleles in finite haploid populations","276047070":"Random Genetic Drift in a Tri-Allelic Locus; Exact Solution with a Continuous Model","242941771":"Ein Grenzwertsatz für subkritische Verzweigungsprozesse mit endlich vielen Typen von Teilchen","16052288":"The distribution of nucleotide site differences between two finite sequences","225198425":"The lattice models of neutral multi-alleles in population genetics theory","22288226":"Is the most frequent allele the oldest? Theor Popul Biol","247924208":"The Latent Roots of Certain Markov Chains Arising in Genetics: A New Approach, I. Haploid Models","25450557":"Genealogical and genetic structure","23444060":"Ohta T, Kimura M. Model of mutation appropriate to estimate number of electrophoretically detectable alleles in a finite population. Genet Res 22: 201-204","18342189":"Distributions of time to fixation of neutral genes","254204700":"The distribution of generations and other aspects of the family structure of branching processes","18499361":"Ewens WJ. The Sampling Theory of Selectively Neutral Alleles. Theoret Popul Biol 3: 87-112","15795533":"Lines of descent in the diffusion approximation of neutral Wright-Fisher models. Theoret Pop Biol","231941740":"The transient behaviour of the Moran model in population genetics","266512802":"Wandering Phenomena in Infinite-Allelic Diffusion Models","226803780":"Eigenanalysis for the Kolmogorov backward equation for the neutral multi-allelic model","22299799":"Distribution of nucleotide differences between two randomly chosen cistrons in a population of variable size","242991550":"Loss of variability at one locus in a finite population","230213360":"The Structure of Reduced Critical Galton–Watson Processes","242356795":"A First Course in Stochastic Process","15834431":"The strong-migration limit in geographically structured populations","226565584":"Genetic identity between populations when mutation rates vary within and across loci","268755029":"Exact Sampling Distributions from the Infinite Neutral Alleles Model","21881502":"Variability in the amount of heterozygosity maintained by neutral mutations","247329381":"Random Genetic Drift in Multi-Allelic Locus","225873071":"The number of distinguishable alleles according to the Ohta-Kimura model of neutral mutation","239786003":"The number of mutant forms maintained in population","232341817":"Genetic identity in subdivided populations. I. Two equal-sized subpopulations","242912154":"Haploid Populations Subject to Varying Environment: The Characteristic Values and the Rate of Loss of Alleles","224043320":"Handbook of Matematical Functions","228057717":"An Introduction to Probability Theory and Its Applications II","243776868":"The Stationary Distribution of the Infinitely-Many Neutral Alleles Diffusion Model","22231095":"Persistence of common alleles in two related populations or species","268784865":"Transient Distribution of the Number of Segregating Sites in a Neutral Infinite-Sites Model with no Recombination","268248602":"On Stochastic Population Models in Genetics","239061974":"An Introduction to Probability Theory and Its Applications – Volume I and II","241679373":"Some Genetic Problems in Natural Populations","285606636":"The concept of identity of genes by descent","247355989":"On the distribution of allele frequencies in a diffusion model","21990178":"Transition Densities for Neutral Multi-Allele Diffusion Models","18719986":"A note on the sampling theory for infinite alleles and infinite sites models","266754708":"A Transition Density Expansion for a Multi-Allele Diffusion Model","17754493":"The length of time required for a selectively neutral mutant to reach fixation through random frequency drift in a finite population","270359528":"Equilibrium Behavior of Population Genetic Models with Non-Random Mating","223115706":"The Coalescent","239060292":"A Second Course in Stochastic Processes. Academic Press, Inc","240325544":"The Pseudo-Transient Distribution and Its Uses in Genetics","7189777":"Solution of a process of random genetic drift with a continuous model, Proc. Nat. Acad. Sci. U.S.A. 41, 144-150"},"citedIn":{"23635310":"Central limit theorem for the size of the range of a renewal process","10588326":"The frequency spectrum of a mutation, and its age, in a general diffusion model","7696498":"Wang JL. Estimation of effective population sizes from data on genetic markers. Philos Trans R Soc Lond B 360: 1395-1409","38063692":"Effective population size of a population with stochastically varying size","10994861":"The Genetic Origins of the Andaman Islanders","7778427":"On the probability that a novel variant is a disease-causing mutation","5549147":"Interspecific hybridization and restricted trans-Pacific gene flow in the Tropical Eastern Pacific Pocillopora","285221137":"A reduction of \"species\" and a resolution of the species problem","38350424":"A new stochastic model of microsatellite evolution","20914477":"Sampling strategies for distances between DNA sequences","34480668":"Gene tree distributions under the coalescent process /","13973702":"Ancestral Processes with Selection","14791927":"How the ratio of nonsynonymous to synonymous pseudogene substitions can be less than one","12031137":"The Coalescent in an Island Model of Population Subdivision with Variation among Demes","12527784":"The coalescent with gene conversion","7903330":"An Efficient Monte Carlo Method for Estimating Ne From Temporally Spaced Samples Using a Coalescent-Based Likelihood","239559259":"Demographic models","224707910":"Ancient Structure in Africa Unlikely to Explain Neanderthal and Non-African Genetic Similarity","41579103":"The Distribution of Fst and other Genetic Statistics for a Class of Population Structure Models","5642352":"Population genetic inference using a fixed number of segregating sites: A reassessment","8469673":"Multilocus Methods for Estimating Population Sizes, Migration Rates and Divergence Time, With Applications to the Divergence of Drosophila pseudoobscura and D. persimilis","260441007":"The incidence of species-level paraphyly in animals: A re-assessment","235680290":"Calibrating Evolutionary Rates at Major Histocompatibility Complex Loci","51508030":"Coalescence-Time Distributions in a Serial Founder Model of Human Evolutionary History","226953655":"The strong-migration limit for the genealogical process in geographically structured populations","2693144":"On The Validity Of The Log-Sobolev Inequality For Symmetric Fleming-Viot Operators","227658147":"Mapping the evolutionary twilight zone: molecular markers, populations and geography. J Biogeogr","12318856":"Wakeley, J. The effects of subdivision on the genetic divergence of populations and species. Evolution 54, 1092-1101","227327416":"Williamson-Natesan EG.. Comparison of methods for detecting bottlenecks from microsatellite loci. Conserv Genet 6: 551-562","14003427":"Kelly JK. Test of neutrality based on interlocus associations. Genetics 146: 1197-1206","259332930":"Population Structure of Dipodomys ingens (Heteromyidae): The Role of Spatial Heterogeneity in Maintaining Genetic Diversity","13994221":"“A Coalescent Approach to the Polymerase Chain Reaction,”","8119362":"The Role of Natural Selection in Genetic Differentiation of Worldwide Populations of Drosophila ananassae","7148630":"Genealogical theory for random mating populations with two sexes","279310490":"Exact simulation of the Wright-Fisher diffusion","11652337":"Kreitman M. Methods to detect selection in populations with applications to the human. Annu Rev Genom Hum Genet 1: 539-559","226149688":"The genealogical process of neutral genes with mutation in geographically structured populations","239442444":"Inferring species trees directly from SNP and AFLP data: full coalescent analysis without those pesky gene trees","41000511":"Assigning sequences to species in the absence of large interspecific differences","24182049":"Population genetic models of duplicated genes","242016826":"Integrating Phylogenetics, Phylogeography and Population Genetics Through Genomes and Evolutionary Theory.","226863580":"Consolidation rates for two interacting systems in the plane","276083757":"Ergodic inequality of a two-parameter infinitely-many-alleles diffusion model","50347868":"Inferring Population Decline and Expansion From Microsatellite Data: A Simulation-Based Evaluation of the Msvar Method","12375265":"On the Genealogy of a Sample of Neutral Rare Alleles","250753687":"A semigroup representation and asymptotic behavior of certain statistics of the Fisher-Wright-Moran coalescent","20834651":"Takahata N.. A simple genealogical structure of strongly balanced allelic lines and trans-species evolution of polymorphism. Proc Natl Acad Sci USA 87: 2419-2423","267816857":"Sampling Properties of Genealogical Pathways Underlying Population Pedigrees Author(s)","251545231":"Patient Feedback Improves Depression Outcome","289767734":"Gene Flow in Fungi","270824535":"Distributions of topological tree metrics between a species tree and a gene tree","237458003":"A Reduction of \"Species\" denote a group of similar organisms (Ghiselin, 1966, Resolves the Species Problem","7827456":"Ewens\u0027 sampling formula and related formulae: Combinatorial proofs, extensions to variable population size and applications to ages of alleles","265440174":"The Ages of Alleles and a Coalescent","258247448":"Some large deviations in Kingman\u0027s coalescent","23281948":"Sex-Biased Evolutionary Forces Shape Genomic Patterns of Human Diversity","21214662":"Which locus has the oldest allele?","11886642":"Estimation of Admixture Proportions: A Likelihood-Based Approach Using Markov Chain Monte Carlo","237047465":"Chapter 4: Neutral patterns of genetic variation and applications to conservation in conifer species.","15717472":"Divergence Time and Population Size in the Lineage Leading to Modern Humans","225098213":"Analytical Framework for Identifying and Differentiating Recent Hitchhiking and Severe Bottleneck Effects from Multi-Locus DNA Sequence Data","279310389":"The star-shaped Lambda-coalescent and Fleming-Viot process","29489490":"A unified multi-resolution coalescent: Markov lumpings of the Kingman-Tajima n-coalescent","19494330":"The population genealogy of the infinitely-many neutral alleles model, J. Math. Biol. 251, 381-391","29489492":"Coalescent experiments I: Unlabeled n-coalescent and the site frequency spectrum","2907321":"Compositions of Random Functions on a Finite Set","9065501":"Patterns of Human Genetic Diversity: Implications for Human Evolutionary History and Disease. Ann Rev Genomics Hum Genet 4:293-340","38360784":"Weak Convergence of Population Genealogical Processes to the Coalescent with Ages","5552373":"Discordance of Species Trees with Their Most Likely Gene Trees: The Case of Five Taxa","38390507":"Mathematical models, problems, and controversies of evolutionary theory","14549116":"Estimating the Age of the Common Ancestor of Men from the ZFY Intron","259956700":"Distortion of genealogical properties when the sample is very large","8077528":"A multilocus sequence survey in Arabidopsis thaliana reveals a genome-wide departure from a neutral model of DNA sequence polymorphism","7048392":"Discordance of Species Trees with Their Most Likely Gene Trees","2136196":"A Fleming-Viot Process and Bayesian Nonparametrics","14549115":"Estimating the Age of the Common Ancestor of Men from the ZFY Intron","19373441":"Partition structures, Polya urns, the Ewens sampling formula, and the ages of alleles. Theoret. Population Biol. 30, 271-288","267085645":"Probability Models for DNA Sequence Evolution","2126985":"Exchangeable partitions derived from Markovian coalescents","8077520":"Statistical Tests of the Coalescent Model Based on the Haplotype Frequency Distribution and the Number of Segregating Sites","20428187":"Allele frequencies in multigene families II. Coalescent approach","263281436":"A hierarchical extension scheme for solutions of the Wright-Fisher model","273158374":"Efficient computation of the joint sample frequency spectra for multiple populations","15717471":"Statistical Properties of Segregating Sites","269166770":"1406.5152v2","24202700":"Convergence time to the Ewens sampling formula in the infinite alleles Moran model","19082653":"Dual processes and an invariance result for exchangeable models in population genetics","11499631":"Likelihood-Based Estimation of the Effective Population Size Using Temporal Changes in Allele Frequencies: A Genealogical Approach","224223640":"A Token-Based Approach for Distributed Computation in Sensor Networks","5890198":"Siol M, Bonnin I, Olivieri I, Properi JM, Ronfort J. Effective population size associated with self-fertilization: lessons from temporal changes in allele frequencies in the selfing annual Medicago truncatula. J Evol Biol 20: 2349-2360","50269736":"Evolution and Population Genetics of Exotic and Re-Emerging Pathogens: Novel Tools and Approaches","1861830":"Stochastic Models of Evolution in Genetics, Ecology and Linguistics","8070304":"Ballard JWO, Whitlock MC. The incomplete natural history of mitochondria. Mol Ecol 13: 729-744","222596511":"Allele frequencies after a bottleneck","8070311":"Evaluating the performance of likelihood methods for detecting population structure and migration. Mol Ecol","266351421":"The Transition Function of a Measure-Valued Branching Diffusion with Immigration","51105771":"The effect of recurrent mutation on the frequency spectrum of a segregating site and the age of an allele","232341821":"Estimating divergence times","227423592":"Asymptotic results about the total branch length of the Bolthausen-Sznitman coalescent","40865416":"Systèmes de particules en interaction: ordre stochastique, attractivité et marches aléatoires sur graphes small world.","12860451":"Fu, Y.-X. \u0026 Li, W.-H. Coalescing into the 21st century: an overview and prospects of coalescent theory. Theor. Popul. Biol. 56, 1-10","221891027":"Probabilistic Logic Methods and Some Applications to Biology and Medicine","21838240":"Rogers AR, Harpending HC. Population growth makes waves in the distribution of pairwise genetic differences. Mol Biol Evol 9: 552-569","26288511":"Population Genetic Analysis of an Eastern US Wheat Powdery Mildew Population Reveals Geographic Subdivision and Recent Common Ancestry with UK and Israeli Populations","222673328":"Detecting hybrid speciation in the presence of incomplete lineage sorting using gene tree incongruence: a model. Theor Popul Biol","285260282":"Forward-Time Population Genetics Simulations: Methods, Implementation, and Applications","8677503":"No Evidence of Neandertal mtDNA Contribution to Early Modern Humans","51945444":"Propagation of Chaos in a Coagulation Model","12720579":"Nonequilibrium Migration in Human History","10575264":"Evolution and genetic structure of the Great Tit (Parus major) complex","289379388":"235.full","234149105":"Neigel, J. E.. A comparison of alternative strategies for estimating gene flow from genetic markers. Ann Rev Ecol Syst, 28: 105-128","259975796":"Family Trees: Languages and Genetics","51791387":"The probability distribution of ranked gene trees on a species tree","229684414":"Conservation Genetics","262813349":"The Irish potato famine pathogen Phytophthora infestans originated in central Mexico rather than the Andes","51966477":"Gamma-Dirichlet Structure and Two Classes of Measure-valued Processes","221810721":"Norovirus GII.4 and GII.7 capsid sequences undergo positive selection in chronically infected patients","274966906":"Universality in a class of fragmentation-coalescence processes","226185307":"Application of non-coding DNA regions in intraspecific analyses. Plant Syst Evol","228115634":"The Λ-Fleming-Viot process and a connection with Wright-Fisher diffusion","11909531":"Palumbi SR, Cipriano F, Hare MP. Predicting nuclear gene coalescence from mitochondrial data: the three-times rule. Evolution 55: 859-868","13667838":"Maximum Likelihood Estimation of Population Divergence Times and Population Phylogenies under the Infinite Sites Model","247356300":"The genetic divergence of three populations","14843344":"The synonymous substitution rate of the major histocompatibility complex loci in primates","236871466":"Optimal filtering and the dual process","5308773":"Summary statistics of neutral mutations in longitudinal DNA samples","12931569":"Some Statistical Improvements for Estimating Population Size and Mutation Rate from Segregating Sites in DNA Sequences","12931570":"Recombination as a Point Process along Sequences","224829535":"Biogeography of flowering plants: a case study in mignonettes (Resedaceae) and sedges (Carex, Cyperaceae)","20410379":"A numerical method for calculating moments of coalescent times in finite populations with selection","51974693":"Estimating population divergence time and phylogeny from single-nucleotide polymorphisms data with outgroup ascertainment bias","222488703":"Monte Carlo inference methods in population genetics","47789030":"Inferring the colonization of a mountain range—Refugia vs. nunatak survival in high alpine ground beetles","14748067":"Allelic genealogy and human evolution","28324084":"Empirical approaches to detecting the action of natural selection in Drosophila","42611661":"The Site-Frequency Spectrum of Linked Sites","230693004":"Stochastic Spatial Models: A User\u0027s Guide to Ecological Applications","45906921":"The small world effect on the coalescing time of random walks","236265283":"Estimating Variable Effective Population Sizes From Multiple Genomes: A Sequentially Markov Conditional Sampling Distribution Approach","45366254":"The Total Branch Length of Sample Genealogies in Populations of Variable Size","11399670":"The Probability of Topological Concordance of Gene Trees and Species Trees","21526551":"Felsenstein J. Estimating effective population size from samples of sequences: inefficiency of pairwise and segregating sites as compared to phylogenetic estimates. Genet Res 59: 139-147","227715314":"The effects of subdivision on the genetic divergence of population and species","285220967":"The study of structured populations--new hope for a difficult and divided science","32166019":"The stationary distributions of Fleming-Viot Processes with selection (Stochastic Analysis on Measure-Valued Stocastic Processes)","251726440":"Electroacupuncture at Acupoint ST36 Promotes Colonic Transit via Regulating Proliferation/Apoptosis of Interstitial Cells of Cajal in the Colon of Diabetic Rats","5293373":"Testing for Neutrality in Samples With Sequencing Errors","12193236":"Genetics and the population history of Europe","282173856":"Genetic background","259321350":"An Age-of-Allele Test of Neutrality for Transposable Element Insertions","12720566":"Zurovcova M, Eanes WF. Lack of nucleotide polymorphism in the Y-linked sperm flagellar dynein gene Dhc-Yh3 of Drosophilamelanogaster and D. simulans. Genetics 153: 1709-1715","8369416":"Different Regulatory Mechanisms Underlie Similar Transposable Element Profiles in Pufferfish and Fruitflies","239061831":"Gene Trees and Organismal Histories: A Phylogenetic Approach to Population Biology","242459406":"Population Genetic Inference","227219701":"The Interplay of Replication, Variation and Selection in the Dynamics of Evolving Populations","224977129":"A Coalescent Model for Genotype Imputation","49940348":"Coalescents with multiple collisions","51979920":"IGLASS: An improvement to the GLASS method for estimating species trees from gene trees","236076958":"Peregrine and saker falcon genome sequences provide insights into evolution of a predatory lifestyle","225531104":"Critical clustering in the two dimensional voter model","288058552":"Exact Markov chain and approximate diffusion solution for haploid genetic drift with one-way mutation","222799067":"The end of the beginning for neutral theory","220345532":"A family of random trees with random edge lengths","247355166":"The genetic divergence of two populations","14516601":"Genetic variability in parasites and host-parasite interactions","12149020":"The Sequence of the Human Genome","12262675":"Contrasting molecular population genetics of four hexokinases in Drosophila melanogaster, D. simulans and D. yakuba","6957507":"The coalescence time of sampled genes in the structured coalescent model","11220254":"Wright–Fisher Revisited: The Case of Fertility Correlation","14197090":"Estimating the age of alleles by use of intraallelic variability","19095711":"Gene diversity in finite populations","244989786":"Ergodic Inequality of Three Population Genetic Models","230692866":"Twisted sister species of pygmy angelfishes: Discordance between taxonomy, coloration, and phylogenetics","227588179":"Genealogical trees from genetic distances","228055134":"Coalescent Theory","262382185":"Climate Change Impacts on the Tree of Life: Changes in Phylogenetic Diversity Illustrated for Acropora Corals","237619175":"Presented in Partial Fulfillment of the Requirements for the Degree Doctor of Philosophy in the Graduate School of The Ohio State University","237584377":"the haplotype frequency distribution and the number of segregating sites","44585850":"Quantifying the Pleistocene history of the oak gall parasitoid Cecidostiba fungosa","13763846":"On the Genealogy of a Rare Allele","262307450":"Finding the best resolution for the Kingman–Tajima coalescent: theory and applications","223837321":"Predicting the genetic drift in small populations","11936084":"Distinguishing Migration From Isolation: A Markov Chain Monte Carlo Approach","23183491":"Second-Order Moments of Segregating Sites Under Variable Population Size","13409576":"Segregating Sites in a Gene Conversion Model with Mutation","49768210":"Coalescent Histories on Phylogenetic Networks and Detection of Hybridization Despite Incomplete Lineage Sorting","248528694":"Modeling the past: a resource for the future","11381061":"Genealogical Trees, Coalescent Theory and the Analysis of Genetic Polymorphisms","38360994":"Coalescing Random Walks and Voter Model Consensus Times on the Torus in $\\mathbb{Z}^d$","261805687":"The Evolution of Manuscript Traditions","7266689":"Association Mapping With Single-Feature Polymorphisms","10849618":"Hudson RR, Turelli M. Stochasticity overrules the \u0027Three-Times Rule\u0027: genetic drift, genetic draft, and coalescence times for nuclear loci versus mitochondrial DNA. Evolution 57: 182-190","265141815":"RECONSTRUCTING POSTERIOR DISTRIBUTIONS OF A SPECIES PHYLOGENY USING ESTIMATED GENE TREE DISTRIBUTIONS Dissertation Committee","265328171":"Combinatorial stochastic processes. Ecole d’Eté de Probabilités de Saint-Flour XXXII – 2002","8344191":"The Probability and Chromosomal Extent of trans-specific Polymorphism","5807706":"Demographic History Has Influenced Nucleotide Diversity in European Pinus sylvestris Populations","20549436":"Genealogical-tree probabilities in the infinitely-many-site model","271331881":"Delineating Community Outbreaks of Salmonella enterica Serovar Typhimurium by Use of Whole-Genome Sequencing: Insights into Genomic Variability within an Outbreak","251586808":"Geometric stick-breaking processes for continuous-time Bayesian nonparametric modeling","38350913":"Structured coalescent with nonconservative migration","50366732":"A Token Based Algorithm to Distributed Computation in Sensor Networks","267181539":"A spectral decomposition for the block counting process of the Bolthausen-Sznitman coalescent","11293367":"DNA Sequence Variation at a Duplicated Gene: Excess of Replacement Polymorphism and Extensive Haplotype Structure in the Drosophila melanogasterbicoid Region","229153675":"Estimating Population-Level Coancestry Coefficients by an Admixture F Model","7842384":"On the Number of New World Founders: A Population Genetic Portrait of the Peopling of the Americas","264873441":"Estimating species trees: an introduction to concepts and models","26860457":"How Robust Are \"Isolation with Migration\" Analyses to Violations of the IM Model? A Simulation Study","15156946":"Molecular genetics of speciation and human origins","227947424":"Issues concerning association studies for fine mapping a susceptibility gene for a complex gene","11021983":"Phylogenetic Discordance at the Species Boundary: Comparative Gene Genealogies Among Rapidly Radiating Heliconius Butterflies","235390014":"Intercoalescence Time Distribution of Incomplete Gene Genealogies in Temporally Varying Populations, and Applications in Population Genetic Inference","10597021":"Rosenberg NA.. The shapes of neutral gene genealogies in two species: probabilities of monophyly, paraphyly and polyphyly in a coalescent model. Evolution 57: 1465-1477","7617075":"A test of founder effect speciation using multiple loci in the Auklets (Aethia spp.)","6388264":"Estimation of the number of individuals founding colonized populations","13526660":"On the Probability of Neanderthal Ancestry","6782506":"Coalescent theory for a completely random mating monoecious population","8200755":"How Old Is the Most Recent Ancestor of Two Copies of an Allele?","8200754":"On the Effect of Fluctuating Recombination Rates on the Decorrelation of Gene Histories in the Human Genome","13790850":"The number of segregating sites in a sample of DNA sequences from a geographically structured population","231156629":"On the stochastic approach to cluster size distribution during particle coagulation. I. Asymptotic expansion in the deterministic limit","26588099":"Phylogeographic studies of Brazilian “campo-rupestre” species: Wunderlichia mirabilis Riedel ex Baker (Asteraceae)","243766501":"Population Genetics Theory - The Past and the Future","221667154":"Genealogies in simple models of evolution","8988391":"Coalescent process with fluctuating population size and its effective size","226186004":"Retrospective coalescent methods and the reconstruction of metapopulation histories in the sea","14936721":"The coalescent in two colonies with symmetric migration. J Math Biol","233558941":"Phylogeography of Homalothecium sericeum (Hedw.) Br. Eur.; toward a reconstruction of glacial survival and postglacial migration","232227755":"Germ banks affect the inference of past demographic events","21252037":"Coalescent processes in models with selection, recombination and geographic subdivision","282544725":"Token-based Function Computation with Memory","2282150":"Brownian Excursion Conditioned On Its Local Time","8493576":"A Robust Measure of HIV-1 Population Turnover within Chronically Infected Individuals","227110656":"The fate of European Neanderthals: Results and perspectives from ancient DNA analyses","38339783":"A transition function expansion for a diffusion model with selection","270630576":"Evolutionary dynamics of visual memory","277297685":"Lecture Topics","44651579":"Identifying Hybridization Events in the Presence of Coalescence via Model Selection","21868510":"Do Eve\u0027s alleles live on?","6998777":"Variable SNP density in aspartyl-protease genes of the malaria parasite Plasmodium falciparum","227076893":"Is Fst obsolete?","40852727":"No evidence of Neanderthal mtDNA contribution to early modern humans","243129572":"On the Occasion of the 25th Anniversary of the Neutral Theory. (I). Introductory comments on major papers by Professor Motoo Kimura","221879204":"Tree topologies under incomplete lineage sorting by maximum likelihood","251219047":"On the Genealogy of Nested Subsamples from a Haploid Population","259163603":"Detecting recent changes in the demographic parameters of drosophilid populations from western and central Africa","7155404":"A Coalescent-Based Estimator of Admixture From DNA Sequences","2318977":"Coalescents With Multiple Collisions","6423242":"The probability distribution under a population divergence model of the number of genetic founding lineages of a population or species","220974978":"Efficient In-Network Processing Through Local Ad-Hoc Information Coalescence","13325924":"Frequency distributions in population genetics parallel those in statistical physics","44651545":"Properties of Consensus Methods for Inferring Species Trees from Gene Trees","7238362":"Fast \"coalescent\" simulation","1898152":"Exchangeable partitions derived from Markovian coalescents with simultaneous multiple collisions","267167067":"Probability and real trees. Ecole d’Eté de Probabilités de Saint-Flour XXXV – 2005. Lecture given at the Saint-Flour probability summer school, July 6–23, 2005","41425088":"Incomplete Lineage Sorting: Consistent Phylogeny Estimation from Multiple Loci","265367917":"Interparticle Correlation in Death Processes with Application to Variability in Compartmental Models","247819386":"Introductory comments on major papers by Professor Motoo Kimura","273579761":"Genealogical histories in structured populations","2450149":"Probability Distributions on Cladograms","2534114":"The Coalescent Process in a Population with Stochastically Varying Size","259698111":"Theory and applications of a deterministic approximation to the coalescent model","14230036":"Statistical properties of a DNA sample under the finite-sites model","13667840":"Segregating Sites in Wright\u0027s Island Model","19913726":"The coalescent in two partially isolated difusion populations","271505144":"PNAS-2014-Goss-8791-6","233967397":"Path-properties of the tree-valued Fleming-Viot process","14529030":"The Evolution of Human Populations: A Molecular Perspective","23158659":"Experimental Estimation of Mutation Rates in a Wheat Population With a Gene Genealogy Approach","234150675":"Molecular Evidence for Natural Selection","24253336":"A coalescent dual process in a Moran model with genic selection","8636008":"A simple method for computing exact probabilities of mutation numbers","272561872":"Gamma-Dirichlet algebra and applications","221965269":"Inferring Species Trees Directly from Biallelic Genetic Markers: Bypassing Gene Trees in a Full Coalescent Analysis","2168532":"Does the Red Queen Reign in the Kingdom of Digital Organisms?","230623049":"A Characterization of the Set of Species Trees that Produce Anomalous Ranked Gene Trees","45908037":"Diffusion processes and coalescent trees","38322505":"The Concept of Duality and Applications to Markov Processes Arising in Neutral Population Genetics Models","226785926":"Practical Implications of Coalescent Theory","10831777":"Wilson, G. A. \u0026 Rannala, B. Bayesian inference of recent migration rates using multilocus genotypes. Genetics 163, 1177-1191","12531642":"Identity by descent genome segmentation based on single nucleotide polymorphism distributions.","282568656":"The additive genetic variance and evolvability of multivariate traits can be increased by epistatic gene action","248278468":"Using Phylogenetic Trees to Study Speciation and Extinction","236527889":"Preliminary evaluation of a high-g shock miniature AT strip resonator","11103143":"Mathematical consequences of the genealogical species concept. Evol Int J Org Evol","23444074":"Inbreeding coefficients and coalescence times (Reprinted)","262051980":"A Bayesian Approach to Inferring the Phylogenetic Structure of Communities from Metagenomic Data","277101463":"Neutral non-equilibrium population genetics","13459417":"Persistence of neutral polymorphisms in Lake Victoria cichlids","225052287":"Multiple merger gene genealogies in two species: Monophyly, paraphyly, and polyphyly for two examples of Lambda coalescents","24273508":"Davison D, Pritchard JK, Coop G. An approximate likelihood for genetic data under a model with recombination and population splitting. Theor Popul Biol 75: 331-345","258169973":"Fast algorithms and heuristics for phylogenomics under ILS and hybridization","12485540":"Ancestral Processes in Population Genetics—the Coalescent","236692742":"Computational Inference Methods for Selective Sweeps Arising in Acute HIV Infection","236692741":"Asymptotic Distributions of Coalescence Times and Ancestral Lineage Numbers for Populations with Temporally Varying Size","11020169":"A statistical test for the difference in the amounts of DNA variation between two populations","38322538":"Deterministic and Stochastic Models for Coalescence (Aggregation and Coagulation): A Review of the Mean-Field Theory for Probabilists","8523680":"Ancient DNA: Would the Real Neandertal Please Stand up?","43980210":"Molecular markers, analysis and the population genetics of parasites","226006615":"Asymptotic line-of-descent distributions","264955121":"Consistent Ordered Sampling Distributions: Characterization and Convergence","230024843":"Population Genetic Aspects of Gametophytic Self incompatibility","12756867":"Conditional Genealogies and the Age of a Neutral Mutant","49705394":"Experiments with the Site Frequency Spectrum","224541221":"Molecular Population Genetics: Coalescent Methods Based on Summary Statistics","222454282":"Population dynamics coded in DNA: Genetic traces of the expansion of modern humans","11505637":"Prospects for Association-Based Fine Mapping of a Susceptibility Gene for a Complex Disease","24409656":"INDELible: A Flexible Simulator of Biological Sequence Evolution","287250003":"The non-equilibrium allele frequency spectrum in a Poisson random field framework","11333629":"Genetic Evidence on the Demography of Speciation in Allopatric Dolphin Species","11333630":"Genetic Effective Size of a Wild Primate Population: Influence of Current and Historical Demography","2103156":"Iterating random functions on a finite set","38361375":"Diffusive Clustering in the Two Dimensional Voter Model","6393655":"Estimating the Number of Ancestral Lineages Using a Maximum-Likelihood Method Based on Rejection Sampling","222478875":"Evolution of Coalescence Times, Genetic Diversity and Structure during Colonization","228792062":"Branching Processes in Biology","227662542":"Predicting nuclear gene coalescence from mitochondrial DNA data: the three-times rule","14206906":"Estimation in an Island Model Using Simulation","24282646":"Site frequency spectra from genomic SNP surveys","14206911":"Measures of Variation at DNA Repeat Loci under a General Stepwise Mutation Model","9084909":"Garrigan D, Hedrick PW. Perspective: Detecting adaptive molecular polymorphism: Lessons from the MHC. Evolution 57: 1707-1722","51850352":"The evolution of HIV: Inferences using phylogenetics","51973235":"A Simple Method for Finding Explicit Analytic Transition Densities of Diffusion Processes with General Diploid Selection","6274869":"Estimating the number of founder lineages from haplotypes of closely linked SNPs","222337581":"The asymptotic behavior of an urn model arising in population genetics","240241982":"Simulating Probability Distributions in the Coalescent","263237825":"Identifiability of the unrooted species tree topology under the coalescent model with time-reversible substitution processes","13240248":"Inbreeding of bottlenecked butterfly populations: Estimation using the likelihood of changes in marker allele frequencies","11743169":"Gene genealogies in a metapopulation","226716405":"Phylogeography of the calanoid copepods Calanus helgolandicus and C. euxinus suggests Pleistocene divergences between Atlantic, Mediterranean, and Black Sea populations","38339903":"Genealogical processes for Fleming-Viot models with selection and recombination","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","7782155":"Tree measures and the number of segregating sites in time-structured population samples","255955004":"Factors Influencing Ascertainment Bias of Microsatellite Allele Sizes: Impact on Estimates of Mutation Rates","10652637":"Maximum-likelihood and Markov Chain Monte Carlo approaches to estimate inbreeding and effective size from allele frequency changes","227223284":"The tree length of an evolving coalescent","24169200":"Analysis of market weights under volatility-stabilized market models","12524351":"Times on Trees, and the Age of an Allele","14378842":"Coalescents and Genealogical Structure Under Neutrality","227339790":"Phylogeographic studies in plants: problems and prospects. Mol Ecol 7:465-474","230913601":"On the genealogy of populations: Trees, branches and offspring","14392152":"The Sampling Theory of Neutral Alleles in an Island Population of Fluctuating Size","289373884":"Effects of Genetic Recombination and Population Subdivision on Nucleotide Sequence Variation in Drosophila ananassae","227170825":"Part I: Ancestral Inference in Population Genetics","21391055":"Inbreeding coefficients and coalescent times","245582122":"Baysian inference of recent migration rates using multilocus genotypes. Genetics","11005738":"A note on distributions of times to coalescence, under time-dependent population size","282130271":"Pyvolve: A Flexible Python Module for Simulating Sequences along Phylogenies","238691755":"Probability and Real Trees","51885190":"Computational Techniques for Human Genome Resequencing Using Mated Gapped Reads","262383665":"Genome-Wide Inference of Ancestral Recombination Graphs","11649826":"The Discovery of Single-Nucleotide Polymorphisms—and Inferences about Human Demographic History","224760561":"Randomized Sequential Algorithms for Data Aggregation in Sensor Networks","21177045":"Phylogenetically informative length polymorphism and sequence variability in mitochondrial DNA of Australian Songbirds (Pomatostomus)","24351466":"Duality, ancestral and diffusion processes in models with selection","243092959":"Fleming–Viot Processes in Population Genetics","281312102":"There are no caterpillars in a wicked forest","265531511":"Random models. Applications to engineering and the life sciences","51353769":"The Expected Number of Alleles in a Gene Conversion Model with Mutation","7944159":"Gene tree distributions under the coalescent process","51865789":"The joint allele frequency spectrum of multiple populations: A coalescent theory approach","11316999":"The Effect of Migration During the Divergence","14479223":"Kimmel, M., Chakraborty, R., Stivers, D. N. \u0026 Deka, R. Dynamics of repeat polymorphisms under a forward-backward mutation model: within- and between-population variability at microsatellite loci. Genetics 143, 549-555","50807978":"Analytical results on the neutral non-equilibrium allele frequency spectrum based on diffusion theory","8995646":"Fine-Scale Mapping of Disease Genes with Multiple Mutations via Spatial Clustering Techniques","23279322":"Some Rare Indo-Pacific Coral Species Are Probable Hybrids","271761295":"Maximum-Likelihood Estimation of Population Divergence Times and Population Phylogeny in Models without Mutation","19591828":"An attempt to estimate the effective size of the ancestral species common to two extant species from which homologous genes are sequenced","272359300":"Absorption Time and Tree Length of the Kingman Coalescent and the Gumbel Distribution","13634320":"Inference of Population History Using a Likelihood Approach","227182159":"Diffusive clustering in an infinite system of hierarchically interacting diffusions","12200816":"Allele age and a test for selection on rare alleles","226924107":"On the long term behavior of some finite particle systems","221051618":"Using Neural Nets to Estimate Evolutionary Parameters.","233529892":"How large was the founding population of Darwins finches? Proc","225799848":"Dual processes in population genetics","46053725":"Value of probabilities of gene origin to measure the genetic variability in a population","14667578":"Association Affairs The Myth of Eve: Molecular Biology and Human Origins: F. J. Ayala","13996861":"Phylogenies and the origin of species","13603619":"Probability of a Segregating Pattern in a Sample of DNA Sequences","21258935":"Two chromosomes with multigene families","257810601":"Mathematics, genetics and evolution","232932884":"An explicit transition density expansion for a multi-allelic Wright-Fisher diffusion with general diploid selection","10681172":"Hey, J. \u0026 Machado, C.A. The study of structured populations-new hope for a difficult and divided science. Nat. Rev. Genet. 4, 535-543","221668033":"A polynomial time algorithm for calculating the probability of a ranked\ngene tree given a species tree","228017773":"Coalescent Theory","224836253":"Deep Phylogeny and Character Evolution in Thecostraca (Crustacea: Maxillopoda)","12524355":"The Number of Lines of Descent and Fixation Probabilities of Alleles in the Pure Genetic Drift Process: Analytical Approximations","45283663":"Identifying the Rooted Species Tree from the Distribution of Unrooted Gene Trees under the Coalescent","19549909":"The sampling theory of neutral alleles and an urn model in population genetics, J. Math. Biol. 25, 123-159"},"index":230}