{"abs":"Ease and accuracy of typing, together with high levels of polymorphism and widespread distribution in the genome, make microsatellite (or short tandem repeat) loci an attractive potential source of information about both population histories and evolutionary processes. However, microsatellite data are difficult to interpret, in particular because of the frequency of back-mutations. Stochastic models for the underlying genetic processes can be specified, but in the past they have been too complicated for direct analysis. Recent developments in stochastic simulation methodology now allow direct inference about both historical events, such as genealogical coalescence times, and evolutionary parameters, such as mutation rates. A feature of the Markov chain Monte Carlo (MCMC) algorithm that we propose here is that the likelihood computations are simplified by treating the (unknown) ancestral allelic states as auxiliary parameters. We illustrate the algorithm by analyzing microsatellite samples simulated under the model. Our results suggest that a single microsatellite usually does not provide enough information for useful inferences, but that several completely linked microsatellites can be informative about some aspects of genealogical history and evolutionary processes. We also reanalyze data from a previously published human Y chromosome microsatellite study, finding evidence for an effective population size for human Y chromosomes in the low thousands and a recent time since their most recent common ancestor: the 95% interval runs from approximately 15, 000 to 130,000 years, with most likely values around 30,000 years.","title":"Genealogical Inference From Microsatellite Data","id":13559565,"url":"https://www.researchgate.net/publication/13559565_Genealogical_Inference_From_Microsatellite_Data","names":["Ian J Wilson","D J Balding","Genetics"],"references":{"238282419":"A gene tree for β-globin sequences from Melanesia","14378842":"Coalescents and Genealogical Structure Under Neutrality","14060756":"Estimating Y Chromosome Specific Microsatellite Mutation Frequencies using Deep Rooting Pedigrees","15699884":"Estimating Effective Population Size and Mutation Rate From Sequence Data Using Metropolis-Hastings Sampling","14156574":"Hammer, M.F. et al. The geographic distribution of human Y chromosome variation. Genetics 145, 787−805","15292654":"Molecular and population genetic analysis of allelic sequence diversity at the human β-globin locus","15722472":"Hammer MF. A recent common ancestry for human Y chromosomes. Nature 378: 376-380","21868509":"Estimating Effective Population-Size from Samples of Sequences - a Bootstrap Monte-Carlo Integration Method","19827130":"Slipped-Strand Mispairing: A Major Mechanism for DNA Sequence Evolution","14745524":"Valdes AM, Slatkin M, Freimer NB.. Allele frequencies at microsatellite loci: the stepwise mutation model revisited. Genetics 133: 737-749","51331611":"Heterogeneity of microsatellite mutations within and between loci, and implications for human demographic history","14850422":"VNTR allele frequency distributions under the stepwise mutation model: A computer simulation approach. Genetics 139: 157-162","14233793":"Dispersion of human Y chromosome haplotypes based on five microsatellites in global populations","15909992":"Evolutionary Trees from DNA Sequences: A Maximum Likelihood Approach","14311367":"Statistical properties of the variation at linked microsatellite loci: Implications for the history of human Y chromosomes","14141577":"A gene tree for beta-globin sequences from Melanesia.","247406624":"Revealed by Y-chromosomal DNA analysis","14293882":"Geographic clustering of human Y‐chromosome haplotypes","14796802":"Mutation of short tandem repeats","15527631":"Rubinsztein, D.C. et al. Microsatellite evolution-evidence for directionality and variation in rate between species. Nature Genet. 10, 337-343","15038977":"Mutational processes of simple-sequence repeat loci in human populations. Proc Nat Acad Sci USA","14284149":"Network analysis of human Y microsatellite haplotypes","14140218":"Inferring Coalescence Times From DNA Sequence Data","14002660":"Importance of ancestral DNA ages","14378728":"Interpreting Genetic Variability: The Effects of Shared Evolutionary History","223115706":"The Coalescent","23444060":"Ohta T, Kimura M. Model of mutation appropriate to estimate number of electrophoretically detectable alleles in a finite population. Genet Res 22: 201-204","14040812":"A likelihood approach to microsatellite population samples","14068717":"Genetic relationship of Asians and Northern Europeans, revealed by Y chromosomal DNA analysis","15529617":"Slippery DNA runs on and on. …","15492819":"A Measure of Population Subdivision Based on Microsatellite Allele Frequencies","200102162":"Gene Genealogies and the Coalescent Process"},"citedIn":{"11250347":"Mitochondrial DNA and the Origins of the Domestic Horse","23997804":"Nielsen R, Beaumont MA. Statistical inferences in phylogeography. Mol Ecol 18: 1034-1047","7656562":"Predicting Functional Gene Links from Phylogenetic-Statistical Analyses of Whole Genomes","7696498":"Wang JL. Estimation of effective population sizes from data on genetic markers. Philos Trans R Soc Lond B 360: 1395-1409","227070336":"Tools and Recent Progress in Studying Gene Flow and Population Genetics of the Bemisia tabaci Sibling Species Group","262805411":"Epidemic reconstruction in a phylogenetics framework: transmission trees as partitions","6718583":"Y-Chromosomal variation in the Czech Republic.","248529093":"Mammalian population genetics: why not Y? Trends Ecol","11293369":"Y Chromosome Evidence for Anglo-Saxon Mass Migration","49849581":"Sex-Biased Dispersal and Volcanic Activities Shaped Phylogeographic Patterns of Extant Orangutans (genus: Pongo)","267371507":"Isolation with Migration Models for more than Two Species: Discerning the Demographic Evolutionary History of Chimpanzees","37441572":"Reconstructing phylogenies from gene-content and gene","7094862":"Bayesian Analysis of Correlated Evolution of Discrete Characters by Reversible‐Jump Markov Chain Monte Carlo","11786903":"Mutations as missing data: Inferences on the ages and distributions of nonsynonymous and synonymous mutations","8469673":"Multilocus Methods for Estimating Population Sizes, Migration Rates and Divergence Time, With Applications to the Divergence of Drosophila pseudoobscura and D. persimilis","228018110":"Modeling human genetic history","6243441":"A Worldwide Phylogeography for the Human X Chromosome","44608152":"Topologies of the Conditional Ancestral Trees and Full-Likelihood-Based Inference in the General Coalescent Tree Framework","34552372":"Phylogenetic tree construction using markov chain monte carlo /","23974226":"Approximate Bayesian Computation Without Summary Statistics: The Case of Admixture","6811686":"Marjoram P, Tavaré S. Modern computational approaches for analysing molecular genetic variation data. Nat Rev Genet 7: 759-770","12457723":"Thomson R, Pritchard JK, Shen P, Oefner PJ, Feldman MW. Recent common ancestry of human Y chromosomes: evidence from DNA sequence data. Proc Natl Acad Sci USA 97: 7360-7365","12150524":"Provan JW, Powell W, Hollingsworth PM. Chloroplast microsatellites: new tools for studies in plant ecology and evolution. Trends Ecol Evol 16: 142-147","239581185":"Report From Social to Genetic Structures in Central Asia","251407546":"Population Genetics: Aspects of Biodiversity","24203579":"Molecular evidence for recent founder populations and man-mediated migration in the barley scald pathogen Rhynchosporium secalis","7617082":"Likelihoods From Summary Statistics: Recent Divergence Between Species","7932456":"Bayesian Coestimation of Phylogeny and Sequence Alignment","39296514":"Variabilidad genética de Pinus nigra subsp. salzmannii en la Región de Murcia mediante microsatélites","12344554":"The age of a unique event polymorphism","8889041":"Vlax Roma history: What do coalescent-based methods tell us?","50347864":"Joint Inference of Microsatellite Mutation Models, Population History and Genealogies Using Transdimensional Markov Chain Monte Carlo","11052787":"Genetic Evidence for Long-Term Population Decline in a Savannah-Dwelling Primate: Inferences from a Hierarchical Bayesian Model","50347868":"Inferring Population Decline and Expansion From Microsatellite Data: A Simulation-Based Evaluation of the Msvar Method","11465969":"Y-Chromosomal DNA variation in Pakistan","5463052":"The Impact of the Austronesian Expansion: Evidence from mtDNA and Y Chromosome Diversity in the Admiralty Islands of Melanesia","267401105":"Importance sampling on the coalescent with recombination","237517389":"Mathematics and Informatics in Evolution and Phylogeny","8344077":"A Phylogenetic Mixture Model for Detecting Pattern-Heterogeneity in Gene Sequence or Character-State Data","228417007":"Algorithmen und Modelle der Bioinformatik","277708025":"Markov Chain Monte Carlo (MCMC)Based in part on the article “Markov chain Monte Carlo (MCMC)” by Galin L. Jones and James P. Hobert, which appeared in the Encyclopedia of Environmetrics .","7846400":"Influence of Mutational and Sampling Factors on the Estimation of Demographic Parameters in a \"Continuous\" Population Under Isolation by Distance","266332583":"Ancestral Inference in Molecular Biology","252724073":"Stochastic models for the evolution of stem cells in colon crypts","283873425":"On the use of kernel approximate Bayesian computation to infer population history","40036894":"Inferring Past Demography Using Spatially Explicit Population Genetic Models","227201801":"Beyond FST: Analysis of population genetic data for conservation","11886642":"Estimation of Admixture Proportions: A Likelihood-Based Approach Using Markov Chain Monte Carlo","6504676":"Hey J, Nielsen R.. Integration within the Felsenstein equation for improved Markov chain Monte Carlo methods in population genetics. Proc Natl Acad Sci USA 104: 2785-2790","40442619":"Isolation with Migration Models for More Than Two Populations","12746838":"Inferring the Historical Patterns of Biological Evolution","261772559":"Storytelling and story testing in domestication","41011943":"In defence of model-based inference in phylogeography","12483625":"Detecting bottlenecks and selective sweeps from DNA sequence polymorphism","9065501":"Patterns of Human Genetic Diversity: Implications for Human Evolutionary History and Disease. Ann Rev Genomics Hum Genet 4:293-340","44672062":"Reconstruction of the Late Pleistocene human skull from Hofmeyr, South Africa","4752593":"Inference in Molecular Population Genetics","10894396":"The Genetic Legacy of the Mongols","229816617":"Demographic Influences on Bacterial Population Structure","51071383":"On the size distribution of private microsatellite alleles","12814943":"Y-chromosome-specific microsatellite mutation rates re-examined using a minisatellite, MSY1.","24400853":"Genetic Admixture History of Eastern Indonesia as Revealed by Y-Chromosome and Mitochondrial DNA Analysis","225285582":"Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities - Discussion","263237909":"Bayesian Inference of Sampled Ancestor Trees for Epidemiology and Fossil Calibration","279704589":"High levels of genetic diversity in a long-term European glacial refugium of Pinus sylvestris L.","225285578":"Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities - Discussion","11236353":"A Genetic Landscape Reshaped by Recent Events: Y-Chromosomal Insights into Central Asia","38083310":"Bayesian Inference of Species Trees from Multilocus Data","11664896":"Genetic evidence for adaptation of Drosophila melanogaster along a microclimatic contrast in ‘Evolution Canyon’, Israel","8660534":"Beaumont, M. A. Recent developments in genetic data analysis: what can they tell us about human demographic history? Heredity 92, 365-379","11869190":"Haploid chromosomes in molecular ecology: lessons from the human Y.","266595159":"On composite likelihood in statistical genetics","8077516":"Excoffier L, Estoup A, Cornuet JM.. Bayesian analysis of an admixture model with mutations and arbitraily linked markers. Genetics 169: 1727-1738","282237034":"Story telling and store testing in domestication","33496387":"Variabilità genetica del cromosoma Y in Sardegna: implicazioni negli studi di associazione sulle malattie multifattoriali.","233901900":"Bayesian Selection of Nucleotide Substitution Models and Their Site Assignments","248399472":"Bayesian analysis of species relationship in genus Sargassum: Oman Sea and Persian Gulf","38058235":"ABC: A useful Bayesian tool for the analysis of population data","12175482":"High-resolution Y chromosome haplotypes of Israeli and Palestinian Arabs reveal geographic substructure and substantial overlap with haplotypes of Jews","23412140":"Heled J, Drummond AJ.. Bayesian inference of population size history from multiple loci. BMC Evol Biol 8: 289","11180643":"Estoup A, Jarne P, Cornuet JM. Homoplasy and mutation model at microstallite loci and their consequences for population genetics analysis. Mol Ecol 11: 1591-1604","12781071":"Markov Chain Monte Carlo analysis of human Y-chromosome microsatellites provides evidence of biased mutation","27244880":"Recent Male-Mediated Gene Flow over a Linguistic Barrier in Iberia, Suggested by Analysis of a Y-Chromosomal DNA Polymorphism","12696590":"Population growth of human Y chromosomes: A study of Y chromosome microsatellites","11788412":"Perfect Simulation from Population Genetic Models with Selection","8999001":"Baker DA, Loxdale HD, Edwards OR. Genetic variation and founder effects in the parasitoid wasp, Diaeretiella rapae (M’intosh) (Hymenoptera: Braconidae: Aphidiidae), affecting its potential as a biological control agent. Mol Ecol 12: 3303-3311","7851687":"Stepwise mutation likelihood computation by sequential importance sampling in subdivided population models","46587412":"The Time Machine: A Simulation Approach for Stochastic Trees","5657733":"Neuenschwander S, Largiadèr CR, Ray N, Currat M, Vonlanthen P, Excoffier L.. Colonization history of the Swiss Rhine basin by the bullhead (Cottus gobio): inference under a Bayesian spatially explicit framework. Mol Ecol 17: 757-772","4771483":"Wilson IJ, Weale ME, Balding DJ. Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities. J Roy Stat Soc Ser A 166: 155-188","8070307":"Using molecular markers with high mutation rates to obtain estimates of relative population size and to distinguish the effects of gene flow and mutation: A demonstration using data from endemic Mauritian skinks","24278446":"J1-M267 Y lineage marks climate-driven pre-historical human displacements","8070310":"Beerli P. Effect of unsampled populations on the estimation of population sizes and migration rates between sampled populations. Mol Ecol 13: 827-836","7978660":"High frequencies of Y chromosome lineages characterized by E3b1, DYS19-11, DYS392-12 in Somali males","221313489":"Bayesian Phylogenetic Inference under a Statistical Insertion-Deletion Model","8636006":"Brownian models and coalescent structures","7598742":"A newly discovered founder population: The Roma/Gypsies","12860451":"Fu, Y.-X. \u0026 Li, W.-H. Coalescing into the 21st century: an overview and prospects of coalescent theory. Theor. Popul. Biol. 56, 1-10","269792510":"Networking and Bayesian analyses of genetic affinity in cotton germplasm","11577948":"Estoup A, Wilson IJ, Sullivan C, Cornuet J-M, Moritz C. Inferring population history from microsatellite and enzyme data in serially introduced cane toads, Bufo marinus. Genetics 159: 1671-1687","9003621":"Niell, B. L., Long, J. C., Rennert, G. \u0026 Gruber, S. B. Genetic anthropology of the colorectal cancer-susceptibility allele APC I1307K: evidence of genetic drift within the Ashkenazim. Am. J. Hum. Genet. 73, 1250-1260","268328208":"Statistical inference in population genetics using microsatellites","11650627":"Lessios HA, Garrido MJ, Kessing BD. Demographic history of Diadema antillarum, a keystone herbivore on Caribbean reefs. Proc Biol Sci 268: 2347-2353","11627078":"Estimating Recombination Rates from Population Genetic Data","7441547":"Dual origins of the Japanese: Common ground for hunter-gatherer and farmer Y chromosomes","247920581":"The Inversion Distance Problem","8247160":"Y Chromosome and Mitochondrial DNA Variation in Lithuanians","227603094":"Haploid chromosomes in molecular ecology: Lessons from the human Y","266090196":"GENOMIC, REGULATORY AND FUNCTIONAL DYNAMICS OF THE DUPLICATION PROCESS","8417162":"Hwang, D. G. \u0026 Green, P. Bayesian Markov chain Monte Carlo sequence analysis reveals varying neutral substitution patterns in mammalian evolution. Proc. Natl Acad. Sci. USA 101, 13994-14001","235737862":"Characterisation and cross-species utility of microsatellite markers within kangaroos, wallabies and rat kangaroos (Macropodoidea : Marsupialia)","12720591":"Detecting Population Expansion and Decline Using Microsatellites","10603439":"Bayes Estimation of Species Divergence Times and Ancestral Population Sizes Using DNA Sequences From Multiple Loci","7510396":"Inference on microsatellite mutation processes in the invasive mite, Varroa destructor, using reversible jump Markov chain Monte Carlo","229684414":"Conservation Genetics","9033094":"Excavating Y-Chromosome Haplotype Strata in Anatolia","51558402":"Guided Tree Topology Proposals for Bayesian Phylogenetic Inference","8389009":"Mutation History of the Roma/Gypsies","228372107":"Divergence with Gene Flow: Models and Data","12258723":"Correction: Melanesian origin of Polynesian Y chromosomes","241217404":"Pearse D, Crandall KA. Beyond FST: Analysis of population genetic data for conservation. Conserv Genet 5: 585-602","7454573":"Bayesian inference of evolutionary history from chloroplast microsatellites in the cosmopolitan weed Capsella bursa-pastoris (Brassicaceae). Mol Ecol","40029565":"Importance sampling and the two-locus model with subdivided population structure","6277503":"Y chromosome variation in Europe: Continental and local processes in the formation of the extant gene pool","258846284":"Infra-specific genetic and morphological diversity in Linum album (Linaceae)","11554194":"Y Chromosomal evidence for the origins of Oceanic-speaking peoples","41397586":"An examination of genetic diversity and effective population size in Atlantic salmon","38349665":"Importance sampling on coalescent histories. I","8779695":"Lucchini V, Galov A, Randi E.. Evidence of genetic distinction and long-term population decline in wolves (Canis lupus) in the Italian Apennines. Mol Ecol 13: 523-536","258119241":"p class\u003d\"HeadingRunIn\"\u003e Genetic structure of Ipomoea imperati (Convolvulaceae) in the Mediterranean region and implications for its conservation \u003c/p","50998821":"Kim, S. H., Kim, K. C., Shin, D. J., Jin, H. J., Kwak, K. D., Han, M. S. et al. High frequencies of Y-chromosome haplogroup O2b-SRY465 lineages in Korea: a genetic perspective on the peopling of Korea. Investig. Genet. 2, 10","8505777":"A Predominantly Neolithic Origin for Y-Chromosomal DNA Variation in North Africa","51373117":"Detection of novel Y SNPs provides further insights into Y chromosomal variation in Pakistan","6591312":"The evolutionary history of the common chloroplast genome of Arabidopsis thaliana and A. suecica","5899118":"On the Genealogy of a Duplicated Microsatellite","51206715":"Semerikov VL, Lascoux M. Nuclear and cytoplasmic variation within and between Eurasian Larix (Pinaceae) species. Am J Bot 90: 1113-1123","272185091":"Statistical Inference on Genetic Data Reveals the Complex Demographic History of Human Populations in Central Asia","6673758":"Microsatellite evolution: Markov transition functions for a suite of models","6648667":"Inference of Bacterial Microevolution Using Multilocus Sequence Data","8070969":"Hey J, Won Y-J, Sivasundar A, Nielsen R, Markert JA. Using nuclear haplotypes with microsatellites to study gene flow between recently separated Cichlid species. Mol Ecol 13: 909-919","271138668":"Evolutionary history and global spread of the Mycobacterium tuberculosis Beijing lineage","45096951":"The Number of Alleles at a Microsatellite Defines the Allele Frequency Spectrum and Facilitates Fast Accurate Estimation of","270966126":"Y-chromosome descent clusters and male differential reproductive success: Young lineage expansions dominate Asian pastoral nomadic populations","10821612":"Estoup A, Clegg SM. Bayesian inferences on the recent island colonization history by the bird Zosterops lateralis lateralis. Mol Ecol 12: 657-674","11240421":"Human Migrations and Population Structure: What We Know and Why it Matters","10903541":"Marshall HD, Newton C, Ritland K. Chloroplast phylogeography and evolution of highly polymorphic microsatellite in lodgepole pine (Pinus contorta). Theor Appl Genet 104: 367-378","4993311":"Stopping-time resampling for sequential Monte Carlo methods","7097145":"Relaxed Phylogenetics and Dating with Confidence","6393655":"Estimating the Number of Ancestral Lineages Using a Maximum-Likelihood Method Based on Rejection Sampling","281043352":"Genetic analysis of complex demographic scenarios: Spatially expanding populations of the cane toad, Bufo marinus","23685680":"Characterization of Demographic Expansions From Pairwise Comparisons of Linked Microsatellite Haplotypes","260607190":"Gene Conversion Violates the Stepwise Mutation Model for Microsatellites in Y-Chromosomal Palindromic Repeats","23784500":"Heller RE, Lorenzen D, Okello JBA, Masembe C, Siegismund HR.. Mid-Holocene decline in African buffalos inferred from Bayesian coalescent-based analyses of microsatellites and mitochondrial DNA. Mol Ecol 17: 4845-4858","35245383":"Conservation genetics of Anatolian mouflon.","8573411":"Beaumont MA, Rannala B. The Bayesian revolution in genetics. Nat Rev Genet 5: 251-261","7625493":"Independent methods for evolutionary genetic dating provide insights into Y-chromosomal STR mutation rates confirming data from direct father-son transmissions","9084398":"Y-chromosomal DNA haplogroups and their implications for the dual origins of the Koreans","261772543":"Efficient Bayesian inference under the structured coalescent","8199963":"Estoup A, Beaumont M, Sennedot F, Moritz C, Cornuet J-M.. Genetic analysis of complex demographic scenarios: spatially expanding populations of the cane toad, Bufo marinus. Evolution 58: 2021-2036","10597831":"Linkage disequilibrium fine mapping of quantitative trait loci: a simulation study. Genet Sel Evol","8017181":"Genetic feature of Mongolian ethnic groups revealed by Y-chromosomal analysis","38093613":"Estimating Divergence Parameters With Small Samples From a Large Number of Loci","8138516":"Demographic estimates from Y chromosome microsatellite polymorphisms: Analysis of a worldwide sample","11549659":"Armenian Y chromosome haplotypes reveal strong regional structure within a single ethno-national group","270825302":"Trypanosoma rangeli displays a clonal population structure, revealing a subdivision of KP1(-) strains and the ancestry of the Amazonian group","282812329":"On the occurrence of false positives in tests of migration under an isolation-with-migration model","26740974":"PopABC: A program to infer historical demographic parameters","8677874":"Molecular Evolution of a Plastid Tandem Repeat Locus in an Orchid Lineage","6895902":"A note on the accuracy of PAC-likelihood inference with microsatellite data","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","23720465":"Accurate Computation of Likelihoods in the Coalescent with Recombination via Parsimony.","49670031":"The role of humans in the diversification of a threatened island raptor","6258467":"Fast and Accurate Estimation of the Population-Scaled Mutation Rate, , From Microsatellite Genotype Data","224355362":"Clock-constrained tree proposal operators in Bayesian phylogenetic inference","10652637":"Maximum-likelihood and Markov Chain Monte Carlo approaches to estimate inbreeding and effective size from allele frequency changes","12524351":"Times on Trees, and the Age of an Allele","227170825":"Part I: Ancestral Inference in Population Genetics","232249427":"Multilocus phylogeography of the Wedge-billed Woodcreeper Glyphorynchus spirurus (Ayes, Furnariidae) in lowland Amazonia: Widespread cryptic diversity and paraphyly reveal a complex diversification pattern","7996927":"Recent Origin and Cultural Reversion of a Hunter–Gatherer Group","12660039":"Nielsen, R. Estimation of population parameters and recombination rates from single nucleotide polymorphisms. Genetics 154, 931-942","10954538":"Approximate Bayesian Computation in Population Genetics","8182259":"Bayesian Estimation of Ancestral Character States on Phylogenies","5536198":"Reconstruction of Human Evolutionary Tree Using Polymorphic Autosomal Microsatellites","255660199":"Evaluation of proposal distributions on clock-constrained trees in Bayesian phylogenetic inference","6650878":"Extreme Patterns of Variance in Small Populations: Placing Limits on Human Y-Chromosome Diversity through Time in the Vanuatu Archipelago","12262695":"The effects of rate variation on ancestral inference in the coalescent","6643651":"A Markov Chain Monte Carlo Method for Estimating Population Mixing Using Y-chromosome Markers: Mixing of the Han People in China","234087001":"Approximate Bayesian computation via empirical likelihood","7058887":"Y-chromosome diversity in Sweden - A long-time perspective","228471347":"Robledo-Arnuncio JJ, Collada C, Alía R, Gil L. Genetic structure of montane isolates of Pinus sylvestris L. in a Mediterranean refugial area. J Biogeogr 32: 595-605","8967973":"The Evolution of Molecular Markers – Just a Matter of Fashion?","225218754":"Lopes JS, Boessenkool S. The use of approximate Bayesian computation in conservation genetics and its application in a case study on yellow-eyed penguins. Conserv Genet 11: 421-433","281195376":"Genetic structure of the Kuwaiti population revealed by paternal lineages","263938575":"Detecting past changes of effective population size","12101900":"Mutation rates at two human Y-chromosomal microsatellite loci using small pool PCR techniques","233998922":"Estimating trace-suspect match probabilities for singleton Y-STR haplotypes using coalescent theory","6313947":"The Evolutionary Forest Algorithm","11967240":"Zeisset I, Beebee TJC. Determination of biogeographical range: an application of molecular phylogeography to the European pool frog Rana lessonae. Proc R Soc Lond B Biol Sci 268: 933-938","11245930":"Estimating Mutation Parameters, Population History and Genealogy Simultaneously From Temporally Spaced Sequence Data","268428854":"Coalescent-based inference from DNA sequence data us- ing MCMC","228055134":"Coalescent Theory","10821486":"Maternal and Paternal Lineages of the Samaritan Isolate: Mutation Rates and Time to Most Recent Common Male Ancestor","12299639":"Messages through Bottlenecks: On the Combined Use of Slow and Fast Evolving Polymorphic Markers on the Human Y Chromosome","8388944":"Y chromosomal haplogroup J as a signature of the post-Neolithic colonization of Europe","6593412":"From Social to Genetic Structures in Central Asia","11450188":"Testing for Genetic Evidence of Population Expansion and Contraction: An Empirical Analysis of Microsatellite DNA Variation Using a Hierarchical Bayesian Model","11936084":"Distinguishing Migration From Isolation: A Markov Chain Monte Carlo Approach","12213593":"Independent Histories of Human Y Chromosomes from Melanesia and Australia","11936085":"Walsh B.. Estimating the time to the most recent common ancestor for the Y chromosome or mitochondrial DNA for a pair of individuals. Genetics 158: 897-912","11921232":"Stanhope, M. J., A. Lupas, M. J. Italia, K. K. Koretke, C. Volker, and J. R. Brown. Phylogenetic analyses do not support horizontal gene transfers from bacteria to vertebrates. Nature","6392708":"The Himalayas as a Directional Barrier to Gene Flow","11381061":"Genealogical Trees, Coalescent Theory and the Analysis of Genetic Polymorphisms","2581454":"Phylogenetic Tree Construction Using Markov Chain Monte Carlo","12929321":"Statistic analysis of microsatellite DNA data","38087093":"The key role of patrilineal inheritance in shaping the genetic variation of Dagestan highlanders","6472086":"The Stem Cell Population of the Human Colon Crypt: Analysis via Methylation Patterns","227128446":"Accounting for phylogenetic uncertainty in comparative studies of evolution and adaptation","11921231":"Major fungal lineages are derived from lichen symbiotic ancestors","23389337":"A highly polymorphic insertion in the Y-chromosome amelogenin gene can be used for evolutionary biology, population genetics and sexing in Cetacea and Artiodactyla","226361475":"Y-Chromosomal Rearrangements and Azoospermia"},"index":231}