{"abs":"We present in this paper a simple method for estimating the mutation rate per site per year which also yields an estimate of the length of a generation when mutation rate per site per generation is known. The estimator, which takes advantage of DNA polymorphisms in longitudinal samples, is unbiased under a number of population models, including population structure and variable population size over time. We apply the new method to a longitudinal sample of DNA sequences of the env gene of human immunodeficiency virus type 1 (HIV-1) from a single patient and obtain 1.62 x 10(-2) as the mutation rate per site per year for HIV-1. Using an independent data set to estimate the mutation rate per generation, we obtain 1.8 days as the length of a generation of HIV-1, which agrees well with recent estimates based on viral load data. Our estimate of generation time differs considerably from a recent estimate by Rodrigo et al. when the same mutation rate per site per generation is used. Some factors that may contribute to the difference among different estimators are discussed.","title":"Estimating Mutation Rate and Generation Time from Longitudinal Samples of DNA Sequences","id":12069318,"url":"https://www.researchgate.net/publication/12069318_Estimating_Mutation_Rate_and_Generation_Time_from_Longitudinal_Samples_of_DNA_Sequences","names":["YX Fu","Molecular Biology and Evolution"],"references":{"248443214":"A list of mutant genes in Arabidopsis thaliana (L.) Heynh., Radiat. Bot 1, 233-241","250113770":"Agronomic Comparisons among Wheat Lines Nearly Isogenic for Three Reduced-Height Genes1","14173851":"Evolutionary mechanism and population dynamics of the third variable envelope region of HIV within hosts","13237964":"Coalescent estimates of HIV-1 generation time in vivo","19709354":"Saitou N, Nei M.. The Neighbor-Joining Method-a New Method for Reconstructing Phylogenetic Trees. Mol Biol Evol 4: 406-425","12878914":"Peng, J. et al. \u0027Green Revolution\u0027 genes encode mutant gibberellin response modulators. Nature 400, 256-261","225167844":"Nuclear DNA Content of Some Important Plant Species","12711504":"Analysis of Flanking Sequences from Dissociation Insertion Lines: A Database for Reverse Genetics in Arabidopsis","10973748":"Mutations in wheat showing altered field resistance to yellow and brown rust. Genome","21033044":"Concurrent evolution of human immunodeficiency virus type 1 in patients infected from the same source: Rate of sequence change and low frequency of inactivating mutations","225419001":"Identification of a microsatellite on chromosome 6B and a STS on 7D of bread wheat showing association with preharvest sprouting tolerance","15273855":"New 18S-26S ribosomal RNA gene loci: Chromosomal landmarks for the evolution of polyploid wheats","12257325":"An efficient method for dispersing Ds elements in the barley genome as a tool for determining gene function. Plant J","15537530":"Movers and Shakers: maize transposons as tools for analyzing other plant genomes","21700947":"Activation of plant gene by T-DNA tagging: Auxin independent growth in vitro","21498322":"Naturally occurring mutations within HIV-1 V3 genomic RNA lead to antigenic variation dependent on a single amino acid substitution","239052708":"On the Genealogy of Large Populations","14643393":"The Mutator Transposable Element System of Maize","14601665":"HIV-1 Dynamics in Vivo: Virion Clearance Rate, Infected Cell Life-Span, and Viral Generation Time","12465057":"RFLP-based analysis of three RbcS subfamilies diploid and polyploid species of wheat","7116211":"ABA Levels and Sensitivity in Developing Wheat Embryos of Sprouting Resistant and Susceptible Cultivars","237488711":"Genetic Analysis of Pre-Harvest Sprouting Resistance in a Wheat × Spelt Cross","10907718":"Study of the relationship between pre-harvest sprouting and grain color by quantitative trait loci analysis in a white × red grain bread wheat cross. Theor Appl Genet","12795042":"Ac as a tool for the functional genomics of rice","15594702":"Causes of HIV diversity","248897200":"Genetic analysis of preharvest sprouting tolerance in three wheat crosses","229660632":"Ds elements on all five Arabidopsis chromosomes and assessment of their utility for transposon tagging","12518995":"Estimation of Synteny Conservation and Genome Compaction Between Pufferfish ( Fugu ) and Human","12555923":"Activation Tagging in Arabidopsis","16567312":"Evolutionary Relationship of DNA-Sequences in Finite Populations","14155385":"HIV-1: Gambling on the evolution of drug resistance?","43263973":"Giroux, M.J. \u0026 Morris, C.F. A glycine to serine change in puroindoline b is associated with wheat grain hardness and low levels of starch-surface friabilin. Theor. Appl. Genet. 95, 857-864","250116185":"Compensation Indices of Radiation-Induced Wheat-Agropyron elongatum Translocations Conferring Resistance to Leaf Rust and Stem Rust","15374168":"Hiv Population-Dynamics in-Vivo - Implications for Genetic-Variation, Pathogenesis, and Therapy","21560314":"Convergent and divergent sequence evolution in the surface envelope glycoprotein of human immunodeficiency virus type 1 within a single infected patient","6038120":"Transgenic Plants as Tools to Study the Molecular Organization of Plant Genes","237188123":"Stem-rust resistance in \u0027Canthatch\u0027 hexaploid wheat induced by a nonsuppressor mutation on chromosome 7DL","21234622":"Discontinuous sequence change of human immunodeficiency virus (HIV) type 1 env sequences in plasma viral and lymphocyte-associated proviral populations in vivo: Implications for models of HIV pathogenesis","12306817":"Transposition of maize Ac/Ds transposable elements in the yeast","250115667":"Induced Mutations of a Genetic Suppressor of Resistance to Wheat Stem Rust","14300065":"Forward Mutation Rate of Human Immunodeficiency Virus Type 1 in a T Lymphoid Cell Line*","14178789":"Host-specific driving force in human immunodeficiency virus type 1 evolution in vivo","221803909":"Abscisic Acid Biosynthesis and Response","31347171":"ABA insensitivity and low ABA levels during seed development of non-dormant wheat mutant","226438145":"Isolation of wheat mutants with increased resistance to powdery mildew from small induced variant populations","250116567":"Confirmation of Nonsuppressor Mutation of Stem Rust Resistance in ‘Canthatch’ Common Wheat"},"citedIn":{"24239601":"Robust Supervised and Unsupervised Statistical Learning for HIV Type 1 Coreceptor Usage Analysis","272763971":"Modeling Disease Evolution with Multilevel Selection: HIV as a Quasispecies Social Genome","51119886":"Combining contemporary and ancient DNA in population genetic and phylogeographic studies","260154947":"A Framework Including Recombination for Analyzing the Dynamics of Within-Host HIV Genetic Diversity","8493576":"A Robust Measure of HIV-1 Population Turnover within Chronically Infected Individuals","23392238":"Calculating expected DNA remnants from ancient founding events in human population genetics","221210661":"On the Embedding Capacity of DNA Strands under Substitution, Insertion, and Deletion Mutations","8485326":"Moderate mutation rate in the SARS coronavirus genome and its implications","10588720":"Inferring Evolutionary Rates Using Serially Sampled Sequences from Several Populations","6144268":"Development of drug resistance mutations in patients on highly active antiretroviral therapy: Does competitive advantage drive evolution","220263154":"Stochastic modelling of genotypic drug-resistance for human immunodeficiency virus towards long-term combination therapy optimization.","7384675":"Waiting times for the appearance of Cytotoxic T-lymphocyte escape mutants in chronic HIV-1 infection","7282683":"Proceedings of the SMBE Tri-National Young Investigators\u0027 Workshop 2005. Coalescent-based estimation of population parameters when the number of demes changes over time.","225290874":"Standing Genetic Variation and the Evolution of Drug Resistance in HIV","11091763":"Selection for Human Immunodeficiency Virus Type 1 Recombinants in a Patient with Rapid Progression to AIDS","9047696":"Widespread Adaptive Evolution in the Human Immunodeficiency Virus Type 1 Genome","259957667":"The Intra-Host Evolutionary and Population Dynamics of Human Immunodeficiency Virus Type 1: A Phylogenetic Perspective","10732862":"Adaptation in the env Gene of HIV-1 and Evolutionary Theories of Disease Progression","6528126":"Test of Genetical Isochronism for Longitudinal Samples of DNA Sequences","7461167":"Genetic evolution of HIV in patients remaining on a stable HAART regimen despite insufficient viral suppression","23445317":"Stochastic Modelling of Genotypic Drug-Resistance for Human Immunodeficiency Virus towards Long-Term Combination Therapy Optimisation","5937272":"Duffy S, Burch CL, Turner PE. Evolution of host specificity drives reproductive isolation among RNA viruses. Evolution 61: 2614-2622","1905278":"Simulating Genomes and Populations in the Mutation Space: An example with the evolution of HIV drug resistance","266264763":"Defining Differential Genetic Signatures in CXCR4- and the CCR5-Utilizing HIV-1 Co-Linear Sequences","220147319":"On Deriving an Equation of the Mutation Rate of the Hepatitis B Virus.","11381061":"Genealogical Trees, Coalescent Theory and the Analysis of Genetic Polymorphisms","8206994":"A Statistical Characterization of Consistent Patterns of Human Immunodeficiency Virus Evolution Within Infected Patients","41102018":"Distinct Hepatitis B Virus Dynamics in the Immunotolerant and Early Immunoclearance Phases","11395743":"Estimation of Effective Population Size of HIV-1 Within a Host: A Pseudomaximum-Likelihood Approach","10764498":"Estimating change rates of genetic markers using serial samples: Applications to the transposon IS6110 in Mycobacterium tuberculosis","222545781":"Measurably evolving populations","11627078":"Estimating Recombination Rates from Population Genetic Data","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","7322199":"Recombination Estimation Under Complex Evolutionary Models with the Coalescent Composite-Likelihood Method","7539658":"Stochastic Interplay between Mutation and Recombination during the Acquisition of Drug Resistance Mutations in Human Immunodeficiency Virus Type 1","271137043":"Genetic evolution of HIV in patients remaining on a stable HAART regimen despite insufficient viral suppression.","224150055":"On the Shannon capacity of DNA data embedding","8997234":"Estimating recombination rates from population-genetic data","7782155":"Tree measures and the number of segregating sites in time-structured population samples","251459522":"Short range order of MCM-41 and mesostructured aluminiumphosphate","38058235":"ABC: A useful Bayesian tool for the analysis of population data","48190880":"Capacity of DNA Data Embedding Under Substitution Mutations"},"index":232}