{"abs":"In reliability-based structural analysis and design optimization, there exist some limit state functions exhibiting disjoint failure domains, multiple design points and discontinuous responses. This study addresses this type of challenging problem of reliability assessment of structures with complex limit state functions based on the probability density evolution method (PDEM). Probability density function (PDF) of stochastic structures under static and dynamic loads can be acquired, which is independent of the specific form of limit state functions. Numerical results of several typical examples illustrate that, the time-invariant and instantaneous PDF curves and failure probabilities of stochastic structures with disjoint failure domains, multiple design points and discontinuous responses are calculated effectively and accurately. Moreover, the PDEM is validated to be more efficient than the Monte Carlo simulation and the subset simulation, and is a feasible and general approach to tackle the reliability analysis of complicated problems. In addition, the influence of random design parameters of structures on uncertainty propagation is also scrutinized.","title":"Reliability analysis of structures with complex limit state functions using probability density evolution method","id":267334762,"url":"https://www.researchgate.net/publication/267334762_Reliability_analysis_of_structures_with_complex_limit_state_functions_using_probability_density_evolution_method","names":["Dixiong Yang","Structural and Multidisciplinary Optimization"],"references":{"225827765":"Classification Approach for Reliability-Based Topology Optimization using Probabilistic Neural Networks","225599987":"A combined reliability analysis approach with dimension reduction method and maximum entropy method","267334699":"Stability Analysis and Convergence Control of Iterative Algorithms for Reliability Analysis and Design Optimization","226948489":"Chaos control of performance measure approach for evaluation of probabilistic constraints","250697441":"Convergence analysis of first order reliability method using chaos theory","222660503":"Moment methods for structural reliability[J]","251544490":"Advances of the probability density evolution method for nonlinear stochastic systems","226389792":"The Number Theoretical Method in Response Analysis of Nonlinear Stochastic Structures","275188793":"Asymptotic Approximations for Multinormal Integrals","223307920":"Multiple design points in first and second-order reliability","234541989":"Reliability-based Structural Design","265710665":"Applications of Number Theory to Numerical Analysis","222727526":"Limit state function identification using Support Vector Machines for discontinuous responses and disjoint failure domains","245301372":"Basic Analysis of Structural Safety","236660920":"Methods of Structural Safety","250697237":"Adaptive explicit decision functions for probabilistic design and optimization using support vector machines","268619621":"Stochastic Dynamics of Structures","227906748":"Dynamic response and reliability analysis of structures with uncertain parameters","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","273800443":"Second‐Order Reliability Approximations","222423661":"An improved response surface method for the determination of failure probability and importance measures","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","226004043":"Probability density evolution method for dynamic response analysis of structures with uncertain parameters","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","222672830":"Benchmark study on reliability estimation in higher dimensions of structural systems – An overview","225371733":"Controlling Structural Failure Modes During an Impact in the Presence of Uncertainties","238860930":"Chaos control for numerical instability of first order reliability method"},"citedIn":{"265732271":"Second-order reliability method-based inverse reliability analysis using Hessian update for accurate and efficient reliability-based design optimization"},"index":244}