{"abs":"A new multi-point univariate decomposition method is presented for structural reliability analysis involving multiple most probable points (MPPs). The method involves a novel function decomposition at all MPPs that facilitates local univariate approximations of a performance function in the rotated Gaussian space, Lagrange interpolation for univariate component functions and return mapping to the standard Gaussian space, and Monte Carlo simulation. In addition to the effort in identifying all MPPs, the computational effort in the multi-point univariate method can be viewed as performing deterministic response analysis at user-selected input defined by sample points. Compared with the existing multi-point FORM/SORM, the multi-point univariate method developed provides a higher-order approximation of the boundary of the failure domain. Both the point-fitted SORM and the univariate method entail linearly varying cost with respect to the number of variables. However, the univariate method with less than nine sample points requires fewer calculations of the performance function than the point-fitted SORM. Numerical results indicate that the proposed method consistently generates an accurate and computationally efficient estimate of the probability of failure.","title":"A multi-point univariate decomposition method for structural reliability analysis","id":222297911,"url":"https://www.researchgate.net/publication/222297911_A_multi-point_univariate_decomposition_method_for_structural_reliability_analysis","names":["D. Wei","Syarif Rahman","International Journal of Pressure Vessels and Piping"],"references":{"245285279":"Multiple Linearization Method for Nonlinear Reliability Analysis","228573534":"A univariate approximation at most probable point for higer-order reliability analysis","38367467":"Remarks on a multivariate transformation. Ann Math Stat","236660920":"Methods of Structural Safety","265794417":"Method of Structural Safety","231632137":"Practical approaches to construct RS-HDMR component functions. J Phys Chem A","273800443":"Second‐Order Reliability Approximations","222837988":"Decomposition methods for structural reliability analysis","222423661":"An improved response surface method for the determination of failure probability and importance measures","222165872":"Reliability analysis—A review and some perspectives","222553900":"Structural reliability analysis by univariate decomposition and numerical integration","222832250":"Xu, H.: A univariate dimension-reduction method for multi-dimensional integration in stochastic mechanics. Probabilitic Engineering Mechanics 19, 393-408","257391779":"Theorem and examples on high-dimensional model representation","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","223594022":"Ellingwood, B.R.: Directional methods for structural reliability analysis. Structural Safety 22, 233-49","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","38358705":"The Jackknife Estimate of Variance","263047733":"Structural Reliability Methods","258875766":"Dynamics Of Structures","222588317":"New light on first- and second-order reliability methods","227605578":"A generalized dimension‐reduction method for multidimensional integration in stochastic mechanics","222945716":"Optimization algorithms for structural reliability","226258786":"General Foundations of High Dimensional Model Representations","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{"258398774":"Spoke Model for Calculating Reliability Index and Safety Factor of Slopes","281609550":"Study of multiple plane combination approximate method for structural reliability analysis","251575124":"Probabilistic safety assessment of components","49847573":"Cytological, Immunohistochemical and Mutational Analysis of a Gastric Gastrointestinal Stromal Tumour in a Cat","271652654":"A novel stochastic collocation method for uncertainty propagation in complex mechanical systems"},"index":245}