{"abs":"Sampling from a lattice Gaussian distribution is emerging as an important problem in various areas such as coding and cryptography. The default sampling algorithm --- Klein\u0027s algorithm yields a distribution close to the lattice Gaussian only if the standard deviation is sufficiently large. In this paper, we propose the Markov chain Monte Carlo (MCMC) method for lattice Gaussian sampling when this condition is not satisfied. In particular, we present a sampling algorithm based on Gibbs sampling, which converges to the target lattice Gaussian distribution for any value of the standard deviation. To improve the convergence rate, a more efficient algorithm referred to as Gibbs-Klein sampling is proposed, which samples block by block using Klein\u0027s algorithm. We show that Gibbs-Klein sampling yields a distribution close to the target lattice Gaussian, under a less stringent condition than that of the original Klein algorithm.","title":"Markov Chain Monte Carlo Algorithms for Lattice Gaussian Sampling","id":262145463,"url":"https://www.researchgate.net/publication/262145463_Markov_Chain_Monte_Carlo_Algorithms_for_Lattice_Gaussian_Sampling","names":["Zheng Wang","Cong Ling","Guillaume Hanrot"],"references":{"236935678":"Decoding by Sampling - Part II: Derandomization and Soft-Output Decoding","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","2643278":"Finding the Closest Lattice Vector When It\u0027s Unusually Close","265555890":"Achieving AWGN Channel Capacity With Lattice Gaussian Coding","45903451":"Decoding by Sampling: A Randomized Lattice Algorithm for Bounded\nDistance Decoding","3232598":"Multidimensional constellations. II. Voronoi constellations","258106218":"Optimized Markov Chain Monte Carlo for Signal Detection in MIMO Systems: An Analysis of the Stationary Distribution and Mixing Time","232697207":"Semantically Secure Lattice Codes for the Gaussian Wiretap Channel","221591132":"On Lattices, Learning with Errors, Random Linear Codes, and Cryptography","220431624":"Regev, O.: On lattices, learning with errors, random linear codes, and cryptography. J. ACM 56(6)","215446267":"Monte Carlo Strategies in Scientic Computing","221354944":"An Efficient and Parallel Gaussian Sampler for Lattices","3318211":"Convergence analyses and comparisons of Markov chain Monte Carlo algorithms in digital communications","3319681":"Markov chain Monte Carlo algorithms for CDMA and MIMO communication systems","267441252":"Homomorphic Encryption from Learning with Errors: Conceptually-Simpler, Asymptotically-Faster, Attribute-Based","221591873":"Trapdoors for hard lattices and new cryptographic constructions","4109355":"Worst‐Case to Average‐Case Reductions Based on Gaussian Measures","225951520":"New bounds in some transference theorems in the geometry of numbers","237000311":"Classical Hardness of Learning with Errors","235702737":"Achieving the AWGN Channel Capacity With Lattice Gaussian Distribution","3078289":"Optimal nonuniform signaling for Gaussian channels"},"citedIn":{"271387838":"Independent Metropolis-Hastings-Klein Algorithm for Lattice Gaussian Sampling"},"index":248}