{"abs":"Bayesian estimation has played a pivotal role in the understanding of individual differences. However, for many models in psychology, Bayesian estimation of model parameters can be difficult. One reason for this difficulty is that conventional sampling algorithms, such as Markov chain Monte Carlo (MCMC), can be inefficient and impractical when little is known about the target distribution-particularly the target distribution\u0027s covariance structure. In this article, we highlight some reasons for this inefficiency and advocate the use of a population MCMC algorithm, called differential evolution Markov chain Monte Carlo (DE-MCMC), as a means of efficient proposal generation. We demonstrate in a simulation study that the performance of the DE-MCMC algorithm is unaffected by the correlation of the target distribution, whereas conventional MCMC performs substantially worse as the correlation increases. We then show that the DE-MCMC algorithm can be used to efficiently fit a hierarchical version of the linear ballistic accumulator model to response time data, which has proven to be a difficult task when conventional MCMC is used. (PsycINFO Database Record (c) 2013 APA, all rights reserved).","title":"A Method for Efficiently Sampling From Distributions With Correlated Dimensions","id":236640823,"url":"https://www.researchgate.net/publication/236640823_A_Method_for_Efficiently_Sampling_From_Distributions_With_Correlated_Dimensions","names":["Brandon M Turner","Per B Sederberg","Scott Brown","Mark Steyvers","Psychological Methods"],"references":{"235771533":"Likelihood-Free Bayesian Analysis of Memory Models","24063471":"A hierarchical Bayesian statistical framework for response time distributions","24061549":"Models for choice-reaction time","227301518":"Hierarchical Bayes Models for Response Time Data","51104646":"A Topographic Latent Source Model for fMRI Data","49458431":"A tutorial on adaptive MCMC","229307173":"Drawing conclusions from choice response time models: A tutorial using the linear ballistic accumulator","31123925":"Generalised Gibbs sampler and multigrid Monte Carlo for Bayesian computation","49815530":"Hierarchical Diffusion Models for Two-Choice Response Times","40449663":"A crossed random effects diffusion model for speeded semantic categorization decisions","256761434":"A tutorial on the Bayesian approach for analyzing structural equation models","227302679":"A Hierarchical Ornstein–Uhlenbeck Model for Continuous Repeated Measurement Data","51825972":"The Speed-Accuracy Tradeoff in the Elderly Brain: A Structural Model-Based Approach","26256436":"Modeling Life-Span Growth Curves of Cognition Using Longitudinal Data With Multiple Samples and Changing Scales of Measurement","227944755":"A Markov Chain Monte Carlo version of the genetic algorithm Differential Evolution: Easy Bayesian computing for real parameter spaces","284394198":"A Bayesian approach to diffusion process models of decision-making","6421574":"Application of the diffusion model to two-choice tasks for adults 75-90 years old","24187226":"Evaluating Cognitive Theory: A Joint Modeling Approach Using Responses and Response Times","7676894":"A hierarchical model for estimating response time distributions","2547085":"Was it a car or a cat I saw? An Analysis of Response Times for Word Recognition","240208352":"A statistical model for discriminating between subliminal and near-liminal performance","250185690":"Applications and Extensions of MCMC in IRT: Multiple Item Types, Missing Data, and Rated Responses","23448785":"Striatum and pre-SMA facilitate decision-making under time pressure","40453212":"A diffusion model decomposition of the practice effect","235771451":"Approximate Bayesian computation with differential evolution ✩","227985825":"Platelet Physiology and the Role of the Platelet in Ischemic Heart Disease","23466075":"Bayesian and maximum likelihood estimation of hierarchical response time models","7327313":"An introduction to Bayesian hierarchical models with an application in theory of signal detection","11855627":"Usher, M. \u0026 McClelland, J.L. The time course of perceptual choice: the leaky, competing accumulator model. Psychol. Rev. 108, 550-592","45821177":"Cortico-striatal connections predict control over speed and accuracy in perceptual decision making","5609368":"Brown, S. D. \u0026 Heathcote, A. The simplest complete model of choice response time: linear ballistic accumulation. Cognit. Psychol. 57, 153-178","5671682":"Allowing for Correlations Between Correlations in Random-Effects Meta-Analysis of Correlation Matrices","8098604":"A Ballistic Model of Choice Response Time.","46168986":"Bayesian Evaluation of Inequality and Equality Constrained Hypotheses for Contingency Tables","38075038":"Getting more from accuracy and response time data: Methods for fitting the linear ballistic accumulator","38075039":"BayesGCM: Software for Bayesian inference with the generalized context model","41035177":"Accelerating Markov Chain Monte Carlo Simulation by Differential Evolution with Self-Adaptive Randomized Subspce Sampling","222419359":"Understanding memory impairment with memory models and hierarchical Bayesian analysis","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","51384438":"Item Factor Analysis: Current Approaches and Future Directions","225415685":"A Markov Chain Monte Carlo Approach to Confirmatory Item Factor Analysis","46536886":"A Truncated-Probit Item Response Model for Estimating Psychophysical Thresholds","258150163":"A Straightforward Approach to Markov Chain Monte Carlo Methods for Item Response Models","230827568":"Bayesian Structural Equation Modeling: A More Flexible Representation of Substantive Theory","224910613":"Adaptive Rejection Sampling for Gibbs Sampling","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","40455312":"Bayesian Mediation Analysis","44670674":"The Effects of Aging on the Speed-Accuracy Compromise: Boundary Optimality in the Diffusion Model","226367232":"WinBUGS—A Bayesian Modelling Framework: Concepts, Structure, and Extensibility"},"citedIn":{"235771533":"Likelihood-Free Bayesian Analysis of Memory Models","264198332":"Cultural consensus theory for continuous responses: A latent appraisal model for information pooling","283123971":"A practical guide to the Probability Density Approximation (PDA) with improved implementation and error characterization","235390881":"A Bayesian Framework for Simultaneously Modeling Neural and Behavioral Data.","280119957":"The neural basis of value accumulation in intertemporal choice","260448430":"Intertemporal Choice as Discounted Value Accumulation","290222308":"Generalising the drift rate distribution for linear ballistic accumulators.","289380215":"A new framework for modeling decisions about changing information: The Piecewise Linear Ballistic Accumulator model","285143793":"Supplementary materials: complete literature review","288024408":"Why more is better: Simultaneous modeling of EEG, fMRI, and behavioral data","263712452":"Brain and Behavior in Decision-Making","265650086":"Using Best-Worst Scaling to Improve Psychological Service Delivery: An Innovative Tool for Psychologists in Organized Care Settings","235771451":"Approximate Bayesian computation with differential evolution ✩","272164815":"Informing Cognitive Abstractions Through Neuroimaging: The Neural Drift Diffusion Model","267816270":"Bayesian analysis of simulation-based models","269189042":"When the Brain Takes a Break: A Model-Based Analysis of Mind Wandering","280302124":"Titrating Decision Processes in the Mental Rotation Task","280302159":"An Introduction to Good Practices in Cognitive Modeling","273064668":"Sources of Interference in Item and Associative Recognition Memory","258823601":"A generalized, likelihood-free method for posterior estimation"},"index":249}