{"abs":"Slice sampling provides an easily implemented method for constructing a Markov chain Monte Carlo (MCMC) algorithm. However, slice sampling has two major drawbacks: (i) it requires repeated evaluation of likelihoods for each update, which can make it impractical when evaluations are expensive or as the number of evaluations grows (geometrically) with the dimension of the slice sampler, and (ii) since it can be challenging to construct multivariate updates, the updates are typically univariate, which often results in slow mixing samplers. We propose an approach to multivariate slice sampling that naturally lends itself to a parallel implementation. Our approach takes advantage of recent advances in computer architectures, for instance, the newest generation of graphics cards can execute roughly 30,000 threads simultaneously. We demonstrate that it is possible to construct a multivariate slice sampler that has good mixing properties and is efficient in terms of computing time. The contributions of this article are therefore twofold. We study approaches for constructing a multivariate slice sampler, and we show how parallel computing can be useful for making MCMC algorithms computationally efficient. We study various implementations of our algorithm in the context of real and simulated data.","title":"Parallel multivariate slice sampling","id":220286758,"url":"https://www.researchgate.net/publication/220286758_Parallel_multivariate_slice_sampling","names":["Matthew M. Tibbits","Murali Haran","John C. Liechty","Statistics and Computing"],"references":{"243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","237005410":"Parallel Programming in OpenMP","265368850":"Axisymmetric Consolidation for a Porous Elastic Material Containing a Fluid","2672427":"Parallel computing and Monte Carlo algorithms","220286562":"Parallelizing MCMC for Bayesian spatiotemporal statistical models","222001663":"ScaLAPACK: A Portable Linear Algebra Library for Distributed Memory Computers - Design Issues and Performance","243103227":"Sampling Schemes for Bayesian Variable Selection in Generalized Linear Models","265369049":"Slice sampling. (With discussions and rejoinder)","275741412":"Statistics for Spatial Data","5465757":"CUDA compatible GPU cards as efficient hardware accelerators for Smith-Waterman string alignment","6757608":"Gene function classification using Bayesian models with hierarchy-based priors","6206929":"Haplotype inference using a Bayesian Hidden Markov Model","38363225":"Practical Markov Chain Monte Carlo. Stat. Sci. 7, 473-483","2859706":"Convergence of Slice Sampler Markov Chains","4914136":"Gibbs Sampling for Bayesian Non-Conjugate and Hierarchical Models by Using Auxiliary Variables","7732707":"Polytomies and Bayesian Phylogenetic Inference","51384711":"Fixed and Random Effects Selection in Linear and Logistic Models","229790634":"Efficiency and Convergence Properties of Slice Samplers","220286712":"Parallel algorithms for Markov chain Monte Carlo methods in latent spatial Gaussian models","238446063":"Multitask Learning for Bayesian Neural Networks","4124068":"ScaLAPACK: A Portable Linear Algebra Library for Distributed Memory Computers - Design Issues and Performance","24280558":"Many-Core Algorithms for Statistical Phylogenetics","220917430":"Accelerating Genome-Wide Association Studies Using CUDA Compatible Graphics Processing Units","224839687":"Hierarchical Modeling and Analysis of Spatial Data","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","26694130":"Accelerating epistasis analysis in human genetics with consumer graphics hardware","286977791":"Slice sampling: Discussion","289724961":"Slice sampling: Rejoinder","2787469":"Markov Chain Monte Carlo Methods Based on `Slicing\u0027 the Density Function","262493452":"Parallel Programming in OpenMP","221650460":"PLAPACK: Parallel Linear Algebra Package.","284791637":"ScaLAPACK","255738707":"Message Passing Interface Forum, MPI: A Message-passing Interface Standard, Version 2.2","243765672":"Strategies for improving MCMC","2258770":"On MCMC Sampling in Hierarchical Longitudinal Models","225560576":"Hierarchical Modeling and Analysis for Spatial Data","227276601":"An Introduction to MCMC for Machine Learning","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","220695762":"InformationTheory, Inference, and Learning Algorithms","224839774":"Statistic for Spatial Data","3216523":"Parallel Computing Experiences with CUDA","220286619":"Slice Gibbs sampling for simulation based fitting of spatial models","2504666":"Markov Chain Monte Carlo in Practice: A Roundtable Discussion","2295197":"The Polar Slice Sampler"},"citedIn":{"264051295":"Perspectives on Bayesian Methods and Big Data","230609309":"Massive parallelization of serial inference algorithms for a complex\ngeneralized linear model","273400271":"SIMD parallel MCMC sampling with applications for big-data Bayesian analytics","262576238":"Automated Factor Slice Sampling","279190188":"A note on slice sampling","259926092":"Direct Sampling","257409893":"SIMD Parallel Gibbs Sampling of Probabilistic Directed Acyclic Graphs","260003754":"Scalable Rejection Sampling for Bayesian Hierarchical Models","254295486":"Developing Systems for Real-Time Streaming Analysis","51576741":"Graphics Processing Units and High-Dimensional Optimization","255645675":"Gaussian random field models for spatial data","241730546":"Parallel Statistical Computing for Statistical Inference","268881052":"A general construction for parallelizing Metropolis-Hastings algorithms","282503179":"Financial Data Analysis Based on Parallel Statistical Computing","262362525":"GPU accelerated MCMC for modeling terrorist activity"},"index":258}