{"abs":"Background Two-dimensional polyacrylamide gel electrophoresis (2D PAGE) is commonly used to identify differentially expressed proteins under two or more experimental or observational conditions. Wu et al (2009) developed a univariate probabilistic model which was used to identify differential expression between Case and Control groups, by applying a Likelihood Ratio Test (LRT) to each protein on a 2D PAGE. In contrast to commonly used statistical approaches, this model takes into account the two possible causes of missing values in 2D PAGE: either (1) the non-expression of a protein; or (2) a level of expression that falls below the limit of detection. Results We develop a global Bayesian model which extends the previously described model. Unlike the univariate approach, the model reported here is able treat all differentially expressed proteins simultaneously. Whereas each protein is modelled by the univariate likelihood function previously described, several global distributions are used to model the underlying relationship between the parameters associated with individual proteins. These global distributions are able to combine information from each protein to give more accurate estimates of the true parameters. In our implementation of the procedure, all parameters are recovered by Markov chain Monte Carlo (MCMC) integration. The 95% highest posterior density (HPD) intervals for the marginal posterior distributions are used to determine whether differences in protein expression are due to differences in mean expression intensities, and/or differences in the probabilities of expression. Conclusions Simulation analyses showed that the global model is able to accurately recover the underlying global distributions, and identify more differentially expressed proteins than the simple application of a LRT. Additionally, simulations also indicate that the probability of incorrectly identifying a protein as differentially expressed (i.e., the False Discovery Rate) is very low. The source code is available at https://github.com/stevenhwu/BIDE-2D.","title":"A Bayesian model for classifying all differentially expressed proteins simultaneously in 2D PAGE gels","id":227393143,"url":"https://www.researchgate.net/publication/227393143_A_Bayesian_model_for_classifying_all_differentially_expressed_proteins_simultaneously_in_2D_PAGE_gels","names":["Steven Wu","Michael A Black","Robyn A North","Allen G Rodrigo","BMC Bioinformatics"],"references":{"200033900":"Equation of state calculations for fast computing machines","23528551":"Prior Distributions for Variance Parameters in Hierarchical Models","200105001":"Equation of State by Fast Computing Machines","200622065":"Equation of State Calculations by Fast Computing Machines","215892123":"The state of the art in the analysis of two-dimensional gel electrophoresis images","6454951":"Multivariate analysis of 2-DE protein patterns – Practical approaches","6211995":"A Probabilistic Treatment of the Missing Spot Problem in 2D Gel Electrophoresis Experiments","2778220":"Parameter Expansion to Accelerate EM: The PX-EM Algorithm","2860257":"Parameter expansion to accelerate EM: The PX-EM algorithm","10609454":"The role of bioinformatics in two-dimensional gel electrophoresis. Proteomics 3, 1567-1596","26820744":"A Statistical Model to Identify Differentially Expressed Proteins in 2D PAGE Gels","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","6803697":"The pitfalls of proteomics experiments without correct use of bioinformatics tools","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","241681214":"Prior Distributions for Variance Parameters in Hierarchical Models","8133606":"Processing of Data Generated by 2-Dimensional Gel Electrophoresis for Statistical Analysis: Missing Data, Normalization, and Statistics","246868205":"Monte Carlo sampling using Markov chains and their applications","6125760":"The state of the art in the analysis of two-dimensional gel electrophoresis images. Appl Microbiol Biotechnol","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","7454164":"Software-induced variance in two-dimensional gel electrophoresis image analysis. Electrophoresis","11822225":"MRBAYES: Bayesian inferences of phylogenetic trees","247110047":"Parameter expansion to accelerate EM","23788236":"Incorporating pathway information into boosting estimation of high-dimensional risk prediction models","22901812":"O\u0027Farrell, P.H. High resolution two-dimensional electrophoresis of proteins. J. Biol. Chem. 250, 4007-4021","41200093":"Automated Analysis of Quantitative Image Data Using Isomorphic Functional Mixed Models with Application to Proteomics Data","6208117":"Parallel Metropolis Coupled Markov Chain Monte Carlo for Bayesian Phylogenetic Inference","37986605":"Proteomic biomarker discovery for preeclampsia","6662175":"Challenges Related to Analysis of Protein Spot Volumes from Two-Dimensional Gel Electrophoresis As Revealed by Replicate Gels","41030351":"Missing values in gel-based proteomics"},"citedIn":{"259126849":"Fluorescent immunosorbent assay for the detection of alpha lactalbumin in dairy products with monoclonal antibody bioconjugated with CdSe/ZnS quantum dots"},"index":261}