{"abs":"Sequential Monte Carlo methods are a very general class of Monte Carlo methods for sampling from sequences of distributions. Simple examples of these algorithms are used very widely in the tracking and signal processing literature. Recent developments illustrate that these techniques have much more general applicability, and can be applied very effectively to statistical inference problems. Unfortunately, these methods are often perceived as being computationally expensive and difficult to implement. This article seeks to address both of these problems. A C++ template class library for the efficient and convenient implementation of very general Sequential Monte Carlo algorithms is presented. Two example applications are provided: a simple particle filter for illustrative purposes and a state-of-the-art algorithm for rare event estimation.","title":"SMCTC: Sequential Monte Carlo in C++","id":46515713,"url":"https://www.researchgate.net/publication/46515713_SMCTC_Sequential_Monte_Carlo_in_C","names":["Adam Michael Johansen","Journal of statistical software"],"references":{"246348844":"GNU Scientific Library: Reference Manual","200105001":"Equation of State by Fast Computing Machines","200622065":"Equation of State Calculations by Fast Computing Machines","3361206":"Novel Approach to Nonlinear/Non-Gaussian Bayesian State Estimation","228623464":"A Tutorial on Particle Filtering and Smoothing: Fifteen Years Later","200707517":"Sequential Monte Carlo Samplers for Rare Events","2836794":"Population Monte Carlo","220695926":"The C Programming Language","2453431":"A Sequential Particle Filter Method for Static Models","248115483":"Topics in Sequential Monte Carlo Samplers","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","2870195":"An Open Graph Visualization System and Its Applications to Software Engineering","2590205":"Sequential Monte Carlo Methods for Dynamic Systems","1825409":"Sequential monte carlo samplers","246868500":"Monte Carlo filter and smoother for non-Gaussian state space models","228626697":"Sequential Monte Carlo for Bayesian Computation","2923975":"An Improved Particle Filter for Non-linear Problems","235409315":"Learning OpenCV: Computer Vision with the OpenCV Library, ISBN 978-0-596-51613-0","237005324":"GNU Scientific Library Reference Manual - Revised Second Edition","215446267":"Monte Carlo Strategies in Scientic Computing","246333315":"GNU Scientific Library Reference Manual","38326887":"Simulating Normalizing Constants: From Importance Sampling to Bridge Sampling to Path Sampling","4772026":"Following a moving target-Monte Carlo inference for dynamic Bayesian models","220286546":"Particle methods for maximum likelihood estimation in latent variable models","4746491":"Sequential Monte Carlo Methods in Practice","2306327":"Annealed Importance Sampling","2126101":"Genealogical particle analysis of rare events","228344043":"PFLib - An object oriented MATLAB toolbox for particle filtering - art. no. 65670S","2209498":"Generalised linear mixed model analysis via sequential Monte Carlo sampling"},"citedIn":{"265001961":"An Brief Overview of Particle Filtering","227522317":"Particle Markov Chain Monte Carlo . . .","269305678":"RFID-based localization system for mobile robot with Markov Chain Monte Carlo","261058377":"Bayesian model comparison via path-sampling sequential Monte Carlo","265756400":"Performance evaluation of four nonlinear filters for two radar applications","271454409":"Probabilistic approach to self-localization for autonomous mobile outdoor robotics based on hybrid map knowledge","228317107":"Approximating Optimal Trading Strategies Under Parameter Uncertainty: A Monte Carlo Approach","228623464":"A Tutorial on Particle Filtering and Smoothing: Fifteen Years Later","228365205":"Monte Carlo Filtering of Piecewise Deterministic Processes","268196405":"Implementation of a particle filter on a GPU for nonlinear estimation in a manufacturing remelting process","237842979":"Bayesian State-Space Modelling on High-Performance Hardware Using LibBi","221065250":"Particle filter based monocular human tracking with a 3D cardbox model and a novel deterministic resampling strategy","280970352":"Particle Gibbs Split-Merge Sampling for Bayesian Inference in Mixture Models","261416069":"Efficient scene simulation for robust monte carlo localization using an RGB-D camera","265099995":"Probabilistic framework for multi-target tracking using multi-camera: applied to fall detection","235352926":"On Performance of Simultaneous Equation Model Estimators Using Average Parameter Estimates in the Presence of Correlated Random Deviates","261384841":"Real-time human motion tracking using multiple depth cameras","265251538":"Ensemble Kalman Filtering and Particle Filtering in a Lag-Time Window for Short-Term Streamflow Forecasting with a Distributed Hydrologic Model"},"index":271}