{"abs":"The RESTART method is a widely applicable simulation technique for the estimation of rare event probabilities. The method is based on the idea to restart the simulation in certain system states, in order to generate more occurrences of the rare event. One of the main questions for any RESTART implementation is how and when to restart the simulation, in order to achieve the most accurate results for a fixed simulation effort. We investigate and compare, both theoretically and empirically, different implementations of the RESTART method. We find that the original RESTART implementation, in which each path is split into a fixed number of copies, may not be the most efficient one. It is generally better to fix the total simulation effort for each stage of the simulation. Furthermore, given this effort, the best strategy is to restart an equal number of times from each state, rather than to restart each time from a randomly chosen state","title":"A comparison of RESTART implementations","id":3786543,"url":"https://www.researchgate.net/publication/3786543_A_comparison_of_RESTART_implementations","names":["M. J. J. Garvels","D. P. Kroese"],"references":{"242498741":"Efficient Simulation of Backlogs in Fluid Flow Lines","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","3863119":"Splitting for rare event simulation: Analysis of simple cases","247333211":"Rare event simulation: a modified RESTART-method using the LRE-algorithm","2355513":"The Asymptotic Efficiency of Simulation Estimators. Op. Res. 40:505-520","3023205":"A large deviations perspective on the efficiency of multilevel splitting","242386046":"Estimation of Particle Transmission by Random Sampling","246072500":"Enhancement of the accelerated simulation method restart by considering multiple thresholds","3020145":"A quick simulation method for excessive backlogs in network of queues"},"citedIn":{"242549109":"Proseminar Technische Informatik Rare Event Simulation","226211578":"Extended Reward Measures in the Simulation of Embedded Systems With Rare Events","225392942":"A combined splitting—cross entropy method for rare-event probability estimation of queueing networks","229027428":"On the entrance distribution in RESTART simulation","228933025":"A combination of randomized quasi-Monte Carlo with splitting for rare-event simulation","228678372":"Applied restart estimation of general reward measures","254306656":"Optimal Splitting for Rare-event Simulation","266500523":"Importance Function Derivation for RESTART Simulations of Petri Nets","252062991":"Probabilistic Modeling and Simulation of Transmission Line Temperatures Under Fluctuating Power Flows","257642130":"Analysis of an interacting particle method for rare event estimation","239795968":"A Splitting Algorithm for Network Reliability Estimation","200707517":"Sequential Monte Carlo Samplers for Rare Events","268486860":"Reliability Modelling and Evaluation of Dynamic Systems With Stochastic Petri Nets (Tutorial)","238668586":"Accelerated Simulation of Power-Law Traffic in Packet Networks","221003199":"Reliability Evaluation of Distributed Embedded Systems With UML State Charts and Rare Event Simulation.","228918128":"Restart simulation of colored stochastic petri nets","220136390":"On the efficiency of RESTART for multidimensional state systems","3152493":"Techniques for the Fast Simulation of Models of Highly Dependable Systems","220136450":"Rare events, splitting, and quasi-Monte Carlo","278737469":"Efficient Splitting Simulation for Blackout Analysis","269329516":"Sensitivity analysis of rare-event splitting applied to cascading blackout models","236868988":"Assessing small failure probability by importance splitting method and its application to wind turbine extreme response prediction","37616984":"On the Importance Function in Splitting Simulation","3997915":"Estimation of rare event probabilities using cross-entropy","224061436":"Splitting for Rare-Event Simulation","281629792":"Some ideas for bias and variance reduction in the splitting algorithm for diffusion processes","221528285":"Rare event simulation and combinatorial optimization using cross entropy: estimation of rare event probabilities using cross-entropy.","3350495":"Fast, stable simulation of power-law packet traffic using concatenated acceleration techniques","220769733":"Splitting with weight windows to control the likelihood ratio in importance sampling","251203799":"Accelerated Simulation for Packet Buffer with a Non FIFO Scheduler","226300498":"The Rare Event Simulation Method RESTART: Efficiency Analysis and Guidelines for Its Application","2414160":"A Combined RESTART - Cross Entropy Method for Rare Event Estimation with Applications to ATM Networks","252049200":"Rare-event splitting simulation for analysis of power system blackouts","43510688":"Splitting Methods for Efficient Combinatorial Counting and Rare-Event Probability Estimation","267258963":"Some Non-Standard Sequential Monte Carlo Methods and Their Applications","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","220136480":"A Variant of Importance Splitting for Rare Event Estimation: Fixed Number of Successes"},"index":281}