{"abs":"Nonparametric density estimation aims to determine the sparsest model that explains a given set of empirical data and which uses as few assumptions as possible. Many of the currently existing methods do not provide a sparse solution to the problem and rely on asymptotic approximations. In this paper we describe a framework for density estimation which uses information-theoretic measures of model complexity with the aim of constructing a sparse density estimator that does not rely on large sample approximations. The effectiveness of the approach is demonstrated through an application to some well-known density estimation test cases.","title":"The Generalized Cross Entropy Method, with Applications to Probability Density Estimation","id":43525896,"url":"https://www.researchgate.net/publication/43525896_The_Generalized_Cross_Entropy_Method_with_Applications_to_Probability_Density_Estimation","names":["Zdravko I. Botev","Dirk P. Kroese","Methodology And Computing In Applied Probability"],"references":{"228940071":"Cross-Entropy Method","268659463":"The Generalized Maximum Entropy Principle (with Applications)","37618619":"Stochastic Methods for Optimization and Machine Learning","243783169":"Assessing a Mixture Model for Clustering with the Integrated Classification Likelihood","42635916":"Mathematical Theory of Communication","43481745":"Finite Mixture Model","266313304":"Progress in Data-Based Bandwidth Selection for Kernel Density Estimation","24082919":"Modelling the distribution of stamp paper thickness via finite normal mixtures: The 1872 Hidalgo stamp issue of Mexico revisited","220022167":"Information Theory and Statistical Mechanics I","226538122":"A Stochastic Minimum Cross-Entropy Method for Combinatorial Optimization and Rare-event Estimation*","216722144":"Inroduction to the Calculus of Variations and Its Applications","232128602":"Quantification method of classification processes. Concept of structural a -entropy","271513121":"The Cross-Entropy Method","252131464":"Multivariate Density Estimation: Theory","243764509":"Marginal likelihood from the Gibbs output. J Am Stat Assoc","245976499":"Duality Relationships for Entropy-Like Minimization Problems","247641695":"Statistical Analysis of Finite Mixture Distributions John Wiley and Sons","220694713":"Statistical Learning Theory","261625017":"Density Estimation for Statistics and Data Analysis","38359659":"Exact Mean Integrated Squared Error","236117297":"Local Regression Likelihood","3113608":"Generalized maximum entropy principle","3032582":"Convex Optimization","225344326":"Non-asymptotic Bandwidth Selection for Density Estimation of Discrete Data","220279562":"Advanced search algorithms for information-theoretic learning with kernel-based estimators.","43500603":"The EM Algorithm and Extensions","200744518":"Sequential Monte-Carlo Methods in Practice","24056030":"An entropy criterion for assessing the number of clusters in a mixture model. J Classif","246972427":"Nonparametric Density Estimation: The L1 View","38358909":"On Bandwidth Variation in Kernel Estimates-A Square Root Law","8254661":"Advanced Search Algorithms for Information-Theoretic Learning With Kernel-Based Estimators","45622657":"Statistical Learning Theory","3193611":"Probability density estimation from optimally condensed data samples","244423338":"Density Estimation With Confidence Sets Exemplified by Superclusters and Voids in the Galaxies","44366367":"Density Estimation For Statistics And Data Analysis","38359925":"An Asymptotically Efficient Solution to the Bandwidth Problem of Kernel Density Estimation","3421300":"Probability density function estimation using the MinMax measure","232953122":"A comparative study of some kernel-based nonparametric density estimators","38359688":"Variable Kernel Density Estimation","2423398":"Multivariate Density Estimation: a Support Vector Machine Approach","261655387":"Smoothing Methods in Statistics","38363407":"Model Specification: The Views of Fisher and Neyman, and Later Developments","227661917":"Green, P.J.: On Bayesian analysis of mixtures with an unknown number of components (with discussion). J. Roy. Stat. Soc. B. 59, 731-792","265505820":"Smoothing Methods In Statistics","242929962":"Penalty Functions and Duality in Stochastic Programming Via Divergence Functionals","222302352":"Novelty detection employing an L2 optimal non-parametric density estimator","38357528":"Bias Reduction in Kernel Density Estimation by Smoothed Empirical Transformations","38359192":"An Asymptotically Optimal Window Selection Rule for Kernel Density Estimates","243082798":"Cross-Validation in Nonparametric Estimation of Probabilities and Probability Densities","243096494":"Dual Methods in Entropy Maximization. Application to Some Problems in Crystallography","237127798":"Entropy Optimization Principles With Applications","220322554":"An error-entropy minimization algorithm for supervised training of nonlinear adaptive systems.","236736832":"Convex Analysis and Nonlinear Optimization: Theory and Examples","3318354":"An Error-Entropy Minimization Algorithm for Supervised Training of Nonlinear Adaptive Systems","243769062":"In All Likelihood: Statistical Modelling and Inference Using Likelihood","210222819":"Simulation and the Monte Carlo Method","38360239":"On Kullback-Leibler Loss and Density Estimation","234814104":"A mathematical theory of communication. AT\u0026T Tech J","229100480":"Statistical Analysis of Finite Mixture Distributions.John Wiley \u0026 Sons, New York","224817409":"Multivariate Density Estimation: Theory, Practice, and Visualization, Second Edition","38348462":"Loader, C.: Bandwidth selection: Classical or plug-in? Ann. Stat. 27, 415-438","235418978":"A Mathematical Theory of Communication","38359586":"Bandwidth Selection for Kernel Density Estimation","38359588":"A Simple Root $n$ Bandwidth Selector","254287814":"Nonparametric Importance Sampling","224839945":"On Information and Sufficiency","254286791":"Philatelic Mixtures and Multimodal Densities","4893758":"Reducing bias in curve estimation by use of weights","226805234":"Tsallis, C.: Possible generalization of Boltzmann-Gibbs statistics. J. Stat. Phys. 52, 479-487","243763440":"Maximum Entropy Models In Science and Engineering","239041607":"Measures of Information and Their Applications","224817311":"On Optimal Data-Based Bandwidth Selection in Kernel Density Estimation","238863559":"A class of measure of informativity of observation channels","51993442":"A Mathematical Theory of Communication","243785723":"Parametric Statistical Modeling by Minimum Integrated Square Error"},"citedIn":{"277338213":"Load match optimisation of a residential building case study: A cross-entropy based electricity storage sizing algorithm","256018215":"Systemic Risk and Sovereign Debt in the Euro Area","275596683":"Relation between information measures and chi-square statistic","220825839":"Sub-optimal importance sampling for fast simulation of linear block codes over BSC channels","225344326":"Non-asymptotic Bandwidth Selection for Density Estimation of Discrete Data","282267675":"Fault detection method based on sparse non-negative matrix factorization","43520980":"Generalized cross-entropy methods for rare events and optimization","257035199":"Statistical process monitoring via generalized non-negative matrix projection","220825926":"Soft-Input Soft-Output King Decoder for coded MIMO wireless communications","234154950":"Multi-optima exploration with adaptive Gaussian mixture model","289781533":"Design of PID controller using cross entropy method","267755180":"Chapter 4. Reducing the Kullback-Leibler Distance: The Cross-Entropy Method for Optimization","264221221":"Fault detection method for non-Gaussian processes based on non-negative matrix factorization","286845411":"Data-driven anomaly detection based on a bias change","46401272":"Marginal Likelihood Estimation with the Cross-Entropy Method","220286431":"Efficient Monte Carlo simulation via the generalized splitting method"},"index":283}