{"abs":"The paper is largely expository, but some new results are included to round out the paper and bring it up to date. The following distributions are quoted in Section 7. 1. Type $_0F_0$, exponential: (i) $\\chi^2$, (ii) Wishart, (iii) latent roots of the covariance matrix. 2. Type $_1F_0$, binomial series: (i) variance ratio, $F$, (ii) latent roots with unequal population covariance matrices. 3. Type $_0F_1$, Bessel: (i) noncentral $\\chi^2$, (ii) noncentral Wishart, (iii) noncentral means with known covariance. 4. Type $_1F_1$, confluent hypergeometric: (i) noncentral $F$, (ii) noncentral multivariate $F$, (iii) noncentral latent roots. 5. Type $_2F_1$, Gaussian hypergeometric: (i) multiple correlation coefficient, (ii) canonical correlation coefficients. The modifications required for the corresponding distributions derived from the complex normal distribution are outlined in Section 8, and the distributions are listed. The hypergeometric functions $_pF_q$ of matrix argument which occur in the multivariate distributions are defined in Section 4 by their expansions in zonal polynomials as defined in Section 5. Important properties of zonal polynomials and hypergeometric functions are quoted in Section 6. Formulae and methods for the calculation of zonal polynomials are given in Section 9 and the zonal polynomials up to degree 6 are given in the appendix. The distribution of quadratic forms is discussed in Section 10, orthogonal expansions of $_0F_0$ and $_1F_1$ in Laguerre polynomials in Section 11 and the asymptotic expansion of $_0F_0$ in Section 12. Section 13 has some formulae for moments.","title":"Distributions of Matrix Variates and Latent Roots Derived from Normal Samples","id":38365933,"url":"https://www.researchgate.net/publication/38365933_Distributions_of_Matrix_Variates_and_Latent_Roots_Derived_from_Normal_Samples","names":["Alan T. James","The Annals of Mathematical Statistics"],"references":{"252265673":"The General Sampling Distribution of the Multiple Correlation Coefficient","266253951":"Characterization of the normal law by the symmetry of a certain conditional distribution","38366059":"Some Non-Central Distribution Problems in Multivariate Analysis","38368522":"The Generalization of Student\u0027s Ratio","38366317":"Probability Content of Regions Under Spherical Normal Distributions, IV: The Distribution of Homogeneous and Non-Homogeneous Quadratic Functions of Normal Variables","239328645":"A Generating Function for Averages Over the Orthogonal Group","267064204":"Bessel Functions of Matrix Argument","38366638":"The Distribution of the Latent Roots of the Covariance Matrix","229057967":"“Relations Between Two Sets of Variates”","38367200":"Distribution of Quadratic Forms and Some Applications","38367906":"The Non-Central Wishart Distribution and Certain Problems of Multivariate Statistics","241306601":"The Non-Central Wishart Distribution","38367879":"The General Canonical Correlation Distribution","38366680":"On the Moments of the Trace of a Matrix and Approximations to its Distribution","247025259":"On symmetrized Kronecker powers and the structure of the free Lie ring","248495957":"Zonal Polynomials of the Real Positive Definite Symmetric Matrices","38366386":"The Moments of Elementary Symmetric Functions of the Roots of a Matrix in Multivariate Analysis","38366196":"Statistical Analysis Based on a Certain Multivariate Complex Gaussian Distribution (An Introduction)","38368022":"Some Extensions of the Wishart Distribution","38367478":"On the Distribution of two Random Matrices used in Classification Procedures","38366198":"Some Results on the Distribution of Two Random Matrices Used in Classification Procedures"},"citedIn":{"24269168":"Bimatrix variate generalised beta distributions","228443545":"Analytical Results for the Capacity of Spatially Correlated MIMO Channels","254906167":"Doubly noncentral matrix variate beta distribution","223147332":"Expressions for some hypergeometric functions of matrix argument with applications","220323115":"Minimum BER Linear MIMO Transceivers With Adaptive Number of Substreams","24123772":"Bayesian Inference in the Time Varying Cointegration Model","23630181":"Partial differential equations for hypergeometric functions of two argument matrices.J. Multivariate Analysis,2, 332-338","220304684":"Codebook Design for MIMO Retransmission System","3162174":"Approximate Minimum BER Power Allocation for MIMO Spatial Multiplexing Systems","45920943":"Entangled random pure states with orthogonal symmetry: Exact results","222647633":"Chapter 10 Forecasting with Many Predictors","2093061":"Eigenvalue distributions for some correlated complex sample covariance matrices","23564668":"The density of a quadratic form in a vector uniformly distributed on the n-sphere","220681529":"On the capacity of spatially correlated MIMO rayleigh-fading channels. IEEE Trans Inf Theory","227239316":"Nuclear structure on a Grassmann manifold","264312801":"Random density matrices versus random evolution of open system","238599705":"Hypergeometric functions on complex matrix space","38365807":"Classical Statistical Analysis Based on a Certain Multivariate Complex Gaussian Distribution","222131483":"Uniform distribution on a Stiefel manifold","46494446":"Noncentral elliptical configuration density","263542686":"Eigenvalue statistics for the sum of two complex Wishart matrices","260542379":"Open-Loop Spatial Multiplexing and Diversity Communications in Ad Hoc Networks","265209826":"Rare-event Analysis for Extremal Eigenvalues of the Beta-Laguerre Ensemble","23630172":"Asymptotic formulas for the distributions of the determinant and the trace of a noncentral beta matrix","256663419":"The Beta-MANOVA Ensemble with General Covariance","255624964":"Performance Analysis of Mary PSK for Optimum Combining with Co-Channel Interference in a Rayleigh Fading Channel","38365808":"A Test for Reality of a Covariance Matrix in a Certain Complex Gaussian Distribution","24052050":"Bayes estimation of number of signals","224439586":"Capacity of MIMO Rayleigh Fading Channels in the Presence of Interference and Receive Correlation","260655053":"Reduced Complexity Power Allocation Strategies for MIMO Systems With Singular Value Decomposition","227345864":"Interviewed by Grant H. Hillier and Christopher L. Skeels","24052008":"Estimating the covariance matrix and the generalized variance under a symmetric loss","237266543":"propagating from the transmitter to the receiver. Therefore, transmitted signals are attenuated and phase shifted during the transmission. This channel eect","252335961":"Analogs and Extensions of Selberg?s Integral","225764641":"Monotonicity of the power functions of some tests of hypotheses concerning multivariate complex normal distributions","225348923":"Statistical inference of the eigenspace components of a two-dimensional, symmetric rank-two random tensor","220482930":"Diversity of MIMO multihop relay channels","220087620":"On the marginal distribution of the eigenvalues of wishart matrices","231779722":"The distributions of certain factors occurring in discriminant analysis","1916998":"Onatski A.: The Tracy-Widom limit for the largest eigenvalues of singular complex Wishart matrices. Ann. Appl. Probab. 18, 470-490","232895935":"Application of multiple comparison type procedures to the eigenvalues of §-1 1:§2:","4073565":"Fast variational PCA for functional analysis of dynamic image sequences","233246082":"A confidence region with multiple intervals in multivariate bioassay","3162197":"Characteristic Functions for Optimum-Combining Output SINR With AWGN and Correlated Interference","222184791":"Improving on the Best Affine Equivariant Estimator of the Ratio of Generalized Variances","224324919":"Distribution of the Smallest Eigenvalue of Complex Central Semi-correlated Wishart Matrices","24060164":"On testing the dimensionality of regression coefficients","3350616":"Spatially correlated multiple-antenna channel capacity distributions","1888365":"Diversity of MIMO Multihop Relay Channels - Part I: Amplify-and-Forward","3924041":"Exact symbol error probability for optimum combining in the presence of multiple co-channel interferers and thermal noise","2209878":"Eigenvalue Separation in Some Random Matrix Models","280772804":"Asymptotic Matrix Variate von-Mises Fisher and Bingham Distributions with Applications","3924034":"Outage probability of dual-branch 2D-RAKE receivers","3924033":"Analysis of K-transmit dual-receive diversity with cochannel interferers over a Rayleigh fading channel","222076231":"Edgeworth and saddle-point approximations for random rectangular matrices","4087874":"Quadratic forms on complex random matrices and channel capacity","220239265":"Ergodic Capacity Analysis of MIMO Multi-Keyhole Channel in Rayleigh Fading","268689537":"Cubatures and designs in unions of Grassmannians","283494508":"The largest eigenvalue distribution of the Laguerre unitary ensemble","225598968":"Error bounds for asymptotic expansions of the distribution of the MLE in a GMANOVA model","224183757":"A Theoretical Framework for LMS MIMO Communication Systems Performance Analysis","2416816":"Matrices connected with Brauer\u0027s centralizer algebras","45855268":"Noncentral bimatrix variate generalised beta distributions","220640644":"Array gain and capacity for known random channels with multiple element arrays at both ends.","222541281":"Random matrices with complex Gaussian entries","38359791":"Multivariate Aspects of Shape Theory","221287831":"Normalization of Linear Vector Channels","23564747":"The exact cumulative distribution function of a ratio of quadratic forms in normal variables, with application to the AR(1) model","250926681":"Finite-SNR diversity-multiplexing tradeoff for Rayleigh MIMO channels","2138257":"Ergodic unitarily invariant measures on the space of infinite Hermitian matrices","221928843":"Non-Asymptotic Analysis of Scaled Largest Eigenvalue Based Spectrum Sensing","254058389":"On the Application of Character Expansions for MIMO Capacity Analysis","223120888":"Krishnaiah, P.R.: Some recent developments on complex multivariate distributions J. Multivar. Anal. 6(1), 1-30","38357756":"Asymptotic Expansions of the Non-Null Distributions of Likelihood Ratio Criteria for Covariance Matrices","226878771":"Power comparisons of two-sided tests of equality of two covariance matrices based on six criteria","24052185":"Asymptotic expansions of some matrix argument hypergeometric functions, with applications to macromolecules","225115613":"Meixner Matrix Ensembles","265369451":"The Analysis of Nonadditivity in Two-Way Analysis of Variance","37468804":"Representation of Radon Shape Diffusions via Hyperspherical Brownian Motion","271855755":"Polynomial Eulerian shape distributions","228033877":"MIMO Communications with Partial Channel State Information","6973608":"A multivariate test for population bioequivalence","224695719":"CTH09-6: Capacity of MIMO Systems in the Presence of Interference","2111716":"On the Largest Singular Values of Random Matrices with Independent Cauchy Entries","222680450":"MOPS: Multivariate Orthogonal Polynomials (symbolically)","266917668":"On sequences of integers","266219283":"Transceiver Design for Multiple Antenna Communication Systems with Imperfect Channel State Information","5060760":"Noncentral Student distributed LS and IV Estimators","228050241":"Certain Computations Involving Complex Gaussian Matrices with Applications to the Performance Analysis of MIMO Systems","224712115":"Coverage Enhancement for OFDM-based Spatial Multiplexing Systems by Scheduling","254205944":"Zonal polynomials on the space of $3\\times 3$ positive definite symmetric matrices","262360899":"Extended matrix variate gamma and beta functions","226817383":"On the exact non-null distribution of likelihood ratio criteria for covariance matrices","23644556":"Estimating the covariance matrix: A new approach","233039109":"Normal combinatoric classification: The sample case","224093617":"High Permittivity Dielectric Rod Waveguide as an Antenna Array Element for Millimeter Waves","23644546":"Concentrated matrix Langevin distributions","2113739":"Concentration of permanent estimators for certain large matrices","1960176":"MIMO Multichannel Beamforming: SER and Outage Using New Eigenvalue Distributions of Complex Noncentral Wishart Matrices","23630214":"Compact group actions, spherical bessel functions, and invariant random variables","45924946":"Statistical Distribution of Quantum Entanglement for a Random Bipartite State","251856882":"Noncentral matrix variate beta distribution","222422451":"Wishart and Pseudo-Wishart distributions under elliptical laws and related distributions in the shape theory context","3389639":"Distribution of ordered eigenvalues of Wishart matrices","26720610":"Non-intersecting Brownian Interfaces and Wishart Random Matrices","38357694":"Asymptotic Non-Null Distributions of the Likelihood Ratio Criteria for Covariance Matrix Under Local Alternatives","227992938":"Multidimensional Harmonic Retrieval with Applications in MIMO Wireless Channel Sounding","267869962":"Expectation-Maximization for Learning Determinantal Point Processes","3320012":"Trace-Orthonormal Full-Diversity Cyclotomic Space–Time Codes","237293348":"ZONAL POLYNOMIALS OF POSITIVE SEMIDEFINITE MATRIX ARGUMENT","254205477":"Asymptotic expansion of the distribution of the generalized variance in the non-central case","243033979":"Distributions associated with the factors of Wilks\u0027 Λ in discriminant analysis","38363969":"Locally Best Invariant Test for Sphericity and the Limiting Distributions","242986871":"Hermite and Laguerre polynomials with complex matrix arguments","3084606":"Hotelling\u0027s generalized distribution and performance of 2D-RAKE receivers","3320097":"Active Antenna Selection in Multiuser MIMO Communications","262270646":"A Proof of the Macdonald–Morris Root System Conjecture for $F_4","3567918":"Sensitivity and robustness of eigendecomposition-based detectors","48907248":"Plans d\u0027expériences optimaux et application à l\u0027estimation des matrices de trafic dans les grands réseaux : programmation conique du second ordre et sous-modularité","263128757":"Quasi-Static Multiple-Antenna Fading Channels at Finite Blocklength","4342105":"Cooperative Wireless Medium Access Exploiting Multi-Beam Adaptive Arrays and Relay Selection","3852577":"Procedure for detecting the number of signal components in a radar measurement","225979494":"Simultaneous test for equality of latent roots against certain alternatives - I","38357865":"An Antipodally Symmetric Distribution on the Sphere","224699462":"On the link ergodic capacity of MIMO MANETs using cooperation","221576221":"Application of Telser\u0027s safety-first criterion to adaptive power control","2703621":"Random Matrices with Complex Gaussian Entries","227660963":"“Capacity of Multi-Antenna Gaussian Channels,”","38359935":"Nonnull and Optimality Robustness of Some Tests","220656656":"Eigenvalues and Condition Numbers of Complex Random Matrices","229340305":"Properties of the complex bimatrix variate beta distribution","242270027":"WISHART AND PSEUDO-WISHART DISTRIBUTIONS AND SOME","24051793":"Chikuse, Y.: Partial differential equations for hypergeometric functions of complex argument matrices and their applications. Ann. Inst. Stat. Math. 28(2), 187-199","251708991":"Modeling ordered subcarrier SNR in MIMO-OFDM wireless links","220464231":"High-Dimensional Random Matrices from the Classical Matrix Groups, and Generalized Hypergeometric Functions of Matrix Argument","3086699":"Diversity–Multiplexing Tradeoff and Outage Performance for Rician MIMO Channels","228685032":"Jacobians and hypergeometric functions in complex multivariate analysis","2466153":"On the Distribution of the Largest Principal Component","3432824":"Quadratic Forms in Complex Gaussian Matrices and Performance Analysis of MIMO Systems With Cochannel Interference","267214496":"Closed-form Output Statistics of MIMO Block-Fading Channels","38363911":"An Asymptotic Expansion for the Distribution of the Eigenvalues of a 3 by 3 Wishart Matrix","251948629":"Theoretical analysis of base station cooperation MIMO channel by using eigenvalue theory of wishart matrix","230268139":"EXACT DISTRIBUTIONS OF A FEW ARBITRARY ROOTS OF SOME COMPLEX RANDOM MATRICES1","3979620":"Optimal blind transport format detection for UMTS uplink","288319607":"Generalized eigenvalue based spectrum sensing","24051763":"Some distributions of the latent roots of a complex wishart matrix variate","222991382":"Inverse Wishart distributions based on singular elliptically contoured distribution","283099521":"Robust Transceiver with Switched Preprocessing for K-Pair MIMO Interference Channels","29603996":"GAUSSIAN FINITE ADDITIVE AND MULTIPLICATIVE FREE DECONVOLUTION","231183527":"Invariant β-Wishart ensembles, crossover densities and asymptotic corrections to the Marčenko–Pastur law","222837803":"Spatial design matrices and associated quadratic forms: Structure and properties","24051724":"Power comparisons of tests of two multivariate hypotheses based on individual characteristic roots","238866254":"On Approximating The Non-Central Wishart Distribution by Central Wishart Distribution A Monte Carlo Study","232387759":"Likelihood ratio tests on covariance matrices and mean vectors of complex multivariate normal populations and their applications in time series","273166654":"Stochastic Geometry Modeling and Performance Evaluation of MIMO Cellular Networks Using the Equivalent-in-Distribution (EiD)-Based Approach","3080536":"Space-time autocoding","4194752":"Compact feedback for MIMO-OFDM systems over frequency selective channels","24051950":"The information matrix, skewness tensor and a-connections for the general multivariate elliptic distribution","226102520":"Asymptotic expansions of the non-null distributions of two criteria for the linear hypothesis concerning complex multivariate normal populations,Ann. Inst. Statist. Math.,23, 477-490","276238837":"Extended Matrix Variate Hypergeometric Functions and Matrix Variate Distributions","3432880":"How Accurate Channel Prediction Needs to be for Transmit-Beamforming With Adaptive Modulation Over Rayleigh MIMO Channels?","220679343":"Instantaneous Mutual Information and Eigen-Channels in MIMO Mobile Rayleigh Fading","220658863":"Unifying analysis of ergodic MIMO capacity in correlated Rayleigh fading environments","3432888":"Performance Analysis of Single and Multiuser MIMO Diversity Channels Using Nakagami- $m$ Distribution","224679158":"Outage analysis for MIMO Rician channels and channels with partial CSI","254205621":"Asymptotic expansions for the distributions of statistics based on the sample correlation matrix in principal component analysis","215930189":"Random matrix theory","242821089":"Error probability for optimum combining of Mary PSK signals in the presence of interference and noise","243085280":"ON THE MOMENTS OF THE CHARACTERISTIC ROOTS OF A NONCENTRAL (2 × 2) WISHART MATRIX","266305089":"Siotani\u0027s Contributions to Multivariate Statistical Analysis","238866328":"Power of largest root on canonical correlation","3979674":"Capacity of multi-antenna systems with adaptive transmission techniques","238698386":"La plus grande valeur propre de matrices de covariance empirique","229014536":"Mutual information and eigenvalue distribution of MIMO Ricean channels","256116468":"Random matrix based approach to quantify the effect of measurement noise on Hankel matrix","262309394":"Capacity of MIMO MANETs with cooperation","224345324":"Ordered Eigenvalues of a General Class of Hermitian Random Matrices With Application to the Performance Analysis of MIMO Systems","224679127":"Ordered Eigenvalues of Complex Noncentral Wishart Matrices and Performance Analysis of SVD MIMO Systems","237406098":"Global spectrum uctuations for the -Hermite and -Laguerre ensembles via matrix models","260722239":"Joint Grassmann-Stiefel Quantization for MIMO Product Codebooks","23630034":"Formulas for zonal polynomials","234873924":"Generalization of some integrals over unitary matrices by character expansion of groups","224326882":"Study on Precise Batching System Based on Networked and Intellectual Control","228385825":"Partial response and faster-than-nyquist signaling","261035570":"Anomaly detection in multi-polarimetric radar images","242388940":"Performances des Systmes MIMO prØcodØs 2D dans un canal","242945978":"Alternative derivation of some complex multivariate distributions","220220643":"Random Matrix Theory and Wireless Communications","243048376":"Derivatives of the characteristic root of a symmetric or a Hermitian matrix with two applications in multivariate analysis,Commun. Statist.,1, 393-417","242997181":"Asymptotic null and nonnull distribution of Hotelling\u0027s T 2-statistic under the elliptical distribution","1960401":"Effect of Finite Rate Feedback on CDMA Signature Optimization and MIMO Beamforming Vector Selection","230261877":"Asymptotic distribution of the latent roots of the noncentral wishart distribution and the power of the likelihood ratio test for nonadditivity","261056067":"Information densities for block-fading MIMO channels","250312486":"VARIATIONAL METHODS IN DIMENSIONALITY REDUCTION","251316020":"Matricvariate and matrix multivariate T distributions and associated distributions","275061162":"Schur Complement Based Analysis of MIMO Zero-Forcing for Rician Fading","224179343":"Mutual Information Statistics and Beamforming Performance Analysis of Optimized LoS MIMO Systems","24051900":"Locally minimax tests in symmetrical distributions","229495928":"NONNULL DISTRIBUTION OF LIKELIHOOD RATIO CRITERION FOR TESTING MULTISAMPLE SPHERICITY IN THE COMPLEX CASE","24051896":"Risk of Improved Estimators for Generalized Variance and Precision","259432110":"Matrix-variate Gauss hypergeometric distribution","264062565":"Precoder Distribution and Adaptive Codebook in Wideband Precoding","266046978":"Estimation Problems Related to Random Matrix Ensembles","224357509":"Joint distribution of an arbitrary subset of the ordered eigenvalues of Wishart matrices","3314158":"Detection of the number of signals: A predicted eigen-threshold approach","3205614":"Spatially Nonstationary Anisotropic Texture Analysis in SAR Images","24051855":"Asymptotic expansion for the distribution of a function of latent roots of the covariance matrix","4852136":"Some Exact Results for Estimators of the Coefficients on the Exogenous Variables in a Single Equation","239065046":"Some combinatorial properties of Jack symmetric functions","3156444":"The Effect of Antenna Physics on Fading Correlation and the Capacity of Multielement Antenna Systems","3080641":"Structured unitary space-time autocoding constellations","24051840":"Asymptotic expansions for the joint and marginal distributions of the latent roots ofS 1 S 2 −1","251088647":"On the derivation of the asymptotic distribution of the generalized Hotelling\u0027s T 0 2","242564993":"Uniform approximation of eigenvalues in Laguerre and Hermite β-ensembles by roots of orthogonal polynomials","224298154":"Partial Channel State Information Unitary Precoding and Codebook Design for MIMO Broadcast Systems","224679059":"Diversity-Multiplexing Tradeoff in Rank-Deficient and Spatially Correlated MIMO Channels","224679068":"New Properties of Complex Noncentral Quadratic Forms and Bounds on MIMO Mutual Information","221285576":"Bayesian Robust Linear Transceiver Design for Dual-Hop Amplify-and-Forward MIMO Relay Systems.","221289673":"The PDF of the lth Largest Eigenvalue of Central Wishart Matrices and its Application to the Performance Analysis of MIMO Systems.","23629969":"Asymptotic distributions of the likelihood ratio test statistics for covariance structures of the complex multivariate normal distributions","3086893":"MIMO Diversity in the Presence of Double Scattering","3084844":"Capacity of multiple-antenna fading channels: Spatial fading correlation, double scattering, and keyhole","3084839":"Capacity of MIMO systems with semicorrelated flat fading","3084837":"Grassmannian beamforming for multiple-input multiple-output wireless systems","3084835":"Rate-diversity tradeoff of space-time codes with fixed alphabet and optimal constructions for PSK modulation","3156541":"Capacity-Approaching Multiple Coding for MIMO Rayleigh Fading Systems With Transmit Channel State Information","46092466":"Adaptive wireless multimedia communication systems","23630693":"The noncentral Bartlett decompositions and shape densities","45906098":"Distributions of the Largest Singular Values of Skew-Symmetric Random Matrices and their Applications to Paired Comparisons","251473129":"On Bessel integrals for reducible degenerate principal series representations","224139082":"The Equivalent Matrices of a Periodic Structure","3084856":"On the capacity of spatially correlated MIMO Rayleigh-fading channels","248394969":"Exact Performance Analysis of MIMO Zero Forcing Detection for Transmit Correlated Rician Rayleigh Fading","220321593":"Ordered Eigenvalues of a General Class of Hermitian Random Matrices With Application to the Performance Analysis of MIMO Systems.","3084854":"The pseudo-Wishart distribution and its application to MIMO systems","3781157":"High gain antennas in a random environment","3084851":"On the separability of demodulation and decoding for communications over multiple-antenna block-fading channels","229711763":"Asymptotic Expansions and Estimation of the Expected Error Rate for Equal‐Mean Discrimination with Uniform Covariance Structure","4051486":"Limited feedback precoding for spatial multiplexing systems","266210809":"On the expansion of C ρ * (V+I) as a sum of zonal polynomials","3162647":"A necessary and sufficient condition for determining the girth of quasi-cyclic LDPC codes","3162648":"Diversity factor-based capacity asymptotic approximations of MRC reception in Rayleigh fading channels","3971600":"On the capacity of multi-antenna systems in the presence of Rician fading","243082321":"The Multivariate Linear Hypothesis with Nonnormal Errors and a Classical Setting for the Structure of Inference in a Special Case","3162652":"A zero-forcing multiuser transmitter preprocessing scheme for downlink communications","223692664":"A CFAR processor for the detection of unknown random signals in nonstationary correlated noise","225513311":"On the complex analogue of Bayesian estimation of a multivariate regression model","232372214":"Methods of density estimation on the Grassmann manifold","291255149":"New Families of Multivariate Distributions","222775154":"Minimal complete classes of invariant tests for equality of normal covariance matrices and sphericity","4051464":"The distribution of eigenvalues of a Wishart matrix with correlation and application to MIMO capacity","4194933":"Performance of MIMO MRC in correlated Rayleigh fading environments","3320327":"Multiple Antenna Broadcast Channels With Shape Feedback and Limited Feedback","38348926":"Singular Wishart and Multivariate Beta Distributions","4776560":"Fractional Matrix Calculus and the Distribution of Multivariate Tests","243018816":"On the decomposition of Brauer\u0027s centralizer algebras","4225662":"Performance Analysis of Random Vector Quantization Limited Feedback Beamforming","4051458":"MIMO capacity results for Rician fading channels","224636706":"Random Matrix Transforms and Applications via Non-Asymptotic Eigenanalysis","263407093":"On Inverted Matrix Variate Gamma Distribution","238863483":"Hayakawa, T.: On the distribution of the latent roots of a complex Wishart matrix (non-central case). Ann. Inst. Stat. Math. 24, 1-17","224356119":"Exact Minimum Eigenvalue Distribution of a Correlated Complex Non-Central Wishart Matrix","224356118":"On the Eigenvalue Distribution of Correlated MIMO Channels by Character Expansion of Groups","224356117":"The PDF of the lth Largest Eigenvalue of Central Wishart Matrices and its Application to the Performance Analysis of MIMO Systems","3433080":"Very tight capacity bounds for MIMO-correlated Rayleigh-fading channels","242986027":"Density estimation on the spaces of symmetric and rectangular matrices","277023442":"Phase retrieval using random cubatures and fusion frames of positive semidefinite matrices","224356107":"MIMO Multichannel Beamforming in Interference-Limited Ricean Fading Channels","260672977":"Generalized Mean Detector for Collaborative Spectrum Sensing","23630645":"Asymptotic expansions for distributions of the large sample matrix resultant and related statistics on the Stiefel manifold","4061794":"Metrics for SAR-GMTI based on Eigen-decomposition of the sample covariance matrix","254332239":"On Analyzing Two-Way AoV Data with interaction","3084871":"Capacity of multiple-antenna systems with both receiver and transmitter channel state information","233082766":"Asymptotic tests and Monte-Carlo studies associated with the multiplicative interaction-model","260672998":"Multiple Primary User Spectrum Sensing in the Low SNR Regime","266536339":"Order statistics: A historical perspective","2126417":"Joint Singular Value Distribution of Two Correlated Rectangular Gaussian Matrices and Its Application","3433029":"Necessary and sufficient conditions for full diversity order in correlated Rayleigh fading beamforming and combining systems","3086935":"On the MIMO Channel capacity for the Nakagami-m Channel","220086119":"Error probability and SINR analysis of optimum combining in Rician fading","23644947":"Distribution and characteristic functions for correlated complex Wishart matrices","38365237":"Distribution of the Largest Latent Root and the Smallest Latent Root of the Generalized $B$ Statistic and $F$ Statistic in Multivariate Analysis","38365236":"On the Distribution of the Largest Latent Root of the Covariance Matrix","257879331":"Limiting spectral distribution of the sample covariance matrix of the windowed array data","3154510":"Performance analysis of maximal ratio combining and comparison with optimum combining for mobile radio communications with cochannel interference","2118239":"El Karoui N.: Tracy-Widom limit for the largest eigenvalue of a large class of complex sample covariance matrices. Ann. Probab. 35, 663-714","255731130":"On the Detection of Passive Eavesdroppers in the MIMO Wiretap Channel","228736807":"Novel ergodic capacity upper bound of dual-branch MIMO Ricean systems","226101247":"Application of Information Theory to the Design of 4th Generation Cellular Communication Systems","220325796":"Limited feedback unitary precoding for orthogonal space-time block codes.","238595251":"Bit Allocation and Statistical Precoding for Correlated MIMO Channels With Limited Feedback","2419370":"Using Properties Of Random Matrices For Target Factor Analysis Of Sensor Array Data","3433125":"On the Capacity of Multiple Antenna Systems in Rician Fading","227729152":"On the asymptotic non‐null distributions of the LR criterion in a general manova","3234466":"Array gain and capacity for known random channels with multiple element arrays at both ends","238806190":"Simplification of the Laplace–Beltrami operator","224706545":"Coverage Performance Analysis of OFDM-Based Spatial Multiplexing Systems","268062051":"Distribution of the product of determinants of noncentral bimatrix beta variates","254332338":"Testing Subhypotheses in the Multiplicative Interaction Model","221849506":"Response probability distribution of built-up vibro-acoustic systems","242259181":"Random Matrix Theory Analysis of Multiple Antenna Communication Systems","247305251":"Quadratic Forms on Complex Random Matrices and Multi-Antenna Channel Capacity","222410722":"Eigendecomposition of the multi-channel covariance matrix with applications to SAR-GMTI","232503167":"Signal Detection in High Dimension: The Multispiked Case","238863511":"Invariant polynomials with two matrix arguments extending the zonal polynomials: Applications to multivariate distribution theory","224157682":"On the Diversity, Multiplexing, and Array Gain Tradeoff in MIMO Channels","281487976":"Power Allocation for Decode-and-Forward Relay in Gateway Channels","3160709":"Blind multiuser detection via interference identification","224157669":"Diversity of MMSE MIMO receivers","254285288":"On Approximations for the Central and Noncentral Distribution of the Generalized Variance","233096996":"Some Asymptotic Results In The Multivariate Lognormal Estimation Theory","35684584":"Performance analysis of wireless networks /","3924723":"On capacity of Rician MIMO channels","3160825":"Outage probability and spectrum efficiency of cellular mobile radio systems with smart antennas","233455392":"Probabilistic approach to Page\u0027s formula for the entropy of a quantum subsystem","3416806":"Performance analysis of optimum combining for dual-antenna diversity with multiple interferers in a Rayleigh fading channel","228017989":"Antenna Subset Selection in MIMO Communication Systems","222357395":"Limits of multi-user MIMO systems using scheduling and rate feedback","46583826":"Largest Schmidt eigenvalue of random pure states and conductance distribution in chaotic cavities","4919952":"All Invariant Moments of the Wishart Distribution","23645067":"Singular matrix beta distribution","224249785":"Extreme Eigenvalue Distributions of Gamma-Wishart Random Matrices","265708849":"The Exact Distribution of the Wald Statistic","224116659":"Knowledge-Aided Bayesian Radar Detectors \u0026 Their Application to Live Data","220237772":"New closed-form of the largest eigenvalue PDF for Max-SNR MIMO system performances","3318494":"CFAR detection of multidimensional signals: An invariant approach","4850340":"The asymptotic distribution of the instrumental variable estimators when the instruments are not correlated with the regressors","254055893":"Collaborative spectrum sensing based on the ratio between largest eigenvalue and Geometric mean of eigenvalues","243082382":"Some Optimal Multivariates Tests","228693847":"Weighted Laplace transforms and Bessel functions on Hermitian symmetric spaces","3433155":"MMSE reception and successive interference cancellation for MIMO systems with high spectral efficiency","251956723":"Information-theoretic performance analysis of LMS MIMO communications","3320522":"High-SNR analytical performance of spatial multiplexing MIMO systems with CSI","224444313":"Improved Beamforming for Radio Links with Multi-Level Linearly Modulated Signals","238042317":"Extreme eigenvalue distributions of finite random wishart matrices with application to Spectrum Sensing","242996607":"Testing optimality of experimental designs for a regression model with random variables","259718271":"A Framework of Performance Analysis for Distributed Antenna Systems Based on Random Matrix Theory","266187995":"Distribution theory of quadratic forms for matrix multivariate elliptical distribution","26532508":"Rayleigh Fading Multi-Antenna Channels","262640812":"Multiple-Antenna Signal Detection in Cognitive Radio Networks with Multiple Primary User Signals","4318028":"Multiuser MIMO-TDMA with statistical feedback","280595382":"Structures of Multivariate Dependence","251170282":"On the exact non-null distribution of Wilks\u0027 L VC criterion and power studies","3160873":"Bounds and approximations for optimum combining of signals in the presence of multiple cochannel interferers and thermal noise","225775212":"Some properties of invariant polynomials with matrix arguments and their applications in econometrics","224394821":"On analytical derivations of the condition number distributions of dual non-central Wishart matrices","222971472":"Multivariate Meixner classes of invariant distributions","269394732":"Outage probability for MIMO relay channel","266841284":"Hypergeometric functions of 2×2 matrix argument are expressible in terms of Appell’s functions F 4","258083914":"Roy\u0027s Largest Root Test Under Rank-One Alternatives","226936492":"More Hypercontractive Bounds for Deformed Orthogonal Polynomial Ensembles","3203869":"Statistical Assessment of Eigenvector-Based Target Decomposition Theorems in Radar Polarimetry","243049810":"Comparing the exact distribution of the t-statistic to student\u0027s distribution when its constituent normal and chi-squared variables are dependent","2489099":"Statistical analysis of the Capacity of MIMO Frequency selective Rayleigh Fading Channels with arbitrary number of inputs and outputs","38365561":"On Certain Distribution Problems Based on Positive Definite Quadratic Functions in Normal Vectors","4318065":"On some applications of the distribution of ordered eigenvalues of wishart matrices","233281237":"Reference prior Bayes estimator for bivariate normal covariance matrix with risk comparison","220685853":"High-SNR power offset in multiantenna communication.","269820719":"Cooperative Spectrum Sensing Using Finite Demmel Condition Numbers","252048446":"The diversity of MMSE receiver over frequency-selective MIMO channel","261149904":"Amplifying-forward MIMO based mutual information analysis for correlated fading channel","222223999":"Total positivity, spherical series, and hypergeometric functions of matrix argument","233119398":"The exact distributions of the univariate and multivariate Behrens-Fisher statistics with a comparison of several solutions in the univariate case","23644719":"Laplace approximations to hypergeometric functions of two matrix arguments","37439857":"On the MIMO Channel Capacity for the Dual and Asymptotic Cases over Hoyt Channels","4813573":"Economic Estimators and the Edgeworth Approximation","224093719":"Relationship of Average Transmitted and Received Energies in Adaptive Transmission","246859259":"Modified AIC and Cp in Multivariate Linear Regression","23644711":"Singular random matrix decompositions: Jacobians","279196661":"Analysis and Design of Multiple-Antenna Cognitive Radios With Multiple Primary User Signals","244436420":"New distributed probabilistic language models","23644720":"Singular random matrix decompositions: Distributions","254284913":"The Power of Two Tests for Nonadditivity","2489215":"Eigenvalues Of The Laguerre Process As Non-Colliding Squared Bessel Processes","3160939":"Analysis of transmit-receive diversity in Rayleigh fading","29743768":"Multiple coding and space-time multi-user detection in multiple antenna systems","254770288":"Certain Hypergeometric Series Related to the Root System BC","229787344":"Distribution of characteristic roots in multivariate analysis Part II. Non‐Null Distribution","224093752":"MIMO networks: The effects of interference","243549679":"WKB-Expansion of the HarishChandra-Itzykson-Zuber Integral for Arbitrary","45883863":"Limit Theorems for Beta-Jacobi Ensembles","221642305":"Channel Eigenvalue Distribution and Ergodic Capacity Analysis of Outdoor-Indoor MIMO Measured Channel.","243049737":"Exact power comparison of three criteria to assess the independence between two sets of variates","261768431":"Performance of Rayleigh-Product MIMO Channels with Linear Receivers","225130013":"Approximation of Haar distributed matrices and limiting distributions of eigenvalues of Jacobi ensembles","27529949":"Multiple antenna systems in a mobile-to-mobile environment","284570486":"Elliptical affine shape distributions for real normed division algebras","221003439":"Approximation to the condition number distribution of almost square matrices","228388376":"Complex random matrices and applications","252943511":"A parametrization for independent variables of a two-matrix hypergeometric function","223006413":"Large Deviations Asymptotics for Spherical Integrals","263459898":"Statistical theory of shape under elliptical models via QR decomposition","220085898":"Optimum transmit-receive beamforming with noisy channel estimates for correlated MIMO Rayleigh channels","220300980":"Distributions of the compound and scale mixture of vector and spherical matrix variate elliptical distributions","3160998":"Equal gain transmission in multiple-input multiple-output wireless systems","3416995":"Exact Capacity Distributions for MIMO Systems with Small Numbers of Antennas","4033450":"On the log determinant of noncentral Wishart matrices","23630577":"High dimensional limit theorems and matrix decompositions on the Stiefel manifold","4127652":"Combining beamforming with Alamouti scheme for multiuser MIMO communications","37601702":"Eigenvalues and Condition Numbers of Random Matrices","233270906":"A Selection Procedure for the Number of Signals in Presence of Colored Noise","220683961":"Diversity and Multiplexing Tradeoff of Spatial Multiplexing MIMO Systems With CSI","256806124":"Spherical ensembles","224132861":"Ergodic Capacity Analysis of Amplify-and-Forward MIMO Dual-Hop Systems","243047892":"Unbiased And Upper Critical Values Of Mean Trace Of Multivariate Beta For Testing Difference Of Two Covariance Matrices Or Several Mean Vectors","46494063":"Clustering rows and/or columns of a two-way contingency table and a related distribution theory","26534463":"On the noncentral distribution of the ratio of the extreme roots of wishart matrix","225734360":"On an asymptotic distribution of the characteristic roots ofS1S2−1 when roots are not all distinct","220098226":"Capacity of MIMO channels in the presence of co-channel interference","274731981":"Ergodic Capacity Analysis of MIMO Relay Network Over Rayleigh-Rician Channels","253439156":"A note on certain singular transformations","3433371":"Performance analysis of maximum ratio transmission based multi-cellular MIMO systems","238724492":"Jack Polynomials of Second Order","225582789":"Quadratic forms of a matric-t variate","3156874":"Analytical Framework for Optimal Combining With Arbitrary-Power Interferers and Thermal Noise","261418030":"Robust MMSE Precoding Based on Switched Relaying and Side Information for Multiuser MIMO Relay Systems","51933350":"Limit Theory for the largest eigenvalues of sample covariance matrices\nwith heavy-tails","4791287":"Sampling distributions associated with the multivariate \"t\" distribution","3160975":"Performance of maximal ratio transmission with two receive antennas","225506992":"Extensions of Wilks\u0027 integral equations and distributions of test statistics","26536529":"Matrix-variate beta distribution","258305184":"Distribution of the product of determinants of noncentral bimatrix beta variates. Journal of Multivariate Analysis, 109, 73-87.","242912700":"Applications of Invariant Differential Operators to Multivariate Distribution Theory","233283115":"Multivariate generalization of t\u0027- statistic based on the mean square successive difference","257338522":"On Riesz distribution","23644837":"Non-white Wishart ensembles","23630503":"On non-null distributions connected with testing that a real normal distribution is complex","3161087":"Error Probability for Optimum Combining of M-ary PSK Signals in the Presence of Interference and Noise","23644856":"State space models on special manifolds","4127724":"Performance of pilot-symbol-assisted-modulation with transmit-receive diversity in nonselective Rayleigh fading channels","220970744":"Adaptive MIMO Systems in 2 x 2 Uncorrelated Rayleigh Fading Channel.","24269476":"Doubly noncentral singular matrix variate beta distributions","3161062":"Equal Gain Transmission in Multiple-Input Multiple-Output Wireless Systems","228746875":"Statistical analysis of the smallest singular value in MIMO transmission systems","4127719":"A general outage formula for optimum combining of arbitrarily faded signals with correlated Rayleigh interferers","224292480":"Algorithms for Calibrating Roadside Traffic Cameras and Estimating Mean Vehicle Speed","23644855":"Maximum entropy characterizations of the multivariate Liouville distributions","23630472":"Distribution theory for some tests of independence of seemingly unrelated regressions","3177425":"Optimality of high resolution array processing using the eigensystem approach","2089982":"Increasing subsequences and the hard-to-soft edge transition in matrix ensembles","3357655":"Development of a statistical procedure for detecting the number of signals in a radar measurement","225937043":"Analysis of K-Transmit Dual-Receive Diversity with Cochannel Interferers over a Rayleigh Fading Channel","2126788":"Application of Random Matrix Theory to Multivariate Statistics","224251577":"On the Vulnerabilities of CSI in MIMO Wireless Communication Systems","23644804":"Estimation of covariance matrices in fixed and mixed effects linear models","3417049":"Exact Capacity Distribution for Dual MIMO Systems in Ricean Fading","242996628":"On the distributions of the functions of the F-matrix under an elliptical population","221966026":"Locally Best Invariant Test for Multiple Primary User Spectrum Sensing","233274897":"Asymptotic nonnull distribution of likelihood ratio statistic for testing homogeneity of complex multivariate gaussian populations","221576908":"Joint distribution of an arbitrary subset of the ordered eigenvalues of Wishart matrices.","265073719":"EXPLOITING THE PHYSICAL LAYER TO ENHANCE WIRELESS OPERATION WITH COGNITIVE RADIOS","262878288":"Hypergeometric Functions of Matrix Arguments and Linear Statistics of Multi-Spiked Hermitian Matrix Models","229682764":"The Structure of Ellipsoidal Distributions I. Canonical Analysis","272391228":"Invariant Rules for Multipolarization SAR Change Detection","43642523":"Systèmes MIMO précodés optimisant la distance minimale : étude des performances et extension du nombre de voies","280243376":"A Unifying Framework for Adaptive Radar Detection in Homogeneous plus Structured Interference-Part I: On the Maximal Invariant Statistic","3320887":"Statistically Robust Design of Linear MIMO Transceivers","265378775":"Multiple-antenna signal detection in cognitive radio networks with multiple primary user signals","243036788":"Asymptotic formulas for the distributions of three statistics for multivariate linear hypothesis","243026548":"Asymptotics of special functions and the central limit theorem on the space of positive n × n matrices","222472520":"The spectrum edge of random matrix ensembles","243036785":"An asymptotic expansion for the distribution of the determinant of a multivariate quadratic form in a normal sample","221286718":"Analytical Comparison of Power Allocation Methods in MIMO Systems with Singular Value Decomposition","221638949":"Application of Financial Risk-Reward Theory to Adaptive Transmission","232063473":"The Affinely Invariant Distance Correlation","3417117":"Diversity Performance of Precoded Orthogonal Space-Time Block Codes Using Limited Feedback","26512829":"Time-Division Multiuser MIMO with Statistical Feedback","24173913":"Large Deviations of the Maximum Eigenvalue for Wishart and Gaussian Random Matrices","220086580":"Error probability for optimum combining of M-ary PSK signals in the presence of interference and noise.","3433476":"Enhancing coverage and capacity for multiuser MIMO systems by utilizing scheduling","224676183":"Optimal Combining with Arbitrary Power Interferers and Thermal Noise on Rayleigh Fading Channels","266972125":"A Random Matrix Model for $\\kappa$-$\\mu$ Shadowed Fading","23631197":"Wishart and Pseudo-Wishart Distributions and Some Applications to Shape Theory,","33898034":"Some aspects of estimation and hypothesis testing for generalized multivariate linear models /","51773224":"Gold nanoparticles functionalized with therapeutic and targeted peptides","226992569":"Recurrence formulas for zonal polynomials","220971284":"Linear Transceiver Design for Amplify-And-Forward MIMO Relay Systems under Channel Uncertainties","4856842":"Conditional and unconditional statistical independence","46585477":"Generalised Shape Theory Via Pseudo-Wishart Distribution","267627447":"Selecting the number of principal components: estimation of the true rank of a noisy matrix","221034857":"Comparisons on Performances in MIMO Systems under Different Propagation Environments","225210659":"Péché S.: Universality results for the largest eigenvalues of some sample covariance matrix ensembles. Probab. Theory Relat. Fields 143, 481-516","3904628":"On the capacity of multi-antenna Gaussian channels","2090064":"Matrix Models for Beta Ensembles","3433595":"On the capacity of frequency-flat and frequency-selective Rician MIMO channels with single-ended correlation","45874932":"Event-Driven Optimal Feedback Control for Multi-Antenna Beamforming","221636960":"On the capacity of MIMO-OFDM systems with doubly correlated channels","260512721":"Array gain in the DMT framework for MIMO channels","220641662":"From theory to practice: an overview of MIMO space-time coded wireless systems","3175528":"Acquisition of Spread Spectrum Signals by an Adaptive Array","225243445":"Complex random matrices and Rician channel capacity","231688595":"Shape distributions of Gaussian molecules","225677612":"On the distribution of a quadratic form in a multivariate normal sample","243048987":"A note on the critical values used in stepwise tests for multiplicative components of interaction","3433565":"Outage probability of MIMO optimum combining in presence of unbalanced co-channel interferers and noise","222830883":"Complex singular Wishart matrices and applications","258794271":"Generalized Bayesian Information Criterion for Source Enumeration in Array Processing","241074731":"Several Types of Contraceptives Safe in Lupus","38358590":"Asymptotic Representations of the Densities of Canonical Correlations and Latent Roots in MANOVA When the Population Parameters Have Arbitrary Multiplicity","227658217":"Universality of local eigenvalue statistics for some sample covariance matrices","258792208":"Multi-Target Detection using Total Correlation for Noise Radar Systems","225724681":"Simultaneous tests for equality of latent roots against certain alternatives-II","3343438":"Performance analysis for optimum combining of Rayleigh fading signals with correlated Rayleigh interferers and noise","245529308":"Complex generalized binomial coefficients","265872220":"Unitary Integrations for Unified MIMO Capacity and Performance Analysis","241638115":"An Analytical Expression for Performance of Optimum Combining with Multiple Correlated CCIs and Two Antennas","233187683":"On the max u-ratio and likelihood ratio tests of equality of several covariance matrices","229710134":"Some results on functions of matrix argument","233081187":"Asymptotic Distributions of the Sphericity Test in a Complex Multivariate Normal Distribution","230859085":"Distribution of the largest eigenvalue for real Wishart and Gaussian random matrices and a simple approximation for the Tracy-Widom distribution","225968616":"Some distribution theory relating to confidence regions in multivariate calibration","38364891":"On the Distribution of Some Statistics Useful in the Analysis of Jointly Stationary Time Series","223203797":"The Matrix Angular Central Gaussian Distribution","274375873":"On the Exact and Approximate Eigenvalue Distribution for Sum of Wishart Matrices","228854023":"Performance Analysis of MIMO Channel Inversion in Rayleigh Fading","268196703":"A thresholding scheme for target detection for noise radar systems based on random matrix theory","224747968":"Correlated MIMO channel capacity","224461254":"Throughput analysis of cooperative wireless medium access scheme exploiting multi-beam adaptive arrays","228520239":"A general approach to the exact and near-exact distributions of the main likelihood ratio test statistics used in the complex multivariate Normal setting","1762472":"The Laguerre process and generalized Hartman--Watson law","220823952":"Derivation of separability measures based on central complex Gaussian and Wishart distributions","220127710":"Capacity Scaling and Coverage for Repeater-Aided MIMO Systems in Line-of-Sight Environments","225157544":"Asymptotic distributions of the latent roots with multiple population roots in multiple discriminant analysis","241638063":"Robust Tomlinson-Harashima Source and Linear Relay Precoders Design in Amplify-and-Forward MIMO Relay Systems","4080887":"Multi-mode precoding using linear receivers for limited feedback MIMO systems","265231108":"The Z-Poisson distribution with application to the modelling of soccer score probabilities","3155196":"Spatially and Temporally Correlated MIMO Channels: Modeling and Capacity Analysis","4080883":"Mutual Information of MIMO Channels in Correlated Rayleigh Fading Environments—a General Solution","3085537":"Limited Feedback Unitary Precoding for Spatial Multiplexing Systems","242985652":"Generalized noncentral hermite and laguerre polynomials in multiple matrices","3085536":"STBC-Schemes With Nonvanishing Determinant for Certain Number of Transmit Antennas","268389168":"Local Asymptotic Normality of the spectrum of high-dimensional spiked F-ratios","23631288":"Screening among Multivariate Normal Data","233331002":"Evaluation of matrix Liouville–Dirichlet integrals using Laplace transform","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","220779006":"Probabilistic Analysis of the Semidefinite Relaxation Detector in Digital Communications","224747965":"Multi-mode antenna selection for spatial multiplexing with linear receivers","242500269":"Personal Satellite Services, International Conference, PSATS 2009, Rome, Italy, March 18-19, 2009, Revised Selected Papers","3085557":"General Capacity Bounds for Spatially Correlated Rician MIMO Channels","2090180":"On some integrals over the U(N) unitary group and their large N limit","23631242":"Density Estimation on the Stiefel Manifold","4127960":"Performance of Reed-Solomon coded beamforming in MIMO Rayleigh fading channels","222085590":"Constant term identities and hypergeometric functions on spaces of Hermitian matrices","2133195":"High Dimensional Statistical Inference and Random Matrices","224121264":"Analytical Comparison of Power Allocation Methods in MIMO Systems with Singular Value Decomposition","261301112":"Caractérisation des problèmes conjoints de détection et d\u0027estimation (Habilitation à Diriger des Recherches)","251384331":"Some comments on zonal polynomials and their expected values with respect to elliptical distributions","220821977":"A polarimetric temporal scene parameter and its application to change detection","4111567":"Capacity of MIMO channels with one-sided correlation","243036813":"On the distribution of the second elementary symmetric function of the roots of a matrix","224393645":"Error probability and SINR analysis of optimum combining in rician fading","3085532":"Quadratic Forms on Complex Random Matrices and Multiple-Antenna Systems","4115658":"Grassmannian beamforming on correlated MIMO channels","231692603":"Shape distributions for Gaussian molecules. Circular and linear chains as asymmetric ellipsoids","228524392":"Distribution of the extreme eigenvalues of the complex Jacobi random matrix ensemble","225589643":"Differential operators associated with zonal polynomials. II","286029296":"Verification of the Validity of the NPT Treatment in Hereditary Spastic Paraplegia: An Ivestigation Performed by Application of Random Matrix Theory","230570307":"Detection of weak signals in high-dimensional complex-valued data","220129763":"Capacity of MIMO Rician channels","23753835":"Dynamics of Output Growth, Consumption and Physical Capital in Two-Sector Models of Endogenous Growth","2141474":"Shape Fluctuations and Random Matrices","221167660":"A General Framework for the Distribution of the Eigenvalues of Wishart Matrices.","258247270":"Top eigenvalue of a random matrix: Large deviations and third order phase transition","3319089":"Limited feedback unitary precoding for orthogonal space-time block codes","243094395":"Constant Regression Polynomials and the Wishart Distribution","234854649":"On a Fourier integral over SO(3)","51969566":"Spectrum Sensing in the Presence of Multiple Primary Users","4062515":"Analytical performance of MIMO MMSE receivers in correlated Rayleigh fading environments","222699593":"Complex bimatrix variate generalised beta distributions","3155235":"Outage Probability for Optimum Combining of Arbitrarily Faded Signals in the Presence of Correlated Rayleigh Interferers","38358877":"Distributions of Maximal Invariants Using Quotient Measures","3480864":"Performance analysis of multiple-input multipleoutput singular value decomposition transceivers during fading and other cell interference","220127240":"Capacity of correlated MIMO Rayleigh channels","275719544":"Simple and exact extreme eigenvalue distributions of finite Wishart matrices","3321130":"Transmit Beamforming in Rayleigh Product MIMO Channels: Capacity and Performance Analysis","51889677":"“Signal Processing in Large Systems: A New Paradigm,”","220088324":"On Optimum Combining of $M$ -PSK Signals With Unequal-Power Interferers and Noise","265427656":"Power Comparisons of Tests of Equality of Two Covariance Matrices Based on Individual Characteristic Roots","256805461":"Wishart ratios with dependent structure: New members of the bimatrix beta type IV","23753846":"The Distribution of a Ratio of Quadratic Forms in Noncentral Normal Variables","38365033":"On the Moment Generating Function of Pillai\u0027s $V^{(s)}$ Criterion","24065103":"On Discrete Multivariate Distributions Symmetric in Frequencies","4166940":"Capacity bounds for correlated Rician MIMO channels","4021531":"The distribution of eigenvalues for correlated Wishart matrices applied to optimum combining with unequal power interferers and noise","38348654":"Laplace Approximation for Hypergeometric Functions of Matrix Argument","224401479":"Power Minimization of Central Wishart MIMO Block-Fading Channels","224157819":"Up-link multi-user MIMO capacity in low-power regime","281753058":"Forcing Scale Invariance in Multipolarization SAR Change Detection","38365027":"A System of Linear Differential Equations for the Distribution of Hotelling\u0027s Generalized $T_o^2$","27589771":"Wilks Factorization of the Complex Matrix Variate Dirichlet Distributions","3417371":"Performance analysis of maximum ratio transmission with imperfect channel estimation","224401489":"Gallager\u0027s exponent for MIMO channels: A reliability-rate tradeoff","224352365":"Limited-Feedback Precoding for Closed-Loop Multiuser MIMO OFDM Systems with Frequency Offsets","4070667":"Limited feedback precoding for spatial multiplexing systems using linear receivers","4115720":"Limited feedback precoding for orthogonal space-time block codes","1959210":"Diversity-Multiplexing Tradeoff of Double Scattering MIMO Channels","224401496":"On the marginal distribution of the eigenvalues of wishart matrices","238856966":"Generalized Binomial Expansion on Complex Matrix Space","227694760":"Statistical analysis of the eigenspace components of the two‐dimensional, symmetric rank‐two strain rate tensor derived from the space geodetic measurements (ITRF92‐ITRF2000 data sets) in central Mediterranean and Western Europe","262204128":"Determinants, permanents and some applications to statistical shape theory","4816139":"On Bayesian principal component analysis","4081021":"Very tight bounds for the capacity of MIMO correlated Rician fading channels","229376234":"Evaluating matrix-variate moments through higher-order differential forms and combinatorial algorithms","260637378":"Radar Detection of Distributed Targets in Homogeneous Interference Whose Inverse Covariance Structure is Defined via Unitary Invariant Functions","1959249":"Statistical Properties of Eigen-Modes and Instantaneous Mutual Information in MIMO Time-Varying Rayleigh Channels","224600109":"On the benefits of subspace dimension reduction for Grassmannian multiuser beamformers","255586932":"Capacity of Multi-antenna Gaussian Channels I.Emre Telatar","45910003":"Shape theory via polar decomposition","215699848":"Subsystem dynamics under random Hamiltonian evolution","4081002":"On the convergence of steepest descent and least mean-square algorithms for MIMO systems","38360863":"Proof of a Conjecture of M. L. Eaton on the Characteristic Function of the Wishart Distribution","225656868":"Total Positivity Properties of Generalized Hypergeometric Functions of Matrix Argument","265226898":"COMPUTING MULTIVARIATE STATISTICS","4240670":"Non-central quadratic forms on complex random matrices and applications","2209150":"Condition Numbers of Gaussian Random Matrices","3433835":"On the performance of random vector quantization limited feedback beamforming in a MISO system","243082012":"Power Comparisons of Tests of Equality of Two Covariance Matrices Based on Four Criteria","238857054":"Bessel Systems for Jordan Algebras of Rank 2 and 3","23774223":"Computationally efficient recursions for top-order invariant polynomials with applications","3085642":"High-SNR Power Offset in Multiantenna Communication","31448246":"Statistical Distributions in Univariate and Multivariate Edgeworth Populations","224305205":"Optimal Frame Splitting for Downlink MIMO Channels With Distributed Antenna Arrays","220319820":"An identity involving invariant polynomials of matrix arguments","220971078":"Channel Capacity of Virtual MIMO-Based Wireless Sensor Networks with Imperfect CSI.","226121738":"An approximation to the distribution of the largest root of a complex Wishart matrix","261044990":"Upper bound on the ergodic rate density of ALOHA Wireless Ad-Hoc networks","229710019":"EXPECTATIONS OF RATIOS OF QUADRATIC FORMS IN NORMAL VARIABLES: EVALUATING SOME TOP‐ORDER INVARIANT POLYNOMIALS","266097316":"COMPARISON OF THE PROBABILITIES OF MISCLASSIFICATION FOR THE ESTIMATED LINEAR, QUADRATIC, AND UNBIASED-DENSITY DISCRIMINANT FUNCTIONS USING ASYMPTOTIC EXPANSIONS","2217304":"Exact Minimum Eigenvalue Distribution of an Entangled Random Pure State","254407250":"Asymptotic Power of Sphericity Tests for High-Dimensional Data","24065043":"The expected value of zonal polynomials","243037182":"Note on the distribution of the minimum latent root","224315612":"Performance Analysis of Rayleigh-Product MIMO Channels with Optimal Beamforming","224315613":"A General Framework for the Distribution of the Eigenvalues of Wishart Matrices","253864612":"Matrix Kummer-general relation","225386730":"Unitary Group Theory and the Discovery of the Factorial Schur Functions","220326055":"Polarimetric Detection of Targets in Heavy Inhomogeneous Clutter","257800917":"A General Bayesian Estimation Method of Linear–Bilinear Models Applied to Plant Breeding Trials With Genotype × Environment Interaction","228378640":"Largest eigenvalues and sample covariance matrices. tracy-widom and painleve ii: computational aspects and realization in s-plus with applications","245529390":"Evaluation of cumulative probabilities for matrix variate Kummer-beta and matrix variate Kummer-gamma distributions","262162995":"Power Function Studies","241679347":"Asymptotic expansions of the distributions of test statistics in multivariate analysis","46544733":"Methods for Constructing Top Order Invariant Polynomials","224760059":"Statistical Analysis of the Smallest Singular Value in Ricean Fading MIMO Channels","3433898":"Interpolation-Based Multi-Mode Precoding for MIMO-OFDM Systems with Limited Feedback","33968034":"The distribution of the largest eigenvalue in principal component analysis /","224719043":"On the Sum-Rate of Opportunistic Beamforming Schemes with Multiple Antennas at the Receiver","243037141":"Note on the asymptotic distributions of the functions of a multivariate quadratic form in normal sample","220235914":"Theoretical Results about MIMO Minimal Distance Precoder and Performances Comparison","274730443":"Quickest Eigenvalue-Based Spectrum Sensing using Random Matrix Theory","263911959":"LARGE INFORMATION PLUS NOISE RANDOM MATRIX MODELS AND CONSISTENT SUBSPACE ESTIMATION IN LARGE SENSOR NETWORKS","224719050":"Optimum Combining of Rician-Faded Signals: Analysis in the Presence of Interference and Noise","267825752":"Adaptive Modulation Systems Subject to Interference","229703711":"CONVERGENT SERIES EXPRESSIONS FOR INVERSE MOMENTS OF QUADRATIC FORMS IN NORMAL VARIABLES","242547654":"RECURRENCE RELATIONS OF COEFFICIENTS OF THE GENERALIZED HYPERGEOMETRIC FUNCTION AND THE ZONAL POLYNOMIAL","259492545":"The Exact Distribution of the Condition Number of Complex Random Matrices","243049419":"Asymptotic expansion of the nonnull distribution of likelihood ratio statistic for testing multisample sphericity","242381769":"TRANSMIT OPTIMIZATION FOR MULTICARRIER AND MULTIPLE-INPUT MULTIPLE-OUTPUT WIRELESS COMMUNICATIONS","45909762":"Shape Theory Via SV Decomposition II","224315616":"On the Eigenvalue Distribution of Ricean MIMO Channels by Character Expansion of Groups","225874121":"A note on some Wishart expectations","3161487":"On optimum combining of M-PSK signals with unequal-power interferers and noise","243037115":"On a result of roy and Gnanadesikan concerning multivariete variance components","228999278":"Performance analysis of decorrelating decision feedback detection for MIMO systems in Rician fading","3175929":"On Information Theoretic Criteria for Determining the Number of Signals in High Resolution Array Processing","222486670":"Small sample rank tests with applications to asset pricing","4281745":"Effect of Line-of-Sight on Dual-Hop Nonregenerative Relay Wireless Communications","2219509":"Hypergeometric functions on reductive groups","268819923":"Random Matrix Derived Shrinkage of Spectral Precision Matrices","3161576":"Performance Analysis of Transmit Beamforming","263465576":"Exact Error Rate Analysis of MIMO-MRC System under Cochannel Interference and Imperfect Channel State Information","260393573":"Asymptotic Linear Spectral Statistics for Spiked Hermitian Random Matrix Models","264497699":"Limits for circular Jacobi beta-ensembles","243037085":"Differential operators associated with zonal polynomials. I","3433941":"Effects of Spatial Correlation on MIMO Adaptive Antenna System With Optimum Combining","263352913":"The bivariate Sinh-Elliptical distribution with applications to Birnbaum–Saunders distribution and associated regression and measurement error models","224503943":"Cooperative Wireless Medium Access Exploiting Multi-Beam Adaptive Arrays and Relay Selection","226474137":"On the moments of traces of two matrices in multivariate analysis","243037077":"The asymptotic distributions of the statistics based on the complex Gaussian distribution,Ann. Inst. Statist. Math.,24, 231-244","223291557":"MacMahon\u0027s Master Theorem, Representation Theory, and Moments of Wishart Distributions","226029717":"Calculation of zonal polynomials of 3×3 positive definite symmetric matrices","46544680":"Instrumental Variables Estimation in Misspecified Single Equations","232372279":"On Wishart distribution: Some extensions","233885696":"Univariate and Multivariate Omnibus Hypothesis Tests Selected to Control Type I Error Rates When Population Variances Are Not Necessarily Equal","23985305":"A note about zonal polynomials","224061614":"Outage Performance Analysis of Correlated MIMO Optimum Combining Systems with and without Co-Channel Interference","279170388":"On Quantization for Masked Beamforming Secrecy Systems","2133464":"Laguerre Process and Generalised Hartman-Watson Law","23630993":"Large Sample Asymptotic Theory of Tests for Uniformity on the Grassmann Manifold","224905374":"On Eigenvalues of the Sum of Two Random Projections","243037059":"On the construction of a class of invariant polynomials in several matrices, extending the zonal polynomials","227991657":"Linear and Dirty‐Paper Techniques for the Multiuser MIMO Downlink","224209757":"IR-UWB Transmitted-Reference Systems With Partial Channel Knowledge: A Receiver Design Based on the Statistical Invariance Principle","222774086":"On the expectation of a ratio of quadratic forms in normal variables","232829921":"Improved Estimation of Generalized Variance and Precision","3155510":"Closed-Form Expressions of Approximate Error Rates for Optimum Combining With Multiple Interferers in a Rayleigh Fading Channel","223652701":"A selection procedure for estimating the number of signal components","242684026":"MULTIPLE ANTENNA WIRELESS COMMUNICATION SYSTEMS: CAPACITY, CODING AND RECEIVER DESIGN","51969301":"Holonomic gradient method for the distribution function of the largest\nroot of a Wishart matrix","4109872":"Performance analysis of the maximum-SNR design in Rayleigh fading MIMO channels","228660145":"Hermite and Laguerre polynomials and matrix-valued stochastic processes","266273229":"QR, SV and Polar Decomposition and the Elliptically Contoured Distributions","220087053":"Bounds and approximations for optimum combining of signals in the presence of multiple cochannel interferers and thermal noise.","264843731":"Performances des Systèmes MIMO précodés 2D dans un canal de Rayleigh","270452225":"Performance Analysis of Closed-Loop MIMO Precoder Based on the Probability of Minimum Distance","232870849":"Exact probabilities of obtaining estimated non-positive definite between-group covariance matrices","263281040":"Exact formulas for the normalizing constants of Wishart distributions for graphical models","278806205":"High resolution techniques for Radar: Myth or Reality?","51969343":"Maximal Invariants Over Symmetric Cones","260514223":"Parametrization Based Limited Feedback Design for Correlated MIMO Channels Using New Statistical Models","224396108":"Analytical Performance of MIMO Multichannel Beamforming in the Presence of Unequal Power Cochannel Interference and Noise","38364263":"Distribution of the Canonical Correlations and Asymptotic Expansions for Distributions of Certain Independence Test Statistics","260428203":"On Eigenvalues of Wishart Matrix for Analysis of Compressive Sensing Systems","38364262":"Some Distribution Problems in the Multivariate Complex Gaussian Case","264243699":"Joint density of eigenvalues in spiked multivariate models","51967278":"Number of Relevant Directions in Principal Component Analysis and Wishart Random Matrices","3161613":"Generic Procedure for Tightly Bounding the Capacity of MIMO Correlated Rician Fading Channels","50404671":"Grandes déviations pour des modèles de percolation dirigée et des matrices aléatoires.","24059729":"On the linear combinations of stochastic variables","4310654":"MIMO delay-limited communications","224138014":"Optimum receiver design for transmitted-reference signaling","222294908":"Asymptotic distributions of the latent roots of the covariance matrix with multiple population roots","227419085":"Exact nonnull distribution of Wilks\u0027 statistic: The ratio and product of independent components","253929843":"On shape asymmetry of Gaussian molecules","224756532":"Spatially correlated MIMO Rician channel capacity","224123661":"Generic Approach to the Performance Analysis of Correlated Transmit/Receive Diversity MIMO Systems With/Without Co-Channel Interference","225358649":"The distribution of the characteristic roots of\nS\n1\nS\n2−1\nunder violations in the complex case and power comparisons of four tests","265365897":"Summation Theorems for Basic Hypergeometric Series of Schur Function Argument","235100249":"Distributions of Characteristic Roots in Multivariate Analysis","3966566":"On the optimality and performance of transmit and receive space diversity in MIMO channels","243044391":"On generalized matric variate beta distributions","31467452":"Analysis and Approximation of Statistical Distribution of Eigenvalues in i.i.d. MIMO Channels under Rayleigh Fading","261585355":"Matrix variate generalization of a bivariate beta type 1 distribution","31467453":"Capacity Analysis of MIMO Rayleigh Channel with Spatial Fading Correlation","4277791":"A theoretical framework for LMS MIMO communication systems performance analysis","220130113":"Bit-Error Probability for Optimum Combining of Binary Signals in the Presence of Interference and Noise","3319378":"Multimode antenna selection for spatial multiplexing systems with linear receivers","222190428":"On the calculation of generalized binomial coefficients","3159635":"Performance analysis of optimum combining in wireless communications with Rayleigh fading and cochannel interference","261333488":"Bayesian recursive estimation on the rotation group","38360109":"Magnitudinal Effects in the Normal Multivariate Model","224152379":"Mutual information statistics of optimized LOS MIMO systems","223843134":"An identity involving partitional generalized binomial coefficients","224152373":"Exact Expressions for the Condition Number Distribution of Complex Wishart Matrices","4167253":"On the achievable spectral efficiency of adaptive transmission with transmit-beamforming","4167252":"Exact symbol error probabilities for SVD transmission of BPSK data over fading channels","224250669":"Performance of statistical inference methods for the energy estimation of multiple sources","224205612":"On Optimal Cooperator Selection Policies for Multi-Hop Ad Hoc Networks","39994384":"A Redundant Residue Number System Coded Burst-by-Burst Adaptive Joint-Detection Based CDMA Speech Transceiver","224754454":"Statistical Assessment of Eigenvector-based Target Decomposition Theorems in Radar Polarimetryc","221170522":"Optimum Combining of Rician-Faded Signals: Analysis in the Presence of Interference and Noise.","229571547":"APPROXIMATION FOR THE DISTRIBUTION OF THE LARGEST LATENT ROOT OF A WISHART MATRIX*,1","23631647":"Representations for eigenfunctions of expected value operators in the Wishart distribution","45860033":"Matrix averages relating to Ginibre ensembles","3434056":"Eigenvalue Distributions of Wishart-Type Random Matrices with Application to the Performance Analysis of MIMO MRC Systems","3155533":"Outage Probability for Maximal Ratio Combining of Arbitrarily Correlated Faded Signals Corrupted by Multiple Rayleigh Interferers","38358071":"An Improved Estimator of the Generalized Variance","236380310":"Phenomenological approach to the batch grinding of coals","242985209":"Totally positive kernels, pólya frequency functions, and generalized hypergeometric series","5109450":"‘The exact distribution of LIML: I,’","289718220":"Distribution of a Quadratic Form in Normal Vectors","24051682":"On the distribution of the latent roots of a positive definite random symmetric matrix I","228637484":"On Computing Schur Functions and Series Thereof","224076759":"Effect of Optical Loss and Antenna Separation in 2 $\\,\\times\\,$ 2 MIMO Fiber-Radio Systems","3434169":"Joint and Marginal Eigenvalue Distributions of (Non)Central Complex Wishart Matrices and PDF-Based Approach for Characterizing the Capacity Statistics of MIMO Ricean and Rayleigh Fading Channels","24051708":"Non-central distributions of the largest latent roots of three matrices in multivariate analysis","24051707":"On the Moments of Elementary Symmetric Functions of the Roots of Two Matrices","227676933":"Asymptotic distributions of functions of a sample covariance matrix under the elliptical distribution","224142278":"On the Condition Number Distribution of Complex Wishart Matrices","24051699":"Non-central distributions of ith largest characteristic roots of three matrices concerning complex multivariate normal populations,Ann. Inst. Statist. Math.,21, 23-32","24051696":"On the distribution of the maximum latent root of a positive definite symmetric random matrix","224633795":"Complex singular wishart matrices and multiple-atenna systems","38337769":"Orthogonal polynomial ensembles in probability theory","223724529":"Properties of Hermite and Laguerre polynomials in matrix argument and their applications","39288050":"Wilks\u0027 factorization of the complex matrix variety Dirichlet distributions","267125065":"Statistics of orthogonal axial frames","30828412":"Estimating functions of canonical correlation coefficients","220820357":"Improved ship detection using dual-frequency polarimetric synthetic aperture radar data","4814580":"The Exact Distribution of Instrumental Variable Estimators in an Equation Containing n + 1 Endogenous Variables","260671818":"Performance Analysis of MIMO-MRC in Double-Correlated Rayleigh Environments","38364288":"Note on Some Formulas for Weighted Sums of Zonal Polynomials","3319550":"Duplex distortion models for limited feedback MIMO communication","38352004":"Phase transition of the largest eigenvalue for non-null complex covariance matrices","3897077":"A multi-step selection procedure for estimating the number of signal components","2092752":"Global spectrum fluctuations for the β-Hermite and β-Laguerre ensembles via matrix models","243048622":"Tables for the power function of box\u0027s two sided test for testing hypothesis ∑\u003d I the bivariate case","224621495":"Statistical properties of complex noncentral wishart matrices and MIMO capacity","37991574":"Eigenvalue statistics for beta-ensembles","224621493":"Achievable data rates of frequency selective Rayleigh fading MIMO burst channels","224142271":"Source-channel rate optimization for progressive image transmission over block fading relay channels [Transactions Papers]","220265411":"Statistical theory of shape under elliptical models and singular value decompositions","256721323":"A new distributed cooperative MIMO scheme for mobile ad hoc networks","228332411":"Positive parity states in 208Pb excited by the proton decay of the isobaric analog intruder resonance j15/2 in 209Bi","38360249":"Estimation of Parameter Matrices and Eigenvalues in MANOVA and Canonical Correlation Analysis","235340029":"Distribution of the Ratio of the Largest Eigenvalue to the Trace of Complex Wishart Matrices","226057092":"The distribution of product of independent beta random variables with application to multivariate analysis","225833591":"Expectations of Functions of Complex Wishart Matrix","243048821":"Estimation of σ in the multiplicative interaction model","220240428":"Special Section on Recent Progress in Antennas and Propagation Researches.","238840112":"Locally minimax test of the equality of two covariance matrices","256606278":"Approximation of Rectangular Beta-Laguerre Ensembles and Large Deviations","240925009":"24 Computations of some multivariate distributions","226857608":"Current Distribution and Random Matrix Ensembles for an Integrable Asymmetric Fragmentation Process","220236338":"MIMO propagation channel modeling","221188669":"A Population Monte Carlo Method for Generating Random Matrices with Known Characteristics.","221170234":"Dual Hop MIMO Relaying with Orthogonal Space-Time Block Codes.","4110118":"Lower and upper bounds of feedback rate on MIMO channels","251893786":"RANDOM MATRICES AND APPLICATIONS TO DATA FILTERING","223615612":"Contributions to multivariate analysis by Professor Yasunori Fujikoshi","260946085":"Exact MIMO Zero-Forcing Detection Analysis for Transmit-Correlated Rician Fading","261355705":"Error rates of DPSK systems with MIMO EGC diversity reception over rayleigh fading channels","267819226":"A REVIEW OF PARAMETRIC HIGH-RESOLUTION METHODS","254363652":"Some Bimatrix Beta Distributions","273192807":"Diversity-multiplexing trade-off of linear dispersion coded multi-input–multi-output systems","24137282":"Enhancement to the sample command","24137283":"Verifying value label mappings","24137284":"Bin smoothing and summary on scatter plots","23631452":"Modifications of the Rayleigh and Bingham Tests for Uniformity of Directions","220127787":"MMSE reception and successive interference cancellation for MIMO systems with high spectral efficiency","24137285":"While loops from the command line","24137286":"A command for randomly resampling a dataset","220129830":"Necessary and sufficient conditions for full diversity order in correlated Rayleigh fading beamforming and combining systems.","24137288":"Survival analysis subroutine for programmers","242997571":"A note on the Cook\u0027s distance","24137289":"Cox proportional hazards model with the exact calculation for ties","224326240":"Reduced Complexity Detection for Ricean MIMO Channels Based on Condition Number Thresholding","241721686":"On the Effects of Moderate Multivariate Nonnormality on Roy\u0027s Largest Root Test","229872269":"Partial differential equations for hypergeometric functions 3F2 of matrix argument","225151529":"Log-convexity properties of Schur functions and generalized hypergeometric functions of matrix argument","232805029":"Distributions of Demmel and Related Condition Numbers","224676386":"On the Capacity Statistics of MIMO Ricean and Rayleigh Fading Channels","23805475":"Zonal Polynomials and Hypergeometric Functions of Quaternion Matrix Argument","225118753":"Distributions of the largest latent root of the multivariate complex Gaussian distribution,Ann. Inst. Statist. Math.,24, 87-94","3434366":"Asymptotic statistics of mutual information for doubly correlated MIMO channels","24137278":"STB-31 through STB-36 available in bound format","256278537":"The distribution of the ratios of characteristics roots (condition numbers) and their applications in principal component or ridge regression","24137279":"Memorium for Stewart West","233429681":"Quadratic Forms in Disguised Matrix T-Variate","246919660":"Linear algebraische Methoden in der numerischen Taxonomie","220326470":"Robust Joint Design of Linear Relay Precoder and Destination Equalizer for Dual-Hop Amplify-and-Forward MIMO Relay Systems","38358331":"Deriving Unbiased Risk Estimators of Multinormal Mean and Regression Coefficient Estimators Using Zonal Polynomials","238496067":"Generalised shape theory via SV decomposition I","7497479":"Tricalysiosides H-O: Ent-kaurane glucosides from the leaves of Tricalysia dubia","224676380":"Eigenvalue Statistics of Finite-Dimensional Random Matrices for MIMO Wireless Communications","243112196":"Unitary invariant and residual independent matrix distributions","232333986":"A triple product identity for Schur functions","220680795":"Grassmannian beamforming for multiple-input multiple-output wireless systems.","222820920":"Extreme Eigenvalue Distributions of Some Complex Correlated Non-Central Wishart and Gamma-Wishart Random Matrices","221641290":"Error rates of DPSK systems with MIMO EGC diversity reception over Rayleigh fading channels","224516833":"Co-ordinate Interleaved Spatial Multiplexing with Channel State Information","243048950":"On Matric Variate-t Distribution","260657157":"Performance of Linear Receivers in Frequency-Selective MIMO Channels","220236463":"Simple Approximation of Largest Eigenvalue Distribution in MIMO Channels Under Nakagami-Rice Fading","224039628":"Observability of a Linear System Under Sparsity Constraints","261087257":"Performance analysis of amplify-and-forward MIMO-OFDM links with linear ZF equalization","3235729":"From Theory to Practice: An overview of MIMO space-time coded wireless systems","38348265":"On the Distribution of the Largest Eigenvalue in Principal Components Analysis","224244477":"Capacity of multiuser multiple input multiple output-orthogonal frequency division multiplexing systems with doubly correlated channels for various fading distributions","224641728":"Largest Eigenvalue Statistics of Double-Correlated Complex Wishart Matrices and MIMO-MRC","267022409":"Locally Minimax Tests","226509347":"Statistical theory of energy levels and random matrices in physics","262766593":"Joint density of eigenvalues in spiked multivariate models","227351072":"Classes of Similar Regions and Their Power Properties for Some Econometric Testing Problems","224641747":"Robust Design of Linear Mimo Transceivers Under Channel Uncertainty","224357102":"Adaptive stack-based iterative precoding for the multiuser MIMO downlink","23631578":"On some distribution problems in Manova and discriminant analysis","243048911":"Further Results on the Trace of a Noncentral Wismart Matrix","259528907":"Distribution of Schur Complement in Noncentral Wishart Matrix with Application to MIMO Zero-Forcing for Rician Fading","3235719":"Largest eigenvalue of complex Wishart matrices and performance analysis of MIMO MRC system","242985410":"Generalized Hermite and Laguerre polynomials in multiple symmetric matrix arguments and their applications","38338033":"Bessel-type functions of matrix variables","3235722":"Analysis and performance of some basic space-time architectures","238522763":"Theoretical Performance and Thresholds of the Multitaper Method for Spectrum Sensing","229880440":"The largest eigenvalue characteristics for MIMO channel with spatial correlation","224131728":"Iterative LMMSE transceiver design for dual-hop AF MIMO relay systems under channel uncertainties","261091423":"Spectral distribution of the exponentially windowed sample covariance matrix","276133799":"Unstructured Versus Structured GLRT for Multipolarization SAR Change Detection","222585488":"The distribution and moments of the smallest eigenvalue of a random matrix of Wishart type","220322550":"Analysis of the Performance and Sensitivity of Eigendecomposition-Based Detectors","261347396":"Random matrix based approach to quantify the effect of measurement noise on Hankel matrix","279310205":"From Random Matrix Theory to Coding Theory: Volume of a Metric Ball in Unitary Group","224205447":"RFID-enabled realtime manufacturing for automotive part and accessory suppliers[J","224152192":"Optimal Relay Selection and Beamforming Strategy in Cooperative Systems with Limited Feedback and Asymptotically Large Number of Relays","261271631":"Enhancing security in the cognitive relay assisted co-existing radio systems with interferences","30518799":"Processus stochastiques matriciels, systèmes de racines et probabilités non commutatives","240906629":"Whittaker\u0027sM k, μ -function of a matrix argument","261314675":"Data fusion based on convex optimization","220087037":"Performance of maximal ratio transmission with two receive antennas.","4857761":"Exact densities for variance estimators of the structural disturbances in simultaneous equations models","3319747":"CFAR matched direction detector","224316076":"Precoding Vector Distribution under Spatial Correlated Channel and Nonuniform Codebook Design","38008246":"Integral identities involving zonal polynomials.","224561812":"Differential CQI optimization for MIMO with codebook based precoding","227764836":"Distribution functions in elasticity","3319752":"Detection of an unknown rank-one component in white noise","3319753":"Equalization of a MIMO channel using FIR inverses","258404505":"Matrix Variate Pareto Distribution of the Second Kind"},"index":284}