{"abs":"This paper gives a non-technical overview of our work on the effeciency of a simple multilevel splitting technique for estimating rare event probabilities. For a particular class of stochastic models, this method is asymptotically optimal provided the splitting factor is properly chosen. However, for more general classes of processes, the method fails to be asymptotically optimal unless the splitting is done in a manner consistent with the dominant way in which the rare event happens (the large deviations behavior). In the absence of such consistency, the method also exhibits a kind of bias in which the estimate is too small with high probability. We briefly contrast our approach with one used in nuclear physics.","title":"A look at multilevel splitting","id":242381173,"url":"https://www.researchgate.net/publication/242381173_A_look_at_multilevel_splitting","names":[],"references":{},"citedIn":{"225392942":"A combined splitting—cross entropy method for rare-event probability estimation of queueing networks","2521220":"Importance Sampling: Approaches And Misconceptions","37616984":"On the Importance Function in Splitting Simulation","2843148":"A Scheme for Adaptive Biasing in Importance Sampling","221330648":"Discrete Event Simulation with Application to Computer Communication Systems Performance","3023205":"A large deviations perspective on the efficiency of multilevel splitting","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","271658880":"Accelerated Consistent Estimation of a High Load Probability in M/G/1 and GI/G/1 Queues*","43492609":"An algorithm for rare-event probability estimation using the product rule of probability theory","220136423":"The Theory of Direct Probability Redistribution and its Application to Rare Event Simulation","3880195":"Efficient simulation of delay in tandem networks using splitting","221527977":"Rare event simulation of delay in packet switching networks using DPR-based splitting","220737205":"Implementation of Importance Splitting Techniques in Stochastic Petri Net Package","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","46103168":"Adaptive particle techniques and rare event estimation"},"index":285}