{"abs":". The satisfiability (SAT) problem is a core problem in mathematical logic and computing theory. In practice, SAT is fundamental in solving many problems in automated reasoning, computer-aided design, computeraided manufacturing, machine vision, database, robotics, integrated circuit design, computer architecture design, and computer network design. Traditional methods treat SAT as a discrete, constrained decision problem. In recent years, many optimization methods, parallel algorithms, and practical techniques have been developed for solving SAT. In this survey, we present a general framework (an algorithm space) that integrates existing SAT algorithms into a unified perspective. We describe sequential and parallel SAT algorithms including variable splitting, resolution, local search, global optimization, mathematical programming, and practical SAT algorithms. We give performance evaluation of some existing SAT algorithms. Finally, we provide a set of practical applicatio...","title":"Algorithms for the Satisfiability (SAT) Problem: A Survey","id":2595109,"url":"https://www.researchgate.net/publication/2595109_Algorithms_for_the_Satisfiability_SAT_Problem_A_Survey","names":["Jun Gu","Paul Purdom","John V. Franco","Benjamin W Wah"],"references":{},"citedIn":{"225291114":"Completeness for Two Left-Sequential Logics","220844321":"Architecture of a Reconfigurable Processor for Implementing Search Algorithm over Discrete Matrices.","220136214":"Automatically finding the control variables for complex system behavior","249595625":"Maximum Satisfiability Problem","220642603":"New tractable classes for default reasoning from conditional knowledge bases","221633317":"(In)Effectiveness of Look-Ahead Techniques in a Modern SAT Solver","269270556":"Using an unrank framework to solve small instances of NP-hard problems on graphical processing units","2380853":"A Distributed Algorithm to Evaluate Quantified Boolean Formulae","251975447":"Lauselogiikan toteutuvuustarkastus: käytännönläheistä teoriaa","220163337":"Towards a Classification of Hamiltonian Cycles in the 6-Cube","220643120":"The Complexity of Boolean Constraint Satisfaction Local Search Problems","221173559":"A Scalable, Loadable Custom Programmable Logic Device for Solving Boolean Satisfiability Problems.","254290738":"APPLYING THE PARTICLE SWARM OPTIMIZER TO NON-STATIONARY ENVIRONMENTS","228934072":"Complexity of continuous, 3-SAT-like constraint satisfaction problems","220081409":"Restoring Satisfiability or Maintaining Unsatisfiability by finding small Unsatisfiable Subformulae","220073789":"Formal Correctness Proof for DPLL Procedure","220642560":"On SAT Instance Classes and a Method for Reliable Performance Experiments with SAT Solvers","268815394":"Novel Analysis of Transition Probabilities in Randomized K-Sat Algorithm","239768160":"Model Predictive Control of Hybrid Systems with Applications to Supply Chain Management","224545609":"Improvement of SAT-Based Model Checking of Security Protocols","4211308":"Change impact analysis for requirement evolution using use case maps","251797804":"Optimization Methods in Logic","222698871":"The design and implementation of a reconfigurable processor for problems of combinatorial computation","220266258":"A Logic for Approximate First-Order Reasoning.","245124783":"Backtracking tactics in the backtrack method for SAT","221220124":"An Improved SAT Algorithm in Terms of Formula Length.","2192919":"Generalized Quantum Turing Machine and its Application to the SAT Chaos Algorithm","4217464":"Bounded Model Checking of Hybrid Dynamical Systems","220924690":"Golden Ratio Annealing for Satisfiability Problems Using Dynamically Cooling Schemes","220643101":"Inference Guiding in Propositional Knowledge Bases.","265100173":"A Backtracking Framework for Beowulf Clusters with an Extension to Multi-cluster Computation and SAT Benchmark Problem Implementation","228712928":"Formal Methods in Development and Testing of Safety-Critical Systems: Railway Interlocking System","220313440":"Experimental complexity analysis of continuous constraint satisfaction problems","242318391":"Hierarchical Approach to Fault Diagnosis","224437033":"An efficient SAT encoding of circuit codes","242934839":"An Introduction to Satisfiability Algorithms","221539175":"Modelling Legal Reasoning in a Mathematical Environment through Model-Theoretic Semantics.","242368553":"Analyzing the Random-Walk Algorithm for SAT","222314270":"Approximating minimal unsatisfiable subformulae by means of adaptive core search","265061779":"Processing Tree-like Data Structures in Different Computing Platforms","2550343":"ILP-Based Engineering Change","221059912":"A Massively-Parallel Easily-Scalable Satisfiability Solver Using Reconfigurable Hardware.","237431360":"Variational Methods in Combinatorial Optimization and Phylogeny Reconstruction","251934060":"Solving SAT problem with a revised hitting set algorithm","2516557":"The Efficiency of Resolution and Davis--Putnam Procedures","271496261":"Exploring limits of parallelism in FPGA-based Boolean satisfiability","267937173":"\"A Hardware Implementation for Multiple Backtracing Algorithm\"","223495487":"Logical and algorithmic properties of stable conditional independence","220305747":"The Unison algorithm: fast evaluation of Boolean expressions","2827352":"Relaxations of the Satisfiability Problem Using Semidefinite Programming","239542835":"Restart method and exponential acceleration of random 3SAT instances resolutions: a large deviation analysis of the Davis-Putnam-Loveland-Logemann algorithm","222493498":"Elliptic approximations of propositional formulae","51942756":"Boolean Satisfiability using Noise Based Logic","222683448":"Controlled generation of hard and easy Bayesian networks: Impact on maximal clique size in tree clustering","221644617":"Evaluating ASP and commercial solvers on the CSPLib (Preliminary work)","273472205":"Dealing With 4-Variables by Resolution: An Improved MaxSAT Algorithm","228739872":"Combining Algebraic and Side-Channel Cryptanalysis against Block Ciphers","228601124":"Implementation of the Advanced SAT Search Techniques in Reconfigurable Hardware","2939050":"Input Generation for Path Coverage in Software Testing","38229185":"Intuitive algorithms","2406563":"Improving a Fixed Parameter Tractability Time Bound for the Shadow Problem","30530394":"SAT-Based Decision Procedures for Automated Reasoning: a Unifying Perspective","227039492":"Accelerating Branch-and-Bound through a Modeling Language Construct for Relaxation-Specific Constraints","220305841":"FPGA-based hardware acceleration for Boolean satisfiability","3927720":"A minimal-state processing search algorithm for satisfiability problem","267264378":"Design and Analysis of Human Identification Protocols","260324625":"Initialization and Restart in Stochastic Local Search: Computing a Most Probable Explanation in Bayesian Networks","222691795":"Heuristic average-case analysis of the backtrack resolution of random 3-Satisfiability instances","277164060":"Using Join Networks to Compute Satisfiability","228669243":"Design Methods for FPGA-based implementation of combinatorial Search Algorithms","255646631":"Satisfação booleana: algoritmos, aplicações, implementações","220532101":"New worst-case upper bounds for SAT","226030555":"Continuous Approaches for Solving Discrete Optimization Problems","262537987":"Markov chain algorithms: A template for building future robust low power systems","268524199":"SMT-based Cost Optimization Approach for the Integration of Avionic Functions in IMA and TTEthernet Architectures","3250328":"Applied Boolean equivalence verification and RTL static sign-off","240761586":"Efficiency Analysis of Asynchronic Parallelization of Randomized Algorithms","2601098":"The Role of a Skeptic Agent in Testing and Benchmarking of SAT Algorithms","220643208":"A cost-reducing question-selection algorithm for propositional knowledge-based systems","220706708":"A New Reduction from 3SAT to n-Partite Graphs","227990816":"Analysis of Backtracking Procedures for Random Decision Problems","3809932":"Why is ATPG easy?","262406418":"Investigation of Maximum and Minimum Satisfiability Problems Using L -Partition","220648863":"Why is Combinational ATPG Efficiently Solvable for Practical VLSI Circuits?","2918549":"Acceleration of Satisfiability Algorithms by Reconfigurable Hardware","3980423":"Custom computing machines for the set covering problem","11837961":"An Information-Based Neural Approach to Constraint Satisfaction","45861501":"The SAT solving method as applied to cryptographic analysis of asymmetric ciphers","220639723":"Reactive search, a history-sensitive heuristic for MAX-SAT","2835710":"Solving Satisfiability Problems Using Elliptic Approximations. A Note on Volumes and Weights","2437362":"A SAT Solver Using Reconfigurable Hardware and Virtual Logic","237595891":"A rule language and framework for RFID data capture and processing in manufacturing enterprise system","2537722":"An Improved Semidefinite Programming Relaxation for the Satisfiability Problem","2390212":"Automatic Generation of Implied Clauses for SAT","4369059":"Asynchronous team algorithms for Boolean Satisfiability","267968283":"A review of the literature on local search algorithms for MAX-SAT","226852710":"Complete and Exact Peptide Sequence Analysis Based on Propositional Logic","220726220":"Model Checking Firewall Policy Configurations","220135928":"Finding robust solutions in requirements models","202051296":"Dynamic Meta Learning","220532169":"Formal Verification of a Generic Framework to Synthetize SAT-Provers.","2495179":"The Role of a Skeptic Agent in Testing and Benchmarking of SAT Algorithms","226593651":"On semidefinite programming relaxations for the satisfiability problem","224101800":"Using a Constraint Satisfaction Formulation and Solution Techniques for Random Test Program Generation","222693810":"Nagging: A scalable fault-tolerant paradigm for distributed search","45459008":"DNA Computation: Applications and Perspectives","2507984":"Stochastic Boolean Satisfiability","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","220464164":"A Combinatorial Optimization Approach for Determining Composition and Sequence of Polymers","247336891":"RBAC Schema Verification Using Lightweight Formal Model and Constraint Analysis","251470840":"Chapter 2 Satisfiability Solvers","220204077":"Developing test systems for multi-modules hardware designs","220760101":"Hardware/Software Implementation of FPGA-Targeted Matrix-Oriented SAT Solvers.","239500616":"Design and Implementation of a Graph-Based Constraint Model for Local Search","23936099":"Graph-Based Local Elimination Algorithms in Discrete Optimization","35228939":"Searching for truth : techniques for satisfiability of Boolean formulas /","221335588":"Parallel Heuristic Search in Haskell","242427755":"Programming Relaxation for the Satisflability Problem","2645296":"The Propositional Formula Checker HeerHugo","220694077":"On the simulation order of proof systems.","2436920":"New Tractable Cases in Default Reasoning from Conditional Knowledge Bases","220081214":"Statistical physics analysis of the backtrack resolution of random 3-SAT instances","220090431":"New Updating Criteria for Conflict-Based Branching Heuristics in DPLL Algorithms for Satisfiability","3337494":"A software/reconfigurable hardware SAT solver","221353492":"SAT-Based Branch \u0026 Bound and Optimal Control of Hybrid Dynamical Systems.","220568588":"A Complete Adaptive Algorithm for Propositional Satisfiability.","241087860":"Using Analysis Patterns to Uncover Specification Errors","220099632":"On the orthogonalization of arbitrary Boolean formulae","220944411":"Resolution Tunnels for Improved SAT Solver Performance","220642834":"An Overview of Backtrack Search Satisfiability Algorithms","222680689":"Understanding the role of noise in stochastic local search: Analysis and experiments","2573586":"Instance-Specific Accelerators for Minimum Covering","43510688":"Splitting Methods for Efficient Combinatorial Counting and Rare-Event Probability Estimation","223818857":"Worst-case study of local search for MAX-k-SAT","222505596":"Reactive local search techniques for the maximum k-conjunctive constraint satisfaction problem (MAX-k-CCSP)","4320003":"Recursive versus Iterative Algorithms for Solving Combinatorial Search Problems in Hardware","220350560":"Constraint acquisition for Entity-Relationship models","228744420":"Algoritmos Evolutivos-Estudio de Escalabilidad sobre el Problema COUNTSAT","228578520":"ELVIS-Amortized Complexity Analysis of a Pipelined Parallel Implication Circuit Using Single Cycle Paging","220944483":"Bounded Model Checking with QBF","221186151":"Unrestricted vs Restricted Cut in a Tableau Method for Boolean Circuits","251931212":"An algorithm based on resolution for the satisfiability problem","228450006":"Detecting Conflict-Free Argumentative or Abductive Knowledge Bases","242515775":"Investigations into Satisfiability Search","263539454":"The Propositional Formula Checker HeerHugo","220349039":"Random k-GD-Sat Model and its Phase Transition.","229002985":"Todistuskompleksisuudesta Boolen piirien toteutuvuustarkastuksessa","220568689":"A satisfiability procedure for quantified Boolean formulae","3805027":"Dynamic circuit generation for Boolean satisfiability in an object-oriented design environment","4290328":"An Efficient, Scalable Hardware Engine for Boolean SATisfiability","221326954":"Finding SHA-2 Characteristics: Searching through a Minefield of Contradictions","242302253":"8 Analysis ofBacktracking Procedures forRandomDecision Problems","228940537":"Empirical analysis and optimization of an NP-hard algorithm using CSP and FDR","4150626":"Toward a model for backtracking and dynamic programming","242432812":"Using a constraint satisfaction formulation and solution techniques","220806217":"The Quest for Efficient Boolean Satisfiability Solvers","222994987":"Bounded List Injective Homomorphism for Comparative Analysis of Protein-Protein Interaction Graphs","221257298":"The complexity of verifying memory coherence","225694233":"How Many Needles are in a Haystack, or How to Solve #P-Complete Counting Problems Fast","220884033":"Understanding the Value of Software Engineering Technologies","220068974":"A Comparative Study of Software Model Checkers as Unit Testing Tools: An Industrial Case Study","225371162":"Evaluating ASP and commercial solvers on the CSPLib","29596853":"On the use of unfoldings to abstract communicating automata into sets of scenarios","242923266":"Restarts and Exponential Acceleration of the Davis–Putnam–Loveland–Logemann Algorithm: A Large Deviation Analysis of the Generalized Unit Clause Heuristic for Random 3SAT","2505055":"On the Complexity of Unsatisfiability Proofs for Random k-CNF Formulas","246844362":"Model Checking with Quantified Boolean Formulas","2509144":"Tight Integration of Combinational Verification Methods","257582116":"Analysis and Solving SAT and MAX-SAT Problems Using an L-partition Approach","2917288":"Proof Complexity of Cut-Based Tableaux for Boolean Circuit Satisfiability Checking","261045258":"Learning Project Management Decisions: A Case Study with Case-Based Reasoning versus Data Farming","4195782":"Efficient Exact Spare Allocation via Boolean Satisfiability","221543091":"Average Time Complexity of the SAT 1.2 Algorithm.","220444331":"Towards Verification of Java Programs in perICS.","220698286":"Parallel resolution of the satisfiability problem (SAT) with OpenMP and MPI","238680499":"A Probabilistic Study of 3SATISFIABILITY","4231119":"Design tools for reconfigurable embedded systems","257680596":"A Taxonomy of Exact Methods for Partial Max-SAT","257909965":"Satisfiability in composition-nominative logics","234828905":"Satisfiability in semiring constraint satisfaction problems","220944572":"Adding a New Conflict Based Branching Heuristic in two Evolved DPLL SAT Solvers","232641607":"Toward a Model for Backtracking and Dynamic Programming","227979784":"Parallel Resolution of the Satisfiability Problem: A Survey","4226014":"A Modular Partitioning Approach for Asynchronous Circuit Synthesis","221632683":"Solving Boolean Satisfiability Using Local Search Guided by Unit Clause Elimination","221030067":"Applying Reduction Techniques to Software Functional Requirement Specifications","226869796":"The Complexity of Checking Consistency of Pedigree Information and Related Problems","3032458":"Logic-Based Solution Methods for Optimal Control of Hybrid Systems","2191759":"Estimation of Complexity for the Ohya-Masuda-Volovich SAT Algorithm","220511380":"Solving Peptide Sequencing as Satisfiability","220121260":"A Logic-Based Approach to Polymer Sequence Analysis","220204179":"Programming for modular reconfigurable robots","221440647":"A Clause-Based Reduction from k-SAT to CLIQUE.","232644203":"Recursion in Hardware: Applicability and Implementation Strategies","28076059":"Una introducción a los algoritmos de satisfactibilidad","242452420":"USING COMPRESSION/DECOMPRESSION TECHNIQUE FOR FPGA TARGETED MATRIX-ORIENTED SAT SOLVERS","2536860":"UnitWalk: A New SAT Solver that Uses Local Search Guided by Unit Clause Elimination","221622926":"Solving SAT Problem with Boolean Algebra","4057985":"A logic-based hybrid solver for optimal control of hybrid systems","3832199":"A probabilistic algorithm for k-SAT and constraint satisfaction problems","220944534":"Zchaff2004: An efficient SAT solver","241128350":"Incomplete Algorithms (draft v2)","257144978":"The set of parameterized -covers problem","228921453":"Emergence of collective intelligence in stochastic local search-and-optimization systems","225456313":"Reconfigurable Hardware SAT Solvers: A Survey of Systems","3044834":"Reconfigurable hardware SAT solvers: A survey of systems","220565739":"Propositional Satisfiability and Constraint Programming: A comparative survey","220806393":"Evaluating Search Heuristics and Optimization Techniques in Propositional Satisfiability","221604580":"Combining Inference and Search for the Propositional Satisfiability Problem.","225158842":"Bounded Synthesis","3560421":"A divide-and-conquer approach for asynchronous interface synthesis","277298002":"UNIVERSITY of CALIFORNIA SANTA CRUZ COMPLEXITY ANALYSIS OF A MASSIVELY PARALLEL BOOLEAN SATISFIABILITY IMPLICATION CIRCUIT","1956298":"Approximate analysis of search algorithms with \"physical\" methods","2955258":"Reconfigurable accelerators for combinatorial problems","268889553":"Proofs of Unsatisfiability Via Semidefinite Programming","220586235":"On optimizing the satisfiability (SAT) problem","220160193":"T-satplan: A SAT-based temporal planner","220163325":"An Extended Semidefinite Relaxation for Satisfiability","245124990":"A Weight-Balanced Branching Rule for SAT","2806217":"A Software Framework for Integrating Search Paradigms","2486211":"Modular Robot Control and Continuous Constraint Satisfaction","224099516":"On the Security of PAS (Predicate-Based Authentication Service)","244139367":"Probabilistic Methods in Landscape Analysis: phase transitions, interaction structures, and complexity measures","2886599":"On Exact Selection of Minimally Unsatisfiable Subformulae","221291741":"Algebraic side-channel attacks on the AES: Why time also matters in DPA","5402016":"Search for Steady States of Piecewise-Linear Differential Equation Models of Genetic Regulatory Networks","222498484":"New methods for 3-SAT decision and worst-case analysis","220759775":"Solving SAT with a Context-Switching Virtual Clause Pipeline and an FPGA Embedded Processor.","262352985":"On Parameterized Intractability","3954626":"Automated equivalence checking of switch level circuits","220370141":"Parallel Multithreaded Satisfiability Solver: Design and Implementation"},"index":286}