{"abs":"We introduce a new sampling algorithm, the equi-energy sampler, for efficient statistical sampling and estimation. Complementary to the widely used temperature-domain methods, the equi-energy sampler, utilizing the temperature--energy duality, targets the energy directly. The focus on the energy function not only facilitates efficient sampling, but also provides a powerful means for statistical estimation, for example, the calculation of the density of states and microcanonical averages in statistical mechanics. The equi-energy sampler is applied to a variety of problems, including exponential regression in statistics, motif sampling in computational biology and protein folding in biophysics.","title":"Equi-energy sampler with applications in statistical inference and statistical mechanics","id":2120858,"url":"https://www.researchgate.net/publication/2120858_Equi-energy_sampler_with_applications_in_statistical_inference_and_statistical_mechanics","names":["Supeng Kou","Qing Zhou","Wing Hung Wong","The Annals of Statistics"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","1866589":"Exchange Monte Carlo Method and Application to Spin Glass Simulations","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","200105001":"Equation of State by Fast Computing Machines","221669680":"Stochastic Relaxation, Gibbs Distributions,and the Bayesian Restoration of Images","20237426":"Identifying protein-binding sites from unaligned DNA fragments","20982984":"Sequence Logos: A New Way to Display Consensus Sequences","265369049":"Slice sampling. (With discussions and rejoinder)","222071733":"Multicanonical algorithms for 1st order phase-transitions","10144144":"Reductive Cleavage of Disulfide Bridges in Ribonuclease","6963041":"A study of density of states and ground states in hydrophobic-hydrophilic protein folding models by equi-energy sampling","14219476":"From Levinthal to pathways to funnels [J]","20972493":"An Expectation Maximization (EM) Algorithm for the Identification and Characterization of Common Sites in Unaligned Biopolymer Sequences","221669734":"Equations of State Calculations by Fast Computing Machines","2859706":"Convergence of Slice Sampler Markov Chains","231691677":"A Lattice Statistical Mechanics Model of the Conformational and Sequence Spaces of Proteins","242577766":"Annealing Markov Chain Monte Carlo with Applications to Ancestral Inference","13498718":"Finding DNA Regulatory Motifs within Unaligned Non-Coding Sequences Clustered by Whole-Genome mRNA Quantitation","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","4772050":"Perfect slice samplers","38326994":"Computational Discovery of Gene Regulatory Binding Motifs: A Bayesian Perspective","4993431":"Bayesian analysis of single-molecule experimental data","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","243773529":"Markov chain Monte Carlo Maximum Likelihood","15615537":"Bailey, T.L. \u0026 Elkan, C. Fitting a mixture model by expectation maximization to discover motifs in biopolymers. Proc. Int. Conf. Intell. Syst. Mol. Biol. 2, 28-36","38357609":"Markov Chains for Exploring Posterior Distributions","2364420":"Bioprospector: Discovering Conserved Dna Motifs In Upstream Regulatory Regions Of Co-Expressed Genes","264908393":"Imputation Using Markov Chains","271512970":"Slice sampling (with discussion)","38357612":"Discussion: Markov Chains for Exploring Posterior Distributions","265681840":"Sequential Imputations and Bayesian Missing Data Problems","14988418":"Detecting Subtle Sequence Signals: A Gibbs Sampling Strategy for Multiple Alignment","1990329":"Simulated Tempering: A New Monte Carlo Scheme","1828275":"Determining the density of states for classical statistical models: A random walk algorithm to produce a flat histogram","200104901":"A Guide to Monte Carlo Simulation in Statistical Physics","13330658":"Generalization of the Fortuin-Kasteleyn-Swendsen-Wang representation and Monte Carlo algorithm. Phys. Rev. D 38: 2009-2012","243776875":"Spatial Statistics and Bayesian Computing","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","2442825":"Estimating Normalizing Constants and Reweighting Mixtures in Markov Chain Monte Carlo","4744166":"Real-Parameter Evolutionary Monte Carlo With Applications to Bayesian Mixture Models","12069783":"Liu, X., Brutlag, D.L. \u0026 Liu, J.S. BioProspector: discovering conserved DNA motifs in upstream regulatory regions of co-expressed genes. Pac. Symp. Biocomput. 6, 127-138","243775157":"Simulating Ratios of Normalizing Constants via a Simple Identity: A Theoretical Exploration","8412723":"Zhou, Q. \u0026 Wong, W.H. CisModule: De novo discovery of cis-regulatory modules by hierarchical mixture modeling. Proc. Natl. Acad. Sci. USA 101, 12114-12119","2469075":"Auxiliary Variable Methods for Markov Chain Monte Carlo with Applications","244507428":"The Collapsed Gibbs Sampler in Bayesian Computations with Applications to a Gene Regulation Problem","227643751":"Perfect slice samplers","229078814":"Bayesian Models for Multiple Local Sequence Alignment and Gibbs Sampling Strategies"},"citedIn":{"41435384":"Genomewide Multiple-Loci Mapping in Experimental Crosses by Iterative Adaptive Penalized Regression","245491746":"Non-linear Markov Chain Monte Carlo","280932795":"State-dependent swap strategies and automatic reduction of number of temperatures in adaptive parallel tempering algorithm","51969309":"Fluctuations of Interacting Markov Chain Monte Carlo Models","47373275":"Quantitative approximations of evolving probability measures and\nsequential Markov Chain Monte Carlo methods","50996224":"Handbook of Monte Carlo Methods","288918323":"Exploiting molecular dynamics in Nested Sampling simulations of small peptides","259119101":"An evolutionary Monte Carlo algorithm for Bayesian block clustering of data matrices","48195025":"Parallel Tempering with Equi-Energy Moves","51938199":"An Adaptive Interacting Wang-Landau Algorithm for Automatic Density Exploration","220286771":"Computational methods for complex stochastic systems: A review of some alternatives to MCMC","271753760":"Resampling Markov Chain Monte Carlo Algorithms: Basic Analysis and Empirical Comparisons","4743133":"Learning Causal Bayesian Network Structures From Experimental Data","45341222":"Bayesian inversion by parallel interacting Markov chains","228677431":"Convergence of adaptive MCMC algorithms: Ergodicity and law of large numbers","228935730":"Spectral Gaps of Simulated Tempering for Bimodal Distributions","26284553":"Energy landscape of a spin-glass model: Exploration and characterization","51916417":"A central limit theorem for adaptive and interacting Markov chains","225444586":"Integrating production data under uncertainty by parallel interacting Markov chains on a reduced dimensional space","23991411":"On the use of stochastic approximation Monte Carlo for Monte Carlo integration","44655671":"Thermodynamics of RNA structures by Wang–Landau sampling","225074890":"Non-asymptotic Error Bounds for Sequential MCMC Methods in Multimodal\nSettings","262841099":"Forgetting the starting distribution in finite interacting tempering","230569757":"On the Convergence Rates of Some Adaptive Markov Chain Monte Carlo\nAlgorithms","48207611":"Estimating and Understanding Exponential Random Graph Models","251424216":"Bayesian calibration and uncertainty analysis of hydrological models: A comparison of adaptive Metropolis and sequential Monte Carlo samplers","254438287":"Bayesian Model Averaging in the Instrumental Variable Regression Model","221700496":"Convergence of adaptive and interacting Markov chain Monte Carlo\nalgorithms","238391059":"Bayesian methods in hydrology: A study of recent advancements in Markov chain Monte Carlo techniques","261751868":"Implementation of Estimating Function-Based Inference Procedures with Markov Chain Monte Carlo Samplers [with Comments, Rejoinder]","254281743":"A Multiresolution Method for Parameter Estimation of Diffusion Processes","277238063":"Lower bounds on the convergence rates of adaptive MCMC methods","50413482":"History matching of approximated lithofacies models under uncertainty","51967667":"Likelihood-Free Parallel Tempering","224854476":"Modeling nucleic acids","48419023":"Sequentially interacting Markov chain Monte Carlo methods","45797268":"Conformational Optimization with Natural Degrees of Freedom: A Novel Stochastic Chain Closure Algorithm","6810697":"Computational Biology: Toward Deciphering Gene Regulatory Information in Mammalian Genomes","40769344":"Feature Article Basic Ingredients of Free Energy Calculations: A Review","1742645":"Principle of detailed balance and convergence assessment of Markov Chain Monte Carlo methods and simulated annealing","24111936":"Resampling from the past to improve on MCMC algorithms","51916712":"On nonlinear Markov chain Monte Carlo","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","23936216":"Reconstructing the energy landscape of a distribution from Monte Carlo samples","281814009":"Kullback-Leibler Divergence-Based Differential Evolution Markov Chain Filter for Global Localization of Mobile Robots","265808111":"THESE DE DOCTORAT DE L\u0027UNIVERSITE PIERRE ET MARIE CURIE","257069419":"Finite Sample Properties of Adaptive Markov Chains via Curvature","235903537":"Convergence rate of Markov chain methods for genomic motif discovery","46582137":"Multiplicative random walk Metropolis-Hastings on the real line","5207567":"Population-Based Reversible Jump Markov Chain Monte Carlo","5792921":"Probing Protein Fold Space with a Simplified Model","262533220":"A Bayesian clustering approach for detecting gene-gene interactions in high-dimensional genotype data","233720741":"Small World MCMC with Tempering: Ergodicity and Spectral Gap","228102867":"Adaptive Equi-Energy Sampler : Convergence and Illustration","278016350":"Differential Evolution Markov Chain Filter for Global Localization","25214925":"Clustering","254405606":"A Class of Adaptive Importance Sampling Weighted EM Algorithms for Efficient and Robust Posterior and Predictive Simulation","51691460":"Convergence of the Equi-Energy Sampler and Its Application to the Ising Model.","275957157":"Parallel tempering with equi-energy moves for training of restricted boltzmann machines","24167977":"Divide and Conquer: A Mixture-Based Approach to Regional Adaptation for MCMC","227369174":"The Multiset Sampler","262426111":"Parallel Tempering MCMC Acceleration Using Reconfigurable Hardware","46588058":"Interacting Markov Chain Monte Carlo Methods For Solving Nonlinear Measure-Valued Equations","230724252":"Inference of Causal Networks from Time-Varying Transcriptome Data via Sparse Coding","268228129":"Parallel Tempering for Dynamic Generalized Linear Models","223779720":"Interacting sequential Monte Carlo samplers for trans-dimensional simulation","265675441":"Bayesian Inference of Viral Recombination: Topology distance between DNA segments and its distribution DNA","23757708":"A cautionary tale on the efficiency of some adaptive Monte Carlo schemes","228562553":"Evolutionary Monte Carlo Methods for Clustering","5127721":"Metropolis Algorithm and equienergy sampling for two mean field spin systems","228562552":"Comments on Article by Yin","228275312":"A Class of Adaptive EM-Based Importance Sampling Algorithms for Efficient and Robust Posterior and Predictive Simulation","220286671":"On population-based simulation for static inference","255971761":"Sequential Markov Chain Monte Carlo","254212178":"Comment on article by Manolopoulou et al","264779580":"An Overview of Stochastic Approximation Monte Carlo","237636572":"Detecting Cis-Regulatory Modules by Modeling Correlated Structures in Genomic Sequences","30513064":"INVERSION DES MODELES STOCHASTIQUES DE MILIEUX HETEROGENES","252341360":"Adaptive Markov Chain Monte Carlo: Theory and Methods","220286431":"Efficient Monte Carlo simulation via the generalized splitting method"},"index":294}