{"abs":"Fingerprinting means making copies of the same data identifiable by hiding additional information (a fingerprint) in the data. Embedding the additional data can be done by watermarking techniques, which are mainly a branch of signal processing. Most watermarking methods, however, do not treat colluding adversaries who have obtained more than one copy, compare their copies, see differences and use this information to make a copy without a fingerprint. Therefore, there are cryptographic fingerprinting methods to obtain collusion tolerance on top of a watermarking layer. But the most important fingerprinting method by Boneh and Shaw excludes a priori any errors on the watermarking layer, i.e., it is assumed that no changes to the fingerprint occur except those based on the information from collusion attacks. This is a stronger assumption than what most underlying watermarking schemes offer. This assumption can be justified by making each individual mark fault-tolerant on the watermarking layer, e.g., by replication, but that would imply a significant increase in the data size needed. Instead, here we implement the fault tolerance more efficiently on the cryptographic layer by generalizing Boneh and Shaw’s fingerprinting methods. Our remaining assumption on the underlying watermarking is quite reasonable for watermarking methods that would be built according to the best currently known principles.","title":"Error- and Collusion-Secure Fingerprinting for Digital Data","id":220722235,"url":"https://www.researchgate.net/publication/220722235_Error-_and_Collusion-Secure_Fingerprinting_for_Digital_Data","names":["Hans-Jürgen Guth","Birgit Pfitzmann"],"references":{"227314253":"A secure, robust watermark for multimedia","220533734":"Combinatorial Properties and Constructions of Traceability Schemes and Frameproof Codes","222669638":"Secure frameproof codes, key distribution patterns, group testing algorithms and related structures","221348277":"A Note on the Limits of Collusion-Resistant Watermarks.","3080073":"Tracing Traitors","247290034":"Protocols for collusion-secure asymmetric ngerprinting","220797062":"Robustness and Security of Digital Watermarks.","225504448":"Asymmetric Fingerprinting","2611541":"Resistance of Digital Watermarks to Collusive Attacks","2293104":"Protocols for Collusion-Secure Asymmetric Fingerprinting (Extended Abstract)","225461223":"A Note on the Limits of Collusion-Resistant","2617808":"Asymmetric Fingerprinting for Larger Collusions","3079606":"Collusion-secure fingerprinting for digital data","221355021":"Fingerprinting Long Forgiving Messages","225173972":"Attacks on Copyright Marking Systems","2848532":"The Probabilistic Method","220695960":"The Probabilistic Method"},"citedIn":{"238346806":"Robust fingerprinting codes: A near optimal construction","251956736":"Robust parent-identifying codes","238109239":"A Digital Fingerprinting Algorithm Based on Binary Codes","220766881":"Worst-Case Optimal Fingerprinting Codes for Non-threshold Collusion","220348590":"Gossip Codes for Fingerprinting: Construction, Erasure Analysis and Pirate Tracing.","220942117":"Watermill: an Optimized Fingerprinting Tool for Highly Constrained Data","2864441":"Optimal Probabilistic Fingerprint Codes","220905144":"Systematic Treatment of Collusion Secure Codes: Security Definitions and Their Relations","3318566":"Anti-Collusion Fingerprinting for Multimedia","3338791":"Soft-decision tracing in fingerprinted multimedia content","220240182":"Fingerprinting Codes for Internet-Based Live Pay-TV System Using Balanced Incomplete Block Designs","221523758":"Fingerprinting Schemes. Identifying the Guilty Sources Using Side Information","225366004":"An improvement of discrete Tardos fingerprinting codes","30513486":"Courbes elliptiques et applications cryptographiques à la diffusion numérique sécurisée","224647234":"On Watermarking/Fingerprinting for Copyright Protection","227171244":"Digital rights management for digital cinema","3455250":"The Boneh–Shaw Fingerprinting Scheme is Better Than We Thought","224219770":"Tardos Fingerprinting Codes in the Combined Digit Model","220722190":"Optimization and Evaluation of Randomized c-Secure CRT Code Defined on Polynomial Ring","220335247":"Making Collusion-Secure Codes (More) Robust against Bit Erasure.","4068111":"On gossip codes and traceability schemes","46119692":"Anti-Collusion Fingerprinting for Multimedia Content Protection","3319041":"Identification of Traitors in Algebraic-Geometric Traceability Codes","220337174":"Traitor tracing scheme with constant ciphertext rate against powerful pirates","221609344":"Collusion Secure q-ary Fingerprinting for Perceptual Content","257636194":"A collusion attack optimization framework toward spread-spectrum fingerprinting","220784914":"Experimental Assessment of Probabilistic Fingerprinting Codes over AWGN Channel","220833941":"A Block Oriented Fingerprinting Scheme in Relational Database","221160686":"Key Management for Multicast Fingerprinting","220333795":"Tardos Fingerprinting Codes in the Combined Digit Model.","3449334":"Fingerprinting relational databases: Schemes and specialties","2495842":"Quantization Watermarking","41440561":"Encryption mechanisms for digital content distribution","220460658":"On error-correcting fingerprinting codes for use with watermarking","26532294":"Group-Oriented Fingerprinting for Multimedia Forensics","220739323":"An ID Coding Scheme for Fingerprinting, Randomized c-Secure CRT Code","224101512":"Tardos fingerprinting codes in the combined digit model","220990584":"A General Conversion Method of Fingerprint Codes to (More) Robust Fingerprint Codes against Bit Erasure","220722290":"Tardos’s Fingerprinting Code over AWGN Channel","220333173":"Robust Parent-Identifying Codes and Combinatorial Arrays","221609583":"Traitor Tracing for Shortened and Corrupted Fingerprints","277232861":"Tatouage des bases de données","221135090":"Constructing a virtual primary key for fingerprinting relational data","224083719":"Audio watermarking in compressed domain","225190670":"An Error-Tolerant Variant of a Short 2-Secure Fingerprint Code and Its Security Evaluation","220722240":"An Improvement of Short 2-Secure Fingerprint Codes Strongly Avoiding False-Positive","258407567":"Information Hiding","3297880":"WATERMILL: An optimized fingerprinting system for databases under constraints","3976022":"Efficient identification of traitors in fingerprinted multimedia contents","258407434":"Information Theoretic Security","220722122":"A Collusion-Secure Fingerprinting Code Reduced by Chinese Remaindering and Its Random-Error Resilience","264273967":"Digital rights management for digital cinema","4044233":"Copyright protection based on transaction watermarks","2496734":"Capacity Of Digital Watermarks Subjected To An Optimal Collusion Attack","221609421":"Traitor Tracing with Constant Size Ciphertext","26543341":"Novel Attacks on Spread-Spectrum Fingerprinting"},"index":296}