{"abs":"A traceability scheme is a broadcast encryption scheme such that a data supplier T can trace malicious authorized users (traitors) who gave a decryption key to an unauthorized user (pirate). This paper first derives lower bounds on the sizes of keys and ciphertexts. These bounds are all tight because an optimum one-time use scheme is also presented. We then propose a multiple-use scheme which approximately meets our bounds. This scheme is proven to be secure as well as much more efficient than the schemes by Chor, Fiat and Naor. Finally, practical types of asymmetric schemes with arbiter are discussed in which T cannot frame any authorized user as a traitor.","title":"Optimum Traitor Tracing and Asymmetric Schemes.","id":221348217,"url":"https://www.researchgate.net/publication/221348217_Optimum_Traitor_Tracing_and_Asymmetric_Schemes","names":["Kaoru Kurosawa","Yvo Desmedt"],"references":{"220533734":"Combinatorial Properties and Constructions of Traceability Schemes and Frameproof Codes","221591377":"How to share a function securely","226497735":"Threshold cryptosystems","3080073":"Tracing Traitors","221355190":"Threshold Cryptosystems.","246890192":"Multi-sender network security: efficient authenticated multicast/feedback","221354749":"Multiparty Computations Ensuring Privacy of Each Party’s Input and Correctness of the Result","3535129":"Multi-receiver/multi-sender network security: Efficient authenticated multicast/feedback","220533066":"Perfect Homomorphic Zero-Knowledge Threshold Schemes over any Finite Abelian Group.","221348449":"A Threshold Cryptosystem without a Trusted Party (Extended Abstract).","242379939":"Multiparty computations ensuring secrecy of each party\u0027s input and correctness of the output","234778924":"How to play ANY mental game","2617808":"Asymmetric Fingerprinting for Larger Collusions","225435767":"A Threshold Cryptosystem without a Trusted Party","221591851":"How to Play any Mental Game or A Completeness Theorem for Protocols with Honest Majority","220722201":"Trials of Traced Traitors."},"citedIn":{"238346806":"Robust fingerprinting codes: A near optimal construction","249837805":"A Fully Public Key Tracing and Revocation Scheme Provably Secure Against Adaptive Adversary","267436282":"A Generic View on Trace-and-Revoke Broadcast Encryption Schemes","223415130":"Cryptographic methods for collusion-secure fingerprinting of digital data","242499706":"E-Commerce and Web Technologies, Third International Conference, EC-Web 2002, Aix-en-Provence, France, September 2-6, 2002, Proceedings","220898597":"Fully Collusion Resistant Black-Box Traitor Revocable Broadcast Encryption with Short Private Keys","220271918":"Improving the Round Complexity of Traitor Tracing Schemes","2864441":"Optimal Probabilistic Fingerprint Codes","228578700":"Digital Contents Delivery System using Broadcast Encryption","221609254":"Breaking and Repairing Asymmetric Public-Key Traitor Tracing","221291556":"Accountable Privacy","238669088":"Group-Oriented Encryption and Signature","225171057":"A Public-Key Traitor Tracing Scheme with Revocation Using Dynamic Shares","226265959":"Trade-Off Traitor Tracing","226932635":"A Code for Sequential Traitor Tracing","264979670":"Remarks on the Cryptographic Primitive of Attribute-based Encryption","242703465":"Copyright Protection with Traitor Tracing schemes and supplying undeniable proof of the traitor\u0027s treachery by means of Asymmetric Traitor Tracing","225166453":"An Efficient Single-Key Pirates Tracing Scheme Using Cover-Free Families","221017357":"An Anonymous Asymmetric Public Key Traitor Tracing Scheme.","221347856":"Extracting Group Signatures from Traitor Tracing Schemes","238720025":"Public Key Cryptography, 4th International Workshop on Practice and Theory in Public Key Cryptography, PKC 2001, Cheju Island, Korea, February 13-15, 2001, Proceedings","221609491":"A fully collusion resistant broadcast, trace, and revoke system","221169158":"Security Flaws in Kuribayashi-Tanaka Fingerprinting Protocol","225225536":"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys","220333324":"Building Efficient Fully Collusion-Resilient Traitor Tracing and Revocation Schemes.","257487991":"Toward tracing and revoking schemes secure against collusion and any form of secret information leakage","261850795":"A Flexible-Revocation Scheme for Efficient Public-Key Black-Box Traitor Tracing*A preliminary version of this paper was presented at Fourth International Conference on Information and Communications Security (ICICS 2002) [1].","4068111":"On gossip codes and traceability schemes","221355522":"An Efficient Public Key Traitor Tracing Scheme","220271893":"A Traitor Tracing Scheme Based on RSA for Fast Decryption","220337174":"Traitor tracing scheme with constant ciphertext rate against powerful pirates","220335641":"Fully Resilient Traitor Tracing Scheme using Key Update.","220271900":"Fighting Pirates 2.0","220713575":"Revocation Systems with Very Small Private Keys","42803404":"Programming Highly Parallel Reconfigurable Architectures for Symmetric and Asymmetric Cryptographic Applications","221355376":"Self Protecting Pirates and Black-Box Traitor Tracing","220337248":"Efficient Traitor Tracing Algorithms using List Decoding.","225736496":"Efficient broadcast encryption scheme based on number theory research unit","221651825":"Improved Algebraic Traitor Tracing Scheme.","220292966":"Wireless broadcast encryption based on smart cards","226813900":"An improved traitor tracing scheme based on bilinear map","251817805":"A Traitor Tracing Scheme Based on the RSA Scheme","237665913":"Fully Collusion-Resilient Traitor Tracing Scheme","3901551":"Information hiding for EC: public key traitor tracing for digital copyright protection","221355623":"Pirate Evolution: How to Make the Most of Your Traitor Keys","220990587":"Efficient Traitor Tracing from Collusion Secure Codes","2469245":"On Long-Lived Public-Key Traitor Tracing. First Steps","221609583":"Traitor Tracing for Shortened and Corrupted Fingerprints","264135390":"Construction of an Asymmetric Traitor Tracing Schemes with Anonymity","221427282":"A Combinatorial Approach to Asymmetric Traitor Tracing.","221017418":"An Asymmetric Traceability Scheme for Copyright Protection without Trust Assumptions.","221651806":"Tracing and Revoking Pirate Rebroadcasts","221010781":"A Public-Key Traitor Tracing Scheme with Revocation Using Dynamic Shares","221208158":"Efficient Asymmetric Public-Key Traitor Tracing Without Trusted Agents","2919768":"Overview of Traitor Tracing Schemes","224067106":"An efficient traitor tracing scheme for broadcast encryption","221010518":"Efficient Asymmetric Self-Enforcement Scheme with Public Traceability","228578788":"Renewable Traitor Tracing: A Broadcast, Tracing and Revoke System for Anonymous Attack","3080529":"New results on frame-proof codes and traceability schemes","220776022":"On the Effects of Pirate Evolution on the Design of Digital Content Distribution Systems.","227278324":"Key Preassigned Traceability Schemes for Broadcast Encryption","254860464":"Cryptographically enforced distributed data access control","247015224":"On Perfect Traitor Tracing","260383751":"New secret key traitor tracing scheme with dispute settlement from bilinear maps","226254072":"A Multi-Key Pirate Decoder Against Traitor Tracing Schemes","3080362":"Combinatorial properties of frameproof and traceability codes","225127906":"Public Key Trace and Revoke Scheme Secure against Adaptive Chosen Ciphertext Attack","220348590":"Gossip Codes for Fingerprinting: Construction, Erasure Analysis and Pirate Tracing.","264069165":"A Public Key Traitor Tracing Scheme with Key-update Method","221436322":"Towards Optimal Revocation and Tracing Schemes - The Power of the Ternary Tree.","220205233":"Efficient broadcast key distribution with dynamic revocation","220334512":"Public Key Broadcast Encryption with Low Number of Keys and Constant Decryption Time (Version 2).","242499558":"Information Security and Privacy, 11th Australasian Conference, ACISP 2006, Melbourne, Australia, July 3-5, 2006, Proceedings","239577556":"Computer Security - ESORICS 2003, 8th European Symposium on Research in Computer Security, Gjøvik, Norway, October 13-15, 2003, Proceedings","223221975":"Identity-based broadcast signcryption","45825575":"A Traitor Tracing Scheme Based on the RSA System","226762264":"Efficient Traitor Tracing Algorithms Using List Decoding","221326764":"A Public-Key Black-Box Traitor Tracing Scheme with Sublinear Ciphertext Size Against Self-Defensive Pirates","30513486":"Courbes elliptiques et applications cryptographiques à la diffusion numérique sécurisée","221609642":"Building efficient fully collusion-resilient traitor tracing and revocation schemes","221495212":"Selective Disclosure on Encrypted Documents","220638336":"Fully collusion-resistant traitor tracing scheme with shorter ciphertexts","267307077":"A Security Analysis of Some Physical Content Distribution Systems","221631899":"Renewable Traitor Tracing: A Trace-Revoke-Trace System For Anonymous Attack","44795397":"Improving the Boneh-Franklin Traitor Tracing Scheme","225151963":"Efficient Trace and Revoke Schemes","225181657":"Anonymous Traceability Schemes with Unconditional Security","255365514":"A Flexibly Revocable Key-Distribution Scheme for Efficient BlackBox Tracing","35701140":"Architectural techniques for enabling secure cryptographic processing /","221609344":"Collusion Secure q-ary Fingerprinting for Perceptual Content","220798367":"Linear Code Implies Public-Key Traitor Tracing with Revocation","225113565":"A Public-Key Traitor Tracing Scheme with an Optimal Transmission Rate","226978366":"Multi-round Secure Light-Weight Broadcast Exclusion Protocol with Pre-processing","45813511":"Efficient Coalition Detection in Traitor Tracing","221208209":"Lecture Notes in Computer Science","261080143":"A collusion-resisted public key traitor tracing scheme","221017327":"Secure Electronic Copyright Distribution with Public Key Based Traitor Tracing.","221239529":"Practical Pay-TV Scheme Using Traitor Tracing Scheme for Multiple Channels","29780736":"Efficiency Enhancement of Secure Multi-Party Protocols for Privacy and Privilege Protection","255639792":"Asymmetric Public-key Traitor Tracing Based on Bilinear Map","220798456":"Privacy against Piracy: Protecting Two-Level Revocable P-K Traitor Tracing","220335603":"Copyrighting Public-key Functions and Applications to Black-box Traitor Tracing.","257727881":"An Improved Traitors Tracing Scheme Based on ELGamal","221326831":"An Efficient Public Key Trace and Revoke Scheme Secure against Adaptive Chosen Ciphertext Attack","2625224":"Coin-Based Anonymous Fingerprinting","220739273":"Hierarchical Key Assignment for Black-Box Tracing with Efficient Ciphertext Size","221135052":"New traitor tracing schemes using bilinear map","220235458":"Managing Encryption and Key Publication Independently in Digital Rights Management Systems.","226123161":"Linear Code Implies Public-Key Traitor Tracing","224621702":"A secure traitor tracing scheme against key exposure","221609695":"On Crafty Pirates and Foxy Tracers","273191586":"Trends and Development of Information-Theoretic Cryptography","220725700":"Traitor Tracing against Public Collaboration","220798424":"Adaptively Secure Traitor Tracing Against Key Exposure and Its Application to Anywhere TV Service.","221609421":"Traitor Tracing with Constant Size Ciphertext","226820476":"Public Key Broadcast Encryption with Low Number of Keys and Constant Decryption Time","220798421":"TTS without Revocation Capability Secure Against CCA2"},"index":298}