{"abs":"We examine the optimal scaling and the efficiency of the pseudo-marginal random walk Metropolis algorithm using a recently-derived result on the limiting efficiency as the dimension, $d\\rightarrow \\infty$. We prove that the optimal scaling for a given target varies by less than $20\\%$ across a wide range of distributions for the noise in the estimate of the target, and that any scaling that is within $20\\%$ of the optimal one will be at least $70\\%$ efficient. We demonstrate that this phenomenon occurs even outside the range of distributions for which we rigorously prove it. Finally we conduct a simulation study on a target and family of noise distributions which together satisfy neither of the two key conditions of the limit result on which our work is based: the target has $d\u003d1$ and the noise distribution depends heavily on the position in the state-space. Our key conclusions are found to hold in this example also.","title":"Optimal Scaling for the Pseudo-Marginal Random Walk Metropolis: Insensitivity to the Noise Generating Mechanism","id":264899565,"url":"https://www.researchgate.net/publication/264899565_Optimal_Scaling_for_the_Pseudo-Marginal_Random_Walk_Metropolis_Insensitivity_to_the_Noise_Generating_Mechanism","names":["Chris Sherlock","Methodology And Computing In Applied Probability"],"references":{"227522317":"Particle Markov Chain Monte Carlo . . .","260393926":"Bayesian Inference for Hybrid Discrete-Continuous Stochastic Kinetic Models","2759693":"Monte Carlo Methods in Statistical Mechanics: Foundations and New Algorithms","224904879":"On automating Markov chain Monte Carlo for a class of spatial models","261952439":"Establishing some order amongst exact approximations of MCMCs","255787317":"Combining data from multiple spatially referenced prevalence surveys using generalized linear geostatistical models","225059910":"Fitting complex population models by combining particle filters with Markov chain Monte Carlo","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","232062873":"Efficient implementation of Markov chain Monte Carlo when using an unbiased likelihood estimator","2118639":"Baxendale, P.H.: Renewal theory and computable convergence rates for geometrically ergodic Markov chains. Ann. Appl. Probab. 15(1B), 700-738","257146976":"On some properties of Markov chain Monte Carlo simulation methods based on the particle filter","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","262954130":"Pseudo-Marginal Bayesian Inference for Gaussian Processes","233889199":"Wilkinson, D.J.: Bayesian Parameter Inference for Stochastic Biochemical Network Models Using Particle Markov Chain Monte Carlo. Interface Focus 1(6), 807-820"},"citedIn":{"279309732":"Efficiency of delayed-acceptance random walk Metropolis algorithms","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards"},"index":304}