{"abs":"We consider Monte Carlo algorithms for computing an integral @q\u003d@!fd@p which is positive but can be arbitrarily close to 0. It is assumed that we can generate a sequence X\"n of uniformly bounded random variables with expectation @q. Estimator @q@?\u003d@q@?(X\"1,X\"2,...,X\"N) is called an (@e,@a)-approximation if it has fixed relative precision @e at a given level of confidence 1-@a, that is it satisfies P(|@q@?-@q|@?@e@q)\u003e\u003d1-@a for all problem instances. Such an estimator exists only if we allow the sample size N to be random and adaptively chosen. We propose an (@e,@a)-approximation for which the cost, that is the expected number of samples, satisfies EN~2ln@a^-^1/(@q@e^2) for @e-\u003e0 and @a-\u003e0. The main tool in the analysis is a new exponential inequality for randomly stopped sums. We also derive a lower bound on the worst case complexity of the (@e,@a)-approximation. This bound behaves as 2ln@a^-^1/(@q@e^2). Thus the worst case efficiency of our algorithm, understood as the ratio of the lower bound to the expected sample size EN, approaches 1 if @e-\u003e0 and @a-\u003e0. An L^2 analogue is to find @q@? such that E(@q@?-@q)^2@?@e^2@q^2. We derive an algorithm with the expected cost EN~1/(@q@e^2) for @e-\u003e0. To this end, we prove an inequality for the mean square error of randomly stopped sums. A corresponding lower bound also behaves as 1/(@q@e^2). The worst case efficiency of our algorithm, in the L^2 sense, approaches 1 if @e-\u003e0.","title":"Optimal Monte Carlo integration with fixed relative precision","id":257266973,"url":"https://www.researchgate.net/publication/257266973_Optimal_Monte_Carlo_integration_with_fixed_relative_precision","names":["Lesław Gajek","Wojciech Niemiro","Piotr Pokarowski","Journal of Complexity"],"references":{"48198751":"Nonasymptotic Bounds on the Mean Square Error for MCMC Estimates via Renewal Techniques","221996154":"Probability Inequalities For Sums of Bounded Random Variables","221528693":"Efficient suboptimal rare-event simulation","247329279":"Random genera-tion of combinatorial structures from a uniform generation","2824425":"AIS-BN: An Adaptive Importance Sampling Algorithm for Evidential Reasoning in Large Bayesian Networks","222695237":"Explicit error bounds for lazy reversible Markov chain Monte Carlo","45903285":"Quantile Estimation with Adaptive Importance Sampling","30760604":"On Excess Over the Boundary","268718670":"Rare Event Simulation Using Monte Carlo Methods","284115877":"Adaptive importance sampling","265461598":"Great Expectation: The Theory of Optimal Stopping","38365765":"On the Asymptotic Theory of Fixed-Width Sequential Confidence Intervals for the Mean","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","265727384":"Stochastic Simulation: Algorithms and Analysis","51912840":"Nonasymptotic bounds on the estimation error of MCMC algorithms","29649681":"Asymptotic Robustness of Estimators in Rare-Event Simulation","38359452":"Information Inequalities for the Bayes Risk","38364831":"An Extension of a Theorem of Chow and Robbins on Sequential Confidence Intervals for the Mean","3635360":"An optimal algorithm for Monte Carlo estimation","38362833":"Inequalities for the Overshoot","249367941":"Estimation from Life Test Data","3233192":"Adaptive importance sampling [digital communication]","222575583":"Rigorous confidence bounds for MCMC under a geometric drift condition","38351894":"On Hoeffding’s inequalities","254284936":"Asymptotic Theory of Sequential Fixed-Width Confidence Interval Procedures","3885850":"Nonparametric adaptive importance sampling for rare event simulation","222483558":"An optimal approximation algorithm for Bayesian inference","228963776":"Robustness Properties for Simulations of Highly Reliable Systems","220641806":"Adaptive Importance Sampling.","237424138":"ON HOEFFDING\u0027S INEQUALITIES1","292101252":"An adaptive importance sampling strategy","38360295":"On the Minimax Value in the Scale Model with Truncated Data","262426251":"Statistical tools for simulation design and analysis II: nonparametric adaptive importance sampling for rare event simulation","220172399":"Monte-Carlo algorithms for the planar multiterminal network reliability problem","37616846":"Improved Algorithms for Rare Event Simulation With Heavy Tails","38362812":"Tail Events of some Nonhomogeneous Markov Chains","234108803":"Confidence Inference in Bayesian Networks","241735632":"Estimates of Bounded Relative Error for the Mean Life of an Exponential Distribution","228057773":"Random Generation of Combinatorial Structures from a Uniform Distribution","38350773":"Numerical integration using V-uniformly ergodic Markov chains","38367220":"Estimates of Bounded Relative Error in Particle Counting","242972358":"Sampling algorithms for estimating the mean of bounded random variables","2806484":"An Optimal Algorithm for Monte Carlo Estimation","2132894":"Simple Monte Carlo and the Metropolis Algorithm","2400282":"Steady State Rare Events Simulation in Queueing Models and its Complexity Properties","228057769":"Probability Inequalities for Sums of Bounded Random Variables","242078995":"Fixed precision MCMC Estimation by Median of Products of Averages","243773113":"Adaptive importance sampling in Monte Carlo integration"},"citedIn":{"265513367":"Rigorous error control methods for estimating means of bounded random variables"},"index":311}