{"abs":"Consider a situation in which it is desired to gain knowledge about the true value of some parameter (or about the true state of the world) by means of experimentation. Let $\\Omega$ denote the set of all possible values of the parameter $\\theta$, and suppose that the experimenter\u0027s knowledge about the true value of $\\theta$ can be expressed, at each stage of experimentation, in terms of a probability distribution $\\xi$ over $\\Omega$. Each distribution $\\xi$ indicates a certain amount of uncertainty on the part of the experimenter about the true value of $\\theta$, and it is assumed that for each $\\xi$ this uncertainty can be characterized by a non-negative number. The information in an experiment is then defined as the expected difference between the uncertainty of the prior distribution over $\\Omega$ and the uncertainty of the posterior distribution. In any particular situation, the selection of an appropriate uncertainty function would typically be based on the use to which the experimenter\u0027s knowledge about $\\theta$ is to be put. If, for example, the actions available to the experimenter and the losses associated with these actions can be specified as in a statistical decision problem, then presumably the uncertainty function would be determined from the loss function. In Section 2 some properties of uncertainty and information functions, and their relation to statistical decision problems and loss functions, are considered. In Section 3 the sequential sampling rule whereby experiments are performed until the uncertainty is reduced to a preassigned level is studied for various uncertainty functions and experiments. This rule has been previously studied by Lindley, [8], [9], in special cases where the uncertainty function is the Shannon entropy function. In Sections 4 and 5 the problem of optimally choosing the experiments to be performed sequentially from a class of available experiments is considered when the goal is either to minimize the expected uncertainty after a fixed number of experiments or to minimize the expected number of experiments needed to reduce the uncertainty to a fixed level. Particular problems of this nature have been treated by Bradt and Karlin [6]. The recent work of Chernoff [7] and Albert [1] on the sequential design of experiments is also of interest in relation to these problems.","title":"Uncertainty, Information, and Sequential Experiments","id":38366304,"url":"https://www.researchgate.net/publication/38366304_Uncertainty_Information_and_Sequential_Experiments","names":["M. H. DeGroot","The Annals of Mathematical Statistics"],"references":{"38367066":"On the Measure of Information Provided by an Experiment","38366429":"The Sequential Design of Experiments for Infinitely Many States of Nature","38367134":"On the Design and Comparison of Certain Dichotomous Experiments","230872731":"Sequential Design of Experiments","38367396":"Equivalent Comparison of Experiments"},"citedIn":{"228371357":"f-DIVERGENCES: SUFFICIENCY, DEFICIENCY AND TESTING OF HYPOTHESES","266204377":"Generalized Twin Gaussian Processes using Sharma-Mittal Divergence","265737690":"A Simulation Study to Compare CAT Strategies for Cognitive Diagnosis","267147233":"A criterion for the comparison of experiments based on the generalized information","233066730":"Problems in foundation and use of optimal experimental design in regression models 1","24063585":"Computerized adaptive testing under nonparametric IRT models","5166401":"Optimal Sequential Investigation Rules in Competition Law","223283551":"Relevance measures for subset variable selection in regression problems based on -additive mutual information","3411748":"Uncertainty of discrete stochastic systems: General theory and statistical theory","2469172":"The Equivalence of Constrained and Weighted Designs in Multiple Objective Design Problems","46493910":"On the measure and the estimation of evenness and diversity","49762276":"Amino Acids Analysis Using a Monolithic Silica Column After Derivatization with 4-Fluoro-7-nitro-2,1,3-Benzoxadiazole (NBD-F)","229438655":"A Predictive Approach to Nonparametric Inference for Adaptive Sequential Sampling of Psychophysical Experiments","277801370":"SEQUENTIAL DESIGNS OF EXPERIMENTS FOR ALTERN- ATIVE OBJECTIVE FUNCTIONS IN AUTOMATED TEACHING PROGRAMS","244358788":"Optimal decision-oriented Bayesian design of experiments","3080761":"On convergence of information contained in quantized observations","255652645":"The Value of Information in Portfolio Investment Decisions","13327062":"Query construction, entropy, and generalization in neural-network models","243778727":"Disclosure-Limited Data Dissemination","228915076":"On the use of mutual information in data analysis: an overview","2402311":"On Bayesian Record Linkage","29654759":"A Paradigm for Masking (Camouflaging) Information","37999721":"Sequential optimization through adaptive design of experiments","45855376":"R.C.: Generalised Pinsker inequalities","254285061":"Conditional Confidence Statements and Confidence Estimators: Rejoinder","28177795":"Criterio de comparación de experimentos basado en la información generalizada","3113729":"Fusion of detection probabilities and comparison of multisensor systems","278646443":"Combinación de predicciones y métodos de evaluación","227137464":"On the association between a random parameter and an observable","228255407":"Evaluating Density Forecasts: A Comment","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","229884036":"When is one experiment ‘always better than’ another?","254392849":"Price as a choice under nonstochastic randomness in finance","265710062":"Optimal Stopping in a Partially Observable Markov Process with Costly Information","223190132":"Agglomerative hierarchical clustering of continuous variables based on mutual information","3981063":"Game theory, maximum generalized entropy, minimum discrepancy, robust Bayes and Pythagoras","240380271":"Use of Distance Measures, Information Measures and Error bounds in Feature Evaluation","48419550":"Data confidentiality: A review of methods for statistical disclosure limitation and methods for assessing privacy","46493946":"Executives\u0027 perceived environmental uncertainty shortly after 9/11","262887147":"A Bayesian view of model complexity","233362089":"A representation theorem for stochastic kernels and its application in comparison of experiments","12766342":"Optimal Sampling Times for Bayesian Estimation of the Pharmacokinetic Parameters of Nortriptyline During Therapeutic Drug Monitoring","263621618":"MODELLING USER UNCERTAINTY FOR DISCLOSURE RISK AND DATA UTILITY","227536586":"Information Measures in Perspective","235764298":"Decision Theory: Principles and Approaches","38363904":"Some Properties of Bayesian Orderings of Experiments","263666174":"Comparison, utility, and partition of dependence under absolutely continuous and singular distributions","249957036":"A new annotation tool for malaria based on inference of probabilistic genetic networks","230872968":"Recent Work on the Design of Experiments: A Bibliography and a Review","227231943":"Algunas consideraciones sobre la informacion generalizada","38349061":"Game Theory, Maximum Entropy, Minimum Discrepancy and Robust Bayesian Decision Theory","221901173":"Active Sequential Hypothesis Testing","235143764":"Information, Inference and Decision","258735419":"Statistical Information: A Bayesian Perspective","270237514":"Discussion: Comments on the Role of Parameters in the Predictive Approach to Statistics","227519453":"Design of follow‐up experiments for improving model discrimination and parameter estimation","24065340":"Deriving Reference Decisions","258625598":"Quantifying the value of environmental information to society","3047035":"Programmed Logic Array Optimization","250917793":"Uncertainty and absence of arbitrage opportunity","23392060":"Sequential Optimal Design of Neurophysiology Experiments","280087275":"Risk assessment of rare events","235402585":"Maximizing the Information Content of Experiments in Systems Biology","4782632":"Flexibility and Uncertainty","7200268":"Partial Knowledge, Entropy and Estimation","228359423":"On the Measure of the Information in a Statistical Experiment","241075517":"Ocena funkcji pozaślimakowej części drogi słuchowej u niemowląt ze zmianami w obrębie ośrodkowego układu nerwowego powstałymi na skutek asfiksji okołoporodowej","228560123":"Assessing the Risk of Disclosure of Confidential Categorical Data","252204384":"Information Measures in Perspective: Unified Solutions for Diverse Problems","279378382":"Optimal Systems for Information and Decision (1972)","222631981":"Stochastic optimization algorithms of a Bayesian design criterion for Bayesian parameter estimation of nonlinear regression models: Application in pharmacokinetics","242996497":"Information in experiments and sufficiency","242996501":"On the Bayesian Analysis of Categorical Data: The Problem of Nonresponse","236021118":"Evaluation of Probabilistic Forecasts: Proper Scoring Rules and Moments","222474803":"The strategic value of flexibility in sequential decision making","246469828":"Information About Hyperparamters in Hierarchical Models","240180520":"Political and Economic Evaluation of Social Effects of Externalities","4333881":"On the Use of Mutual Information to Compare the Performance of Wireless Sensor Networks in Detection Applications","225876747":"Constructing Probabilistic Genetic Networks of Plasmodium falciparum from Dynamical Expression Signals of the Intraerythrocytic Development Cycle","224386526":"Adaptive Sensing for Sparse Signal Recovery","3078314":"Statistical information and discrimination","278715156":"On one definition of uncertainty","235048588":"Approaches in Sequential Design of Experiments","5109981":"The Ignorant Monopolist: Optimal Learning with Endogenous Information,\u0027\u0027","235197333":"AN INVESTIGATION OF SEQUENTIAL SEARCH ALGORITHMS","232329551":"Bivariate certainty and information measures","2397375":"Bayesian Multivariate Micro-Aggregation Under the Hellinger\u0027s Distance Criterion","45137707":"Optimal sequential investigation rules in competition law","225747945":"Mutual information and redundancy for categorical data","265363790":"Economics of Information Systems (1971)","38358486":"Comparison of Experiments and Information Measures","227881226":"Information measures","220889743":"Information Systems Economics.","278715193":"Price as a choice under nonstochastic randomness in finance","4914156":"Sequential classification on partially ordered sets","3047044":"Myopic Policies in Sequential Classification","46949991":"Descent Directions and Efficient Solutions in Discretely Distributed Stochastic Programs","251552341":"Experimental design for the joint model discrimination and precise parameter estimation through information measures","222834403":"Learning about the arrival of sales","271554434":"Dynamic search under false alarms","230872684":"A Total Entropy Criterion for the Dual Problem of Model Discrimination and Parameter Estimation","4741113":"Relationship Between Bayesian and Frequentist Sample Size Determination","268227406":"Strong data processing inequalities and $\\Phi$-Sobolev inequalities for discrete channels","260740921":"Information Gain and Approaching True Belief","18327715":"Some measures of information arising in statistical games","241355476":"Bayesian inference in physics","228206381":"Using the National Longitudinal Survey of Youth in the US to Study the Birth Process: A Bayesian Approach","4791281":"DIC in variable selection","4737009":"Caution or activism? Monetary pohcy strategies in an open economy","227102770":"Changes in utility as information","220063394":"Unsupervised aggregation of commensurate correlated attributes by means of the Choquet integral and entropy functionals","3086062":"On Divergences and Informations in Statistics and Information Theory","280695925":"Bounds among $f$-divergences","254286840":"Markovian Forecast Processes","242447520":"“Economic Comparability of Information Systems.”","28177790":"Una nota bibliográfica sobre las aplicaciones de la teoría de la información estadística","228961649":"Adaptive utility and trial aversion","234311727":"The Science of Information: Measurement and Applications","46494236":"Information importance of predictors: Concept, measures, Bayesian inference, and applications","23948727":"Default Estimation, Correlated Defaults, and Expert Information","221463533":"Limited Role of Entropy in Information Economics.","38363031":"Bayesian Experimental Design: A Review","265285136":"Inference and Experimental Design for Percolation and Random Graph Models","239394212":"Sequential decisions with outcome uncertainty†","221529046":"Joint criterion for factor identification and parameter estimation","226132888":"Simple methods for evaluating and comparing binary experiments","254047680":"Exploiting structured sparsity in Bayesian experimental design","222822574":"The Learning Cost of Interest Rate Reversals","280942166":"Bounds among $f$-divergences","254287301":"Conjugate Priors for Exponential Families Having Quadratic Variance Functions","278009724":"Operational Risk Assessment: A Case of Bhopal Accident","254791361":"Information measures and their applications to identification : a bibliography","4726438":"The Risk of Disclosure for Microdata","4989884":"Partial Ordering of Unpredictable Mobility with Welfare Implications","258319511":"Decompositions of information divergences: Recent development, open problems and applications,","229786177":"Models for the assessment of the value of forecast information","23717021":"Information, Divergence and Risk for Binary Experiments","262416209":"Optimal Index Policies for Anomaly Localization in Resource-Constrained Cyber Systems","222392249":"An economic basis for certain methods of evaluating probabilistic forecasts","226729082":"Sequential DOE via dynamic programming","228715352":"A decision-theoretic approach to data disclosure problems","260946551":"Justification of Logarithmic Loss via the Benefit of Side Information","38358711":"Measures of Information Based on Comparison with Total Information and with Total Ignorance"},"index":316}