{"abs":"Subset Simulation (SS) is a powerful tool, simple to implement and capable of solving a broad range of reliability analysis problems. In many cases however, SS leads to reliability predictions that exhibit a large variability due to the fact that the robustness of the SS prediction depends on the selection of an adequate width of the proposal distribution when applying the modified Metropolis algorithm. In this work a Neural Network-based SS (SS-NN) methodology is proposed in which NN are effectively trained over smaller sub-domains of the total random variable space which are generated progressively at each SS level by the modified Metropolis algorithm. NN are then used as robust meta-models in order to increase the efficiency of SS by increasing significantly the samples per SS level with a minimum additional computational effort. In the numerical examples considered, it is demonstrated that the training of a sufficiently accurate NN meta-model in the context of SS simulation leads to more robust estimations of the probability of failure both in terms of mean and variance of the estimator.","title":"Accelerated subset simulation with neural networks for reliability analysis","id":256918009,"url":"https://www.researchgate.net/publication/256918009_Accelerated_subset_simulation_with_neural_networks_for_reliability_analysis","names":["Vissarion Papadopoulos","Dimitris Giovanis","Nikos Lagaros","Papadrakakis Manolis","Computer Methods in Applied Mechanics and Engineering"],"references":{"228954980":"A comparison of approximate response functions in structural reliability analysis, Probabilistic","2365376":"A Practical Bayesian Framework for Backprop Networks","200105001":"Equation of State by Fast Computing Machines","200622065":"Equation of State Calculations by Fast Computing Machines","222499945":"Structural optimization using evolution strategies and neural networks","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","245305522":"Application of ANN-Based Response Surface Method to Prediction of Ultimate Strength of Stiffened Panels","222287247":"Neural-network-based reliability analysis: A comparative study","221669734":"Equations of State Calculations by Fast Computing Machines","222462931":"Advanced Supervised Learning in Multi-layer Perceptrons – From Backpropagation to Adaptive Learning Algorithms","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","223287356":"Filtered importance sampling with support vector margin: A powerful method for structural reliability analysis","223425064":"Innovative seismic design optimization with reliability constraints","30771436":"MacKay, D.J.C.: A Practical Bayesian Framework for Backprop Networks. Neural Computation 4(3), 448-472","245582009":"A practical Bayesian framework for backpropagation networks","222780925":"A new adaptive importance sampling scheme","222672830":"Benchmark study on reliability estimation in higher dimensions of structural systems – An overview","2689685":"Optimization of the Backpropagation Algorithm for Training Multilayer Perceptrons","3568712":"A Direct Adaptive Method for Faster Backpropagation Learning: The RPROP Algorithm","229345109":"Reliability analysis of structures using artificial neural network based genetic algorithms","222834935":"Learning improvement of neural networks used in structural optimization","222475741":"Structural reliability analysis of elastic-plastic structures using neural networks and Monte Carlo simulation. Computer Methods in Applied Mechanics and Engineering 136: 145-163"},"citedIn":{"291421918":"Reliability analysis with Metamodel Line Sampling","284924665":"Rare Event Simulation in Finite-Infinite Dimensional Space","275116678":"Reliability analysis of geostructures based on metaheuristic optimization","277351500":"An important boundary sampling method for reliability-based design optimization using kriging model","262147845":"A novel reliability method for structural systems with truncated random variables","269777234":"Spectral representation-based neural network assisted stochastic structural mechanics","290480822":"Assessing small failure probabilities by AK–SS: An active learning method combining Kriging and Subset Simulation","283121511":"Prediction of the Fundamental Period of Infilled RC Frame Structures Using Artificial Neural Networks","273555618":"Predicting reliability and failures of engine systems by single multiplicative neuron model with iterated nonlinear filters","273506849":"X-TMCMC: Adaptive kriging for Bayesian inverse modeling","277561511":"System reliability of randomly vibrating structures: Computational modeling and laboratory testing","281770821":"Engineering Risk Assessment with Subset Simulation","264427149":"A simulation-based method for reliability based design optimization problems with highly nonlinear constraints","284104383":"Epistemic uncertainty assessment using Incremental Dynamic Analysis and Neural Networks","283247152":"Bayesian updating and model class selection with Subset Simulation","281144371":"Rare Event Simulation","259357057":"Estimation of time variant reliability of randomly parametered non-linear vibrating systems","274739829":"Sampling-Based RBDO Using Score Function with Re-Weighting Scheme","261291205":"Assessment of the Efficiency of Kriging Surrogate Models for Structural Reliability Analysis","273889515":"A semi-analytical framework for structural reliability analysis","291013505":"Cross-entropy-based adaptive importance sampling using von Mises-Fisher mixture for high dimensional reliability analysis","266972915":"An efficient reliability method combining Adaptive Importance Sampling and Kriging metamodel","267572776":"Performance evaluation of approximated artificial neural network (AANN) algorithm for reliability improvement","266749786":"Review and application of Artificial Neural Networks models in reliability analysis of steel structures"},"index":318}