{"abs":"To search for an optimum in a large search space, Wu, Mao, and Ma suggested the sequential elimination of levels (SELs)-method to find an optimal setting. Genetic algorithms (GAs) can be used to improve on this method. To make the search procedure more efficient, new ideas of forbidden array and weighted mutation are introduced. Relaxing the condition of orthogonality, GAs are able to accommodate a variety of design points, which allows more flexibility and enhances the likelihood of getting the best setting in fewer runs, particularly in the presence of interactions. The search procedure is enriched by a Bayesian method for identifying the important main effects and two-factor interactions. Illustration is given with the optimization of three functions, one of which is from Shekel\u0027s family. A real example on compound optimization is also given.","title":"SELC: Sequential Elimination of Level Combinations by Means of Modified Genetic Algorithms","id":228572020,"url":"https://www.researchgate.net/publication/228572020_SELC_Sequential_Elimination_of_Level_Combinations_by_Means_of_Modified_Genetic_Algorithms","names":["Abhyuday Mandal","C. F Jeff Wu","Kjell Johnson","Technometrics"],"references":{"2660139":"Genetic Algorithms and The Design of Experiments","242356870":"Adaptation In Natural And Artificial Systems","247892177":"The global optimization problem: An introduction","2814157":"A Bayesian Variable-Selection Approach for Analyzing Designed Experiments With Complex Aliasing","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","2813202":"Bayesian Variable Selection with Related Predictors","238727682":"Variable Selection Via Gibbs Sampling","220045412":"Adoption in Natural and Artificial System","230872587":"Experimental Design and Observation for Large Systems","243574953":"The Tunneling Algorithm for the Global Minimization of Functions","236538196":"Genetic algorithms for the construction of D-optimal designs"},"citedIn":{"51167725":"Statistical Analysis and Compound Selection of Combinatorial Libraries for Soluble Epoxide Hydrolase","279396070":"Factors That Can Affect Model Performance","228374398":"Optimal sensor distribution in multi-station assembly processes for maximal variance detection capability","27531809":"Robust Parameter Design for Automatically Controlled Systems and Nanostructure Synthesis","279367406":"Case Study: Compressive Strength of Concrete Mixtures","279367502":"An Introduction to Feature Selection","26539012":"Software for Implementing the Sequential Elimination of Level Combinations Algorithm","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","51389508":"Identifying Promising Compounds in Drug Discovery: Genetic Algorithms and Some New Statistical Techniques","45855565":"G-SELC: Optimization by sequential elimination of level combinations using genetic algorithms and Gaussian processes","272569256":"Layers of Experiments with Adaptive Combined Design","279389529":"Linear Regression and Its Cousins","279384185":"Remedies for Severe Class Imbalance","284712102":"A Genetic Algorithm for Selection of Fixed-Size Subsets with Application to Design Problems","267989574":"Applied Predictive Modeling"},"index":322}