{"abs":"When the manufacturing objective is process or product improvement, quality practitioners will frequently resort to one or more approaches within the broader class of response surface methodology. Several techniques, such as the dual response, robust parameter design, and desirability function approach, may be effective tools to solve the multi-response optimisation problem. All of these techniques are designed to identify the factor settings that lead to an optimal solution in terms of the mean or variance among characteristics. The skewness in the distribution of observations for one or more characteristics, however, is not considered. The techniques also traditionally rely on the fit of second-order response surface designs in estimating each response, which may be unreliable in some cases. In contrast, this paper offers an approach to solving complex multi-response optimisation problems that considers both the error associated with process skewness and the accuracy of a response surface.","title":"Investigating estimation error reduction strategies in complex engineering systems","id":262280713,"url":"https://www.researchgate.net/publication/262280713_Investigating_estimation_error_reduction_strategies_in_complex_engineering_systems","names":["Paul Goethals","Byung Rae Cho","International Journal of Data Analysis Techniques and Strategies"],"references":{"247531267":"Simultaneous Optimization of Several Response Variable","229915447":"Robust optimization for multiple responses using response surface methodology","239060152":"Uniform design: Theory and application","23645103":"The centred parametrization for the multivariate skew-normal distribution","227706138":"Statistical Application of the Multivariate Skew Normal Distribution","245699566":"Combining Taguchi and Response Surface Philosophies: A Dual Response Approach","226999243":"Robust design of sheet metal forming process based on adaptive importance sampling","279577126":"Analyzing experiments with correlated multiple responses","225449468":"Effect of process parameters on the cutting quality in lasox cutting of mild steel","284332031":"Fitting yield and cost response surfaces","279896318":"Dual Response Surface Optimization","242092223":"Using a Genetic Algorithm to Generate Small Exact Response Surface Designs","232878320":"Using simulation techniques to determine optimal operational region for multi-responses problems","241735867":"Mixture Experiments: Geometry and Pseudocomponents","267224254":"Skew-normal Linear Mixed Models","265426305":"Construction of Supersaturated Designs Through Partially Aliased Interactions","228369289":"Robust Design Techniques for Evaluating Fuel Cell Thermal Performance","243770076":"The System of Experimental Design Engineering Methods to Optimize Quality and Minimize Cost","220385470":"A Semiparametric Technique for the Multi-Response Optimization Problem","233440951":"Small Robust Response-Surface Designs for Quantitative and Qualitative Factors","254331190":"Developing Blending Models for Gasoline and Other Mixtures","280939936":"\u0027On the Experimental Attainment Optimum Conditions\u0027","285850729":"A Bayesian Reliability Approach to Multiple Response Optimization with Seemingly Unrelated Regression Models","243048602":"An introduction to design optimality with an overview of the literature","220470978":"D-STEM: A modified step method with desirability function concept","228955714":"Forward selection error control in the analysis of supersaturated designs","232978570":"Model Robust Regression: Combining Parametric, Nonparametric, and Semiparametric Methods","230872555":"Developments in the Design of Experiments, Correspondent Paper","250327808":"Applying a Uniform Design of Experiment Approach for Reducing Injection Moulding Warpage Deflection","46494251":"Semiparametric analysis of randomized response data with missing covariates in logistic regression","233093514":"Development of a highly efficient and resistant robust design. Int J Prod Res","254331911":"Response Surface Techniques for Dual Response Systems","250357660":"Optimization of Surface Roughness by Uniform Design of Experiments in Milling of 1Cr18Ni9Ti","245309229":"Preference-based Pareto Optimization in Certain and Noisy Environments","229179994":"Optimization of polysaccharides extraction from Gynostemma pentaphyllum Makino using Uniform Design","220385617":"Design Strategies for Response Surface Models for the Study of Supersonic Combustion","254332573":"Calculating Centroids in Constrained Mixture Experiments","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","265681709":"D-Optimality for Regression Designs: A Review","224840024":"Response Surface Methodology (RSM): Process and Product Optimization Using Designed Experiments","229678095":"Some notes on the construction and evaluation of supersaturated designs"},"citedIn":{},"index":323}