{"abs":"In this paper we apply the theory of continued fraction expansions of Stieltjes transforms of probability measures to the Bayesian D-optimal design problem for nonlinear regression models. Some analytic results are obtained for models with two parameters. A numerical procedure is proposed which is based on this theory and maximizes the criterion function without distinguishing between support points and weights of the measures. Bayesian D-optimal designs are found numerically in the Michaelis-Menten and Box-Lucas model. Finally, the results are applied for the construction of the optimal product designs in a multivariate nonlinear regression model.","title":"Some applications of Stieltjes transforms in the construction of optimal designs for nonlinear regression models","id":222870772,"url":"https://www.researchgate.net/publication/222870772_Some_applications_of_Stieltjes_transforms_in_the_construction_of_optimal_designs_for_nonlinear_regression_models","names":["Holger Dette","Stefan Sperlich","Computational Statistics \u0026 Data Analysis"],"references":{"260161345":"The Use of a Canonical Form in the Construction of Locally Optimal Designs for Non-Linear Problems","238321462":"Some Robust-Type D-Optimal Designs in Polynomial Regression","221956664":"Bayesian design for accelerated life testing","239043132":"Results in the Theory and Construction of D-optimum Experimental Designs","223350547":"Optimal Bayesian design applied to logistic regression","38358605":"$D_s$-Optimal Designs for Polynomial Regression Using Continued Fractions","260161348":"The Usefulness of Otimum Experimental Designs","230873540":"Some General Points in the Theory of Optimal Experimental Design","239786054":"Optimum multivariate designs","222314446":"A note on optimal Bayesian design for nonlinear problems","216300596":"Theory of Optimal Experiments Designs","24060415":"Optimum experimental designs","223753350":"Bayesian D-optimal designs for exponential regression models","38367066":"On the Measure of Information Provided by an Experiment","222726227":"Experimental designs for a class of weighted polynomial regression models","38360337":"Efficient $D_s$-Optimal Designs for Multivariate Polynomial Regression on the $q$-Cube","222492574":"Bayesian D-optimal designs for the exponential growth model","31050886":"A Simplex Method for Function Minimization Comput","232950336":"Optimum experimental design in nonlinear regression","267665436":"The problem of moments. Reprinted","38367355":"Locally Optimal Designs for Estimating Parameters","267122014":"Extreme nth Moments for Distributions on [0, 1] and the Inverse of a Moment Space Map","265526123":"A note on Bayesian D-optimal designs for a generalization of the exponential growth model","38358448":"Expected Information as Expected Utility","222247365":"Robust experiment design via stochastic approximation","31343842":"Design of Experiments in Non-Linear Situations","253287717":"Moments. (Scientific Books: The Problem of Moments)","239652405":"Analytic Theory Of Continued Fractions","240433450":"Optimal Design: An Introduction to the Theory of Parameter Estimation"},"citedIn":{"243050078":"Applied regression analysis bibliography update 1994-97","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","38363031":"Bayesian Experimental Design: A Review"},"index":329}