{"abs":"A method is presented for efficiently computing small failure probabilities encountered in seismic risk problems involving dynamic analysis. It is based on a procedure recently developed by the writers called Subset Simulation in which the central idea is that a small failure probability can be expressed as a product of larger conditional failure probabilities, thereby turning the problem of simulating a rare failure event into several problems that involve the conditional simulation of more frequent events. Markov chain Monte Carlo simulation is used to efficiently generate the conditional samples, which is otherwise a nontrivial task. The original version of Subset Simulation is improved by allowing greater flexibility for incorporating prior information about the reliability problem so as to increase the efficiency of the method. The method is an effective simulation procedure for seismic performance assessment of structures in the context of modern performance-based design. This application is illustrated by considering the failure of linear and nonlinear hysteretic structures subjected to uncertain earthquake ground motions. Failure analysis is also carried out using the Markov chain samples generated during Subset Simulation to yield information about the probable scenarios that may occur when the structure fails.","title":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","id":228591568,"url":"https://www.researchgate.net/publication/228591568_Subset_Simulation_and_its_Application_to_Seismic_Risk_Based_on_Dynamic_Analysis","names":["Siu-Kui Au","J. L. Beck","Journal of Engineering Mechanics"],"references":{"228077787":"The Energy Release in Great Earthquakes","200105001":"Equation of State by Fast Computing Machines","244959006":"Moment magnitude scale","223083264":"Essay on uncertainties in elastic and viscoelastic structures: From A. M. Freudenthal\u0027s criticisms to modern convex modeling","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","252482973":"Stochastic Modeling of California Ground Motions","228077708":"The character of high-frequency strong ground motion. Bull Seismol Soc Am","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","254333373":"Monte Carlo: Concepts, Algorithms, and Applications","223106779":"Important sampling in high dimensions","253272774":"Site Amplifications for Generic Rock Sites","248560911":"Importance sampling in structural system","223307920":"Multiple design points in first and second-order reliability","239387109":"Optimal Importance-Sampling Density Estimator","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","239539874":"Bayesian Updating of Structural Models and Reliability using Markov Chain Monte Carlo Simulation","277736103":"Earthquake Magnitude, Intensity, Energy and Acceleration (second paper)","215754733":"Tectonic stress and spectra of shear waves from earthquakes. J Geophys Res","222675510":"First excursion probability for linear systems by very efficient algorithm","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","245285867":"Asymptotic Expansions for Reliability and Moments of Uncertain Systems","243486389":"The Algebra of Probable Inference","222780925":"A new adaptive importance sampling scheme","235033470":"The analysis of structural Safety","247651583":"Stochastic Simulation of High-Frequency Ground Motions Based on Seismological Models of the Radiated"},"citedIn":{"251551228":"Entry Pathways of an Avian Virus into Cells Expressing Transmembrane and GPI-Anchored Receptor Isoforms","284924665":"Rare Event Simulation in Finite-Infinite Dimensional Space","237130023":"Effect of Ground Motion Uncertainty on Predicting the Response of an Existing RC Frame Structure","265612242":"A Stochastic Simulation Based Approach for Seismic Loss Analysis and Probability Function Computation","225697401":"Developments in stochastic structural mechanics","264854211":"Combinatorial analysis of the adaptive last particle method","269191450":"Estimation of the Lower and Upper Probabilities of Failure Using Random Sets and Subset Simulation","260804505":"Physical parameterization and sensitivity of urban hydrological models: Application to green roof systems","222542935":"An efficient framework for optimal robust stochastic system design using stochastic simulation","261880463":"Approximate Bayesian Computation by Subset Simulation","238514465":"Research on safety evaluation method of military software","266393590":"Advanced Monte Carlo Simulation Methods and Neural Network Regression for the Reliability Analysis of Nuclear Passive Systems","220674608":"Influence of input PDF parameters of a model on a failure probability estimation","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","245287045":"A New Multidimensional Visualization Technique for Limit-State Surfaces in Nonlinear Finite Element Reliability Analysis","50866966":"Molecular epidemiology and clinical presentation of human adenovirus infections in Kansas City children","222921046":"Feasibility of FORM in finite element reliability analysis","227674032":"Effects of Two Alternative Representations of Ground Motion Uncertainty on Probabilistic Seismic Demand Assessment of Structures","51613233":"The effect of time on word learning: An examination of decay of the memory trace and vocal rehearsal in children with and without specific language impairment","222885227":"Quantitative functional failure analysis of a thermal–hydraulic passive system by means of bootstrapped Artificial Neural Networks","266390983":"Estimation of cascade failure probability in electrical transmission networks by Subset Simulation","254219020":"Extension of subset simulation approach for uncertainty propagation and global sensitivity analysis","266390987":"Artificial Neural Networks and quadratic Response Surfaces for the functional failure analysis of a thermal-hydraulic passive system","275844957":"Use of Relevance Vector Machine in Structural Reliability Analysis","277561511":"System reliability of randomly vibrating structures: Computational modeling and laboratory testing","230265750":"Reliability of deterministic non‐linear systems subjected to stochastic dynamic excitation","257271930":"Updating reliability models for existing structures using measured responses","223937897":"Reliability-based optimal design of linear dynamical systems under stochastic stationary excitation and model uncertainty","266098159":"Uncertainty And Sensitivity Analysis For Long-Running Computer Codes: A Critical Review","264349943":"Passive systems failure probability estimation by the meta-AK-IS2 algorithm","222791536":"The stochastic finite element method: Past, present and future. Comput Methods Appl Mech Eng","287360279":"Efficient and Consistent Reliability Analysis of Soil Slope Stability Using both Limit Equilibrium Analysis and Finite Element Analysis","288904963":"Tuning of stochastic ground motion models for compatibility with ground motion prediction equations","251617986":"Reliability-based design optimization with discrete design variables and non-smooth performance functions: AB-PSO algorithm","263358860":"Reliability Analysis of Underground Pipelines Using Subset Simulation","251621820":"Monte Carlo Simulation-based Sensitivity Analysis of the model of a Thermal-Hydraulic Passive System","275258402":"An Efficient Method to Calculate the Failure Rate of Dynamic Systems with Random Parameters Using the Total Probability Theorem","226263095":"Application of Reliability, Availability, and Maintainability Simulation to Process Industries: a Case Study","250693053":"Reliability Estimation for Dynamical Systems Subject to Stochastic Excitation using Subset Simulation with Splitting","272213623":"Application of Metaheulistic Method to Reliability Analysis for Lifeline Network Involves Multiple Failure Modes","254214773":"Hierarchical infrastructure network representation methods for risk-based decision-making","279455996":"Climate Scenarios for the Southeast Asia based on PRECIS Regional Climate Model","256816914":"How to effectively compute the reliability of a thermal–hydraulic nuclear passive system","251544479":"Stochastic sampling using moving least squares response surface approximations","276910304":"Structural Reliability Assessment by Multimodal Analysis Using Cellular Automaton Particle Swarm Optimization","236868988":"Assessing small failure probability by importance splitting method and its application to wind turbine extreme response prediction","274071615":"Implementation of simulation methods in structural reliability","258392333":"Generalized Neumann Expansion and Its Application in Stochastic Finite Element Methods","265853620":"Sample-based evaluation of global probabilistic sensitivity measures","256080947":"Extreme quantile estimation with nonparametric adaptive importance sampling","220686931":"Tripartite modular multiplication","276087821":"Approximate Method for Estimating Extreme Value Responses of Nonlinear Stochastic Dynamic Systems","240621613":"Probabilistic analysis of strip footings resting on a spatially random soil using subset simulation approach","266022054":"Response Variability and Reliability of Structures","281927247":"Structural fatigue failure mode identification under corrosive environment","229350702":"Modified Metropolis–Hastings algorithm with reduced chain correlation for efficient subset simulation","4037303":"Relating fundamental chemistry and smart materials with DFT calculations","4110772":"A national inventory of land management practices: Estimating soil conservation practices using optical and radar imagery","223070657":"Performance-based design in risk assessment and reduction. Probab Eng Mech","281770821":"Engineering Risk Assessment with Subset Simulation","237373111":"Practical reliability analysis of slope stability by advanced Monte Carlo simulations in a spreadsheet","257391812":"Subset Simulation of a reliability model for radioactive waste repository performance assessment","251575147":"Subset simulation for unconstrained global optimization","41482722":"Stochastic System Design and Applications to Stochastically Robust Structural Control","277570577":"A New Metamodeling Approach for Time-Dependent Reliability of Dynamic Systems with Random Parameters Excited by Input Random Processes","51945859":"Bayesian Post-Processor and other Enhancements of Subset Simulation for\nEstimating Failure Probabilities in High Dimensions","228668989":"Confidence Factor?","245439804":"Uncertainty Quantification in Conceptual Design via an Advanced Monte Carlo Method","264547674":"Stochastic Simulation Based Reliability Analysis with Multiple Performance Objective Functions","257430520":"Computational strategy for the crash design analysis using an uncertain computational mechanical model","265015403":"Efficient functional reliability estimation for a passive residual heat removal system with subset simulation based on importance sampling","273206504":"Estimation of passive systems functional failure probabilities by the modified meta-IS algorithm","283236418":"TARGETED RANDOM SAMPLING: A NEW METHOD FOR EFFICIENT MONTE CARLO STRUCTURAL RELIABILITY","266754627":"Simulation Methods for Reliability and Availability of Complex Systems","233154627":"Increased Accuracy of Vector-IM-Based Seismic Risk Assessment?","245215802":"Importance sampling for elasto-plastic systems using adapted process with deterministic control","257406448":"Reliability-based design optimization with cooperation between support vector machine and particle swarm optimization","269083553":"Vulnerability Assessment of Infrastructure Networks by Using Hierarchical Decomposition Methods","257100027":"Risk de-aggregation and system reliability analysis of slope stability using representative slip surfaces","281662562":"Reliability analysis of slope stability considering two-dimensional spatial variability of soil","226031060":"Sequential Monte Carlo for rare event estimation","238003841":"Robust Stochastic Predictions of Dynamic Response During and Monitoring of Structures","228733453":"Solving constrained optimization problems via Subset Simulation","245211951":"Design optimization using Subset Simulation algorithm","229979402":"Analytical Approximation for Stationary Reliability of Certain and Uncertain Linear Dynamic Systems with Higher Dimensional Output","200175407":"Mechanics","225876407":"Robust Stochastic Design of Viscous Dampers for Base Isolation Applications","279070817":"MCMC algorithms for Subset Simulation","222835342":"Estimation of the functional failure probability of a thermal–hydraulic passive system by Subset Simulation","227605080":"A scalar damage measure for seismic reliability analysis of RC frames. Earthq Eng Struct Dyn","265127940":"Fluctuation Analysis of Adaptive Multilevel Splitting","272925070":"Time-Dependent Reliability Analysis Using the Total Probability Theorem","245286480":"Seismic Fragility Analysis of Structural Systems","256968863":"Life-cycle seismic loss estimation and global sensitivity analysis based on stochastic ground motion modeling","3565817":"Grand Parade Of The NOAA-polar Orbiters - New Horizons Before Remote Sensing Of The Oceans","229365115":"Developing fragility curves for a pile-supported wharf","49795365":"Generalized Sampling-Based Motion Planners","273401497":"Markov chain splitting methods in structural reliability integral estimation","283247152":"Bayesian updating and model class selection with Subset Simulation","222822035":"Efficient evaluation of performance-based earthquake engineering equations","239549587":"Uncertainty \u0026 Reliability Analysis of Structural Dynamical Systems","263464289":"Performance-based seismic risk assessment for buildings equipped with linear and nonlinear viscous dampers","276112800":"Slope reliability analysis using length-based representative slip surfaces","273181342":"Simplified approach for locating the critical probabilistic slip surface in limit equilibrium analysis","259996324":"Comparison of alternative stochastic ground motion models for seismic risk characterization","259119533":"Transformed perturbation stochastic finite element method for static response analysis of stochastic structures","223325330":"Hybrid Subset Simulation Method for Reliability Estimation of Dynamical Systems Subject to Stochastic Excitation","261862212":"Approximate Bayesian Computation by Subset Simulation","282976770":"Hysteresis parameter identification and reliability assessment of ferrocement walls","257313206":"Time-domain formulation in computational dynamics for linear viscoelastic media with model uncertainties and stochastic excitation","276659357":"Reliability-Based Multidisciplinary Design Optimization Using Subset Simulation Analysis and Its Application in the Hydraulic Transmission Mechanism Design","251480348":"Stochastic modeling of uncertainties in computational structural dynamics—Recent theoretical advances","3568084":"Motion estimation with wavelet transform and the application to motion compensated interpolation","251503646":"The Earned Income Tax Credit and Abortion","225660055":"Analytical evaluation of structural component limit state probabilities","251503131":"Effects of soil spatial variability on rainfall-induced landslides","290480822":"Assessing small failure probabilities by AK–SS: An active learning method combining Kriging and Subset Simulation","223170981":"Stochastic Subset Optimization for reliability optimization and sensitivity analysis in system design","230261841":"Nonlinear stochastic dynamic analysis for performance‐based earthquake engineering","248607544":"Sensitivity analysis of the model of a nuclear passive system by means of Subset Simulation","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","230325844":"A simulation‐based framework for risk assessment and probabilistic sensitivity analysis of base‐isolated structures","282543143":"An adaptive reliability method combining relevance vector machine and importance sampling","271197912":"A priori error estimation for the stochastic perturbation method","271601858":"On the Pareto optimality of variance reduction simulation techniques in structural reliability","259357057":"Estimation of time variant reliability of randomly parametered non-linear vibrating systems","263274567":"Application of subset simulation in reliability estimation of underground pipelines","225896321":"Dynamic Fault Tree Analysis: Simulation Approach","275182238":"Analyzing the Sufficiency of Alternative Scalar and Vector Intensity Measures of Ground Shaking Based on Information Theory","235663089":"Analyzing the Sensitivity of WRF\u0027s Single-Layer Urban Canopy Model to Parameter Uncertainty Using Advanced Monte Carlo Simulation","273395126":"Extracting Rare Failure Events in Composite System Reliability Evaluation Via Subset Simulation","51616748":"The Binding Process of a Nonspecific Enzyme with DNA"},"index":33}