{"abs":"We consider a model robust version of the c-optimality criterion minimizing a weighted product with factors corresponding to the variances of the least squares estimates for linear combinations of the parameters in different models. A generalization of Elfving’s theorem [G. Elfving, Ann. Math. Stat. 23, 255-262 (1952; Zbl 0047.134)] is proved for the optimal designs with respect to this criterion by an application of an equivalence theorem for mixtures of optimality criteria. As a special case an Elfving theorem for the D-optimal design problem is obtained. In the case of identical models the connection between the A- optimality criterion and the model robust criterion is investigated. The geometric characterizations of the optimal designs are illustrated by a couple of examples.","title":"Elfving\u0027s Theorem for $D$-Optimality","id":266524263,"url":"https://www.researchgate.net/publication/266524263_Elfving\u0027s_Theorem_for_D-Optimality","names":["Holger Dette","The Annals of Statistics"],"references":{"230872562":"Optimal Design: Experiments for Discriminating Between Several Models","242996330":"On linear regression designs which maximize information","38357837":"General Equivalence Theory for Optimum Designs","265365607":"Optimal Experimental Design for Polynomial Regression","38367477":"Optimum Allocation in Linear Regression Theory","38364149":"Elfving\u0027s Theorem and Optimal Designs for Quadratic Loss"},"citedIn":{"222675365":"Elfving\u0027s Theorem Revisited","4742505":"Optimal Designs for DoseResponse Models With Restricted Design Spaces","51193711":"A geometric characterization of optimal designs for regression models with correlated observations","28354325":"Geometric construction of optimal design for dose-response models with two parameters","257338291":"A note on R-optimal designs for multiresponse models","38357441":"Minimax Designs in Linear Regression Models","38348739":"A note on Bayesian c- and D-optimal designs in nonlinear regression models","242997681":"A geometric method for singular c-optimal designs","279384077":"Lecture Notes in Statistics","268625769":"Optimal design for prediction in multiresponse linear models based on rectangular confidence region","51949620":"A New Characterization of Elfving\u0027s Method for High Dimensional\nComputation","38357508":"Optimal Designs for Identifying the Degree of a Polynomial Regression","228731149":"A semidefinite programming study of the Elfving theorem","232818897":"Bayesian D-Optimal and Model Robust Designs in Linear Regression Models","45130754":"Geometric construction of optimal designs for dose-responsemodels with two parameters","251087971":"A new interpretation of optimality for E -optimal designs in linear regression models","38326813":"Gustav Elfving\u0027s Contribution to the Emergence of the Optimal Experimental Design Theory","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","230998835":"Computing optimal designs of multiresponse experiments reduces to second-order cone programming","277027284":"Model-robust R -optimal designs in linear regression models","250754766":"Review of optimal Bayes designs","228750015":"Universal Optimality of Bayesian Experimental Designs and Optimal Data Augmentations","38363031":"Bayesian Experimental Design: A Review","250754765":"28 Model robust designs"},"index":335}