{"abs":"We speed up the Monte Carlo simulation of static graph reliability models by adding graph reductions to zero-variance importance sampling (ZVIS) approximation techniques. ZVIS approximation samples the status of links sequentially, and at each step we check if series-parallel reductions can be performed. We present two variants of the algorithm and describe their respective advantages. We show that the method satisfies robustness properties as the reliability of links increases. We illustrate theoretically on small examples and numerically on large ones the gains that can be obtained, both in terms of variance and computational time.","title":"Graph Reductions to Speed Up Importance Sampling-Based Static Reliability Estimation","id":254049782,"url":"https://www.researchgate.net/publication/254049782_Graph_Reductions_to_Speed_Up_Importance_Sampling-Based_Static_Reliability_Estimation","names":["Pierre L’Ecuyer","Samira Saggadi","Bruno Tuffin","Proceedings - Winter Simulation Conference"],"references":{"224231101":"Approximate Zero-Variance Importance Sampling for Static Network Reliability Estimation","240965884":"Bounds on the Reliability Polynomial for Shellable Independence Systems","228048982":"Rare Event Analysis by Monte Carlo Techniques in Static Models","227446636":"Importance Sampling for the Simulation of Highly Reliable Markovian Systems","41448443":"A new simulation estimator of system reliability","268718670":"Rare Event Simulation Using Monte Carlo Methods","228057692":"The Combinatorics of Network Reliability","288676731":"Network reliability evaluation, state-of-the art in performance modeling and simulation","29649681":"Asymptotic Robustness of Estimators in Rare-Event Simulation","284528546":"Regenerative Stochastic Simulation.","224209093":"Combination of conditional Monte Carlo and approximate zero-variance importance sampling for network reliability estimation","3152618":"The recursive variance-reduction simulation algorithm for network reliability evaluation","220286431":"Efficient Monte Carlo simulation via the generalized splitting method"},"citedIn":{"237697084":"Curriculum Vitae Bruno Tun","261299819":"Dependent Failures in Highly Reliable Static Networks","242669996":"RENSEIGNEMENTS PERSONNELS","275167977":"Some Recent Results in Rare Event Estimation"},"index":336}