{"abs":"We present a versatile Monte Carlo method for estimating multidimensional integrals, with applications to rare-event probability estimation. The method fuses two distinct and popular Monte Carlo simulation methods—Markov chain Monte Carlo and importance sampling—into a single algorithm. We show that for some applied numerical examples the proposed Markov Chain importance sampling algorithm performs better than methods based solely on importance sampling or MCMC.","title":"Markov chain importance sampling with applications to rare event probability analysis","id":257665533,"url":"https://www.researchgate.net/publication/257665533_Markov_chain_importance_sampling_with_applications_to_rare_event_probability_analysis","names":["Zdravko I. Botev","Pierre L’Ecuyer","Bruno Tuffin","Statistics and Computing"],"references":{"228048982":"Rare Event Analysis by Monte Carlo Techniques in Static Models","220244066":"Portfolio Credit Risk with Extremal Dependence: Asymptotic Analysis and Efficient Simulation","200105001":"Equation of State by Fast Computing Machines","227104590":"Simulation of right- and left-truncated gamma distribution by mixtures","50996224":"Handbook of Monte Carlo Methods","268718670":"Rare Event Simulation Using Monte Carlo Methods","265727384":"Stochastic Simulation: Algorithms and Analysis","220136464":"Importance sampling for sums of random variables with regularly varying tails","234005026":"A Comparison of Cross-Entropy and Variance Minimization Strategies","221669734":"Equations of State Calculations by Fast Computing Machines","226410286":"Analysis and Improvements of Path-Based Methods for Monte Carlo Reliability Evaluation of Static Models","29649681":"Asymptotic Robustness of Estimators in Rare-Event Simulation","41222435":"Monte Carlo Statistical Method","243764509":"Marginal likelihood from the Gibbs output. J Am Stat Assoc","254049791":"An importance sampling method based on a one-step look-ahead density from a Markov chain","261122380":"Fitting mixture importance sampling distributions via improved cross-entropy","265815481":"An Introduction to Rare Event Simulation","235622440":"Monte Carlo Methods in Financial Engineering","49514135":"Efficient simulation of tail probabilities of sums of correlated lognormals","210222819":"Simulation and the Monte Carlo Method","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","215446267":"Monte Carlo Strategies in Scientic Computing","254287814":"Nonparametric Importance Sampling","1748970":"Efficient rare-event simulation for the maximum of heavy-tailed random walks. Ann Appl Probab","243769716":"“The Statistical Analysis of Non-Lattice Data.”","228768913":"Static Network Reliability Estimation Via Generalized Splitting","38339957":"Counterexamples in importance sampling for large deviations probabilities. Ann. Appl. Probab. 7, 731-746","46401273":"Improved Cross-Entropy Method for Estimation","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","221526731":"Approximate zero-variance simulation"},"citedIn":{"258247188":"On the use of marginal posteriors in marginal likelihood estimation via importance-sampling","267120362":"Multicanonical MCMC for sampling rare events: An illustrative review","259239840":"Rare-event Probability Estimation via Empirical Likelihood Maximization","258392994":"A QoS-Satisfied Prediction Model for Cloud-Service Composition Based on a Hidden Markov Model","276922885":"Layered Adaptive Importance Sampling","237697084":"Curriculum Vitae Bruno Tun","281329565":"Static Network Reliability Estimation under the Marshall-Olkin Copula","242669996":"RENSEIGNEMENTS PERSONNELS","280310254":"Estimating the small failure probability of a nuclear passive safety system by means of an efficient Adaptive Metamodel-Based Subset Importance Sampling method","267473594":"Markov Chains and Dependability Theory","257749088":"Semiparametric Cross Entropy for rare-event simulation","277313035":"Adaptive Importance Sampling in Signal Processing"},"index":338}