{"abs":"We consider the Bayesian D-optimal design problem for exponential growth models with one, two or three parameters. For the one-parameter model conditions on the shape of the density of the prior distribution and on the range of its support are given guaranteeing that a one-point design is also Bayesian D-optimal within the class of all designs. In the case of two parameters the best two-point designs are determined and for special prior distributions it is proved that these designs are Bayesian D-optimal. Finally, the exponential growth model with three parameters is investigated. The best three-point designs are characterized by a nonlinear equation. The global optimality of these designs cannot be proved analytically and it is demonstrated that these designs are also Bayesian D-optimal within the class of all designs if gamma-distributions are used as prior distributions.","title":"Bayesian D-optimal designs for exponential regression models","id":223753350,"url":"https://www.researchgate.net/publication/223753350_Bayesian_D-optimal_designs_for_exponential_regression_models","names":["Holger Dette","H.-M. Neugebauer","Journal of Statistical Planning and Inference"],"references":{"216300596":"Theory of Optimal Experiments Designs","222746918":"Bayesian optimal one point designs for one parameter nonlinear models","221956664":"Bayesian design for accelerated life testing","38367355":"Locally Optimal Designs for Estimating Parameters","223350547":"Optimal Bayesian design applied to logistic regression","36817803":"Probability and Mathematical Statistics","31343842":"Design of Experiments in Non-Linear Situations","222492574":"Bayesian D-optimal designs for the exponential growth model","230873103":"Experimental Design in a Class of Models","266256515":"Problems and approaches in design of experiments for estimation and testing in non-linear models","222314446":"A note on optimal Bayesian design for nonlinear problems"},"citedIn":{"1915164":"Locally D-optimal designs based on a class of composed models resulted from blending Emax and one-compartment models","222732421":"D-optimal designs for logistic models with three and four parameters","233530031":"A Compilation of the D-Optimal Designs in Chemical Kinetics","257984296":"A semi-infinite programming based algorithm for finding minimax optimal designs for nonlinear models","267652862":"Highly Efficient Designs to Handle the Incorrect Specification of Linear Mixed Models","6723181":"Curvature-adjusted optimal design of sampling times for the inference of pharmacokinetic compartment models","259128508":"Robust static designs for approximately specified nonlinear regression models","255589941":"LOCALLY D-OPTIMAL DESIGNS BASED ON A CLASS OF MODELS COMBINING AN EMAX AND ONE-COMPARTMENT MODELS","24060768":"Locally D- and c-optimal designs for Poisson and negative binomial regression models","228784242":"Bayesian Minimally Supported D -Optimal Designs for an Exponential Regression Model","227464414":"Optimal designs for the EMAX, log-linear and exponential model","222419287":"Efficient experimental designs for sigmoidal growth models","38348944":"Optimal Bayesian designs for models with partially specified heteroscedastic structure","227368980":"A Note on B-Splines for Semiparametric Elicitation","28351850":"Applied Optimal Designs","46247451":"A-Optimalität für den Vergleich mit einer Kontrolle bei Crossover-Designs","222492574":"Bayesian D-optimal designs for the exponential growth model","258247545":"Optimal designs for nonlinear regression models with respect to non-informative priors","228750015":"Universal Optimality of Bayesian Experimental Designs and Optimal Data Augmentations","237373689":"Dottorato di Ricerca in Metodologia Statistica per la Ricerca Scientiflca","226301794":"Optimal Designs for the Exponential Model with Correlated Observations","222746918":"Bayesian optimal one point designs for one parameter nonlinear models","31373630":"Bayesian D-optimal designs on a fixed number of design points for heteroscedastic polynomial models","233331785":"D-Efficient Bayesian Designs for a Class of Nonlinear Models","226401436":"Applications of necessary and sufficient conditions for maximin efficient designs","272121563":"Optimal Designs for Regression Models With a Constant Coefficient of Variation","222983341":"D- and c-optimal designs for exponential regression models used in viral dynamics and other applications","223892863":"Maximin efficient design of experiment for exponential regression model","6269688":"Experimental design for regression analysis when the responses are subject to censoring","259313118":"Optimal designs for multi-response generalized linear models with applications in thermal spraying","265264739":"Optimal Designs for a Modified Exponential Model","28351709":"Efficient Design of Experiment for Exponential Regression Models","1760183":"On the number of support points of maximin and Bayesian D-optimal designs in nonlinear regression models","222214031":"Macchietto, S.: Model-based design of experiments for parameter precision: State of the art. Chemical Engineering Science 63(19), 4846-4872","283624726":"Locally optimal designs for errors-in-variables models","254870596":"Robust designs for longitudinal studies","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","38348274":"Imhof, L.A.: Maximin designs for exponential growth models and heteroscedastic polynomial models. Ann. Stat. 29, 561-576","45867264":"Optimal discrimination designs","250754766":"Review of optimal Bayes designs","222870772":"Some applications of Stieltjes transforms in the construction of optimal designs for nonlinear regression models"},"index":341}