{"abs":"Improving Importance Sampling estimators for rare event probabilities requires sharp approximations of conditional densities. This is achieved for events E_{n}:\u003d(f(X_{1})+...+f(X_{n}))\\inA_{n} where the summands are i.i.d. and E_{n} is a large or moderate deviation event. The approximation of the conditional density of the real r.v\u0027s X_{i} \u0027s, for 1\\leqi\\leqk_{n} with repect to E_{n} on long runs, when k_{n}/n\\to1, is handled. The maximal value of k compatible with a given accuracy is discussed; algorithms and simulated results are presented.","title":"Small Variance Estimators for Rare Event Probabilities","id":51889883,"url":"https://www.researchgate.net/publication/51889883_Small_Variance_Estimators_for_Rare_Event_Probabilities","names":["Michel Broniatowski","Caron Virgile","ACM Transactions on Modeling and Computer Simulation"],"references":{"224231101":"Approximate Zero-Variance Importance Sampling for Static Network Reliability Estimation","45877464":"Importance Sampling for rare events and conditioned random walks","235043365":"Importance Sampling, Large Deviations, and Differential Games","228045852":"Rare Event Simulation using Monte Carlo Methods","225255521":"A unified formulation of the central limit theorem for small and large deviations from the mean","222297395":"Splitting for rare event simulation: A large deviation approach to design and analysis","243085743":"Introduction to Rare Event Simulation","265671207":"Moderate Deviations and Associated Laplace Approximations for Sums of Independent Random Vectors","38360762":"Strong Moderate Deviation Theorems","227253439":"Conditional limit theorems for exponential families and finite versions of de Finetti\u0027s theorem","238879496":"On Sharp Large Deviations for Sums of Random Vectors and Multidimensional Laplace Approximation","29649681":"Asymptotic Robustness of Estimators in Rare-Event Simulation","38359356":"Natural Real Exponential Families with Cubic Variance Functions","250976578":"Importance sampling for simulations of moderate deviation probabilities of statistics","226303365":"Efficient Simulation of Light-Tailed Sums: an Old-Folk Song Sung to a Faster New Tune...","243099076":"Local Limit Theorems for Large Deviations","248685801":"Information and Exponential Families: In Statistical Theory","47438568":"Long runs under point conditioning. The real case","3077618":"On large deviations theory and asymptotically efficient Monte Carlo estimation","261122380":"Fitting mixture importance sampling distributions via improved cross-entropy","2214973":"Dynamic importance sampling for queueing networks","38339957":"Counterexamples in importance sampling for large deviations probabilities. Ann. Appl. Probab. 7, 731-746","220136514":"Simulation in Exponential Families","220286431":"Efficient Monte Carlo simulation via the generalized splitting method"},"citedIn":{"259718111":"Approximation of a multivariate conditional density","259718113":"Importance Sampling for multi-constraints rare event probability","221661773":"Long runs under a conditional limit distribution","221661961":"Conditional Inference in Parametric Models","275167977":"Some Recent Results in Rare Event Estimation"},"index":352}