{"abs":"Nous nous intéressons au risque d\u0027inondation d\u0027une zone habitable ou industrielle, située à proximité d\u0027un fleuve. Le risque est évalué à partir d\u0027un modèle de la ligne d\u0027eau du fleuve en présence d\u0027incertitudes sur le débit et les caractéristiques du lit fluvial. Comme l\u0027évaluation du modèle de la hauteur d\u0027eau, pour un débit et des caractéristiques du lit fixés, est potentiellement coûteux en temps de calcul, l\u0027estimation d\u0027une probabilité de dépassement de seuil ou d\u0027un quantile de la hauteur d\u0027eau doit en pratique être conduite avec un budget réduit de simulations. Dans cet article, nous nous intéressons spécifiquement à l\u0027estimation d\u0027un quantile et nous proposons une méthode de planification d\u0027expériences séquentielle qui construit une approximation du modèle par krigeage en choisissant les points d\u0027évaluation du modèle de manière à réduire la variance d\u0027estimation du quantile.","title":"Évaluation d\u0027un risque d\u0027inondation fluviale par planification séquentielle d\u0027expériences","id":44709664,"url":"https://www.researchgate.net/publication/44709664_Evaluation_d\u0027un_risque_d\u0027inondation_fluviale_par_planification_sequentielle_d\u0027experiences","names":["Aurélie Arnaud","Julien Bect","Mathieu Couplet","Alberto Pasanisi","Emmanuel Vazquez"],"references":{"239382660":"All of Nonparametric Statistics","242922491":"Bayesian Approach to Global Optimization--Theory and Applications","2695898":"Importance Sampling For Monte Carlo Estimation Of Quantiles","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","1911433":"Controlled stratification for quantile estimation","4772685":"Estimating percentiles of uncertain computer code outputs","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","2271306":"Control Variates for Probability and Quantile Estimation","267437693":"Geostatistic: Modeling Spatial Uncertainty"},"citedIn":{"277977174":"Sequential Design of Computer Experiments for the Assessment of Fetus Exposure to Electromagnetic Fields","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure"},"index":353}