{"abs":"A Markov chain is geometrically ergodic if it converges to its in- variant distribution at a geometric rate in total variation norm. We study geo- metric ergodicity of deterministic and random scan versions of the two-variable Gibbs sampler. We give a sufficient condition which simultaneously guarantees both versions are geometrically ergodic. We also develop a method for simul- taneously establishing that both versions are subgeometrically ergodic. These general results allow us to characterize the convergence rate of two-variable Gibbs samplers in a particular family of discrete bivariate distributions.","title":"On the Geometric Ergodicity of Two-Variable Gibbs Samplers","id":227716616,"url":"https://www.researchgate.net/publication/227716616_On_the_Geometric_Ergodicity_of_Two-Variable_Gibbs_Samplers","names":["Aixin Tan","Galin L. Jones","James P. Hobert"],"references":{"242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","243765318":"Covariance Structure of the Gibbs Sampler with Applications to the Comparison of Estimators and Augmentation Schemes","38326862":"Honest Exploration of Intractable Probability Distributions Via Markov Chain Monte Carlo","2554222":"On the Geometric Convergence of the Gibbs Sampler","23418348":"Batch Means and Spectral Variance Estimation in Markov Chain Monte Carlo","4986693":"Fixed-Width Output Analysis for Markov Chain Monte Carlo","2136938":"Markov Chain Monte Carlo: Can We Trust the Third Significant Figure?","227512257":"Markov Chains and De‐initializing Processes","2859706":"Convergence of Slice Sampler Markov Chains","222605911":"Geometric Ergodicity of Gibbs and Block Gibbs Samplers for a Hierarchical Random Effects Model","1772108":"Comment: Gibbs Sampling, Exponential Families and Orthogonal Polynomials","38363029":"Convergence Control Methods for Markov Chain Monte Carlo Algorithms","2729461":"Analysis of the Gibbs sampler for a model related to James-Stein estimators","265702859":"Geometric Ergodicity of van Dyk and Meng\u0027s Algorithm for the Multivariate Student\u0027s t Model","38357609":"Markov Chains for Exploring Posterior Distributions","243762788":"Covariance Structure and Convergence Rate of the Gibbs Sampler with Various Scans","200111118":"Markov Chains and Stochastic Stability","2111878":"General state space Markov chains and MCMC algorithms","45926545":"Sweave Documentation for \"Implementing Markov chain Monte Carlo: Estimating with confidence\"","31135087":"On the Applicability of Regenerative Simulation in Markov Chain Monte Carlo","2213337":"Gibbs Sampling for a Bayesian Hierarchical General Linear Model","268160642":"Introduction to Markov chain Monte Carlo","26406507":"On the Markov chain central limit theorem","2113436":"Sufficient burn-in for Gibbs samplers for a hierarchical random effects model.The Annals of Statistics, 32(2):784-817","251930745":"Block Gibbs Sampling for Bayesian Random Effects Models With Improper Priors: Convergence and Regeneration","4914292":"Convergence rates and asymptotic standard errors for Markov chain Monte Carlo algorithms for Bayesian probit regression"},"citedIn":{"280589868":"Strong Consistency of Multivariate Spectral Variance Estimators in Markov Chain Monte Carlo"},"index":359}