{"abs":"We develop a simulation-based method for the online updating of Gaussian process regression and classification models. Our method exploits sequential Monte Carlo to produce a fast sequential design algorithm for these models relative to the established MCMC alternative. The latter is less ideal for sequential design since it must be restarted and iterated to convergence with the inclusion of each new design point. We illustrate some attractive ensemble aspects of our SMC approach, and show how active learning heuristics may be implemented via particles to optimize a noisy function or to explore classification boundaries online. Comment: 18 pages, 5 figures, submitted","title":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","id":45875211,"url":"https://www.researchgate.net/publication/45875211_Particle_Learning_of_Gaussian_Process_Models_for_Sequential_Design_and_Optimization","names":["Robert B. Gramacy","Nicholas G. Polson","Journal of Computational and Graphical Statistics"],"references":{"2455557":"Information--Based Objective Functions for Active Data Selection","216301381":"The Design and Analysis Computer Experiments","239666344":"Regression and Classification Using Gaussian Process Priors","5142988":"tgp: An R Package for Bayesian Nonstationary, Semiparametric Nonlinear Regression and Design by Treed Gaussian Process Models","255617855":"Easier Parallel Computing in R with snowfall and sfCluster","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","265681840":"Sequential Imputations and Bayesian Missing Data Problems","221933053":"Interpolation of Spatial Data","241216681":"Bayesian Guided Pattern Search for Robust Local Optimization","45849138":"Classification and Categorical Inputs with Treed Gaussian Process Models","30962641":"Problems With Likelihood Estimation of Covariance Functions of Spatial Gaussian Processes","41781559":"Gaussian Process for Machine Learning","4747012":"Optimal Bayesian Design by Inhomogeneous Markov Chain Simulation","2329902":"Space and Space-Time Modeling Using Process Convolutions","4772026":"Following a moving target-Monte Carlo inference for dynamic Bayesian models","216756632":"Sequential Design of Computer Experiments to Minimize Integrated Response Functions","46515760":"Categorical Inputs, Sensitivity Analysis, Optimization and Importance Tempering with tgp Version 2, an R Package for Treed Gaussian Process Models","254330877":"A Note on the Updating of Regression Estimates","2369650":"“Filtering Via Simulation: Auxiliary Particle Filter”","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","2469117":"Sequential Importance Sampling for Nonparametric Bayes Models: The Next Generation","221363883":"Multi-class active learning for image classification","2590205":"Sequential Monte Carlo Methods for Dynamic Systems","243767612":"Blind Deconvolution via Sequential Imputations"},"citedIn":{"260317958":"The mesh adaptive direct search algorithm with treed Gaussian process surrogates","266856357":"Calibrating a large computer experiment simulating radiative shock hydrodynamics","51932830":"Variable selection and sensitivity analysis via dynamic trees with an application to computer code performance tuning","51957151":"Bayesian Optimization Using Sequential Monte Carlo","263454963":"Comment: On Advances in Expected Improvement","279045804":"Sequential process convolution Gaussian process models via particle learning","265209665":"Augmentation Schemes for Particle MCMC","267010555":"Recent developments in applied probability and statistics. Dedicated to the memory of Jürgen Lehn","254331259":"Quantile-Based Optimization of Noisy Computer Experiments With Tunable Precision","271511799":"Computer emulation with non-stationary Gaussian processes","265252310":"Speeding up neighborhood search in local Gaussian process prediction","283115201":"Multivariate Stochastic Process Models for Correlated Responses of Mixed Type","256606229":"Sequential Design for Optimal Stopping Problems","274830527":"Bayesian Sequential Experimental Design for Binary Response Data with Application to Electromyographic Experiments","258082179":"Massively Parallel Approximate Gaussian Process Regression","235765935":"Local Gaussian Process Approximation for Large Computer Experiments","281440800":"Applications of Dynamic Trees to Sensitivity Analysis","259163220":"Bayesian optimal sequential design for nonparametric regression via inhomogeneous evolutionary MCMC","45888917":"Dynamic Trees for Learning and Design","271511557":"Computer emulation with non-stationary Gaussian processes","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","256070253":"Computer emulation with non-stationary Gaussian processes","46586550":"Gaussian Process Single-Index Models as Emulators for Computer Experiments","51217848":"Active Data Collection for Efficient Estimation and Comparison of Nonlinear Neural Models","227450808":"Particle filters and Bayesian inference in financial econometrics","256376113":"BayesOpt: A Library for Bayesian optimization with Robotics Applications","279309842":"Gaussian process hyper-parameter estimation using parallel asymptotically independent Markov sampling","45913547":"Optimization Under Unknown Constraints","257017515":"Sequential Monte Carlo for Bayesian sequentially designed experiments for discrete data","271753928":"Optimization Under Constraints by Applying an Asymmetric Entropy Measure","281671347":"Kriging Metamodels for Bermudan Option Pricing","260945654":"Modeling an Augmented Lagrangian for Improved Blackbox Constrained Optimization"},"index":36}