{"abs":"Crude Monte-Carlo or quasi Monte-Carlo methods are well suited to characterize events of which associated probabilities are not too low with respect to the simulation budget. For very seldom observed events, such as the collision probability between two aircraft in airspace, these approaches do not lead to accurate results. Indeed, the number of available samples is often insufficient to estimate such low probabilities (at least $10^6$ samples are needed to estimate a probability of order $10^{-4}$ with $10\\%$ relative error with Monte-Carlo simulations). In this article,one reviewed different appropriate techniques to estimate rare event probabilities that require a fewer number of samples. These methods can be divided into four main categories: parameterization techniques of probability density function tails, simulation techniques such as importance sampling or importance splitting, geometric methods to approximate input failure space and finally, surrogate modelling. Each technique is detailed, its advantages and drawbacks are described and a synthesis that aims at giving some clues to the following question is given: \"which technique to use for which problem?\".","title":"A survey of rare event simulation methods for static input-output models","id":266943935,"url":"https://www.researchgate.net/publication/266943935_A_survey_of_rare_event_simulation_methods_for_static_input-output_models","names":["Jérôme Morio","Mathieu Balesdent","Damien Jacquemart","Christelle Vergé","Simulation Modelling Practice and Theory"],"references":{"228438173":"Simultaneous kriging-based estimation and optimization of mean response","3233840":"Quick Simulation: A Review of Importance Sampling Techniques in Communications Systems","247345850":"Realistic and efficient reliability estimation in space engineering","224049502":"Computational Approaches for Aerospace Design","233502435":"A farewell to the use of antithetic variates in Monte Carlo simulation","50996224":"Handbook of Monte Carlo Methods","222297395":"Splitting for rare event simulation: A large deviation approach to design and analysis","242386046":"Estimation of Particle Transmission by Random Sampling","227624095":"Nonparametric Partial Importance Sampling for Financial Derivative Pricing","222289965":"On Computation Methods for Structural Reliability Analysis","4899167":"Reiss and Thomas\u0027 automatic selection of the number of extremes","220341819":"Computationally efficient black-box modeling for feasibility analysis","2214973":"Dynamic importance sampling for queueing networks","38357609":"Markov Chains for Exploring Posterior Distributions","222727526":"Limit state function identification using Support Vector Machines for discontinuous responses and disjoint failure domains","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","235622440":"Monte Carlo Methods in Financial Engineering","223269739":"Comparison of response surface and neural network with other methods for structural reliability analysis","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","235043365":"Importance Sampling, Large Deviations, and Differential Games","256081252":"Missile target accuracy estimation with importance splitting","51888191":"Metamodel-based importance sampling for the simulation of rare events","292060738":"Monte carlo calculation of the average extension of molecular chains","238342681":"Principles of geostatistics. Econ Geol (Lancaster)","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","225805894":"Asymptotic approximations for multinormal domain and surface integrals","2126101":"Genealogical particle analysis of rare events","228620438":"Modeling hydrologic and water quality extremes in a changing climate: A statistical approach based on extreme value theory","264960498":"Sur la Distribution Limite du Terme Maximum d\u0027une Serie Aleatoire","245155749":"Short-term reliability evaluation using control variable based dagger sampling method","221525517":"Latin Hypercube Sampling as a Tool in Uncertainty Analysis of Computer Models","38339957":"Counterexamples in importance sampling for large deviations probabilities. Ann. Appl. Probab. 7, 731-746","264960244":"Extreme Values, Regular Variation, and Point Processes","46103168":"Adaptive particle techniques and rare event estimation","230663933":"An Introduction to Statistical Modeling of Extreme Values. Springer Series in Statistics XIV","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","225713713":"Estimating tail probabilities of heavy tailed distributions with asymptotically zero relative error","257334800":"LOcal Uncertainty Processing (LOUP) method for multidisciplinary robust design optimization","256035594":"Probabilistic Bounded Relative Error Property for Learning Rare Event Simulation Techniques","229374179":"Reliability sensitivity method by line sampling","256379905":"Structural Reliability Under Combined Random Load Sequences","38367260":"Saddlepoint Approximations in Statistics","250133183":"Bounded Relative Error Importance Sampling and Rare Event Simulation","3702624":"Worst case efficiency of Latin hypercube sampling Monte Carlo (LHSMC) yield estimator of electrical circuits","275188793":"Asymptotic Approximations for Multinormal Integrals","266161026":"Extreme Value and Related Models in Engineering and Science Applications","224583171":"Efficient Evaluation of System Reliability by Monte Carlo Method","265815481":"An Introduction to Rare Event Simulation","268209561":"M Carlo Statistical Methods","232405682":"Adaptive directional stratification for controlled estimation of the probability of a rare event","256699173":"On the new type of extreme value distributions","228583924":"Statistical Analysis of Extreme Values","246868698":"Rosenbluth, M. N. \u0026 Rosenbluth, A. W. Monte Carlo calculation of the average extension of molecular chains. J. Chem. Phys. 23, 356","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","256080947":"Extreme quantile estimation with nonparametric adaptive importance sampling","222527794":"Identification of pre-sliding and sliding friction dynamics: Grey box and black-box models","236660847":"Exact and Invariant Second Moment Code Format","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","3863119":"Splitting for rare event simulation: Analysis of simple cases","38358079":"Importance Sampling in the Monte Carlo Study of Sequential Tests","226607607":"Diffuse response surface model based on moving Latin hypercube patterns for reliability-based design optimization of ultrahigh strength steel NC milling parameters","265348266":"Applied Probability and Queues","224583960":"A New Monte Carlo Method for Evaluating System-Failure Probability","233211802":"Statistical choice of extreme value domains of attraction - A comparative analysis","38359348":"On the Estimation of the Extreme-Value Index and Large Quantile Estimation","244960231":"A new Monte-Carlo Method for Estimating the Failure Probability of an N-Component System","268310392":"Parametric estimates by the Monte Carlo method","265366105":"Determination des distribution dont les marges sont donnees","226250740":"Mean-squared error of kernel estimators for finite values of the sample size","222868929":"On Latin Hypercube Sampling for structural reliability analysis","228045852":"Rare Event Simulation using Monte Carlo Methods","264995908":"Modeling Extremal Events: For Insurance and Finance","257497046":"Goodness-Of-Fit Techniques","227516446":"Importance sampling: A review","245425458":"First Order Saddlepoint Approximation for Reliability Analysis","2118579":"Dynamic importance sampling for uniformly recurrent Markov chains","227043867":"Modelling of extremal events in insurance and finance","228663093":"Extreme value statistics of snowfall in the Swiss Alpine region","1911433":"Controlled stratification for quantile estimation","258229233":"Large deviations","216756604":"Latin hypercube sampling used in the calculation of the fracture probability","3325093":"A study of stratified sampling in variance reduction techniques for parametric yield estimation","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","263047733":"Structural Reliability Methods","3772320":"RESTART: A straightforward method of fast simulation of rare event","251463777":"Chapter 11 Rare-Event Simulation Techniques: An Introduction and Recent Advances","225313264":"Modified Latin Hypercube Sampling Monte Carlo (MLHSMC) Estimation for Average Quality Index","245865479":"Density Estimation for Statistics and Data Analysis, Chapman and Hall, New York","216301381":"The Design and Analysis Computer Experiments","38367467":"Remarks on a multivariate transformation. Ann Math Stat","2837897":"Rare Event Estimation for Static Models via Cross-Entropy and Importance Sampling","45715738":"Extreme Value Theory for Finance: A Survey","224061436":"Splitting for Rare-Event Simulation","29609061":"A sequential Bayesian algorithm to estimate a probability of failure","224583364":"Dagger-Sampling Monte Carlo For System Unavailability Evaluation","257101557":"Reliability of structures in high dimensions. Part II. Theoretical validation","245186106":"An innovating analysis of the Nataf transformation from the copula viewpoint","229410827":"A generalization of the Nataf transformation to distribution with copula","256564461":"Variance reduction in Monte-Carlo radiation transport using antithetic variates","1925045":"Computationally Efficient Nonparametric Importance Sampling","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","228020798":"Splitting Techniques","1919415":"Special invited paper. Large deviations","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","226031060":"Sequential Monte Carlo for rare event estimation","247109655":"Parameter and Quantile Estimation for the Generalized Pareto Distribution","216301386":"Flexibility and Efficiency Enhancements For Constrainted Global Design Optimization with Kriging Approximations","222396913":"A new Cauchy-based black-box technique for uncertainty in risk analysis","222412529":"Efficient High-Dimensional Monte-Carlo Importance Sampling","1917614":"Touchette, H.: The large deviation approach to statistical mechanics. Phys. Rep. 478, 1-69","227694117":"Monte Carlo methods","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation","222305920":"A general procedure for first/second-order reliabilitymethod (FORM/SORM)","228048982":"Rare Event Analysis by Monte Carlo Techniques in Static Models","222062335":"A new directional simulation method for system reliability. Part II: Application of neural networks","222435975":"Approximations to the tail empirical distribution function with application to testing extreme value conditions","29601545":"Rare event simulation for a static distribution","257657239":"On the block maxima method in extreme value theory: PWM estimators","38357892":"Statistical Inference Using Extreme Order Statistics","265373697":"Slow Variation and Characterization of Domains of Attraction","222660503":"Moment methods for structural reliability[J]","29649681":"Asymptotic Robustness of Estimators in Rare-Event Simulation","254331133":"Practical Saddlepoint Approximations","228632440":"Rare event simulation techniques: An introduction and recent advances","29596955":"Genetic Genealogical Models in Rare Event Analysis","3152618":"The recursive variance-reduction simulation algorithm for network reliability evaluation","243758427":"An Exact and Invariant First Order Reliability Format","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","248560911":"Importance sampling in structural system","223734448":"Probabilistic uncertainty analysis by mean-value first order Saddlepoint Approximation","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","3152089":"A Recursive Variance-Reduction Algorithm For Estimating Communication-Network Reliability","222380456":"Evaluation of Failure Probability via Surrogate Models","223944114":"Reliability-based design sensitivity by efficient simulation","221676250":"Meta-models for Structural Reliability and Uncertainty Quantification","231743804":"Rare event simulation","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","38349735":"On Asymptotically efficient simulation of large deviation probabilities","254287814":"Nonparametric Importance Sampling","223053477":"Explicit output-feedback nonlinear predictive control based on black-box models","246143323":"Explaining the Saddlepoint Approximation","273800355":"Probability Integration by Directional Simulation","268441586":"IMPROVING ACCURACY AND COMPENSATING FOR UNCERTAINTY IN SURROGATE MODELING","3614401":"Evaluation of large deviation probabilities via importance sampling","251712760":"State-dependent importance sampling for rare-event simulation: An overview and recent advances","222945716":"Optimization algorithms for structural reliability","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","220313310":"A Class of Optimum Improtance Sampling Strategies."},"citedIn":{"284900779":"An island particle algorithm for rare event analysis"},"index":365}