{"abs":"Considering the issue of estimating small probabilities p, ie. measuring a rare domain F \u003d {x | g(x) \u003e q} with respect to the distribution of a random vector X, Multilevel Splitting strategies (also called Subset Simulation) aim at writing F as an intersection of less rare events (nested subsets) such that their measures are conditionally easily computable. However the definition of an appropriate sequence of nested subsets remains an open issue. We introduce here a new approach to Multilevel Splitting methods in terms of a move of particles in the input space. This allows us to derive two main results: (1) the number of samples required to get a realisation of X in F is drastically reduced, following a Poisson law with parameter log 1/p (to be compared with 1/p for naive Monte-Carlo); and (2) we get a parallel optimal Multilevel Splitting algorithm where there is indeed no subset to define any more. We also apply result (1) in quantile estimation producing a new parallel algorithm and derive a new strategy for the construction of first Design Of Experiments in meta-model based algorithms.","title":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","id":262265054,"url":"https://www.researchgate.net/publication/262265054_Moving_Particles_a_parallel_optimal_Multilevel_Splitting_method_with_application_in_quantiles_estimation_and_meta-model_based_algorithms","names":["Clément Walter"],"references":{"245284126":"Dynamic Characterization of Two-Degree-of-Freedom Equipment-Structure Systems","216301381":"The Design and Analysis Computer Experiments","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","210222819":"Simulation and the Monte Carlo Method","51888191":"Metamodel-based importance sampling for the simulation of rare events","248667834":"Marked Point Processes on the Real Line: The Dynamic Approach","226031060":"Sequential Monte Carlo for rare event estimation","246868698":"Rosenbluth, M. N. \u0026 Rosenbluth, A. W. Monte Carlo calculation of the average extension of molecular chains. J. Chem. Phys. 23, 356","222165872":"Reliability analysis—A review and some perspectives","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","244955309":"A First Course in Order Statistics","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","41222435":"Monte Carlo Statistical Method","29596955":"Genetic Genealogical Models in Rare Event Analysis","224678908":"Optimal Watermark Embedding and Detection Strategies Under Limited Detection Resources","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","27348184":"Structural reliability using Finite Element Analysis - An appraisel of DARS: Directional Adaptive Response surface Sampling","222780925":"A new adaptive importance sampling scheme","4993330":"Sequential Monte Carlo Samplers","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{"284750937":"Rare event simulation and spliting for discontinuous random variables","275535124":"Splitting Sequential Monte Carlo for Ecient Unreliability Estimation of Highly Reliable Networks","285310904":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation","279808481":"Rare Event Simulation and Splitting for Discontinuous Random Variables","285321983":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation"},"index":378}