{"abs":"This paper investigates the problem of assembly line balancing problem, in which the products in the production line may undergo to be reworked on the current task. Since the real manufacturing systems deal with the stochastic nature of the items in production lines, this paper considers the simple assembly line balancing problem type 2 (SALBP-II) under the conditions of stochastic processing time of tasks and the element of reworking system. Exposing to the stochastic conditions encouraged us to handle the problem via simulation optimization procedure, which uses the well known genetic algorithm as an optimization tool. Results show the adaptation and effectiveness of GA to considered problem.","title":"A simulation optimization approach to un-paced assembly line balancing problem-II with additional reworking issue","id":261169822,"url":"https://www.researchgate.net/publication/261169822_A_simulation_optimization_approach_to_un-paced_assembly_line_balancing_problem-II_with_additional_reworking_issue","names":[],"references":{"245387010":"Scheduling and balancing assembly lines with the task deterioration effect","257403645":"A Simulated Annealing Technique for Multi-Objective Simulation Optimization","245310868":"Line balancing and model sequencing to reduce work overload in mixed-model U-line production environments","220470991":"Scheduling of parallel machines to minimize total completion time subject to s-precedence constraints","234125560":"Discret-Event System Simulation","222684136":"A multi-objective genetic algorithm for robust flight scheduling using simulation. Eur J Oper Res","240286364":"The Assembly Line Balancing Problem","222192496":"A versatile algorithm for assembly line balancing","222542444":"Kochel, P.: Simulation-based sequencing and lot size optimisation for a production-and-inventory system with multiple items. Int. J. Prod. Econ. 104(1), 191-200","225354111":"Ordinal Optimization and Quantification of Heuristic Designs","223942760":"A hybrid genetic algorithm approach on multi-objective of assembly planning problem","220403345":"A Hybrid Genetic Algorithm for Assembly Line Balancing","4812442":"Balancing assembly lines with tabu search","223853092":"A hybrid genetic algorithm–neural network strategy for simulation optimization","220675124":"Simulation optimisation using a genetic algorithm","222616145":"A goal programming approach to simple U-line balancing problem","222623986":"Flow simulation and genetic algorithm as optimization tools","222167561":"Simulation optimization with qualitative variables and structural model changes: A genetic algorithm approach","223072252":"Artiba, A.: Integrating simulation and optimization to scheduling a hybrid flow shop with maintenance constraints. Computers and Industrial Engineering 47, 431-450","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","50926800":"A simulation-based multi-objective genetic algorithm approach for networked enterprises optimization","261858882":"A two-stage methodology for short-term batch plant scheduling","4915607":"A goal programming approach to mixed-model assembly line balancing problem","220691833":"Introduction to Genetic Algorithms"},"citedIn":{},"index":386}