{"abs":"Simulation is a powerful tool for analyzing and designing of industrial and service systems. But simulation can’t optimize the system elements and needs additional methods for optimization. In this study a multiobjective simulation optimization is dealt with. To determine the optimum factor levels, grey-based Taguchi approach is used. Since Taguchi method is designed for single objective problems, grey relational analysis is combined with Taguchi method to solve this multi-objective simulation optimization problem. Additionally, in the stage of grade relational calculation of grey relational analysis (GRA) fuzzy AHP weighting process is adopted to determine the weights of grey relational coefficients.","title":"MULTI-OBJECTIVE SIMULATION OPTIMIZATION USING GREY-BASED TAGUCHI METHOD WITH FUZZY AHP WEIGHTING","id":283327286,"url":"https://www.researchgate.net/publication/283327286_MULTI-OBJECTIVE_SIMULATION_OPTIMIZATION_USING_GREY-BASED_TAGUCHI_METHOD_WITH_FUZZY_AHP_WEIGHTING","names":["Onder Belgin"],"references":{"3834331":"Simulation optimization methodologies","222997259":"Multi-objective simulation-based evolutionary algorithm for an aircraft spare parts allocation problem","251624093":"Application of a weighted Grey-Taguchi method for optimizing recycled aggregate concrete mixtures","220158778":"Multi-objective ordinal optimization for simulation optimization problems","271636790":"Grey-based Taguchi approach for wear assessment of SiC filled carbon–epoxy composites","223325798":"Solving a multiresponse simulation problem using a dual-response system and scatter search method","257403645":"A Simulated Annealing Technique for Multi-Objective Simulation Optimization","224124048":"Redesign of PCB production line with simulation and Taguchi design","257153311":"Multi-objective simulation optimization using data envelopment analysis and genetic algorithm: Specific application to determining optimal resource levels in surgical services","223113537":"A discussion on Extent Analysis Method and applications of fuzzy AHP","223582979":"Solving a multi response simulation optimization problem with discrete variables using a multi attribute decision making method","245310859":"The use of a grey-based Taguchi method for optimizing multi-response simulation problems","267237307":"Comparative analysis Of AHP and fuzzy AHP models for multicriteria inventory classification","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","222194919":"Multi-objective simulation-optimization for earthmoving operations","220381400":"A simulation optimization methodology for supplier selection problem","222806236":"Multi-response simulation optimization using genetic algorithm within desirability function framework","222208354":"Multi-objective simulation optimization through search heuristics and relational database analysis"},"citedIn":{},"index":389}