{"abs":"Genetic programming (GP) is a relatively new metamodelling technique, able to generate an explicit mathematical expression describing the relationship between the input variables and the modelled response. Despite the advantages given by its transparency, GP is still not widely used in optimisation. This paper presents a novel approach to boost GP performances by the exploitation of prior knowledge of the system to be modelled. The efficacy of the approach is tested on a symbolic regression benchmark as well as on two practical optimisation problems. Genetic programming metamodels allowed to find the optimal ventilation design for an industrial bread baking oven and for a hospital ward. The quality of the results obtained using GP are comparable with the ones produced by an established metamodelling technique.","title":"Control of Physical Consistency in Metamodel Building by Genetic Programming","id":269133052,"url":"https://www.researchgate.net/publication/269133052_Control_of_Physical_Consistency_in_Metamodel_Building_by_Genetic_Programming","names":["U. Armani","Zinedine Khatir","Amirul Khan","Vassili Toropov","A. Polynkin","Harvey Morpeth Thompson"],"references":{"228425757":"Faster genetic programming based on local gradient search of numeric leaf values","224049497":"Evolutionary Optimization of Computationally Expensive Problems via Surrogate Modeling","226162108":"Test Examples for Nonlinear Programming Codes","221900817":"Koza, J.R.: Genetic Programming: On the Programming of Computers by Means of Natural Selection. MIT Press","216301261":"A Field Guide to Genetic Programming","241061905":"Solving optimisation problems in metal forming using Finite Element simulation and metamodelling techniques","221009245":"Improving Symbolic Regression with Interval Arithmetic and Linear Scaling","257156964":"Computational Fluid Dynamics (CFD) investigations of air flow and temperature distribution in a small scale bread-baking oven","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","238637025":"Design Optimization and Stochastic Analysis based on the Moving Least Squares Method","227319575":"Comparative Studies of Metamodeling Techniques Under Multiple Modeling Criteria","4089989":"Symbolic regression modeling of blown film process effects","46432703":"Model-Based Problem Solving through Symbolic Regression via Pareto Genetic Programming","245426395":"Cross Validation Can Estimate How Well Prediction Variance Correlates with Error","223263793":"Empirical modelling of shear strength of RC deep beams by genetic programming"},"citedIn":{"288859494":"Detailed design of a lattice composite fuselage structure by a mixed optimization method"},"index":391}