{"abs":"This document describes the new features in version 2.x of the tgp package for R, implementing treed Gaussian process (GP) models. The topics covered include methods for dealing with categorical inputs and excluding inputs from the tree or GP part of the model; fully Bayesian sensitivity analysis for inputs/covariates; sequential optimization of black-box functions; and a new Monte Carlo method for inference in multi-modal posterior distributions that combines simulated tempering and importance sampling. These additions extend the functionality of tgp across all models in the hierarchy: from Bayesian linear models, to classification and regression trees (CART), to treed Gaussian processes with jumps to the limiting linear model. It is assumed that the reader is familiar with the baseline functionality of the package, outlined in the first vignette (Gramacy 2007).","title":"Categorical Inputs, Sensitivity Analysis, Optimization and Importance Tempering with tgp Version 2, an R Package for Treed Gaussian Process Models","id":46515760,"url":"https://www.researchgate.net/publication/46515760_Categorical_Inputs_Sensitivity_Analysis_Optimization_and_Importance_Tempering_with_tgp_Version_2_an_R_Package_for_Treed_Gaussian_Process_Models","names":["Matthew Alan Taddy","Robert B. Gramacy","Journal of statistical software"],"references":{"220343522":"Bayesian Treed Models","5142988":"tgp: An R Package for Bayesian Nonstationary, Semiparametric Nonlinear Regression and Design by Treed Gaussian Process Models","247487939":"Sensitivity analysis for non linear mathematical model","220720288":"Optimally Combining Sampling Techniques for Monte Carlo Rendering","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","241216681":"Bayesian Guided Pattern Search for Robust Local Optimization","221669734":"Equations of State Calculations by Fast Computing Machines","224352142":"A Statistical Framework for the Sensitivity Analysis of Radiative Transfer Models","242577766":"Annealing Markov Chain Monte Carlo with Applications to Ancestral Inference","240310918":"Classification and Regression Trees (CART)","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","1757837":"Importance Tempering","29639452":"A Multi-points Criterion for Deterministic Parallel Global Optimization based on Kriging","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","243773529":"Markov chain Monte Carlo Maximum Likelihood","245078917":"Importance Measures in Global Sensitivity Analysis of Nonlinear Models","2450683":"Bayesian CART model search","45624295":"Minimum variance importance sampling via Population Monte Carlo","2241728":"Safe and Effective Importance Sampling","4745834":"On the Relative Importance of Input Factors in Mathematical Models: Safety Assessment for Nuclear Waste Disposal","1916411":"Local Polynomial Estimation for Sensitivity Analysis on Models With Correlated Inputs","222705706":"Multiple predictor smoothing methods for sensitivity analysis: description of techniques. Reliab Eng Syst Saf","225466652":"Improved Strategies for Radial basis Function Methods for Global Optimization","215446267":"Monte Carlo Strategies in Scientic Computing","222402096":"Making best use of model evaluations to compute sensitivity indices. Comput Phys Commun","222517874":"Implementation and evaluation of nonparametric regression procedures for sensitivity analysis of computationally demanding models","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","253328104":"Global Sensitivity Analysis. The Primer","251735669":"Gaussian Process Models for Computer Experiments With Qualitative and Quantitative Factors","2306327":"Annealed Importance Sampling","245943504":"DISCUSSION ON THE MEETING ON THE GIBBS SAMPLER AND OTHER MARKOV CHAIN-MONTE CARLO METHODS","38359473":"Multi-Variate Adaptive Regression Splines (with Discussion)","216301661":"Screening, Predicting, and Computer Experiments","216301407":"Global versus local search in constrained optimization of computer models","222427005":"Calculations of Sobol indices for the Gaussian process metamodel","2504666":"Markov Chain Monte Carlo in Practice: A Roundtable Discussion","2777175":"Sampling from Multimodal Distributions Using Tempered Transitions"},"citedIn":{"49708407":"Liquorice and glycyrrhetinic acid increase DHEA and deoxycorticosterone levels by inhibiting adrenal SULT2A1 activity","44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","260317958":"The mesh adaptive direct search algorithm with treed Gaussian process surrogates","251618555":"Screening of new additives to heteropoly acid catalyst for Friedel–Crafts reaction by microwave heated HTS and by Gaussian process regression","254253027":"Non-intrusive termination of noisy optimization","261177621":"A review of sensitivity analysis methods in building energy analysis","51932830":"Variable selection and sensitivity analysis via dynamic trees with an application to computer code performance tuning","259188532":"Thinking outside the cHannel: Timing pulse flows to benefit salmon via indirect pathways","269300869":"Foundry technology for RF and high performance analog applications","45849138":"Classification and Categorical Inputs with Treed Gaussian Process Models","283855137":"Cultural Incubators and Spread of Innovation","257018718":"BREAM: A probabilistic Bystander and Resident Exposure Assessment Model of spray drift from an agricultural boom sprayer","259634157":"Meta-models as a straightforward approach to the sensitivity analysis of complex models","257271872":"Bayesian sensitivity analysis of bifurcating nonlinear models","216300146":"SPOT: A Toolbox for Interactive and Automatic Tuning in the R Environment","271329147":"Improved profile fitting and quantification of uncertainty in experimental measurements of impurity transport coefficients using Gaussian process regression","235679383":"SPOT: A Toolbox for Interactive and Automatic Tuning of SearchHeuristics andSimulation Models in the R Environment","51936452":"Latent Factor Models for Density Estimation","268452958":"Sequential design for achieving estimated accuracy of global sensitivities","276524376":"Importance analysis and meta-model construction with correlated variables in evaluation of thermal performance of campus buildings","262583041":"Bayesian Inference for Sensitivity Analysis of Computer Simulators, With an Application to Radiative Transfer Models","273404448":"Variable selection via a multi-stage strategy","222798571":"A Novel, Data--Driven Approach to Modeling Hydro--Climatic","46586550":"Gaussian Process Single-Index Models as Emulators for Computer Experiments","270162216":"Bayesian Non-parametric Mixture Estimation for Time-indexed Functional Data in R","257130209":"A demo-genetic individual-based model for Atlantic salmon populations: Model structure, parameterization and sensitivity","257908715":"Emulation of simulated earthquake catalogues","274965271":"Infectious disease and group size: More than just a numbers game","260518706":"Modelling the effect of two biocontrol agents on the invasive alien tree Acacia cyclops—Flowering, seed production and agent survival","263580352":"Mating Competition, Promiscuity, and Life History Traits as Predictors of Sexually Transmitted Disease Risk in Primates","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","45913547":"Optimization Under Unknown Constraints","227840611":"RNCEP: Global weather and climate data at your fingertips","276126146":"A Bayesian regression tree approach to identify the effect of nanoparticles’ properties on toxicity profiles","247152899":"A Bayesian Approach for Global Sensitivity Analysis of (Multifidelity) Computer Codes","268627966":"Constraint programming and decision making. Extended versions of selected papers based on the presentations at CoProd workshops, 2008–2013","51737577":"Transmission Selects for HIV-1 Strains of Intermediate Virulence: A Modelling Approach","275833870":"Global sensitivity analysis in hydrological modeling: Review of concepts, methods, theoretical framework, and applications"},"index":397}