{"abs":"One of the principal bottlenecks in applying learning techniques to classification problems is the large amount of labeled training data required. Especially for images and video, providing training data is very expensive in terms of human time and effort. In this paper we propose an active learning approach to tackle the problem. Instead of passively accepting random training examples, the active learning algorithm iteratively selects unlabeled examples for the user to label, so that human effort is focused on labeling the most ldquousefulrdquo examples. Our method relies on the idea of uncertainty sampling, in which the algorithm selects unlabeled examples that it finds hardest to classify. Specifically, we propose an uncertainty measure that generalizes margin-based uncertainty to the multi-class case and is easy to compute, so that active learning can handle a large number of classes and large data sizes efficiently. We demonstrate results for letter and digit recognition on datasets from the UCI repository, object recognition results on the Caltech-101 dataset, and scene categorization results on a dataset of 13 natural scene categories. The proposed method gives large reductions in the number of training examples required over random selection to achieve similar classification accuracy, with little computational overhead.","title":"Multi-class active learning for image classification","id":221363883,"url":"https://www.researchgate.net/publication/221363883_Multi-class_active_learning_for_image_classification","names":["Ajay J. Joshi","Fatih Porikli","Nikolaos Papanikolopoulos"],"references":{"2576903":"Selective Sampling Using the Query by Committee Algorithm","228075706":"Machine Learning","221364059":"A Bayesian Hierarchical Model for Learning Natural Scene Categories","220660299":"Torralba, A.: Modeling the Shape of the Scene: A Holistic Representation of the Spatial Envelope. Int. J. Comput. Vision 42, 145-175","4351023":"Two-Dimensional Active Learning for image classification","5608645":"A Comparison of Methods for Multiclass Support Vector Machines","2880986":"Probability Estimates for Multi-Class Classification by Pairwise Coupling","234827916":"Support Vector Machine Active Learning With Applications To Text Classification","4351185":"Entropy-based active learning for object recognition","6899679":"Confidence-based active learning","220270102":"Coarse sample complexity bounds for active learning","2619920":"Query Learning with Large Margin Classifiers","4301657":"Active Learning with Gaussian Processes for Object Categorization","2594015":"Probabilistic Outputs for Support Vector Machines and Comparisons to Regularized Likelihood Methods","221572686":"Support Vector Machine Active Learning for Image Retrieval","225555946":"A note on Platt’s probabilistic outputs for support vector machines","7211794":"One-shot learning of object categories","228715647":"LIBSVM: A library for support vector machines","221362286":"Semi-supervised SVM batch mode active learning for image retrieval"},"citedIn":{"261164945":"Multi-sensor image classification based on active learning","269268621":"Nitro: A Framework for Adaptive Code Variant Tuning","285434241":"Object Classification Using Substance Based Neural Network","220989093":"Active Cleaning for Video Corpus Annotation","282303705":"Integrating new classes on the fly in evolving fuzzy classifier designs and their application in visual inspection","263064736":"How many more images do we need? Performance Prediction of bootstrapping for Image Classification","267762917":"Dynamic Inclusion of New Event Types in Visual Inspection Using Evolving Classifiers","51920395":"Semantic-Gap-Oriented Active Learning for Multilabel Image Annotation","272411951":"Multi-Task Proximal Support Vector Machine","232905463":"Coverage Optimized Active Learning for k − N N Classifiers","256822489":"Inconsistency-based active learning for support vector machines","261168648":"RALF: A reinforced active learning formulation for object class recognition","220814258":"Active Online Classification via Information Maximization.","260247454":"Incremental learning using partial feedback for gesture-based human-swarm interaction","220527419":"Active Learning in Multimedia Annotation and Retrieval: A Survey","221362320":"Breaking the interactive bottleneck in multi-class classification with active selection and binary feedback","273656556":"Study of Active Learning-based Trademark Number Recognition Method","235666338":"Object Detection in Real Images","256822757":"Learning realistic facial expressions from web images","220722955":"An Interactive System for Electro-Acoustic Music Analysis.","265299687":"An Active Learning Approach with Uncertainty, Representativeness, and Diversity","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","220744735":"Active Learning with the Furthest Nearest Neighbor Criterion for Facial Age Estimation.","275224543":"Classifier fusion based on Bayes aggregation method for Indian sign language datasets","276035274":"Information-Theoretic Data Discarding for Dynamic Trees on Data Streams","282707299":"A Multicriterion Query-Based Batch Mode Active Learning Technique","281144572":"Introducing Geometry in Active Learning for Image Segmentation","254004253":"Utilizing assigned treatments as labels for supervised Machine Learning in Clinical Decision Support","221660022":"Dynamic trees for streaming and massive data contexts","220928104":"Scene-Adaptive Human Detection with Incremental Active Learning","279851501":"A fuzzy segmentation tool for remote sensing data","271918963":"An Interactive Approach to Solving Correspondence Problems","282331795":"Multi-Label Active Learning with Chi-Square Statistics for Image Classification","262328165":"Constrained Semi-Supervised Learning Using Attributes and Comparative Attributes","276298302":"Multi-Class Active Learning by Uncertainty Sampling with Diversity Maximization","235216725":"Object Detection in Real Images","221363680":"Large-Scale Live Active Learning: Training Object Detectors with Crawled Data and Crowds","262310257":"A Convex Optimization Framework for Active Learning","261416000":"Knowing when we don\u0027t know: Introspective classification for mission-critical decision making","235661781":"Active Learning for Semantic Segmentation with Expected Change","221070707":"Multi-class batch-mode active learning for image classification","262396669":"Active Learning for Interactive Segmentation with Expected Confidence Change","282177329":"Active Learning Algorithms for the Classification of Hyperspectral Sea Ice Images","276163989":"AL-ELM: One uncertainty-based active learning algorithm using extreme learning machine","224253624":"Holistic Context Models for Visual Recognition","290255658":"Active Learning for Cross Language Text Categorization","282823740":"Maximum classification optimization-based active learning for image classification","260480239":"Visually Guiding Visual Concept Discovery","262170828":"Incorporating Incremental and Active Learning for Scene Classification","284278557":"On improving performance of surface inspection systems by online active learning and flexible classifier updates","269300066":"Introspective semantic segmentation","230895538":"Scalable Active Learning for Multiclass Image Classification","49764998":"Active Learning for Solving the Incomplete Data Problem in Facial Age Classification by the Furthest Nearest-Neighbor Criterion","257927594":"Activity understanding and unusual event detection in surveillance videos","220527443":"Collection-Based Sparse Label Propagation and Its Application on Social Group Suggestion from Photos","224212643":"Harvesting Web Images for Realistic Facial Expression Recognition","221111506":"Actively Selecting Annotations Among Objects and Attributes"},"index":398}