{"abs":"Methods for the systematic application of Monte Carlo integration with importance sampling to Bayesian inference are developed. Conditions under which the numerical approximation converges almost surely to the true value with the number of Monte Carlo replications, and its numerical accuracy may be assessed reliably, are given. Importance sampling densities are derived from multivariate normal or student approximations to the posterior density. These densities are modified by automatic rescaling along each axis. The concept of relative numerical efficiency is introduced to evaluate the adequacy of a chosen importance sampling density. Applications in two illustrative models are presented. Copyright 1989 by The Econometric Society.","title":"Bayesian Inference in Econometric Models Using Monte Carlo Integration","id":4895745,"url":"https://www.researchgate.net/publication/4895745_Bayesian_Inference_in_Econometric_Models_Using_Monte_Carlo_Integration","names":["John Geweke","Econometrica"],"references":{"4895208":"Autoregressive Conditional Heteroskedasticity With Estimates of the Variance of U.K. Inflation","247975585":"The Representation of Social Processes by Markov Models","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","222718735":"Explicitly infinite-dimensional Bayesian analysis of production technologies","256557536":"Posterior moments computed by mixed integration","256282860":"Estimating malaria incidence and recovery rates from panel surveys","256557537":"Richard, J.F.: A 1-1 Poly-t random variable generator with application to Monte Carlo integration. J. Econometrics 29, 19-46","44318953":"Probability and Measure","243098317":"Bayesian Full Information Analysis of Simultaneous Equation Models Using Integration by Monte Carlo (Luc Bauwens)","256557498":"Bayesian Analysis of Dichotomous Quantal Response Models","4897883":"Bayesian Estimates of Equation System Parameters: An Application of Integration by Monte Carlo.","200705604":"Mathematical Methods Of Statistics","4782750":"Exact Inference for Continuous Time Markov Chain Models","5139348":"Exact Inference in the Inequality Constrained Normal Linear Regression Model","254758608":"An Algorithm for the Computation of Posterior Moments and Densities Using Simple Importance Sampling","247317410":"Chapter 12 Computational problems and methods"},"citedIn":{"5097550":"The Multivariate Split Normal Distribution and Asymmetric Principal Components Analysis","5183563":"A New Use of Importance Sampling to Reduce Computational Burden in Simulation Estimation","242482806":"Simulated annealing Gibbs samper","222475591":"Bayesian analysis of long memory and persistence using ARFIMA models","220554541":"Theoretical analysis and practical insights on importance sampling in Bayesian networks","24123768":"The marginal likelihood of Structural Time Series Models, with application to the euro area and US NAIRU","43797136":"The emergence of local elite networks: Structure or preference? - An econometric approach -","285966619":"Dimension-Adaptive Sparse Grid Quadrature for Integrals with Boundary Singularities","5097564":"Bayesian Inference of General Linear Restrictions on the Cointegration Space","228547980":"Likelihood based inference for diffusion-driven models","254424895":"Long Term Economic Development","228312449":"Numerically Accelerated Importance Sampling for Nonlinear Non-Gaussian State Space Models","222500190":"Modeling publication bias using weighted distributions in a Bayesian framework","268416991":"Bayesian Analysis in the Social Sciences via Markov chain Monte Carlo: a practical introduction","38357609":"Markov Chains for Exploring Posterior Distributions","228990341":"Importance Sampling based Estimation over AND/OR Search Spaces for Graphical Models","227653042":"A COMPARATIVE STUDY OF BAYESIAN AND MAXIMUM LIKELIHOOD APPROACHES FOR ARCH MODELS WITH EVIDENCE FROM BRAZILIAN FINANCIAL SERIES","241757771":"Testing Causality Between Two Vectors in Multivariate GARCH Models","5109867":"The Sources of Financial Crisis: Pre- and Post-Fed Evidence","235169325":"Approaches for Empirical Bayes Confidence Intervals","275071055":"Estimation of Parameters in Mean-Reverting Stochastic Systems","226553260":"Bayesian Statistical Computations of Nonlinear Financial Time Series Models: A Survey with Illustrations","2240524":"Sequential Bayesian Estimation And Model Selection Applied To Neural Networks","277706915":"Encyclopedia of Environmetrics","12019864":"A Bayesian Hierarchical Approach for Combining Case-Control and Prospective Studies","2940957":"Regularized Greedy Importance Sampling","23564630":"Bayesian Regression Analysis With Scale Mixtures of Normals","256548723":"IS^2 for Bayesian inference in latent variable models","221603081":"A Logic and Time Nets for Probabilistic Inference.","243773113":"Adaptive importance sampling in Monte Carlo integration","2599014":"Analysis of the Posterior for Spline Estimators in Logistic Regression","23564579":"Bayesian simultaneous equation analysis using reduced rank structures","238661247":"MIRROR-JUMP SAMPLING: A STRATEGY FOR MCMC ACCELERATION","268226490":"Hierarchical Probabilistic Inference of Cosmic Shear","235136585":"Subgraph Approximations for Large Directed Graphical Models","23742758":"Approaching the losses caused by imperfect short-term financing at the Russian farms","23755065":"Empirical Bayesian Density Forecasting in Iowa and Shrinkage for the Monte Carlo Era","4724763":"Intrinsic Bayesian Estimation of Vector Autoregression Impulse Responses","222299421":"On Monte Carlo Methods for Bayesian Inference","2619512":"Adaptive Mixture Importance Sampling","4872213":"Inference for Adaptive Time Series Models: Stochastic Volatility and Conditionally Gaussian State Space Form","2359364":"Nonlinear And Nonnormal Filter Using Importance Sampling: Antithetic Monte Carlo Integration","236871288":"Penalized importance sampling for parameter estimation in stochastic differential equations","11350213":"Payer Type and the Returns to Bypass Surgery: Evidence from Hospital Entry Behavior","282634420":"Joint blind equalization and detection in chaotic communication systems using simulation-based methods","257156926":"The Impact of Remittances on Investment and Poverty in Ghana","220554578":"Learning parameters of Bayesian networks from incomplete data via importance sampling","2467932":"Subregion-Adaptive Integration of Functions Having a Dominant Peak","239744563":"A Bootstrap Test for the dynamic performance of Macroeconomic Models-an outline and some experiments","237143647":"Ownership Forms Matter for Airport Efficiency: Results from Bayesian Estimation of Stochastic Cost Frontiers for Worldwide Airports","5003470":"Volatility Forecasting","33517941":"Essays in sequential Monte Carlo methods for economics and finance","2359471":"Nonlinear and Non-Gaussian State-Space Modeling with Monte Carlo Techniques: A Survey and Comparative Study","14823533":"Bayesian analysis of lamb survival using Monte Carlo numerical integration with importance sampling.","223802818":"Is ISO 14001 a Gateway to More Advanced Environmental Action? The Case for Green Supply Chain Management","45142567":"The effect of children on the level of labor market involvement of married women: what is the role of education?","237184699":"Bayesian fishery stock assessment and decision making using adaptive importance sampling","264040231":"Optimization of Decentralized Random Field Estimation Networks Under Communication Constraints through Monte Carlo Methods","14618690":"Prime Time for Bayes","4890839":"Hierarchical Markov Normal Mixture Models with Applications to Financial Asset Returns","228318524":"Disparity, Shortfall, and Twice-Endogenous HARA Utility","2586767":"Monte Carlo Based Ensemble Forecasting","220546446":"SampleSearch: Importance Sampling in presence of Determinism","267419485":"Efficient Likelihood Evaluation of Nonlinear RBC Models","222615029":"Markov Chain Monte Carlo Methods: Computation and Inference","12757104":"Bayesian analysis of prevalence with covariates using simulation-based techniques: Applications to HIV screening","247504499":"Momentum, Rational Agents and Efficient Markets","4790522":"Unemployment Persistence and the NAIRU: A Bayesian Approach","45136387":"Costs of housing crises: International evidence","280973324":"A Review of Modern Computational Algorithms for Bayesian Optimal Design","243103432":"Bayesian-Optimal Design via Interacting Particle Systems","23755228":"Classical and Bayesian Analysis of Univariate and Multivariate Stochastic Volatility Models","240111351":"MCMC Strategies for Computing Bayesian Predictive Densities for Censored Multivariate Data","24127945":"A New Class of Multivariate skew Densities, with Application to GARCH Models","5136626":"Identification of Peer Effects Using Group Size Variation","254298005":"A Bayesian panel data framework for examining the economic growth convergence hypothesis: Do the G7 countries converge?","29833477":"Extension of price-trend models with applications in finance","251858880":"Monte Carlo Integration using Importance Sampling and Gibbs Sampling","256188301":"Incorporating Spatial Dependence into Bayesian Multiple Testing of Statistical Parametric Maps in Functional Neuroimaging.","273322112":"Fully Bayesian Experimental Design for Pharmacokinetic Studies","45130367":"Markov Chain Monte Carlo Technology","220061138":"Adaptive Dynamic Clustered Particle Filtering for Mobile Robots Global Localization","260702041":"A potential implicit particle method for high-dimensional systems","241159822":"Decentralized random-field estimation under communication constraints","228363588":"A Bayesian approach to restrictions on the cointegration space","251237925":"Conflict Management and Outcomes in Franchise Relationships: The Role of Regulation","265264913":"A Bayesian Framework and Importance Sampling Methods for Synthesizing Multiple Sources of Evidence and Uncertainty Linked by a Complex Mechanistic Model","238685924":"Message from Monte Carlo: A Framework for Minimum Message Length Inference using Markov Chain Monte Carlo Methods","269996279":"Adaptive Sampling Algorithms for Probabilistic Risk Assessment of Nuclear Simulations","229608781":"Estimating Linear Production Coefficients from Farm Business Survey Data: A Note","241360516":"Using Bayesian methods and decision analysis as a rational basis to dealing with conflicting stock assessment results while providing management advice on stock rebuilding","251760617":"Model weights for model choice and averaging","4821154":"How Structural Are Structural Parameters?","235153135":"Inference for Identity Management","2402506":"Modeling Regression Error with a Mixture of Polya Trees","4772026":"Following a moving target-Monte Carlo inference for dynamic Bayesian models","241763994":"Mortality in the British Panel Household Survey: a Test of a Standard Treatment for NonResponse","5144762":"Research Opportunities in Computational Economics.","264779580":"An Overview of Stochastic Approximation Monte Carlo","4792499":"Time Series Models with a Common Stochastic Variance for Analysing Economic Time Series","221621711":"Monte Carlo Methods for Absolute Beginners.","237577941":"MIDIENDO LA VOLATILIDAD DEL MERCADO DE OPCIONES CON EL VIX","2615512":"Impulse Response Functions in Generalized Bayesian Autoregressive Models","265629396":"Aspects of non-linearities in Kalman filtering with application to a simplistic model of the atmosphere","4788554":"On Importance Sampling for State Space Models","4297032":"Mobile robots global localization using adaptive dynamic clustered particle filters","263526076":"A New Approach to Importance Sampling in Taylor’s Stochastic Volatility Model","2431279":"Sequential Bayesian Estimation And Model Selection For Dynamic Kernel Machines","2986273":"Data Fusion for Visual Tracking With Particles","2298158":"Importance Sampling in Bayesian Networks Using Probability Trees","5110083":"Sensitivity Analysis and Model Evaluation in Simulated Dynamic General Equilibrium Economies","3316029":"Model order selection of damped sinusoids in noise by predictive densities","276945301":"Bayesian stock assessment: A review and example application using the logistic model","2361648":"Transferring Prior Information Between Models Using Imaginary Data","242341732":"The panel probit model: Adaptive integration on sparse grids","45257636":"Arch models","11495864":"Estimating genotypes with dependently sampled descent graphs","280590755":"Moment conditions and Bayesian nonparametrics","239060769":"Importance-Weighted Marginal Bayesian Posterior Density Estimation","4854122":"Bayesian bootstrap multivariate regression","260636329":"Particle Filtering of Stochastic Volatility Modeled With Leverage","228316345":"Efficient High-Dimensional Importance Sampling in Mixture Frameworks","269187368":"Predictive distributions for between-study heterogeneity and simple methods for their application in Bayesian meta-analysis","263747228":"Prior Density Ratio Class in Econometrics","227009696":"Adaptive Importance Sampling in General Mixture Classes","232752376":"Forecasting Using Relative Entropy http://www.jstor.org/stable/3839160","223181925":"Estimation of dynamic and ARCH Tobit models","2738434":"Nonparametric Bayesian Analysis for Assessing Homogeneity in k × I Contingency Tables with Fixed Right Margin Totals","228963467":"A General Computational Method for Estimating Bayes Factors","222325873":"Seminonparametric Bayesian estimation of the asymptotically ideal production model","5144956":"Econometrics for Policy Analysis: Progress and Regress","2750746":"Regeneration in Markov Chain Samplers","229760130":"Gibbs Sampling","2306327":"Annealed Importance Sampling","227359925":"A Bayesian analysis of log-periodic precursors to financial crashes","12673528":"Bayesian accelerated failure time analysis with application to veterinary epidemiology","228342949":"Social Learning in Health Care: Evidence from Tanzania","227187888":"A Bayesian predictive approach to determining the number of components in a mixture distribution","24125515":"New Proposals for the Quantification of Qualitative Survey Data","5144944":"SISAM and MIXIN: Two Algorithms for the Computation of Posterior Moments and Densities Using Monte Carlo Integration.","15413675":"Hughes P, Dragunow M. Induction of immediate early genes and the control of neurotransmitter-regulated gene expression within the nervous system. Pharmacol Rev 47: 133-178","37675886":"Bayesian Analysis and Computational Methods for Dynamic Modeling","265182878":"Simulation-Based Radar Detection Methods","2541943":"Efficient Nonparametric Importance Sampling for Bayesian Learning","241278770":"Low-Rank Separated Representation Surrogates of High-Dimensional Stochastic Functions: Application in Bayesian Inference","222432279":"On the shape of posterior densities and credible sets in instrumental variable regression models with reduced rank: An application of flexible sampling methods using neural networks","23978043":"\"The Simulated Likelihood Ratio (SLR) Method\"","5132569":"Bayesian Econometrics","220636273":"The cost-effectiveness of surgical instrument management policies to reduce the risk of vCJD transmission to humans","46443423":"Taylor rules and the Canadian-US equilibrium exchange rate","251588515":"Some Recent Developments in Microeconometrics","227359980":"Stockholding: Participation, Location, Spillovers","4872492":"A Non-Gaussian Panel Time Series Model for Estimating and Decomposing Default Risk","233024650":"Bayesian regression analysis of data with censored initiating and terminating times: Applications to AIDS","228287728":"Nonlinear Panel Data Analysis","257549864":"Calibration of computationally demanding and structurally uncertain models with an application to a lake water quality model","227544291":"An efficient computational approach for prior sensitivity analysis and cross‐validation","258082324":"PPF - A Parallel Particle Filtering Library","222491701":"Modelling and Forecasting Exchange Rates Using a Bayesian Time-Varying Coefficient Model","279394783":"An Introduction to Monte Carlo Methods for Bayesian Data Analysis","4772147":"Reversible jump, birth-and-death and more general continuous Markov chain Monte Carlo samplers","235726711":"Laplace\u0027s Method Approximations for Probabilistic Inference in Belief\nNetworks with Continuous Variables","2615642":"Bayesian Forecasting (the Levels) of Vector Autoregressive Log-transformed Time Series","23519256":"Producer Behaviour Under Strict Rationing and Quai-Fixed Factors","48264033":"Investing at Home and Abroad: Different Costs, Different People?","4755916":"Bayesian vector autoregressions with stochastic volatility","224718050":"Sampling Densities of Particle Filter: A Survey and Comparison","24129784":"Investing at Home and Abroad: Different Costs, Different People?","266458737":"The Key Metric forEvaluation Localizationin Wireless Sensor Networks via Distance/Angle Estimation Algorithm (D/A-EA)","250754914":"19 Simulation estimation methods for limited dependent variable models","247529302":"Simulation Based Methods for Target Tracking","5165529":"Échantillonnage de Gibbs et autres applications économétriques des chaînes markoviennes","2660784":"Pediatric Pain, Predictive Inference and Sensitivity Analysis","2523578":"Partitioned Sampling, Articulated Objects, and Interface-Quality Hand Tracking","235726737":"Backward Simulation in Bayesian Networks","228733954":"Bayesian Modeling in the Social Sciences: an introduction to Markov-Chain Monte Carlo","2425223":"Priors, Posterior Odds and Lagrange Multiplier Statistics in Bayesian Analyses of Cointegration","4747759":"Bayesian Analysis of Stochastic Volatility Models: Comment.","4725216":"Bayesian and Non-Bayesian Approaches to Scientific Modeling and Inference in Economics and Econometrics","224926912":"Implicit Particle Methods and Their Connection with Variational Data Assimilation","24015043":"Bayesian Option Pricing Using Mixed Normal Heteroskedasticity Models","226403539":"Dirac Mixture Approximation for Nonlinear Stochastic Filtering","271759772":"Air Pollution and Mortality","222686454":"Bayesian point estimation of the cointegration space","262168083":"Stochastic volatility modeling with computational intelligence particle filters","50393782":"Prediction of Individual Long-term Outcomes in Smoking Cessation Trials Using Frailty Models","263091734":"Approximations of the Optimal Importance Density using Gaussian Particle Flow Importance Sampling","2601375":"Estimating Ratios of Normalizing Constants for Densities with Different Dimensions","222676220":"Alternative sampling methods for estimating multivariate normal probabilities","24053972":"A computational method for ranking L products of parameters","255659650":"Bayesian computation: a brief review","4745609":"Conditional Second-Order Generalized Estimating Equations for Generalized Linear and Nonlinear Mixed-Effects Models","221379827":"Blind equalization by sequential importance sampling.","46457600":"Innovative Capability and Financing Constraints for Innovation: More Money, More Innovation?","2515425":"Importance Sampling in the","4852098":"On the Shape of the Likelihood/Posterior in Cointegration Models","5136774":"Econometrics: A Bird’s Eye View","235993048":"Insights into the content and spatial distribution of dust from the integrated spectral properties of galaxies","258082475":"Approximate Sequential Importance Sampling for Fast Particle Filtering","23636129":"Consistent estimation of the accuracy of importance sampling using regenerative simulation","228564053":"Estimation of a Time-Varying GQARCH (1, 1)-M model","278016350":"Differential Evolution Markov Chain Filter for Global Localization","1913298":"Adaptive methods for sequential importance sampling with application to state space models","4747672":"The Statistical Properties of the Equity Estimator","2335219":"Efficient Simulation from the Multivariate Normal and Student-t Distributions Subject to Linear Constraints and the Evaluation of Constraint Probabilities","51931849":"Semiparametric inference in mixture models with predictive recursionmarginal likelihood","240727950":"Relevance of Functional Flexibility for Heterogeneous Sales Response Models","228275276":"Fast Efficient Importance Sampling by State Space Methods","222336152":"Joint estimation of sequential labour force and fertility decisions using Markov Chain Monte Carlo techniques","260529759":"An iterative version of the adaptive Gaussian mixture filter","222655644":"Prior, Posteriors and Bayes Factors for a Bayesian Analysis of Cointegration","4329888":"Epileptic Seizures Predicted by Modified Particle Filters","46269223":"Efficient Simulations in Finance","228275312":"A Class of Adaptive EM-Based Importance Sampling Algorithms for Efficient and Robust Posterior and Predictive Simulation","256605861":"Implicit Sampling for Path Integral Control, Monte Carlo Localization, and SLAM","238866383":"Selection of importance weights for Monte Carlo estimation of normalizing constants","241158060":"Gaussian Particle Filtering Based on Coarse and Fine-scale Sampling on Target Tracking Algorithm","221529283":"Better confidence intervals for importance sampling.","260140668":"Estimating and testing non-affine option pricing models with a large unbalanced panel of options","257199444":"Bayesian testing of restrictions on vector autoregressive models","24118132":"FORECASTING WITH BAYESIAN VECTOR AUTOREGRESSIONS.","46440640":"A Dynamic Model of Oligopoly in the Coffee Export Market","254287149":"Generalized Linear Models With Random Effects; A Gibbs Sampling Approach","2951716":"State Estimation of Probabilistic Hybrid Systems with Particle Filters","24136569":"Importance Sampling for Sums of Lognormal Distributions, with Applications to Operational Risk","29735887":"Bayesian statistics for fishery stock assessment and management","247317686":"Chapter 15 Monte carlo simulation and numerical integration","228280215":"Adaptively Scaling the Metropolis Algorithm Using Expected Squared Jumped Distance","4854340":"Alternative sampling methods for estimating multivariate normal probabilities","11066023":"Bayesian Model Assessment and Comparison Using Cross-Validation Predictive Densities","224872310":"How to view an MCMC simulation as a permutation, with applications to\nparallel simulation and improved importance sampling","228200331":"Macro, Frailty, and Contagion Effects in Defaults: Lessons from the 2008 Credit Crisis","221128508":"Head pose localization based on multicue fusion.","225193855":"Structural Changes in Volatility of Foreign Exchange Rates after theAsian Financial Crisis","221617952":"Greedy Importance Sampling.","227639176":"Accounting for Spatial Heterogeneity and Autocorrelation in Spatial Discrete Choice Models: Implications for Behavioral Predictions","4899414":"A Bayesian approach to paired comparison rankings based on a graphical model","256021852":"Bandwidth Selection In Pre-Smoothed Particle Filters","254405900":"A Survey of Sequential Monte Carlo Methods for Economics and Finance","4919930":"Improved Sampling-Importance Resampling and Reduced Bias Importance Sampling","2646557":"A MCMC Algorithm to fit a general exchangeable model","251487432":"Pinpoint Palpable Mass in Breast","4848243":"Monte Carlo evaluation of multivariate Student\u0027s t probabilities","248018163":"Tests for a trend in proportion based on mixtures of beta distributions incorporating historical controls","251487425":"Early-Onset Group B Strep Down 31% in 2004","222701435":"Financial econometrics: Past developments and future challenges","281223811":"Sobol’s Sequence Based Method for Fitting Nonlinear Mixed Effects Model: A Comparative View","228433885":"Applying Bayesian Inference for Signal Extraction Model of Time Series","2359909":"Policy Improvement for POMDPs Using Normalized Importance Sampling","247217406":"Power Analysis for Clinical Trials and Other Clustered Study Design","50368836":"Short-term borrowing for long-term projects: Are family businesses more susceptible to \u0027irrational\u0027 financing choices?","221562749":"A Probabilistic Approach for Dynamic State Estimation Using Visual Information.","228732907":"Expected posterior priors in factor analysis","46450831":"A new approach to estimating equilibrium exchange rates for small open economies: The case of Canada","2638457":"Sampling Methods for Action Selection in Influence Diagrams","23991101":"Is the market price of risk infinite?","274139648":"Utility-weighted sampling in decisions from experience","222820126":"A Variance Screen for Collusion","4790804":"Forecasting Dynamic Market Share Relationships","237345862":"Bayesian Identification of Optimal Portfolio Weights","4909628":"Air Pollution and Mortality: Estimating Regional and National Dose-Response Relationships","221304650":"Partitioned Sampling, Articulated Objects, and Interface-Quality Hand Tracking.","251833720":"Particle Detection and it\u0027s Radar Application","223756077":"A generalized bivariate mixture model for stock price volatility and trading volume. J Econ","234108809":"Variational MCMC","6273570":"The SAEM algorithm for group comparison tests in longitudinal data analysis based on non-linear mixed-effects model","4772556":"Optimal sampling times in population pharmacokinetic studies","2792111":"Sequential Monte Carlo Methods For Optimisation Of Neural Network Models","24015849":"A Markov-chain sampling algorithm for GARCH models","4793026":"Possibly Ill-behaved Posteriors in Econometric Models","2757286":"Assessment and Propagation of Model Uncertainty (Disc: P71-97)","279968318":"Very Good Importance Sampling","252007836":"A Novel Particle Filter for Nonlinear Non-Gaussian Estimation","11543084":"Individual differences in paired comparison data","266749304":"Bayesian inference and model comparison for random choice structures","6994634":"Computationally-intensive econometrics using a distributed matrix-programming language","268356959":"A Dynamic Logistic Model for Combining Classifier Outputs","24128466":"Functional Approximations to Likelihoods/Posterior Densities: A Neural Network Approach to Efficient Sampling","252661164":"Simulation Based Inference in Econometrics: Motivation and Methods","225204169":"Bayesian Object Localisation in Images","240268536":"Bayesian Inference and Posterior Simulators","263789845":"Multivariate tobit system estimation of education expenditure in Urban China","2792071":"Importance Sampling and Riemann Sums","51943849":"Asymptotically Independent Markov Sampling: a new MCMC scheme for\nBayesian Inference","227276601":"An Introduction to MCMC for Machine Learning","228929303":"Gaussian processes for Bayesian analysis User guide for Matlab toolbox GPstuff Version 3.1","237814936":"Enhancing the performance of a posterior predictive check","223694829":"Bayesian estimation via sequential Monte Carlo sampling—Constrained dynamic systems","222836721":"Adaptive radial-based direction sampling: Some flexible and robust Monte Carlo integration methods","263613815":"Bayes factors","242021551":"Bayesian econometrics: Past, present and future","222693251":"Importance sampling in Bayesian networks using probability trees","245433448":"Robust Spacecraft Angular-Rate Estimation from Vector Observations Using Fast Interlaced Particle Filtering","245433451":"Attitude Estimation from Vector Observations Using a Genetic-Algorithm-Embedded Quaternion Particle Filter","222400397":"Testing the assumptions behind importance sampling","269730526":"A penalized simulated maximum likelihood approach in parameter estimation for stochastic differential equations","4792967":"Estimating Systematic Continuous-time Trends in Recidivism using a Non-Gaussian Panel Data Model","4909722":"Simulation-Based Method of Moments and Efficiency","8368814":"Power analyses for longitudinal trials and other clustered designs. Stat Med","46434325":"Simulation based bayesian econometric inference: principles and some recent computational advances","251472943":"A tutorial on Bayes factor estimation with the product space method","51993036":"Estimation Fully Observed Recursive Mixed-Process Models with CMP","257199490":"A Bayesian approach to computing posterior distribution and quantile functions","227358548":"Fitting Fully Observed Recursive Mixed-Process Models with CMP","4721299":"Prediction intervals for ARIMA models","231585553":"A Priori Risk and Optimal Test Accuracy in Prenatal Diagnostics","228183933":"Asymmetric Risk Loadings in the Cross Section of Stock Returns","243049627":"Gibbs sampling for marginal posterior expectations","46434349":"On Bayesian Structural Inference in a Simultaneous Equation Model","268326158":"Monte Carlo Optimization Approach for Decentralized Estimation Networks Under Communication Constraints","3807947":"Sequential MCMC for Bayesian model selection","238283975":"Nonlinear Income Effects in Random Utility Models","239606962":"Bayesian computation: MC integration rejection methods sampling importance resampling","21412795":"An empirical analysis of likelihood-weighting simulation on a large, multiply connected medical belief network","4756297":"Model-Based Clustering of Multiple Time Series","223596113":"Chapter 56. Computationally Intensive Methods for Integration in Econometrics*","3959614":"Tracking and fusion for wireless sensor networks","220659232":"Pooling and Dynamic Forgetting Effects in Multitheme Advertising: Tracking the Advertising Sales Relationship with Particle Filters","228312733":"Massively Parallel Sequential Monte Carlo for Bayesian Inference","5143366":"Bayesian Estimation of ARMA-GARCH Model of Weekly Foreign Exchange Rates","279354285":"Lecture Notes in Statistics","257674320":"Measuring the uncertainty of RFID data based on particle filter and particle swarm optimization","255661105":"Combining simulation and mean-field like methods for inference in Hidden Markov Random Fields","5196638":"Risk, Mispricing, and Asset Allocation: Conditioning on Dividend Yield","266173646":"Estimation of Nonlinear Dynamic Systems Theory and Applications","289075758":"Simulation Techniques","251469288":"Efficient Filtering in State-Space Representations","243781010":"Monte Carlo Approximations in Bayesian Decision Theory","257211469":"Overnight information and stochastic volatility: A study of European and US stock exchanges","228431495":"Factors Influencing Selection of Information Sources by Cotton Producers Considering Adoption of Precision Agriculture Technologies","46494169":"Bayesian analysis of two dependent 22 contingency tables","5063505":"Nonstationarity in Garch Models: A Bayesian Analysis.","252228631":"To Bridge, to Warp or to Wrap?","253330489":"On the existence of moments for high dimensional importance sampling","265217252":"Subject-Specific and Population-Averaged Continuation Ratio Logit Models for Multiple Discrete Time Survival Profiles","251211218":"On a Directionally Adjusted Metropolis-Hastings Algorithm","30847738":"Discrete and Continuous Representations of Unobserved Heterogeneity in Choice Modeling","24095325":"Rapid Economic Growth with Increasing Returns to Scale and Little or No Productivity Growth","44677531":"Approximate inference for disease mapping with sparse Gaussian processes","14296047":"Bayesian inference on prevalence using a missing-data approach with simulation-based techniques: Applications to HIV screening","281814009":"Kullback-Leibler Divergence-Based Differential Evolution Markov Chain Filter for Global Localization of Mobile Robots","226022990":"Modeling Variability Order: A Semiparametric Bayesian Approach","229392026":"Particle filters for continuous likelihood evaluation and maximisation","4750207":"Finding Near-Optimal Bayesian Experimental Designs via Genetic Algorithms","220286488":"Bayesian marginal inference via Candidate\u0027s formula","228681368":"Bayesian Inference in Public Administration Research: Substantive Differences from Somewhat Different Assumptions","223346289":"Efficient and accurate approximate Bayesian inference with an application to insurance data","229924490":"Estimation of Quantities of Drugs Handled and the Burden of Proof","263249039":"Numerical Tools for the Bayesian Analysis of Stochastic Frontier Models","29995657":"Measuring inflation persistence: a structural time series approach. NBB Working Paper Nr.70, June 2005","265727121":"Bayesian factors","4789006":"Bayesian Semiparametric Regression for Median Residual Life","4915980":"Induction: From Kolmogorov and Solomonoff to De Finetti and Back to Kolmogorov","24017449":"Interview effects in the reporting of domestic violence","228312786":"To Bridge, to Warp or to Wrap? A Comperative Study of Monte Carlo Methods for Efficient Evaluation of Marginal Likelihood","228167368":"Estimating Sequential-Move Games by a Recursive Conditioning Simulator","45881831":"Particle filtering within adaptive Metropolis Hastings sampling","246431185":"Importance Link Function Estimation for Markov Chain Monte Carlo Methods","46447008":"Bayesian inference of a smooth transition dynamic almost ideal model of food demand in the US","238083413":"Volatility versus Correlation Risk in Dynamic Asset Allocation: A Bayesian Perspective","45922769":"Auxiliary Particle filtering within adaptive Metropolis-Hastings Sampling","4148049":"Precoding in wireless communications systems using particle filtering for blind channel prediction","2724678":"Metropolis Based Posterior Integration Schemes","4746041":"Dynamically Weighted Importance Sampling in Monte Carlo Computation","4729658":"State Trading Enterprises in a Differentiated Product Environment: The Case of Global Malting Barley Markets","23755292":"An Efficient Filtering Approach to Likelihood Approximation for State-Space Representations","222678589":"Diversification benefits of emerging markets subject to portfolio","243768830":"Computing Bayes Factors by Combining Simulation and Asymptotic Approximations","4743989":"Bayesian Semiparametric Median Regression Modeling","24052241":"Multiperiod Bayesian forecasts forAR models","23991020":"Learning Bayesian networks for discrete data","225171177":"Statistical Inference in Mapping and Localization for Mobile Robots","5063627":"Prior, Posterios and Bayes Factors for Bayesian Analysis of Cointegration.","291973856":"Particle Efficient Importance Sampling","248413507":"Weighted Average Importance Sampling and Defensive Mixture Distributions","231130699":"Adaptive anchored inversion for Gaussian random fields using nonlinear data","267723898":"Statistic-Based Bayesian Inference in Latent Variable Models","264928347":"Sequential Monte Carlo Methods for Nonlinear Discrete-Time Filtering","262491191":"Efficient importance sampling in mixture frameworks","4758480":"“Univariate and Multivariate Stochastic Volatility Models: Estimation and Diagnostics”","5110741":"Corporate Bankruptcy Reorganizations: Estimates from a Bargaining Model","4912080":"Recent Progress in Applied Bayesian Econometrics","241759732":"Does Labour Market Achievement Matter for the Wellbeing of Australian Immigrants? Culture and Gender Differences","222551774":"Bayesian Fan Charts for U.K. Inflation: Forecasting and Sources of Uncertainty in an Evolving Monetary System","2616250":"Bayesian Estimation by Sequential Monte Carlo Sampling for Nonlinear Dynamic Systems","3318701":"Gaussian Particle Filtering","265366643":"Bayesian Prediction of Transformed Gaussian Random Fields","46434662":"Efficient Bayesian Estimation and Combination of GARCH-Type Models","239060380":"Statistics Applications of Subregion Adaptive Multiple Numerical Integration","230981218":"Resource vs. Ratio-Dependent Consumer-Resource Models: A Bayesian Perspective","221677210":"A Fully Bayesian Approach to Assessment of Model Adequacy in Inverse\nProblems","5057504":"Adaptive Mixture of Student-t Distributions as a Flexible Candidate Distribution for Efficient Simulation: The R Package AdMit","42539303":"A dynamic term structure model of Central Bank policy","46434667":"Macro, Industry and Frailty Effects in Defaults: The 2008 Credit Crisis in Perspective","241751512":"Reasons for Adopting Precision Farming: A Case Study of U.S. Cotton Farmers","222412529":"Efficient High-Dimensional Monte-Carlo Importance Sampling","257940719":"Monte Carlo Methods in Bayesian Statistics","2493335":"Simulation-Based Methods for Optimal Sampling Times in Population PK/PD Studies","224251625":"Monte Carlo Optimization of Decentralized Estimation Networks Over Directed Acyclic Graphs Under Communication Constraints","258622687":"Computing highly accurate confidence limits from discrete data using importance sampling","222840560":"“Bayesian Analysis of Stochastic Volatility Models with Fat-Tails and Correlated Errors”","283890514":"Steady streams and sudden bursts: persistence patterns in remittance decisions","46494072":"Bayesian Causal Effects in Quantiles: Accounting for Heteroskedasticity","236901854":"Understanding the Metropolis-Hastings Algorithm","251495742":"O - 20 Un cas de neuro-Sjögren : une ganglionopathie","5163911":"The introduction of a basic income: a fruitful chance or an insidious trap for the italian labour market? An econometric analysis of the italian case.","2800609":"The Stochastic Volatility in Mean model: Empirical evidence from international stock markets","267949109":"Sequential Data Assimilation in High Dimensional Nonlinear Systems","267951157":"Essays on Human Capital, Wage Dispersion and Worker Mobility","237309419":"ABSTRACT Econometrics: A Bird\u0027s Eye View","1919954":"Demystifying Double Robustness: A Comparison of Alternative Strategies for Estimating a Population Mean from Incomplete Data","227513951":"Approaches to Evaluate Water Quality Model Parameter Uncertainty for Adaptive TMDL Implementation","2468854":"Optimal Design via Curve Fitting of Monte Carlo Experiments","4791197":"Discussion of \u0027MCMC-based inference\u0027 by R. Paap","24095414":"On the Estimation of Demand Systems Through Consumption Efficiency","263679086":"Two-Stage Importance Sampling With Mixture Proposals","222619294":"Constrained forecasting in autoregressive time series models: A Bayesian analysis","261999686":"The high availability of extreme events serves resource-rational decision-making","26532468":"Sequential Parameter Estimation of Time-Varying Non-Gaussian Autoregressive Processes","46434599":"A Comparative Study of Monte Carlo Methods for Efficient Evaluation of Marginal Likelihoods","4783020":"On Bayesian inference under sampling from scale mixtures of normals","46539043":"The economic gains of trading stocks around holidays","220286663":"A regularized bridge sampler for sparsely sampled diffusions","23564928":"Bayes Reference Analysis of Cointegration","221404890":"Approximate Inference Algorithms for Hybrid Bayesian Networks with Discrete Constraints.","46444844":"DSGE Model Evaluation in a Bayesian Framework: an Assessment","282401596":"Uncertainty Quantification of State Estimation in Nonlinear Structural Systems with Application to Seismic Response in Buildings","259863697":"U.S. Agricultural Producer Perceptions of Climate Change","228759119":"On the relationship between the conditional mean and volatility of stock returns: A latent VAR approach* 1","227417696":"Special issue: Bayesian forecasting in economics","243103118":"Accounting for Model Uncertainty in Seemingly Unrelated Regressions","277742459":"Essays on the Bayesian Inequality Restricted Estimation","243103112":"Efficient Laplacian and Adaptive Gaussian Quadrature Algorithms for Multilevel Generalized Linear Mixed Models","229910081":"A Bayesian semiparametric model for organism based reconstruction","227806819":"Bayesian threshold autoregressive models for nonlinear time series","226055822":"Exact Inference Using Variable Integrating Constant Importance Distributions","2358311":"Priors for Macroeconomic Time Series and Their Application","227998110":"Using EM and Data Augmentation for the Competing Risks Model","2294827":"Monte Carlo Posterior Integration in GARCH Models","242997874":"Bayesian inference for circular distributions with unknown normalising constants","220926241":"Localization for mobile sensor networks","224188752":"Multi-agent based particle filter for moving object tracking","260995968":"Generalized dynamic panel data models with random effects for cross-section and time","220354866":"Nonstandard Central Limit Theorems for Markov Chains.","237535801":"Alternative samplingmethods for estimating multivariate normal probabilities","2499637":"Lectures On Simulation-Assisted Statistical Inference","222501207":"Block Recursion and Structural Vector Autoregressions","234140128":"Adaptive Importance Sampling for Estimation in Structured Domains","261165960":"Generation path-switching in sequential Monte-Carlo methods","234140136":"Monte Carlo Inference via Greedy Importance Sampling","258882417":"Nonlinear Time Series: Theory, Methods and Applications with R Examples","2845707":"Forecasting Using Relative Entropy","5139567":"Conducting Inference in Semiparametric Duration Models under Inequality Restrictions on the Shape of the Hazard Implied by Job Search Theory.","239065629":"Integration of Multimodal Functions by Monte Carlo Importance Sampling","228671874":"Effi cient Likelihood Analysis and Filtering for State $ Space Representations","260428712":"Bayesian variable selection for latent class analysis using a collapsed Gibbs sampler","235172395":"Simulation Approaches for Calculations in Directed Graphical Models","2690075":"A Bayesian Weibull Survival Model","267017177":"Bayesian inference for hidden truncation Pareto (II) models","4859006":"Bayesian Analysis of Long Memory and Persistence using ARFIMA Models","220543250":"Policy Recognition in the Abstract Hidden Markov Model.","23721297":"On Measuring The Welfare Cost of Business Cycles","5051509":"Assessing the impact of short-sale constraints on the gains from international diversification","223195508":"‘Bayesian Multivariate Exogeneity Analysis: An Application to a UK Money Demand Equation’","2468895":"Robust Bayesian Displays for Standard Inferences Concerning a Normal Mean","241830481":"Numerical approximations in weighted estimating equations for regression models with missing continuous covariates","228549026":"Bayesian stock assessment: a review and example application using the logistic model. ICES J","45432566":"Importance Sampling-Based Monte Carlo Methods with Applications to Quantitative Finance","238887541":"Mixture Models, Monte Carlo, Bayesian Updating and Dynamic Models","2690144":"The VAR-VARCH model: A Bayesian approach","24079652":"Generalized Safety First and a New Twist on Portfolio Performance","2354286":"Bayesian Comparison of Econometric Models","259511075":"Nowcasting and forecasting global financial sector stress and credit market dislocation","222439703":"Bayesian inference in asset pricing tests","23942453":"Simulated Maximum Likelihood for Double-Bounded Referendum Models","4742161":"Generalized Poststratification and Importance Sampling for Subsampled Markov Chain Monte Carlo Estimation","288179574":"On the (non-)convergence of particle filters with Gaussian importance distributions**This work was supported by the Academy of Finland projects 266940 and 273475.","242072077":"Is ISO 14001 a Gateway to More Advanced Voluntary","247317215":"Chapter 49 Arch models","262489024":"The Two-Piece Normal, Binormal, or Double Gaussian Distribution: Its Origin and Rediscoveries","228993473":"The HESSIAN method: Highly efficient simulation smoothing, in a nutshell","26512868":"Sequential Monte Carlo Methods for Joint Detection and Tracking of Multiaspect Targets in Infrared Radar Images","24079646":"Information Theoretic and Entropy Methods: An Overview","4744251":"Bayesian and Conditional Frequentist Testing of a Parametric Model Versus Nonparametric Alternatives","242967055":"Monte Carlo integration: An application to labour market states and transitions","46433968":"Neural network based approximations to posterior densities: a class of flexible sampling methods with applications to reduced rank models","247788208":"Bayesian Prediction, Entropy, and Option Pricingx","2442323":"Monte Carlo Estimation of Bayesian Credible and HPD Intervals","228528616":"Inference in Two-Piece Location-Scale Models with Jeffreys Priors","236157547":"Laplace\u0027s method approximations for probabilistic inference in belief networks with continuous variables","24096023":"A Nonlinear Forecasting Model of GDP Growth","251626116":"9138 POSTER Frequency of EGFR Mutations in Greek Non-Small-Cell Lung Cancer (NSCLC) Patients","228383201":"Bayesian computational methods in biomedical research","224241954":"Set-Membership Constrained Particle Filter: Distributed Adaptation for Sensor Networks","228272411":"Measuring Asymmetric Stochastic Cycle Components","239037117":"Computing Bayes Factors Using a Generalization of the Savage-Dickey Density Ratio","267791221":"Grid Based Bayesian Inference for Stochastic Differential Equation Models","4895950":"A Method for Smoothing Simulated Moments of Discrete Probabilities in Multinomial Probit Models","5049546":"Measuring the Pricing Error of the Arbitrage Pricing Theory","4859074":"Measuring information loss due to inconsistencies in duration data from longitudinal surveys","4816065":"Likelihood-Based Estimation of Latent Generalized ARCH Structures","24098279":"Learning in Health Care: Evidence of Learning about Clinician Quality in Tanzania","222532044":"Relevance of functional flexibility for heterogeneous sales response models: A comparison of parametric and semi-nonparametric models","228811058":"Changepoint Analysis of Binary and Ordinal Probit Models: An Application to Bank Rate Policy Under the Interwar Gold Standard","222411222":"Employment Dynamics in the Romanian Labor Market: A Markov Chain Monte Carlo Approach","277287967":"An Efficient Approach to Analyzing State-Space Representations","4209881":"Monte Carlo localization in dense multipath environments using UWB ranging","267256692":"The Economic Impact of the Yucca Mountain Nuclear Waste Repository on the Economy of Nevada Prepared by","263508782":"Bayesian Exploratory Factor Analysis","46534232":"Factors Affecting Farmersâ€™ Utilization of Agricultural Risk Management Tools: The Case of Crop Insurance, Forward Contracting, and Spreading Sales","23737802":"Quantile regression","4865259":"Bayesian Analysis of ARMA models using Noninformative Priors","261481266":"Chaotic synchronization mechanism based on Gaussian Particle Filtering","4240619":"Adaptive precoding in MIMO wireless communication systems using blind channel prediction over frequency selective fading channels","5141756":"A non-Gaussian generalisation of the Airline model for robust Seasonal Adjustment.","261563181":"Approximating Cross-validatory Predictive Evaluation in Bayesian Latent Variables Models with Integrated IS and WAIC","263242506":"A Unified Method for Dynamic and Cross‐Sectional Heterogeneity: Introducing Hidden Markov Panel Models","4924663":"Universality of Bayesian Predictions Rejoinder","254974862":"A Nonlinear Random-Coefficients Model for Degradation Testing","266216288":"New probabilistic inference algorithms that harness the strengths of variational and Monte Carlo methods","228313380":"AdMit: Adaptive Mixtures of Student-t Distributions","263136111":"Rare Event Estimation for Computer Models","265394963":"Recursive Bayesian synthetic aperture geoacoustic inversion in the presence of motion dynamics","23748009":"Keynes vs. Prescott and Solow: Identifying Sources of Business Cycle Fluctuations","4729985":"Markov Chain Monte Carlo Simulation Methods in Econometrics","5139588":"Keynesian impulses versus Solow residuals: identifying sources of business cycle fluctuations","287798764":"Autoregressive Moving Average Infinite Hidden Markov-Switching Models","280495220":"Simulation-based fully Bayesian experimental design for mixed effects models","247317104":"Chapter 40 Classical estimation methods for LDV models using simulation","3319036":"Blind Equalization of Frequency-Selective Channels by Sequential Importance Sampling","223404417":"The finite sample properties of simulataneous equations? Estimates and estimators: Bayesian and non-Bayesian approaches","286412224":"Posterior Analysis of State Space Model with Spherical Symmetricity","220649973":"Areal Interpolation of Spatially Extensive Variables: A Comparison of Alternative Techniques","262767485":"Lazy ABC","24073650":"The Economic Consequences of Reduced Fertilizer Use: A Virtual Pricing Approach.","237329093":"Correlation Timing in Asset Allocation with Bayesian Learning","2637000":"An Assessment of Bayesian Inference in Nonparametric Logistic Regression","220543429":"Monte Carlo Sampling Methods for Approximating Interactive POMDPs","5201065":"Testing the Assumptions Behind the Use of Importance Sampling","237873867":"Local Adaptive Importance Sampling for Multivariate Densities With Strong Nonlinear Relationships","4854951":"Modeling the Diffusion of Scientific Publications","237134547":"Formal Bayes Methods for Model Calibration with Uncertainty","227361148":"A Bayesian Analysis of Unit Roots and Structural Breaks in the Level, Trend, and Error Variance of Autoregressive Models of Economic Series","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","46452279":"Estimating treatment effectiveness with sample selection","227584356":"Efficient simulated maximum likelihood estimation through explicitly parameter dependent importance sampling","222482869":"Nonlinear and nonnormal filters using Monte Carlo methods","5092533":"Differences in the College Enrollment Decision Across Race","268339968":"Adoption of best management practices in the Louisiana dairy industry","45135792":"Efficient Likelihood Evaluation of State-Space Representations","267721457":"Precision Farming Information Sources Used by Cotton Farmers","241222505":"Chapter 1 Estimation of Parameters of Constrained Optimization Models","251184118":"Particle Filter with Temporal Smoothing for Mobile Robot Vision-Based Localization","240448347":"Optimal Monte Carlo control","4734279":"Evaluating Prior Beliefs in a Demand System: The Case of Meat Demand in Canada","272819538":"Inference on mode preferences, vehicle purchases, and the energy paradox using a Bayesian structural choice model","23506036":"Bayesian Analysis of Consumer Choices with Taste, Context, Reference Point and Individual Scale Effects","241126221":"Baseline Esophageal Impedance in Different Age in Children","38348636":"On Monte Carlo Methods for Estimating Ratios of Normalizing Constants","24079482":"Using simulation methods for bayesian econometric models: inference, development and communication: some comments","24079480":"Using Simulation Methods for Bayesian Econometric Models","23991411":"On the use of stochastic approximation Monte Carlo for Monte Carlo integration","2632971":"Bayesian Estimation of a Weibull Distribution in a Highly Censored and Small Sample Setting","224741441":"Trellis-based search of the maximum a posteriori sequence using particle filtering","261044906":"Adaptive Personalized Travel Information Systems: A Bayesian Method to Learn Users\u0027 Personal Preferences in Multimodal Transport Networks","2733313":"Computational Aspects of Nonparametric Bayesian Analysis with Applications to the Modeling of Multiple Binary Sequences","4783456":"Is a Voluntary Approach An Effective Environmental Policy Instrument? A Case for Environmental Management Systems","2469135":"Bayesian Testing Of A Parametric Model Versus Nonparametric Alternatives","5182820":"Measuring Inflation Persistence: A Structural Time Series Approach","2778374":"Methods for Approximating Integrals in Statistics with Special Emphasis on Bayesian Integration Problems","221437980":"How Heavy Should the Tails Be?","46434291":"Functional approximations to posterior densities: a neural network approach to efficient sampling","2698514":"Modeling and Inference for Point-Referenced Binary Spatial Data","239793015":"Dynamic Factor Models With Macro, Frailty, and Industry Effects for U.S. Default Counts: The Credit Crisis of 2008","5139727":"Bayesian inference for the Mover-Stayer model in continuous time with an application to labour market transition data","228559065":"Monte Carlo methods for Bayesian analysis of constrained parameter problems","24015910":"Identifying Nonlinear Components by Random Fields in the US GNP Growth. Implications for the Shape of the Business Cycle","220538989":"Particle Filters With Adaptive Resampling Technique Applied to Relative Positioning Using GPS Carrier-Phase Measurements","228579541":"A comparison of the effectiveness of two heuristics for importance sampling","5889303":"25 years of Bayesian methods in the pharmaceutical industry: A personal, statistical bummel","226539729":"Convergence assessment techniques for Markov chain Monte Carlo","2567542":"A Probabilistic Approach for the Adaptive Integration of Multiple Visual Cues Using an Agent Framework","227614916":"Likelihood Inference for Discretely Observed Nonlinear Diffusions","1762626":"A statistical approach to simultaneous mapping and localization for mobile robots","2532734":"Univariate Polynomial Inference by Monte Carlo Message Length Approximation","257665538":"A Bayesian method of distinguishing unit root from stationary processes based on panel data models with cross-sectional dependence","228313281":"Confronting Prior Convictions: On Issues of Prior Sensitivity and Likelihood Robustness in Bayesian Analysis","4787498":"Model-Based Measurement of Actual Volatility in High-Frequency Data","221442137":"Improving Importance Sampling by Adaptive Split-Rejection Control in Bayesian Networks.","266474126":"Intrinsic Bayesian estimation of VAR impulse responses","238699351":"ACCOUNTING FOR INPUT UNCERTAINTY IN DISCRETE-EVENT SIMULATION","222490669":"Reconciling the term structure of interest rates with the consumption-based ICAP model","237413206":"AdMit: Adaptive Mixtures of Student-t","239317809":"Approximating Posterior Distributions in Ensemble Forecasting","5201211":"Likelihood INference for Discretely Observed Non-linear Diffusions","258794009":"Gaussian Process Regression for Sensor Networks Under Localization Uncertainty","12545482":"Sequential Monte Carlo Methods to Train Neural Network Models","238189381":"Adaptive Particle Filtering for Spacecraft Attitude Estimation from Vector Observations","245433306":"Improved Ground Trajectory Prediction by Multi-Aircraft Track Fusion for Air Traffic Control","254413399":"Granger-causal analysis of VARMA-GARCH models","24079377":"A Bayesian analysis of trend determination in economic time series","23805163":"Efficient Filtering in State-Space Representations","257882844":"Adaptive Distributed Resampling Algorithm with Non-Proportional Allocation","261571093":"Path Sampling to Compute Integrated Likelihoods: An Adaptive Approach","243086334":"Bayes estimates of muIti-criteria decision alternatives using Monte Carlo integration","227516446":"Importance sampling: A review","46434134":"Neural network approximations to posterior densities: an analytical approach","228259849":"Updating Expected Returns Based on Consensus Forecasts","227612677":"Monte Carlo Likelihood Estimation for Three Multivariate Stochastic Volatility Models","228739127":"A particle filtering algorithm for interactive pomdps","3003832":"Particle filters for tracking with out-of-sequence measurements","250332018":"Auxiliary Variable Sequential Monte Carlo Methods","24079605":"Bayesian analysis of DSGE models","241724403":"Toward BlackBox Sampling: A Random-Direction Interior-Point Markov Chain Approach","24079604":"Editors\u0027 Introduction to the Special Issue of Econometric Reviews on Bayesian Dynamic Econometrics","4894166":"Analysis of the predictive ability of information accumulated over nights, weekends and holidays","4857303":"A Bayesian analysis of simultaneous equation models by combining recursive analytical and numerical approaches","230750304":"A population Monte Carlo scheme with transformed weights and its\napplication to stochastic kinetic models","236135344":"Importance Sampling for Sums of Lognormal Distributions with Applications to Operational Risk","228427832":"Likelihood based inference for observed and partially observed diffusions","233400398":"Data Assimilation in Marine Models","222822628":"Flexible modeling of conditional distributions using smooth mixtures of asymmetric Student t densities","35942281":"Architectures for efficient implementation of particle filters /","2364811":"Gibbs Sampling","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","228333613":"Approximate Inference Algorithms for Hybrid Bayesian Networks with\nDiscrete Constraints","247051014":"On the Variability of Case-Deletion Importance Sampling Weights in the Bayesian Linear Model","234070065":"Implicit Estimation of Ecological Model Parameters","242594742":"Dieren t Aspects of Nonlinear Stochastic Filtering Theory","35901418":"Essays on specification and estimation of latent variable models /","220225769":"Blind sequential detection for Rayleigh fading channels using hybrid Monte Carlo-recursive identification algorithms","5180806":"The Hessian Method (Highly Efficient State Smoothing, In a Nutshell)","222486670":"Small sample rank tests with applications to asset pricing","227379267":"Bayesian Estimation and Model Selection in the Generalized Stochastic Unit Root Model","45866868":"Earthquake Forecasting Based on Data Assimilation: Sequential Monte Carlo Methods for Renewal Processes","222414995":"Chapter 15 Volatility and Correlation Forecasting","268397097":"Bayesian inference for quantile autoregression and M-quantile regression","2641407":"Bayesian Selection of Log-Linear Models","237628400":"Bayesian Estimator of Vector-Autoregressive Model Under the","223025301":"General Hit-and-Run Monte Carlo sampling for evaluating multidimensional integrals","222808231":"Bayesian analysis of systems of seemingly unrelated regression equations under a recursive extended natural conjugate prior density","264241698":"Temporal validation of Particle Filters for video tracking","4744622":"Modeling Regression Error With a Mixture of Polya Trees","27515978":"Bayesian Model Assessment and Selection Using Expected Utilities","228245616":"Start-up Incentives: Entrepreneurship Policy or Active Labour Market Programme?","276065688":"A Primer on Bayesian Inference for Biophysical Systems","222566588":"A Bayesian Approach to Dynamic Macroeconomics","23690384":"Estimates of Food Demand Elasticities for Great Britain: 1972-1994","2352607":"Evaluating the Accuracy of Sampling-Based Approaches to the Calculation of Posterior Moments","238689222":"Bayesian Filtering: From Kalman Filters to Particle Filters, and Beyond","285332732":"Statistics and Computing","2717143":"Approximations to the Log-Likelihood Function in the Nonlinear Mixed-Effects Model","228464737":"Estimation of the cev and cevj models on returns and options","5158476":"Associations versus registration as alternative strategies of small firms","221946686":"An EM Algorithm for Nonlinear Random Effects Models","238874683":"An importance sampling algorithm for exact conditional tests in log-linear models","267442680":"Informatics in control, automation and robotics. Selected papers from the international conference on informatics in control, automation and robotics (INCINO 2007), Angers, France, May 9–12, 2007","241756261":"Functional Differencing","225762170":"A general approach to Bayesian portfolio optimization","227709825":"Sequential Monte Carlo methods for multi‐aircraft trajectory prediction in air traffic management","251896086":"Importance Sampling to Accelerate the Convergence of Quasi-Monte Carlo","4724329":"A New Class of Multivariate Skew Densities, With Application to Generalized Autoregressive Conditional Heteroscedasticity Models","5049961":"Prior Density-Ratio Class Robustness in Econometrics","230683547":"Comprehensive Evaluation of Model Uncertainty in Qualitative Network Analyses","239329380":"A New Perspective on Priors for Generalized Linear Models","46546145":"Bayesian Markov mixture of normals approach to modeling financial returns","227390373":"Introduction to Bayesian Econometrics","2463244":"Spherical-Radial Integration Rules for Bayesian Computation","221606680":"Approximate Counting by Sampling the Backtrack-free Search Space.","228441000":"Payout Yield, Risk, and Mispricing: A Bayesian Analysis","38296701":"Topics in Particle Filtering and Smoothing","2950677":"An Importance Sampling Algorithm Based on Evidence Pre-Propagation","228266915":"Return Predictability under Equilibrium Constraints on the Equity Premium","260026695":"Time-varying equilibrium rates in small open economies: Evidence for Canada","228363174":"Bayesian Inference in Threshold Stochastic Frontier Models","4857460":"‘ARCH Modelling in Finance: A Review of the Theory and Empirical Evidence’","285415234":"Systemic decision making in AHP: a Bayesian approach","256846091":"Diagnostics for Variational Bayes approximations","269102680":"Customer Co-Creation","7718433":"Power analyses for correlations from clustered study designs","4726289":"Secular and Cyclical Behavior of Real GDP in 19 Countries, 1957–1983","223062801":"Willingness to pay for renewable energy investment in Korea: A choice experiment study","51887437":"From EM to Data Augmentation: The Emergence of MCMC Bayesian Computation\nin the 1980s","250755246":"Dynamic Models","5207569":"Monte Carlo Estimation for Nonlinear Non-Gaussian State Space Models","24422166":"Properties and Implementation of Jeffreys\u0027s Prior in Binomial Regression Models","4902445":"Simulation estimation of dynamic discrete choice panel models with accelerated importance samplers","224711438":"A Monte Carlo Technique for Large-Scale Dynamic Tomography","228416496":"THE HESSIAN METHOD WITH CONDITIONAL DEPENDANCE","2547286":"Testing For Cointegration Rank Using Bayes Factors","265644454":"Vertical-likelihood Monte Carlo","243083275":"Maximization of the Marginal Likelihood of Grouped Survival Data","232743848":"Laplace Approximation for Logistic Gaussian Process Density Estimation and Regression","4902448":"Estimating Marginal Likelihoods for Mixture and Markov Switching Models Using Bridge Sampling Techniques","238874691":"Beyond accept-reject sampling","252551538":"Distributional Importance Sampling for Approximate Weighted Model Counting","262580516":"Regional heterogeneity and location choice of FDI in Korea via agglomeration and linkage relationships","4722382":"Numerical Techniques for Maximum Likelihood Estimation of Continuous-Time Diffusion Processes","221633458":"A New Algorithm for Sampling CSP Solutions Uniformly at Random","257858009":"Error of calculating the optimal Bayesian estimate using the Monte Carlo method in nonlinear problems","228707112":"Bayesian Estimation via Sequential Monte Carlo Sampling: Unconstrained Nonlinear Dynamic Systems","226384887":"Parameter Estimation and Practical Aspects of Modeling Stochastic Volatility","24432637":"Tomographic Imaging of Dynamic Objects With the Ensemble Kalman Filter","255857098":"Sequential Monte Carlo Sampling for DSGE Models","5140165":"Aggregate Shocks and Macroeconomic Fluctuations: A Bayesian Approach.","6600424":"Sequential Updating of a New Dynamic Pharmacokinetic Model for Caffeine in Premature Neonates","51955092":"Bayesian Multitask Inverse Reinforcement Learning","277313035":"Adaptive Importance Sampling in Signal Processing","35017883":"Bayesian time series : analysis methods using simulation-based computation /","4857541":"Forecasting time series with common seasonal patterns","24139744":"Customer-Specific Taste Parameters and Mixed Logit: Households\u0027 Choice of Electricity Supplier.","225223678":"The Performance of German Firms in the Business-Related Service Sectors Revisited: Differential Evolution Markov Chain Estimation of the Multinomial Probit Model","5140188":"Bayesian Inference in Limited Dependent Variable Models: An Application to Measuring Strike Duration.","222505942":"Nonlinear and non-Gaussian state-space modeling with Monte Carlo simulations","236136582":"A Linear Approximation Method for Probabilistic Inference","216775292":"Observations and stochastic modeling of soil moisture control on evapotranspiration in a Californian oak savanna. Water Resour Res 44:","12826203":"Some adaptive Monte Carlo methods for Bayesian inference","4722385":"Numerical Techniques for Maximum Likelihood Estimation of Continuous-Time Diffusion Processes: Comment.","251572324":"Bayesian Model Comparison for Compartmental Models with Applications in Positron Emission Tomography","1740417":"Case-deletion importance sampling estimators: Central limit theorems and related results","260395302":"Maximum likelihood estimation of partially observed diffusion models","263252246":"Monte Carlo Evaluations of Multivariate Normal Probabilities","231537514":"On particle filters applied to electricity load forecasting","232416125":"Bayesian Conditional Monte Carlo Algorithms for Sequential Single and\nMulti-Object filtering","5064423":"Bayesian Encompassing Tests of Unit Root Hypothesis","251726250":"Chronic Administration of Diclofenac Did Not Result in Gastric Damage but Increased Cardiovascular Risk by Upregulation of PRO-Atherogenic Cytokines","5140222":"Prediction, Filtering and Smoothing in Non-linear and Non-normal Cases Using Monte Carlo Integration.","271459997":"Piecewise Constant Sequential Importance Sampling for Fast Particle Filtering","275588827":"Estimation of Dynamic Discrete Choice Models by Maximum Likelihood and the Simulated Method of Moments","277005882":"Granger-causal analysis of GARCH models: a Bayesian approach","228473639":"Monte Carlo dynamically weighted importance sampling for spatial models with intractable normalizing constants","5140210":"Non-stationarity in GARCH models: A Bayesian analysis","228541219":"Estimation and Inference via Bayesian Simulation: An Introduction to Markov Chain Monte Carlo","227652397":"Better Confidence Intervals for Importance Sampling","4857591":"A Bayesian analysis of logit models using natural conjugate priors","5140208":"“Accelerated Gaussian Importance Sampler with Application to Dynamic Latent Variable Models”","267721035":"A New Approach to Modeling and Estimation for Pairs Trading","272197255":"Recursive Bayesian estimation of regularized and irregular quasar light curves","5140209":"Bayesian Treatment of the Independent Student Linear Model","24139698":"Classical Estimation Methods for LDV Models Using Simulation","226913088":"Simulation Techniques for Panels: Efficient Importance Sampling","227625818":"A Parametric Approach to Flexible Nonlinear Inference","266428717":"A Survey of Sampling Methods for Inference on Directed Graphs","222684040":"Bayesian Forecasting of Value at Risk and Expected Shortfall Using Adaptive Importance Sampling","4118259":"Estimation of switching activity in sequential circuits using dynamic Bayesian Networks","265144579":"Analysis of Risk Presentations in Retirement Investment Choices Under Prospect Theory","274955953":"EUI Working Paper","280589920":"Metropolized Randomized Maximum Likelihood for sampling from multimodal distributions","222315421":"Bayesian estimation and forecasting in non-linear models application to an LSTAR model","283762228":"Generalized Multiple Importance Sampling","222446496":"Posterior simulation and Bayes factors in panel count data model","250185738":"An Importance Sampling EM Algorithm for Latent Regression Models","15580680":"Pharmacodynamic analysis of analgesic clinical trials using empirical methods.","4859555":"An Empirical Analysis of Earnings Dynamics among Men in the PSID: 1968-1989","248807480":"Comprehensive At-Site Flood Frequency Analysis Using Monte Carlo Bayesian Inference","222200782":"Asymptotic Bayesian analysis based on a limited information estimator","242694278":"Nference on Clustered Survival Data Using Imputed Frailties","4286128":"Neural Network Strategy for Sampling of Particle Filters on the Tracking Problem","264376630":"An Economic Evaluation of Empirical Exchange Rate Models","23629725":"Improving MCMC, using efficient importance sampling","220271572":"A State Estimator For Nonlinear Stochastic Systems Based On Dirac Mixture Approximations","24016795":"Bayesian estimation of a Markov-switching threshold asymmetric GARCH model with Student-t innovations","226073479":"An iterative Monte Carlo method for nonconjugate Bayesian analysis","255576125":"RÉSUMÉ OF THE DISSERTATION","232616660":"Optimal Resource Allocation in Two Stage Sampling of Input Distributions","2590508":"Deterministic and Stochastic Bayesian Methods in Terrain Navigation","23694949":"Testing Calibrated General Equilibrium Models","3321663":"Monte Carlo methods for signal processing: A review in the statistical signal processing context","222351959":"“Bayes Inference in the Tobit Censored Regression Model.”","37596455":"Importance Sampling for Reinforcement Learning with Multiple Objectives","6645625":"Power analyses for longitudinal study designs with missing data","12566430":"Bayesian inference for a generalized population attributable fraction: The impact of early vitamin A levels on chronic lung disease in very low birthweight infants","228315833":"Monte Carlo Maximum Likelihood Estimation for Generalized Long-Memory Time Series Models","220504579":"Bayesian and Non Bayesian Estimations on the Exponentiated Modified Weibull Distribution for Progressive Censored Sample","268871471":"Direct and indirect effects of R\u0026D cooperation on innovation of Italian firms","257069180":"Particle Efficient Importance Sampling","257146976":"On some properties of Markov chain Monte Carlo simulation methods based on the particle filter","222802547":"Predicting excess returns in financial markets","228289196":"Dividend Yield, Risk, and Mispricing: A Bayesian Analysis","4843383":"Estimating Macroeconomic Models: A Likelihood Approach","255623171":"Bayesian computation for contingency tables with incomplete cell-counts","222700037":"Chapter 1 Bayesian Forecasting","224311834":"A Monte Carlo Particle Model Associated with Neural Networks for Tracking Problem","6448935":"Combining Monte Carlo and Mean-Field-Like Methods for Inference in Hidden Markov Random Fields","268275891":"Quasi Importance Sampling","222452236":"‘Testing Multi-beta Asset Pricing Models’","240802069":"A Bayesian Approach to Estimation of GPAs of University of Iowa Freshmen Under Order Restrictions","222679574":"Comparing Uncertainty Analysis Techniques for a SWAT Application to the Chaohe Basin in China","26658508":"Bayesian Phylogeny Analysis via Stochastic Approximation Monte Carlo","5140243":"Statistical Inference in Calibrated Models","273858316":"Political Influence of Exporting and Import-Competing Firms: Evidence from Eastern European and Central Asian Countries","235342183":"Active comparison of prediction models","254330954":"Bayesian Binomial Regression: Predicting Survival at a Trauma Center","2791246":"Partially Improper Gaussian Priors for Nonparametric Logistic Regression","254296141":"Faster Adaptive Importance Sampling in Low Dimensions","23504384":"CONFIRMATION AND FALSIFICATION OF EQUILIBRIUM DISPLACEMENT MODELS","223300130":"Real-time rational expectations and indeterminacy","47383997":"Intestinal lineage commitment of embryonic stem cells","249047465":"A Bayesian state-space model for mixed-stock migrations, with application to Northeast Atlantic mackerel Scomber scombrus","5162813":"Bayesian Analysis of Deterministic Time Trend and Changes in Persistence Using a Generalised Stochastic Unit Root Model","228700885":"ABSTRACT Bayesian Approach to Exploiting prior Targeting Information within a Weapon Seeker","233519763":"Accounting for Structural Uncertainty to Facilitate Precautionary Fishery Management: Illustration with Namibian Orange Roughy","252491894":"An Economic Evaluation of Empirical Exchange Rate Models: Robust Evidence of Predictability and Volatility Timing","222802631":"Maximum Likelihood Estimation of Factor and Ideal Point Models for Paired Comparison Data","239655370":"Bayesian Model Choice: Asymptotics and Exact Calculations","4747213":"An Alternative Approach to Modeling and Forecasting Seasonal Time Series","4986827":"Dynamic BivarSate Mixture Models: Modeling the Behavior of Prices and Trading Volume","277634816":"Bayesian Conditional Monte Carlo Algorithms for Nonlinear Time-Series State Estimation","45108541":"Use in practice of importance sampling for repeated MCMC for Poisson models","222503635":"Bayesian Reduced Rank Regression in Econometrics","2453431":"A Sequential Particle Filter Method for Static Models","243042798":"Importance sampling for signal extraction model in time series analysis","220097158":"Importance Sampling for Bayesian Networks: Principles, Algorithms, and Performance","3319722":"Quasi-Monte Carlo filtering in nonlinear dynamic systems","227564041":"Simulation‐Based Bayesian Econometric Inference: Principles and Some Recent Computational Advances","222708452":"Bayesian analysis of ARMA-GARCH models: a Markov chain sampling approach","2359168":"On Markov Chain Monte Carlo Methods For Nonlinear And Non-Gaussian State-Space Models","241527245":"Computation Intensive Methods: State of the Art","1925045":"Computationally Efficient Nonparametric Importance Sampling","222704365":"Bayesian analysis of nested logit models by Markov Chain Monte Carlo","254296199":"Performance of the Gibbs, Hit-and-Run, and Metropolis Samplers","222730995":"A simulation approach to the problem of computing Cox\u0027s statistic for non-nested models","243767612":"Blind Deconvolution via Sequential Imputations","237588885":"WO RKING PA PER SERIES","245582178":"Bayesian Prediction, Entropy, and Option Pricing in the U.S. Soybean Market, 1993-1997","262688874":"Adaptive Vector Quantization for Precoding using Blind Channel Prediction in Frequency Selective MIMO Mobile Channels","225069733":"Dynamic Filtering of Static Dipoles in MagnetoEncephaloGraphy","4816793":"Marginal likelihoods for non-Gaussian models using auxiliary mixture sampling","224240268":"Global Localization of Objects via Touch","222014179":"Particle Filtering and Moving Horizon Esimaion","2998263":"An Overview of Existing Methods and Recent Advances in Sequential Monte Carlo","46464282":"What is an oil shock? Panel data evidence","24063630":"Semiparametric Thurstonian Models for Recurrent Choices: A Bayesian Analysis","228217467":"The Impact of User-Generated Content On Product Innovation","2985929":"Diagnosis by a Waiter and a Mars Explorer","5072805":"What Macroeconomists Should Know About Unit Roots as Well: The Bayesian Perspective.","26814067":"Nonlinear Random Effects Mixture Models: Maximum Likelihood Estimation via the EM Algorithm","2336718":"Bayesian Vector Autoregressions With Stochastic Volatility","3854284":"Articulated body motion capture by annealed particle filtering","23778962":"The AdMit Package","34487799":"Essays on quantitative marketing models and Monte Carlo integration methods /","254423248":"A Comparative Study of the Classical and Bayesian Methods of Simultaneous Equations Econometric Model Estimation","34209267":"Wireless sensor network planning with application to UWB localization in GPS-denied environments /","2478046":"Sigma-Point Kalman Filters for Probabilistic Inference in Dynamic State-Space Models","273778605":"Bayesian partial linear model for skewed longitudinal data","220672730":"Sampling-based Lower Bounds for Counting Queries","242674057":"Gaussian processes in Bayesian modeling: Manual for Matlab toolbox GPstuff, Version 2.0"},"index":401}