{"abs":"We explore how the big-three computing paradigms -- symmetric multi-processor (SMC), graphical processing units (GPUs), and cluster computing -- can together be brought to bare on large-data Gaussian processes (GP) regression problems via a careful implementation of a newly developed local approximation scheme. Our methodological contribution focuses primarily on GPU computation, as this requires the most care and also provides the largest performance boost. However, in our empirical work we study the relative merits of all three paradigms to determine how best to combine them. The paper concludes with two case studies. One is a real data fluid-dynamics computer experiment which benefits from the local nature of our approximation; the second is a synthetic data example designed to find the largest design for which (accurate) GP emulation can performed on a commensurate predictive set under an hour.","title":"Massively Parallel Approximate Gaussian Process Regression","id":258082179,"url":"https://www.researchgate.net/publication/258082179_Massively_Parallel_Approximate_Gaussian_Process_Regression","names":["Robert B. Gramacy","Jarad Niemi","Robin M. Weiss"],"references":{"262576230":"Estimation and Prediction in Spatial Models With Block Composite Likelihoods","4993358":"Fixed rank Kriging for very large data sets","45904702":"A Computationally Stable Approach to Gaussian Process Interpolation of\nDeterministic Computer Simulation Data","4772045":"Bayesian Calibration of Computer Models","4914189":"Approximating likelihoods for large spatial data sets","239667584":"A Framework for Validation of Computer Models","246930297":"Neural network exploration using optimal experiment","221932969":"Statistics For Spatial Data","236871817":"Parallelizing Gaussian Process Calculations in R","221669294":"A Short Note on Gaussian Process Modeling for Large Datasets using\nGraphics Processing Units","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","246097585":"Estimation and Identification for Continuous Spatial Processes","242235985":"Accurate emulators for large-scale computer experiments","235765935":"Local Gaussian Process Approximation for Large Computer Experiments","41781406":"A Unifying View of Sparse Approximate Gaussian Process Regression","236474812":"Deterministic uncertainty analysis","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","51914869":"Efficient emulators of computer experiments using compactly supported correlation functions, with application to cosmology","257530999":"Scaling Multidimensional Inference for Structured Gaussian Processes","216301578":"snow: Simple Network of Workstations","228765709":"Covariance Tapering for Interpolation of Large Spatial Datasets","242240128":"Multiresolution models for non-stationary spatial covariance function","45875211":"Particle Learning of Gaussian Process Models for Sequential Design and Optimization","1733357":"Adaptive Design and Analysis of Supercomputer Experiments","3857869":"Gaussian Process Regression: Active Data Selection and Test Point Rejection","246781322":"Matrix Methods for Engineers and Scientists"},"citedIn":{"235765935":"Local Gaussian Process Approximation for Large Computer Experiments","266856357":"Calibrating a large computer experiment simulating radiative shock hydrodynamics","263545382":"Hierarchical Nearest-Neighbor Gaussian Process Models for Large Geostatistical Datasets","265252310":"Speeding up neighborhood search in local Gaussian process prediction","274095916":"A review on prognostic techniques for non-stationary and non-linear rotating systems","283659093":"Efficient Multiscale Gaussian Process Regression using Hierarchical Clustering"},"index":407}