{"abs":"Simplicity of design and independence from external inputs make passive safety systems very attractive both from the economical and safety points of view, for the development of future nuclear reactor concepts. On the other hand, concerns arise due to the not fully understood physical phenomena underlying their (passive) functioning and the scarce operating experience to characterize them, which can give rise to functional failures due to deviations from their modeled, expected behavior. The estimation of the probabilities of these failures requires the propagation of uncertainties in the passive systems functions models, which can be done by classical, crude Monte Carlo schemes. However, the passive system design is such that failure is a rare event, which renders these approaches often impractical due to the computational efforts involved in the repetition of runs of the computer codes numerically encoding the system model. In order to overcome this problem, in this paper we propose to apply the meta-AK-IS2 algorithm, previously introduced by the authors for obtaining improved computational efficiencies by coupling a kriging-based metamodel to an MC-based importance sampling strategy. The method is developed and demonstrated with reference to a case study of a natural convection-based cooling system of a gas-cooled fast reactor, operating under a post-loss-of-coolant accident (LOCA). A comparison is made with respect to other variance reduction-based methods of literature.","title":"Passive systems failure probability estimation by the meta-AK-IS2 algorithm","id":264349943,"url":"https://www.researchgate.net/publication/264349943_Passive_systems_failure_probability_estimation_by_the_meta-AK-IS2_algorithm","names":["Francesco Cadini","Francisco Santos","Enrico Zio","Nuclear Engineering and Design"],"references":{"223425872":"Passive system reliability analysis using the APSRA methodology","251621501":"The dangers of sparse sampling for the quantification of margin and uncertainty","224839970":"Some Methods for Classification and Analysis of MultiVariate Observations","200622065":"Equation of State Calculations by Fast Computing Machines","200105001":"Equation of State by Fast Computing Machines","222835342":"Estimation of the functional failure probability of a thermal–hydraulic passive system by Subset Simulation","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","236508426":"Reliability Evaluation of Passive Systems Through Functional Reliability Assessment","257391812":"Subset Simulation of a reliability model for radioactive waste repository performance assessment","223879758":"IAEA activities on passive safety systems and overview of international development","223101396":"Incorporating reliability analysis into the design of passive cooling systems with an application to a gas-cooled reactor","51890126":"Metamodel-based importance sampling for structural reliability analysis","248560911":"Importance sampling in structural system","222881387":"Thermal–hydraulic passive system reliability-based design approach","223333740":"Passive cooldown performance of a 65MW integral reactor","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","210222819":"Simulation and the Monte Carlo Method","241947137":"The Impact of Uncertainties on the Performance of Passive Systems","285743970":"Risk-informed design changes in a passive decay heat removal system","223944114":"Reliability-based design sensitivity by efficient simulation","222390634":"Construction of response surfaces based on progressive-lattice-sampling experimental design with application to uncertainty propagation","262369166":"KrigInv: An efficient and user-friendly implementation of batch-sequential inversion strategies based on Kriging","263666649":"An improved adaptive kriging-based importance technique for sampling multiple failure regions of low probability","224839945":"On Information and Sufficiency","222364014":"Investigating the ESBWR stability with experimental and numerical tools: A comparative study","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","222780925":"A new adaptive importance sampling scheme","223912354":"Latin Hypercube Sampling and the Propagation of Uncertainty in Analyses of Complex Systems, Technical Report, SAND2001-0417","223424620":"Two methods for the structured assessment of model uncertainty by experts in performance assessments of radioactive waste repositories. Reliability Engineering \u0026 System Safety, 54, 225-241"},"citedIn":{},"index":409}