{"abs":"Probabilistic design in complex design spaces is often a computationally expensive and difficult task because of the highly nonlinear and noisy nature of those spaces. Approximate probabilistic methods, such as, First-Order Second-Moments (FOSM) and Point Estimate Method (PEM) have been developed to alleviate the high computational cost issue. However, both methods have difficulty with non-monotonic spaces and FOSM may have convergence problems if noise on the space makes it difficult to calculate accurate numerical partial derivatives. Use of design and Analysis of Computer Experiments (DACE) methods to build polynomial meta-models is a common approach which both smoothes the design space and significantly improves the computational efficiency. However, this type of model is inherently limited by the properties of the polynomial function and its transformations. Therefore, polynomial meta-models may not accurately represent the portion of the design space that is of interest to the engineer. The objective of this paper is to utilize Gaussian Process (GP) techniques to build an alternative meta-model that retains the properties of smoothness and fast execution but has a much higher level of accuracy. If available, this high quality GP model can then be used for fast probabilistic analysis based on a function that much more closely represents the original design space. Achieving the GP goal of a highly accurate meta-model requires a level of mathematics that is much more complex than the mathematics required for regular linear and quadratic response surfaces. Many difficult mathematical issues encountered in the implementation of the Gaussian Process meta-model are addressed in this paper. Several selected examples demonstrate the accuracy of the GP models and efficiency improvements related to probabilistic design.","title":"Gaussian Process Meta-Models for Efficient Probabilistic Design in Complex Engineering Design Spaces","id":267486189,"url":"https://www.researchgate.net/publication/267486189_Gaussian_Process_Meta-Models_for_Efficient_Probabilistic_Design_in_Complex_Engineering_Design_Spaces","names":["Liping Wang","Don Beeson","Srikanth Akkaram","Gene Wiggs"],"references":{},"citedIn":{"275480970":"A Computational Intelligence Approach to Solve the Inverse Problem of Electrical DC Resistivity Sounding","225523426":"System reliability based vehicle design for crashworthiness and effects of various uncertainty reduction measures","282184742":"An Integrated Performance Measure Approach for System Reliability Analysis","268572250":"A Robust and Efficient Probabilistic Approach for Challenging Industrial Applications with High-Dimensional and Non-Monotonic Design Spaces","279070091":"A double-loop adaptive sampling approach for sensitivity-free dynamic reliability analysis","228367926":"Reliability-Based Structural Optimization Using a Multiscale Material Model","228670349":"Product design optimization with microstructure-property modeling and associated uncertainties","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions"},"index":414}