{"abs":"Multiobjective optimization involves minimizing or maximizing multiple objective functions subject to a set of constraints. In this study, a novel constrained multiobjective biogeography optimization algorithm (CMBOA) is proposed. It is the first biogeography optimization algorithm for constrained multiobjective optimization. In CMBOA, a disturbance migration operator is designed to generate diverse feasible individuals in order to promote the diversity of individuals on Pareto front. Infeasible individuals nearby feasible region are evolved to feasibility by recombining with their nearest nondominated feasible individuals. The convergence of CMBOA is proved by using probability theory. The performance of CMBOA is evaluated on a set of 6 benchmark problems and experimental results show that the CMBOA performs better than or similar to the classical NSGA-II and IS-MOEA.","title":"Constrained Multiobjective Biogeography Optimization Algorithm","id":263779142,"url":"https://www.researchgate.net/publication/263779142_Constrained_Multiobjective_Biogeography_Optimization_Algorithm","names":["Hongwei Mo","Zhidan Xu","Lifang Xu","Zhou Wu","Haiping Ma"],"references":{"2356071":"On the Use of Non-Stationary Penalty Functions to Solve Nonlinear Constrained Optimization Problems with GA\u0027s","239023800":"Multi-Objective function optimization using non-dominated sorting genetic algorithms, Evolutionary Computation, 2(3):221-248","257739798":"Distributed learning with biogeography-based optimization: Markov modeling and robot control","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","224309395":"Biogeography-Based Optimization","222658699":"Deb, K.: An Efficient Constraint Handling Method for Genetic Algorithm. Computer Methods in Applied Mechanics and Engieering 186, 311-338","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","271617952":"Efficient constraint handling for optimal reactive power dispatch problems","271618145":"Biogeography based optimization technique for best compromise solution of economic emission dispatch","220514421":"Constraint-handling in nature-inspired numerical optimization: past, present and future. Swarm Evol Comput","220514416":"A practical tutorial on the use of nonprametric statistical tests as a methodology for comparing evolutionary and swarm intelligence algorithm","220435831":"Research of Biogeography-Based Multi-Objective Evolutionary Algorithm","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","232875897":"Multiobjective design optimization by an evolutionary algorithm","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","3662955":"GA-based decision support system for multicriteria optimization","220508292":"A Linear State-Space Analysis of the Migration Model in an Island Biogeography System","257705598":"Handling multiple objectives with biogeography-based optimization","3949336":"An evolutionary algorithm for constrained multi-objective optimization","221025610":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","226165021":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","285856879":"An efficient constraint handling method for genetic algorithms","46106830":"A Probabilistic Analysis of a Simplified Biogeography-Based Optimization Algorithm","3419014":"An Adaptive Tradeoff Model for Constrained Evolutionary Optimization","221228445":"Constraint-Handling Method for Multi-objective Function Optimization: Pareto Descent Repair Operator","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","265432807":"Multiobjective optimization Test Instances for the CEC 2009 Special Session and Competition","221547213":"Infeasible Elitists and Stochastic Ranking Selection in Constrained Evolutionary Multi-objective Optimization","3418762":"Self-Adaptive Fitness Formulation for Constrained Optimization","2611416":"A Survey of Evolution Strategies","3575241":"On the use of non-stationary penalty functions to solve nonlinear constrained optimization problems with GA\u0027s"},"citedIn":{},"index":42}