{"abs":"This paper presents a simulation-based framework for sequential inference from partially and discretely observed point process (PP\u0027s) models with static parameters. Taking on a Bayesian perspective for the static parameters, we build upon sequential Monte Carlo (SMC) methods, investigating the problems of performing sequential filtering and smoothing in complex examples, where current methods often fail. We consider various approaches for approximating posterior distributions using SMC. Our approaches, with some theoretical discussion are illustrated on a doubly stochastic point process applied in the context of finance.","title":"Inference for a Class of Partially Observed Point Process Models","id":221659088,"url":"https://www.researchgate.net/publication/221659088_Inference_for_a_Class_of_Partially_Observed_Point_Process_Models","names":["James S. Martin","Ajay Jasra","Emma McCoy","Annals of the Institute of Statistical Mathematics"],"references":{"2652330":"A Lyapunov Bound for Solutions of Poisson\u0027s Equation","245491746":"Non-linear Markov Chain Monte Carlo","243613574":"Random Point Processes in Time and Space","2368288":"A modelling framework for the prices and times of trades made on the New York stock exchange","243102517":"Estimation and filtering by reversible jump MCMC for a doubly stochastic Poisson model for ultra-high-frequency financial data","228365205":"Monte Carlo Filtering of Piecewise Deterministic Processes","4772034":"Non-Gaussian OU Based Models and Some of Their Uses in Financial Economics","224642157":"Optimal Filtering For Partially Observed Point Processes Using Trans-Dimensional Sequential Monte Carlo","279346984":"An Introduction to the Theory of Point Processes, Vol. II","29607955":"On Adaptive Resampling Procedures for Sequential Monte Carlo Methods","248115483":"Topics in Sequential Monte Carlo Samplers","2453431":"A Sequential Particle Filter Method for Static Models","2369650":"“Filtering Via Simulation: Auxiliary Particle Filter”","4772191":"Bayesian Inference for Non-Gaussian Ornstein-Uhlenbeck Stochastic Volatility Processes","220363771":"A Monte Carlo method for filtering a marked doubly stochastic Poisson process","1825409":"Sequential monte carlo samplers","265505608":"An Introduction to the Theory of Point Processes. Volume II: General Theory and Structure","228626697":"Sequential Monte Carlo for Bayesian Computation","50425579":"On the Stability of Sequential Monte Carlo Methods in High Dimensions","215446267":"Monte Carlo Strategies in Scientic Computing","220286671":"On population-based simulation for static inference","282991985":"Non-Gaussian Ornstein–Uhlenbeck based models and some of their uses in financial economics","2670104":"Reversible Jum Markov Chain Monte Carlo Computation and Bayesian Model Determination","51916712":"On nonlinear Markov chain Monte Carlo","200744518":"Sequential Monte-Carlo Methods in Practice","38351676":"A Liapounov bound for solutions of the Poisson equation","220286676":"Filtering recursions for calculating likelihoods for queues based on inter-departure time data","221668291":"On adaptive resampling strategies for sequential Monte Carlo methods","228779861":"SMC^ 2: A sequential Monte Carlo algorithm with particle Markov chain Monte Carlo updates","270287461":"On Particle Methods for Parameter Estimation in General State-Space Models","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","4742261":"A Monte Carlo Approach to Filtering for a Class of Marked Doubly Stochastic Poisson Processes","4993330":"Sequential Monte Carlo Samplers","3081936":"Filtering and Detection for Doubly Stochastic Poisson Processes"},"citedIn":{"264834090":"Static-parameter estimation in piecewise deterministic processes using particle Gibbs samplers","274094642":"Multilevel Sequential Monte Carlo Samplers"},"index":424}