{"abs":"We propose a new Monte Carlo algorithm for complex discrete distributions. The algorithm is motivated by the N-Fold Way, which is an ingenious event-driven MCMC sampler that avoids rejection moves at any specific state. The N-Fold Way can however get \"trapped\" in cycles. We surmount this problem by modifying the sampling process. This correction does introduce bias, but the bias is subsequently corrected with a carefully engineered importance sampler.","title":"Large-Flip Importance Sampling","id":228058925,"url":"https://www.researchgate.net/publication/228058925_Large-Flip_Importance_Sampling","names":["Firas Hamze","Nando de Freitas"],"references":{"224656674":"Learning algorithms for Boltzmann machines","2824425":"AIS-BN: An Adaptive Importance Sampling Algorithm for Evidential Reasoning in Large Bayesian Networks","220319974":"Latent Dirichlet Allocation","228057950":"Conditional Random Fields: Probabilistic Models for Segmenting and Labeling Sequence Data","228770227":"Bayesian Clustering with Variable and Transformation Selections","225304570":"Non-Uniform Random Variate Generation","1825409":"Sequential monte carlo samplers","1824256":"Extended Ensemble Monte Carlo","1959228":"Semi-Supervised Learning -- A Statistical Physics Approach","220693571":"Tabu search I","224877198":"A New Algorithm for Monte Carlo Simulation of King Spin Systems","231001263":"On the computational complexity of Ising spin glass models","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","221618137":"Conditional mean field","236118717":"Weighing and Integrating Evidence for Stochastic Simulation in Bayesian Networks","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","10856084":"Rejection-free Monte Carlo algorithms for models with continuous degrees of freedom","2777817":"The Swendsen-Wang process does not always mix rapidly","200744578":"A Learning algorithm for Boltzmann machines","221620547":"Latent Dirichlet Allocation","46620991":"Monte Carlo Methods in Statistical Physics","234898362":"Tabu search part II","221345675":"Sparse Bayesian Learning for Regression and Classification using Markov Chain Monte Carlo.","1869025":"Nonequilibrium Equality for Free Energy Differences","222486588":"Taillard, E.D.: Robust taboo search for the QAP. Parallel Comput. 17, 443-455","221442060":"Iterated robust tabu search for MAX-SAT"},"citedIn":{"275281208":"Sequential Monte Carlo for Maximum Weight Subgraphs with Application to Solving Image Jigsaw Puzzles","51958902":"Self-Avoiding Random Dynamics on Integer Complex Systems"},"index":425}