{"abs":"In this article we consider Bayesian parameter inference associated to partially-observed stochastic processes that start from a set B0 and is stopped or killed at the first hitting time of a known set A. Such processes occur naturally within the context of population genetics [25, 15], statistical analysis of rare events [9, 17, 23], finance [7] and engineering [6, 18, 27]. The associated posterior distributions are highly complex and posterior parameter inference requires the use of advanced Markov chain Monte Carlo (MCMC) techniques. Our approach uses a recently introduced simulation methodology, particle Markov chain Monte Carlo (PMCMC) [1], where sequential Monte Carlo (SMC) [19] approximations are embedded within MCMC. However, when the parameter of interest is fixed, standard SMC algorithms are not always appropriate for many stopped processes. In [11, 16] the authors introduce SMC approximations of multi-level Feynman-Kac formulae, which can lead to more efficient algorithms. This is achieved by devising a sequence of nested sets from B0 to A and then perform the resampling step only when the samples of the process reach intermediate level sets in the sequence. Naturally, the choice of the intermediate level sets is critical to the performance of such a scheme. In this paper, we demonstrate that multi-level SMC algorithms can easily be used as a proposal in PMCMC. In addition, we propose a flexible adaptive strategy that sets the level sets for different parameter proposals. Our methodology is illustrated on the coalescent model with migration.","title":"Parameter inference for stopped processes","id":228665450,"url":"https://www.researchgate.net/publication/228665450_Parameter_inference_for_stopped_processes","names":["Ajay Jasra","Nikolas Kantas"],"references":{"227522317":"Particle Markov Chain Monte Carlo . . .","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","29601545":"Rare event simulation for a static distribution","222297395":"Splitting for rare event simulation: A large deviation approach to design and analysis","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","4993311":"Stopping-time resampling for sequential Monte Carlo methods","4771483":"Wilson IJ, Weale ME, Balding DJ. Inferences from DNA data: population histories, evolutionary processes and forensic match probabilities. J Roy Stat Soc Ser A 166: 155-188","243104744":"Exact Monte Carlo simulation of killed diffusions","245810545":"Coupling and Ergodicity of Adaptive MCMC","11591016":"Coalescence time for two genes from a subdivided population","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","4752593":"Inference in Molecular Population Genetics","1825409":"Sequential monte carlo samplers","12043820":"Efficient, Multiple-Range Random Walk Algorithm to Calculate the Density of States","239052708":"On the Genealogy of Large Populations","3077618":"On large deviations theory and asymptotically efficient Monte Carlo estimation","243104985":"Coupling and ergodicity of adaptive Markov chain Monte Carlo algorithms. J Appl Probab","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","38349665":"Importance sampling on coalescent histories. I","221617758":"An Efficient Sequential Monte Carlo Algorithm for Coalescent Clustering","38349666":"Importance sampling on coalescent histories. II: Subdivided population models","231743804":"Rare event simulation","215446267":"Monte Carlo Strategies in Scientic Computing","240241982":"Simulating Probability Distributions in the Coalescent","51720230":"On the Utility of Graphics Cards to Perform Massively Parallel Simulation of Advanced Monte Carlo Methods","4312757":"Probabilistic reachability analysis for large scale stochastic hybrid systems","2126101":"Genealogical particle analysis of rare events","228779861":"SMC^ 2: A sequential Monte Carlo algorithm with particle Markov chain Monte Carlo updates","226243460":"Quantitative Non-Geometric Convergence Bounds for Independence Samplers","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications"},"citedIn":{},"index":426}