{"abs":"Biogeography-based optimization (BBO) is a new evolutionary optimization method inspired by biogeography. In this paper, BBO is extended to a multi-objective optimization, and a biogeography-based multi-objective optimization (BBMO) is introduced, which uses the cluster attribute of islands to naturally decompose the problem. The proposed algorithm makes use of nondominated sorting approach to improve the convergence ability efficiently. It also combines the crowding distance to guarantee the diversity of Pareto optimal solutions. We compare the BBMO with two representative state-of-the-art evolutionary multi-objective optimization methods, non-dominated sorting genetic algorithm-II (NSGA-II) and archive-based micro genetic algorithm (AMGA) in terms of three metrics. Simulation results indicate that in most cases, the proposed BBMO is able to find much better spread of solutions and converge faster to true Pareto optimal fronts than NSGA-II and AMGA do.","title":"Handling multiple objectives with biogeography-based optimization","id":257705598,"url":"https://www.researchgate.net/publication/257705598_Handling_multiple_objectives_with_biogeography-based_optimization","names":["Hai-Ping Ma","Xie-Yong Ruan","Zhang-Xin Pan","International Journal of Automation and Computing"],"references":{"226082621":"A hybrid genetic algorithm for the traveling salesman problem with pickup and delivery","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","4201669":"MRMOGA: parallel evolutionary multiobjective optimization using multiple resolutions","220740897":"AMGA: An archive-based micro genetic algorithm for multi-objective optimization","2362670":"A Survey of Parallel Genetic Algorithms","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","220314474":"An analysis of the equilibrium of migration models for biogeography-based optimization","224309395":"Biogeography-Based Optimization","255639916":"An Integrated Approach to Biogeography Based Optimization with case based reasoning for retrieving Groundwater Possibility","224301903":"Differential evolution with adaptive parameter setting for multi-objective optimization","3865129":"Unified model for multi-objective evolutionary algorithms with elitism","227153886":"Method of inequalities-based multiobjective genetic algorithm for optimizing a cart-double-pendulum system","3418784":"Handling multiple objectives with particle swarm optimization. IEEE Trans Evol Comp","221228411":"A Micro-Genetic Algorithm for Multiobjective Optimization","221042808":"Equilibrium Species Counts and Migration Model Tradeoffs for Biogeography-Based Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","216300989":"A variant of evolution strategies for vector optimization","2782915":"A Variant of Evolution Strategies for Vector Optimization","220362258":"An adaptive hybrid optimizer based on particle swarm and differential evolution for global optimization","216301719":"A Tutorial on Evolutionary Multiobjective Optimization","40714201":"Biogeography based Satellite Image Classification","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","265432807":"Multiobjective optimization Test Instances for the CEC 2009 Special Session and Competition","224086444":"Biogeography-Based Optimization Combined with Evolutionary Strategy and Immigration Refusal","221008027":"Multi-objective optimization based on self-adaptive differential evolution algorithm","225227796":"Evolutionary multi-objective portfolio optimization in practical context","224086434":"Oppositional Biogeography-Based Optimization","226762616":"Lecture Notes in Computer Science","216457304":"Lecture Notes in Computer Science","224086436":"Biogeography-Based Optimization and the Solution of the Power Flow Problem"},"citedIn":{"273341434":"A cooperative coevolutionary biogeography-based optimizer","278161412":"Ensemble multi-objective biogeography-based optimization with application to automated warehouse scheduling","271817857":"Localized biogeography-based optimization","284745562":"A Modified Biogeography Based Optimization","263812787":"CDNA microarray adaptive segmentation","285808722":"Biogeography-based Optimization Algorithm","275470416":"Time- and Event-Driven Communication Process for Networked Control Systems: A Survey","270959709":"Migration in Biogeography Based Optimization","265513566":"Synergistic effect of hydroquinone bis(di-2-methylphenyl phosphate) and novolac phenol in ABS composites","269578236":"Chaotic biogeography-based optimization approach to target detection in UAV surveillance","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm","291009286":"Solving a fuzzy multi-objective products and time planning using hybrid meta-heuristic algorithm: Gas refinery case study"},"index":437}