{"abs":"Sequential Monte Carlo (SMC) methods are a general class of techniques to sample approximately from any sequence of probability distributions. These distributions are approximated by a cloud of weighted samples which are propagated over time using a combination of importance sampling and resampling steps. This article is concerned with the convergence analysis of a class of SMC methods where the times at which resampling occurs are computed on-line using criteria such as the effective sample size. This is a popular approach amongst practitioners but there are very few convergence results available for these methods. It is shown here that these SMC algorithms correspond to a particle approximation of a Feynman-Kac flow of measures on adaptive excursion spaces. By combining a non-linear distribution flow analysis to an original coupling technique, we obtain functional central limit theorems and uniform exponential concentration estimates for these algorithms. The original exponential concentration theorems presented in this study significantly improve previous concentration estimates obtained for SMC algorithms.","title":"On Adaptive Resampling Procedures for Sequential Monte Carlo Methods","id":29607955,"url":"https://www.researchgate.net/publication/29607955_On_Adaptive_Resampling_Procedures_for_Sequential_Monte_Carlo_Methods","names":["Pierre Del Moral","Arnaud Doucet","Ajay Jasra","Bernoulli"],"references":{"246868822":"Monte Carlo Methods in Scienti/c Computing","2340098":"Measure Valued Processes and Interacting Particle Systems. Application to Non Linear Filtering Problems","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","227513442":"Inference for Lévy Driven Stochastic Volatility Models Via Adaptive Sequential Monte Carlo","1913298":"Adaptive methods for sequential importance sampling with application to state space models","200744518":"Sequential Monte-Carlo Methods in Practice","41222435":"Monte Carlo Statistical Method","1871781":"Equilibrium free-energy differences from nonequilibrium measurements: A master-equation approach","228721976":"Limit theorems for weighted samples with applications to Sequential Monte Carlo Methods","226242182":"Nonequilibrium Measurements of Free Energy Differences for Microscopically Reversible Markovian Systems","1825409":"Sequential monte carlo samplers","2590205":"Sequential Monte Carlo Methods for Dynamic Systems","243767612":"Blind Deconvolution via Sequential Imputations","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","1848003":"Equilibrium Sampling From Nonequilibrium Dynamics","228370915":"Some recent improvements to importance splitting"},"citedIn":{"48174175":"Particle Approximation of the Intensity Measures of a Spatial Branching Point Process Arising in Multitarget Tracking","261058377":"Bayesian model comparison via path-sampling sequential Monte Carlo","228623464":"A Tutorial on Particle Filtering and Smoothing: Fifteen Years Later","47373275":"Quantitative approximations of evolving probability measures and\nsequential Markov Chain Monte Carlo methods","44105450":"On the Robustness of the Snell Envelope","220405613":"Real Time Pedestrian Tracking Using Thermal Infrared Imagery","45919917":"Sequential Monte Carlo Methods for Option Pricing","41953425":"Particle approximations of a class of branching distribution flows arising in multi-target tracking","258062774":"Computational Methods for a Class of Network Models","251572521":"Quantifying the uncertainty in change points","267010418":"On the Foundations and the Applications of Evolutionary Computing","233810033":"Feynman-Kac Particle Integration with Geometric Interacting Jumps","221727765":"Phylogenetic Inference via Sequential Monte Carlo","269417068":"A Stable Particle Filter in High-Dimensions","278005943":"Parameters estimation for jump-diffusion process based on low and high frequency data","221659088":"Inference for a Class of Partially Observed Point Process Models","263281113":"Divide-and-Conquer with Sequential Monte Carlo","50425579":"On the Stability of Sequential Monte Carlo Methods in High Dimensions","266541321":"Stochastic models and methods. An introduction with applications","234000706":"An introduction to particle methods in finance","265118463":"An Introduction to Particle Methods with Financial Applications","225404508":"Filtering via approximate Bayesian computation","271430104":"Novel SLAM algorithm for UGVs based BBO-CEPF","228862739":"Some Issues and Results on the EnKF and Particle Filters for Meteorological Models","231609337":"Efficient learning in ABC algorithms","262383706":"Modal parameter estimation using interacting Kalman filter","225045394":"A Bayesian Mixture of Lasso Regressions with t-Errors","51962726":"Error Bounds and Normalizing Constants for Sequential Monte Carlo in\nHigh Dimensions","241707670":"Optimisation of interacting particle systems for rare event estimation"},"index":440}