{"abs":"In this talk, fitness assignment in multiobjective evolutionary algorithms is interpreted as a multi-criterion decision process. A suitable decision making framework based on goals and priorities is formulated in terms of a relational operator, characterized, and shown to encompass a number of simpler decision strategies, including constraint satisfaction, lexicographic optimization, and a form of goal programming. Then, the ranking of an arbitrary number of candidates is considered, and the ef- fect of preference changes on the cost surface seen by an evolutionary algorithm is illustrated graphically for a simple problem. The formulation of a multiobjective genetic algorithm based on the pro- posed decision strategy is also discussed. Niche formation techniques are used to promote diversity among preferable candidates, and progressive articulation of preferences is shown to be possible as long as the genetic algorithm can recover from abrupt changes in the cost landscape. Finally, an application to the optimization of the low-pressure spool speed governor of a Pegasus gas turbine engine is described, which il- lustrates how a technique such as the Multiobjective Genetic Algorithm can be applied, and exemplifies how design requirements can be refined as the algorithm runs. The two instances of the problem studied demonstrate the need for pref- erence articulation in cases where many and highly competing objectives lead to a non-dominated set too large for a finite population to sample ef- fectively. It is shown that only a very small portion of the non-dominated set is of practical relevance, which further substantiates the need to sup- ply preference information to the GA.","title":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","id":221025610,"url":"https://www.researchgate.net/publication/221025610_Multiobjective_Optimization_and_Multiple_Constraint_Handling_with_Evolutionary_Algorithms_A_Unified_Formulation","names":["Carlos M. Fonseca","Peter J. Fleming"],"references":{"3411845":"Multi-Objective Optimization and Multiple Constraint Handling with Evolutionary Algorithms – Part II: A Unified Formulation","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37"},"citedIn":{"4294209":"Multi-objective Optimal Control: An Overview","220445475":"ARQ-based cross-layer optimization for wireless multicarrier transmission on cognitive radio networks","224178523":"Towards real-time microgrid power management using computational intelligence methods","50435849":"Agent Negotiation of Target Distribution Enhancing System Survivability","216301293":"Liew, K.: A Swarm Metaphor for Multiobjective Design Optimization. Engineering Optimization 34, 141-153","221252921":"A Novel Multiobjective Evolutionary Algorithm Based on Min-Max Strategy","224601962":"Genetic algorithms and treatment of multiple objectives in the allocation of capacitor banks in an electric power distribution system","222432072":"A novel hybrid model for portfolio selection","224333141":"A Jumping Genes Paradigm: Theory, Verification and Applications","232619478":"A Model and Methodology for Composition QoS Analysis of Embedded Systems","224301904":"Performance assessment of Generalized Differential Evolution 3 (GDE3) with a given set of problems","224324430":"Multiobjective Evolutionary Algorithm Based on the Pareto Archive and Individual Migration","239386709":"Tensegrity Active Control: Multiobjective Approach","265401796":"MULTIOBJECTIVE PARTICLE SWARM OPTIMIZATION: INTEGRATION OF DYNAMIC POPULATION AND MULTIPLE-SWARM CONCEPTS AND CONSTRAINT HANDLING","37413423":"Scalable intelligent electronic catalogs","220742461":"Multicriteria Network Design Using Evolutionary Algorithm","228644280":"A Hybrid Evolutionary Approach to Solve Multi-objective Optimization Problems based on Particle Swarm Optimizer and Genetic Algorithm","271401524":"A Multi-Objective Evolutionary Algorithm Using Min-Max Strategy And Sphere Coordinate Transformation","220380930":"On-line genetic design of anti-windup unstructured controllers for electric drives with variable load.","47157999":"Multi-objective optimal chemotherapy control model for cancer treatment","290433391":"Multi-Objective Optimal Power Management in Microgrids: A Comparative Study","238523926":"Multi-objective optimization using genetic algorithm: Applications to imperfect preventive maintenance model","221008143":"Progressive diversity management in evolutionary multiobjective optimisation.","272910433":"Bacterial Foraging Optimization Robust-RED for AQM/TCP Network","263193493":"Robustness considerations in multi-objective optimal design","4375140":"A Multi-Objective Pareto-Optimal Solution to the Box-Pushing Problem by Mobile Robots","262405508":"On Set-Based Multiobjective Optimization","235085866":"Multi-Objective Optimization for Speed and Stability of a Sony AIBO Gait","266162162":"A HYBRID SYSTEM OSCILLATOR FOR MULTIOBJECTIVE SUPPLIER SELECTION PROBLEM","2425878":"Constrained Multiobjective Optimization by Evolutionary Algorithms","222865788":"Multi-objective meta-heuristics: An overview of the current state-of-the-art","259982663":"Pre-emption strategies for efficient multi-objective optimization: Application to the development of Lake Superior regulation plan","2446876":"MOBES: A Multiobjective Evolution Strategy for Constrained Optimization Problems","7801930":"On the use of multi-objective evolutionary algorithms for the induction of fuzzy classification rule systems. Biosystems","220549914":"Nonlinear identification of aircraft gas-turbine dynamics","221951355":"Hard handoff minimization using genetic algorithms","234102192":"Multivariable pid-controller design for a gasifier plant using penalty-based-multi-objective ga","224090396":"Design Optimization of a Delta-Like Parallel Robot through Global Stiffness Performance Evaluation","237897317":"Multi-objective optimisation of systems architectures for distributed aero-engine control systems","228739058":"Application of Genetic Algorithm for Solving Multi-Objective Optimization Problems in Robust Control of Distillation Column","221392742":"PSFGA: A Parallel Genetic Algorithm for Multiobjective Optimization.","235710041":"Multiobjective Optimization Using Surrogates","222703889":"A hybrid genetic algorithm and bacterial foraging approach for global optimization. Inf Sci","251965277":"A genetic-based optimization for multi-depot vehicle routing problems","281319065":"Intelligent multi-objective control and management for smart energy efficient buildings","220691833":"Introduction to Genetic Algorithms","257928961":"Securing interpretability of fuzzy models for modeling nonlinear MIMO systems using a hybrid of evolutionary algorithms","34202198":"Die Anwendung von Evolutionsstrategien zur adaptiven, echtzeitfähigen Trajektorienplanung von Manipulatorarmsystemen [Elektronische Ressource] /","226945511":"Multiobjective Prioritization in the Analytic Hierarchy Process by Evolutionary Computing","237249094":"SEEA FOR MULTI-OBJECTIVE OPTIMIZATION: REINFORCING ELITIST MOEA THROUGH MULTI-PARENT CROSSOVER, STEADY ELIMINATION AND SWARM HILL CLIMBING","236341365":"On the Performance Comparison of Multiobjective Evolutionary UAV Path Planners","270573127":"Robust H ∞ Controller Design for Aircraft Lateral Dynamics using Multi-objective Optimization and Genetic Algorithms","269301861":"Adaptive Decision-Making Scheme for Cognitive Radio Networks","267976592":"SELECTION OF SOLUTIONS IN A MULTI-OBJECTIVE ENVIRONMENT: POLYMER EXTRUSION A CASE STUDY","233302414":"An orthogonal design based constrained evolutionary optimization algorithm","226138384":"Evolutionary Multi-Objective Optimization: A Critical Review","230855593":"Genetic Programming, 7th European Conference, EuroGP2004, Coimbra, Portugal, April 5-7, 2004, Proceedings","245193969":"Neural network and genetic algorithms for optimizing the plate element of Egyptian research reactor problems","268256656":"An Improved Multi-Objective Evolutionary Algorithm with Adaptable Parameters","221559129":"A Hybrid Multi-objective Evolutionary Algorithm for the Uncapacitated Exam Proximity Problem","220350285":"Skyline queries with constraints: Integrating skyline and traditional query operators","225385758":"A parallel global-local mixed evolutionary algorithm for multimodal function optimization based on domain decomposition","225792262":"Design of Poiseuille flow controllers using the method of inequalities","257909547":"Optimizing Coverage Performance of Multiple Random Path-planning Robots","277295345":"Evolutionary Algorithms: Overview, Methods and Operators.” Documentation for: Genetic Evolutionary Algorithm Toolbox for Use with Matlab version: toolbox 1.92 documentation 1.92","283193499":"Solving a multi-objective dynamic stochastic districting and routing problem with a co-evolutionary algorithm","267971975":"Constrained Optimization of Rotor-Bearing Systems by Evolutionary Algorithms","287479645":"AI techniques for hydrological modeling and management. II: Optimization","226979079":"Multi-Objective Optimization Using Surrogates","222663110":"Multi-objective optimal design of groundwater remediation systems: application of the Niched Pareto Genetic Algorithm (NPGA)","220176795":"Multi-objective self-adaptive differential evolution with elitist archive and crowding entropy-based diversity measure. Soft Comput Fusion Found Method Appl","282530911":"Many-Objective Evolutionary Algorithms","262398762":"Enhanced multi-objective optimization algorithm for renewable energy sources: Optimal spatial development of wind farms","3217595":"A Study on the Discovery of Relevant Fuzzy Rules Using Pseudobacterial Genetic Algorithm","229005101":"Weather Based Power Dispatch Study Using GA","4340425":"Cognitive Radio Testbed: Exploiting Limited Feedback in Tomorrow\u0027s Wireless Communication Networks","267241312":"Application of Artificial Intelligence to Wireless Communications","227290369":"Coordinating optimization-based sliding mode variable structure control for electro-hydraulic servo system","268163956":"A novel preference articulation operator for the Evolutionary Multi-Objective Optimisation of classifiers in concealed weapons detection","3854506":"Teleoperation controller design using hierarchical genetic algorithm","221007295":"Preference incorporation to solve many-objective airfoil design problems","224292810":"Comparison of the Effectiveness of Different Cost Functions in Global Optimization Techniques","264050473":"Shape optimization and material gradient design of the sharp hot structure","12473892":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","4223194":"Optimal Placement for Opportunistic Cameras Using Genetic Algorithm","3418799":"On-Line Genetic Design of Anti-Windup Unstructured Controllers for Electric Drives With Variable Load","221228466":"Applications of a Multi-objective Genetic Algorithm to Engineering Design Problems","216300612":"Many-Objective Optimization: An Engineering Design Perspective","263541015":"Estimation of Distribution Algorithms based Unmanned Aerial Vehicle Path Planner Using a New Coordinate System.","256733673":"Multi-objective optimization of the sandwich panels with prismatic cores using genetic algorithms","267325768":"de2008evolutionary","220118967":"Designing feedforward command shapers with multi-objective genetic optimisation for vibration control of a single-link flexible manipulator","220637580":"Evolving Dynamic Multi-Objective Optimization Problems with Objective Replacement","268572333":"Robust structural design of a simplified jet engine model, using Multiobjective optimization","216457303":"Indicator-Based Selection in Multiobjective Search","250810946":"A Survey of Constraint-Handling Techniques Based on Evolutionary Multiobjective Optimization","226064331":"Parallel Evolutionary Multiobjective Optimization","254238612":"A VERSATILE TOOLBOX FOR SOLVING INDUSTRIAL PROBLEMS WITH SEVERAL EVOLUTIONARY TECHNIQUES","216457298":"A portfolio optimisation approach to selection in multi-objective evolutionary algorithms","221144987":"Coordination Optimization-based Variable Structure Control for Main Steam Pressure of Power Plant.","277769272":"Weapon Release Scheduling from Multiple-Bay Aircraft using Multi-Objective Evolutionary Algorithms","265891680":"Mechanical Engineers\u0027 Handbook: Energy and Power, Volume 4, Third Edition","223363051":"Prediction of building\u0027s temperature using neural networks models","228926745":"Genetic Algorithms for Optimization of Building Envelopes and the Design and Control of HVAC Systems","220204512":"Supply Estimation Using Coevolutionary Genetic Algorithms in the Spanish Electrical Market","227027273":"A Tabu-Based Exploratory Evolutionary Algorithm for Multiobjective Optimization","220696037":"Advances in Evolutionary Algorithms: Theory, Design and Practice.","257580959":"Optimizing bi-objective imperfect preventive maintenance model for series-parallel system using established hybrid genetic algorithm","225859507":"Leader identification and leader selection: Its effect on a swarm\u0027s performance for multi-objective design optimization problems","250888754":"Multi-criteria design methodology of a dielectric resonator antenna with jumping genes evolutionary algorithm","4201607":"A constrained optimization evolutionary algorithm based on multiobjective optimization techniques","51411927":"ChemInform Abstract: Evolving Interpretable Structure—Activity Relationship Models. Part 2. Using Multiobjective Optimization to Derive Multiple Models","260622144":"Multiobjective Evolutionary Algorithms in Aeronautical and Aerospace Engineering","221228517":"A Comparative Study of Progressive Preference Articulation Techniques for Multiobjective Optimisation","275072681":"An Improved Differential Evolution Method Based on the Dynamic Search Strategy to Solve Dynamic Economic Dispatch Problem with Valve-Point Effects","225504160":"Constraint handling in evolutionary search: A case study of the frequency assignment","237009136":"Progressive Multi-Objective Optimization","223464835":"A multi-objective genetic programming approach to developing Pareto optimal decision trees","2242801":"A New Approach for the Solution of Multiple Objective Optimization Problems Based on Reinforcement Learning","220133323":"Direct Multisearch for Multiobjective Optimization","3996394":"Causality assignment using multi-objective evolutionary algorithms","220356084":"Resource Management In Wideband CDMA Systems Using Genetic Algorithms.","224453558":"An optimized variable structure control for hydraulic AGC of cold rolling mill","256503185":"24 Genetic algorithms in radiotherapy","259634081":"Sail-assisted motor vessels weather routing using a fuzzy logic model","265408780":"Techniques to Deal with Many-objective Optimization Problems Using Evolutionary Algorithms","224301953":"Ranking-Dominance and Many-Objective Optimization","256934832":"Elasto-geometrical modeling and calibration of robot manipulators: Application to machining and forming applications","266863886":"APPLICATION OF EVOLUTIONARY COMPUTATION TO OPEN CHANNEL FLOW MODELLING","245331065":"Hybrid approach for genetic algorithm and Taguchi\u0027s method based design optimization in the automotive industry","276145308":"A Practical Review on the Application of Constraint Handling Strategies in Evolutionary Computation from an Engineering Point of View","281072175":"Multiobjective Design Optimization using Nash Games","229029205":"An operation system for industrial processes: Application to a glass furnace","256938915":"Development of optimal fuzzy models for predicting the strength of intact rocks","224058284":"Concurrent Optimization for Parameters of Powertrain and Control System of Hybrid Electric Vehicle Based on Multi-Objective Genetic Algorithms","221167064":"On the Use of Multi-Objective Optimization Algorithms for Solving the Impairment Aware-RWA Problem.","220313561":"Multi-criteria genetic optimisation of the manoeuvres of a two-stage launcher","224177573":"An Interactive Territory Defining Evolutionary Algorithm: iTDEA","260636017":"Multi-Objective Parameter Optimization in Support Vector Regression: General Formulation and Application to the Retrieval of Soil Moisture From Remote Sensing Data","222175685":"Availability allocation and multi-objective optimization for parallel–series systems","221532617":"Solar radiation prediction using RBF Neural Networks and cloudiness indices.","257580964":"A polar-based guided multi-objective evolutionary algorithm to search for optimal solutions interested by decision-makers in a logistics network design problem","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm","291843994":"Design on a Composite Mobile System for Exploration Robot","3928890":"Evolutionary algorithm with dynamic population size for multi-objective optimization","263329968":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons","2324768":"Constraint Handling in Evolutionary Search: A Case Study of the Frequency Assignment","50418180":"Simultaneous Optimization for Hybrid Electric Vehicle Parameters Based on Multi-Objective Genetic Algorithms","225130083":"EFuNN Ensembles Construction Using a Clustering Method and a Coevolutionary Multi-objective Genetic Algorithm","247153072":"Crossing the Reality Gap: a Short Introduction to the Transferability Approach","224677994":"Autonomous Robot Failure Recognition Design using Multi-Objective Genetic Programming","233238772":"A comprehensive preference-based optimization framework with application to high-lift aerodynamic design","3418912":"A Multiobjective Optimization-Based Evolutionary Algorithm for Constrained Optimization","220741181":"An efficient multi-objective evolutionary algorithm with steady-state replacement model","240523075":"Application of smart system to textile industry: Preliminary design of a smart hanger for garment inspection","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","267946223":"PRELIMINARY ANALYSIS OF MULTI-OBJECTIVE GENETIC ALGORITHM APPLICATION FOR MULTIRESERVOIR SYSTEM","265916622":"Fuel Consumption Minimization Procedure of Sail-assisted Motor Vessel based on a Systematic Meshing of the Explored Area","220462651":"Setup coordination between two stages of a production system: A multi-objective evolutionary approach","202255127":"The Multi-objective Variable Metric Evolution Strategy, Part I","4094244":"Evolutionary programming based on uniform design with application to multiobjective optimization","224598141":"Multiarea optimal power flow using multiobjective evolutionary Algorithm","265994949":"Multi-objective Optimization for Scheduling Elective Surgical Patients at the Health Sciences Centre in Winnipeg","224560253":"Multi-Objective Optimization of a Port-of-Entry Inspection Policy","223110253":"Optimization of building thermal design and control by multi-criterion genetic algorithm","221228555":"Steady-State Selection and Efficient Covariance Matrix Update in the Multi-objective CMA-ES","222533221":"Optimal fuzzy multi-criteria expansion of competence sets using multi-objectives evolutionary algorithms","222157845":"On-line evolution of robust control systems: An industrial active magnetic bearing application","226025552":"Multi-objective Optimisation of a Hybrid Electric Vehicle: Drive Train and Driving Strategy","238522654":"Multi-objective Fuzzy Mutative Scale Chaos Optimization Algorithm and Application","260586149":"Controller Tuning by Means of Multi-Objective Optimization Algorithms: A Global Tuning Framework","221469726":"The Influence of Different Cost Functions in Global Optimization Techniques","282610677":"Many-Objective Problems: Challenges and Methods","220776473":"Multi-objective Optimization Using BFO Algorithm","239014157":"THE MULTI-CRITERION OPTIMIZATION OF BUILDING THERMAL DESIGN AND CONTROL","220742172":"Multiobjective network design for realistic traffic models","238720780":"Multi-Objective Swarm Intelligent Systems - Theory \u0026 Experiences","221352966":"Creating personalized documents: An optimization approach","272408331":"Generic Constraints Handling Techniques in Constrained Multi-criteria Optimization and its Application","249071584":"Optimization with Genetic Algorithms of a Gas Turbine Cycle with H2-Separating Membrane Reactor for CO2 Capture","224055904":"Application of multiobjective genetic algorithms in anatomy based dose optimization in brachytherapy and its comparation with deterministic algorithms","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","224258658":"Assessing Visual Quality of 3-D Polygonal Models","277972946":"Compromise Rank Genetic Programming for Automated Nonlinear Design of Disaster Management","4201733":"Evolutionary multiobjective optimization with a segment based external memory support for the multiobjective quadratic assignment problem","262304999":"Including preferences into a multiobjective evolutionary algorithm to deal with many-objective engineering optimization problems","251507131":"Multiobjective Strategies for New Product Development in the Pharmaceutical Industry","279750634":"Path Planning for Single Unmanned Aerial Vehicle by Separately Evolving Waypoints","226589894":"Multiobjective Particle Swarm Optimization for Optimal Power Flow Problem","220741729":"Interactive evolutionary multi-objective optimization and decision-making using reference direction method","264427657":"An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point Based Nondominated Sorting Approach, Part II: Handling Constraints and Extending to an Adaptive Approach","221415038":"A Fast and Elitist Multi-objective Particle Swarm Algorithm: NSPSO","4266252":"Urban Transport planning for ubiquitous environments","228552913":"“Application of Multiobjective Optimization In Chemical Engineering","224133138":"A Territory Defining Multiobjective Evolutionary Algorithms and Preference Incorporation","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","279169516":"Multiobjective Particle Swarm Optimization Based on PAM and Uniform Design","220665975":"Linear matrix inequalities and evolutionary optimization in multiobjective control","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","223454721":"A dominance tree and its application in evolutionary multi-objective optimization","220514421":"Constraint-handling in nature-inspired numerical optimization: past, present and future. Swarm Evol Comput","220119116":"Particle swarm optimisation of interplanetary trajectories from Earth to Jupiter and Saturn","222312468":"Suman, B.: Study of self-stopping PDMOSA and performance measure in multiobjective optimization. Comput. Chem. Eng. 29(5), 1131-1147","29826719":"Die Anwendung von Evolutionsstrategien zur adaptiven, echtzeitfähigen Trajektorienplanung von Manipulatorarmsystemen","6758207":"Combining Genetic Algorithms and Lyapunov-Based Adaptation for Online Design of Fuzzy Controllers","289520152":"A Posteriori Pareto Front Diversification Using a Copula-Based Estimation of Distribution Algorithm","267998882":"Title: MULTIOBJECTIVE OPTIMIZATION MODELS AND SOLUTION METHODS FOR PLANNING LAND DEVELOPMENT USING MINIMUM SPANNING TREES, LAGRANGIAN RELAXATION AND DECOMPOSITION TECHNIQUES","4204828":"Resource placement in content delivery networks using hybrid genetic algorithm","268372640":"Improved Clustering and Soft Computing Algorithms","271517552":"Parallel Genetic Algorithm Model to Extract Association Rules","254891609":"Poiseuille Flow Controller Design via the Method of Inequalities","267488923":"Multi-Objective Optimization in Industrial Robotic Cell Design","268059793":"Solar Cell Parameter Identification Using Genetic Algorithms","2768198":"F1.12: Multicriteria Decision Making and Evolutionary Computation","220728389":"Improved NSGA-II Algorithm for Optimization of Constrained Functions","269567359":"Benefits of Incorporating Designer Preferences Within a Multi-Objective Airfoil Design Framework","225361951":"Kolmogorov-Chaitin complexity of digital controller implementations","262541015":"Fluxo de potência ótimo descentralizado utilizando algoritmos evolutivos multiobjetivo","225954820":"A Study on Distribution Preservation Mechanism in Evolutionary Multi-Objective Optimization","260211956":"A multi-objective hyper-heuristic based on choice function","223792672":"A decision support system for the electrical power districting problem","220200038":"Hybrid GA-BF based intelligent PID controller tuning for AVR system","223326770":"Solution to the Shell standard control problem using genetically tuned PID controllers","222691384":"A hybrid multi-objective evolutionary algorithm for solving truck and trailer vehicle routing problems. Eur J Oper Res","228584672":"A Survey of Multiobjective Optimization in Engineering Design","242752507":"Control system design of reverse osmosis plants by using advanced optimization techniques","259150582":"I. Kacem, S. Hammadi, P. Borne, Pareto-optimality Approach for Flexible Job-shop Scheduling Problems: Hybridization of Evolutionary Algorithms and Fuzzy Logic. Mathematics and Computers in Simulation 2002, 60, 245-276.","46491456":"Interactive evolutionary multi-objective optimization for quasi-concave preference functions","5474778":"Clustering and co-evolution to construct neural network ensembles: An experimental study","4074932":"A new multiobjective evolutionary algorithm: OMOEA","220380846":"Neighborhood Knowledge-Based Evolutionary Algorithm for Multiobjective Optimization Problems","251915918":"Multi-objective genetic algorithm based developing audio watermarking technique","220741287":"A tunable model for multi-objective, epistatic, rugged, and neutral fitness landscapes","228800561":"Multiobjective Genetic Algorithms for Solving the Impairment-Aware Routing and Wavelength Assignment Problem","3810217":"Distributed genetic algorithms with a new sharing approach in multiobjective optimization problems","222329043":"Distribution-based adaptive bounding genetic algorithm for continuous optimisation problems","226202344":"Bond Graph Causality Assignment and Evolutionary Multi-Objective Optimization","222522071":"Multi-Objective Optimization of Membrane Separation Modules Using Genetic Algorithm","244358918":"Performance Assessment for Iterative Learning Control of Batch Units","220215479":"Dynamic diversity control in genetic algorithm for mining unsearched solution space in TSP problems","223341269":"Robustness analysis of a reusable launch vehicle flight control law","27812403":"Strategies for multiobjective genetic algorithm development: Application to optimal batch plant design in process systems engineering","263089202":"Searching for Pareto-optimal solutions through dimensionality reduction for certain large-dimensional multi-objective optimization problems","221008562":"Solving Constrained Multi-Criteria Optimization Tasks Using Elitist Evolutionary Multi-Agent System","220289727":"Balancing exploration and exploitation with adaptive variation for evolutionary multi-objective optimization","220200125":"Multiobjective network topology design","282816889":"A Critical Approach for Evolution Analysis in Regenerative Developments","224697031":"Optimization of Position Control of Induction Motors using Compact Genetic Algorithms","251986593":"Robust multi-objective control for systems involving human-in-the-loop passivity constraints with application to Electric power steering","287992462":"Multi-Objective Adaptive Surrogate Modeling-Based Optimization for Parameter Estimation of Large, Complex Geophysical Models","261454384":"Robust H∞ controller design for distillation column based on multi-objective optimization and genetic algorithms","259523295":"Dynamic security consideration in multiobjective electricity markets","220341898":"Multi-objective optimization of operational variables in a waste incineration plant","222832868":"Dynamic systems modelling using genetic programming","220403343":"Effects of diversity control in single-objective and multi-objective genetic algorithms","278051135":"Multi-objective optimal design of hybrid renewable energy systems using preference-inspired coevolutionary approach","221007516":"Rotation and Translation Selective Pareto Optimal Solution to the Box-Pushing Problem by Mobile Robots Using NSGA-II","3411845":"Multi-Objective Optimization and Multiple Constraint Handling with Evolutionary Algorithms – Part II: A Unified Formulation","3419014":"An Adaptive Tradeoff Model for Constrained Evolutionary Optimization","220548243":"Genetic algorithm-based scheduling in cognitive radio networks under interference temperature constraints","265919086":"Multi-Objective Optimization of Motor Vessel Route","266749521":"Improved multi-objective particle swarm optimization with preference strategy for optimal DG integration into the distribution system","4913650":"A bi-objective genetic algorithm approach to risk mitigation in project scheduling","3454857":"Nonlinear tuning of aircraft controllers using genetic global optimization: A new periodic mutation operator","222414588":"Floor shape optimization for green building design","3419017":"A Jumping Gene Paradigm for Evolutionary Multiobjective Optimization","220739735":"Performance analysis of multiobjective bio-inspired UAV path planners","277291832":"Evolutionary Computation Group","262333469":"Optimization Methodologies for Building Performance Modelling and Optimization","223171725":"A novel multi-objective optimization method based on an approximation model management technique","220119258":"Multi-objective genetic algorithms: A way to improve the convergence rate","49640241":"Gaboxadol has affinity for the proton-coupled amino acid transporter 1, SLC36A1 (hPAT1)-A modelling approach to determine IC50 values of the three ionic species of gaboxadol","35945441":"Optimisation of time domain controllers for supply ships using genetic algorithms and genetic programming /","222687874":"Evolving car designs using model-based automated safety analysis and optimisation techniques","220045525":"Control systems design: a new framework","224645801":"Preference Incorporation in Multi-objective Evolutionary Algorithms: A Survey","224472234":"Performance Assessment of Generalized Differential Evolution 3 with a Given Set of Constrained Multi-Objective Test Problems","258160302":"A generalized computing paradigm based on artificial dynamic models for mathematical programming","223510173":"Evolutionary approaches to the design and organization of manufacturing systems","258379955":"Solving Multiobjective Optimization Problems Using Artificial Bee Colony Algorithm","272163821":"Genetic algorithm for solving bi-objective redundancy allocation problem with k-out-of-n subsystems","259524769":"Improving the non-dominated sorting genetic algorithm using a gene-therapy method for multi-objective optimization","271522291":"Development of extremely low energy dwellings through life cycle optimization","280237929":"Development of Pareto-based evolutionary model integrated withdynamic goal programming and successive linear objective reduction","3455466":"Evolutionary multi-objective optimization: A historical view of the field","260995152":"Objective space partitioning using conflict information for solving many-objective problems","283954482":"Load Sharing Multiobjective Optimization Design of a Split Torque Helicopter Transmission","4181472":"Research on A New Multiobjective Combinatorial Optimization Algorithm","220200128":"A multi-objective endocrine PSO algorithm and application","45868377":"Techniques for Highly Multiobjective Optimisation: Some Nondominated Points are Better than Others","245310845":"Suman, B.: Simulated annealing based multiobjective algorithm and their application for system reliability. Eng. Optim. 35(4), 391-416","245382468":"Life Cycle Optimization of Extremely Low Energy Dwellings","273525673":"Optimization of Cellular Automata Model for the Heating of Dual-Phase Steel by Genetic Algorithm and Genetic Programming","224349880":"Jumping gene genetic algorithm and its applications in controller design","263089219":"Searching for Pareto-optimal solutions through dimensionality reduction for certain large-dimensional multi-objective optimization problems","282570552":"A Bayesian approach to constrained single- and multi-objective optimization","228632655":"Life cycle optimization of extremely low energy buildings","224349871":"Using a Genetic Algorithm to obtain a neural network-based model of a real autonomous vehicle","283835674":"Preference-Based Multiobjective Particle Swarm Optimization for Airfoil Design","250158360":"SENSITIVITY ANALYSIS IN PARETO OPTIMAL DESIGN","228598868":"HIGH NONLINEAR INCREMENTAL CONTROL OF A SOLAR THERMAL POWER PLANT USING SOFT COMPUTING FUZZY TUNING TECHNIQUES","4201396":"A hybrid multi-objective evolutionary algorithm using an inverse neural network for aircraft control system design","260652156":"Hybrid Training Method for MLP: Optimization of Architecture and Training","250417435":"FINDING ROBUST SOLUTIONS TO MULTI-OBJECTIVE OPTIMISATION PROBLEMS USING POLYNOMIAL CHAOS","8608117":"An Orthogonal Multi-objective Evolutionary Algorithm for Multi-objective Optimization Problems with Constraints","225693828":"Meta-PSO for multi-objective EM problems","4375995":"Convergence Properties of E-Optimality Algorithms for Many Objective Optimization Problems","221008086":"Delta-V genetic optimisation of a trajectory from Earth to Saturn with fly-by in Mars","222534332":"Multi-objective Optimization using Genetic Algorithms: a Tutorial","220558554":"An adaptive decision maker for constrained evolutionary optimization"},"index":444}