{"abs":"We consider a general fingerprinting problem of digital data under which coalitions of users can alter or erase some bits in their copies in order to create an illegal copy. Each user is assigned a fingerprint which is a word in a fingerprinting code of size M (the total number of users) and length n. We present binary fingerprinting codes secure against size-t coalitions which enable the distributor (decoder) to recover at least one of the users from the coalition with probability of error exp(-Ω(n)) for M\u003dexp(Ω(n)). This is an improvement over the best known schemes that provide the error probability no better than exp(-Ω(n2/)) and for this probability support at most exp(O(n2/)) users. The construction complexity of codes is polynomial in n. We also present versions of these constructions that afford identification algorithms of complexity poly(n)\u003dpolylog(M), improving over the best previously known complexity of Ω(M). For the case t\u003d2, we construct codes of exponential size with even stronger performance, namely, for which the distributor can either recover both users from the coalition with probability 1-exp(Ω(n)), or identify one traitor with probability 1.","title":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","id":3084692,"url":"https://www.researchgate.net/publication/3084692_Digital_fingerprinting_codes_Problem_statements_constructions_identification_of_traitors","names":["Alexander Barg","G. R. Blakley","Grigory Kabatiansky","IEEE Transactions on Information Theory"],"references":{"220337248":"Efficient Traitor Tracing Algorithms using List Decoding.","222669638":"Secure frameproof codes, key distribution patterns, group testing algorithms and related structures","3080362":"Combinatorial properties of frameproof and traceability codes","2995754":"The theory of error-correcting codes","220080921":"A Hypergraph Approach to the Identifying Parent Property: The Case of Multiple Parents","242873526":"Separation systems","3785000":"Improved decoding of Reed-Solomon and algebraic-geometric codes","3045240":"Universal Single Transition Time Asynchronous State Assignments","245005516":"Improvement in the separation of liquids of heterogenous systems","3079606":"Collusion-secure fingerprinting for digital data","226762264":"Efficient Traitor Tracing Algorithms Using List Decoding","3080498":"A low-complexity algorithm for the construction of algebraic-geometric codes better than the Gilbert-Varshamov bound","222076897":"On Codes with the Identifiable Parent Property","222619673":"A Class of I.p.p. Codes With Efficient Identification","37989212":"List decoding of error-correcting codes","220533124":"Separating Partition Systems and Locally Different Sequences","220579776":"Concatenated Codes","239659309":"Concatenated codes and their multilevel generalizations","3080073":"Tracing Traitors","3079881":"Improved Decoding of Reed-Solomon and Algebraic-Geometry Codes","258239683":"The Theory of Error-Correcting Codes, Part I","223373435":"Intersecting codes and partially identifying codes","239062409":"Decoding AG-codes beyond half the minimum distance","220681180":"Combinatorial properties of frameproof and traceability codes.","221355021":"Fingerprinting Long Forgiving Messages"},"citedIn":{"251956736":"Robust parent-identifying codes","241630817":"Use of turbo codes with low-rate convolutional constituent codes in fingerprinting scenarios","242370170":"Binary Collusion-Secure Codes: Comparison and Improvements","220905508":"Fingerprinting Concatenated Codes with Efficient Identification","220242990":"An Efficient 2-Secure and Short Random Fingerprint Code and Its Security Evaluation","3338791":"Soft-decision tracing in fingerprinted multimedia content","4304724":"Image Restoration Using Gaussian Particle Filters","224174409":"A Family of Asymptotically Good Binary Fingerprinting Codes","238009402":"Document Tracking - On the Way to a New Security Service","220240182":"Fingerprinting Codes for Internet-Based Live Pay-TV System Using Balanced Incomplete Block Designs","224379977":"Fingerprinting With Minimum Distance Decoding","224602229":"High-Rate Random-Like Spherical Fingerprinting Codes With Linear Decoding Complexity","221523758":"Fingerprinting Schemes. Identifying the Guilty Sources Using Side Information","220357694":"New Bounds on Parent-Identifying Codes: The Case of Multiple Parents","224647234":"On Watermarking/Fingerprinting for Copyright Protection","241638980":"Toward Practical Joint Decoding of Binary Tardos Fingerprinting Codes","3455248":"Joint Coding and Embedding Techniques for Multimedia Fingerprinting","224621382":"Attacks and Forensic Analysis for Multimedia Content Protection","3455250":"The Boneh–Shaw Fingerprinting Scheme is Better Than We Thought","249583815":"Multimedia Fingerprinting","221632031":"New Considerations about the Correct Design of Turbo Fingerprinting Codes","220412425":"A simple fingerprinting scheme for large user groups","3086339":"Achievable Error Exponents for the Private Fingerprinting Game","3085343":"On the Capacity Game of Private Fingerprinting Systems Under Collusion Attacks","254187798":"A class of non-linear asymptotic fingerprinting codes with ɛ-error","277207221":"Random Codes and Graphs for Secure Communication","3319041":"Identification of Traitors in Algebraic-Geometric Traceability Codes","257626991":"Image betrayal checking based on organization’s watermarking in Internet","232627946":"Social Networks Based Fingerprint Code: SNBFC and Its Pirates Tracing Algorithm to Majority Attack","280750978":"Watermarking for alternative requirements","220722206":"A Family of Collusion 2-Secure Codes","257636194":"A collusion attack optimization framework toward spread-spectrum fingerprinting","241630813":"Lower bounds on almost-separating binary codes","258360154":"Information Theoretic Security","226231873":"Copy Protection Systems","221011218":"Group-based joint coding and embedding technique for multimedia fingerprinting","221433101":"A Practical Solution for Distribution Rights Protection in Multicast Environments","220942190":"Building efficient and effective multimedia fingerprints via joint coding and embedding","251839559":"A Tracing Algorithm for Short 2Secure Probabilistic Fingerprinting Codes Strongly Protecting Innocent Users","221174888":"A Digital Fingerprint Coding Based on Turbo Codes","48168089":"Short Collusion-Secure Fingerprint Codes against Three Pirates","220990565":"Digital Fingerprinting under and (Somewhat) beyond the Marking Assumption - (Invited Talk).","220722285":"On the Design and Optimization of Tardos Probabilistic Fingerprinting Codes","220460658":"On error-correcting fingerprinting codes for use with watermarking","242506023":"Cryptography and Coding, 9th IMA International Conference, Cirencester, UK, December 16-18, 2003, Proceedings","224392970":"Tree search for digital fingerprinting","220333173":"Robust Parent-Identifying Codes and Combinatorial Arrays","220776048":"Equal-Weight Fingerprinting Codes","222619673":"A Class of I.p.p. Codes With Efficient Identification","26898116":"Collusion-resistant fingerprinting for multimedia in a broadcast channel environment","220076413":"On generalized separating hash families","2629197":"Reports In Informatics","226205719":"Improvement of Collusion Secure Convolutional Fingerprinting Information Codes","42252009":"Properties and evaluation of fingerprinting codes","4349228":"Randomized Frameproof Codes: Fingerprinting Plus Validation Minus Tracing","220144753":"Traitor tracing over YouTube video service - Proof of concept","221313344":"Environmental Security in P2P Networks.","221523781":"Collusion Secure Convolutional Spread Spectrum Fingerprinting","277593848":"Almost separating and almost secure frameproof codes over $$q$$ q -ary alphabets","4187720":"Boneh-Shaw fingerprinting and soft decision decoding","220177255":"High-rate random-like spherical fingerprinting codes with linear decoding complexity.","224678936":"Random Binary Fingerprinting Codes for Arbitrarily Sized Coalitions","268167291":"Constructions of Almost Secure Frameproof Codes Based on Small-Bias Probability Spaces","220079263":"Traceability Codes","220734380":"Equiangular tight frame fingerprinting codes","228640036":"A low-rate fingerprinting code and its application to blind image fingerprinting","220235940":"A Digital Fingerprinting Code Based on a Projective Plane and Its Identifiability of All Malicious Users","271659188":"Local and global structure preserving hashing for fast digital fingerprint tracing","246147363":"Exploring QIM based anti-collusion fingerprinting for multimedia - art. no. 60721T","225128954":"Performance Study on Multimedia Fingerprinting Employing Traceability Codes","3480740":"Tracing illegal redistribution using errors-anderasures and side information decoding algorithms","2997945":"Data-Hiding Codes","258374131":"Some New Results on Equivalency of Collusion-Secure Properties for Reed-Solomon Codes","250968419":"Bandwidth efficient asymmetric fingerprinting based on one-out-of-two oblivious transfer","3084727":"Applications of list decoding to tracing traitors","267272310":"New Bounds on Separable Codes for Multimedia Fingerprinting","220904883":"Fingerprinting Codes for Live Pay-Television Broadcast Via Internet","224436985":"A Group Testing Based Deterministic Tracing Algorithm for a Short Random Fingerprint Code","249773694":"Convolutional Fingerprinting Information Codes for Collusion Security","3085233":"On the (2,1)-separating weight of the Kerdock code","220962996":"Separating and Intersecting Properties of BCH and Kasami Codes.","268162142":"Information theoretic security. 5th international conference, ICITS 2011, Amsterdam, The Netherlands, May 21–24, 2011. Proceedings","3086217":"Combinatorial Properties for Traceability Codes Using Error Correcting Codes","221420948":"Traitor Tracing Against Powerful Attacks Using Combinatorial Designs","261038119":"A scheme of betrayal checking and traitor tracing for confidential image in Internet","224578763":"Saddle-point Solution of the Fingerprinting Capacity Game Under the Marking Assumption","265116513":"On collusion-secure codes for copyright protection","226031060":"Sequential Monte Carlo for rare event estimation","220684170":"Separable Codes","221609371":"Collusion secure convolutional fingerprinting information codes","234832204":"Experimental Assessment of the Reliability for Watermarking and Fingerprinting Schemes","46119692":"Anti-Collusion Fingerprinting for Multimedia Content Protection","224213225":"Identifying Traitors Using the Koetter–Vardy Algorithm","51955885":"Fingerprinting with Equiangular Tight Frames","267660097":"On the relationship between the traceability properties of Reed-Solomon codes","268820146":"Multimedia IPP Codes with Efficient Tracing","262912274":"Poisson Group Testing: A Probabilistic Model for Boolean Compressed Sensing","224142054":"Group-Oriented Anti-Collusion Fingerprint Based on BIBD Code","229037085":"New bounds for generalized separating hash families","220945808":"New Traceability Codes and Identification Algorithm for Tracing Pirates","262912272":"Group Testing for Non-Uniformly Quantized Adder Channels","254030234":"Message Passing Using the Cover Text as Secret Key","277496116":"Information Forensics: An Overview of the First Decade","277094203":"Multimedia Protection using Content and Embedded Fingerprints","225828810":"Customization of Curriculum Materials in Science: Motives, Challenges, and Opportunities","289238914":"Analysis of properties of q-ary Reed–Muller error-correcting codes viewed as codes for copyright protection","220234467":"Soft Decision Decoding of Boneh-Shaw Fingerprinting Codes","3085036":"Upper Bounds on Separating Codes","277296196":"DYNAMIC FRAMEPROOF CODES","224203934":"Fingerprinting for Copyright Protection in P2P Context","262371684":"Near-Optimal Collusion-Secure Fingerprinting Codes for Efficiently Tracing Illegal Re-distribution","262912108":"Semiquantitative Group Testing","242499774":"Information Security, 5th International Conference, ISC 2002 Sao Paulo, Brazil, September 30 - October 2, 2002, Proceedings","29601545":"Rare event simulation for a static distribution","224312469":"Towards optimal design of signal fingerprinting codes","221175038":"An Efficient Anonymous Fingerprinting Protocol","1960396":"On the Fingerprinting Capacity Under the Marking Assumption","263230821":"The Lovász Local Lemma and Its Applications to some Combinatorial Arrays: Proceedings of the Third Pythagorean Conference","221420775":"A Short Random Fingerprinting Code Against a Small Number of Pirates","234074916":"Traceability codes","287064517":"Secure Digital Content Management in Library","252048600":"Almost separating and almost secure frameproof codes","268820443":"Codes with the Identifiable Parent Property for Multimedia Fingerprinting","267047221":"Framework for preserving security and privacy in peer-to-peer content distribution systems","224754053":"Random coding technique for digital fingerprinting codes: Fighting two pirates revisited","1912318":"Randomized Frameproof Codes: Fingerprinting Plus Validation Minus Tracing","224754054":"Fighting three pirates with scattering codes","224621703":"Traitor tracing against powerful attacks","224679296":"Practical Construction Against Theoretical Approach in Fingerprinting","267157514":"Code Construction and Decoding Algorithms for Semi-Quantitative Group Testing with Nonuniform Thresholds","220681941":"Multihop Analog Network Coding via Amplify-and-Forward: The High SNR Regime","220405719":"Group-oriented and Collusion Secure Fingerprint for Digital Images","263252805":"A new fingerprinting scheme using social network analysis for majority attack","266509848":"Information security and cryptology. Second SKLOIS conference, Inscrypt 2006, Beijing, China, November 29–December 1, 2006. Proceedings","220680412":"Applications of list decoding to tracing traitors.","288798925":"Cover-Free Codes and Separating System Codes","220848599":"Obtaining Asymptotic Fingerprint Codes Through a New Analysis of the Boneh-Shaw Codes."},"index":45}