{"abs":"This paper compares the performance of anti-noise methods, particularly probabilistic and re-sampling methods, using NSGA2. It then proposes a computationally less expensive approach to counteracting noise using re-sampling and fitness inheritance. Six problems with different difficulties are used to test the methods. The results indicate that the probabilistic approach has better convergence to the Pareto optimal front, but it looses diversity quickly. However, methods based on re-sampling are more robust against noise but they are computationally very expensive to use. The proposed fitness inheritance approach is very competitive to re-sampling methods with much lower computational cost.","title":"Fitness inheritance for noisy evolutionary multi-objective optimization","id":220741295,"url":"https://www.researchgate.net/publication/220741295_Fitness_inheritance_for_noisy_evolutionary_multi-objective_optimization","names":["Lam Thu Bui","Hussein Abbass","Daryl Essam"],"references":{"2532946":"Fitness Inheritance in Multi-Objective Optimization","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","220045365":"Multiobjective Optimization Using Evolutionary Algorithms. Wiley, New York","221228598":"Evolutionary Multi-objective Ranking with Uncertainty and Noise","228781224":"Preprint: Multi-objective Evolutionary Algorithm for the Optimization of Noisy Combustion Processes","3421470":"Multiobjective evolutionary algorithm for the optimization of noisy combustion processes","2615708":"Multiobjective Evolutionary Algorithm Test Suites","2581803":"Approximating the non-dominated front using the Pareto Archived Evolution Strategy","2416569":"Noise, Sampling, and Efficient Genetic Algorithms","220885605":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms."},"citedIn":{"263369777":"Multi-objective optimization using metaheuristics: Non-standard algorithms","4375940":"Hybrid differential evolution for noisy optimization","235720068":"The Markov Network Fitness Model","220381033":"Robustness Against the Decision-Maker\u0027s Attitude to Risk in Problems With Conflicting Objectives","260290319":"Performance Measures and Control Laws for Active and Semi-Active Suspensions Acknowledgements","259884849":"GABF: Genetic algorithm with base fitness for obtaining generality from partial results: Study in autonomous intersection by fuzzy logic","220403630":"Evolutionary multiobjective optimization in noisy problem environments","271724898":"Non-dominated Sorting Bee Colony optimization in the presence of noise","46491920":"Evolutionary optimisation of noisy multi-objective problems using confidence-based dynamic resampling","226743958":"A Study of Techniques to Improve the Efficiency of a Multi-Objective Particle Swarm Optimizer","220403316":"A fast Pareto genetic algorithm approach for solving expensive multiobjective optimization problems","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","222667997":"Genetic Algorithm Based Technique for Solving Chance Constrained Problems","265614475":"ADAPTIVE SURROGATE-ASSISTED EVOLUTION","273397675":"The Rolling Tide Evolutionary Algorithm: A Multiobjective Optimizer for Noisy Optimization Problems","220741321":"ASAGA: An adaptive surrogate-assisted genetic algorithm","225199245":"Evolutionary multi-objective optimization: Some current research trends and topics that remain to be explored","241732554":"A data mining approach to evolutionary optimisation of noisy multi-objective problems","224472197":"Interval Robust Multi-Objective Evolutionary Algorithm","226339609":"The Role of Explicit Niching and Communication Messages in Distributed Evolutionary Multi-objective Optimization","220403467":"Design of a motorcycle frame using neuroacceleration strategies in MOEAs","229710744":"Multi‐objective optimization for channel allocation in mobile computing using NSGA‐II","261045347":"Fitness Modeling With Markov Networks","268397775":"MULTIOBJECTIVE OPTIMIZATION ALGORITHM BENCHMARKING AND DESIGN UNDER PARAMETER UNCERTAINTY","223648868":"An investigation on noise-induced features in robust evolutionary multi-objective optimization","221024990":"Future Challenges.","221006942":"Trainer selection strategies for coevolving rank predictors","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","220743569":"Accumulative sampling for noisy evolutionary multi-objective optimization","224645849":"Noise Handling in Evolutionary Multi-Objective Optimization","221765453":"Multi-Objective Optimization with Estimation of Distribution Algorithm in a Noisy Environment","275068575":"Increased Robustness of Product Sequencing Using Multi-objective Optimization","221497999":"Optimization to Manage Supply Chain Disruptions Using the NSGA-II","227210998":"On Similarity-Based Surrogate Models for Expensive Single- and Multi-objective Evolutionary Optimization","26768806":"Localization for Solving Noisy Multi-Objective Optimization Problems","220702296":"A Steady-State Genetic Algorithm with Resampling for Noisy Inventory Control"},"index":467}