{"abs":"A novel subset simulation algorithm, called the parallel subset simulation, is proposed to estimate small failure probabilities of multiple limit states with only a single subset simulation analysis. As well known, crude Monte Carlo simulation is inefficient in estimating small probabilities but is applicable to multiple limit states, while the ordinary subset simulation is efficient in estimating small probabilities but can only handle a single limit state. The proposed novel stochastic simulation approach combines the advantages of the two simulation methods: it is not only efficient in estimating small probabilities but also applicable to multiple limit states. The key idea is to introduce a “principal variable” which is correlated with all performance functions. The failure probabilities of all limit states therefore could be evaluated simultaneously when subset simulation algorithm generates the principal variable samples. The statistical properties of the failure probability estimators are also derived. Two examples are presented to demonstrate the effectiveness of the new approach and to compare with crude Monte Carlo and ordinary subset simulation methods.","title":"Evaluating small failure probabilities of multiple limit states by parallel subset simulation","id":245185082,"url":"https://www.researchgate.net/publication/245185082_Evaluating_small_failure_probabilities_of_multiple_limit_states_by_parallel_subset_simulation","names":["Hsu Chih Wei","Jianye Ching","Probabilistic Engineering Mechanics"],"references":{"232346905":"Reliability-based optimization in structural engineering. Struct Saf","222600325":"Augmenting approximate solutions for consistent reliability analysis","225828439":"Monte Carlo Methods","236660920":"Methods of Structural Safety","245301372":"Basic Analysis of Structural Safety","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","268312154":"Monte Carlo: Concepts, Algorithms, and Applications. Springer Series in Operations Research","265794417":"Method of Structural Safety","260360685":"Simulation and the Monte Carlo Method. John Wiley, New York","226848876":"Reliability-Based Optimization of Structural Systems","243701836":"Probability Concepts in Engineering Planning and Design, Vol.I: Basic Principles","250693053":"Reliability Estimation for Dynamical Systems Subject to Stochastic Excitation using Subset Simulation with Splitting","239387304":"Reliability-Based Optimal Design of Series Structural Systems","222548334":"Reliability-based structural optimization using neural networks and Monte Carlo simulation","247133972":"Performance Based Seismic Design","257940462":"Probability Concepts in Engineering Planning and Design, Vol I and II","257101313":"Assessment of low probability events of dynamical systems by controlled Monte Carlo simulation","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","44442771":"Simulation and the Monte Carlo method / Reuven Y. Rubinstein","245185064":"Geometry of random vibrations and solutions by FORM and SORM","48925084":"Auxiliary domain method for solving multi-objective\ndynamic reliability problems for nonlinear structures","222672830":"Benchmark study on reliability estimation in higher dimensions of structural systems – An overview","268017285":"Application of Structural System Reliability Theory","223325330":"Hybrid Subset Simulation Method for Reliability Estimation of Dynamical Systems Subject to Stochastic Excitation"},"citedIn":{"256800108":"Reliability assessment in structural dynamics","273401497":"Markov chain splitting methods in structural reliability integral estimation","259357057":"Estimation of time variant reliability of randomly parametered non-linear vibrating systems","268752448":"A generalized Subset Simulation approach for estimating small failure probabilities of multiple stochastic responses","222340440":"Approximate optimization of systems with high-dimensional uncertainties and multiple reliability constraints","274071615":"Implementation of simulation methods in structural reliability","266410890":"A new reliability-based design approach based on limit-state factor","221676250":"Meta-models for Structural Reliability and Uncertainty Quantification","277561511":"System reliability of randomly vibrating structures: Computational modeling and laboratory testing","233139115":"Approximate reliability-based design with general geotechnical models by stochastic simulation","281770821":"Engineering Risk Assessment with Subset Simulation","264547674":"Stochastic Simulation Based Reliability Analysis with Multiple Performance Objective Functions"},"index":478}