{"abs":"A major consideration in the design of tunnels in urban areas is the prediction of the ground movements and surface settlements associated with the tunneling operations. Excessive ground movements can damage adjacent building and utilities. In this paper, a neural network model is used to predict the maximum surface settlement, based on instrumented results from three separate EPB tunneling projects in Singapore. This paper demonstrates that by coupling the trained neural network model to a spreadsheet optimization technique, the reliability assessment of the settlement serviceability limit state can be carried out using the first-order reliability method. With this method, it is possible to carry out sensitivity studies to examine the effect of the level of uncertainty of each parameter uncertainty on the probability that the serviceability limit state has been exceeded.","title":"Reliability assessment of EPB tunnel-related settlement","id":264077209,"url":"https://www.researchgate.net/publication/264077209_Reliability_assessment_of_EPB_tunnel-related_settlement","names":["Anthony Goh","A.M. Hefney","Geomechanics and Engineering"],"references":{"237378918":"An evaluation of simplified techniques for estimating three-dimensional undrained ground movements due to tunnelling in soft soils","223115020":"Geological and geotechnical features of Singapore: An overview","245210236":"Tunnelling projects in Singapore: An overview","245301372":"Basic Analysis of Structural Safety","239335622":"A Probability-based structural code","223401206":"Artificial neural networks for predicting the maximum surface settlement caused by EPB shield tunneling","245407815":"Local settlements and sinkholes due to EPB tunnelling","245410762":"Subsurface settlement profiles above tunnels in clay","243763658":"Hornik, K.: Approximation Capabilities of Multilayer Feedforward Network. Neural Networks, 251-257","230876435":"Learning Internal Representation by Error Propagation","229860929":"Reliability assessment of serviceability performance of braced retaining walls using a neural network approach","266197930":"Uncertainty Modeling: with Applications to Multidimensional Civil Engineering Systems","222757727":"Artificial neural networks analysis of São Paulo subway tunnel settlement data","222310616":"Reliability analysis using object-oriented constrained optimization","220693630":"Naturally Intelligent Systems","257940484":"Structural Reliability Analysis, Prediction","243758427":"An Exact and Invariant First Order Reliability Format","223500015":"Neural network based prediction of ground surface settlements due to tunnelling","245294435":"First-Order Reliability Method for Probabilistic Liquefaction Triggering Analysis Using CPT","245377598":"Neural network approach to model the limit state surface for reliability analysis","245293505":"Modular Neural Networks for Predicting Settlements during Tunneling"},"citedIn":{"257100037":"Multivariate adaptive regression splines for analysis of geotechnical engineering systems","259382413":"MULTIVARIATE ADAPTIVE REGRESSION SPLINES FOR FOUNDATION ENGINEERING ANALYSIS","257794739":"Reliability analysis of serviceability performance for an underground cavern using a non-intrusive stochastic method"},"index":482}