{"abs":"In the field of structural reliability, the Monte-Carlo estimator is considered as the reference probability estimator. However, it is still untractable for real engineering cases since it requires a high number of runs of the model. In order to reduce the number of computer experiments, many other approaches known as reliability methods have been proposed. A certain approach consists in replacing the original experiment by a surrogate which is much faster to evaluate. Nevertheless, it is often difficult (or even impossible) to quantify the error made by this substitution. In this paper an alternative approach is developed. It takes advantage of the kriging meta-modeling and importance sampling techniques. The proposed alternative estimator is finally applied to a finite element based structural reliability analysis.","title":"Metamodel-based importance sampling for the simulation of rare events","id":51888191,"url":"https://www.researchgate.net/publication/51888191_Metamodel-based_importance_sampling_for_the_simulation_of_rare_events","names":["Vincent Dubourg","Francois Deheeger","Bruno Sudret"],"references":{"1911433":"Controlled stratification for quantile estimation","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","223307920":"Multiple design points in first and second-order reliability"},"citedIn":{"283056214":"Assessment of the efficiency of Kriging models for reliability analysis of complex structures","257007034":"Cross-entropy-based adaptive importance sampling using Gaussian mixture","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","262983676":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","270987507":"Efficient structural reliability analysis method based on advanced Kriging model","266943935":"A survey of rare event simulation methods for static input-output models","285310904":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation","261873479":"Rare event probability estimation in the presence of epistemic uncertainty on input probability distribution parameters","283055905":"Assessment of the efficiency of Kriging models for reliability analysis of complex structures","285321983":"Rare Event Simulation: A Point Process Interpretation With Application In Probability And Quantile Estimation","262265054":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","260145246":"Meta-model-based importance sampling for reliability sensitivity analysis","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation"},"index":491}