{"abs":"This paper is focused on a comparative analysis of the performance of two master-slave parallelization methods, the basic generational scheme and the steady-state asynchronous scheme. Both can be used to improve the convergence speed of multi-objective evolutionary algorithms (MOEAs) that rely on time-intensive fitness evaluation functions. The importance of this work stems from the fact that a correct choice for one or the other parallelization method can lead to considerable speed improvements with regards to the overall duration of the optimization. Our main aim is to provide practitioners of MOEAs with a simple but effective method of deciding which master-slave parallelization option is better when dealing with a time-constrained optimization process.","title":"On the Performance of Master-Slave Parallelization Methods for Multi-Objective Evolutionary Algorithms","id":262914357,"url":"https://www.researchgate.net/publication/262914357_On_the_Performance_of_Master-Slave_Parallelization_Methods_for_Multi-Objective_Evolutionary_Algorithms","names":["Ciprian Zavoianu","Edwin Lughofer","Werner Koppelstaetter","Günther Weidenholzer","Wolfgang Amrhein","E.P. Klement"],"references":{"216300453":"Evolutionary Algorithms for Solving Multi-Objective Problems SE – Genetic and Evolutionary Computation","3949503":"Scalable multi-objective optimization test problems","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","262405508":"On Set-Based Multiobjective Optimization","216457263":"Lecture Notes in Computer Science","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","2782915":"A Variant of Evolution Strategies for Vector Optimization","224316884":"A study of master-slave approaches to parallelize NSGA-II","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","2333106":"Simulated Binary Crossover for Continuous Search Space","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","220291960":"JMetal: A Java framework for multi-objective optimization","239917589":"A Hybrid Soft Computing Approach for Optimizing Design Parametersof Electrical Drives","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","221228592":"On the Effect of the Steady-State Selection Scheme in Multi-Objective Genetic Algorithms"},"citedIn":{"280025456":"Evaluation-Time Bias in Asynchronous Evolutionary Algorithms","282490583":"On the design of shared memory approaches to parallelize a multiobjective bee-inspired proposal for phylogenetic reconstruction","278022171":"Performance Comparison of Generational and Steady-State Asynchronous Multi-Objective Evolutionary Algorithms for Computationally-Intensive Problems","261313848":"Comprehensive cost optimization study of high-efficiency brushless synchronous machines","262808470":"DECMO2: a robust hybrid and adaptive multi-objective evolutionary algorithm"},"index":493}