{"abs":"Classical reliability methods such as First-and Second-Order Reliability Methods (FORM and SORM) have been important breakthroughs toward feasible and reliable integration of probabilistic information and uncertainty analysis into advanced design methods and modern design codes. These methods have been successfully used in solving challenging reliability problems. Nevertheless, caution should be used in the applications of these methods since their limitations and shortcomings in terms of applicability and accuracy are known and documented. Current research trends highlight the importance of structural reliability analysis methodologies that are able to provide improved estimates of the failure probability without excessive increase in computational cost when compared with ordinary FORM/SORM analyses. In this work, a new hybrid reliability analysis method, denoted as Design Point – Response Surface – Simulation (DP-RS-Sim) method is proposed and illustrated. This method innovatively combines the design point (DP) search used in FORM/SORM analyses with the response surface method and appropriate simulation techniques. The need for this combination has emerged from the results obtained through visualization of the limit state surfaces (LSSs) typically used in finite element reliability analysis. In particular, the visualization results show that these LSSs are often highly nonlinear in the neighborhood of their DPs. As application example, the time-invariant reliability analysis of a reinforced concrete frame structure subjected to horizontal pushover loads is considered. DP-RS-Sim-based estimations of the probability of limit state exceedance (expressed in terms of displacement thresholds) by the benchmark structure are compared with FORM, SORM, crude Monte Carlo and Importance Sampling results in terms of accuracy and computational cost. It is shown that the new DP-RS-Sim method can provide accurate failure probability estimates at low computational cost compared to other structural reliability methods.","title":"A NEW HYBRID RELIABILITY ANALYSIS METHOD: THE DESIGN POINT-RESPONSE SURFACE-SIMULATION METHOD","id":228667891,"url":"https://www.researchgate.net/publication/228667891_A_NEW_HYBRID_RELIABILITY_ANALYSIS_METHOD_THE_DESIGN_POINT-RESPONSE_SURFACE-SIMULATION_METHOD","names":["Michele Barbato","Quan gu","Joel P. Conte"],"references":{"228573534":"A univariate approximation at most probable point for higer-order reliability analysis","245310297":"Sensitivity and Importance Measures in Structural Reliability","247110195":"Parameter Sensitivity in Non-Linear Mechanics—Theory and Finite Element Computations","39066974":"Response Surface Method for Time-Variant Reliability Analysis","223592988":"A new look at the response surface approach for reliability analysis","223028762":"Three-dimensional finite element analyses of reinforced concrete columns","251807120":"New approximations for SORM: part I","222249067":"Dynamic Response Sensitivity of Inelastic Structures","3464097":"Practical Optimization","245528314":"Finite element structural response sensitivity and reliability analyses using smooth versus non-smooth material constitutive models","227605578":"A generalized dimension‐reduction method for multidimensional integration in stochastic mechanics","247061346":"OpenSees Command Language","236030092":"Finite Element Response Sensitivity Analysis of Steel-Concrete Composite Beams with Deformable Shear Connection","223307920":"Multiple design points in first and second-order reliability","222513954":"A 3D hypoplastic model for cyclic analysis of concrete structures","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","228800324":"Consistent Finite-Element Response Sensitivity Analysis","273800443":"Second‐Order Reliability Approximations","222837988":"Decomposition methods for structural reliability analysis","222553900":"Structural reliability analysis by univariate decomposition and numerical integration","222832250":"Xu, H.: A univariate dimension-reduction method for multi-dimensional integration in stochastic mechanics. Probabilitic Engineering Mechanics 19, 393-408","225805894":"Asymptotic approximations for multinormal domain and surface integrals","245285930":"Constitutive Model for 3D Cyclic Analysis of Concrete Structures","228589716":"Reliability of Uncertain Dynamical Systems with Multiple Design Points","245185064":"Geometry of random vibrations and solutions by FORM and SORM","235080757":"Response Surface Methodology","228949522":"Response sensitivity and probabilistic response analyses of reinforced concrete frame structures","222780925":"A new adaptive importance sampling scheme","222945716":"Optimization algorithms for structural reliability"},"citedIn":{},"index":497}