{"abs":"Fitness modelling is an area of research which has recently received much interest among the evolutionary computing community. Fitness models can improve the efficiency of optimisation through direct sampling to generate new solutions, guiding of traditional genetic operators or as surrogates for a noisy or long-running fitness functions. In this chapter we discuss the application of Markov networks to fitness modelling of black-box functions within evolutionary computation, accompanied by discussion on the relationship between Markov networks and Walsh analysis of fitness functions. We review alternative fitness modelling and approximation techniques and draw comparisons with the Markov network approach. We discuss the applicability of Markov networks as fitness surrogates which may be used for constructing guided operators or more general hybrid algorithms. We conclude with some observations and issues which arise from work conducted in this area so far.","title":"The Markov Network Fitness Model","id":235720068,"url":"https://www.researchgate.net/publication/235720068_The_Markov_Network_Fitness_Model","names":["Alexander E. I. Brownlee","John Mccall","Siddhartha Shakya"],"references":{"225403052":"GA-EDA: Hybrid Evolutionary Algorithm Using Genetic and Estimation of Distribution Algorithms","220742251":"Evaluation Relaxation using Substructural Information and Linear Estimation","41529789":"Optimisation and Fitness Modelling of Bio-control in Mushroom Farming Using a Markov Network EDA","223835155":"Evolutionary hidden information detection by granulation-based fitness approximation","225951346":"Opportunities for Expensive Optimization with Estimation of Distribution Algorithms","221024234":"Surrogate Deterministic Mutation: Preliminary Results","220118936":"An elitist non-dominated sorting genetic algorithm enhanced with a neural network applied to the multi-objective optimization of a polysiloxane process","224645797":"Iterated Local Search with Guided Mutation","220741295":"Fitness inheritance for noisy evolutionary multi-objective optimization","221006311":"Structure Learning and Optimisation in a Markov-network based Estimation of Distribution Algorithm","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","220998589":"Fitness inheritance in genetic algorithms","201976348":"Genetic Algorithms and Walsh Functions: Part I, A Gentle Introduction","221009210":"Decreasing the Number of Evaluations in Evolutionary Algorithms by Using a Meta-model of the Fitness Function","220381108":"Local Function Approximation in Evolutionary Algorithms for the Optimization of Costly Functions","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","221112432":"A Markov Network Based Factorized Distribution Algorithm for Optimization","220176770":"Memetic algorithm using multi-surrogates for computationally expensive optimization problems. Soft Comput","221006861":"Metamodel-Assisted Mixed Integer Evolution Strategies and Their Application to Intravascular Ultrasound Image Analysis","1956990":"Fitness Inheritance in the Bayesian Optimization Algorithm","224309437":"Coevolution of Fitness Predictors","221112328":"Mixtures of Kikuchi Approximations","220740096":"Analyzing probabilistic models in hierarchical BOA on traps and spin glasses","224472200":"Using Over-sampling in a Bayesian Classifier EDA to solve Deceptive and Hierarchical Problems","221008583":"A fully multivariate DEUM algorithm","224330099":"Approaches to Selection and their Effect on Fitness Modelling in an Estimation of Distribution Algorithm","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","225394525":"Combinations of estimation of distribution algorithms and other techniques","2532946":"Fitness Inheritance in Multi-Objective Optimization","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","222073866":"Screening important design variables for building a usability model: Genetic algorithm-based partial least-squares approach","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","220741392":"Combining competent crossover and mutation operators: A probabilistic model building approach","220742161":"Solving the MAXSAT problem using a multivariate EDA based on Markov networks","4201722":"A study on polynomial regression and Gaussian Process global surrogate model in hierarchical surrogate-assisted evolutionary algorithm","222707770":"Optimization of ventilation system design and operation in office environment, Part II","220343454":"Learnable Evolution Model: Evolutionary Processes Guided by Machine Learning.","226682942":"Optimization by estimation of distribution with DEUM framework based on Markov random fields","220105952":"Research topics in discrete estimation of distribution algorithms based on factorizations","222088067":"Multiobjective optimization of building design using TRNSYS simulations, genetic algorithm, and Artificial Neural Network"},"citedIn":{"261045347":"Fitness Modeling With Markov Networks"},"index":508}