{"abs":"In this paper we describe a method for improving genetic-algorithm-based optimization using search control. The idea is to utilize the sequence of points explored during a search to guide further exploration. The proposed method is particularly suitable for continuous spaces with expensive evaluation functions, such as arise in engineering design. Empirical results in several engineering design domains demonstrate that the proposed method can significantly improve the e#ciency and reliability of the GA optimizer. Keywords: genetic algorithms, design optimization, machine learning To appear in Artificial Intelligence in Engineering, Design, Analysis and Manufacturing 1 Introduction Genetic Algorithms (GAs) [ Goldberg 1989 ] are search algorithms that simulate the process of natural selection. GAs attempt to find a good solution to some problem (e.g., finding the maximum of a function) by randomly generating a collection (\"population \") of potential solutions (\"individuals\") to t...","title":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","id":2349484,"url":"https://www.researchgate.net/publication/2349484_Learning_to_be_Selective_in_Genetic-Algorithm-Based_Design_Optimization","names":["Khaled Rasheed","Haym Hirsh","Artificial intelligence for engineering design analysis and manufacturing"],"references":{"2485857":"Genetic Algorithms for Real Parameter Optimization","221603472":"PROLEARN: Towards a Prolog Interpreter that Learns.","220343557":"Chunking in Soar: The Anatomy of a General Learning Mechanism","2598475":"Working from Blueprints: Evolutionary Learning for Design","221345340":"An Advanced Evolution Should Not Repeat its Past Errors.","242388861":"Learning Search Control Knowledge: An Explanation-based Approach","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","2336982":"High Performance Supersonic Missile Inlet Design Using Automated Optimization","30873058":"Genetic + Data Structures \u003d Evolution Programs","222501755":"A genetic algorithm for continuous design space search","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","223938660":"Using Modeling Knowledge to Guide Design Space Search","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","2356412":"An Adaptive Penalty Approach for Constrained Genetic-Algorithm Optimization"},"citedIn":{"220741224":"Comparison Of Methods For Using Reduced Models To Speed Up Design Optimization.","259517878":"Computational and Mathematical Modeling of the Effects of Tailbeat Frequency and Flexural Stiffness in Swimming Fish","4075005":"Using singular value decomposition to improve a genetic algorithm\u0027s performance","2331428":"Guided Crossover: A New Operator for Genetic Algorithm Based Optimization","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","4201485":"Complementary selection and variation for an efficient multiobjective optimization of complex systems","3810167":"Effect of global parallelism on the behavior of a steady state genetic algorithm for design optimization","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","3421614":"Multiobjective GA Optimization Using Reduced Models","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","220204668":"Determining Worst-Case Gust Loads on Aircraft Structures Using an Evolutionary Algorithm","2680118":"Applying Parallelism to Improve Genetic Algorithm-based Design Optimization","242190000":"A COMPARISON OF NATURE INSPIRED INTELLIGENT OPTIMIZATION METHODS IN AERIAL SPRAY DEPOSITION MANAGEMENT","265614475":"ADAPTIVE SURROGATE-ASSISTED EVOLUTION","220741321":"ASAGA: An adaptive surrogate-assisted genetic algorithm","237787467":"Employment History","220858754":"Data Driven Design Optimization Methodology A Dynamic Data Driven Application System","223873717":"Soft computing in engineering design – A review","268559790":"Toward the Aerodynamical Optimization of a Supersonic Airplane Using a Genetic Algorithm and a PNS Solver","231747680":"Learning to set up numerical optimizations of engineering designs","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","2379359":"VLSI Standard Cell Design Using Genetic Algorithms","249944474":"Nature Inspired Heuristics in Aerial Spray Deposition Management"},"index":51}