{"abs":"Parallel master-slave evolutionary algorithms easily lead to linear speedups in the case of a small number of nodes... and homogeneous computational costs of the evaluations. However, modern computer now routinely have several hundreds of nodes - and in many real-world applications in which fitness computation involves heavy numerical simulations, the computational costs of these simulations can greatly vary from one individual to the next. A simple answer to the latter problem is to use asynchronous steady-state reproduction schemes. But the resulting algorithms then differ from the original sequential version, with two consequences: First, the linear speedup does not hold any more; Second, the convergence might be hindered by the heterogeneity of the evaluation costs. The multi-objective optimization of a diesel engine is first presented, a real-world case study where evaluations are very heterogeneous in terms of CPU cost. Both the speedup of asynchronous parallel algorithms in case of large number of nodes, and their convergence toward the Pareto Front in case of heterogeneous computation times, are then experimentally analyzed on artificial test functions. An alternative selection scheme involving the computational cost of the fitness evaluation is then proposed, that counteracts the effects of heterogeneity on convergence toward the Pareto Front.","title":"Asynchronous Master/Slave MOEAs and Heterogeneous Evaluation Costs","id":254461799,"url":"https://www.researchgate.net/publication/254461799_Asynchronous_MasterSlave_MOEAs_and_Heterogeneous_Evaluation_Costs","names":["Mouadh Yagoubi","Marc Schoenauer"],"references":{"220375075":"Completely Derandomized Self-Adaptation in Evolution Strategies","221228621":"Towards a Quick Computation of Well-Spread Pareto-Optimal Solutions","221228555":"Steady-State Selection and Efficient Covariance Matrix Update in the Multi-objective CMA-ES","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","224246932":"Asynchronous Evolutionary Multi-Objective Algorithms with heterogeneous evaluation costs","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","224316884":"A study of master-slave approaches to parallelize NSGA-II","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","239392299":"Aerodynamic Optimization Using a Parallel Asynchronous Evolutionary Algorithm Controlled by Strongly Interacting Demes","48414194":"Lecture Notes in Computer Science","215562282":"A survey of parallel distributed genetic algorithm","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","216300369":"Parallelizing Multi-Objective Evolutionary Algorithms: Cone Separation","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","221228629":"Distributed Computing of Pareto-Optimal Solutions with Evolutionary Algorithms","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","266464570":"An asynchronous steady-state NSGA-II algorithm for multi-objective optimization of Diesel combustion","201976468":"A Study of Reproduction in Generational and Steady State Genetic Algorithms","35750879":"Efficient and Accurate Parallel Genetic Algorithms"},"citedIn":{"282490583":"On the design of shared memory approaches to parallelize a multiobjective bee-inspired proposal for phylogenetic reconstruction","267982364":"An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition","273296140":"An Evolutionary Many-Objective Optimization Algorithm Based on Dominance and Decomposition"},"index":511}