{"abs":"The demand for fresh water in coastal areas and islands can be very high due to increased local needs and tourism. A multi-objective optimization methodology is developed, involving minimization of economic and environmental costs while satisfying water demand. The methodology considers desalinization of pumped water and injection of treated water into the aquifer. Variable density aquifer models are computationally intractable when integrated in optimization algorithms. In order to alleviate this problem, a multi-objective optimization algorithm is developed combining surrogate models based on Modular Neural Networks [MOSA(MNNs)]. The surrogate models are trained adaptively during optimization based on a genetic algorithm. In the crossover step, each pair of parents generates a pool of offspring which are evaluated using the fast surrogate model. Then, the most promising offspring are evaluated using the exact numerical model. This procedure eliminates errors in Pareto solution due to imprecise predictions of the surrogate model. The method has important advancements compared to previous methods such as precise evaluation of the Pareto set and alleviation of propagation of errors due to surrogate model approximations. The method is applied to an aquifer in the Greek island of Santorini. The results show that the new MOSA(MNN) algorithm offers significant reduction in computational time compared to previous methods (in the case study it requires only 5% of the time required by other methods). Further, the Pareto solution is better than the solution obtained by alternative algorithms.","title":"Development of a multi-objective optimization algorithm using surrogate models for coastal aquifer management","id":256756873,"url":"https://www.researchgate.net/publication/256756873_Development_of_a_multi-objective_optimization_algorithm_using_surrogate_models_for_coastal_aquifer_management","names":["George Kourakos","Aristotelis Mantoglou","Journal of Hydrology"],"references":{"222323712":"Management of Coastal Aquifers Based on Nonlinear Optimization and Evolutionary Algorithms","4875977":"Approximating a finite element model by neural network prediction for facility optimization in groundwater engineering","51908379":"Optimal Field-Scale Groundwater Remediation Using Neural Networks and the Genetic Algorithm","225595057":"Optimal and sustainable extraction of groundwater in coastal aquifers","245333146":"An evolutionary annealing-simplex algorithm for global optimisation of water resource systems","239163526":"The optimal allocating pumping rate of a multi-well system for a brackish water desalination plant","2629039":"Approximating the Nondominated Front Using the Pareto Archived Evolution Strategy","222580355":"Global optimal design of reverse osmosis networks for seawater desalination: Modeling and algorithm","251435765":"Single-potential solution for regional interface problems in coastal aquifers","254241260":"Cost-efficient management of coastal aquifers via recharge with treated wastewater and desalination of brackish groundwater: General framework","5300827":"A National Reconnaissance of Pharmaceuticals and Other Organic Wastewater Contaminants in the United States, I. Groundwater","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","240489374":"Pumping optimization in saltwater-intruded coastal aquifers. Water Resour Res","239387592":"Saltwater Intrusion Management of Coastal Aquifers. I: Linked Simulation-Optimization","233245674":"Planning groundwater development in coastal aquifers / Planification du développement de la ressource en eau souterraine des aquifères côtiers","241060499":"Pumping management of coastal aquifers using analytical models of saltwater intrusion. Water Resour Res 39:SBH51-SBH512","280707254":"A multilayered sharp interface model of coupled freshwater and saltwater flow in coastal systems: model development and application","258187693":"The construction and implementation of metamodels","229657918":"Optimal control algorithm and neural network for dynamic groundwater management","45372346":"Simulation of Groundwater Mound Resulting from Proposed Artificial Recharge of Treated Sewage Effluent Case study – Gaza waste water treatment plant, Palestine","251425644":"Coupled simulation-optimization model for coastal aquifer management using genetic programming based ensemble surrogate models and multiple-realization optimization. Water Resour Res 47, W04516","229319930":"Datta, B.: Multi-objective management of saltwater intrusion in coastal aquifers using genetic programming and modular neural network based surrogate models. Journal of Hydrology 393, 245-256","280904044":"Optimal design of aquifer cleanup systems under uncertainty using a neural network and a genetic algorithm","245100047":"Optimal design of pumping networks in coastal aquifers using sharp interface models","253675019":"Optimal design of aquifer cleanup systems under uncertainty using a neural network and a genetic algorithm. Water Resour Res","222414804":"Desalination of brackish groundwater in Egypt","239163479":"A simplified simulation model of RO systems for seawater desalination","248880332":"Applying Dynamic Surrogate Models in Noisy Genetic Algorithms to Optimize Groundwater Remediation Designs","222525917":"A methodology to investigate brackish groundwater desalination coupled with aquifer recharge by treated wastewater as an alternative strategy for water supply in Mediterranean areas","237367099":"User\u0027s guide to SEAWAT: A Computer Program for Simulations of Three-Dimensional Variable Density Groundwater Flow","244144494":"Variable density coastal aquifer models with application to an aquifer on Thira Island. Desalination 237(1-3):65-80","222818274":"Stochastic management of pump-and-treat strategies using surrogate functions. Adv Water Resour","248807678":"A Multilayered Sharp Interface Model of Coupled Freshwater and Saltwater Flow in Coastal Systems: Model Development and Application","226867191":"Inverse modeling of variable-density groundwater flow in a semi-arid area in Iran using a genetic algorithm","222054927":"Application of linear programming and differential evolutionary optimization methodologies for the solution of coastal subsurface water management problems subject to environmental criteria","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","248808801":"Optimal groundwater remediation design using an Adaptive Neural Network Genetic Algorithm. Water Resour Res 42(5):W05407","230293647":"Artificial neural networks an alternative approach to groundwater numerical modeling and environmental design. Hydrol Process","223568934":"Pumping optimization of coastal aquifers based on evolutionary algorithms and surrogate modular neural network models. Adv Water Resour","8616507":"Groundwater Recharge with Reclaimed Municipal Wastewater: Health and Regulatory Considerations","215889765":"ANN-GA-Based Model for Multiple Objective Management of Coastal Aquifers","235694711":"Stochastic sampling design using multiobjective genetic algorithm and adaptive neural networks","225479245":"Simulation and Multi-Objective Management of Coastal Aquifers in Semi-Arid Regions","216457304":"Lecture Notes in Computer Science"},"citedIn":{"282545686":"An efficient simulation-optimization coupling for management of coastal aquifers","276354170":"Multi-Objective Reservoir Operation with Sediment Flushing; Case Study of Sefidrud Reservoir","241240419":"Review of Optimization Methods in Groundwater Modeling and Management","287992462":"Multi-Objective Adaptive Surrogate Modeling-Based Optimization for Parameter Estimation of Large, Complex Geophysical Models","280975385":"Review: Simulation-optimization models for the management and monitoring of coastal aquifers","283985739":"An effective bacterial foraging optimizer for global optimization","280711985":"Comparison of surrogate models with different methods in groundwater remediation process","277609024":"Design of an Optimal Compliance Monitoring Network and Feedback Information for Adaptive Management of Saltwater Intrusion in Coastal Aquifers","281924092":"Surrogate model of numerical simulation model of groundwater based on Wavelet Neural Network","274140741":"Global change and the groundwater management challenge: Groundwater Management Challenge","281446324":"Assessment of a parallel evolutionary optimization approach for efficient management of coastal aquifers","270453165":"Evolutionary algorithms for the optimal management of coastal groundwater: A comparative study toward future challenges","281467061":"Three Dimensional Simulation of Seawater Intrusion in a Regional Coastal Aquifer in UAE","272890038":"A surrogate model for simulation–optimization of aquifer systems subjected to seawater intrusion","276096898":"Review: Coastal groundwater optimization—advances, challenges, and practical solutions","290975503":"Pareto-based efficient stochastic simulation-optimization for robust and reliable groundwater management","259158799":"Vectorized simulation of groundwater flow and streamline transport"},"index":514}