{"abs":"Genetic algorithms (GAs), which are directed stochastic hill climbing algorithms, are a commonly used optimization technique and are generally applied to single criterion optimization problems with fairly complex solution landscapes. There has been some attempts to apply GA to multicriteria optimization problems. The GA selection mechanism is typically dependent on a single-valued objective function and so no general methods to solve multicriteria optimization problems have been developed so far. In this paper, a new method of transformation of the multiple criteria problem into a single-criterion problem is presented. The problem of transformation brings about the need for the introduction of thePareto set estimation method to perform the multicriteria optimization using GAs. From a given solution set, which is the population of a certain generation of the GA, the Pareto set is found. The fitness of population members in the next GA generation is calculated by a distance metric with a reference to the Pareto set of the previous generation. As we are unable to combine the objectives in some way, we resort to this distance metric in the positive Pareto space of the previous solutions, as the fitness of the current solutions. This new GA-based multicriteria optimization method is proposed here, and it is capable of handling any generally formulated multicriteria optimization problem. The main idea of the method is described in detail in this paper along with a detailed numerical example. Preliminary computer generated results show that our approach produces better, and far more Pareto solutions, than plain stochastic optimization methods.","title":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","id":226165021,"url":"https://www.researchgate.net/publication/226165021_A_New_Method_to_Solve_Generalized_Multicriteria_Optimization_Problems_using_the_Simple_Genetic_Algorithm","names":["A. Osyczka","S. Kundu","Structural and Multidisciplinary Optimization"],"references":{"242356870":"Adaptation In Natural And Artificial Systems","220045412":"Adoption in Natural and Artificial System","271371910":"Multi-objective optimization of laminated ceramic composites using genetic algorithms","283996103":"Genetic Algorithms In Search, Optimization, and Machine Learning","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","2252671":"Pareto Optimality, GA-easiness and Deception","239059442":"Multicriterion Optimization in Engineering with FORTRAN Pro-grams","2595162":"Evolutionary Learning of Novel Grammars for Design Improvement","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"30010569":"Piezoelectric actuator design via multiobjective optimization methods","274563676":"Multicriteria Optimization of Cutting Parameters of Hard Turning Operation of the Hardened 18CrMo4 Steel in View of Chosen Parameters of Surface Roughness","227163790":"Efficient Pareto Frontier Exploration using Surrogate Approximations","238778687":"COPYRIGHT 2009 BY YANG SONGDESIGN OF SECONDARY VOLTAGE AND STABILITY CONTROLS WITH MULTIPLE CONTROL OBJECTIVES","3642928":"Multi-objective optimization by genetic algorithm: a review","27544493":"Design of secondary voltage and stability controls with multiple control objectives","229550759":"A non‐dominance‐based online stopping criterion for multi‐objective evolutionary algorithms","271497278":"Optimization of social welfare and transmission losses in offshore MTDC networks through multi-objective genetic algorithm","226813591":"A Population and Interval Constraint Propagation Algorithm","266653687":"Two-stage non-dominated sorting and directed mating for solving problems with multi-objectives and constraints","265401796":"MULTIOBJECTIVE PARTICLE SWARM OPTIMIZATION: INTEGRATION OF DYNAMIC POPULATION AND MULTIPLE-SWARM CONCEPTS AND CONSTRAINT HANDLING","287649086":"Solving robot path planning problem by using a new elitist multi-objective IWD algorithm based on coefficient of variation","220218685":"Stochastic multi-objective models for network design problem.","4089888":"An evolutionary approach for finding optimal automatic vehicle identification reader locations in transportation networks","229036422":"Benchmark of Nature-inspired Optimization Algorithms in fields of single and multiobjective scopes","228341949":"A cellular genetic algorithm for multiobjective optimization","220375043":"Optimization of Road Networks Using Evolutionary Strategies","226918823":"The normalized normal constraint method for generating the Pareto frontier","3811097":"Two degree-of-freedom controllers for hard disk drives with novel reference signal generation","3949336":"An evolutionary algorithm for constrained multi-objective optimization","216300737":"On the convergence of multiobjective evolutionary algorithms","287294009":"MULTIPLE PERFORMANCE OPTIMIZATION IN MACHINING OF UD-GFRP COMPOSITES BY A PCD TOOL USING DISTANCE – BASED PARETO GENETIC ALGORITHM (DPGA)","242369368":"A Note on Optimality vs. Stability - A Genetic Algorithm based approach","257432435":"Self-adaptive differential evolution algorithm with α-constrained-domination principle for constrained multi-objective optimization","251860271":"A Tunable Constrained Test Problems Generator for Multi-objective Optimization","235318824":"Optimal structural design family by genetic search and ant colony approach","225110084":"Agent-Based Co-Operative Co-Evolutionary Algorithm for Multi-Objective Optimization","263222687":"Solution Method Of Optimal Scheme Set For Water Resources Scheduling Group Decision-Mahing Based On Multi-Agent Computation","2534934":"Hybrid Multi-Objective Evolutionary Computation of Constrained Downside Risk-Return Efficient Sets for Credit Portfolios","258152530":"Genetic Algorithm Optimization for the Active Control of a Beam by Means of PZT Actuators","238191107":"Approximating Pareto Curves Using the Hyper-Ellipse","249430767":"Non-dominated Rank based Sorting Genetic Algorithms","220739613":"Use of domain information to improve the performance of an evolutionary algorithm.","225532484":"Game Model-based Co-evolutionary Algorithm with Non-dominated Memory and Euclidean Distance Selection Mechanisms for Multi-objective Optimization","245416855":"Applications of the Non-Dominated Sorting Genetic Algorithm (NSGA) in Chemical Reaction Engineering","255638532":"Algoritmos Culturales Aplicados a Optimización con Restricciones y Optimización Multiobjetivo","263246216":"Improving a multi-objective differential evolution optimizer using fuzzy adaptation and [TEX equation: K] -medoids clustering","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","226748607":"Global and well-distributed Pareto frontier by modified normalized normal constraint methods for bicriterion problems","261238446":"An evolutionary algorithm using two-stage non-dominated sorting and directed mating for constrained multi-objective optimization","257583718":"Spatial genetic algorithm for multi-objective forest planning","222078465":"Multi-objective algorithm for solving N-version program design problem","245560802":"Multiobjective Model for Locating Automatic Vehicle Identification Readers","245231064":"Improved NSGA-II Multi-objective Genetic Algorithm Based on Hybridization-encouraged Mechanism","221006698":"A multiobjective approach for bidding recommendations in combinatorial auctions","245560554":"Mean-Variance Model for the Build-Operate-Transfer Scheme Under Demand Uncertainty","258511393":"Bicriterion Discrete Equilibrium Network Design Problem","242259513":"Un Algoritmo Basado en Evolución Diferencial para Resolver Problemas Multiobjetivo","291098644":"A Novel Hybrid Algorithm for Constrained Multi-objective Optimization","227881947":"Pareto‐Optimal Conceptual Design of the Structural Layout of Buildings Using a Multicriteria Genetic Algorithm","226012983":"Optimal synthesis method for transmission tower truss structures subjected to static and seismic loads","224393743":"Constraint Handling in Multiobjective Evolutionary Optimization","226348076":"Generation of moving structural systems in multiple evolutionary environments","2748283":"Multi-Objective Optimal Design Of Automotive Engine Using Genetic Algorithm","250058418":"Piecewise Quadratic Approximation of the Nondominated Set for Bi-Criteria Programs","287234632":"Evolution of genetic algorithms in classification rule mining","245506805":"Multiple response robust design and yield maximization","233313983":"A weight-based multiobjective immune algorithm: WBMOIA","220291960":"JMetal: A Java framework for multi-objective optimization","261042134":"Differential evolution with the Adaptive Penalty Method for constrained multiobjective optimization","265844100":"A new multi-objective mixed-discrete particle swarm optimization algorithm","224393218":"An intrinsically reliable and fast algorithm to compute the line spectrum pairs (LSP) in low bit rate CELP coding","221228401":"Constrained Test Problems for Multi-objective Evolutionary Optimization","222302494":"DEMORS: a hybrid multi-objective optimization algorithm using differential evolution and rough sets for constrained problems. Comput Oper Res","220105085":"MRMOGA: A new parallel multi-objective evolutionary algorithm based on the use of multiple resolutions","2507330":"The Generation Of Form Using An Evolutionary Approach","3865182":"A new constraint tournament selection method for multicriteria optimization using genetic algorithm","225637908":"On scalarizing functions in multiobjective optimization","257035316":"New cluster mapping tools for the graphical assessment of non-dominated solutions in multi-objective optimization","221608797":"MetaHybrid: Combining Metamodels and Gradient-Based Techniques in a Hybrid Multi-Objective Genetic Algorithm","223801661":"Optimal lens design by real-coded genetic algorithms using UNDX","221953622":"A Modified Distance Method for Multicriteria Optimization, Using Genetic Algorithms","2768198":"F1.12: Multicriteria Decision Making and Evolutionary Computation","220063602":"Mocell: a cellular genetic algorithm for multiobjective optimization. Int J Intell Syst","34466173":"Approaching sustainability in engineering design with multiple criteria decision analysis [electronic resource] /","233057431":"Transport Network Design Problem under Uncertainty: A Review and New Developments","220702035":"On the Use of Projected Gradients for Constrained Multiobjective Optimization Problems","4095307":"A novel multiobjective particle swarm optimization for buoys-arrangement design","239537712":"An Immune Algorithm for Engineering Optimization","227046911":"Immune Network Simulations in Multicriterion Design","271275100":"Novel frameworks for creating robust multi-objective benchmark problems","258021657":"A Hardware-based Multi-Disciplinary Design Optimization Method for Aeronautical Applications","236327278":"D(2)MOPSO: MOPSO based on Decomposition and Dominance with Archiving using Crowding Distance in Objective and Solution Spaces.","221567049":"A Simple and Efficient Anti-collision Algorithm for RFID System.","243666680":"F1.9 Multicriterion decision making","232617122":"Quantum Multi-objective Evolutionary Algorithm with Particle Swarm Optimization Method","268464512":"Multicriterion design of fuzzy structural systems using immune network simulation","216300646":"Multi-Objective Artificial Immune System for Optimization in Electrical Engineering","5532119":"Optimum Design of a Grazing-Incidence Flat-Field Spectrograph with a Spherical Varied-Line-Space Grating","223787218":"Design and Retrofit of Multi Objective Batch Plants via a Multi Criteria Genetic Algorithm","259406066":"A Modified Non-Dominated Sorting Genetic Algorithm with Fractional Factorial Design for Multi-Objective Optimization Problems","4201669":"MRMOGA: parallel evolutionary multiobjective optimization using multiple resolutions","276414207":"Optimal competitive freight network design as hierarchical variational inequalities programming problems","3419059":"AbYSS: Adapting Scatter Search to Multiobjective Optimization","223711452":"Genetic algorithms for optimal feedback control design","259162619":"A modified objective function method with feasible-guiding strategy to solve constrained multi-objective optimization problems","222080176":"IT-CEMOP: An iterative co-evolutionary algorithm for multiobjective optimization problem with nonlinear constraints","36418212":"Extended Evolutionary Algorithms for Multiobjective and Discrete Design Optimization of Structures","47715159":"MULTIOBJECTIVE SIMULATION OPTIMIZATION USING ENHANCED EVOLUTIONARY ALGORITHM APPROACHES","223074500":"Orthogonal simulated annealing for multiobjective optimization","220217519":"Multi-objective α-reliable path finding in stochastic networks with correlated link costs: A simulation-based multi-objective genetic algorithm approach (SMOGA)","227952644":"Multiobjective Bilevel Optimization for Transportation Planning and Management Problems","233076342":"Implementing co-evolution and parallelization in a multi-objective particle swarm optimizer","228941873":"IAC-04-U. 3A. 04 MULTIOBJECTIVE GLOBAL OPTIMIZATION OF SPACE MISSION DESIGN USING EVOLUTIONARY METHODS AND INTERVAL ANALYSIS","262892095":"A multi-objective evolutionary algorithm for EOL product recovery optimization: turbocharger case study. Int J Prod Res","2646461":"Multiobjective Evolutionary Algorithm Research: A History and Analysis","226150636":"Joint pricing and design of urban highways with spatial and user group heterogeneity","232875897":"Multiobjective design optimization by an evolutionary algorithm","3421614":"Multiobjective GA Optimization Using Reduced Models","226968349":"Interactive Nonlinear Multiobjective Procedures","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","226597402":"Multicriteria optimization of hard turning operation of the hardened 18HGT steel","228846654":"Modified predator-prey (MPP) algorithm for constrained multi-objective optimization","228846653":"Modified predator-prey algorithm for constrained and unconstrained multi-objective optimisation","225964502":"Minimum Effort Approximation of the Pareto Space of Convex Bi-Criteria Problems","233343563":"Optimal choice of wastewater treatment train by multi-objective optimization","221184908":"Agent-Based Co-Operative Co-Evolutionary Algorithm for Multi-Objective Optimization.","234802779":"Coello, C.A.C.: An updated survey of GA-based multi-objective optimization techniques. ACM Computing Surveys 32(2), 109-143","242626782":"OPTIMIZACIÓN MULTIOBJETIVO USANDO COLONIA DE HORMIGAS PARA UBICAR CONDENSADORES EN SISTEMAS DE DISTRIBUCIÓN Multi-Objective Optimization Using Ants Colony for Placed Capacitors on Distribution Systems","267553370":"Evolutionary Algorithms for Multi-Criterion Optimization: A Survey","222080407":"Immune optimization algorithm for constrained nonlinear multiobjective optimization problems","226825259":"A simulaton-based multi-objective genetic algorithm (SMOGA) for BOT network design problem","245235760":"AI in Control System Design Using a New Paradigm for Design Representation","277284905":"Observations in using grid technologies for multiobjective optimization","232897614":"A Bi-objective Traffic Counting Location Problem for Origin-destination Trip Table Estimation","223818727":"A tool for multiobjective evolutionary algorithms","221228446":"A Population and Interval Constraint Propagation Algorithm.","268574643":"Hybrid Multi-Gradient Explorer Algorithm for Global Multi-Objective Optimization","262228243":"ASMiGA: An archive-based steady-state micro genetic algorithm","221228444":"New Ideas in Applying Scatter Search to Multiobjective Optimization","222135694":"Solving a type of biobjective bilevel programming problem using NSGA-II","2440337":"Métaheuristiques pour l\u0027optimisation combinatoire multi-objectif: Etat de l\u0027art","245310505":"VIS: An artificial immune network for multi-objective optimization","226755891":"An Adaptive Penalty Function for Handling Constraint in Multi-objective Evolutionary Optimization","223456233":"Multi-Objective Optimisation of an Industrial Fluidized-Bed Catalytic Cracking Unit (FCCU) Using Genetic Algorithm (GA) With the Jumping Genes Operator","249667928":"New operators for multicriteria optimization using the modified distance method","223462888":"Stochastic multi-objective models for network design problem","278160941":"Multiple-response optimization of cutting forces in turning of UD-GFRP composite using Distance-Based Pareto Genetic Algorithm approach","222305276":"An exploration into evolutionary models for non-routine design","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","222048386":"A multiobjective immune algorithm based on a multiple-affinity model","2473370":"An Evolutionary Algorithm With A Multilevel Pairing Strategy For Single And Multiobjective Optimization","228892187":"Using multi-objective electromagnetism-like optimization to analyze inventory tradeoffs under probabilistic demand","233179993":"Constrained multi-objective optimization algorithm with an ensemble of constraint handling methods. Eng Optim","227700304":"Piecewise quadratic approximation of the non‐dominated set for bi‐criteria programs","237112544":"رهیافتی نوین برای اداره محدودیت در بهینه سازی چند هدفه با استفاده از الگوریتم بهینه سازی ازدحام ذرات","4037374":"A simulation-based mult-objective genetic algorithm (SMOGA) for transportation network design problem","225859507":"Leader identification and leader selection: Its effect on a swarm\u0027s performance for multi-objective design optimization problems","229574504":"Multi‐objective highway alignment optimization using a genetic algorithm","251664072":"Optimal trends in Manoeuvre Load Control at subsonic and supersonic flight points for tailless delta wing aircraft","26611548":"Optimización multiobjetivo usando colonia de hormigas para ubicar condensadores en sistemas de distribución","3693043":"Fuzzy goal programming using genetic algorithm","264178033":"Mass optimization of four bar linkage using genetic algorithms with dual bending and buckling constraints","253523923":"Total Design Optimization of Multi-Link Suspension System for Vehicle Handling and Stability.","221006844":"Constraint handling in multi-objective evolutionary optimization","268296236":"COORDINATED RESCHEDULING OF PRECAST PRODUCTION","2608382":"Afit/ds/eng/97-03","49282102":"Multi-level Ranking for Constrained Multi-objective Evolutionary Optimisation","259524769":"Improving the non-dominated sorting genetic algorithm using a gene-therapy method for multi-objective optimization","220565247":"A hybrid quantum-inspired immune algorithm for multiobjective optimization","256817042":"Optimal design of vertical natural circulation steam generator","220291324":"Genetic algorithms optimization for normalized normal constraint method under Pareto construction","221544405":"Evolutionary Multi-objective Optimization Algorithm with Preference for Mechanical Design.","257081520":"Multi-objective optimisation of batch separation processes","220371905":"An exploration into evolutionary models for non-routine design.","221008328":"Constrained multi-objective optimization algorithm with diversity enhanced differential evolution.","226282138":"Bi-objective bimodal urban road network design using hybrid metaheuristics","245429831":"Nongradient Methods in Multidisciplinary Design OptimizationStatus and Potential","269777401":"Water cycle algorithm for solving constrained multi-objective optimization problems","263387485":"MOIA: Multi-objective immune algorithm","268007688":"An Active Elitism Mechanism for Multi-objective Evolutionary Algorithms","224330156":"Dimensionality Reduction of Objectives and Constraints in Multi-objective Optimization Problems: A System Design Perspective","282270240":"Multi-Objective Evolutionary Optimization of Sandwich Structures: An Evaluation by Elitist Non-dominated Sorting Evolution Strategy","224645780":"Co-Evolutionary Multi-Agent System with Sexual Selection Mechanism for Multi-Objective Optimization","221008340":"Multi-objective optimisation by reinforcement learning","222727100":"Determination of optimum design spaces for topology optimization","225479562":"Efficient resource allocation for genetic algorithm based multi-objective optimization with 1,000 simulations","234102799":"Introducing transportation-related carbon footprint considerations in optimal urban road infrastructure management","228622427":"Evolutionary multi-objective optimization and its use in finance","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","221787332":"Agent-Based Co-Evolutionary Techniques for Solving Multi-Objective Optimization Problems","263779142":"Constrained Multiobjective Biogeography Optimization Algorithm"},"index":53}