{"abs":"This paper presents a method for solving the optimization problems that arise in hybrid systems. These systems are characterized by a combination of continuous and discrete event systems. The proposed method aims to find optimal design configurations that satisfy a goal performance. For exploring design parameter space, the proposed method integrates a metamodel and a metaheuristic method. The role of the metamodel is to give good initial candidates and reduced search space to the metaheuristic optimizer. On the other hand, the metaheuristic method improves the quality of the given candidates. This proposal also demonstrates a defense system that illustrates the practical application of the presented method. The optimization objective of the case study is to find the required operational capability configurations of a decoy that meet the desired measure of effectiveness. Through a comparison with a full search method, two metamodeling methods without the aid of metaheuristics and a metaheuristic method without the support of metamodels, we confirmed that the proposed method provides same high-quality solutions as those of the full search method at a small computational cost.","title":"Simulation-based optimization for design parameter exploration in hybrid system: A defense system example","id":258188145,"url":"https://www.researchgate.net/publication/258188145_Simulation-based_optimization_for_design_parameter_exploration_in_hybrid_system_A_defense_system_example","names":["Jeong Hee Hong","Kyung-Min Seo","Tag Gon Kim","SIMULATION: Transactions of The Society for Modeling and Simulation International"],"references":{"221526068":"General methodology 1: a robust simulation-based multicriteria optimization methodology.","223394386":"An advanced supply chain management tool based on modeling and simulation","235979028":"Integration of the GA and discrete-event computer simulation for decision support. Simulation","200621936":"“Thermodynamical Approach to the Traveling Salesman Problem: An Efficient Simulation Algorithm,”","220136468":"Modeling, simulation, sensitivity analysis, and optimization of hybrid systems","216756580":"Orthogonal Column Latin Hypercubes and Their Application in Computer Experiments","220165133":"Optimization of Logistic and Manufacturing Systems through Simulation: A Colored Petri Net-Based Methodology","220954424":"Interoperation of DEVS models and differential equation models using HLA/RTI: hybrid simulation of engineering and engagement level models.","222689488":"Optimal control of a distributed service system with moving resources: Application to the fleet sizing and allocation problem","251463781":"Chapter 18 Metamodel-Based Simulation Optimization","221525928":"Issues in development of simultaneous forward-inverse metamodels","260674199":"Supervisory Control of Hybrid Systems","223296239":"Modified iterated simulated annealing algorithm for structural synthesis","229914004":"Generating optimal configurations in structural design using simulated annealing","34029351":"Efficient nearly orthogonal and space-filling experimental designs for high-dimensional complex models /","221527568":"Simulation-based optimization: practical introduction to simulation optimization.","242595292":"Springer Series in Statistics","222542444":"Kochel, P.: Simulation-based sequencing and lot size optimisation for a production-and-inventory system with multiple items. Int. J. Prod. Econ. 104(1), 191-200","220909210":"Simulation-based optimisation using local search and neural network metamodels","223520610":"Optimization of transit route network, vehicle headways and timetables for large-scale transit networks","221616386":"Metamodel-Assisted Global Search Using a Probing Technique.","223282675":"Hybrid algorithm for discrete event simulation based supply chain optimization","221160848":"Optimal Design for Urban Mass Transit Network Based on Evolutionary Algorithms","3341197":"Artificial neural networks in manufacturing: Concepts, applications, and perspectives","3997820":"A robust simulation-based multicriteria optimization methodology","231373448":"A Simulation-Based Optimization Framework for Parameter Optimization of Supply-Chain Networks","228699753":"A simulation-based optimization framework for urban traffic control","220164686":"Simulation-Based Planning and Optimization in Multi-Echelon Supply Chains","228678643":"An expert system for network control problems and its applications in large scale network design under uncertainty","222615958":"Introduction to computation and learning in artificial neural networks","221900771":"Roli, A.: Metaheuristics in Combinatorial Optimization: Overview and Conceptual Comparison. ACM Comput. Survey 35, 268-308","23648438":"Modelling and optimization of average travel time for a metro line by simulation and response surface methodology","4053859":"Practical introduction to simulation optimization","223092755":"An efficient simulated annealing algorithm for design optimization of truss structures","263245167":"Optimization of transit network layout and headway with a combined genetic algorithm and simulated annealing method","225912468":"Thermodynamical Approach to the Traveling Salesman Problem: An Efficient Simulation Algorithm","245330551":"Design of manufacturing systems by a hybrid approach with neural network metamodelling and stochastic local search. Int J Prod Res","224244404":"Framework for Simulation of Hybrid Systems: Interoperation of Discrete Event and Continuous Simulators Using HLA/RTI","239771555":"Interoperation between Engagement-and Engineering-level Models for Effectiveness Analyses","216756608":"Efficient Nearly Orthogonal and Space-Filling Latin Hypercubes","245310322":"Kanban optimization by simulation and evolution","221526491":"Programming Combined Discrete-Continuous Simulation Models for Performance.","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","286918635":"Integration of the genetic algorithm and discrete-event computer simulation for decision support","223452068":"Generation of optimal schedules for metro lines using model predictive control","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","223801376":"Optimization of hybrid discrete/continuous dynamic systems","238668610":"Neural networks in business: a survey of applications (1992-1998). Expert Syst Appl","222721339":"Future Paths for Integer Programming and Links to Artificial Intelligence.” Computers \u0026 Operations Research 13, 533-549","241646744":"Measurement of Effectiveness for an Antitorpedo Combat System Using a Discrete Event Systems Specification-based Underwater Warfare Simulator"},"citedIn":{"266658864":"Multi-fidelity modeling \u0026 simulation methodology for simulation speed up","263977408":"Optimization of CO2 Capture Process with Aqueous Amines—A Comparison of Two Simulation–Optimization Approaches","264097267":"Multi-fidelity Modeling and Simulation Methodology to Enhance Simulation Performance of Engineering-level Defense Model"},"index":531}