{"abs":"In this paper we describe a method for improving genetic-algorithm-based optimization using informed genetic operators. The idea is to make the genetic operators such as mutation and crossover more informed using reduced models. In every place where a random choice is made, for example when a point is mutated, instead of generating just one random mutation we generate several, rank them using a reduced model, then take the best to be the result of the mutation. The proposed method is particularly suitable for search spaces with expensive evaluation functions, such as arise in engineering design. Empirical results in several engineering design domains demonstrate that the proposed method can significantly speed up the GA optimizer. 1 Introduction This paper concerns the application of Genetic Algorithms (GAs) in realistic engineering design domains. In such domains a design is represented by a number of continuous design parameters, so that potential solutions are vec...","title":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","id":2631230,"url":"https://www.researchgate.net/publication/2631230_Informed_operators_Speeding_up_genetic-algorithm-based_design_optimization_using_reduced_models","names":["Khaled Rasheed","Haym Hirsh"],"references":{"240342705":"The use of a co-operative multi-level CHC GA for structural shape optimization","2331428":"Guided Crossover: A New Operator for Genetic Algorithm Based Optimization","226464504":"Design by natural selection","228453399":"Evaluation of Injection Island GA Performance on Flywheel Design Optimisation","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","3810187":"Topographical mapping assisted evolutionary search for multilevel optimization","246923491":"NAWC Inlet Design and Analysis (NIDA) Code","2336982":"High Performance Supersonic Missile Inlet Design Using Automated Optimization","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","223938660":"Using Modeling Knowledge to Guide Design Space Search","243776152":"The utility of nonlinear programming algorithms"},"citedIn":{"220741224":"Comparison Of Methods For Using Reduced Models To Speed Up Design Optimization.","225989818":"An Evolutionary Multi-objective Adaptive Meta-modeling Procedure Using Artificial Neural Networks","286236877":"Sunglasses Styling Optimization System Based on User Interactions","228951393":"Resource-Aware Parameterizations of EDA","287855982":"User image oriented interactive genetic algorithm evaluation mode in product development","220742255":"A surrogate-assisted linkage inference approach in genetic algorithms","236263132":"Enhancing rule-based scheduling in wafer fabrication facilities by evolutionary algorithms: Review and opportunity","226700488":"Optimizing thermal design of data center cabinets with a new multi-objective genetic algorithm","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","220740645":"Fitness Approximation In Evolutionary Computation - a Survey.","259170620":"How can surrogates influence the convergence of evolutionary algorithms?","224570930":"A systems approach to evolutionary multiobjective structural optimization and beyond","246401533":"Humanoid Robot Simulation and Walking Behavior Development in the Spark Simulator Framework","3943657":"Improving the genetic algorithm performance in aerial spray deposition management","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","257635852":"Parameter control system of evolutionary algorithm that is aided by the entire search history","220048519":"Hybrid Metaheuristics","3421614":"Multiobjective GA Optimization Using Reduced Models","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","29637721":"Using Datamining Techniques to Help Metaheuristics: A Short Survey","241070275":"Speeding up a multiobjective genetic algorithm with constraints through artificial neuronal networks","254462516":"A surrogate-assisted and informed linkage aware GA","242190000":"A COMPARISON OF NATURE INSPIRED INTELLIGENT OPTIMIZATION METHODS IN AERIAL SPRAY DEPOSITION MANAGEMENT","265614475":"ADAPTIVE SURROGATE-ASSISTED EVOLUTION","220741321":"ASAGA: An adaptive surrogate-assisted genetic algorithm","287973384":"Informed mutation of wind farm layouts to maximise energy harvest","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","237787467":"Employment History","43294524":"Multivariate Markov networks for fitness modelling in an estimation of distribution algorithm.","44390025":"Comparison-Based Optimizers Need Comparison-Based Surrogates","220741511":"A Pareto Following Variation Operator for Fast-Converging Multiobjective Evolutionary Algorithms","277818592":"Update-based evolution control: A new fitness approximation method for evolutionary algorithms","232362088":"Successive approximate model based multi-objective optimization for an industrial straight grate iron ore induration process using evolutionary algorithm","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","225691072":"Improving multi-objective genetic algorithms with adaptive design of experiments and online metamodeling","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","276011975":"An Experimental Study on the User Evaluation Accuracy of Interactive Genetic Algorithms","223796067":"Virtual screening of materials using neuro-genetic approach: Concepts and implementation","43797802":"A Mono Surrogate for Multiobjective Optimization","221616386":"Metamodel-Assisted Global Search Using a Probing Technique.","286604770":"Behavioral study of the surrogate model-aware evolutionary search framework","2807889":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","263066450":"Evolutionary Surrogate Optimization of an Industrial Sintering Process","280304905":"SMAS: A Generalized and Efficient Framework for Computationally Expensive Electronic Design Optimization Problems","249944474":"Nature Inspired Heuristics in Aerial Spray Deposition Management"},"index":55}