{"abs":"High water level at the coast may be the result of different combinations of offshore hydrodynamic conditions (e.g. wave characteristics, offshore water level, etc.). Providing the contour of the \"critical\" set of offshore conditions leading to high water level is of primary importance either to constrain early warning networks based on hydro-meteorological forecast or observations, or for the assessment of the coastal flood hazard return period. The challenge arises from the use of computationally intensive simulators, which prevent the application of a grid approach consisting in extracting the contour through the systematic evaluation of the simulator on a fine design grid defined in the offshore conditions domain. To overcome such a computational difficulty, we propose a strategy based on the kriging meta-modelling technique combined with an adaptive sampling procedure aiming at improving the local accuracy in the regions of the offshore conditions that contribute the most to the estimate of the targeted contour. This methodology is applied to two cases using an idealized site on the Mediterranean coast (southern France): (1) a two-dimensional case to ease the visual analysis and aiming at identifying the combination of offshore water level and of significant wave height; (2) a more complex case aiming at identifying four offshore conditions (offshore water level and offshore wave characteristics: height, direction and period). By using a simulator of moderate computation time cost (a few tens of minutes), the targeted contour can be estimated using a cluster composed of a moderate number of computer units. This reference contour is then compared with the results of the meta-model-based strategy. In both cases, we show that the critical offshore conditions can be estimated with a good level of accuracy using a very limited number (of a few tens) of computationally intensive hydrodynamic simulations.","title":"A meta-modelling strategy to identify the critical offshore conditions for coastal flooding","id":235932802,"url":"https://www.researchgate.net/publication/235932802_A_meta-modelling_strategy_to_identify_the_critical_offshore_conditions_for_coastal_flooding","names":["Jérémy Rohmer","Déborah Idier","Natural Hazards and Earth System Sciences"],"references":{"233756716":"Importance of wave age and resonance in storm surges: The case Xynthia, Bay of Biscay","247385084":"Reliability and Statistical Methods in Engineering Design","223784721":"Empirical parameterization of setup, swash, and runup. Coast Eng","222653449":"Recent advances in Serre–Green Naghdi modelling for wave transformation, breaking and runup processes","223898442":"Response surfaces and sensitivity analyses for an environmental model of dose calculations","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","216300861":"A Taxonomy of Global Optimization Methods Based on Response Surfaces","45882790":"Global sensitivity analysis for models with spatially dependent outputs","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","254282230":"Unsolved Problems of Experimental Statistics","47683848":"A response surface methodology to address uncertainties in cap rock failure assessment for CO2 geological storage in deep aquifers","216301381":"The Design and Analysis Computer Experiments","225734295":"The Elements of Statistical Learning, Second Edition: Data Mining, Inference, and Prediction","232974919":"Coupled wave action and shallow-water modelling for random wave runup on a slope","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","229447169":"Inverse flood risk modeling under changing climatic conditions","222548334":"Reliability-based structural optimization using neural networks and Monte Carlo simulation","215722037":"A third-generation wave model for coastal regions, Part I, Model description and validation","257211067":"Extreme value of coastal wave overtopping accounting for climate change and sea level rise","222047635":"Efficient computation of maximum likelihood estimators in a spatial linear model with power exponential covariogram","228365548":"Sequential Experiment Design for Contour Estimation From Complex Computer Codes","222814327":"Recent advances in surrogate-based optimization","222517874":"Implementation and evaluation of nonparametric regression procedures for sensitivity analysis of computationally demanding models","252384767":"A third-generation wave model for coastal regions 1. Model description and validation. J Geophys Res C Oceans 104(C4):7649-7666","239522099":"Improving methodologies to assess the benefits of policies to address sea-level rise.","220164327":"Global sensitivity analysis of large-scale numerical landslide models based on Gaussian-Process meta-modeling","224840090":"Interpolation of Spatial Data: Some Theory For Kriging"},"citedIn":{"235617562":"Vulnerability of sandy coasts to climate variability","258806567":"Development of an inverse method for coastal risk management"},"index":554}