{"abs":"Over the past two decades, there has been a growing interest in developing predictive models of animal movement and force generation in fluids. In a departure from past studies that have asked how prescribed motions of a propulsor (wing or fin) generate lift and thrust during swimming and flying, we are increasingly interested in predicting the propulsor\u0027s movement as well as the forces generated by it. This interest, motivated by a need to understand the control and dynamics of locomotion and its applications to robotics and animal physiology, requires that we develop integrative models and analyses of swimming and flying that incorporate neural control and muscle physiology into more traditional biomechanical studies of locomotion in fluids. This approach extends from whole-animal studies to the molecular basis of force generation. In this paper, we explore mechanical tuning from the level of the whole animal to the proteins driving force generation in muscle.","title":"Animal movement, mechanical tuning and coupled systems","id":12737730,"url":"https://www.researchgate.net/publication/12737730_Animal_movement_mechanical_tuning_and_coupled_systems","names":["T L Daniel","M S Tu","Journal of Experimental Biology"],"references":{"253304409":"Hydromechanics of Swimming. (Book Reviews: Nekton)","31008411":"Muscle Dynamics in Fish During Steady Swimming","13905047":"Modulation of Negative Work Output from a Steering Muscle of the Blowfly Calliphora Vicina","229343087":"Models of central pattern generators as oscillators: the lamprey locomotor CPG","234304895":"Unsteady Aerodynamics of Insect Flight","13904925":"Computational fluid dynamic study of tadpole swimming","240591384":"A Computational Model of the Fluid Dynamics of Undulatory and Flagellar Swimming","231837891":"The orientation of muscle fibres in the myomeres of fishes. J Mar Biol Assoc UK 49: 263-290","243739989":"The heat of shortening and the dynamic constants of muscle. Proc R Soc Lond Ser B Biol Sci","239049580":"Integration of individual leg dynamics with whole body movement in arthropod locomotion","237109624":"Muscle Function in vivo: A Comparison of Muscles used for Elastic Energy Savings versus Muscles Used to Generate Mechanical Power 1","14629763":"Invertebrate swimming: integrating internal and external mechanics.","14629762":"Interactions between muscle activation, body curvature and the water in the swimming lamprey. Symp. Soc. Exp. Biol., 49:49-59","248235670":"Unsteady Mechanisms of Force Generation in Aquatic and Aerial Locomotion","234113322":"The Aerodynamics of Flight","15501646":"X-ray diffraction measurements of the extensibility of the actin and myosin filaments in muscle.","19970002":"Muscle function in locomotion","14212988":"Rate constant of muscle force redevelopment reflects cooperative activation as well as cross-bridge kinetics","232797380":"Leading-edge vortices in insect flight. Nature","279571021":"Modelling muscle power output in swimming fish","259673884":"Elastic Mechanisms in Animal Movement","13891067":"Howard, J. Molecular motors: structural adaptations to cellular functions. Nature 389, 561-567","15503620":"Actin compliance: Are you pulling my chain?","259674067":"Muscles, Reflexes, and Locomotion","17263725":"The variation of isometric tension with sarcomere length in vertebrate muscle fibres. J Physiol (Lond)","246796871":"Mechanical power output from striated muscle during cyclic contraction. J. Exp. Biol., 114:493-512","51327994":"Visual Input to the Efferent Control System of a Fly\u0027s \"Gyroscope\"","21561777":"Mechanical performance of scallop adductor muscle during swimming","249287009":"Coupling Internal and External Mechanics to Predict Swimming Behavior: A General Approach","18228715":"Proposed Mechanism of Force Generation in Striated Muscle","14738205":"Common Principles of Motor Control in Vertebrates and Invertebrates","15453973":"Isambert, H. et al. Flexibility of actin filaments derived from thermal fluctuations. Effect of bound nucleotide, phalloidin, and muscle regulatory proteins. J. Biol. Chem. 270, 11437−11444","51335665":"Compliant Realignment of Binding Sites in Muscle: Transient Behavior and Mechanical Tuning","229428883":"The Importance of Body Stiffness in Undulatory Propulsion"},"citedIn":{"221001480":"Using a genetic algorithm to optimize the gape of a snake jaw","253543829":"Flapping flexible fish. Periodic and secular body reconfigurations in swimming lamprey, Petromyzon marinus","240299870":"The origin of the avian flight stroke: A kinematic and kinetic perspective","5759834":"Mechanical aspects of legged locomotion control (Invited Paper)","30518236":"Contribution à la modélisation et à la commande des microsystèmes capteurs non linéaires","8095413":"A Spatially Explicit Nanomechanical Model of the Half-Sarcomere: Myofilament Compliance Affects Ca 2+ -Activation","4249775":"Using Artificial Organisms To Study The Evolution of Backbones in Fish","242090465":"The Vertebrate Body Axis: Evolution and Mechanical Function1","242155265":"Spatiallyexplicit,nano-mechanicalmodelsofthemuscle half-sarcomere:Implicationsforbiomechanicaltuningin atrophyandfatigue","236968463":"How Animals Move: Comparative Lessons on Animal Locomotion","257425158":"Relationship between body size and flying-related structures in Neotropical social wasps (Polistinae, Vespidae, Hymenoptera)","51059897":"Shifts in a single muscle\u0027s control potential of body dynamics are determined by mechanical feedback","222432145":"Spatially explicit, nano-mechanical models of the muscle half-sarcomere: Implications for biomechanical tuning in atrophy and fatigue","259330086":"Flapping flexible fish","51059896":"A single muscle\u0027s multifunctional control potential of body dynamics for postural control and running","23683165":"Frequency-dependent power output and skeletal muscle design.","11635111":"Effects of stretch receptor ablation on the optomotor control of lift in the hawkmoth Manduca sexta","259110315":"Long-term effects of whole-body vibration on motor unit contractile function and myosin heavy chain composition in the rat medial gastrocnemius","8147456":"Submaximal power output from the dorsolongitudinal flight muscles of the hawkmoth Manduca sexta","276105864":"Colloquium : Biophysical principles of undulatory self-propulsion in granular media","5684841":"A spatially explicit model of muscle contraction explains a relationship between activation phase, power and ATP utilization in insect flight"},"index":556}