{"abs":"We consider the computation of the volume of the union of high-dimensional geometric objects. While showing that this problem is #P-hard already for very simple bodies (i.e., axis-parallel boxes), we give a fast FPRAS for all objects where one can: (1) test whether a given point lies inside the object, (2) sample a point uniformly, (3) calculate the volume of the object in polynomial time. All three oracles can be weak, that is, just approximate. This implies that Klee’s measure problem and the hypervolume indicator can be approximated efficiently even though they are #P-hard and hence cannot be solved exactly in time polynomial in the number of dimensions unless P \u003d NP. Our algorithm also allows to approximate efficiently the volume of the union of convex bodies given by weak membership oracles. For the analogous problem of the intersection of high-dimensional geometric objects we prove #P-hardness for boxes and show that there is no multiplicative polynomial-time -approximation for certain boxes unless NP\u003dBPP, but give a simple additive polynomial-time ε-approximation.","title":"Lecture Notes in Computer Science","id":222540032,"url":"https://www.researchgate.net/publication/222540032_Lecture_Notes_in_Computer_Science","names":["Karl Bringmann","Tobias Friedrich","Computational Geometry"],"references":{"220780201":"Counting colors in boxes.","269900117":"New Upper Bounds in Klee’s Measure Problem","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","226145598":"Faster Hypervolume-Based Search Using Monte Carlo Sampling","2505506":"A Random Polynomial Time Algorithm For Approximating The Volume Of Convex Bodies","220427429":"On the Complexity of Computing the Measure of U[ai, bi].","220780334":"Thin Partitions: Isoperimetric Inequalities and a Sampling Algorithm for Star Shaped Bodies.","221499060":"The Mixing Rate of Markov Chains, an Isoperimetric Inequality, and Computing the Volume","4201672":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","221590520":"Sampling and Integration of Near Log-Concave functions","255671986":"Random Walks And An O*(n⁵) Volume Algorithm For Convex Bodies","248825285":"A random polynomial time algorithm for estimating volumes of convex bodies","4038184":"Simulated annealing in convex bodies and an O*(n4) volume algorithm","220778929":"Fully Polynomial Time Approximation Schemes for Stochastic Dynamic Programs","221591855":"Counting independent sets up to the tree treshold","221590699":"Simple deterministic approximation algorithms for counting matchings","222943831":"On the hardness of approximate reasoning","3498772":"New upper bounds in Klee\u0027s measure problem","2566981":"Chan, T.M.: Semi-online maintenance of geometric optima and measures. SIAM J. Comput. 32, 700-716","237898893":"Algorithms for Klee\u0027\u0027s rectangle problems","220990927":"An average running time analysis of a backtracking algorithm to calculate the measure of the union of hyperrectangles in $d$ dimensions.","220983886":"Computing the volume of the union of cubes","220452869":"Computing the Volume is Difficulte.","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2123206":"Counting without sampling. New algorithms for enumeration problems using statistical physics","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","223637491":"Monte-Carlo approximation algorithms for enumeration problems","2766722":"Random Walks And An O*(n 5 ) Volume Algorithm For Convex Bodies","220617231":"On the Complexity of Computing the Volume of a Polyhedron","222823460":"Simulated annealing in convex bodies and an O*(n4) volume algorithm","260783846":"The problem of calculating the volume of a polyhedron is enumerably hard","220172399":"Monte-Carlo algorithms for the planar multiterminal network reliability problem","220406867":"The Measure Problem for Rectangular Ranges in d-Space.","220345811":"Random Walks in a Convex Body and an Improved Volume Algorithm.","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","220421072":"A Note on a Method for Generating Points Uniformly on N-Dimensional Spheres.","221591053":"Computing the Volume Is Difficult","266239206":"Can the Measure of ∪ n 1 [ a i , b i ] be Computed in Less Than O(n logn) Steps?","223855918":"A (Slightly) Faster Algorithm for Klee\u0027s Measure Problem","2128538":"Correlation decay and deterministic FPTAS for counting colorings of a graph","4279871":"A Fast Algorithm for Computing the Contribution of a Point to the Hypervolume"},"citedIn":{"283989612":"A Hybrid Simulation Study on Wide Area Measurement Feedback for Enhanced Tolerance to Protection Misoperations★★This work is supported by New York State Energy Research and Development Authority (NYSERDA) under contract #30733, managed by Michael Razanousky.","220935465":"Weighted Preferences in Evolutionary Multi-objective Optimization","262368545":"Parameterized average-case complexity of the hypervolume indicator","261342864":"Measuring algorithm footprints in instance space","261030283":"Multiplicative Approximations, Optimal Hypervolume Distributions, and the Choice of the Reference Point","220740015":"Integrating decision space diversity into hypervolume-based multiobjective search","220742944":"Articulating User Preferences in Many-Objective Problems by Sampling the Weighted Hypervolume","280534066":"Bi-goal evolution for many-objective optimization problems","253294995":"The Attainment-Function Approach to Stochastic Multiobjective Optimizer Assessment and Comparison","235355018":"Lecture Notes in Computer Science","229329189":"Quick HyperVolume","259084900":"Speeding up many-objective optimization by Monte Carlo approximations","220289972":"Stochastic convergence of random search methods to fixed size Pareto front approximations","257428813":"Computing Klee’s Measure of Grounded Boxes","264855123":"Klee\u0027s Measure Problem on Fat Boxes in Time O(n (d+2)/3 )","261054099":"Efficient parent selection for Approximation-Guided Evolutionary multi-objective optimization","262211715":"A New Multi-Objective Evolutionary Algorithm Based on a Performance Assessment Indicator","220741262":"Multiobjectivization for parameter estimation: A case-study on the segment polarity network of Drosophila","216300866":"Non-monotonicity of Observed Hypervolume in 1-Greedy S -Metric Selection","241623627":"On Klee\u0027s measure problem for grounded boxes","220741273":"Scaling up indicator-based MOEAs by approximating the least hypervolume contributor: A preliminary study","277717819":"Optimizing an Amplifier by a Many-Objective Algorithm Based on R2 Indicator","265799530":"TOWARDS ENHANCING SOLUTION SPACE DIVERSITY IN MULTI-OBJECTIVE OPTIMIZATION: A HYPERVOLUME-BASED APPROACH","284121644":"Selection mechanisms based on the maximin fitness function to solve multi-objective optimization problems","38092673":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","226145598":"Faster Hypervolume-Based Search Using Monte Carlo Sampling","216457248":"The maximum hypervolume set yields near-optimal approximation","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","262292324":"Population size matters: Rigorous runtime results for maximizing the hypervolume indicator","266653730":"On set-based local search for multiobjective combinatorial optimization","257356573":"An improved algorithm for Klee\u0027s measure problem on fat boxes","47843222":"Don\u0027t be greedy when calculating hypervolume contributions","220741223":"Convergence of Hypervolume-Based Archiving Algorithms","282970380":"An alternative hypervolume-based selection mechanism for multi-objective evolutionary algorithms","210205139":"Computing Hypervolume Contributions in Low Dimensions: Asymptotically Optimal Algorithm and Complexity Results","254200434":"Efficient Geometrically Exact Continuous Collision Detection","241770161":"Convergence of Hypervolume-Based Archiving Algorithms II: Competitiveness","225836716":"A Hypervolume-Based Optimizer for High-Dimensional Objective Spaces","229431286":"A fast dimension-sweep algorithm for the hypervolume indicator in four dimensions","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","47843204":"Multiplicative Approximations and the Hypervolume Indicator","283551928":"Indicator-Based Selection","221608788":"Multi-Objective Optimization with an Adaptive Resonance Theory-Based Estimation of Distribution Algorithm: A Comparative Study.","266653824":"A fast approximation-guided evolutionary multi-objective algorithm","263586138":"R 2 Indicator-Based Multiobjective Search","220310732":"Achieving balance between proximity and diversity in multi-objective evolutionary algorithm","220991297":"A Discrete and Dynamic Version of Klee\u0027s Measure Problem.","220812487":"Approximation-Guided Evolutionary Multi-Objective Optimization.","226152842":"Automated Aggregation and Omission of Objectives for Tackling Many-Objective Problems","216457236":"Set-based multi-objective optimization, indicators, and deteriorative cycles","279460698":"Efficient transformations for Klee\u0027s measure problem in the streaming model","269040767":"Seeding the Initial Population of Multi-Objective Evolutionary Algorithms: A Computational Study","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","251316109":"Hypervolume-based multi-objective local search","272846394":"Efficient optimization of many objectives by approximation-guided evolution","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice"},"index":56}