{"abs":"The focus of the present paper is the determination of the lower and upper bounds of the probability of failure under uncertain inputs by means of random set theory. Under this general framework, it is possible to model uncertainty in the form of probability boxes, fuzzy sets, cumulative distribution functions, Dempster-Shafer structures or intervals; in addition the dependence between the input variables can be expressed using copulas. In order to speed up the calculation, a very efficient probability-based reliability method known as ``subset simulation\u0027\u0027 will be used. This method is specially suited for finding small probabilities of failure in both low- and high-dimensional spaces, disjoint failure regions and nonlinear limit state functions. The proposed method represents a drastic reduction of the computational labor implied by plain Monte Carlo simulation for problems defined with a mixture of representations for the input variables, while delivering similar results. The numerical experiments show the usefulness of the proposed approach.","title":"Estimation of the Lower and Upper Probabilities of Failure Using Random Sets and Subset Simulation","id":269191450,"url":"https://www.researchgate.net/publication/269191450_Estimation_of_the_Lower_and_Upper_Probabilities_of_Failure_Using_Random_Sets_and_Subset_Simulation","names":["Diego A. Alvarez","Jorge E. Hurtado","Felipe Uribe"],"references":{"228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","38365305":"Upper and Lower Probabilities Induced by a Multi-Valued Mapping","266986639":"An Introduction to Random Sets","223936769":"On the calculation of the bounds of probability of events using infinite random sets","256476387":"An Introduction to Copulas (Springer Series in Statistics)","245034097":"A Random Variables and Stochastic Process","245367053":"Unified Uncertainty Analysis by the First Order Reliability Method","222194593":"A Monte Carlo-based method for the estimation of lower and upper probabilities using infinite random sets of idexable type","265366078":"Random Variables and Stochastic Processes"},"citedIn":{"280224186":"Efficient Monte Carlo Algorithm For Rare Failure Event Simulation","281863842":"Line sampling approach for extreme case analysis in presence of aleatory and epistemic uncertainties"},"index":560}