{"abs":"Sonomicrometrics of in vivo axial strain of muscle has shown that the swimming fish body bends like a homogenous, continuous beam in all species except tuna. This simple beam-like behavior is surprising because the underlying tendon structure, muscle structure and behavior are complex. Given this incongruence, our goal was to understand the mechanical role of various myoseptal tendons. We modeled a pumpkinseed sunfish, Lepomis gibbosus, using experimentally-derived physical and mechanical attributes, swimming from rest with steady muscle activity. Axially oriented muscle-tendons, transverse and axial myoseptal tendons, as suggested by current morphological knowledge, interacted to replicate the force and moment distribution. Dynamic stiffness and damping associated with muscle activation, realistic muscle force generation, and force distribution following tendon geometry were incorporated. The vertebral column consisted of 11 rigid vertebrae connected by joints that restricted bending to the lateral plane and endowed the body with its passive viscoelasticity. In reaction to the acceleration of the body in an inviscid fluid and its internal transmission of moment via the vertebral column, the model predicted the kinematic response. Varying only tendon geometry and stiffness, four different simulations were run. Simulations with only intrasegmental tendons produced unstable axial and lateral tail forces and body motions. Only the simulation that included both intra- and intersegmental tendons, muscle-enhanced segment stiffness, and a stiffened caudal joint produced stable and large lateral and axial forces at the tail. Thus this model predicts that axial tendons function within a myomere to (1) convert axial force to moment (moment transduction), (2) transmit axial forces between adjacent myosepta (segment coupling), and, intersegmentally, to (3) distribute axial forces (force entrainment), and (4) stiffen joints in bending (flexural stiffening). The fact that all four functions are needed to produce the most realistic swimming motions suggests that axial tendons are essential to the simple beam-like behavior of fish.","title":"Force transmission via axial tendons in undulating fish: A dynamic analysis","id":10987255,"url":"https://www.researchgate.net/publication/10987255_Force_transmission_via_axial_tendons_in_undulating_fish_A_dynamic_analysis","names":["John H Long, Jr","Bruce Adcock","Robert G Root","Comparative Biochemistry and Physiology - Part A Molecular \u0026 Integrative Physiology"],"references":{"12737729":"A mechanical analysis of myomere shape in fish","220450471":"A combined neuronal and mechanical model of fish swimming. Biol Cybern","229428900":"Mechanical control of swimming speed: Stiffness and axial wave form in undulating fish models","231837891":"The orientation of muscle fibres in the myomeres of fishes. J Mar Biol Assoc UK 49: 263-290","12665684":"Evolution and Development of a Central Pattern Generator for the Swimming of a Lamprey","241069769":"Mechanical design for swimming: Muscle, tendon, and bone","246913966":"Myotomal muscle function at different points in the body of a swimming fish","227705611":"The horizontal septum: mechanics of force transfer in locomotion of scombrid fishes (Scombridae, Perciformes). J Morph","21158623":"Myofilament overlap in swimming carp. II. Sarcomere length change during swimming","37423909":"Evolving Swimming Controllers for a Simulated Lamprey with Inspiration from Neurobiology","264474219":"Function of red axial muscle of carp (Cyprinus carpio L.) : Recruitment and normalised power output during swimming in different modes","12159633":"The influence of thermal acclimation on power production during swimming II Mechanics of scup red muscle under in vivo conditions. J Exp Biol","12159632":"The influence of thermal acclimation on power production during swimming. Part I. In vivo stimulation and length change pattern of scup red muscle","12159634":"Wake dynamics and fluid forces of turning maneuvers in sunfish","16091486":"Tail thrust of bluefish Pomatomus saltatrix at different buoyancies, speeds, and swimming angles.","12888937":"Red muscle activation patterns in yellowfin (Thunnus albacares) and skipjack (Katsuwonus pelamis) tunas during steady swimming. J Exp Biol","12888938":"Muscle dynamics in skipjack tuna: timing of red muscle shortening in relation to activation and body curvature during steady swimming. J Exp Biol","261950515":"Mechanical Design in Organism","13499490":"Mechanics of the fast-start: muscle function and the role of intramuscular pressure in the escape behavior of Amia calva and Polypterus palmas. J Exper Bio","261144354":"A continuous beam model for swimming fish","13904743":"Functions of fish skin: Flexural stiffness and steady swimming of longnose gar Lepisosteus osseus","13904995":"Undulatory swimming: How traveling waves are produced and modulated in sunfish (Lepomis gibbosus)","245097004":"Cable-Strut Systems: Part I - Tensegrity","21105146":"Skeletal muscle deformation in the lateral muscle of the intact rainbow trout Oncorhynchus mykiss during fast start maneuvers.","12036621":"High-speed swimming. Enhanced power in yellowfin tuna","230005646":"Locomotory design of ‘cyclostome’ fishes: Spatial arrangement and architecture of myosepta and lamellae","239059587":"Singularities and Groups in Bifurcation Theory Volume I","11838347":"Spatial variation in fast muscle function of the rainbow trout Oncorhynchus mykiss during fast-starts and sprinting","31008412":"Muscles, Elastic Energy, and the Dynamics of Body Stiffness in Swimming Eels","13477381":"Self-propelled anguilliform swimming: Simultaneous solution of the two-dimensional Navier-Stokes equations and Newton\u0027s laws of motion","222972934":"Static and dynamic analyses of tensegrity structures. Part 1. Nonlinear equations of motion","13904772":"Mechanical control of swimming speed: Stiffness and axial wave form in undulating fish models","13904775":"Experimental simulation of the thrust phases of fast-start swimming of fish","13722885":"Muscle power output limits fast-start performance in fish","2680688":"From Lampreys to Salamanders: Evolving Neural Controllers for Swimming and Walking","10987262":"Spatial arrangement of white muscle fibers and myoseptal tendons in fishes","228869118":"Modeling a swimming fish with an initial boundary value problem: Unsteady maneuvers of an elastic plate with internal force generation","12677658":"Power production during steady swimming in largemouth bass and rainbow trout","233984942":"Fast continuous swimming of saithe (Pollachius virens): a dynamic analysis of bending moments and muscle power. J Exp Biol","10987258":"Morphology and mechanics of myosepta in a swimming salamander (Siren lacertina)","12416482":"A hydrodynamic analysis of fish swimming speed: Wake structure and locomotor force in slow and fast labriform swimmers","256802863":"Bending Moment Distribution along Swimming Fish","12838690":"Locomotor forces on a swimming fish: Three-dimensional vortex wake dynamics quantified using digital particle image velocimetry. Journal of Experimental Biology, 202(18), 2393-2412","13360686":"Muscle strain histories in swimming milkfish in steady and sprinting gaits","13360685":"White muscle strain in the common carp and red to white muscle gearing ratios in fish","12467673":"Slow muscle function of Pacific bonito (Sarda chiliensis) during steady swimming. J Exp Biol","14277168":"Muscle length changes during swimming in scup: sonomicrometry verifies the anatomical high-speed cine technique. J Exp Biol","247641390":"Statics and Strength of Materials","12917418":"Simulations of neuromuscular control in lamprey swimming","14866198":"How fish power swimming. Science","35123567":"Structure and function of the teleost axial skeleton : with particular reference to the North American yellow perch (Perca flavescens Mitchell, Percidae) /","3231050":"Modeling the dynamics of spring-driven oscillating-foil propulsion. IEEE J Ocean Eng","223069750":"Tensegrity spline beam and grid shell structures","215618085":"Inequalities in Mechanics \u0026 Physics","268635132":"A derivation of degenerate von Kármán equations for strongly anisotropic plates"},"citedIn":{"7417905":"The myoseptal system in Chimaera monstrosa: Collagenous fiber architecture and its evolution in the gnathostome stem lineage","259517879":"The role of mechanical resonance in the neural control of swimming in fishes","259090353":"Mechanics of fish skin: A computational approach for bio-inspired flexible composites","234164595":"The homology and origins of intermuscular bones in fishes: Phylogenetic or biomechanical determinants?","51215115":"Comparative axial morphology in pinnipeds and its correlation with aquatic locomotory behavior","221985341":"Dynamic formation of microenvironments at the myotendinous junction correlates with muscle fiber morhogenesis in zebrafish","233047148":"Influence of Incision Location on Transmitter Loss, Healing, Survival, Growth, and Suture Retention of Juvenile Chinook Salmon","213774516":"Structure, Kinematics, And Muscle Dynamics In Undulatory Swimming","237012330":"Structure and Mechanical Performance of a \u0027\u0027Modern\u0027\u0027 Fish Scale","251006845":"On the Strouhal number of fish undulatory swimming: A simple predictive analysis based on the buckling of columns","10987254":"Tendon - Bridging the gap","276466987":"Imitation of the body/caudal fin undulatory swimming of a spiny dogfish (Squalus acanthias): The kinematic equation","223136670":"Optimal shape and motion of undulatory swimming organisms","282570437":"Surface microstructural features of scales in relation to toxic stress of Basic Violet-1","284711852":"Different ossification patterns of intermuscular bones in fish with different swimming modes","7978285":"Fast-start muscle dynamics in the rainbow trout Oncorhynchus mykiss: Phase relationship of white muscle shortening and body curvature","6673714":"Loss of selenoprotein N function causes disruption of muscle architecture in the zebrafish embryo","6937008":"Numerical model of self-propulsion in a fluid","10987262":"Spatial arrangement of white muscle fibers and myoseptal tendons in fishes","51130454":"Testing Biomimetic Structures in Bioinspired Robots: How Vertebrae Control the Stiffness of the Body and the Behavior of Fish-Like Swimmers","51113361":"Go Reconfigure: How Fish Change Shape as They Swim and Evolve","7417873":"Myoseptal architecture of sarcopterygian fish and salamanders with special reference to Ambystoma maxicanum.","221001480":"Using a genetic algorithm to optimize the gape of a snake jaw","228502331":"On the mechanics of fishscale structures","283450752":"Structure and mechanical properties of selected protective systems in marine organisms","227903795":"Undulatory fish swimming: From muscles to flow","234090005":"Mechanics of Undulatory Swimming in a Frictional Fluid","227186531":"The musculoskeletal system of the caudal fin in basal Actinopterygii: Heterocercy, diphycercy, homocercy","228623241":"Biomimetic robotics: Self-propelled physical models test hypotheses about the mechanics and evolution of swimming vertebrates","10698953":"Evolutionary transformations of myoseptal tendons in gnathostomes. Proc R Soc B","7650654":"Muscle fiber angle, segment bulging and architectural gear ratio in segmented musculature","23297870":"Time-Lapse Analysis and Mathematical Characterization Elucidate Novel Mechanisms Underlying Muscle Morphogenesis","273180518":"A Stiffness-Adjusting Method to Improve Thrust Efficiency of a Two-Joint Robotic Fish","4249775":"Using Artificial Organisms To Study The Evolution of Backbones in Fish","23195859":"Muscle development is disrupted in zebrafish embryos deficient for fibronectin. Dev Dyn","248563619":"Skin and Bones, Sinew and Gristle: the Mechanical Behavior of Fish Skeletal Tissues","248553763":"La régionalisation morphofonctionnelle de l’axe vertébral chez les Téléostéens en relation avec le mode de nage","248396413":"X-ray motion analysis of the vertebral column during the startle response in striped bass, Morone saxatilis","248563621":"Fast‐start Mechanics","47635811":"Interactions between internal forces, body stiffness, and fluid environment in a neuromechanical model of lamprey swimming","5956768":"The musculotendinous system of an anguilliform swimmer: Muscles, myosepta, dermis, and their interconnections inAnguilla rostrata","51701999":"Swimming fundamentals: Turning performance of leopard sharks (Triakis semifasciata) is predicted by body shape and postural reconfiguration"},"index":561}