{"abs":"Abstract The perturbation method has been among the most popular stochastic finite element methods due to its simplicity and efficiency. The error estimation for the perturbation method is well established for deterministic problems, but until now there has not been an error estimation developed in the probabilistic context. This paper presents a priori error estimation for the perturbation method in solving stochastic partial differential equations. The physical problems investigated here come from linear elasticity of heterogeneous materials, where the material parameters are represented by stochastic fields. After applying the finite element discretization to the physical problem, a stochastic linear algebraic equation system is formed with a random matrix on the left hand side. Such systems have been efficiently solved by using the stochastic perturbation approach, without knowing how accurate/inaccurate the perturbation solution is. In this paper, we propose a priori error estimation to directly link the error of the solution vector with the variation of the source stochastic field. A group of examples are presented to demonstrate the effectiveness of the proposed error estimation.","title":"A priori error estimation for the stochastic perturbation method","id":271197912,"url":"https://www.researchgate.net/publication/271197912_A_priori_error_estimation_for_the_stochastic_perturbation_method","names":["Xiangyu Wang","Song Cen","Chen-Feng Li","D.R.J. Owen","Computer Methods in Applied Mechanics and Engineering"],"references":{"222125503":"Robust design of structures using optimization methods","236028947":"On the least squares stochastic ﬁnite element analysis of the steel skeletal towers exposed to ﬁre","235310223":"A novel joint diagonalization approach for linear stochastic systems and reliability analysis","225697401":"Developments in stochastic structural mechanics","222432847":"Theory and methodology for estimation and control of errors due to modeling, approximation, and uncertainty","235941378":"Perturbation-based stochastic finite element analysis of the interface defects in composites via Response Function Method","223216090":"Probability finite elements for nonlinear structural dynamics","223926849":"Polynomial chaos expansion for sensitivity analysis","51991936":"The Wiener--Askey Polynomial Chaos for Stochastic Differential Equations","245284866":"Random Vibration of Flexible, Uncertain Beam Element","230725468":"The Algebric Eigenvalue Problem","227088660":"Spectral techniques for stochastic finite elements","229485618":"Random Field Finite Elements","222493410":"Ingredients for a general purpose stochastic finite elements implementation. Comput Methods Appl Mech Eng","239368679":"About the accuracy of a novel response surface method for the analysis of finite element modeled uncertain structures","242163658":"Fourier representation of random media fields in stochastic finite element modeling","263624465":"Perturbation Based Stochastic Finite Element Analysis of the Structural Systems with Composite Sections under Earthquake Forces","223750527":"Numerical solution of spectral stochastic finite element systems","235944124":"Perturbation based stochastic finite element method for homogenization of two-phase elastic composites","275857629":"Perturbation stochastic finite element-based homogenization of polycrystalline materials","245284529":"Neumann Expansion for Stochastic Finite Element Analysis","256522361":"Approximate Analysis of Response Variability of Uncertain Linear Systems","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","229494686":"A Fourier–Karhunen–Loeve discretization scheme for random material properties in SFEM","257424608":"Iterative solution of systems of linear equations arising in the context of the stochastic FEM","222791536":"The stochastic finite element method: Past, present and future. Comput Methods Appl Mech Eng","245284262":"Response Variability Of Stochastic Finite Element Systems","222024322":"Generalized buckling analysis of laminated plates with random material properties using stochastic finite elements","223437291":"Neumann dynamic stochastic finite element method of vibration for structures with stochastic parameters to random excitation","262564124":"On generalized stochastic perturbation-based finite elements","245323044":"The Robust Optimization for Large-Scale Space Structures Subjected to Thermal Loadings","265367402":"The Stochastic Finite Element Method: Basic Perturbation Technique and Computer Implementation","230872573":"Solving elliptic boundary value problems with uncertain coefficients by the finite element method: The stochastic formulation","223411729":"An exact solution for the static and dynamic analysis of FE discretized uncertain structures","247021296":"On solving stochastic initial value differential equations","223590046":"Generalized perturbation-based stochastic finite element method in elastostatics","247530133":"Simulation of MultiDimensional Gaussian Stochastic Fields by Spectral Representation","263876462":"On solving stochastic initial-value differential equations","223185941":"Robust design of viscoelastic structures based on stochastic finite element models","247650456":"Stochastic Finite Element Analysis of Simple Beams","269155414":"On the Generalised Perturbation-Based Stochastic Finite Element Method","256917900":"Explicit solution to stochastic system of linear algebraic equations (α1A1 + α2A2 + … + αmAm)x \u003d b","222351395":"Uncertainties in Probabilistic Numerical Analysis of Structures and Solids – Stochastic Finite Elements","222251738":"A new approach for the stochastic analysis of finite element modelled structures with uncertain parameters","223816767":"Application of stochastic finite element method to optimal design of structures","51991920":"Spanos, P.: Stochastic Finite Element: a Spectral Approach. Springer, New York","220096628":"Generalized stochastic perturbation technique in engineering computations","260498156":"Simulation of Stochastic Processes by Spectral Representation","258392333":"Generalized Neumann Expansion and Its Application in Stochastic Finite Element Methods","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","222367541":"Stochastic finite element analysis of shells with combined random material and geometric properties","244443236":"Structural Response Variability","245303529":"Effects of Uncertain Material Properties on Structural Stability","223740448":"A joint diagonalisation approach for linear stochastic systems","245185899":"On the accuracy of the polynomial chaos approximation","229351762":"Parallel solution methods for stochastic finite element analysis using Monte Carlo simulation","220411996":"Numerical Challenges in the Use of Polynomial Chaos Representations for Stochastic Processes"},"citedIn":{},"index":564}