{"abs":"This study presents an effective simulation framework with importance splitting (ISp) method for estimating small failure probabilities of dynamic structures with multi-correlated stochastic excitations, and addresses its application to predictions of large wind turbine extreme responses. The ISp method, also referred to as subset simulation with splitting, splits important sample paths into multiple branches at various stages in the simulation. It permits the estimation of a small failure probability of a rare event through estimations of conditional probabilities of intermediate subset events. The framework presented in this study combines the ISp method with multivariate autoregressive (MAR) modeling of stochastic excitations. The MAR model of excitations is established based on their cross power spectral density matrix, which transfers the stochastic excitations as the output of a loading system with a vector-valued uncorrelated white noise process as input. This scheme is very efficient in generating offsprings of loading and response time histories conditional on the intermediate events with very low rejection rate, which facilities the application of ISp method to different kinds of stochastic single and multiple excitations. The effectiveness and accuracy of the proposed new scheme are verified by a reliability problem of earthquake-excited 5-story building, and by the estimation of extreme responses of a 5 MW onshore wind turbine with very small exceeding probabilities. Finally, this framework is applied to validate the extrapolation procedure of estimating wind turbine long-term extreme responses with various mean recurrence intervals from short-term simulations of turbine response histories, which is mandated by current wind turbine design standards.","title":"Assessing small failure probability by importance splitting method and its application to wind turbine extreme response prediction","id":236868988,"url":"https://www.researchgate.net/publication/236868988_Assessing_small_failure_probability_by_importance_splitting_method_and_its_application_to_wind_turbine_extreme_response_prediction","names":["Jie Ding","Xinzhong Chen","Engineering Structures"],"references":{"236868895":"Evaluation of peak resultant response for wind-excited tall buildings","274585758":"Failure Probability Estimation of Wind Turbines by Enhanced Monte Carlo Method","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","2366242":"Predicting Design Wind Turbine Loads From Limited Data: Comparing Random Process And Random Peak Models","245367590":"Moment-Based Load and Response Models With Wind Engineering Applications","227879581":"Wind turbine load level based on extrapolation and simplified loads","241961062":"Definition of a 5MW Reference Wind Turbine for Offshore System Development","235748166":"Statistical Extrapolation Methods for Estimating Wind Turbine Extreme Loads [21]","3023205":"A large deviations perspective on the efficiency of multilevel splitting","222880131":"Importance sampling for randomly excited dynamical systems","242386046":"Estimation of Particle Transmission by Random Sampling","250693053":"Reliability Estimation for Dynamical Systems Subject to Stochastic Excitation using Subset Simulation with Splitting","231079689":"An overview of importance splitting for rare event simulation","222477644":"ARMA systems in wind engineering","245284560":"Nonlinear Vibration Models for Extremes and Fatigue","222754711":"Digital Simulation of random processes","257101313":"Assessment of low probability events of dynamical systems by controlled Monte Carlo simulation","220658930":"Analysis of RESTART simulation: Theoretical basis and sensitivity study","259118116":"Closure to “Applications of asymptotic sampling on high dimensional structural dynamic Problems” by M.T. Sichani, S.R.K. Nielsen and C. Bucher","3786543":"A comparison of RESTART implementations","223106779":"Important sampling in high dimensions","244985741":"Database for Validation of Design Load Extrapolation Techniques","258724338":"Outlier robustness for wind turbine extrapolated extreme loads","245302149":"Artificial Wind Generation and Structural Response","257940484":"Structural Reliability Analysis, Prediction","222372826":"Estimation of extreme values from sampled time series","51945859":"Bayesian Post-Processor and other Enhancements of Subset Simulation for\nEstimating Failure Probabilities in High Dimensions","223325330":"Hybrid Subset Simulation Method for Reliability Estimation of Dynamical Systems Subject to Stochastic Excitation","222933783":"Asymptotic sampling for high-dimensional reliability analysis","275095174":"Linear Prediction Theory for Digital Simulation of Sea Waves","222814884":"Application of line sampling simulation method to reliability benchmark problems","223760949":"Integration of non-Gaussian fields","254215172":"First passage probability estimation of wind turbines by Markov Chain Monte Carlo","254774667":"Aeroelastic Analysis of Bridges under Multicorrelated Winds: Integrated State-Space Approach","37616984":"On the Importance Function in Splitting Simulation","231058979":"Extreme wind turbine response during operation","245367558":"Effect of Turbulence Variation on Extreme Loads Prediction for Wind Turbines","222378983":"The role of the design point for calculating failure probabilities in view of dimensionality and structural nonlinearities","241080889":"Applications of asymptotic sampling on high dimensional structural dynamic problems","246971935":"Nonlinear vibration model for extremes and fatigue","223168999":"Reliability of structures in high dimensions, Part I: Algorithms and applications","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","41035459":"The splitting method in rare event simulation","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","227762991":"Extreme loads for an offshore wind turbine using statistical extrapolation from limited field data [23]","220136480":"A Variant of Importance Splitting for Rare Event Estimation: Fixed Number of Successes","229363028":"Importance sampling for stochastic systems under stationary noise having a specified power spectrum","251544513":"Efficient estimation of first passage probability of high-dimensional nonlinear systems"},"citedIn":{"266749975":"Estimation of long-term extreme response of operational and parked wind turbines: Validation and some new insights","279070816":"Fatigue Damage Evaluation of Broad-Band Gaussian and Non-Gaussian Wind Load Effects by a Spectral Method","258237800":"Comparison of statistical extrapolation methods for the evaluation of long-term extreme response of wind turbine","288857867":"System safety analysis of large wind turbines","259476810":"Influence of non-Gaussian wind characteristics on wind turbine extreme response"},"index":568}