{"abs":"Rapid urbanization has emerged as the source of many adverse environmental effects and brings cities to a vulnerable situation under future climate challenges. Green roofs are proven to be an effective solution to alleviate these effects by field observations under a wide range of climate conditions. Recent advances in modeling urban land-atmosphere interactions provide a useful tool in capturing the dynamics of coupled transport of water and energy in urban conies, thus bridge the gap of modeling at city to regional scales. The performance of urban hydrological models depends heavily on the accurate determination of the input parameter space, where uncertainty is ubiquitous. In this paper, we use an advanced Monte Carlo approach, viz. the Subset Simulation, to quantify the sensitivity of urban hydrological modeling to parameter uncertainties. Results of the sensitivity analysis reveal that green roofs exhibit markedly different thermal and hydrological behavior as compared to conventional roofs, due to the modification of the surface energy portioning by well-irrigated vegetation. In addition, statistical predictions of critical responses of green roofs (extreme surface temperature, heat fluxes, etc.) have relatively weak dependence on climatic conditions. The statistical quantification of sensitivity provides guidance for future development of urban hydrological models with practical applications such as urban heat island mitigation.","title":"Physical parameterization and sensitivity of urban hydrological models: Application to green roof systems","id":260804505,"url":"https://www.researchgate.net/publication/260804505_Physical_parameterization_and_sensitivity_of_urban_hydrological_models_Application_to_green_roof_systems","names":["Jiachuan Yang","Zhi-Hua Wang","Building and Environment"],"references":{"223341518":"Air Pollution in Cities","222706252":"Uncertainty in the environmental modelling process - A framework and guidance. Environ Modell Softw","235663105":"Hydrometeorological determinants of green roof performance via a vertically-resolved model for heat and water transport","200472446":"Empirical Equations for Some Soil Hydraulic Properties","257522135":"Urban particulate pollution reduction by four species of green roof vegetation in a UK city","225698531":"Estimation of urban sensible heat flux using dense wireless network of observations","240686797":"A Factorial Assessment of the Sensitivity of the BATS Land-Surface Parameterization Scheme","235246495":"Seasonal hydroclimatic impacts of Sun Corridor expansion","257171786":"How “green” are the green roofs? Lifecycle analysis of green roof materials","227724338":"Trade offs and responsiveness of the single layer urban canopy parametrization in WRF: An offline evaluation using the MOSCEM optimization algorithm and field observations","45359380":"Simulation of surface urban heat islands under ?IDEAL? conditions at night part 1: Theory and tests against field data","235065504":"Impact of soil hydraulic parameter uncertainty on soil moisture modeling","239061661":"Estimation of Soil Water Properties","245309883":"Assessing the performance of sustainable technologies: A framework and its application","226772398":"Urbanization, climate change and flood policy in the United States","225689183":"A Spatially-Analytical Scheme for Surface Temperatures and Conductive Heat Fluxes in Urban Canopy Models","41720914":"Application of an Uncertainty Analysis Approach to Strategic Environmental Assessment for Urban Planning","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","253019308":"A Statistical Exploration of Relationships of Soil Moisture Characteristics to the Physical Properties of Soils","253064021":"Adapting Cities for Climate Change: The Role of the Green Infrastructure","234168629":"Estimation of the van Genuchten Soil Water Retention Properties from Soil Textural Data *1","227202763":"A Physically-Based Scheme For The Urban Energy Budget In Atmospheric Models","226181944":"The sensitivity of winter evaporation to the formulation of aerodynamic resistance in the ECMWF model","235342659":"A coupled energy transport and hydrological model for urban canopies evaluated using a wireless sensor network. Q J R Meteorol Soc","41516478":"The international urban energy balance models comparison project: first results from phase 1 (Online first)","222834177":"Application of Subset Simulation Methods to Reliability Benchmark Problems","251576243":"Remotely sensing the cooling effects of city scale efforts to reduce urban heat island","215685129":"The International Urban Energy Balance Models Comparison Project: First Results from Phase 1","49675553":"Vulnerability assessment of climate-induced water shortage in Phoenix","230064739":"Green roof vegetation for North American ecoregions: a literature review. Land Urban Plann","222310038":"Investigating and analysing the energy and environmental performance of an experimental green roof system installed in a nursery school building in Athens, Greece","222425238":"The London Heat Island and building cooling design","258724530":"Relative efficiency of land surface energy balance components","227733065":"Initial Results from Phase 2 of the International Urban Energy Balance Comparison Project","251424039":"A model of evapotranspiration based on the theory of maximum entropy production","232403588":"Response of a Sedum green-roof to individual rain events. Ecol Eng","227007079":"Further Development of the Vegetated Urban Canopy Model Including a Grass-Covered Surface Parametrization and Photosynthesis Effects","37881122":"Applied Soil Physics: Soil Water and Temperature Applications","6438147":"Life-Cycle Cost-Benefit Analysis of Extensive Vegetated Roof Systems","222705703":"Quantifying air pollution removal by green roofs in Chicago. Atmos Environ","49458833":"Drying front and water content dynamics during evaporation from sand delineated by neutron radiography","226229790":"A Simple Single-Layer Urban Canopy Model For Atmospheric Models: Comparison With Multi-Layer And Slab Models","224001468":"Turbulent Heat Fluxes in Urban Areas: Observations and a Local-Scale Urban Meteorological Parameterization Scheme (LUMPS)","241404294":"Coupling an Advanced Land Surface Hydrology Model with the Penn State NCAR MM5 Modeling System. Part II: Preliminary Model Validation","248412712":"Characterising alternative recycled waste materials for use as green roof growing media in the U.K","47328443":"Impact of soil water property parameterization on atmospheric boundary layer simulation","226234135":"Development of a Multi-Layer Urban Canopy Model for the Analysis of Energy Consumption in a Big City: Structure of the Urban Canopy Model and its Basic Performance","261547897":"Compartment fire risk analysis by advanced Monte Carlo simulation","228591568":"Subset Simulation and its Application to Seismic Risk Based on Dynamic Analysis","50351089":"The impact of projected increases in urbanization on ecosystem services. Proc R Soc B Biol Sci","245197032":"The effects of rooftop garden on energy consumption of a commercial building in Singapore","40799387":"First Results from the International Urban Energy Balance Model Comparison: Model Complexity","261548129":"Relative Efficiency of Surface Energy Partitioning Over Different Land Covers","235663089":"Analyzing the Sensitivity of WRF\u0027s Single-Layer Urban Canopy Model to Parameter Uncertainty Using Advanced Monte Carlo Simulation","240410543":"Coupling heat flux dynamics with meteorological conditions in the green roof ecosystem","223597230":"Analysis of the Green Roof Thermal Properties and Investigation of its Energy Performance","245810779":"Coupling an Advanced Land-Surface/Hydrology Model with the Penn State/NCAR MM5 Modeling System","232694304":"Green Roofs As Urban Ecosystems: Ecological Structures, Functions And Services"},"citedIn":{"282135024":"Optimizing urban irrigation schemes for the trade-off between energy and water consumption","276297941":"Contrasting responses of urban and rural surface energy budgets to heat waves explain synergies between urban heat islands and heat waves","264827419":"Utilization of waste Autoclaved Aerated Concrete as lighting material in the structure of a green roof","274252875":"Environmental impacts of reflective materials: Is high albedo a ‘silver bullet’ for mitigating urban heat island?","273159292":"Enhancing Hydrologic Modelling in the Coupled Weather Research and Forecasting–Urban Modelling System","266563035":"Probabilistic prediction of green roof energy performance under parameter uncertainty","270591080":"Interfacing the Urban Land-Atmosphere System Through Coupled Urban Canopy and Atmospheric Models","265645001":"A new perspective of urban–rural differences: The impact of soil water advection","283569691":"Impacts of mesic and xeric urban vegetation on outdoor thermal comfort and microclimate in Phoenix, AZ","281165900":"Cool Cities: Counteracting Potential Climate Change and its Health Impacts","275715552":"Challenges Associated with Adaptation to Future Urban Expansion"},"index":580}