{"abs":"We design a theoretic tree-based functional representation of a class of Feynman-Kac particle distributions, including an extension of the Wick product formula to interacting particle systems. These weak expansions rely on an original combinatorial, and permutation group analysis of a special class of forests. They provide refined non asymptotic propagation of chaos type properties, as well as sharp $\\LL\\_p$-mean error bounds, and laws of large numbers for $U$-statistics. Applications to particle interpretations of the top eigenvalues, and the ground states of Schr\\\"{o}dinger semigroups are also discussed.","title":"Coalescent tree based functional representations for some Feynman-Kac particle models","id":2129637,"url":"https://www.researchgate.net/publication/2129637_Coalescent_tree_based_functional_representations_for_some_Feynman-Kac_particle_models","names":["Pierre Del Moral","Frédéric Patras","Sylvain Rubenthaler"],"references":{"234454281":"Nonlinear Plasma Dynamics at Laser Irradiation","232354840":"A strong law of large numbers for U-statistics","44474455":"T-rings and wreath product representations / Peter Hoffman","227424764":"On strong forms of weak convergence","2118194":"Combinatorial aspects of matrix models","2084812":"Hopf Algebras, Renormalization and Noncommutative Geometry","2086592":"Runge-Kutta methods and renormalization"},"citedIn":{"274196694":"A duality formula for Feynman–Kac path particle models","268391801":"A Sharp First Order Analysis of Feynman-Kac Particle Models","29617444":"A non asymptotic variance theorem for unnormalized Feynman-Kac particle models","228665417":"A nonasymptotic theorem for unnormalized Feynman–Kac particle models","50425579":"On the Stability of Sequential Monte Carlo Methods in High Dimensions","2134685":"The Convergence to Equilibrium of Neutral Genetic Models","23805572":"Expansion of the propagation of chaos for Bird and Nanbu systems","45898563":"Convergence of U-Statistics for Interacting Particle Systems"},"index":583}