{"abs":"The combination of simulation and optimization, essentially unheard of in practice a decade ago, is much more accessible today, thanks in large part to the development of commercial optimization software designed for use with existing simulation packages. Despite this growth, untapped applications abound. This panel, which includes developers of simulation-optimization packages, will discuss this untapped potential, barriers to broader applicability, and approaches for overcoming these barriers. This paper starts off with a brief introduction by the panel\u0027s organizer, followed by position statements from the panelists.","title":"Future of simulation optimization","id":3933083,"url":"https://www.researchgate.net/publication/3933083_Future_of_simulation_optimization","names":["J. Boesel","R.O. Bowden","Fred Glover","James P. Kelly","E. Westwig"],"references":{"3724888":"Simulation Optimization: Methods And Applications","229473260":"Requirements of an ‘Optimizer’ For Computer Simulation","275623029":"An Empirical Investigation of Optimum-Seeking in the Computer Simulation Situation","2411230":"Simulation Optimization: Methods And Applications","221529224":"Simulation Optimization Research and Development."},"citedIn":{"265062412":"Simulation meta-modeling of complex industrial production systems using neural networks","221528823":"Waterway, shipping, and ports: optimization of a barge transportation system for petroleum delivery.","254906420":"Uncertainty in Modelling and Its Impact on Optimisation Domain; Network Services Pricing","245386853":"Manufacturing performance optimization: The simulation-expert mechanism approach","224180058":"A serious game for understanding artificial intelligence in production optimization","221527411":"Simulation planning and rostering: runway schedule determination by simulation optimization.","251887946":"Rearrange and Reform of Product Line Based on Computer Simulation Technology","261117854":"Factory flow design and analysis using internet-enabled simulation-based optimization and automatic model generation","278022940":"Multi-Objective Optimization of a Real-World Manufacturing Process Using Cuckoo Search","3997810":"Optimum-seeking simulation in the design and control of manufacturing systems: experience with OptQuest for Arena","4053678":"Runway schedule determination by simulation optimization","252466713":"Simulation optimization as a method for lot size determination","261122374":"Real-world simulation-based manufacturing optimization using Cuckoo Search","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","4053669":"Optimization of a barge transportation system for petroleum delivery","238837344":"Metamodel-Driven Design Optimization Using Integrative Graphical Design Interfaces: Results From a Job-Shop Manufacturing Simulation Experiment","221528171":"Manufacturing analysis and control: buffer allocation model based on a single simulation.","278022962":"A case study of evolutionary simulation-based optimization in aircraft engine manufacturing","226446175":"OPTIMISE: An Internet-Based Platform for Metamodel-Assisted Simulation Optimization","268573408":"Metamodel Development for Graphical Design Interfaces: Results from a Manufacturing Simulation Study","221525078":"Testing line optimization based on mathematical modeling from the metamodels obtained from a simulation","221556254":"An Optimization Framework for Web Farm Configuration.","286581630":"Design of intelligent simulation software with capability of optimization","3997782":"Throughput sensitivity analysis using a single simulation","270671049":"Robust Inventory System Optimization Based on Simulation and Multiple Criteria Decision Making","221527899":"Productivity improvement: throughput sensitivity analysis using a single simulation.","220909210":"Simulation-based optimisation using local search and neural network metamodels","221526279":"On-Line Instrumentation for Simulation-Based Optimization","224330154":"A Parallel Surrogate-Assisted Multi-Objective Evolutionary Algorithm for Computationally Expensive Optimization Problems","4053765":"Targeting aviation delay through simulation optimization","4053636":"Buffer allocation model based on a single simulation","221525966":"Issues on simulation and optimization II: targeting aviation delay through simulation optimization.","257177710":"A web-based platform for the simulation–optimization of industrial problems"},"index":586}