{"abs":"Genetic algorithms play a significant role, as search techniques forhandling complex spaces, in many fields such as artificial intelligence, engineering, robotic, etc. Genetic algorithms are based on the underlying genetic process in biological organisms and on the naturalevolution principles of populations. These algorithms process apopulation of chromosomes, which represent search space solutions,with three operations: selection, crossover and mutation. Under its initial formulation, the search space solutions are coded using the binary alphabet. However, the good properties related with these algorithms do not stem from the use of this alphabet; other coding types have been considered for the representation issue, such as real coding, which would seem particularly natural when tackling optimization problems of parameters with variables in continuous domains. In this paper we review the features of real-coded genetic algorithms. Different models of genetic operators and some mechanisms available for studying the behaviour of this type of genetic algorithms are revised and compared.","title":"Tackling Real-Coded Genetic Algorithms: Operators and Tools for Behavioural Analysis","id":226445989,"url":"https://www.researchgate.net/publication/226445989_Tackling_Real-Coded_Genetic_Algorithms_Operators_and_Tools_for_Behavioural_Analysis","names":["Francisco Herrera","Manuel Lozano","Jose Luis Verdegay","Artificial Intelligence Review"],"references":{"220885545":"A New Class of the Crossover Operators for the Numerical Optimization.","3282235":"Induction: Processes of Inference, Learning, and Discovery, MIT Press","220688174":"Global Optimization","245037450":"A Real-Coded Genetic Algorithm for Function Optimization Using the Unimodal Normal Distribution Cros","201976349":"Genetic Algorithms and Walsh Functions: Part I{I, Deception and its Analysis","220800318":"Numerical Coding and Unfair Average Crossover in GA for Fuzzy Rule Extraction in Dynamic Environments.","201976350":"Messy Genetic Algorithms: Motivation, Analysis, and First Results","243686559":"Real-coded Genetic Algorithms with Simulated Binary Crossover: Studies on Multi-modal and Multi-objective Problems. Complex Systems 9(6), 431-454","246307253":"Genetic Algorithms and Robotics: A Heuristic Strategy for Optimization","220885558":"Fuzzy Recombination for the Breeder Genetic Algorithm.","288623402":"Adaptation of Population Sizes by Competing Subpopulations","226651296":"Two-Loop Real-Coded Genetic Algorithms with Adaptive Control of Mutation Step Sizes","201976365":"Adaptive Selection Methods for Genetic Algorithms","283996103":"Genetic Algorithms In Search, Optimization, and Machine Learning","201976354":"Genetic and Evolutionary Algorithms Come of Age. Commun ACM","30830586":"Classifier systems \u0026 genetic algorithms","3302429":"Comments on Theoretical analysis of evolutionary algorithms with an infinite population size in continuous space. I. Basic properties of selection and mutation [with reply]","30873058":"Genetic + Data Structures \u003d Evolution Programs","201976383":"Reducing Bias and Inefficiency in the Selection Algorithm","30869230":"Handbook Of Genetic Algorithms","220885521":"A Continuous Genetic Algorithm for Global Optimization.","242799172":"Pictorial representations of fuzzy connectives, Part II: Cases of compensatory operators and self-dual operators","220547096":"Generalizing the Notion of Schema in Genetic Algorithms.","2505828":"Expected Allele Coverage and the Role of Mutation in Genetic Algorithms","220375137":"Predictive Models for the Breeder Genetic Algorithm I. Continuous Parameter Optimization","2485857":"Genetic Algorithms for Real Parameter Optimization","220554337":"Tuning fuzzy logic controllers by genetic algorithms.","201976655":"Real-Coded Genetic Algorithms and Interval-Schema","220885613":"A Real Coded Genetic Algorithm for Function Optimization Using Unimodal Normal Distributed Crossover.","2324849":"An Analysis on Crossovers for Real Number Chromosomes in an Infinite Population Size","245696759":"Combined simulated evolutionary algorithm for real parameter optimization","220801146":"Fast Convergence Thanks to Diversity.","220885628":"Reducing Bias and Inefficienry in the Selection Algorithm.","221621858":"Lecture Notes in Computer Science","220885629":"Biases in the Crossover Landscape.","2249083":"The Influence of Different Coding Schemes on the Computational Complexity of Genetic Algorithms in Function Optimization","2609278":"Dynamic Parameter Encoding for Genetic Algorithms","220885622":"Scheduling Problems and Traveling Salesmen: The Genetic Edge Recombination Operator.","2772040":"Fuzzy Connectives Based Crossover Operators to Model Genetic Algorithms Population Diversity","201976171":"Genetic Algorithms in Parametric Design of Aircraft","220885577":"Forma Analysis and Random Respectful Recombination.","3642964":"Adaptation of Population Sizes by Competing Subpopulations","221271126":"Genetic Algorithms for Real Parameter Qptimization.","5583923":"An Introduction to Simulated Evolutionary Optimization","2400323":"An Overview of Genetic Algorithms: Part 2, ResearchTopics","2730561":"Adaptation of Genetic Algorithm Parameters Based on Fuzzy Logic Controllers","2585931":"Self-Adaptive Genetic Algorithm for Numeric Functions","220885575":"Application of Genetic Algorithms in Chemometrics.","2527817":"Delta Coding: An Iterative Search Strategy for Genetic Algorithms","2600791":"Using Genetic Algorithms to Explore Pattern Recognition in the Immune System","201976184":"Schedule Optimization Using Genetic Algorithms","3113821":"A genetic algorithm for the linear transportation problem","2848344":"Equivalence Class Analysis of Genetic Algorithms","220885597":"An Experimental Comparison of Binary and Floating Point Representations in Genetic Algorithms.","2643792":"A Multivalued Evolutionary Algorithm","2409052":"Real Representations","2813522":"Fuzzy Tools to Improve Genetic Algorithms","220045412":"Adoption in Natural and Artificial System","220702301":"BUGS: A Bug-Based Search Strategy using Genetic Algorithms.","2716074":"Dynamic and Heuristic Fuzzy Connectives Based Crossover Operators for Controlling the Diversity and Convergence of Real-Coded Genetic Algorithms","221271220":"A Stationary Point Convergence Theory for Evolutionary Algorithms.","2499499":"Genetic Algorithms and Machine Learning","3692982":"An analysis on linear crossover for real number chromosomes in an infinite population size","220885668":"The ARGOT Strategy: Adaptive Representation Genetic Optimizer Technique.","221271231":"Convergence Controlled Variation.","2333106":"Simulated Binary Crossover for Continuous Search Space","220701619":"Heuristic Crossovers for Real-Coded Genetic Algorithms Based on Fuzzy Connectives.","201976467":"A Comparative Analysis of Selection Schemes Used in Genetic Algorithms","222468319":"Tuning fuzzy controllers by genetic algorithms","2775434":"Real-Coded Genetic Algorithms, Virtual Alphabets and Blocking","201976488":"Uniform Crossover in Genetic Algorithms","2264198":"Using Genetic Algorithms With Small Populations","2770063":"Some Comments on Evolutionary Algorithm Theory","201976495":"Adapting Operator Probabilities in Genetic Algorithm","3301781":"Theoretical Analysis of Evolutionary Algorithms With an Infinite Population Size in Continuous Space Part II: Analysis of the Diversification Role of Crossover","201976481":"Genetic Operators for Sequencing Problems","3301786":"Theoretical analysis of evolutionary algorithms with an infinite population size in continuous space. Part I: Basic properties of selection and mutation","2605963":"An Overview of Genetic Algorithms: Part 2, Research Topics","2703492":"A General Study on Genetic Fuzzy Systems","2766471":"A Generalized Stationary Point Convergence Theory for Evolutionary Algorithms","3623564":"Gaussian Mutation and Self-Adaptation for Numeric Genetic Algorithms","3575179":"Hybridizing Genetic Algorithms with Hill-Climbing Methods for Global Optimization: Two Possible Ways","220885652":"Crossover Operator Biases: Exploiting the Population Distribution","3575287":"Modal mutations in evolutionary algorithms","2610150":"Extended Selection Mechanisms in Genetic Algorithms","3642866":"A combined evolutionary algorithm for real parameters optimization","220080087":"Representational issues in genetic optimization","246309479":"Genetic Programs + Data Structures \u003d Evolution Programs","220701676":"From Recombination of Genes to the Estimation of Distributions II. Continuous Parameters.","221346047":"Representation and Hidden Bias: Gray vs. Binary Coding for Genetic Algorithms","224663734":"Retaining diversity of genetic algorithms for multivariable optimization and neural network learning","220701683":"Self-Adaptive Genetic Algorithm for Numeric Functions.","229091441":"Genetic Programming","3575265":"Using real-valued genetic algorithm to evolve rule sets for classification","201976017":"Initialization, Mutation and Selection Methods in Genetic Algorithms for Function Optimization","2787313":"Optimizing Engineering Designs Using a Combined Genetic Search","225787560":"Self-adaptive genetic algorithm for numeric functions","220643014":"Characterizing Crossover in Genetic Algorithms.","244451186":"A User\u0027\u0027s Guide to GENESIS version 5","222748583":"Pictorial representations of fuzzy connectives, Part I: Cases of t-norms, t-conorms and averaging operators","245361277":"An overview of genetic algorithms: Part 1","201976810":"Convergence Controlled Variation","225523860":"From recombination of genes to the estimation of distributions II. Continuous parameters","35578608":"An Analysis of the Behavior of a Class of Genetic Adaptive Systems","2409930":"Non-Linear Genetic Representations","220885701":"A New Interpretation of Schema Notation that Overtums the Binary Encoding Constraint.","201976057":"Hybridizing the Genetic Algorithm and the K-Nearest Neighbors Classification Algorithm","242356870":"Adaptation In Natural And Artificial Systems","3363015":"Optimal Multilayer Filter Design Using Real Coded Genetic Algorithms","270359528":"Equilibrium Behavior of Population Genetic Models with Non-Random Mating","3751631":"Heterogeneous distributed genetic algorithms based on the crossover operator","220375001":"An Overview of Evolutionary Algorithms for Parameter Optimization","220885716":"A Real Coded Genetic Algorithm with an Explorer and an Exploiter Populations.","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","2611416":"A Survey of Evolution Strategies"},"citedIn":{"220777768":"Find Key m/z Values in Predication of Mass Spectrometry Cancer Data.","224111962":"Blind Channel Estimation in OFDM Systems by Relying on the Gaussian Assumption of the Input","224685408":"A New Method for Simultaneous Evolution of Robot Behaviors based on Multiobjective Evolution","273369167":"Closure to “Knowledge-Based Optimization Model for Control Valve Locations in Water Distribution Networks” by Mohammed E. Ali","250767092":"VISUALIZATION WITH NURBS USING SIMULATED ANNEALING OPTIMIZATION TECHNIQUE By","9049218":"Mobile ankle and knee perturbator","257518417":"Tabu search with multi-level neighborhood structures for high dimensional problems","222745932":"Autonomous classifiers with understandable rule using multi-objective genetic algorithms","9049217":"A Genetic Segmentation of ECG Signals","266894308":"An Interval-Valued Approach to Business Process Simulation Based on Genetic Algorithms and the BPMN","259391355":"Parameter estimation for five- and seven-parameter photovoltaic electrical models using evolutionary algorithms","238702133":"User Interface Applications","4213839":"Multiobjective simulation optimization using an enhanced genetic algorithm","220064018":"Local identification of prototypes for genetic learning of accurate TSK fuzzy rule-based systems","269568001":"Studies in Aerodynamic Optimization Based on Genetic Algorithms","262167473":"Comprehensive Survey of the Hybrid Evolutionary Algorithms","4275282":"Control of Modular Robot with Parameter Estimation Using Genetic Algorithms","266374132":"optimization of pumping","228357512":"Regular paper New Approach to Solve Multi-objective Environmental/Economic Dispatch","267963374":"РАЗРАБОТКА ИНСТРУМЕНТАЛЬНОГО СРЕДСТВА ДЛЯ ГЕНЕРАЦИИ КОНЕЧНЫХ АВТОМАТОВ С ИСПОЛЬЗОВАНИЕМ ГЕНЕТИЧЕСКИХ АЛГОРИТМОВ","220301622":"Evolutionary approach to combined multiple models tuning.","242367082":"Elitism, Sharing, and Ranking Choices in Evolutionary Multi-Criterion Optimisation","224351558":"DSP-Based Laboratory Implementation of Hybrid Fuzzy-PID Controller Using Genetic Optimization for High-Performance Motor Drives","43466379":"Evolutionary design of robust flight control for a hypersonic aircraft","267836394":"Island crossover specialization in a GA for the design of RBFNNs","222646618":"A niched Pareto genetic algorithm for multiobjective environmental/economic dispatch","224330111":"Theoretical Parameter Value for Appropriate Population Variance of the Distribution of Children in Real-coded GA","220449029":"Personalised subscription pricing for optimised wireless mesh network deployment","260409251":"Performance evaluation of modified genetic and swarm-based optimization algorithms in damage identification problem","239434338":"Improved Evolutionary Programming with Various Crossover Techniques for Optimal Power Flow Problem","238777872":"DESENVOLVIMENTO DE UM ALGORITMO GENÉTICO PARA MINERAÇÃO DE DADOS NA AGRICULTURA DE PRECISÃO","3949584":"Real-coded evolutionary algorithms with parent-centricrecombination","248121062":"Parameter identification theory of a complex model based on global optimization method","2460680":"Hybrid Model Development for Fed-Batch Bioprocesses; Combining Physical Equations With the Metabolic Network and Black-Box Kinetics","223087970":"Nonconvex economic load dispatch using an efficient real-coded genetic algorithm","268423119":"Uma Abordagem Evolutiva para a Geração Automática de Dados de Teste","220440851":"An Evolutionary Methodology for the Automated Design of Cellular Automaton-based Complex Systems.","224699733":"Estimating the Unmeasured Dynamics of Biological Systems using a Constrained Real-Coded Genetic Algorithm","43453093":"A general-purpose tunable landscape generator","227756449":"Memetic evolutionary training for recurrent neural networks: An application to time-series prediction","277804220":"Cooperación entre sistemas de inferencia, métodos de defuzzificación y aprendizaje de sistemas difusos lingüísticos","220313874":"A real-coding jumping gene genetic algorithm (RJGGA) for multiobjective optimization","265514983":"Optimization of Router Deployment for Sensor Networks Using Genetic Algorithm","281363696":"A hybrid cost-sensitive ensemble for imbalanced breast thermogram classification","272855162":"DUAL ACTIVE TUNED MASS DAMPERS FOR REDUCING RESPONSE OF ASYMMETRIC BUILDINGS","225120592":"A New Self-adaptative Crossover Operator for Real-Coded Evolutionary Algorithms","259296079":"Reactive Flow Model Parameter Estimation Using Genetic Algorithms","224239969":"Modeling the Skull–Face Overlay Uncertainty Using Fuzzy Sets","221158675":"Wrapping VRXQuery with Self-Adaptive Fuzzy Capabilities.","265397231":"Mining Sequential Patterns Using Hybrid Evolutionary Algorithm","4089857":"Evaluating a hybrid encoding and three crossover operators on the constrained portfolio selection problem","223487251":"Development of genetic fuzzy logic controllers for complex production systems","222044542":"A grid based multi-objective evolutionary algorithm for the optimization of power plants","257831704":"An application of genetic algorithms with binary and real coding for approximate synthesis of suboptimal control in deterministic systems","26523102":"Detect Key Gene Information in Classification of Microarray Data","221006182":"A study on real-coded genetic algorithm for process optimization using ranking selection, direction-based crossover and dynamic mutation","261042116":"A GP approach for price-speed optimizing negotiation","4201484":"Hybrid real-coded genetic algorithms with female and male differentiation","4201486":"Adaptive local search parameters for real-coded memetic algorithms","220635497":"A numerical evaluation of meta-heuristic techniques in portfolio optimisation","8350767":"Genetic design of feature spaces for pattern classifiers","220686707":"Hierarchical constraint transformation based on genetic optimization for analog system synthesis","227295702":"Use of the q-Gaussian Mutation in Evolutionary Algorithms","228634106":"Global Optimization Accuracy and Evolutionary Dynamics of the Generalized Generation Gap Algorithm with Adaptive Mutation","221912422":"A Spot Modeling Evolutionary Algorithm for Segmenting Microarray Images","251993944":"Surveillance Test Interval optimization for nuclear plants using Real Parameter Genetic Algorithms","3917925":"Global optimization of deformable surface meshes based on geneticalgorithms","260088798":"A robust approach for multi-agent natural resource allocation based on stochastic optimization algorithms","242144782":"DISEÑO DE PERFILES AERODINÁMICOS PARA APLICACIONES A BAJOS NÚMEROS DE REYNOLDS MEDIANTE EL USO DE ALGORITMOS EVOLUTIVOS","228251131":"Why Aren\u0027t More Families Buying Life Insurance?","2772040":"Fuzzy Connectives Based Crossover Operators to Model Genetic Algorithms Population Diversity","6662151":"Development of a Culture Sub‐population Induction Model: Signaling Pathways Synergy and Taxanes Production by Taxuscanadensis","228698562":"Analysis and design of power system stabilizers and FACTS based stabilizers using genetic algorithms","224219454":"Bouvry, P.: Improving Classical and Decentralized Differential Evolution with New Mutation Operator and Population Topologies. IEEE Transactions on Evolutionary Computation 15(1), 67-98","257407795":"On the Application of a Genetic Algorithm to the Predictability Problems Involving \"On-Off\" Switches","45221590":"An optimization approach for software test data generation: applications of estimation of distribution algorithms and scatter search","220346695":"Solving Flexible Multi-objective JSP Problem Using A Improved Genetic Algorithm","268390297":"JAO10035-20141117-091934-7965-45520 (1)","4201510":"Crossover effect over penalty methods in function optimization with constraints","262315978":"Multi-objective GA rule extraction in a parallel framework","250228355":"Nesting genetic algorithms to solve a robust optimal experimental design problem","224506124":"Analyzing Two-Settlement Electricity Market Equilibrium by Coevolutionary Computation Approach","245393103":"Parametric modelling application to a twin rotor system using recursive least squares, genetic, and swarm optimization techniques","267680640":"Confidence interval based crossover using a L 1 norm localization estimator for real-coded genetic algorithms","251238028":"Kwok N. M., Ha Q. P., Li J. and Samali B., “Bouc-Wen model parameter identification for a MRF damper using computationally efficient GA,” ISA Transactions, Vol. 46, No. 2, pp. 167-179, 2007","225604868":"An Algorithm Based on Genetic Fuzzy Systems for the Selection of Routes in Multi-Sink Wireless Sensor Networks","228882898":"Genetic algorithms with automatic accelerated termination","257787690":"Application research on FSDM-based GA in optimizing curriculum schedule model in universities","234831240":"Hybridizing adaptive and non-adaptive mutation for cooperative exploration of complex multimodal search space","251865979":"An Integrated Framework for Learning Fuzzy Cognitive Map using RCGA and NHL Algorithm","226017537":"Multiobjective Genetic Algorithms for the Optimisation of Wastewater Treatment Processes","278050025":"A novel stability and process sensitivity driven model for optimal sized FinFET based SRAM","277293306":"Genetic Learning of Fuzzy Rule-Based Classification Systems Cooperating with Fuzzy Reasoning Methods","221907386":"Genetic Programming in Application to Flight Control System Design Optimisation","228655395":"Simultaneous Due Date Assignment and Lot Sizing with Uncertain Flow Times","3003566":"Global range alignment for ISAR","245390886":"Developing a neural network and real genetic algorithm combined tool for an engine test bed","268575877":"OPTIMISATION DE RÉSEAUX DE NEURONES POUR LA RECONNAISSANCE DE CHIFFRES MANUSCRITS ISOLÉS : SÉLECTION ET PONDÉRATION DES PRIMITIVES PAR ALGORITHMES GÉNÉTIQUES","26884381":"Weather and Seasons Together Demand Complex Biological Clocks","256918491":"Soft sensor for NOxNOx and O2O2 using dynamic neural networks","229894462":"Optimization Methodology Applied to Feed-Forward Artificial Neural Network Parameters","280697909":"Modeling and optimization of part type selection and loading problems in flexible manufacturing system using real coded genetic algorithms","238518969":"Coordination among facts POD and PSS controllers for damping of power system oscillations in large power systems using genetic algorithm","251824013":"A Genetic Algorithms Approach to Model Parameter Estimation of a Robot Joint with Torque Sensing","50366355":"AN EXTREMELY SIMPLE OPERATION FOR DRASTIC PERFORMANCE ENHANCEMENT OF GENETIC ALGORITHMS FOR ENGINEERING DESIGN OPTIMIZATION","252389279":"MCMC algorithm, integrated four-dimensional seismic reservoir characterization and uncertainty analysis in a Bayesian framework","39641801":"Metaheurísticas e ingeniería del software","220838335":"A Soft Computing Technique Applied to Industrial Catalysis.","220360116":"Optimizing Feedforward Neural Networks For Control Chart Pattern Recognition Through Genetic Algorithms.","252038034":"Genetic Algorithms for Optimal Fuzzy-Connective-Based Aggregation Networks","263557922":"Arbitrary function optimisation with metaheuristics: No free lunch and real-world problems: No free lunch and real-world problems","226165217":"Real-Valued Genetic Algorithms with Disagreements","3003569":"Use of genetic algorithms in ISAR imaging of targets with higher order motions","222300640":"Genetic learning as an explanation of stylized facts of foreign exchange markets","254997393":"A New Approach to Estimate a Mixed Model–Based Ground Motion Prediction Equation","4358369":"Fault-tolerant On-board Evolutionary Platform for Adaptive Allocation of Hardware and Software Tasks","222922221":"Modeling and optimization of a nuclear power plant secondary loop","220315012":"Replacement strategies to preserve useful diversity in steady-state genetic algorithms","229558536":"Optimal Design of Water Distribution Systems Using Genetic Algorithms","280697884":"Optimasi fungsi tanpa kendala menggunakan algoritma genetika dengan kromosom biner dan perbaikan kromosom hill-climbing","257582067":"Genetic-based Real-time Fast-Flux Service Networks Detection","237609603":"Optimización Continua Multimodal mediante Evolución de Funciones de Densidad de Probabilidad","222574063":"Abido, M.A.: A Novel Multiobjective Evolutionary Algorithm for Environmental / Economic Power Dispatch. Electric Power Systems Research 65(1), 71-81","264276844":"Methods and Algorithms for Fuzzy Cognitive Map-based Modeling","260606758":"Thakur, M.: A new genetic algorithm for global optimization of multimodal continuous functions. J. Comput. Sci. 5, 298-311","220739992":"Credit assignment in adaptive evolutionary algorithms","261025598":"Hierarchical fuzzy rule-based system optimized with genetic algorithms for short term traffic congestion prediction","34487999":"Global optimization-based deformable meshes for surface extraction from medical images /","215727210":"A Survey on the Research Lines of the Applications of Fuzzy Logic and Evolutionary Algorithms Research Unit at the European Center for Soft Computing","222011785":"A divide and conquer method for learning large Fuzzy Cognitive Maps","220175789":"Sánchez AM. Hybrid crossover operators for real-coded genetic algorithms: an experimental study","259288007":"A Java-Based Code Generator for Parallel Evolutionary Algorithms","278669354":"Humanoid Robot Multicriteria Gait Synthesis: A Case Study for Walking","276922422":"An Automatic Code Generator for Parallel Evolutionary Algorithms: Achieving Speedup and Reducing The Programming Efforts","259692493":"Introducing a Genetic Fuzzy Linguistic Combination Method for Bagging Fuzzy Rule-Based Multiclassification Systems","220175784":"Memetic algorithms based on local search chains for large scale continuous optimisation problems: MA-SSW-Chains","278669348":"A New Method for Simultaneous Evolution of Robot Behaviors based on Multiobjective Evolution","254388113":"A Real Coded Genetic Algorithm for Optimization of Cutting Parameters in Turning","270875805":"Adaptive splitting and selection ensemble for breast cancer malignancy grading.","278669351":"Performance Evaluation of Evolutionary Multiobjective Optimization","228972830":"A Framework for a novel scalable FCM learning method","224095718":"Modeling Permutations for Genetic Algorithms","226206148":"Automated Parameterisation of a Metaheuristic for the Orienteering Problem","257726365":"Damage Detection in an Offshore Jacket Platform Using Genetic Algorithm Based Finite Element Model Updating with Noisy Modal Data","238186231":"Engine Test Data Modelling by Evolutionary Radial Basis Function Networks","224086430":"Genetic Tuning for Improving Wang and Mendel\u0027s Fuzzy Database","268470469":"Unmanned Aerial System Hydra Technologies Éhecatl wing optimization using a morphing approach","3787007":"Component characterization and constraint transformation based on directed intervals for analog synthesis","220742126":"New entropy model for extraction of structural information from XCS population","224206234":"ML blind channel estimation in OFDM using cyclostationarity and spectral factorization","220175829":"Theoretical basis of parameter tuning for finding optima near the boundaries of search spaces in real-coded genetic algorithms","258388909":"Optimization the Initial Weights of Artificial Neural Networks via Genetic Algorithm Applied to Hip Bone Fracture Prediction","285944256":"Fuel constrained economic emission dispatch using nondominated sorting genetic algorithm-II","220175825":"JCLEC: A Java framework for evolutionary computation","220249582":"A genetic algorithm for a global optimization problem arising in the detection of gravitational waves","280697962":"Solving part type selection and loading problem in flexible manufacturing system using real coded genetic algorithms – Part I: modeling","252010455":"SISO and SIMO active vibration control of a flexible plate structure using real-coded genetic algorithm","234969810":"Stochastic optimization of a cold atom experiment using a genetic algorithm","220740091":"Are evolutionary algorithm competitions characterizing landscapes appropriately","272087267":"Optimización de Sistemas Basados en Reglas Difusas para la predicción de congestión a corto plazo","254416894":"Interactions Between Evolution and Learning","224133513":"Introducing a genetic fuzzy linguistic combination method for bagging fuzzy rule-based multiclassification systems","3859680":"Developing a self-learning adaptive genetic algorithm","278545472":"A Multi-point Performance Matched Aerofoil Design Algorithm for a Scaled Wind Turbine Rotor Model","261356360":"Induction motor drive\u0027s parameters identification using genetic algorithms","257621889":"Rheological model optimization using advanced evolutionary computation for the analysis of the influence of recycled rubber on rubber blend dynamical behaviour","220176835":"Improving fuzzy cognitive maps learning through memetic particle swarm optimization","256854931":"Three-dimensional thermal modeling of a photovoltaic module under varying conditions","224170370":"Simultaneous coordination of power system stabilizers and STATCOM in a multi-machine power system for enhancing dynamic performance","229540209":"A taxonomy for the crossover operator for real-coded genetic algorithms: an experimental study. Int. J. Intell. Syst. 18, 309-338","5798072":"Development of a hinge compatible with the kinematics of the knee joint","220970443":"A Genetic Algorithm Based on Evolutionary Direction.","261756792":"Design of a Broadband Electrical Impedance Matching Network for Piezoelectric Ultrasound Transducers Based on a Genetic Algorithm","261450611":"Evolving team tactics using potential fields","251931619":"GA-based Algorithm for Hardware/Software Partitioning with Resource Contentions","252059631":"Development of Software System for State Machine Generation Using Genetic Algorithms","221007301":"Real-parameter Optimization performance study on the CEC-2005 benchmark with SPC-PNX","241005238":"Genetic algorithm for evaluation metrics in topical web crawling","238700247":"Geneettinen algoritmi putkipalkkikehän optimoinnissa","224320947":"IIR Filter Adaptation Using Branch-and-Bound: A Novel Approach","221337052":"A Concurrent Newsvendor Problem with Rationing","272778412":"Mobile Robot for Life Science Automation","225256861":"Variable mesh optimization for continuous optimization problems","222677429":"Continuous scatter search: An analysis of the integration of some combination methods and improvement strategies","266373909":"Optimization of pumping ship trajectory to clean oil contamination in the open sea","220062187":"A Modified Particle Filter for Simultaneous Localization and Mapping","224290216":"DSP-Based Implementation of Fuzzy-PID Controller Using Genetic Optimization for High Performance Motor Drives","273825965":"Accelerating parameter identification of proton exchange membrane fuel cell model with ranking-based differential evolution","262875988":"A Model for Characterising the Collective Dynamic Behaviour of Evolutionary Algorithms","5314897":"An Original Genetic Approach to the Fully Automatic Gridding of Microarray Images","3336498":"Classification of Heterogeneous Fuzzy Data by Choquet Integral With Fuzzy-Valued Integrand","261132944":"Craniofacial Superimposition in Forensic Identification using Genetic Algorithms","242081644":"Integração Entre Lógica Nebulosa e Algoritmos Evolutivos","220205090":"Fuzzy Control of HVAC Systems Optimized by Genetic Algorithms","200018661":"A Geometric Constraint Library for 3D Graphical Applications","275252580":"Optimal Force Inputs for Environmental Vibration Testing of Full Scale Slender Aerospace Vehicles","3336511":"Cooperative Evolutionary Learning of Linguistic Fuzzy Rules and Parametric Aggregation Connectors for Mamdani Fuzzy Systems","4939076":"Multiagent visual area coverage using a new genetic algorithm selection scheme","234124516":"Real encoded genetic algorithm and response surface methodology to optimize production of an indolizidine alkaloid, swainsonine, from Metarhizium anisopliae","235932417":"Evolutionary Algorithm Characterization in Real Parameter Optimization Problems","258543226":"Optimization of Power-Cycle Arrangements for Supercritical Water Cooled Reactors (SCWRS)","279607743":"Learning and Tuning Fuzzy Rule-Based Systems for Linguistic Modeling","233997543":"Identificación de proteínas en imágenes de geles 2D utilizando DoG y algoritmos genéticos","228451467":"Optimized satellite image compression and reconstruction via evolution strategies","224142411":"3-D Spot Modeling for Automatic Segmentation of cDNA Microarray Images","3266857":"Optimal multiobjective design of robust power system stabilizers using genetic algorithms","261342858":"Experimental analysis of the relevance of fitness landscape topographical characterization","272352545":"ConnectionSc2014","233746677":"Short-term time series forecasting based on the identification of skeleton algebraic sequences","46272479":"Comparative study of three commonly used continuous deterministic methods for modeling gene regulation networks","220063744":"Hybrid Crossover Operators with Multiple Descendents for Real-Coded Genetic Algorithms: Combining Neighborhood- Based Crossover Operators","222176288":"Optimal direct (static) output feedback controller using real coded genetic algorithms","265052882":"Hybrid real-coded genetic algorithm for data partitioning in multi-round load distribution and scheduling in heterogeneous systems","239928146":"APRENDIZAGEM DE POLÍTICAS DE OFERTA DE NEGOCIAÇÃO ENTRE AGENTES COGNITIVOS","24121455":"Husbands Might Really Be That Cheap","226651296":"Two-Loop Real-Coded Genetic Algorithms with Adaptive Control of Mutation Step Sizes","226847911":"A Hybrid Evolutionary Algorithm for Global Optimization","224324733":"Self-Adaptive Multimethod Search for Global Optimization in Real-Parameter Spaces","251994657":"Evaluation of voltage stability indices (VSI) using genetic algorithm","257635966":"Crossover-based local search in cooperative co-evolutionary feedforward neural networks","6456647":"Bouc-Wen Model Parameter Identification for a MR Fluid Damper Using Computationally Efficient GA","221007882":"A new representation in Evolutionary Algorithms for the optimization of bioprocesses","3717392":"Continuous optimization schemes for fuzzy classification","259633744":"A variant constrained genetic algorithm for solving conditional nonlinear optimal perturbations","221786132":"Genetic Algorithms: Basic Ideas, Variants and Analysis","224289904":"An Efficient Real-Coded Genetic Algorithm for Numerical Optimization Problems","259560023":"Hybrid Supervised Learning in MLP using Real-coded GA and Back-propagation","261131943":"PSO versus GAs for fast object localization problem","273695079":"Comparative Analysis of Real and Binary Coded Genetic Algorithm for Fuzzy Time Series Prediction","222404730":"Robust coordinated design of excitation and TCSC-based stabilizers using genetic algorithm","220528670":"Genetic learning of fuzzy cognitive maps","220199972":"Distance-based relevance feedback using a hybrid interactive genetic algorithm for image retrieval","251792959":"Estimating non-linear utility functions of time use in the context of activity schedule adaptation model","228993177":"Optimal Multi-criteria humanoid robot gait synthesis-an evolutionary approach","220205087":"Utilizing Genetic Algorithms to Optimize Membership Functions for Fuzzy Weighted Association Rules Mining","28765431":"Survival of the flexible: explaining the dominance of meta-heuristics within a rapidly evolving world","224895014":"Problem Decomposition and Adaptation in Cooperative Neuro-evolution","4279555":"Geometric Feature Equalizers Based on Hybrid Genetic Algorithm","273504516":"Memetic algorithm with Preferential Local Search using adaptive weights for multi-objective optimization problems","262438638":"Structural damage detection by using genetic algorithms: a comparison of different types of individual coding","2953574":"Real-coded Genetic Optimization of Fuzzy Clustering","222909444":"A hybrid coevolutionary algorithm for designing fuzzy classifiers","51877465":"Theoretical and Evolutionary Parameter Tuning of Neural Oscillators with a Double-Chain Structure for Generating Rhythmic Signals","243776468":"Multi-parent recombination with simplex crossover in real-coded genetic algorithms","3336550":"Numerical and Linguistic Prediction of Time Series With the Use of Fuzzy Cognitive Maps","220838013":"Improving the Evolutionary Coding for Machine Learning Tasks.","256464412":"Learning Paradigm Based on Jumping Genes: A General Framework for Enhancing Exploration in Evolutionary Multiobjective Optimization","11019773":"A Computationally Efficient Evolutionary Algorithm for Real-Parameter Optimization","221009017":"Comparison of GA and PSO performance in parameter estimation of microbial growth models: A case-study using experimental data","228572361":"Genetic Evolution of Articulated Robotic Structures","236657484":"A Genetic Algorithm for Solving Combinatorial Problems and the Effects of Experimental Error - Applied to Optimizing Catalytic Materials","224472121":"Assessment of Genetic Algorithm Selection, Crossover and Mutation Techniques in Reactive Power Optimization","228371652":"Applications of soft computing techniques in materials engineering: A review","222866449":"Basu, M.: Dynamic economic emission dispatch using nondominated sorting genetic algorithm-II. Int. J. Electr. Power Energy Syst. 30(2), 140-149","276453667":"Development of an Unbiased Plotting Position Formula Considering the Coefficient of Skewness for the Generalized Logistic Distribution","222575641":"Multi-criteria optimization in nonlinear predictive control","221230193":"Finding the 3D-Structure of a molecule using genetic algorithm and tabu search methods","220626041":"Hyperbox classifiers for arrhythmia classification","280803804":"Application of Fuzzy Cognitive Maps to Water Demand Prediction","279513545":"Agent-based Models of the Economy From Theories to Applications","259459605":"A Generalized Framework for Optimal Sizing of Distributed Energy Resources in Micro-Grids Using an Indicator-Based Swarm Approach","232642751":"A New Adaptive Real-Coded Memetic Algorithm","270844231":"Application Methods for Genetic Algorithms for the Search of Feed Positions in the Design of a Reactive Distillation Process","228953283":"A survey of fuzzy cognitive map learning methods","2754893":"Hierarchical Distributed Genetic Algorithms","256937527":"Geometricity of genetic operators for real-coded representation","51936881":"CIXL2: A Crossover Operator for Evolutionary Algorithms Based on\nPopulation Features","249675656":"Improving Performance of Multi-objective Genetic for Function Approximation through island specialisation","220553289":"Application of genetic algorithm to improve voltage regulation of self-excited induction generator in a wind energy conversion system.","256968253":"Optimization of stay cables in cable-stayed bridges using finite element, genetic algorithm, and B-spline combined technique","280597973":"Short-term time series algebraic forecasting with mixed smoothing","221020225":"Building a Better Air Defence System Using Genetic Algorithms.","4013395":"Genetic learning as an explanation of stylized facts of foreign exchange markets","220290129":"Global and local real-coded genetic algorithms based on parent-centric crossover operators","223738919":"Fuzzy numbers and fuzzification of the Choquet integral","270391662":"Active vibration control of flexible plate structures with distributed disturbances","239375154":"Robust state estimator based on maximum constraints satisfaction of uncertain measurements","262211286":"Study of genetic algorithms with crossover based on confidence intervals as an alternative to classical least squares estimation methods for nonlinear models","262236886":"CSA/IE: Novel Clonal Selection Algorithm with Information Exchange for High Dimensional Global Optimization Problems","220742738":"A continuous variable neighbourhood search based on specialised EAs: application to the noiseless BBO-benchmark 2009.","277577201":"Performance evaluation of automatically tuned continuous optimizers on different benchmark sets","224916508":"Evolution by Adapting Surrogates","223820843":"Analysis and assessment of STATCOM-based damping stabilizers for power system stability enhancement","258391579":"Mathematical and Metaheuristic Applications in Design Optimization of Steel Frame Structures: An Extensive Review","245061605":"Parameter design for a guidance and control system using genetic approach","268078725":"A Multi-Objective Genetic Algorithm for the Software Project Scheduling Problem","221365326":"A Cross-layer WiMAX Scheduling Algorithm based on Genetic Algorithm","233052315":"Hessian approximation algorithms for hybrid optimization methods","261261841":"The linguistic forecasting of time series based on fuzzy cognitive maps","224167129":"New uninorm-based neuron model and fuzzy neural networks","232895588":"Estimation of the Reactive Flow Model Parameters for an Ammonium Nitrate–Based Emulsion Explosive Using Genetic Algorithms","224634085":"Closed-loop Identification of Hammerstein Systems Using Hybrid Neural Model Identified by Genetic Algorithms","243312391":"Genetic synthesizing of band schemes for thermoluminescence in dosimetric crystals","284076390":"An aerodynamic optimization computational framework using genetic algorithms","264310346":"Developing a Hybrid Framework for a Web-Page Recommender System","47715159":"MULTIOBJECTIVE SIMULATION OPTIMIZATION USING ENHANCED EVOLUTIONARY ALGORITHM APPROACHES","221035683":"A Real Coded Genetic Algorithm for Data Partitioning and Scheduling in Networks with Arbitrary Processor Release Time","224720107":"A New Multiobjective RBFNNs Designer and Feature Selector for a Mineral Reduction Application","220176528":"Evolutionary strategies for hyperparameters of support vector machines based on multi-scale radial basis function kernels","255175333":"GA-optimized feedforward-PID tracking control for a rugged electrohydraulic system design","26488836":"Genetic Algorithms for Optimal Reactive Power Compensation of a Power System with Wind Generators based on Artificial Neural Networks","261318144":"Good standards for smart meters","269274520":"Neuro-genetic classifier applied to road detection","274582986":"A Framework for Application of Genetic Algorithm to Model-Based Design of Reactive Distillation Process","257807044":"Boosting for class-imbalanced datasets using genetically evolved supervised non-linear projections","220298429":"Wrapping VRXQuery with self-adaptive fuzzy capabilities","235649942":"Resolving Cell Composition Through Simple Measurements, Genome-Scale Modeling, and a Genetic Algorithm","225797332":"NSGA-II-RJG applied to multi-objective optimization of polymeric nanoparticles synthesis with silicone surfactants","265337458":"Performance Analysis on Evolutionary Algorithms for the Minimum Label Spanning Tree Problem","269105582":"Estimation of the LEE-Tarver Reactive Flow Model Parameters for an Ammonium Nitrate Based Emulsion Explosive","262141499":"Segmentation of histological images using a metaheuristic-based level set approach","23534785":"Individual Expectations and Aggregate Behavior in Learning to Forecast Experiments","280698131":"Optimasi fungsi tak berkendala menggunakan algoritma genetika terdistribusi dengan pengkodean real","224663757":"An analog wavelet transform chip","220200118":"Generation of walking periodic motions for a biped robot via genetic algorithms","264134165":"Derivation of Plotting Position Formulas Considering the Coefficients of Skewness for the GEV Distribution","224634062":"Performance Improvement of Hybrid Real-Coded Genetic Algorithm with Local Search and Its Applications","24053954":"Genetic algorithms for the selection of smoothing parameters in additive models","223901929":"Optimization of an air cushion vehicle bag and finger skirt using genetic algorithms","232625260":"Optical monitoring system availability optimization via semi-Markov processes and genetic algorithms","261761582":"Influence of the learning method in the performance of feedforward neural networks when the activity of neurons is modified","257432300":"A cooperative coevolutionary approach dealing with the skull–face overlay uncertainty in forensic identification by craniofacial superimposition","221470853":"Towards the Evolutionary Process Algebra","41941961":"Myocardial border detection from ventriculograms using support vector machines and real-coded genetic algorithms","252018365":"Enhancing the food locations in an Artificial Bee Colony algorithm","220981393":"New Crossover Operator for Evolutionary Rule Discovery in XCS","29800572":"Identifikation von Verkehrslasten unter Einsatz von Methoden des Soft Computing","276926783":"Bolstering efficient SSGAs based on an ensemble of probabilistic variable-wise crossover strategies","262425189":"An integration of fuzzy inference systems and Genetic Algorithms for Wireless Sensor Networks","228888678":"INVESTIGATION OF THE EFFECTIVENESS OF EXCITATION AND FACTS-BASED CONTROLLERS ON POWER SYSTEM STABILITY ENHANCEMENT","272123386":"Gpax: Genetic Parabolic Adaptive Crossover Operator","226373821":"Fuzzy adaptive genetic algorithms: Design, taxonomy, and future directions","245582688":"Bearing-only SLAM in Indoor Environments Using a Modied Particle Filter","3355127":"Method for co-ordinate application of FACTS-based stabilizers in multi-machine power system using fuzzy out put feedback controller","27469926":"Fuzzy Genetic Algorithms with Fuzzy Solutions","4364679":"A Real-Valued Coding Mechanism for Software-Hardware Partitioning in SoC Design","222275834":"MOGAMOD: Multi-objective genetic algorithm for motif discovery","264109684":"Optimum parameterization in grillage design under a worst point load","281763073":"Minimisation of energy consumption variance for multi-process manufacturing lines through genetic algorithm manipulation of production schedule","220947680":"Evolutionary Computation Applied to Sound Synthesis.","263891569":"Charge Scheduling of an Energy Storage System under Time-of-Use Pricing and a Demand Charge","226044085":"Multiobjective Evolutionary Algorithms for Electric Power Dispatch Problem","265554457":"An Improved Genetic Algorithm with a Local Optimization Strategy and an Extra Mutation Level for Solving Traveling Salesman Problem","277054796":"Optimisation multi-objective des problèmes combinatoires : application à la génération des horaires d\u0027examens finaux","256482968":"Optimising real parameters using the information of a mesh of solutions: VMO algorithm","2419184":"Hierarchical Constraint Transformation using Directed Interval Search for Analog System Synthesis","276280737":"Estimating the Importance of Terrorists in a Terror Network","220615921":"Multi-objective genetic algorithms based automated clustering for fuzzy association rules mining","6286727":"Multiobjective Optimization and Hybrid Evolutionary Algorithm to Solve Constrained Optimization Problems","257153674":"SO-MI: A surrogate model algorithm for computationally expensive nonlinear mixed-integer black-box global optimization problems","220701947":"Theoretical Analysis of the Confidence Interval Based Crossover for Real-Coded Genetic Algorithms","46589723":"Modelado lingüístico flexible mediante el uso de la representación de 2-tuplas lingüísticas","284277008":"A Hybrid Method for Short-Term Traffic Congestion Forecasting Using Genetic Algorithms and Cross Entropy","40906643":"Memetic Algorithms for Continuous Optimisation Based on Local Search Chains","3418583":"Gradual Distributed Genetic Algorithms","269988338":"Genetic Algorithm to infer criteria weights for Multicriteria Inventory Classification","220701890":"Hybrid Distributed Real-Coded Genetic Algorithms.","221434071":"Real-Coded Genetic Algorithms for Optimal Static Load Balancing in Distributed Computing System with Communication Delays","224246971":"How does the good old Genetic Algorithm fare at real world optimization?","286545145":"An Evolutionary Neural Network Controller for Intelligent Active Force Control","245310322":"Kanban optimization by simulation and evolution","221434076":"Hybrid Genetic Algorithm for Minimum Dominating Set Problem","251627281":"EEG simulation by 2D interconnected chaotic oscillators","39431094":"Evolutionaty training for dynamical recurrent neural networks: an application in finantial time series prediction","229025878":"Optimal Reactive Power Dispatch Considering FACTS Devices","268334607":"Using Meta Heuristic Algorithms to Improve Traffic Simulation","259020417":"Methods and Algorithms for Fuzzy Cognitive Map-based Decision Support","238695368":"Chromosome Differentiation for the Application of Parent-Centric Real-Parameter Crossover Operators","220741851":"Application domain study of evolutionary algorithms in optimization problems","265171517":"Computationally Intelligent Modelling and Control of Fluidized Bed Combustion Process","228407403":"Application of soft computing methods for Economic Dispatch in Power Systems","221008091":"Modified SBX and adaptive mutation for real world single objective optimization","238559170":"Evolutionary Optimization of Combined Sewer Overflow","5503407":"Multiobjective Hybrid Optimization and Training of Recurrent Neural Networks","259132047":"3-D Optimization of Ferrite Inductor Considering Hysteresis Loss","8017284":"In silico diagnosis of inherently inhibited gene expression focusing on initial codon combinations","230503491":"Image denoising using pulse coupled neural network with an adaptive Pareto genetic algorithm","270961113":"Optimization of an Unmanned Aerial System\u0027 Wing Using a Flexible Skin Morphing Wing","220227360":"A novel threshold optimization of ML-CFAR detector in Weibull clutter using fuzzy-neural networks","2476580":"Rethinking the Design of Real-Coded Evolutionary Algorithms: Making Discrete Choices in Continuous Search Domains","216301286":"Survey on multiobjective evolutionary and real coded genetic algorithms","220753706":"Combining interpretable fuzzy rule-based classifiers via multi-objective hierarchical evolutionary algorithm","250323182":"Optimum Design for Bow Structure of High Tensile Steel Yacht","221049642":"Composite Laminates Buckling Optimization through Lévy Based Ant Colony Optimization","245419174":"Genetic Algorithms (Binary and Real Codes) for the Optimisation of a Fermentation Process for Butanol Production","3162680":"MPSK modulated constellation design for differential space-time modulation","261275035":"Genetic search for fast object detection","224264023":"Medical Image Registration Using Evolutionary Computation: An Experimental Survey","251813128":"INTELLIGENT CONTROL OF COMPLEX COMBUSTION PROCESSES * UDC 662.61","224761710":"Constrained Nonlinear Multi-objective Predictive Control","228355991":"Real‐parameter crossover operators with multiple descendents: An experimental study","257821010":"Optimization of material parameter identification in biomechanics","265512414":"Using characteristics of the optimisation problem to determine the Genetic Algorithm population size when the number of evaluations is limited","284564216":"Migration policies to improve exploration in parallel island models for optimization via metaheuristics","221157182":"Boosting the Performance of a Multiobjective Algorithm to Design RBFNNs Through Parallelization","232984562":"Heuristic in Spatial Analysis: A Genetic Algorithm for Coverage Maximization","224598897":"Self-adaptive mutation for enhancing evolutionary search in real-coded genetic algorithms","233570301":"Conversion between non-isothermal and isothermal transformation kinetics of γ to α for C–Mn and Nb microalloyed steels","2663984":"Fuzzy Genetic Algorithms: Issues and Models","224347975":"Real-coded genetic algorithms and nonlinear parameter identification","267221492":"Chapter 1 Compact Fuzzy Models and Classifiers through Model Reduction and Evolutionary Optimization","224646014":"A Simple Cellular Genetic Algorithm for Continuous Optimization","289271587":"IEC-Based 3D model retrieval system","3865125":"A hybrid intelligent active force controller for robot arms using evolutionary neural networks","4014626":"Surrogate-assisted coevolutionary search","220231487":"Genetic Algorithm Application to the Standard Arabic Phonemes Classification.","236857407":"International Association of Scientific Innovation and Research (IASIR) PROTEIN TERTIARY STRUCTURE PREDICTION USING EVOLUTIONARY ALGORITHMS","223890298":"Selecting critical clinical features for heart diseases diagnosis with a real-coded genetic algorithm","225370957":"Iterated local search with Powell\u0027s method: A memetic algorithm for continuous global optimization","238730270":"IN PARTIAL FULFILLMENT OF THE REQUIREMENTS FOR THE DEGREE OF MASTER OF ENGINEEERING M. Eng","225406795":"Case Studies for Genetic Algorithms in System Identification Tasks","220437254":"Threshold optimization of decentralized CFAR detection in weibull clutter using genetic algorithms","221927196":"The Roles of Crossover and Mutation in Real-Coded Genetic Algorithms","277287597":"The multiobjective genetic . . . benchmark problems -- an analysis","227414949":"Implicit collusion and individual market power in electricity markets","267238849":"University of Tuning \u0026 Simplifying Heuristical Optimization","222537580":"On linear mixture of expert approaches to information retrieval","220516117":"Logic-Oriented Fuzzy Neural Networks.","4075023":"A framework for optimization using approximate functions","262233488":"Design of prestressed concrete flat slab using modern heuristic optimization techniques. Expert Syst Appl","50991416":"Evolving Pacing Strategies for Team Pursuit Track Cycling","220176172":"Fuzzy-genetic optimization of the parameters of a low cost system for the optical measurement of several dimensions of vehicles","227651495":"Soft Computing Techniques Applied to Combinatorial Catalysis: A New Approach for the Discovery and Optimization of Catalytic Materials","3418627":"Adaptive genetic operators based on coevolution with fuzzy behaviors","256721268":"An adaptive parameter binary-real coded genetic algorithm for constraint optimization problems: Performance analysis and estimation of optimal control parameters","225740623":"Human Motion Retrieval System Based on LMA Features Using Interactive Evolutionary Computation Method","282690277":"A practical review on the applicability of different evolutionary algorithms to 3D feature-based image registration","222197505":"A genetic algorithm estimation of the term structure of interest rates","271608335":"Solving Optimization Problems in Nimrod/OK using a Genetic Algorithm","262233568":"Segmentation of histological images using a metaheuristic-based level set approach","272030327":"Costly Information in Markets with Heterogeneous Agents: A Model with Genetic Programming","224442149":"Identification of electrochemical model parameters in PEM fuel cells","262292965":"An advanced scatter search design for skull-face overlay in craniofacial superimposition","221411195":"Memetic Algorithm for Intense Local Search Methods Using Local Search Chains","281554564":"Optimal Sizing and Placement of Generator Units in Distributed Generation System by Particle Swarm Optimization (PSO) Techniques","222418703":"Two-dimensional optimization of material composition of functionally graded materials using meshless analyses and a genetic algorithm","224177938":"Hybrid gradient projection based Genetic Algorithms for constrained optimization","220403564":"Zhang, G.: Quantum-inspired evolutionary algorithms: a survey and empirical study. J Heuristics 17, 303-351","2485866":"Multiobjective Genetic Algorithm Applied To Benchmark Problems - An Analysis","233988003":"vrugt 2009 self adaptive multimethod global optmization","220742522":"A continuous variable neighbourhood search based on specialised eas: application to the noisy BBO-benchmark 2009 testbed.","272199275":"Modified genetic algorithm using Box Complex method: Application to optimal control problems","3792493":"Automatic constraint transformation with integrated parameter space exploration in analog system synthesis","45860078":"Survival of the flexible: explaining the recent dominance of\nnature-inspired optimization within a rapidly evolving world","228811765":"A novel multi-objective evolutionary algorithm for solving environment/economic dispatch problem","272481898":"A estrutura a termo de taxas de juros no Brasil: modelos, estimação e testes","221608808":"Study of the Influence of the Local Search Method in Memetic Algorithms for Large Scale Continuous Optimization Problems","233452468":"A Genetic Algorithm and Fuzzy Approach (GAFA) for Constrained Nonlinear Optimization in Design","265598346":"PERSONAL INCOME TAX REFORMS: A GENETIC ALGORITHM APPROACH","228816836":"Parallel genetic learning of fuzzy cognitive maps","221616991":"Initial Approaches to the Application of Islands-Based Parallel EDAs in Continuous Domains.","220934976":"Improving the Performance of Multi-objective Genetic Algorithm for Function Approximation Through Parallel Islands Specialisation.","247728297":"Text Classification from Positive and Unlabeled Documents Based on GA","222562090":"A test of genetic algorithms in relevance feedback","222648107":"Genetic granular classifiers in modeling software quality","266031541":"A memetic hybrid method for the Molecular Distance Geometry Problem with incomplete information","269392480":"Building Artificial Economies: From Aggregate Data to Experimental Microstructure. A Methodological Survey","220701512":"Crossover Operator Effect in Function Optimization with Constraints.","273875491":"Improved Transient Performance of a Fuzzy Modified Model Reference Adaptive Controller for an Interacting Coupled Tank System Using Real-Coded Genetic Algorithm","3171905":"Real-Time Performance Evaluation of a Genetic-Algorithm-Based Fuzzy Logic Controller for IPM Motor Drives","23539472":"A utility-based analysis of activity time allocation decisions underlying segmented daily activity - travel patterns","267425159":"Evolving optimal fuzzy-connective-based hierarchical aggregation networks using genetic algorithms","282161830":"Multistage Fuzzy Control of a Stochastic System Using a Bacterial Genetic Algorithm","282494639":"Species co-evolutionary algorithm: a novel evolutionary algorithm based on the ecology and environments for optimization","38027320":"Accurate confidence aware clustering of array CGH tumor profiles","274567712":"High-yield hydrogen production from biomass by in vitro metabolic engineering: Mixed sugars coutilization and kinetic modeling","241171489":"Degree preserving based crossover for constrained optimization problems","267971975":"Constrained Optimization of Rotor-Bearing Systems by Evolutionary Algorithms","241849578":"Measuring and predicting adaptation behavior in multi-dimensional activity-travel patterns","223657941":"A Proposal on Reasoning Methods in Fuzzy Rule-Based Classification Systems","220243877":"Modeling Implicit Collusion Using Coevolution","222676928":"Optimization of heat pipe with axial “Ω”-shaped micro grooves based on a niched Pareto genetic algorithm (NPGA)","220118936":"An elitist non-dominated sorting genetic algorithm enhanced with a neural network applied to the multi-objective optimization of a polysiloxane process","220312489":"A theoretical and empirical study on unbiased boundary-extended crossover for real-valued representation","6314729":"Genetic Algorithms for Finite Mixture Model Based Voxel Classification in Neuroimaging","245390377":"Routing for the Pennsylvania Maglev system by a genetic algorithm","258364911":"Structural Optimization of Cable Systems by Genetic Algorithms","242188517":"Hybrid Real-Coded Genetic Algorithms withFemaleandMale Differentiation","221756349":"Use of genetic algorithm for selection of regularization parameters in multiple constraint inverse ECG problem","226564874":"Hybrid evolutionary algorithm for solving general variational inequality problems","245366827":"An Optimum Design of Crowned Cylindrical Roller Bearings Using Genetic Algorithms","259162623":"Enhancing scalability and accuracy of recommendation systems using unsupervised learning and particle swarm optimization","236877969":"A genetic algorithm for a global optimization problem arising in the detection of gravitational waves.","230689616":"A genetic approach to spot detection in two-dimensional gel electrophoresis images","4278992":"Removing Local Surface Irregularities by Modifying Highlight Lines","220097423":"Optimization of a pumping ship trajectory to clean oil contamination in the open sea","251401327":"Using Class Decomposition for Building GA with Fuzzy Rule-Based Classifiers","225125368":"An approach to parameters estimation of a chromatography model using a clustering genetic algorithm based inverse model","263462183":"On interconnected systems, passivity and some generalisations","251799958":"Decision Making for a Sustainable Chemical Process","220701619":"Heuristic Crossovers for Real-Coded Genetic Algorithms Based on Fuzzy Connectives.","220741565":"Use of statistical outlier detection method in adaptive evolutionary algorithms track: Genetic algorithms","12118574":"A real-coded genetic algorithm for training recurrent neural networks. Neural Netw","227581703":"Comparison of derivative free Newton‐based and evolutionary methods for shape optimization of flow problems","275331838":"A Walk into Metaheuristics for Engineering Optimization: Principles, Methods and Recent Trends","245325831":"Performance Analysis of Three-Phase Self-Excited Induction Generator Using Genetic Algorithm","220235704":"Noise Reduction in CMOS Image Sensor Using Cellular Neural Networks with a Genetic Algorithm","228818745":"Genetic algorithms for finite mixture model based tissue classification in brain MRI","224302020":"Theoretical analysis on an inversion phenomenon of convergence velocity in a Real-Coded GA","257684928":"An effective genetic algorithm to VDA with discontinuous “on-off” switches","221161397":"Characterization of Evaluation Metrics in Topical Web Crawling Based on Genetic Algorithm.","224245702":"Power system stabilizer tuning study of east-central power system in Saudi Arabia","224245697":"Intelligent predictive control methods for synchronous power system","236678279":"Turbofan Multiobjective-Multipoint Optimization for UAV/UCAV Applications","222303197":"A learning process for fuzzy control rules using genetic algorithms","277676560":"Simplified Genetic Algorithm: Simplify and Improve RGA for Parameter Optimizations","224302016":"Harnessing mutational diversity at multiple levels for improving optimization accuracy in G3-PCX","222661594":"Logic-driven fuzzy modeling with fuzzy multiplexers","255034769":"Multicriteria Genetic Tuning for the Optimization and Control of HVAC Systems","222727140":"Validation of genetic algorithm results in a fuel cell model","239667434":"Techniques for Learning and Tuning Fuzzy Rule-Based Systems for Linguistic Modeling and their Application É","223855604":"Design and optimization of input shapers for liquid slosh suppression","245297204":"Pipe Index Vector: A Method to Improve Genetic-Algorithm-Based Pipe Optimization","266587465":"Optimum placement and properties of tuned mass dampers using hybrid genetic algorithms","271603355":"Global–local population memetic algorithm for solving the forward kinematics of parallel manipulators","232852303":"A model for generating optimal process plans in RMS","221008770":"A hybrid approach based on genetic fuzzy systems for Wireless Sensor Networks","260110638":"Optimal design of reactive distillation systems: Application to the production of ethyl tert-butyl ether (ETBE)","266045801":"Algoritmo Memético Basado en Encadenamiento de Búsquedas Locales para Problemas de Optimización Continua","284277315":"Optimal operation of Mula reservoir with combined use of dynamic programming and genetic algorithm","257518058":"Evolutionary response surfaces for classification: an interpretable model. Appl Intell","263806209":"SURVEILLANCE TEST INTERVAL OPTIMIZATION FOR NUCLEAR PLANTS USING MULTI OBJECTIVE REAL PARAMETER GENETIC ALGORITHMS","4323067":"Adaptive Fitness Function for Evolutionary Algorithm and Its Applications","221917057":"An Application of Genetic Fuzzy Systems to the Operation Planning of Hydrothermal Systems","4167299":"A class of unitary constellations for differential space-time modulation","220063711":"An evolutionary tuned driving system for virtual car racing games: The AUTOPIA driver","265300245":"HYBRID INDUSTRIAL ROBOT COMPLIANT MOTION CONTROL","257810839":"Application of RCGA-ANN approach for modeling kerf width and surface roughness in CO2 laser cutting of mild steel. J Braz Soc Mech Sci Eng","221275131":"SoftComputing Techniques Applied to Catalytic Reactions","262285678":"An analysis of the migration rates for biogeography-based optimization","221008866":"Augmented feedforward and feedback control of a twin rotor system using real-coded MOGA","254638591":"Simulation-based analysis and optimization on recipient prioritization for cadaveric liver allocation","260758873":"An Evolutionary Based Dynamic Energy Management Framework for IP-over-DWDM Networks","257888652":"Evolutionary Algorithms With Segment-Based Search for Multiobjective Optimization Problems","220313588":"A genetic algorithm calibration method based on convergence due to genetic drift","3335909":"GA-fuzzy modeling and classification: complexity and performance. IEEE Trans Fuzzy Syst","226147234":"A study on synergy of multiple crossover operators in a hierarchical genetic algorithm applied to structural optimisation","245531771":"Fast and Robust Face Detection Using Genetic Search","245136453":"Parameter identification of viscoplastic model considering dynamic recrystallization","226128800":"Optimal configuration selection for Reconfigurable Manufacturing Systems","235663568":"AntBot: Ant Colonies for Video Games","224100230":"Genetic Algorithm with Population Partitioning and Space Reduction for High Dimensional Problems","221231055":"Continuous Variable Neighbourhood Search Algorithm Based on Evolutionary Metaheuristic Components: A Scalability Test","251901410":"Optimal Power Flow with steady-state voltage stability consideration using Improved Evolutionary Programming","261842296":"Evolutionary Algorithms","3418832":"Evolutionary algorithms + domain knowledge \u003d real-world evolutionary computation","220554176":"A genetic algorithm to obtain the optimal recurrent neural network","245331066":"Modelling and optimization of multiple-aspect RMS configurations","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","221247429":"Research on Emotional Vocabulary-Driven Personalized Music Retrieval.","221532127":"Acquisition of adaptive walking behaviors using machine learning with Central Pattern Generator","220381129":"Theoretical Analysis of Phenotypic Diversity in Real-Valued Evolutionary Algorithms With More-Than-One-Element Replacement","242107522":"MultiCriteria Decision Making for Sustainability-Oriented Chemical Process Design","281685542":"A Real Coded Genetic Algorithm for a Class of Continuous Space Location-Allocation Problems","224231340":"Evolutional design of small antennas for passive UHF-band RFID","255991222":"Um Algoritmo Híbrido Paralelo Cooperativo Baseado em DE, PSO e AG: Uma Avaliação em Computadores Multicore","221786061":"Multicriteria Optimal Humanoid Robot Motion Generation","273349308":"A Real-Coded Genetic Algorithm with a Direction-Based Crossover Operator","224646036":"A Multiparent Version of the Parent-Centric Normal Crossover for Multimodal Optimization","220063722":"Real-parameter crossover operators with multiple descendents: An experimental study.","259687821":"A Genetic Fuzzy Linguistic Combination Method for Fuzzy Rule-Based Multiclassifiers","220510172":"Optimal zoning design by genetic algorithms","261304682":"Roles of real-world properties in the Baldwin effect","263702710":"Guide robot intelligent navigation in urban environments","224086617":"Using Fuzzy Cognitive Map for Evaluation of RFID-based Reverse Logistics Services","288855604":"Differential Evolution Algorithm with Space Partitioning for Large-Scale Optimization Problems","260722828":"Striking a Mean- and Parent-Centric Balance in Real-Valued Crossover Operators","270344983":"Solving molecular flexible docking problems with metaheuristics: A comparative study","228854447":"Facial expression via genetic algorithms","257434707":"Integrated fuzzy-connective-based aggregation network with real-valued genetic algorithm for quality of life evaluation","273912664":"An Improved Polynomial Neural Network Classifier Using Real-Coded Genetic Algorithm","284936176":"Procedural Urban Environments for FPS Games","221842999":"Learning of Fuzzy Cognitive Maps Using Density Estimate","6265679":"Novel scales based on hydrophobicity indices for secondary protein structure","262797496":"Using Simulated Annealing for Robustness in Coevolutionary Genetic Algorithms","231370456":"Real Coded Genetic Algorithm for Optimization of Pervaporation Process Parameters for Removal of Volatile Organics from Water","221357603":"An application of Genetic Fuzzy Systems for wireless sensor networks","221163069":"Multiobjective RBFNNs Designer for Function Approximation: An Application for Mineral Reduction","288857636":"РІШЕННЯ ЗАДАЧІ ВТОРИННОГО ПЕРЕТВОРЕННЯ ІНФОРМАЦІЇ ПРО ПАРАМЕТРИ ПЛАЗМИ ЗА ДОПОМОГОЮ ЕВОЛЮЦІЙНИХ СТРАТЕГІЙ","2238262":"An Indexed Bibliography of Genetic Algorithms in Robotics","5048153":"Social Learning and Monetary Policy Rules","221912623":"A CORBA-Based Control Architecture for Real-Time Teleoperation Tasks in a Developmental Humanoid Robot","222552666":"An experimental study on the applicability of evolutionary algorithms to craniofacial superimposition in forensic identification","4274011":"Craniofacial Superimposition in Forensic Identification using Genetic Algorithms","221225524":"A Dynamic Capacity Assignment Approach for EJB Instance Pools.","267691240":"Optimal Reactive Power Dispatch with SSSC Device Using NSGAII Approach","3418921":"Nonlinear Least Square Regression by Adaptive Domain Method With Multiple Genetic Algorithms","222410332":"Soft computing in multidisciplinary aerospace design - New directions for research","45860262":"Adaptation and Self-Organization in Evolutionary Algorithms","224645756":"Minimum Number of Generations Required for Convergence of Genetic Algorithms","246351280":"A learning process for fuzzy control rules using genetic algorithms1","8017754":"Muhammed, H.H.: Unsupervised fuzzy clustering using weighted incremental neural networks. Int. J. Neural Syst. 14(6), 355-371","263894171":"A fast and efficient multi-objective evolutionary learning scheme for fuzzy rule-based classifiers","222577254":"Coordinated design of a PSS and an SVC-based controller to enhance power system stability","260752558":"Modeling, simulation and optimization of a polluted water pumping process in open sea","255611930":"Algoritmos Genéticos con Codificación Real: Operadores de Cruce Híbridos Basados en Entornos con Múltiples Descendientes","265015533":"Interactive decision procedure for watershed nutrient load reduction: An integrated chance-constrained programming model with risk–cost tradeoff","266353863":"A Genetic Algorithm Specification and Analysis in ROSA","2662159":"Genetic Learning of Fuzzy Rule-Based Classification Systems Cooperating with Fuzzy Reasoning Methods","232642293":"Modeling and Analysis Generic Interface for eXternal numerical codes(MAGIX)","228373173":"A Quasi-Genetic Process Algebra","227104416":"A heuristic to solve a sea cargo revenue management problem","220199478":"Basu, M.: Economic environmental dispatch of fixed head hydrothermal power systems using nondominated sorting genetic algorithm-II. Applied Soft Computing 11, 3046-3055","284014535":"Design of shell-and-tube heat exchangers for multiple objectives using elitist non-dominated sorting genetic algorithm with termination criteria","4151061":"Evolutionary Development of Fuzzy Cognitive Maps","4055827":"Environmental/economic power dispatch using multiobjective evolutionary algorithms: A comparative study","220508692":"Evolving Best-Response Strategies for Market-Driven Agents Using Aggregative Fitness GA","3418884":"Abido, M.A.: Multiobjective evolutionary algorithms for electric power dispatch problem. IEEE Trans. Evol. Comput. 10(3), 315-329","268746548":"Hybrid metaheuristics for optimization using a parallel islands model","227885732":"Inversion of gravity data using a binary formulation","248252925":"Parameter identification of superplastic constitutive model by GA-based global optimization method","220164653":"VHDL-AMS Based Genetic Optimization of Mixed-Physical-Domain Systems in Automotive Applications","221024792":"Introduction to Evolutionary Multiobjective Optimization","221017625":"Using Genetic Algorithms in Closed Loop Identification of the systems with Variable Structure Controller.","221304326":"Surface Extraction from Volumetric Images Using Deformable Meshes: A Comparative Study","233887431":"Genetic algorithm-based regularization parameter estimation for the inverse electrocardiography problem using multiple constraints","226942654":"Improving the Performance of Multi-objective Genetic Algorithm for Function Approximation Through Parallel Islands Specialisation","220942866":"Multiple Crossover per Couple with Selection of the Two Best Offspring: An Experimental Study with the BLX-alpha Crossover Operator for Real-Coded Genetic Algorithms.","227599017":"A crossover operator that uses Pareto optimality in its definition","276365121":"Parameter extraction of different fuel cell models with transferred adaptive differential evolution","220742162":"Using GA-ANN algorithm to predicate coal bump energy.","236961060":"Automatic hippocampus localization in histological images using Differential Evolution-based deformable models","287429217":"Quantum-Inspired Evolutionary Algorithm for Continuous Space Optimization Based on Multiple Chains Encoding Method of Quantum Bits","223855126":"Genetic algorithms for optimisation of chemical kinetics reaction mechanisms","282836889":"Inferring Causal Networks using Fuzzy Cognitive Maps and Evolutionary Algorithms with Application to Gene Regulatory Network Reconstruction","40540457":"EVOLUTIONARY ALGORITHMS FOR DETERMINISTIC AND STOCHASTIC UNCONSTRAINED FUNCTION OPTIMIZATION","237286753":"Evolución de Funciones de Densidad de Probabilidad para Optimización Continua","221531762":"Parallel Learning of Large Fuzzy Cognitive Maps","29974144":"Application des algorithmes évolutionnaires à la détermination de modèles de vitesse par inversion sismique","221007461":"A linear map-based mutation scheme for real coded genetic algorithms","225650238":"Survival of the flexible: Explaining the recent popularity of nature-inspired optimization within a rapidly evolving world","241724709":"An Optimal Design Methodology of Tapered Roller Bearings Using Genetic Algorithms","262357229":"Localising and quantifying damage by means of a multi-chromosome genetic algorithm","282269597":"Application Methods for a Niche Genetic Algorithm for Design of Reactive Distillation Processes","267929769":"Two modified coherent gradient sensing methods for slope measurement of reflective surfaces","224651824":"Design of PSS and STATCOM-based damping stabilizers using genetic algorithms","250032564":"Multiobjective optimization of availability and cost in repairable systems design via genetic algorithms and discrete event simulation","221253222":"Induction of Linear Decision Trees with Real-Coded Genetic Algorithms and k-D Trees.","220403316":"A fast Pareto genetic algorithm approach for solving expensive multiobjective optimization problems","4262680":"Sliding Mode Genetic Speed Control of Synchronous Reluctance Motor","225587756":"Expert-Based and Computational Methods for Developing Fuzzy Cognitive Maps","255657058":"Modeling implicit collusio ni n electricity markets using co-evolution","290477617":"A survey of biogeography-based optimization","255631454":"Operadores de Cruce con Múltiples Descendientes para Algoritmos Genéticos con Codificación Real: Estudio Experimental","28209866":"Using Pareto Optimality for Defining the Mutation Operator Step Size","260607212":"Troubleshooting in geoelectrical prospecting using real-coded genetic algorithm with chromosomal extrapolation","220549699":"GOLS - Genetic orthogonal least squares algorithm for training RBF networks","3418963":"Natural Encoding for Evolutionary Supervised Learning","261197049":"Low-speed aerodynamic characteristics improvement of ATR 42 airfoil using a morphing wing approach","271624024":"Investigating the optimal passive and active vibration controls of adjacent buildings based on performance indices using genetic algorithms","225585691":"Replacement Strategies to Maintain Useful Diversity in Steady-State Genetic Algorithms","226852591":"An approach to polynomial NARX/NARMAX systems identification in a closed-loop with variable structure control","259781643":"Low - speed aerodynamic characteristics improvement of ATR 42 airfoil using a morphing wing approach","259358725":"Optimum Design of Steel Frames using Stochastic Search Techniques Based on Natural Phenomena: A Review","34466173":"Approaching sustainability in engineering design with multiple criteria decision analysis [electronic resource] /","269690723":"Correlation of thermal mathematical models for thermal control of space vehicles by means of genetic algorithms","222297678":"Genetic algorithm dynamic performance evaluation for RFID reverse logistic management","272081732":"Genetic Algorithm Optimization of Point Charges in Force Field Development: Challenges and Insights","27811551":"Multi-Objective Optimization of an Industrial Isoprene Production Unit by Using Genetic Algorithm Approach","8357640":"Real-Coded Memetic Algorithms with Crossover Hill-Climbing","221533772":"Multi-Objective Data Clustering using Variable-Length Real Jumping Genes Genetic Algorithm and Local Search Method","224177701":"Interactive interpolating crossover in grammatical evolution","224623128":"Evolutionary particle filter: Re-sampling from the genetic algorithm perspective","220285533":"Evolving neural network using real coded genetic algorithm (GA) for multispectral image classification. Future Generations Comp Syst","227210998":"On Similarity-Based Surrogate Models for Expensive Single- and Multi-objective Evolutionary Optimization","256970799":"Combined heat and power economic emission dispatch using nondominated sorting genetic algorithm-II","282050382":"Economic emission dispatch of combined heat and power system","239373766":"Efficient real code genetic algorithm to solve the non-convex hydrothermal scheduling problem. Electr Power Energy Syst 29:738?747","221007535":"Real-coded Genetic Algorithm for Parametric Modelling of a TRMS","220755630":"Noise reduction using genetic algorithm based PCNN method","264199223":"Optimal Design of Water Distribution Systems Based on Entropy and Topology","267853950":"Control System Design Using Evolutionary Algorithms for Autonomous Shipboard Recovery of Unmanned Aerial Vehicles","236684688":"Genetic Fuzzy-based Steering Wheel Controller using a Mass-Produced Car","8161264":"Heterogeneous Fuzzy Logic Networks: Fundamentals and Development Studies","239832517":"Are Husbands Really That Cheap?","221139646":"Mitigating Deception in Genetic Search Through Suitable Coding.","221965992":"On the Easiest and Hardest Fitness Functions","46590293":"Diseño de sistemas inteligenes en plataformas de computo paralelas","265397316":"Mining Pharmacy Database Using Evolutionary Genetic Algorithm","220528306":"Multi-objective hierarchical genetic algorithm for interpretable fuzzy rule-based knowledge extraction","274730999":"Evolutionary algorithm enhancement for model predictive control and real-time decision support","220403386":"Improving crossover operator for real-coded genetic algorithms using virtual parents","224670457":"Applying permutation modulation to spread-spectrum systems","221006513":"A genetic algorithm used to fit Debye functions to the dielectric properties of tissues","224089796":"Reactive Power Planning Using a Two-Level Optimizer Based on Multi-Objective Algorithms","225569489":"Crossover Operator Effect in Function Optimization with Constraints","224297727":"Automated learning multi-criteria classifiers for FLIR ship imagery classification","220308098":"A Recommendation System Based-on Interactive Evolutionary Computation with Data Grouping","220256902":"Model selection via Genetic Algorithms for RBF networks","277935930":"Evolutionary Fuzzy Relational Modeling for Fuzzy Time Series Forecasting","242484697":"Soft Sensor for NO x Emission using Dynamical Neural Network","220741272":"A Real-Coded Genetic Algorithm using Distance Dependent Alternation Model for Complex Function Optimization.","220306064":"A two-layer library-based approach to synthesis of analog systems from VHDL-AMS specifications","268045385":"Dynamic stability enhancement of East-central system in Saudi Arabia via PSS tuning","248503676":"Using GA–ANN algorithm to optimize soft magnetic properties of nanocrystalline mechanically alloyed Fe–Si powders","221006489":"Born to trade: A genetically evolved keyword bidder for sponsored search","227029566":"Coevolving Negotiation Strategies for P-S-Optimizing Agents","261040183":"A fast learning algorithm for uninorm-based fuzzy neural networks","265300073":"COMPUTATIONAL INTELLIGENCE BASED SIMULTANEOUS DETERMINATION OF THE SPATIAL PROFILE OF THE LASER BEAM AND VIBRATIONAL-TO-TRANSLATIONAL RELAXATION TIME BY PULSED PHOTOACOUSTICS","220877457":"A Modular Geometric Constraint Solver for User Interface Applications","46590331":"Algoritmos meméticos con aplicación adaptativa de la búsqueda local para optimización continua","220867223":"Evolutionary Algorithms for Optimal Control in Fed-Batch Fermentation Processes","224144031":"Multiobjective Evolutionary Optimization of Training and Topology of Recurrent Neural Networks for Time-Series Prediction","222337667":"Multi-objective optimisation of real-valued parameters of a hybrid MT system using Genetic Algorithms","261491792":"A Hybrid Control Scheme for a Twin Rotor System with Multi Objective Genetic Algorithm","267233322":"Fungi as Metaphors for Resource Management","257675410":"System Capacity Analysis and Antenna Placement Optimization for Downlink Transmission in Distributed Antenna Systems","220516078":"Analysis and improvement of the genetic discovery component of XCS.","230849033":"A genetic algorithm for optimizing multi-pole Debye models of tissue dielectric properties","222732938":"Characterisation and comparison of gender-specific utility functions of shopping duration episodes","264159346":"Isogeometric analysis and Genetic Algorithm for shape-adaptive composite marine propellers","224182930":"A distance measure comparison to improve crowding in multi-modal optimization problems","279676794":"ALT KISMİ MOMENT VE YARI-VARYANS RİSK MODELLERİ KULLANARAK GENETİK ALGORİTMA YARDIMIYLA PORTFÖY OPTİMİZASYONU: İMKB UYGULAMASI","220176077":"DE/BBO: A hybrid differential evolution with biogeography-based optimization for global numerical optimization","232630794":"A Mobile Agent Framework to Support Parallel Computing: Application to Multi-product Planning and Scheduling Problems","223396489":"A coupled finite element-optimization technique to determine critical microburst parameters for transmission towers","283533114":"Genetic Algorithm for Energy Consumption Variance Minimisation in Manufacturing Production Lines Through Schedule Manipulation","26532427":"Tuning Range Image Segmentation by Genetic Algorithm","4339619":"Low Dimensional Reproduction Strategy for Real-Coded Evolutionary Algorithms","44686664":"Using a priori Information for Regularization in Breast Microwave Image Reconstruction","265777202":"Advances in metaheuristics. Contributions presented at the 9th metaheuristic international conference, Udine, Italy, July 25–28, 2011","220740301":"Genetic algorithm in removing local NURBS surface irregularities using highlight lines","241182088":"Optimal location of multi type FACTS devices for multiple contingencies using genetic algorithms","256756900":"Development of plotting position for the general extreme value distribution","224055990":"A self-tuning minimum variance controller based on multivariable\nmultisample models","215617334":"Adaptation and Self-Organization in Evolutionary Algorithms","283228940":"A simple and efficient real-coded genetic algorithm for constrained optimization","222419631":"Learning with misspecification in an artificial currency market","267550726":"Optimal Reactive Power Dispatch Incorporating UPFC Devices using NSGA II Approach","232631849":"Parametric modelling of flexible plate structures using real-coded genetic algorithms","269727719":"A genetic algorithm-based learning approach to understand customer satisfaction with OTA websites","4376500":"Path optimization using Genetic Algorithm in laser scanning system","222305976":"An Evolutionary Strategy for Fed-Batch Bioreactor Optimization: Concepts and Performance","261045365":"Simultaneous Optimal Design of Measurement and Communication Infrastructures in Hierarchical Structured WAMS","4248507":"Higher-order Fuzzy Cognitive Maps","220356318":"An Adaptive Real-Coded Genetic Algorithm.","250322199":"Midship Section Optimization of Hatchcoverless Container Ship Based on Real-Coded Micro-Genetic Algorithm","222975668":"2001) “Approximating and Simulating the Stochastic Growth Model: Parameterized Expectations, Neural Networks and the Genetic Algorithm"},"index":589}