{"abs":"We explore a goal-oriented as opposed to a problem-oriented approach to DSS development for ecosystem management. Ecosystem management ordinarily is guided by a set of goals that may conflict in various ways. Problems are perceived obstacles to realizing goals. Identifying and resolving conflicts between goals, testing current or projected situations for goal satisfaction, and problem identification all require a robust model of the goal structure for the intended domain. The lowest level of this goal structure must be represented as desirable future conditions consisting of proposed values for observable indicators. A model of the causal, legal, and other institutional relations between these desirable future conditions is also needed. Two projects based on a goal-oriented approach to DSS development are described. The first project has produced an initial prototype that incorporates goals for forest management in rules representing three tiers: management unit goals, stand-level goals, and desirable future conditions. The second, at an initial knowledge acquisition stage, is an attempt to develop a participatory decision-making methodology for socially and environmentally sensitive economic development in Central America.","title":"Goals and goal orientation in decision support systems for ecosystem management","id":222130665,"url":"https://www.researchgate.net/publication/222130665_Goals_and_goal_orientation_in_decision_support_systems_for_ecosystem_management","names":["Donald Nute","G Rosenberg","S Nath","B. P. Verma","H.M Rauscher","Mark J. Twery","Computers and Electronics in Agriculture"],"references":{"282677800":"A decision support system for evaluating the effects of alternative farm management systems on water quality and economics","229781792":"Computer Assisted Negotiation of Multiple Objective Water Resources Conflicts","246900724":"Multiple Objective Decision Support for Environmental Management","247647505":"GMCR in negotiations","288195528":"Co-learning our way to sustainability: An integrated and community-based research approach to support natural resource management decision-making","229598633":"The Graph Model For Conflict Resolution","251425380":"Reservoir Management and Operation Models: A State of the Art Review","221994864":"Negotiation Support Systems: An Overview of Design Issues and Existing Software","246651727":"Large-Scale Management Experiments and Learning by Doing","234150376":"Ecological Optimization and Adaptive Management","243762793":"Multiobjective Programming and Planning","37887900":"Adaptive Environmental Assessment and Management"},"citedIn":{"42608136":"Use of an Action-Selection Framework for Human-Carnivore Conflict in the Bangladesh Sundarbans","267250217":"A Spatially-explicit Decision Support System for Everglades Risk Assessment and Restoration Annual Report","281691087":"Management in Support of Sustainable Forestry: a Review","222186808":"Spatial Forest Planning: A Review","226740868":"Decision Support Systems in Forest Management","209805836":"Integrating the fuzzy analytic hierarchy process with dynamic programming approach for determining the optimal forest management decisions. Ecol Model","235048524":"Computer-Aided Decision Making","227411328":"Assessing multi-criteria approaches with environmental, economic and social attributes, weights and procedures: A case study in the Pampas, Argentina. Agricultural Water Management, 98(10), 1545-1556","227053464":"Computer-aided decision making","225716129":"The roles of a decision support system in applying forest ecosystem management in Northeast China","228947775":"A spacial decision support system for revegetation of dump of opencast coal mine","242103283":"Decision Support for Ecosystem Management and Ecological Assessments","242522089":"The Sundarbans tiger: adaptation, population status and conflict management","229357576":"Visualization and system dynamics modeling of the global appetite for protein","278077431":"Integrated decision support for sustainable forest management in the United States: Fact or fiction?","237630671":"SEARCHING FOR PRESCRIPTIVE TREATMENT SCHEDULES WITH A GENETIC ALGORITHM: A TOOL FOR FOREST MANAGEMENT","223396279":"A practical decision-analysis process for forest ecosystem management","222681839":"NED-1: Integrated analyses for forest stewardship decisions","4262250":"A Fuzzy Purpose-in-Life Perspective for Artificial Intelligence, Robotics and Computational Intelligence","237746951":"A GIS-based decision support system for revegetation and reclamation of Opencast Coal Mine spoils","222511468":"Integrated decision support for sustainable forest management in the United States: Fact or fiction?","237038351":"The application of and unresolved problems regarding the use of objectives in software engineering","240637285":"A Multi-criteria1 Decision Support System for Forest Management","242283012":"An intelligent decision support system for revegetation and reclamation of land contaminated from coal mine wastes","241226646":"Toward Developing and Using Spatial Decision Support System for forest ecosystem revegetation in the Yangtze River Basin","222402166":"NED-2: A decision support system for integrated forest ecosystem management","226728186":"Geospatial modeling of Brown oak (Quercus semecarpifolia) habitats in the Kumaun Himalaya under climate change scenario"},"index":591}