{"abs":"Genetic Algorithms constitute a robust tool in aerodynamic shape optimization problems with one or more objectives. However, a known drawback is that they often require a large amount of evaluations based on time-consuming CFD analysis tools. The scope of this paper is to introduce the use of Radial Basis Function networks for the approximate pre-evaluation of candidate solutions in each generation. These networks are \"locally\" trained on a small number of previously examined solutions which are closer to each new solution; by building small-sized local networks, we avoid huge networks with time-consuming trainings. The Radial Basis Function networks are appropriate for multi-objective optimization problems, as will be explained in the text. Their effectiveness increases by assigning importance factors to each one of the design variables, so as to eliminate much of the noise that the less important design variables may cause during the networks\u0027 training and use. The concurrent evaluation of a number of individuals on networked workstations, using the PVM message-passing model, is discussed in detail.","title":"A Reduced-Cost Multi-Objective Optimization Method Based on the Pareto Front Technique, Neural Networks and PVM","id":235709562,"url":"https://www.researchgate.net/publication/235709562_A_Reduced-Cost_Multi-Objective_Optimization_Method_Based_on_the_Pareto_Front_Technique_Neural_Networks_and_PVM","names":["Giannakoglou K C A.P. Giotis","Jacques Periaux"],"references":{"223234414":"Solution of flow problems using unstructured grids on distributed memory platforms"},"citedIn":{"228782051":"Low-cost stochastic optimization for engineering applications","221006861":"Metamodel-Assisted Mixed Integer Evolution Strategies and Their Application to Intravascular Ultrasound Image Analysis","227767126":"Inexact information aided, low‐cost, distributed genetic algorithms for aerodynamic shape optimization","235189346":"Trends in Intelligent System Technologies for Airfoil Design: - Computer Algebra Techniques for Gradient Computation through the Continuous Adjoint Approach - Use of Approximate Fitness Evaluators in Evolutionary Optimization","266652748":"Aerodynamic shape design using hybrid evolutionary computation and fitness approximation","240852241":"METAMODEL-ASSISTED EVOLUTION STRATEGIES APPLIED IN ELECTROMAGNETIC COMPATIBILITY DESIGN","235011306":"Airfoil Design Using Navier-Stokes Equations and Hybrid Evolutionary Optimization Techniques","245433354":"Role of Eigenvectors in Aircraft Dynamics Optimization","216300591":"Metamodel-assisted Multiobjective Optimisation Strategies and Their Application in Airfoil Design","202256709":"A reduced-cost SMS-EMOA using kriging, self-adaptation, and parallelization","250752255":"EVOLUTIONARY ALGORITHMS WITH SURROGATE MODELING FOR COMPUTATIONALLY EXPENSIVE OPTIMIZATION PROBLEMS","24373629":"Evaluation of Genetic Algorithm Concepts Using Model Problems","238565704":"STOCHASTIC AND DETERMINISTIC OPTIMIZATION FOR TURBOMACHINERY APPLICATIONS BASED ON THE ADJOINT FORMULATION","229659299":"Hierarchical distributed metamodel‐assisted evolutionary algorithms in shape optimization","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","46491920":"Evolutionary optimisation of noisy multi-objective problems using confidence-based dynamic resampling","245439959":"Genetic Algorithms Applied to Multi-Objective Aerospace Shape Optimization","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","220285304":"Grid enabled, hierarchical distributed metamodel-assisted evolutionary algorithms for aerodynamic shape optimization","226738239":"Multilevel Optimization Algorithms Based on Metamodel- and Fitness Inheritance-Assisted Evolutionary Algorithms","228957563":"ON THE USE OF SURROGATE EVALUATION MODELS IN MULTI-OBJECTIVE EVOLUTIONARY ALGORITHMS","250693102":"A multilevel approach to single- and multiobjective aerodynamic optimization"},"index":592}