{"abs":"Kriging approximation has been widely used in reliability-based design optimization (RBDO) to replace the complex black-box performance functions. In this paper, a new local approximation method using the most probable point (LMPP) is proposed to improve the accuracy and efficiency of RBDO methods using Kriging model. In the LMPP, the concept of local sampling region is used and the most probable point (MPP) is chosen as the sampling center. The size of the local region is determined by target reliability and the linearity of probability constraint around MPP. Rather than fitting the Kriging model for all the probabilistic constraints, the new method uses the MPP to find feasible constraints, and only these feasible constraints are accurately approximated, which can significantly improve the optimization efficiency. Importance Sampling method using the MPP obtained above as sampling center is utilized to perform reliability analysis and reliability sensitivity calculation. A numerical example, a honeycomb material design problem and a box girder design application are used to demonstrate the computational capability of the LMPP method. The comparison results demonstrate that RBDO using the proposed method is very effective.","title":"A local Kriging approximation method using MPP for reliability-based design optimization","id":283633536,"url":"https://www.researchgate.net/publication/283633536_A_local_Kriging_approximation_method_using_MPP_for_reliability-based_design_optimization","names":["Xiaoke Li","Haobo Qiu","Zhenzhong Chen","Liang Gao","Xinyu Shao","Computers \u0026 Structures"],"references":{"257774300":"A new adaptive importance sampling Monte Carlo Method for structural reliability","245284895":"Efficient Algorithm for Second-Order Reliability Analysis","269207695":"Safety-factor based approach for probability-based design optimization","262357415":"A local adaptive sampling method for reliability-based design optimization using Kriging model","245366298":"Chen, W.: Sequential Optimization and Reliability Assessment method for Efficient Probabilistic Design. ASME J Mech Des 126, 225-233","4772045":"Bayesian Calibration of Computer Models","225686137":"An inverse-measure-based unilevel architecture for reliability-based design optimization","228381846":"First-Order Approximation Methods in Reliability-Based Design Optimization","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","222510542":"Bucher, C.G.: Adaptive sampling—an iterative fast Monte Carlo procedure. Struct. Saf. 5(2), 119-126","227446046":"Importance Sampling for Stochastic Simulations","254071478":"Enriched Performance Measure Approach (PMA+) for Reliability-Based Design","230309294":"Gaussian process emulators for the stochastic finite element method","270741174":"Reliability-Based Design Optimization Using Response Surface Method With Prediction Interval Estimation","285236758":"Enriched Performance Measure Approach (PMA+) for Reliability-Based Design Optimization","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","226138596":"A study using Monte Carlo Simulation for failure probability calculation in Reliability-Based Optimization","257335030":"An optimal shifting vector approach for efficient probabilistic design","225799380":"Design sensitivity and reliability-based structural optimization by univariate decomposition","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","245211961":"Reliability-based design optimization using convex linearization and sequential optimization and reliability assessment method","235255969":"Metamodeling Method Using Dynamic Kriging for Design Optimization","278639026":"Reliability Based Design Optimization Using a Single Constraint Approximation Point","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","222881380":"Exact optimal designs for computer experiments via Kriging metamodelling","225104472":"An improved radial basis function network for structural reliability analysis","222746740":"Reliable design space and complete single-loop reliability-based design optimization","226473292":"A direct decoupling approach for efficient reliability-based design optimization","238184454":"A New Study on Reliability-Based Design Optimization","222548735":"Bayesian analysis of computer code outputs: A tutorial","225516876":"Metamodels for Computer-based Engineering Design: Survey and recommendations","223906278":"Application of Kriging method to structural reliability","261299116":"System Reliability Based Design Optimization with Monte Carlo simulation","274437403":"The applications of an importance sampling method to reliability analysis of the inside flap of an aircraft","222165116":"Observations on applications of importance sampling in structural reliability analysis","222718989":"A sampling technique enhancing accuracy and efficiency of metamodel-based RBDO: Constraint boundary sampling","228845676":"Multi-fidelity optimization procedure for honeycomb-type cellular materials","226646224":"Adaptive-sparse polynomial chaos expansion for reliability analysis and design of complex engineering systems","228916087":"Moving least square method for reliability-based design optimization","242415022":"Reliability-based design optimization using efficient global reliability analysis","245284675":"Distribution of Quadratic Forms in Normal Space—Application to Structural Reliability","275188793":"Asymptotic Approximations for Multinormal Integrals","248560911":"Importance sampling in structural system","267488430":"Response Surface Method Using Sequential Sampling for Reliability-Based Design Optimization","268464225":"Reliability-based structural design optimization for practical applications. AIAA","250697237":"Adaptive explicit decision functions for probabilistic design and optimization using support vector machines","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","226317334":"The Use of Metamodeling Techniques for Optimization Under Uncertainty","287565512":"Sequential Optimization and Reliability Assessment Method for Efficient Probabilistic Design","220411853":"A Novel Hybrid Sequential Design Strategy for Global Surrogate Modeling of Computer Experiments","225424001":"An accurate penalty-based approach for reliability-based design optimization. Res Eng Des","236660847":"Exact and Invariant Second Moment Code Format","245284587":"Improvement Of Second-Order Reliability Estimates by Importance Sampling","256919079":"An adaptive decoupling approach for reliability-based design","223369127":"Reliability-based optimal structural design by the decoupling approach","256919084":"A method for enhancing computational efficiency in Monte Carlo calculation of failure probabilities by exploiting FORM results","229345109":"Reliability analysis of structures using artificial neural network based genetic algorithms","258303130":"Reliability-based design optimization using a moment method and a kriging metamodel"},"citedIn":{},"index":595}