{"abs":"This tutorial focus on several new real-world applications that have been developed using an integrated set of methods, including tabu search, scatter search, mixed integer programming, and neural networks, combined with simulation. Applications include project portfolio optimization and supply chain management.","title":"New Advances and Applications for Marrying Simulation and Optimization.","id":221527431,"url":"https://www.researchgate.net/publication/221527431_New_Advances_and_Applications_for_Marrying_Simulation_and_Optimization","names":["Jay April","Marco Better","Fred Glover","James P. Kelly"],"references":{"254514411":"Optimal Appraisal Well Location Through Efficient Uncertainty Reduction And Value Of Information Techniques","221024271":"A Template for Scatter Search and Path Relinking","228592963":"Scatter Search","221527568":"Simulation-based optimization: practical introduction to simulation optimization.","221528208":"OptQuest software tutorial: portfolio optimization for capital investment projects.","235926698":"Portfolio Selection","228598055":"Scatter search for the linear ordering problem","220668905":"Simulation Optimization is Evolving","4053874":"OptFolio - A simulation optimization system for project portfolio planning","221527879":"Risk analysis software tutorial II: OptFolio - a simulation optimization system for project portfolio planning.","239060357":"Fundamentals of Scatter Search and Path Relinking","262162076":"An Experimental Evaluation of a Scatter Search for the Linear Ordering Problem","4053859":"Practical introduction to simulation optimization","3997730":"Portfolio optimization for capital investment projects"},"citedIn":{"261050573":"Using multi-criteria modeling and simulation to achieve lean goals","221527287":"Simplification and aggregation strategies applied for factory analysis in conceptual phase using simulation","220708515":"Simulation Management for Agent-Based Distributed Systems.","238436723":"DEVELOPMENT OF A SIMULATION TOOL TO ASSESS A PETROLEUM COMPANY SALES \u0026 OPERATION PLANNING","237449386":"Deploying Decision Support Systems Based on Simulation Models Einsatz von Entscheidungsunterstützungssystemen auf der Basis von Simulationsmodellen","261117854":"Factory flow design and analysis using internet-enabled simulation-based optimization and automatic model generation","221528890":"Simulation optimization applied to injection molding","278022940":"Multi-Objective Optimization of a Real-World Manufacturing Process Using Cuckoo Search","254050539":"Performance analysis of comercial simulation-based optimization packages: OptQuest and Witness Optimizer","262285427":"Investigating the use of multi meta-heuristics in simulation optimization","46491920":"Evolutionary optimisation of noisy multi-objective problems using confidence-based dynamic resampling","220711154":"Towards Automated Simulation of Multi Agent based Systems.","261312774":"A multicriteria simulation optimization method for injection molding","261122374":"Real-world simulation-based manufacturing optimization using Cuckoo Search","27531827":"Adaptive Random Search Methods for Simulation Optimization","229344627":"Multi-objective evolutionary simulation-optimisation of a real-world manufacturing problem","220136518":"A framework for locally convergent random-search algorithms for discrete optimization via simulation","221526638":"A Simulation-based Approach for Estimating the Commercial Capacity of Railways.","4213852":"Discrete optimization via simulation using coordinate search","221528362":"New advances for wedding optimization and simulation","221529899":"Empowering decision support with simulation technology - Scenario Navigator","3724888":"Simulation Optimization: Methods And Applications","226446175":"OPTIMISE: An Internet-Based Platform for Metamodel-Assisted Simulation Optimization","238433879":"Metamodel-Assisted Simulation-Based Optimisation of Manufacturing Systems","283578372":"Simulation-based Optimization of a Real-world Travelling Salesman Problem Using an Evolutionary Algorithm with a Repair Function","235439020":"Computational intelligence approaches and Evolutionary algorithms: A Studyfor Financial Derivatives","238179287":"Framework for Multiobjective Optimization of Launching Girder Bridges","34658550":"Analyzing the interdiction of sea-borne threats using simulation optimization /","257337777":"An efficient algorithm for press line optimisation","221528605":"Using multi-criteria modeling and simulation to achieve lean goals.","224251831":"A Policy-Based Simulator for Assisted Adaptive Vertical Handover","221527326":"Automated execution of simulation studies demonstrated via a simulation of a car","264871330":"Enfoques para el Rediseño de la Cadena de Suministro *","264506152":"Online supplement: Averaging frameworks for simulation optimization with applications to simulated annealing","228707279":"Metamodel-Assisted Simulation-Based Optimization of a Real-World Manufacturing Problem","221528410":"Simulation-optimization using a reinforcement learning approach","220909210":"Simulation-based optimisation using local search and neural network metamodels","254404248":"Production and inventory management with substitutions","221526279":"On-Line Instrumentation for Simulation-Based Optimization","2411230":"Simulation Optimization: Methods And Applications","239795249":"A Comparative Study of Production Control Mechanisms using Simulation-based Multi-Objective Optimization","228648733":"A CASE STUDY OF USING SIMULATION AND SOFT COMPUTING TECHNIQUES FOR OPTIMISATION OF MANUFACTURING SYSTEMS","281654132":"Personnel Scheduling in Queues with Time-varying Arrival Rates: Applications of Simulation-Optimization","221527371":"Simulation optimization: A review, new developments, and applications"},"index":598}