{"abs":"Quantifying the uncertainty in the dynamic properties of large-scale complex engineering structures presents significant computational challenges. Monte Carlo simulation (MCS) method is extensively employed to perform uncertainty quantification (UQ) because of its generality, stability, and easy implementation. However, a brute-force MCS approach may be unaffordable and impractical when the target model contains a large number of uncertain parameters. In this circumstance, MCS requires a potentially burdensome (if not computationally intractable) number of model evaluations to obtain a credible estimate of the global statistics. In this study, a general framework for analytical UQ of model outputs using a Gaussian process (GP) metamodel is presented, where case inputs are characterized as normal and/or uniform random variables. A detailed derivation of important low-order statistical moments (mean and variance) is given analytically. This analytical method is adopted to characterize the uncertainty of modal frequencies of two bridges with assumed normally- and uniformly-distributed parameters. Meanwhile, the brute-force MCS approach is used for comparison of GP metamodel-derived statistics. Results show that the GP method outperforms the MCS methodology in terms of computational cost, with consistency in the ”true” values obtained by MCS. It demonstrates that this GP method is feasible and reliable for modal frequency UQ of complex structures.","title":"Analytical uncertainty quantification for modal frequencies with structural parameter uncertainty using a Gaussian process metamodel","id":263930576,"url":"https://www.researchgate.net/publication/263930576_Analytical_uncertainty_quantification_for_modal_frequencies_with_structural_parameter_uncertainty_using_a_Gaussian_process_metamodel","names":["Hua-Ping Wan","Zhu Mao","Michael Douglas Todd","Wei-Xin Ren","Engineering Structures"],"references":{"241077911":"A Complete Framework for Verification, Validation, and Uncertainty Quantification in Scientific Computing (Invited)","41781559":"Gaussian Process for Machine Learning","269619584":"Error and uncertainty quantification and sensitivity analysis in mechanics computational models","276166310":"Parameter Selection in Finite-Element-Model Updating by Global Sensitivity Analysis Using Gaussian Process Metamodel","228630197":"Structural Finite Element Model Updating Using Ambient Vibration Test Results","236843208":"Kriging Models for Global Approximation in Simulation-Based Multidisciplinary Design Optimization","256919109":"Stochastic structural dynamic analysis using Bayesian emulators","38363487":"The Design and Analysis of Computer Experiments","2593712":"Computing High Dimensional Integral with Applications to Finance","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","243366488":"Some observations on uncertainty propagation through a simple nonlinear system","222609753":"A fuzzy finite element procedure for the calculation of uncertain frequency-response functions of damped structures: Part 1—Procedure","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","222235359":"Finite element model updating in structural dynamics by using the response surface method","216301381":"The Design and Analysis Computer Experiments","236030003":"Finite Element Modelling and Updating of a Lively Footbridge: The Complete Process","257272118":"Statistical modeling of frequency response function estimation for uncertainty quantification","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","258683469":"Bayesian sensitivity analysis of a nonlinear finite element model","241137782":"Dynamic Assessment of Curved Cable-Stayed Bridge by Model Updating","222421034":"Dynamic analysis of a half-through concrete-filled tubular arch bridge","2879044":"A Comparison Study of Modal Parameter Confidence Intervals Computed Using the Monte Carlo and Bootstrap Techniques","221404480":"Computational Investigation of Low-Discrepancy Sequences in Simulation Algorithms for Bayesian Networks.","223187326":"A comprehensive overview of a non-parametric probabilistic approach of model uncertainties for predictive models in structural dynamics","258683487":"A stochastic model updating method for parameter variability quantification based on response surface models and Monte Carlo simulation","2568019":"Gaussian Process Priors With Uncertain Inputs - Application to Multiple-Step Ahead Time Series Forecasting","232405678":"Model validation under epistemic uncertainty","267489924":"Characterization of Dynamic Response of Structures With Uncertainty by Using Gaussian Processes","223795617":"Interval sensitivity theory and its application to frequency response envelope analysis of uncertain structures","265179126":"Uncertainty Quantification in Viscous Hypersonic Flows using Gradient Information and Surrogate Modeling","232399267":"Interval model updating with irreducible uncertainty using the Kriging predictor","267921026":"Efficient Quantification of Aerodynamic Uncertainty due to Random Geometry Perturbations","223664239":"The characterization of uncertainty in Probabilistic Risk Assessments of complex systems","222548735":"Bayesian analysis of computer code outputs: A tutorial","229665037":"Damage identification of structures with uncertain frequency and mode shape data","228339939":"Diagnostics for Gaussian Process Emulators"},"citedIn":{"277253735":"A residual-based Gaussian process model framework for finite element model updating","275258476":"Interval Finite Element Analysis of Structural Dynamic Problems"},"index":600}