{"abs":"Kriging models have been widely used as surrogate models to reduce computational costs in structural reliability analysis with time-consuming numerical models (e.g. finite element analysis (FEA) structural models). Their interpolation capability and prediction uncertainty measure have been explored in the de-velopment of efficient adaptive surrogate models with active refinement algorithms. The latter use the predic-tion uncertainty measure to identify new samples that should be sequentially added to the design of experiments, allowing an effective control of the surrogate model accuracy. The refinement process proceeds until prescribed convergence or stopping criteria are satisfied. In the present paper an additional stopping cri-terion for active refinement algorithms in Kriging surrogate models is proposed. It exploits the possible stabi-lization of the failure probability prediction during the active refinement process, indicating that the additional samples are not contributing to improve significantly the prediction accuracy. The refinement process can therefore be stopped to maximize the efficiency. The performance of the proposed additional stopping criteri-on in terms of efficiency and accuracy is demonstrated in the paper with a numerical example involving an advanced nonlinear FEA structural model and its practical usefulness and limitations are discussed.","title":"A study on a stopping criterion for active refinement algorithms in Kriging surrogate models","id":283056222,"url":"https://www.researchgate.net/publication/283056222_A_study_on_a_stopping_criterion_for_active_refinement_algorithms_in_Kriging_surrogate_models","names":["Bruno Gaspar","A. P. Teixeira","Carlos Guedes Soares"],"references":{"223337455":"Corrosion fatigue and multiple site damage reliability analysis","228954980":"A comparison of approximate response functions in structural reliability analysis, Probabilistic","275087204":"System Reliability Analysis by Monte Carlo Based Method and Finite Element Structural Models","216301381":"The Design and Analysis Computer Experiments","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","232372925":"Methods for ultimate limit state assessment of ships and ship-shaped offshore structures: Part II stiffened panels","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","223059021":"Adaptive simulation for system reliability analysis of large structures","266323381":"Combining polynomial chaos expansions and Kriging for solving structural reliability problems","283056052":"Structural reliability analysis combining Kriging surrogate models with an adaptive trust region method","222390634":"Construction of response surfaces based on progressive-lattice-sampling experimental design with application to uncertainty propagation","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","221676250":"Meta-models for Structural Reliability and Uncertainty Quantification","222287247":"Neural-network-based reliability analysis: A comparative study","251516552":"Assessing small failure probabilities by combined subset simulation and Support Vector Machines","261291205":"Assessment of the Efficiency of Kriging Surrogate Models for Structural Reliability Analysis","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","232405698":"Assessment of IACS-CSR implicit safety levels for buckling strength of stiffened panels for double hull tankers","51890126":"Metamodel-based importance sampling for structural reliability analysis","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","223906278":"Application of Kriging method to structural reliability"},"citedIn":{},"index":601}