{"abs":"Base on the integral representations of the solution being derived via Fokas\u0027 transform method, the high-frequency asymptotics for the solution of the Helmholtz equation, in a half-plane and subject to the Neumann condition is discussed. For the case of piecewise constant boundary data, full asymptotic expansions of the solution are obtained by using Watson\u0027s lemma and the method of steepest descents for definite integrals.","title":"High-frequency asymptotics for the helmholtz equation in a half-plane","id":263802948,"url":"https://www.researchgate.net/publication/263802948_High-frequency_asymptotics_for_the_helmholtz_equation_in_a_half-plane","names":["Min-haihuang","Journal of Nonlinear Mathematical Physics"],"references":{"220179294":"A Galerkin Boundary Element Method for High Frequency Scattering By Convex Polygons","41571481":"Boundary integral methods in high frequency scattering","220318692":"High-frequency asymptotics for the numerical solution of the Helmholtz equation","43154932":"The Asymptotic Behavior of the Solution of Boundary Value Problems for the sine-Gordon Equation on a Finite Interval","229812122":"Asymptotic Approximations of Integrals","242980598":"Asymptotically derived boundary elements for the Helmholtz equation in high frequencies","229811935":"Asymptotic Expansion","2119405":"High Frequency Analysis of Helmholtz Equations: Case of Two Point Sources","228853546":"A Galerkin Boundary Element Method for High Frequency Scattering by Convex Polygons","238878451":"Progress and Prospects in the Theory of Linear Wave Propagation","281222739":"Progress and prospects in the theory of linear wave propagation","223661959":"A fast collocation method for acoustic scattering in shallow oceans","243096392":"Is the Pollution Effect of the FEM Avoidable for the Helmholtz Equation Considering High Wave Numbers?","228668502":"A hybrid analytical–numerical method for solving evolution pdes. I. The half-line","265937089":"A Unified Approach to Boundary Value Problems","222413816":"A collocation method for high-frequency scattering by convex polygons","227513653":"Numerical solution of the Helmholtz equation with high wavenumbers","220179429":"A Wavenumber Independent Boundary Element Method for an Acoustic Scattering Problem","222462617":"Finite Element Solution to the Helmholtz Equation with High Wavenumber Part I: the h-Version of the FEM","233350998":"High-frequency uniform asymptotics for the Helmholtz equation in a quarter-plane"},"citedIn":{},"index":604}