{"abs":"Applying the general framework for local zeta regularization proposed in Part I of this series of papers, we renormalize the vacuum expectation value of the stress-energy tensor (and of the total energy) for a scalar field in presence of an external harmonic potential.","title":"Local zeta regularization and the scalar Casimir effect III. The case with a background harmonic potential","id":275974221,"url":"https://www.researchgate.net/publication/275974221_Local_zeta_regularization_and_the_scalar_Casimir_effect_III_The_case_with_a_background_harmonic_potential","names":["Davide Fermi","Livio Pizzocchero","International Journal of Modern Physics A"],"references":{"220026748":"Asymptotics and Special Functions","248054893":"The Use of Integral Transform","226877409":"Vacuum expectation values of the energy-momentum tensor of quantized fields on manifolds of different topology and geometry. IV","243107732":"Über die Entwicklung einer Function von beliebig vielen Variablen nach Laplaceschen Functionen höherer Ordnung","276296510":"Local zeta regularization and the scalar Casimir effect IV. The case of a rectangular box","2055123":"Negative Energy Densities in Quantum Field Theory With a Background Potential","210269765":"Table of Integrals, Series and Products","228725327":"Heat kernel and Analysis on manifolds","236661686":"Quantum vacuum energies and Casimir forces between partially transparent δ -function plates","229811935":"Asymptotic Expansion","231016983":"Quantum Field Theory With External Potentials Concentrated on Planes","51964683":"Local Zeta Regularization and the Casimir Effect","222477553":"Mellin Transforms and Asymptotics: Harmonic Sums","266570320":"Heat kernels for elliptic and sub-elliptic operators. Methods and techniques","13269054":"Casimir effect for soft boundaries","234783338":"NIST Handbook of Mathematical Functions","233387645":"Casimir Effect in the Presence of External Fields","266523092":"Heat kernels and Dirac operators. Paperback ed","275897030":"Local zeta regularization and the scalar Casimir effect I. A general approach based on integral kernels","275974852":"Local zeta regularization and the scalar Casimir effect II. Some explicitly solvable cases","230910265":"Multiple Harmonic Oscillator Zeta Functions","200674029":"Heat Kernels and Spectral Theory"},"citedIn":{"275974852":"Local zeta regularization and the scalar Casimir effect II. Some explicitly solvable cases","276296510":"Local zeta regularization and the scalar Casimir effect IV. The case of a rectangular box"},"index":605}