{"abs":"The question of stability of the vortex Bessel optical beams formed in turbulent atmosphere is theoretically considered. In the given research characteristics of spatial structure of distribution of mean intensity of vortex Bessel optical beams in a randomly inhomogeneous medium (turbulent atmosphere) are in details analyzed. The quantitative criterion of possibility of formation of vortex Bessel optical beams in turbulent atmosphere is derived. On the basis of the analysis of behaviour of several physical parameters of mean intensity of optical radiation it is shown, that stability of the form of a vortex Bessel optical beam during propagation in turbulent atmosphere increases with increase of value of a topological charge of this beam.","title":"Conditions of formation of vortex beams in turbulent atmosphere","id":261297668,"url":"https://www.researchgate.net/publication/261297668_Conditions_of_formation_of_vortex_beams_in_turbulent_atmosphere","names":["I.P. Lukin"],"references":{"257849375":"Phase fluctuations of optical waves in the case of cone focusing in turbulent atmosphere","253377947":"Observation of the experimental propagation properties of Helmholtz-Gauss beams","44852649":"Generation of J0 Bessel Beams with controlled spatial coherence features","51184709":"Measuring the topological charge of optical vortices with an axicon","241212910":"Generation of partially coherent vortex bottle beams","222134259":"Propagation of partially coherent Bessel-Gaussian beams in turbulent atmosphere","252384985":"Hollow beams of electromagnetic radiation: formation and nonlinear propagation in plasma","257849420":"Coherence of a Bessel beam in a turbulent atmosphere","258687863":"Propagation law of partially coherent vortex beam","23686132":"Propagation of Bessel-Gaussian beams with optical vortices in turbulent atmosphere","222665766":"Generation of high-order Bessel beams by use of an axicon","5788029":"Partially coherent conical beams","10700292":"Partially coherent vortex beams with a separable phase","231156384":"Propagation of Gauss–Bessel beams in turbulent atmosphere","225114883":"Intensity fluctuations in J-Bessel–Gaussian beams of all orders propagating in turbulent atmosphere","228893261":"Spatial correlation vortices in partially coherent light: Theory","225810776":"Propagation of higher order Bessel–Gaussian beams in turbulence","229811935":"Asymptotic Expansion","254500292":"Modern optics of Gaussian beams","243577462":"Average characteristics of a partially coherent Bessel–Gauss optical beam","40443419":"Phase singularities and spectral changes of spectrally partially coherent higher-order Bessel-Gauss pulsed beams","255092103":"Principles of Statistical Radio Physics","231137215":"Optical discharge in the field of a Bessel laser beam","225437845":"Bessel-Gaussian beam phase fluctuations in randomly inhomogeneous media","249327904":"Propagation of partially coherent flat-topped vortex beams through non-Kolmogorov atmospheric turbulence"},"citedIn":{},"index":606}