{"abs":"The increasing use of surrogate models has widened the range of application of classical reliability-based design optimization (RBDO) techniques to industrial problems. In this paper, we consider such an approach to the lightweight design of an automotive body structure. Solving this problem while approximating the complex models (nonlinear, noisy and high-dimensional) with a single metamodel would require a very large and non affordable design of experiments (DOE). We thus investigate and propose a methodology of adaptive Kriging based RBDO where an initial DOE is iteratively updated so as to improve the Kriging models only in regions that actually matter. The nested reliability analysis is expressed in terms of quantiles assessment. Two stages of enrichment are performed. The first one seeks to gradually improve the accuracy of the metamodels where the probabilistic constraints are likely to be violated. The second one is embedded in an evolution strategy optimization scheme where, at each iteration, the accuracy of the quantile estimation is improved if necessary. The methodology is applied on an analytical and crashworthiness design problems showing good performance by enhancing accuracy and efficiency with respect to a traditional approach.","title":"Adaptive Kriging reliability-based design optimization of an automotive body structure under crashworthiness constraints","id":282247356,"url":"https://www.researchgate.net/publication/282247356_Adaptive_Kriging_reliability-based_design_optimization_of_an_automotive_body_structure_under_crashworthiness_constraints","names":["Moustapha maliki","Bruno Sudret","Jean-Marc Bourinet","Benoit Guillaume"],"references":{"226529648":"Reliability-based design optimization using kriging surrogates and subset simulation","44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","216301381":"The Design and Analysis Computer Experiments","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","254462034":"A (1+1)-CMA-ES for constrained optimisation","222718989":"A sampling technique enhancing accuracy and efficiency of metamodel-based RBDO: Constraint boundary sampling","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","259518746":"AK-SYS: An adaptation of the AK-MCS method for system reliability","268443151":"PC-Kriging: A new meta-modelling method and its application to quantile estimation"},"citedIn":{},"index":607}