{"abs":"Anonymity is one of the important services that must be available to users in the digital world as long as they behave honestly. Users’ communication must be kept authenticated and anonymous unless malicious behaviors are detected. In this case the accused user’s clear identity must be traced and revealed by the system to solve accusations. Enterprise Digital Rights Management (E-DRM) protects business digital applications by allowing an author in an organization to securely upload his confidential package/file(s) and store the contents in a private way on secure servers. This is done in a way that – later – allows an authorized user who is able to prove his authorization for the package to an authorization authority to download and use these contents in a private way. In this paper, we extend our previously proposed E-DRM protocols and propose an E-DRM protocol that allows authorized users to upload, store and download packages in an efficiently secure, anonymous and authenticated way. On the other hand, in case of an accusation or a dispute, our system is able to trace the user to his clear identity to solve accusations.","title":"Secure Anonymously Authenticated and Traceable Enterprise DRM System","id":282372777,"url":"https://www.researchgate.net/publication/282372777_Secure_Anonymously_Authenticated_and_Traceable_Enterprise_DRM_System","names":["Maged Hamada Ibrahim","International Journal of Computer Applications"],"references":{"221135022":"How DRM-based content delivery systems disrupt expectations of \"personal use\"","221353840":"AONT-RS: Blending Security and Performance in Dispersed Storage Systems.","220803243":"Requirement Analysis of Enterprise DRM Systems.","280552442":"Improving Security and Efficiency of Enterprise Digital Rights Management","262347239":"Electronic Copyright Management Systems: Requirements, Players and Technologies","232647000":"Security architectures for controlled digital information dissemination","2397806":"Tree-based Group Key Agreement","221609215":"Democratic group signatures: on an example of joint ventures.","220725858":"Linkable Democratic Group Signatures","227088517":"Efficient signature generation by smart cards","221590203":"Completeness Theorems for Non-Cryptographic Fault-Tolerant Distributed Computation (Extended Abstract)","4205262":"A robust threshold elliptic curve digital signature providing a new verifiable secret sharing scheme","221010531":"Efficient Proofs of Knowledge of Discrete Logarithms and Representations in Groups with Hidden Order","220425267":"How to Share a Secret","226227370":"How to Leak a Secret","221348003":"A Protocol to Set Up Shared Secret Schemes Without the Assistance of a Mutualy Trusted Party.","2864441":"Optimal Probabilistic Fingerprint Codes","46122408":"Resisting Traitors in Linkable Democratic Group Signatures","220432248":"Rabin, M.O.: Efficient dispersal of information for security, load balancing, and fault tolerance. J. ACM. 36, 335-348","228689533":"Enterprise digital rights management: Solutions against information theft by insiders","4355170":"A practical scheme for non-interactive verifiable secret sharing","221348755":"Foundations of Group Signatures: Formal Definitions, Simplified Requirements, and a Construction Based on General Assumptions","2944335":"Group Signatures: Better Efficiency and New Theoretical Aspects","262257925":"Asymptotic Fingerprinting Capacity in the Combined Digit Model","2496462":"On the Performance of Group Key Agreement Protocols","225171011":"Foundations of Group Signatures: The Case of Dynamic Groups","221344088":"Non-Cryptographic Fault-Tolerant Computing in Constant Number of Rounds of Interaction.","228938763":"Digital rights management—a current review","222668533":"Robust Threshold DSS Signatures","221630535":"Verifiable Threshold Sharing of a Large Secret Safe-Prime.","46093773":"Eliminating Quadratic Slowdown in Two-Prime RSA Function Sharing","228644499":"Digital rights management-An overview of current challenges and solutions","280530763":"Efficient Robust and Secure E-DRM with Encrypted Content Search","239552883":"Error correction of algebraic block codes","280530958":"Secure and Robust Enterprise Digital Rights Management Protocol with Efficient Storage","220334868":"Group Signatures with Efficient Concurrent Join","225722958":"Secure Distributed Key Generation for Discrete-Log Based Cryptosystems","220334105":"Linkable Spontaneous Anonymous Group Signature for Ad Hoc Groups","221355148":"Wallet Databases with Observers."},"citedIn":{},"index":610}