{"abs":"The diffraction of a spherical acoustic wave generated by a point source from impedance slit in a moving fluid is investigated. The diffracted wave is calculated in the far field regime as a sum of fields produced by the edges of the slit and an incident field. The Myers’ impedance conditions are assumed along the edges of the slit. Such conditions are well adopted for the boundaries of the impedance barriers and yield reliable predictions of the diffraction patterns. A Wiener–Hopf technique is invoked to resolve the problem in combinationwith Fourier transform techniques and asymptotic analysis. The appositeness of the results and the effect of pertinent physical parameters on the separated field are presented and analyzed graphically.","title":"Point source diffraction by a slit in a moving fluid","id":263164485,"url":"https://www.researchgate.net/publication/263164485_Point_source_diffraction_by_a_slit_in_a_moving_fluid","names":["Rab Nawaz","Amjad Naeem","M. Ayub","Akmal Javaid","Waves in Random and Complex Media"],"references":{"223266766":"An improved model for noise barriers in a moving fluid","237436807":"Diffraction of electromagnetic plane wave from a PEMC strip","229389293":"Diffraction by a slit in an infinite porous barrier","243014271":"Diffraction of sound waves by a finite barrier in a moving fluid","253254524":"The Diffraction of Waves by Ribbons and by Slits","256203073":"SH waves due to a point source in an inhomogeneous medium","3013353":"Diffraction Characteristics of a Slit in a Thick Conducting Screen","226191230":"An integral equation method for the electromagnetic scattering from a scatterer on an absorbing plane","229269260":"Spherical wave scattering by a rigid screen with a soft edge","246813822":"Methods Based on the Wiener-Hopf Technique","241208745":"A note on spherical electromagnetic wave diffraction by a perfectly conducting strip in a homogeneous Bi-isotropic medium","237196298":"Scattering from a slit in a biisotropic medium","238961493":"A note on cylindrical wave diffraction by a perfectly conducting strip in a homogeneous bi-isotropic medium","229811935":"Asymptotic Expansion","222183088":"Boundary layer techniques for solving the Helmholtz equation in the presence of small inhomogeneities","222800215":"On the acoustic boundary condition in the presence of flow","30045979":"A brief historical perspective of Wiener–Hopf technique","234398730":"Acoustic diffraction by an absorbing semi-infinite half plane in a moving fluid","222365234":"Electromagnetic scattering by small dielectric inhomogeneities","237152218":"Line-source diffraction by a slit in a moving fluid","31115751":"Point-Source Diffraction by an Absorbing Half-Plane","31222850":"Aerodynamic Sound due to a Point Source near a Half-plane"},"citedIn":{},"index":615}