{"abs":"The goal of this paper is to examine the possible extension of the singular perturbation differential equation to the concept of fractional order derivative. To achieve this, we presented a review of the concept of fractional calculus. We make use of the Laplace transform operator to derive exact solution of singular perturbation fractional linear differential equations. We make use of the methodology of three analytical methods to present exact and approximate solution of the singular perturbation fractional, nonlinear, nonhomogeneous differential equation. These methods are including the regular perturbation method, the new development of the variational iteration method, and the homotopy decomposition method.","title":"On the Singular Perturbations for Fractional Differential Equation","id":261222191,"url":"https://www.researchgate.net/publication/261222191_On_the_Singular_Perturbations_for_Fractional_Differential_Equation","names":["Abdon Atangana","The Scientific World Journal"],"references":{"257879452":"Generalized groundwater flow equation using the concept of variable order derivative","245124767":"A nonperturbative analytical solution of immune response with time-delays and possible generalization","237005540":"Advanced Mathematical Methods For Scientists And Engineers","268891008":"Methods and Applications of Singular Perturbations, Boundary Layers and Multiple Timescale Dynamics","221996651":"Fractional sub-equation method and its applications to nonlinear fractional PDEs","36962211":"Asymptotic Expansions: Their Derivation and Interpretation","235410265":"The Fractional Calculus","257162112":"Variational iteration method for the Burgers’ flow with fractional derivatives—new Lagrange Mutipliers","239061612":"Perturbation Methods In Fluid Mechanics","243490326":"Partial Differential Equations of Applied Mathematics, Third Edition","220513266":"The variational iteration method for solving linear and nonlinear systems of PDEs","11847976":"How predation can slow, stop or reverse a prey invasion. Bull Math Biol","259016656":"Perturbation Methods","264922984":"Introduction to Perturbation Methods","216225153":"Theory and Applications of Fractional Differential Equations","258400962":"The Time-Fractional Coupled-Korteweg-de-Vries Equations","265449460":"Homotopy Perturbation Sumudu Transform Method for Nonlinear Equations","229811935":"Asymptotic Expansion","246772891":"Matched Asymptotic Expansions: Ideas and Techniques","260094640":"Analytical Solution of the Groundwater Flow Equation obtained via Homotopy Decomposition Method","257879021":"Solving system of fractional partial differential equations arisen in the model of HIV infection of CD4 cells and attractor one-dimensional Keller-Segel equation","258391827":"A Note on Fractional Order Derivatives and Table of Fractional Derivatives of Some Special Functions","251602313":"The Laplace Adomian Decomposition Method for solving a model for HIV infection of C D 4 + T cells","261173991":"Matching of Asymptotic Expansions of Solutions of Boundary Value Problems","229523286":"“Linear Models of Dissipation Whose Q is Almost Frequency Independent,”","238675587":"Asymptotic Methods in Analysis","267146832":"Topics in ordinary differential equations. A potpourri","258273114":"(G\u0027/G)-Expansion Method for Solving Fractional Partial Differential Equations in the Theory of Mathematical Physics"},"citedIn":{"280622827":"Thermal Sci Exten 0354-983615013D","262301617":"Novel Approach for Dealing with Partial Differential Equations with Mixed Derivatives","283668763":"Numerical simulation of high sensitivity of solutions to the nonlinear singularly perturbed dynamical system on the initial conditions and parameter","277234242":"Positivity and contractivity in the dynamics of clusters’ splitting with derivative of fractional order","270898675":"Exact Solutions of Fragmentation Equations with General Fragmentation Rates and Separable Particles Distribution Kernels","280578401":"Extension of fragmentation process in a kinetic-diffusive-wave system","291205969":"New properties of conformable derivative","285221342":"New properties of conformable derivative"},"index":617}