{"abs":"When a binary fingerprinting codeword is embedded into multimedia content by using a spread-spectrum (SS) watermarking scheme, it is difficult for colluders to perform a symbol-wise attack using their codewords. As discussed in regard to SS fingerprinting schemes, averaging their copies is a cost-effective attack from the signal processing point of view. If the number of colluders is known, an optimal detector can be used against an averaging attack with added white Gaussian noise. The detector first estimates the variance of additive noise, and then calculates correlation scores using a log-likelihood-based approach. However, the number of colluders is not usually known in a real situation. In this paper, we simplify the optimal detector by making statistical approximations and using the characteristics of the parameters for generating codewords. After that, we propose an orthogonal frequency division multiplexing-based SS watermarking scheme to embed the fingerprinting codeword into multimedia content. In a realistic situation, the signal embedded as a fingerprint is in principle attenuated by lossy compression. Because the signal amplitude in a pirated codeword is attenuated, we should adaptively estimate the parameters before calculating the scores. Different from the optimal detector, the simplified detector can easily accommodate changes in signal amplitude by examining the distorted codeword extracted from a pirated copy. We evaluate the performance of the simplified detector through simulation using digital images as well as codewords.","title":"Simplified MAP Detector for Binary Fingerprinting Code Embedded by Spread Spectrum Watermarking Scheme","id":260604334,"url":"https://www.researchgate.net/publication/260604334_Simplified_MAP_Detector_for_Binary_Fingerprinting_Code_Embedded_by_Spread_Spectrum_Watermarking_Scheme","names":["Minoru Kuribayashi","IEEE Transactions on Information Forensics and Security"],"references":{"224622051":"Multi-bit informed embedding watermarking with constant robustness","3318578":"Improved spread spectrum: A new modulation technique for robust watermarking","258649897":"Selective Host-Interference Cancellation: A New Informed Embedding Strategy for Spread Spectrum Watermarking","3321526":"Collusion-Resistant Fingerprinting for Multimedia","260647875":"Coded Spread Spectrum Watermarking Scheme","220722285":"On the Design and Optimization of Tardos Probabilistic Fingerprinting Codes","220990561":"Statistical-Mechanical Approach for Multiple Watermarks Using Spectrum Spreading","3081312":"Maximal Recursive Sequences with 3-Valued Recursive Cross-Correlation Functions","220722230":"Optimization of Tardos’s Fingerprinting Codes in a Viewpoint of Memory Amount","2864441":"Optimal Probabilistic Fingerprint Codes","26532294":"Group-Oriented Fingerprinting for Multimedia Forensics","7852835":"Forensic analysis of nonlinear collusion attacks for multimedia fingerprinting","3318566":"Anti-Collusion Fingerprinting for Multimedia","220722290":"Tardos’s Fingerprinting Code over AWGN Channel","225348345":"Regular Simplex Fingerprints and Their Optimality Properties","3079606":"Collusion-secure fingerprinting for digital data","225366004":"An improvement of discrete Tardos fingerprinting codes","45340968":"EM Decoding of Tardos Traitor Tracing Codes","220780339":"High rate fingerprinting codes and the fingerprinting capacity","225127798":"Improved Boneh-Shaw Content Fingerprinting","45340972":"Estimating the Minimal Length of Tardos Code","224258556":"On the Saddle-Point Solution and the Large-Coalition Asymptotics of Fingerprinting Games","5567414":"Secure spread spectrum watermarking for multimedia","221995544":"Bishop, C.M.: Pattern Recognition and Machine Learning. Springer","241638980":"Toward Practical Joint Decoding of Binary Tardos Fingerprinting Codes","220784844":"A New Soft Decision Tracing Algorithm for Binary Fingerprinting Codes","3455248":"Joint Coding and Embedding Techniques for Multimedia Fingerprinting","224557957":"Regular Simplex Fingerprints and Their Optimality Properties","224191028":"Linear Universal Decoding for Compound Channels","260647782":"Analysis of binary fingerprinting codes under relaxed marking assumption","235360744":"Discrete Distributions in the Tardos Scheme, Revisited","247407439":"Review paper: Collusion resistant fingerprinting for multimedia","224246316":"Group testing meets traitor tracing","4087687":"Efficient informed embedding of multi-bit watermark","260647797":"A Simple Tracing Algorithm for Binary Fingerprinting Code under Averaging Attack","220437661":"Hierarchical Spread Spectrum Fingerprinting Scheme Based on the CDMA Technique","260299580":"Impacts of Watermarking Security on Tardos-Based Fingerprinting"},"citedIn":{"273900354":"MEO based secured, robust, high capacity and perceptual quality image watermarking in DWT-SVD domain"},"index":620}