{"abs":"Most existing proposals for access control over outsourced data mainly aim at guaranteeing that the data are only accessible to authorized requestors who have the access credentials. This paper proposes TRLAC, an a posteriori approach for tracing and revoking leaked credentials, to complement existing a priori solutions. The tracing procedure of TRLAC can trace, in a black-box manner, at least one traitor who illegally distributed a credential, without any help from the cloud service provider. Once the dishonest users have been found, a revocation mechanism can be called to deprive them of access rights. We formally prove the security of TRLAC, and empirically shows that the introduction of the tracing feature incurs little costs to outsourcing.","title":"Tracing and Revoking Leaked Credentials Accountability in Leaking Sensitive Outsourced Data","id":263163834,"url":"https://www.researchgate.net/publication/263163834_Tracing_and_Revoking_Leaked_Credentials_Accountability_in_Leaking_Sensitive_Outsourced_Data","names":["Hua Deng","Qianhong Wu","bo bo Qin","Sherman S. M. Chow","Josep Domingo-Ferrer","Wenchang Shi"],"references":{"261239826":"How to Track Your Data: Rule-Based Data Provenance Tracing Algorithms","221355056":"Deterministic and Efficiently Searchable Encryption.","220334752":"Efficient and Provably Secure Trapdoor-Free Group Signature Schemes from Bilinear Pairings","221355443":"Dual System Encryption: Realizing Fully Secure IBE and HIBE under Simple Assumptions","266656608":"Maple: scalable multi-dimensional range search over encrypted cloud data with tree-based index","265816413":"All-but-One Dual Projective Hashing and Its Applications","261207383":"Tracking of Data Leaving the Cloud","254031727":"CALMS: Cloud-assisted live media streaming for globalized demands with time/region diversities","220798629":"Conditional Proxy Broadcast Re-Encryption","2864441":"Optimal Probabilistic Fingerprint Codes","221651951":"Identity-Based Proxy Re-encryption","260299673":"CAM: Cloud-Assisted Privacy Preserving Mobile Health Monitoring","225366004":"An improvement of discrete Tardos fingerprinting codes","239560731":"Guide to Integrating Forensic Techniques into Incident Response","220335935":"Privacy-Preserving Public Auditing for Secure Cloud Storage","221609642":"Building efficient fully collusion-resilient traitor tracing and revocation schemes","262305149":"Ciphertext-policy hierarchical attribute-based encryption with short ciphertexts","266654587":"Blackbox traceable CP-ABE: How to catch people leaking their keys by selling decryption devices on eBay","221608919":"Provable Data Possession at Untrusted Stores","257548733":"Simultaneous authentication and secrecy in identity-based data upload to cloud","221460118":"Privacy-Preserving Query over Encrypted Graph-Structured Data in Cloud Computing","221609491":"A fully collusion resistant broadcast, trace, and revoke system","260710957":"Key-Aggregate Cryptosystem for Scalable Data Sharing in Cloud Storage","221327001":"Identity-Based Broadcast Encryption with Constant Size Ciphertexts and Private Keys","3297946":"Efficient Remote Data Possession Checking in Critical Information Infrastructures","260358189":"Scalable and Secure Sharing of Personal Health Records in Cloud Computing Using Attribute-Based Encryption","262242376":"Attribute-based fine-grained access control with efficient revocation in cloud storage systems","260299625":"White-Box Traceable Ciphertext-Policy Attribute-Based Encryption Supporting Any Monotone Access Structures","225225536":"Fully Collusion Resistant Traitor Tracing with Short Ciphertexts and Private Keys","220333324":"Building Efficient Fully Collusion-Resilient Traitor Tracing and Revocation Schemes.","261227133":"Toward Privacy-Assured Cloud Data Services with Flexible Search Functionalities","225575005":"Efficient Forward and Provably Secure ID-Based Signcryption Scheme with Public Verifiability and Public Ciphertext Authenticity","260526248":"Cloud-Assisted Mobile-Access of Health Data With Privacy and Auditability","221348480":"Divertible Protocols and Atomic Proxy Cryptography","221273089":"Securing Personal Health Records in Cloud Computing: Patient-Centric and Fine-Grained Data Access Control in Multi-owner Settings","225671744":"Identity-Based Encryption from the Weil Pairing","220335126":"Public-Key Encryption with Fuzzy Keyword Search: A Provably Secure Scheme under Keyword Guessing Attack","221351303":"Dynamic Secure Cloud Storage with Provenance","221609421":"Traitor Tracing with Constant Size Ciphertext","221609804":"Improving Privacy and Security in Multi-authority Attribute-based Encryption","236340397":"Towards Secure Multi-Keyword Top-k Retrieval over Encrypted Cloud Data","220905239":"Identity-Based Proxy Re-encryption Without Random Oracles","261465064":"Storing Shared Data on the Cloud via Security-Mediator","241770455":"On the impact of virtualization on Dropbox-like cloud file storage/synchronization services","260358330":"Privacy Preserving Back-Propagation Neural Network Learning Made Practical with Cloud Computing","224209314":"Implementing digital signature with RSA encryption algorithm to enhance the Data Security of cloud in Cloud Computing"},"citedIn":{"284562964":"IPad: ID-based public auditing for the outsourced data in the standard model","289625399":"Securely Outsourcing Exponentiations with Single Untrusted Program for Cloud Storage"},"index":622}