{"abs":"In recent years, the cross-entropy method has been successfully applied to a wide range of discrete optimization tasks. In this paper we consider the cross-entropy method in the context of continuous optimization. We demonstrate the effectiveness of the cross-entropy method for solving difficult continuous multi-extremal optimization problems, including those with non-linear constraints.","title":"The Cross-Entropy Method for Continuous Multi-Extremal Optimization","id":225551595,"url":"https://www.researchgate.net/publication/225551595_The_Cross-Entropy_Method_for_Continuous_Multi-Extremal_Optimization","names":["Dirk P. Kroese","Sergey Porotsky","Reuven Y. Rubinstein","Methodology And Computing In Applied Probability"],"references":{"222461568":"Optimization of computer simulation models with rare events. Eur J Oper Res","222438048":"SWIFT—a new constrained optimization technique","235024388":"Selected Application in Nonlinear Programming","5589170":"Ant System: Optimization by a colony of cooperating agents. IEEE Trans Syst Man Cybernetics - Part B","236177850":"Non-Linear Regression Analysis and Its Applications","224669902":"Stochastic comparison algorithm for discrete optimization with estimation","236177853":"Applied Nonlinear Programming","2484042":"The Cross-Entropy Method for Combinatorial and Continuous Optimization","4111758":"Global likelihood optimization via the cross-entropy method with an application to mixture models","201975931":"Simulated Annealing and Boltzmann Machines: A Stochastic Approach to Combinatorial Optimization and Neural Computing","226218344":"A Tutorial on the Cross-Entropy Method","220695059":"Genetic Algorithm+Data Structures\u003dEvolution Programs","30873058":"Genetic + Data Structures \u003d Evolution Programs","222469785":"Scheuer, T.: Threshold accepting: A general purpose optimization algorithm appearing superior to simulated annealing. IBM Technical report 88.10.011, J. Comput. Phys. 90, 161-175","220462013":"On the Convergence of the Cross-Entropy Method","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"251709442":"New Global Optimization Algorithms and Implementations for Model-Based Clustering","220963885":"A Cross-Entropy Method for Value-at-Risk Constrained Optimization.","251998733":"Availability growth modeling and assessment","261353883":"A cost-aware path planning algorithm for mobile robots","254062124":"Multiobjective Optimization of Inverse Problems Using a Vector Cross Entropy Method","50996224":"Handbook of Monte Carlo Methods","221079334":"Improving the GRLVQ Algorithm by the Cross Entropy Method.","270888238":"Inverting Laguerre Tessellations","265196480":"The Cross-Entropy Method Applied to SameGame","228945333":"Global Convergence of Model Reference Adaptive Search for Gaussian Mixtures","251998487":"Advanced models for software reliability prediction","225448291":"A Projection-Adapted Cross Entropy (PACE) method for transmission network planning","262221493":"Probabilistic Stochastic Diffusion Search","228852657":"Calculating the Band Structure of Photonic Crystals Through the Meshless Local Petrov-Galerkin (MLPG) Method and Periodic Shape Functions","256822619":"Application of global optimization methods to model and feature selection","262993590":"ALiCCE: Atomic Lines Calibration using the Cross-Entropy Algorithm","45907617":"Fitting Isochrones to Open Cluster photometric data: A new global optimization tool","282717945":"The cross-entropy method and its application to minimize the ripple of magnetic levitation forces of a maglev system","225463892":"Discontinuous penalty approach with deviation integral for global constrained minimization","231114210":"Modeling Very Long Baseline Interferometric Images with the Cross-entropy Global Optimization Technique","220409349":"An Approach to Locate Parametric Faults in Nonlinear Analog Circuits","252392236":"Optimal Frame Pursuit for Pattern Classification","43478201":"Optimal epidemic intervention of HIV spread using the cross-entropy method","224157293":"The Cross-Entropy Method and Its Application to Inverse Problems","241189459":"Police Patrol service optimization based on the spatial pattern of hotspots","230881265":"Continuous Trait-Based Particle Swarm Optimisation (CTB-PSO)","280019336":"Simulation optimization: a review of algorithms and applications","254061855":"An Improved Cross-Entropy Method Applied to Inverse Problems","273872494":"A Hybrid With Cross-Entropy Method and Sequential Quadratic Programming to Solve Economic Load Dispatch Problem","242605876":"vergelijkbaar met de lopende banden voor de kassa\u0027s in een supermarkt. In deze buer staan de producten in de rij totdat ze door de machine bewerkt kunnen worden","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","224585254":"Accurate Estimation of ICA Weight Matrix by Implicit Constraint Imposition Using Lie Group","277129667":"Randomized Search Methods for Solving Markov Decision Processes and Global Optimization","246844902":"Model Reference Adaptive Search: A New Approach to Global Optimization","277104597":"Global Optimization of Finite Mixture Models","221605222":"A Cross-Entropy Method that Optimizes Partially Decomposable Problems: A New Way to Interpret NMR Spectra.","257665539":"Response improvement in complex experiments by co-information composite likelihood optimization","23441725":"Efficacy of Weekly Docetaxel and Bevacizumab in Mesenchymal Chondrosarcoma: A New Theranostic Method Combining Xenografted Biopsies with a Mathematical Model","254039164":"A study on pitch variation on the use of DWT with SVM for speaker independent phoneme recognition","224061444":"Applying Model Reference Adaptive Search to American-Style Option Pricing","228945349":"Global Solutions to Model-Based Clustering","220461888":"Predetermined intervals for start times of activities in the stochastic project scheduling problem","235913066":"Fitting the three-parameter Weibull distribution with Cross Entropy","273393198":"Dispatch Strategy of PHEVs to Mitigate Selected Patterns of Seasonally Varying Outputs From Renewable Generation","283287429":"CALIBRATION OF MICROSCOPIC TRAFFIC MODEL: CROSS-ENTROPY METHOD AND PROBABILISTIC SENSITIVITY ANALYSIS","264773049":"Why the Monte Carlo method is so important today","229426649":"Personalising docetaxel and G-CSF schedules in cancer patients by a clinically validated computational model","265169072":"Cross entropy for multiobjective combinatorial optimization problems with linear relaxations","228940071":"Cross-Entropy Method","225328104":"Uncertainty estimation of reliability redundancy in complex systems based on the Cross-Entropy method","260641806":"Experimental investigation of spin-orbit coupling in n-type PbTe quantum wells","222552268":"Application of the cross entropy method to the GLVQ algorithm","277579268":"The robust constant and its applications in random global search for unconstrained global optimization","224242377":"Sparse Antenna Array Optimization With the Cross-Entropy Method","262262837":"Self-Organizing Map Based Adaptive Sampling","268407914":"Range-based non-orthogonal ICA using cross-entropy method","224096206":"Development of Kernel Fisher Discriminant Model Using The Cross-Entropy Method","224209094":"A new population-based simulated annealing algorithm","225719510":"Setting gates for activities in the stochastic project scheduling problem through the cross entropy methodology","257588721":"Sequential Monte Carlo simulated annealing","280772880":"Fitting Laguerre tessellation approximations to tomographic image data","264962149":"Parameter Estimation for ODEs Using a Cross-Entropy Approach","279242256":"Chapter 3. The Cross-Entropy Method for Optimization","227694117":"Monte Carlo methods","277180221":"Particle Filtering for Stochastic Control and Global Optimization","227646505":"Cross-entropy optimizer: A new tool to study precession in astrophysical jets","254098844":"Cross-entropy motion planning","46479740":"On maximum likelihood estimation of a Pareto mixture","232063081":"Parsec-scale jet precession in BL Lacertae (2200+420)","221534601":"Stochastic orthogonal and nonorthogonal subspace basis pursuit","30514453":"Modélisation des comportements extrêmes en ingénierie","273618056":"On the benefits of Laplace samples in solving a rare event problem using cross-entropy method","239440265":"Study on Inventory Control under Stochastic Disruptions","41510571":"Stochastic inversion of ocean color data using the cross-entropy method","273304476":"A Cross-Entropy Scheme for Mixtures","232062731":"A Stochastic Optimization Method for Partially Decomposable Problems, with Applications to Analysis of NMR Spectra","275365257":"Vector Design Optimizations Using an Improved Cross-Entropy Method","221344468":"Cross-Entropy Randomized Motion Planning.","224231352":"Robust Optimization Using a Methodology Based on Cross Entropy Methods","262997832":"Proper motions of the optically visible open clusters based on the UCAC4 catalog","274261949":"Quantum interference measurement of spin interactions in a bio-organic/semiconductor device structure","286265077":"A cross-entropy method and probabilistic sensitivity analysis framework for calibrating microscopic traffic models","2209222":"Bias-Variance Techniques for Monte Carlo Optimization: Cross-validation for the CE Method","259585695":"Parameter estimation and optimal scheduling algorithm for a mathematical model of intermittent androgen suppression therapy for prostate cancer","47627071":"The assembly modes of rigid 11-bar linkages","260992103":"Particle Filtering Framework for a Class of Randomized Optimization Algorithms","283337738":"Performance comparison of three meta-heuristic algorithms for solving a green supply chain planning problem","275647620":"Distributed Black-Box Optimization of Nonconvex Functions","224159159":"An optimized isoscallop height cutting paths planning method based on cross-entropy optimization algorithm","224123831":"Optimal generation expansion planning via the Cross-Entropy method","5404604":"Controling the number of HIV infectives in a mobile population","261439611":"Kinematic study of the parsec-scale jet of the quasar PKS 1741--03","221539780":"Optimal Sample Selection for Batch-mode Reinforcement Learning.","273788832":"Energy Sharing for Multiple Sensor Nodes With Finite Buffers","238271942":"Model-Based Randomized Methods for Global Optimization","46494000":"New global optimization algorithms for model-based clustering","261025147":"Remaining useful life estimation for systems with non-trendability behaviour","257605804":"A Level-Value Estimation Method and Stochastic Implementation for Global Optimization","220244184":"A Model Reference Adaptive Search Method for Global Optimization","51636200":"Control of Kaposi\u0027s Sarcoma-Associated Herpesvirus Reactivation Induced by Multiple Signals","220552922":"Rapid pedestrian detection in unseen scenes"},"index":627}