{"abs":"Decoupling capacitor (decap) has been widely used to effectively reduce dynamic power supply noise. Traditional decap budgeting algorithms usually explore the sensitivity-based nonlinear optimizations or conjugate gradient (CG) methods, which can be prohibitively expensive for large-scale decap bud- geting problems and cannot be easily parallelized. In this paper, we propose a hierarchical cross-entropy based optimization tech- nique which is more efficient and parallel-friendly. Cross-entropy (CE) is an advanced optimization framework which explores the power of rare event probability theory and importance sampling. To achieve the high efficiency, a sensitivity-guided cross-entropy (SCE) algorithm is introduced which integrates CE with a partitioning-based sampling strategy to effectively reduce the solution space in solving the large-scale decap budgeting problems. Compared to improved CG method and conventional CE method, SCE with Latin hypercube sampling method (SCE- LHS) can provide 2× speedups, while achieving up to 25% improvement on power supply noise. To further improve decap optimization solution quality, SCE with sequential importance sampling (SCE-SIS) method is also studied and implemented. Compared to SCE-LHS, in similar runtime, SCE-SIS can lead to 16.8% further reduction on the total power supply noise. Index Terms—Adjoint sensitivity analysis, cross-entropy op- timization, decoupling capacitor budgeting, power grid design, power supply noise.","title":"Hierarchical Cross-Entropy Optimization for Fast On-Chip Decap Budgeting","id":220399354,"url":"https://www.researchgate.net/publication/220399354_Hierarchical_Cross-Entropy_Optimization_for_Fast_On-Chip_Decap_Budgeting","names":["Xueqian Zhao","Yonghe Guo","Xiaodao Chen","Zhuo Feng","Shiyan Hu","IEEE Transactions on Computer-Aided Design of Integrated Circuits and Systems"],"references":{"221627284":"Sequential importance sampling for low-probability and high-dimensional SRAM yield analysis","3225683":"Power grid analysis using random walks","225469492":"An Efficient Algorithm for Rare-event Probability Estimation, Combinatorial Optimization, and Counting","225194729":"Solving the Vehicle Routing Problem with Stochastic Demands using the Cross-Entropy Method","3904509":"Efficient large-scale power grid analysis based on preconditioned Krylov-subspace iterative methods","221062187":"A fast on-chip decoupling capacitance budgeting algorithm using macromodeling and linear programming","3224662":"On-chip power-supply network optimization using multigrid-based technique","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","221626021":"Multigrid on GPU: Tackling Power Grid Analysis on parallel SIMT platforms","226218344":"A Tutorial on the Cross-Entropy Method","43477380":"Application of the cross-entropy method to clustering and vector quantization","3224964":"Optimal decoupling capacitor sizing and placement for standard-cell layout designs","3318218":"A Tutorial on Particle Filters for Online Nonlinear/Non-Gaussian Bayesian Tracking","2833584":"A Tutorial on the Cross-Entropy Method","2831159":"Optimal Decoupling Capacitor Sizing and Placement for Standard Cell Layout Designs","3225932":"Partitioning-Based Approach to Fast On-Chip Decoupling Capacitor Budgeting and Minimization","221060208":"Parallel hierarchical cross entropy optimization for on-chip decap budgeting","242671659":"Electronic circuit and system simulation methods. McGraw-Hill","221060528":"Parallel multigrid preconditioning on graphics processing units (GPUs) for robust power grid analysis","220399965":"Power grid analysis using random walks."},"citedIn":{"273618056":"On the benefits of Laplace samples in solving a rare event problem using cross-entropy method","276519650":"Distributed Generation Placement for Power Distribution Networks"},"index":630}