{"abs":"Computer simulators are used in science and technology to model physical processes or the behavior of real-world systems. Sensitivity analysis provides a useful tool for quantifying the impact of uncertainty in the computer simulator inputs on the computed output. We focus on global sensitivity analysis, which quantifies output uncertainty as all the inputs vary continuously over the input space. The influence of each input and how uncertainty in the output is apportioned among the inputs are determined by calculating the main effects and sensitivity indices of the computer simulator inputs. Typically, these quantities are computed using Monte Carlo methods, which require a large number of computer simulator runs, making the calculations infeasible if the simulator is computationally expensive. Bayesian methods have been used to tackle sensitivity analysis of computationally expensive simulators through building a statistical emulator for the computer simulator output, typically, based on a Gaussian process prior for the simulator output function. In this work, we develop an approach for integrating global sensitivity analysis tools and extending semi-Bayesian approaches to a fully Bayesian methodology. The approach is used to carry out sensitivity analysis of the Leaf–Canopy Model, a radiative transfer model that simulates the interaction of sunlight with vegetation. Matlab codes are available online as supplementary material to this article.","title":"Bayesian Inference for Sensitivity Analysis of Computer Simulators, With an Application to Radiative Transfer Models","id":262583041,"url":"https://www.researchgate.net/publication/262583041_Bayesian_Inference_for_Sensitivity_Analysis_of_Computer_Simulators_With_an_Application_to_Radiative_Transfer_Models","names":["Marian Farah","Athanasios Kottas","Technometrics"],"references":{"4742154":"Bayes Linear Calibrated Prediction for Complex Systems","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","5207179":"Bayesian inference for the uncertainty distribution of computer model outputs. Biometrika","4772045":"Bayesian Calibration of Computer Models","42606210":"Decision-Theoretic Sensitivity Analysis for Complex Computer Models","241216681":"Bayesian Guided Pattern Search for Robust Local Optimization","239667584":"A Framework for Validation of Computer Models","222890627":"Combining vegetation index and model inversion methods for the extraction of key vegetation biophysical parameters using Terra and Aqua MODIS reflectance data","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","222506575":"LEAFMOD: a new within-leaf radiative trensfer model","224352142":"A Statistical Framework for the Sensitivity Analysis of Radiative Transfer Models","4744220":"Bayesian Forecasting for Complex Systems Using Computer Simulators","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","1757837":"Importance Tempering","234372399":"Knowledge Discovery in Aerodynamic Design Space for Flyback-Booster Wing Using Data Mining","223292691":"GUI–HDMR – A software tool for global sensitivity analysis of complex models","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","245078917":"Importance Measures in Global Sensitivity Analysis of Nonlinear Models","2845044":"Probabilistic Sensitivity Analysis of Complex","239666344":"Regression and Classification Using Gaussian Process Priors","216301381":"The Design and Analysis Computer Experiments","238376732":"LCM2","228780489":"Predicting Vehicle Crashworthiness: Validation of Computer Models for Functional and Hierarchical Data","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","46586550":"Gaussian Process Single-Index Models as Emulators for Computer Experiments","222402096":"Making best use of model evaluations to compute sensitivity indices. Comput Phys Commun","46515760":"Categorical Inputs, Sensitivity Analysis, Optimization and Importance Tempering with tgp Version 2, an R Package for Treed Gaussian Process Models","238259464":"LEAFMOD","222427005":"Calculations of Sobol indices for the Gaussian process metamodel","228528739":"Prediction for Computer Experiments Having Quantitative and Qualitative Input Variables"},"citedIn":{"269998671":"Bayesian Emulation and Calibration of a Dynamic Epidemic Model for A/H1N1 Influenza"},"index":649}