{"abs":"This paper deals with the use of the Koetter-Vardy soft-decision decoding algorithm to perform identification of guilty users in traitor tracing and fingerprinting schemes. In these schemes, each user is assigned a copy of an object with an embedded codeword. Placing different codewords in different copies makes each copy unique and at the same time allows unique identification of each user. The weakness of these schemes comes in the form of a collusion attack, where a group of dishonest users get together and, by comparing their copies, they create a pirate copy that tries to hide their identities. The concern of the paper is restricted to traitor tracing and fingerprinting schemes based on Reed-Solomon codes. By using the Koetter-Vardy soft-decision decoding algorithm as the core part of the tracing process, three different settings are approached: tracing in traceability codes, tracing in identifiable parent property codes and tracing in binary concatenated fingerprinting codes. It is also discussed how by a careful setting of a reliability matrix all possibly identifiable users can be found.","title":"Identifying Traitors Using the Koetter–Vardy Algorithm","id":224213225,"url":"https://www.researchgate.net/publication/224213225_Identifying_Traitors_Using_the_Koetter-Vardy_Algorithm","names":["Marcel Fernandez","Jose Moreira","Miguel Soriano","IEEE Transactions on Information Theory"],"references":{"221996154":"Probability Inequalities For Sums of Bounded Random Variables","220337248":"Efficient Traitor Tracing Algorithms using List Decoding.","3080362":"Combinatorial properties of frameproof and traceability codes","2995754":"The theory of error-correcting codes","259860916":"Polynomial Codes Over Certain Finite Fields","222448392":"Decoding Reed Solomon Codes beyond the Error-Correction Bound","3862186":"Algebraic soft-decision decoding of Reed-Solomon codes","3785000":"Improved decoding of Reed-Solomon and algebraic-geometric codes","2864441":"Optimal Probabilistic Fingerprint Codes","2997945":"Data-Hiding Codes","224174409":"A Family of Asymptotically Good Binary Fingerprinting Codes","224157892":"Two-level Fingerprinting: Stronger Definitions and Code Constructions","3079606":"Collusion-secure fingerprinting for digital data","3084727":"Applications of list decoding to tracing traitors","37595684":"List Decoding for Noisy Channels","226762264":"Efficient Traitor Tracing Algorithms Using List Decoding","222076897":"On Codes with the Identifiable Parent Property","37989212":"List decoding of error-correcting codes","3080073":"Tracing Traitors","3079881":"Improved Decoding of Reed-Solomon and Algebraic-Geometry Codes","3084674":"Information-theoretic analysis of information hiding","3078976":"Bounded distance+1 soft-decision Reed-Solomon decoding","3084895":"Algebraic Soft-Decision Decoding of Reed-Solomon Codes","221355139":"Collusion-Secure Fingerprinting for Digital Data (Extended Abstract).","3319041":"Identification of Traitors in Algebraic-Geometric Traceability Codes","221609344":"Collusion Secure q-ary Fingerprinting for Perceptual Content","3502797":"The fingerprinted database","220680412":"Applications of list decoding to tracing traitors.","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","228057769":"Probability Inequalities for Sums of Bounded Random Variables","248141876":"Tracing traitors Advances in Cryptology-CRYPTO\u0027\u002794"},"citedIn":{},"index":657}