{"abs":"We introduce the concept of reliability in watermarking as the ability of assessing that a probability of false alarm is very low and below a given significance level. We propose an iterative and self-adapting algorithm which estimates very low probabilities of error. It performs much quicker and more accurately than a classical Monte Carlo estimator. The article finishes with applications to zero-bit watermarking (probability of false alarm, error exponent), and to probabilistic fingerprinting codes (probability of wrongly accusing a given user, code length estimation).","title":"Experimental Assessment of the Reliability for Watermarking and Fingerprinting Schemes","id":234832204,"url":"https://www.researchgate.net/publication/234832204_Experimental_Assessment_of_the_Reliability_for_Watermarking_and_Fingerprinting_Schemes","names":["Teddy Furon","Arnaud Guyader","EURASIP Journal on Information Security"],"references":{"3970332":"JANIS: Just Another N-order side-Informed watermarking Scheme","242328432":"RESTART: A method for accelerating rare event simulations","3318576":"Performance analysis of existing and new methods for data hiding with known-host information in additive channels","2371745":"Modelling the False Alarm and Missed Detection Rate for Electronic Watermarks","220678956":"Tardos Fingerprinting is Better Than We Thought","221420633":"An Improvement of Tardos’s Collusion-Secure Fingerprinting Codes with Very Short Lengths","220722123":"Computing the Probability of False Watermark Detection","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","230238615":"Testing for Normality","26532325":"Optimal Detector for Multiplicative Watermarks Embedded in the DFT Domain of Non-White Signals","2864441":"Optimal Probabilistic Fingerprint Codes","220485840":"Optimal probabilistic fingerprinting codes using optimal finite random variables related to numerical quadrature","220638736":"Symmetric Tardos fingerprinting codes for arbitrary alphabet sizes","3086649":"Optimal Watermark Embedding and Detection Strategies Under Limited Detection Resources","224678908":"Optimal Watermark Embedding and Detection Strategies Under Limited Detection Resources","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors"},"citedIn":{"243184700":"H.264/AVC video watermarking for active fingerprinting based on Tardos code","221210715":"Expectation Maximisation decoding of Tardos probabilistic fingerprinting code","24165813":"Worst case attacks against binary probabilistic traitor tracing codes","50894943":"Towards Joint Tardos Decoding: The \u0027Don Quixote\u0027 Algorithm","281597600":"Tardos codes for real","45340970":"Le traçage de traîtres","29601545":"Rare event simulation for a static distribution","224200871":"Spread Spectrum-Based Watermarking for Tardos Code-Based Fingerprinting for H.264/AVC Video","50894934":"Iterative single Tardos decoder with controlled probability of false positive","45340972":"Estimating the Minimal Length of Tardos Code"},"index":662}