{"abs":"Digital fingerprinting is a technique for identifying unauthorized copy and tracing back to its user. The distributor marks each individual copy with a unique fingerprint. The present fingerprinting schemes generally have many difficulties and disadvantages in the case of large-size users. In this paper, we present a new fingerprint scheme which can be used in confidential departments where there are a limited number of users. This scheme is composed of an outer RS (Reed-Solomon) code and an inner code based on BIBD (balanced incomplete block design) code and orthogonal code. We first construct inner code matrix based on BIBD block and orthogonal code. Since the BIBD code just has good performance in resisting linear collusion attacks, we expand the inner code to improve inner code\u0027s ability of resisting nonlinear collusion attacks. In reality, the probabilities of participation in collusion in different combinations of users vary. So we group inner codeword into subsets and distribute each subset to a group of users. The code scheme turns into a type of grouporiented fingerprint which is favorable to trace colluders and to avoid involving innocent users. Then we take the inner codeword as the RS code\u0027s symbols and make the outer code satisfy the request of resisting collusion attacks. In the end, by concatenating inner and outer code, we get the final fingerprint. The performance of the algorithms is proved and analyzed by theory. Compared with traditional codes for digital fingerprint, under the same collusion size and error probability, our scheme shortens digital fingerprint length significantly, and test experiments confirm the code\u0027s ability of resisting collusion attacks.","title":"Group-oriented and Collusion Secure Fingerprint for Digital Images","id":220405719,"url":"https://www.researchgate.net/publication/220405719_Group-oriented_and_Collusion_Secure_Fingerprint_for_Digital_Images","names":["Yongsheng Yu","Zhihua Wei","Xiaosu Chen","Zhiguang Zhang","Journal of Computers"],"references":{"3157745":"Bit-Level Soft-Decision Decoding of Reed-Solomon Codes","5567414":"Secure spread spectrum watermarking for multimedia","220050334":"Combining digital Watermarks and collusion secure Fingerprints for digital Images","3421521":"Collusion-secure and cost-effective detection of unlawful multimedia redistribution","225179426":"A 2-Secure Code with Efficient Tracing Algorithm","221420633":"An Improvement of Tardos’s Collusion-Secure Fingerprinting Codes with Very Short Lengths","3084895":"Algebraic Soft-Decision Decoding of Reed-Solomon Codes","7771303":"Anti-collusion forensics of multimedia fingerprinting using orthogonal modulation","2611541":"Resistance of Digital Watermarks to Collusive Attacks","2864441":"Optimal Probabilistic Fingerprint Codes","221630247":"Simple Collusion-Secure Fingerprinting Schemes for Images.","3318566":"Anti-Collusion Fingerprinting for Multimedia","3079606":"Collusion-secure fingerprinting for digital data","2631059":"Efficient Watermark Detection and Collusion Security","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","220681180":"Combinatorial properties of frameproof and traceability codes.","4166916":"Collusion-resistant fingerprints from WBE sequence sets","221548655":"A Robust Image Watermarking using Two Level DCT and Wavelet Packets Denoising"},"citedIn":{"272762498":"A High-precision Duplicate Image Deduplication Approach","261038119":"A scheme of betrayal checking and traitor tracing for confidential image in Internet"},"index":663}