{"abs":"In recent years, with the rapid growth of the Internet as well as the increasing demand for broadband services, live pay-television broadcasting via the Internet has become a promising business. To get this implemented, it is necessary to protect distributed contents from illegal copying and redistributing after they are accessed. Fingerprinting system is a useful tool for it. This paper shows that the anti-collusion code has advantages over other existing fingerprinting codes in terms of efficiency and effectivity for live pay-television broadcasting. Next, this paper presents how to achieve efficient and effective anti-collusion codes based on unital and affine plane, which are two known examples of balanced incomplete block design (BIBD). Meanwhile, performance evaluations of anti-collusion codes generated from unital and affine plane are conducted. Their practical explicit constructions are given last.","title":"Fingerprinting Codes for Internet-Based Live Pay-TV System Using Balanced Incomplete Block Designs","id":220240182,"url":"https://www.researchgate.net/publication/220240182_Fingerprinting_Codes_for_Internet-Based_Live_Pay-TV_System_Using_Balanced_Incomplete_Block_Designs","names":["Shuhui Hou","Tetsutaro Uehara","Takashi Satoh","Yoshitaka Morimura","Michihiko Minoh","IEICE Transactions on Information and Systems"],"references":{"4051516":"High-rate LDPC codes from unital designs","222669638":"Secure frameproof codes, key distribution patterns, group testing algorithms and related structures","3080362":"Combinatorial properties of frameproof and traceability codes","250856634":"Fingerprinting and the Marking Assumption","3291640":"Projective geometry LDPC codes for ultralong-haul WDM high-speed transmission","220205418":"Integrating fingerprint with cryptosystem for internet-based live pay-TV system","4308748":"Collusion Secure Scalable Video Fingerprinting Scheme","225128954":"Performance Study on Multimedia Fingerprinting Employing Traceability Codes","7771303":"Anti-collusion forensics of multimedia fingerprinting using orthogonal modulation","2864441":"Optimal Probabilistic Fingerprint Codes","3318566":"Anti-Collusion Fingerprinting for Multimedia","221420775":"A Short Random Fingerprinting Code Against a Small Number of Pirates","257253376":"Some Applications of Magma in Designs and Codes: Oval Designs, Hermitian Unitals and Generalized Reed–Muller Codes","3079606":"Collusion-secure fingerprinting for digital data","220722235":"Error- and Collusion-Secure Fingerprinting for Digital Data","221193585":"Efficient Collision-Resilient RFID Tag Identification using Balanced Incomplete Block Design Code","220239048":"New Digital Fingerprint Code Construction Scheme Using Group-Divisible Design","221236894":"A Robust Anti-collusion Coding in Digital Fingerprinting System","224616663":"Averaging attack resilient video fingerprinting","221609344":"Collusion Secure q-ary Fingerprinting for Perceptual Content","3080601":"A class of traceability codes","220681180":"Combinatorial properties of frameproof and traceability codes.","3084692":"Digital fingerprinting codes: Problem statements, constructions, identification of traitors","221452303":"Scalable Fingerprinting Scheme Using Statistically Secure Anti-collusion Code for Large Scale Contents Distribution","220334876":"Combinatorial Properties of Frameproof and Traceability Codes."},"citedIn":{"46119692":"Anti-Collusion Fingerprinting for Multimedia Content Protection","262220411":"A Variant of Non-Adaptive Group Testing and Its Application in Pay-Television via Internet"},"index":664}