{"abs":"An intermediate range solution for the problem of plane wave diffraction by a finite plate with impedance boundaries is presented. Initially, the problem is expressed in terms of two Wiener–Hopf equations with the help of Fourier transform and the boundary conditions in the transformed domain. The consideration of the intermediate range approximation in terms of source position renders integrals that are generally elusive to tackle because of the presence of branch points. These integrals are evaluated by invoking a modified stationary phase method, thereby a field valid over an intermediate range is calculated. The graphical analysis is preformed for various parameters of physical interest for both intermediate and far-field solutions.","title":"An intermediate range solution to a diffraction problem with impedance conditions","id":262560562,"url":"https://www.researchgate.net/publication/262560562_An_intermediate_range_solution_to_a_diffraction_problem_with_impedance_conditions","names":["Rab Nawaz","Abdul Wahab","Amer Rasheed","Journal of Modern Optics"],"references":{"253343065":"On Sound Generated Aerodynamically. I. General Theory","243402178":"Plane wave diffraction by a perfectly conducting strip in a homogeneous biisotropic medium","236150290":"Geometrical Theory of Diffraction","286826842":"Diffraction near a porous half plane","243014271":"Diffraction of sound waves by a finite barrier in a moving fluid","229371054":"Diffraction of electromagnetic plane wave by an infinitely long conducting strip on dielectric slab","264956866":"A simplifying technique in the solution of a class of diffraction problems","246813822":"Methods Based on the Wiener-Hopf Technique","254008169":"Diffraction of electromagnetic plane wave by an impedance strip","224400428":"Magnetic Line Source Diffraction by an Impedance Step","229811935":"Asymptotic Expansion","233293065":"Line source and point source diffraction by a reactive step","222800215":"On the acoustic boundary condition in the presence of flow","30045979":"A brief historical perspective of Wiener–Hopf technique","234398730":"Acoustic diffraction by an absorbing semi-infinite half plane in a moving fluid","240040221":"Impedance Boundary Conditions in Electromagnetics","257800232":"A note on acoustic diffraction by an absorbing finite strip in a moving fluid","247913585":"The Influence of Solid Boundaries upon Aerodynamic Sound","256083092":"Scattering of a fluid-structure coupled wave at a flanged junction between two flexible waveguides","237152218":"Line-source diffraction by a slit in a moving fluid","3304488":"The impedance-boundary condition","3010035":"Higher order impedance and absorbing boundary conditions","220512730":"Sound due to an impulsive line source"},"citedIn":{"273792627":"Effect of cold plasma permittivity on the radiation of the dominant TEM-wave by an impedance loaded parallel-plate waveguide radiator","269561159":"Mode-matching solution of a scattering problem in flexible waveguide with abrupt geometric changes","236032792":"Acoustic Scattering in Flexible Waveguide Involving Step Discontinuity","261101244":"Electromagnetic Time Reversal Algorithms and Source Localization in Lossy Dielectric Media"},"index":665}