{"abs":"The dominated hypervolume (or S-metric) is a commonly accepted quality measure for comparing approximations of Pareto fronts generated by multi-objective optimizers. Since optimizers exist, namely evolutionary algorithms, that use the S-metric internally several times per iteration, a fast determination of the S-metric value is of essential importance. This work describes how to consider the S-metric as a special case of a more general geometric problem called Klee\u0027s measure problem (KMP). For KMP, an algorithm exists with runtime O(n log n + n(d/2) log n), for n points of d \u003eor\u003d 3 dimensions. This complex algorithm is adapted to the special case of calculating the S-metric. Conceptual simplifications realize the algorithm without complex data structures and establish an upper bound of O(n(d/2) log n) for the S-metric calculation for d \u003eor\u003d 3. The performance of the new algorithm is studied in comparison to another state of the art algorithm on a set of academic test functions.","title":"S-Metric Calculation by Considering Dominated Hypervolume as Klee\u0027s Measure Problem","id":38092673,"url":"https://www.researchgate.net/publication/38092673_S-Metric_Calculation_by_Considering_Dominated_Hypervolume_as_Klee\u0027s_Measure_Problem","names":["Nicola (Beume) Hochstrate","Evolutionary Computation"],"references":{"222540032":"Lecture Notes in Computer Science","269900117":"New Upper Bounds in Klee’s Measure Problem","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","220427429":"On the Complexity of Computing the Measure of U[ai, bi].","4201672":"Heuristics for optimizing the calculation of hypervolume for multi-objective optimization problems","221228450":"A New Analysis of the LebMeasure Algorithm for Calculating Hypervolume","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","221228479":"The Measure of Pareto Optima.","216300272":"Hypervolumen-basierte Selektion in einem evolutionären Algorithmus zur Mehrzieloptimierung","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","3418862":"A faster algorithm for calculating hypervolume","222450781":"Batched dynamic solutions to decomposable searching problems","220702008":"SPAM: Set Preference Algorithm for Multiobjective Optimization","244455629":"Can the measure of [ai","3498772":"New upper bounds in Klee\u0027s measure problem","224309500":"A Fast Incremental Hypervolume Algorithm","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","224579855":"On the Complexity of Computing the Hypervolume Indicator","216457303":"Indicator-Based Selection in Multiobjective Search","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","266239206":"Can the Measure of ∪ n 1 [ a i , b i ] be Computed in Less Than O(n logn) Steps?","223855918":"A (Slightly) Faster Algorithm for Klee\u0027s Measure Problem","216457304":"Lecture Notes in Computer Science","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"272426301":"Das Räuber-Beute-Modell für die mehrkriterielle Optimierung - Analyse und Anwendung","262368545":"Parameterized average-case complexity of the hypervolume indicator","24399858":"Objective Reduction in Evolutionary Multiobjective Optimization: Theory and Applications","28358328":"Lecture Notes in Computer Science","221007654":"Indicator-based MONEDA: A comparative study of scalability with respect to decision space dimensions","280534066":"Bi-goal evolution for many-objective optimization problems","41786737":"Efficient Covariance Matrix Update for Variable Metric Evolution Strategies","275551329":"Beam Search for integer multi-objective optimization","229329189":"Quick HyperVolume","1885715":"Novel Algorithm to Calculate Hypervolume Indicator of Pareto Approximation Set","261307906":"Applying the WFG algorithm to calculate incremental hypervolumes","259084900":"Speeding up many-objective optimization by Monte Carlo approximations","221008825":"Improving hypervolume-based multiobjective evolutionary algorithms by using objective reduction methods","262370107":"A comparison of different algorithms for the calculation of dominated hypervolumes","264784337":"Machine learning based decision support for many-objective optimization problems","226254437":"On Handling a Large Number of Objectives A Posteriori and During Optimization","238735258":"Universiteit Leiden Opleiding Informatica","224309500":"A Fast Incremental Hypervolume Algorithm","216301639":"On the Design of Optimisers for Surface Reconstruction ABSTRACT","274199412":"Homogene Approximation der Paretofront bei mehrkriteriellen Kontrollproblemen","220741262":"Multiobjectivization for parameter estimation: A case-study on the segment polarity network of Drosophila","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","265869425":"Distinct Candidates Optimization: A Novel Approach to Applied Evolutionary Multi-and Many-Objective Optimization","286528701":"Finding Evenly Spaced Pareto Fronts for Three-Objective Optimization Problems","220741273":"Scaling up indicator-based MOEAs by approximating the least hypervolume contributor: A preliminary study","235960483":"Cone-Based Hypervolume Indicators: Construction, Properties, and Efficient Computation","267511239":"Empirical Performance of the Approximation of the Least Hypervolume Contributor","38092670":"On the Use of Problem-Specific Candidate Generators for the Hybrid Optimization of Multi-Objective Production Engineering Problems","222540032":"Lecture Notes in Computer Science","226145598":"Faster Hypervolume-Based Search Using Monte Carlo Sampling","268630598":"PPSN poster for \"Empirical Performance of the Approximation of the Least Hypervolume Contributor\"","260621901":"Objective Reduction in Many-Objective Optimization: Linear and Nonlinear Algorithms","38092672":"Statistical Methods for Convergence Detection of Multi-Objective Evolutionary Algorithms","216457248":"The maximum hypervolume set yields near-optimal approximation","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","235709893":"Scalable Multi-Objective Optimization","47843222":"Don\u0027t be greedy when calculating hypervolume contributions","287181134":"The Directed Search Method for Pareto Front Approximations with Maximum Dominated Hypervolume","216457268":"Indicator-based evolutionary algorithm with hypervolume approximation by achievement scalarizing functions","47842446":"Analyzing Hypervolume Indicator Based Algorithms","210205139":"Computing Hypervolume Contributions in Low Dimensions: Asymptotically Optimal Algorithm and Complexity Results","225836716":"A Hypervolume-Based Optimizer for High-Dimensional Objective Spaces","229431286":"A fast dimension-sweep algorithm for the hypervolume indicator in four dimensions","220381049":"A Fast Way of Calculating Exact Hypervolumes","224178048":"On population diversity measures in Euclidean space","47843204":"Multiplicative Approximations and the Hypervolume Indicator","221608788":"Multi-Objective Optimization with an Adaptive Resonance Theory-Based Estimation of Distribution Algorithm: A Comparative Study.","258163201":"Fast calculation of multiobjective probability of improvement and expected improvement criteria for Pareto optimization","269187692":"A Simple and Fast Hypervolume Indicator-Based Multiobjective Evolutionary Algorithm","260134761":"Consistencies or Contradictions of Performance Metrics in Multiobjective Optimization?","220887232":"A Set of Test Cases for Performance Measures in Multiobjective Optimization","220310732":"Achieving balance between proximity and diversity in multi-objective evolutionary algorithm","224579855":"On the Complexity of Computing the Hypervolume Indicator","237391958":"Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods","239570995":"Operational Optimisation of Water Distribution Networks","221025114":"Lecture Notes in Computer Science","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","44685406":"An Efficient Algorithm for Computing Hypervolume Contributions *","251316109":"Hypervolume-based multi-objective local search","224177959":"A fast many-objective hypervolume algorithm using iterated incremental calculations","51013751":"Design and tuning of an evolutionary multiobjective optimisation algorithm","224301859":"Incrementally maximising hypervolume for selection in multi-objective evolutionary algorithms","23647254":"Approximating the Least Hypervolume Contributor: NP-Hard in General, But Fast in Practice","271445970":"Multiobjective optimisation on a budget: Exploring surrogate modelling for robust multi-reservoir rules generation under hydrological uncertainty"},"index":666}