{"abs":"An important class of functions that arise in statistics and other areas are the log-concave functions. Here we provide the first polynomial time algorithm to generate samples from a given log-concave distribution. The algorithm is fairly simple and natural; it is the proof of its fast convergence that is new. To this end, we prove a general isoperimetric inequality for convex sets and use this together with recent developments in the theory of rapidly mixing Markov chains. We use our sampling algorithm to develop an algorithm for integrating log-concave functions. As one application, we are able to develop an algorithm for approximating the volume of convex bodies given by an oracle; we do so by enclosing the given body in a cube, defining a log-concave function that is 1 on the body and exponentially falls off outside, and integrating this function. This a.llo ws us to avoid one of the complications in prior algorithms for computing volumes – dealing with sharp corners – and results in an algorithm which is faster than previous algorithms.","title":"Sampling and Integration of Near Log-Concave functions","id":221590520,"url":"https://www.researchgate.net/publication/221590520_Sampling_and_Integration_of_Near_Log-Concave_functions","names":["David Applegate","Ravi Kannan"],"references":{"28641207":"Integer Programming with a Fixed Number of Variables","2505506":"A Random Polynomial Time Algorithm For Approximating The Volume Of Convex Bodies","242358084":"Integer programming with a fixed number of vaxiables","221499060":"The Mixing Rate of Markov Chains, an Isoperimetric Inequality, and Computing the Volume","32013011":"Geometric Algorithms and Combinatorial Optimization","238731927":"Theorie der konvexen ksrper","223707912":"Sinclair, A.: Approximate counting, uniform generation and rapidly mixing Markov chains. Inf. Comput. 82(1), 93-133","228057769":"Probability Inequalities for Sums of Bounded Random Variables"},"citedIn":{"265578966":"A Bayesian Approach to Data-Driven Optimization under Uncertainty","226978819":"Random walks, totally unimodular matrices, and a randomised dual simplex algorithm","2136228":"Small-world MCMC and convergence to multi-modal distributions: From slow mixing to fast mixing","252428814":"Algorithms and Monte Carlo Methods in Computational Biology","2255780":"The Markov Chain Monte Carlo Method: An Approach To Approximate Counting And Integration","220780334":"Thin Partitions: Isoperimetric Inequalities and a Sampling Algorithm for Star Shaped Bodies.","222563523":"A discipline of evolutionary programming","239329226":"A New Approach to Polynomial-Time Generation of Random Points in Convex Bodies","264903491":"Randomized Algorithms for Analysis and Control of Uncertain Systems, with Applications","3086245":"Lecture Notes in Computer Science","220442543":"Simulated Annealing for Convex Optimization","2106798":"Rapid mixing in Markov chains","3785015":"Local search in smooth convex sets","255671986":"Random Walks And An O*(n⁵) Volume Algorithm For Convex Bodies","1916815":"An Approximation Algorithm for Counting Contingency Tables","4038184":"Simulated annealing in convex bodies and an O*(n4) volume algorithm","266878973":"On the complexity of approximate multivariate integration","2118582":"Learning mixtures of separated nonspherical Gaussians","221591212":"Hit-and-Run from a Corner","2585278":"The Computational Complexity of Counting","225135730":"Statistical validation for uncertainty models","36118846":"Dispersion of mass and the complexity of geometric problems /","4038182":"Logconcave functions: Geometry and efficient sampling algorithms","2512314":"Examples: Special Graphs and Trees","242430062":"The Geometry of Logconcave Functions and an O* (n3) Sampling Algorithm","2413498":"Exact Mixing in an Unknown Markov Chain","2513924":"Sampling Contingency Tables","272751970":"Learning with Differential Privacy: Stability, Learnability and the Sufficiency and Necessity of ERM Principle","222562528":"Dispersion of Mass and the Complexity of Randomized Geometric Algorithms","2682508":"On The Complexity Of Computing Mixed Volumes","220618370":"Fast Universalization of Investment Strategies","220618368":"Adiabatic Quantum State Generation","264582626":"A Supermodularity-Based Differential Privacy Preserving Algorithm for Data Anonymization","2572301":"Probabilistic and On-line Methods in Machine Learning","221499039":"Fast Algorithms for Logconcave Functions: Sampling, Rounding, Integration and Optimization","220617483":"Hit-and-Run from a Corner.","241689162":"A Cubic Algorithm for Computing Gaussian Volume","5110883":"On the computational complexity of MCMC-based estimators in large samples","238833292":"Counting linear extensions","258160979":"A simple randomised algorithm for convex optimisation","262161296":"A fully Bayesian model based on reversible jump MCMC and finite Beta mixtures for clustering","2830233":"Hit-and-Run is Fast and Fun","3513479":"On the randomized complexity of volume and diameter","227276601":"An Introduction to MCMC for Machine Learning","243103689":"Correction: Sampling from Log-Concave Distributions","267214299":"Stochastic Billiards for Sampling from the Boundary of a Convex Set","262240280":"The approximate rank of a matrix and its algorithmic applications","259276616":"Lecture Notes in Computer Science","226741566":"Approximating the volume of convex bodies","221437580":"On the Hardness of Approximate Multivariate Integration","2132894":"Simple Monte Carlo and the Metropolis Algorithm","220357603":"A Mildly Exponential Time Algorithm for Approximating the Number of Solutions to a Multidimensional Knapsack Problem","265967000":"Bypassing KLS: Gaussian Cooling and an O*(n^3) Volume Algorithm","2124002":"Enumerating Contingency Tables via Random Permanents","222540032":"Lecture Notes in Computer Science","2637675":"Mathematical Foundations of the Markov Chain Monte Carlo Method","255078640":"Sampling Harmonic Concave Functions: The Limit of Convexity Based Isoperimetry","220985967":"Using Histograms to Better Answer Queries to Probabilistic Logic Programs","288364660":"Private Empirical Risk Minimization: Efficient Algorithms and Tight Error Bounds","220815343":"Bayesian Inverse Reinforcement Learning.","228933602":"Geometric Random Walks: A Survey","3676913":"The automatic synthesis of planar fabrication process flows for surface micromachined devices","2136426":"Counting magic squares in quasi-polynomial time","226514897":"A Survey of Query Auditing Techniques for Data Privacy","220342774":"Exact Mixing in an Unknown Markov Chain","220345718":"An elementary procedure for sampling points in a convex body","3593057":"Markov chains and polynomial time algorithms","222563485":"Learning a decision maker\u0027s utility function from (possibly) inconsistent behavior","247330407":"Random Walks on Graphs: A Survey, Combinatorics, Paul Erdos is Eighty","227319639":"Isoperimetric problems for convex bodies and a localization lemma","222447646":"A random polynomial time algorithm for well-rounding convex bodies","1955137":"Towards Understanding the Predictability of Stock Markets from the Perspective of Computational Complexity","221933018":"Random Walks on Graphs: A Survey","2704201":"Towards a Polynomial-Time Randomized Algorithm for Closed Product-Form Networks","221583828":"Recent Progress and Open Problems in Algorithmic Convex Geometry.","2189507":"Adiabatic Quantum State Generation and Statistical Zero Knowledge","220345159":"The geometry of logconcave functions and sampling algorithms","220589251":"How to compute the volume in high dimension?","221462741":"On Sampling from Multivariate Distributions","2907461":"Efficient Algorithms for Universal Portfolios","228405623":"A Randomized Algorithm to Optimize Over Certain Convex Sets","222823460":"Simulated annealing in convex bodies and an O*(n4) volume algorithm","221591000":"Rapid sampling though quantum computing","242440963":"and On-line Methods in Machine Learning","220345811":"Random Walks in a Convex Body and an Improved Volume Algorithm.","221499328":"Efficient Algorithms for Universal Portfolios","232347309":"A slowly mixing Markov chain with implications for Gibbs sampling","228377701":"Releasing Private Contingency Tables","220046182":"Largest j-Simplices in n-Polytopes","239065795":"Volume Estimates and Rapid Mixing","3224013":"Process ompilation of thin film microdevices","45856580":"The Limit of Convexity Based Isoperimetry: Sampling Harmonic-Concave Functions"},"index":670}