{"abs":"Given a high dimensional convex body K µ IRn by a separation oracle, we can approx- imate its volume with relative error \", using O⁄(n5) oracle calls. Our algorithm also brings the body into isotropic position. As all previous randomized volume algorithms, we use \"rounding\" followed by a multi- phase Monte-Carlo (product estimator) technique. Both parts rely on sampling (generating random points in K), which is done by random walk. Our algorithm introduces three new ideas: † the use of the isotropic position (or at least an approximation of it) for rounding, † the separation of global obstructions (diameter) and local obstructions (boundary problems) for fast mixing, and † a stepwise interlacing of rounding and sampling.","title":"Random Walks And An O*(n⁵) Volume Algorithm For Convex Bodies","id":255671986,"url":"https://www.researchgate.net/publication/255671986_Random_Walks_And_An_On_Volume_Algorithm_For_Convex_Bodies","names":["Ravindran Kannan","László Lovász","Miklós Simonovits","Random Structures and Algorithms"],"references":{"38363017":"Eigenvalue Bounds on Convergence to Stationarity for Nonreversible Markov Chains, with an Application to the Exclusion Process","216877580":"Geometric Algorithms and Combinatorial Optimization. Berlin: Springer","265452787":"How to compute the volume?","2505506":"A Random Polynomial Time Algorithm For Approximating The Volume Of Convex Bodies","2268775":"Computing The Volume Of Convex Bodies: A Case Where Randomness Provably Helps","226496454":"The Brunn-Minkowski inequality in Gauss space. Invent. Math. 30 207-216","221499060":"The Mixing Rate of Markov Chains, an Isoperimetric Inequality, and Computing the Volume","220617231":"On the Complexity of Computing the Volume of a Polyhedron","238834229":"Polytope Volume Computation","260908615":"Handbook of Convex Geometry","221590520":"Sampling and Integration of Near Log-Concave functions","225666206":"A Geometric Inequality and the Complexity of Computing Volume","220345811":"Random Walks in a Convex Body and an Improved Volume Algorithm.","3513479":"On the randomized complexity of volume and diameter","225804065":"Applications of analytic centers for the numerical solution of semiinfinite, convex programs arising in control theory","268651607":"Brunn theorem and a concentration of volume phenomena for symmetric convex bodies","221591053":"Computing the Volume Is Difficult","228057773":"Random Generation of Combinatorial Structures from a Uniform Distribution","32013011":"Geometric Algorithms and Combinatorial Optimization","38347506":"Partitions of mass-distributions and of convex bodies by hyperplanes","227319639":"Isoperimetric problems for convex bodies and a localization lemma","238208910":"Conductance and the Rapid Mixing Property for Markov Chains: The Approximation of the Permanent Resolved","266303234":"The problem of computing the volume of a polyhedron is # P-hard","245277507":"An Algorithmic Theory of Numbers, Graphs and Convexity"},"citedIn":{"242407026":"I. ADATLAP Név","220059934":"Optimization of a convex program with a polynomial perturbation","220780334":"Thin Partitions: Isoperimetric Inequalities and a Sampling Algorithm for Star Shaped Bodies.","230689479":"Efficient Active Learning of Halfspaces: An Aggressive Approach","7252834":"Generalized Haar DWT and Transformations Between Decision Trees and Neural Networks","4065842":"A high-speed acoustic data acquisition system using mostly COTS components","220924709":"Efficient Learning of Pseudo-Boolean Functions from Limited Training Data","255483188":"Robust multi-criteria ranking with additive value models and holistic pair-wise preference statements","3785014":"Approximation of diameters: randomization doesn\u0027t help","222407502":"Lp-moments of random vectors via majorizing measures","45913004":"How Close is the Sample Covariance Matrix to the Actual Covariance Matrix?","235326480":"Estimating the covariance of random matrices","220184329":"Cache-oblivious mesh layouts","221345062":"A permutation-augmented sampler for DP mixture models","2903860":"Kernel Query By Committee (KQBC)","35015439":"Exact rates of convergence for some simple non-reversible Markov chains /","4038182":"Logconcave functions: Geometry and efficient sampling algorithms","237322302":"Multiclass Multidimensional Modified Haar DWT for Classification Function Representation and its Realization via Fast Fixed-Depth Network","221620265":"Computing Marginal Distributions over Continuous Markov Networks for Statistical Relational Learning","242430062":"The Geometry of Logconcave Functions and an O* (n3) Sampling Algorithm","227185579":"Finding Optimal Shadows of Polytopes","2568966":"Solving Convex Programs by Random Walks","30845694":"Implementing Pure Adaptive Search for Global Optimization using Markov Chain Sampling","2572301":"Probabilistic and On-line Methods in Machine Learning","220617483":"Hit-and-Run from a Corner.","229333894":"Meta-control of an interacting-particle algorithm for global optimization","241689162":"A Cubic Algorithm for Computing Gaussian Volume","2105102":"Why Polyhedra Matter in Non-Linear Equation Solving","5110883":"On the computational complexity of MCMC-based estimators in large samples","220345357":"Randomly Coloring Graphs with Lower Bounds on Girth and Maximum Degree","258160979":"A simple randomised algorithm for convex optimisation","45881992":"Approximating the moments of marginals of high-dimensional distributions","261746861":"Statistical Model Selection for Markov Models of Biomolecular Dynamics","226916528":"Hit-and-run mixes fast","2358292":"Faster Mixing via average Conductance","220200487":"On randomly colouring locally sparse graphs","222300538":"On the Limits of Non-Approximability of Lattice Problems","225481034":"Concentration of mass on convex bodies","2413599":"Algebraic Geometry Over Four Rings and the Frontier to Tractability","226737854":"Exact Volume Computation for Polytopes: A Practical Study","271924747":"Estimating the Volume of Solution Space for Satisfiability Modulo Linear Real Arithmetic","265967000":"Bypassing KLS: Gaussian Cooling and an O*(n^3) Volume Algorithm","2637675":"Mathematical Foundations of the Markov Chain Monte Carlo Method","222540032":"Lecture Notes in Computer Science","221590897":"Random Walks on Polytopes and an Affine Interior Point Method for Linear Programming","269524310":"On A New Competitive Measure For Oblivious Routing","47860893":"Sharp bounds on the rate of convergence of the empirical covariance\nmatrix","2095704":"Computing Complex Dimension Faster and Deterministically (Extended Abstract)","228933602":"Geometric Random Walks: A Survey","233937081":"Positivity of hit-and-run and related algorithms","51917910":"Tail estimates for norms of sums of log-concave random vectors","257619988":"Generating a Random Collection of Discrete Joint Probability Distributions Subject to Partial Information","2131823":"Coupling with the stationary distribution and improved sampling for colorings and independent sets","226514897":"A Survey of Query Auditing Techniques for Data Privacy","220345718":"An elementary procedure for sampling points in a convex body","225547301":"Computing Minimal Multi-Homogeneous Bezout Numbers Is Hard","50235560":"Geometry of log-concave Ensembles of random matrices and approximate reconstruction","267174586":"Covariance estimation for distributions with 2+ε moments","221498731":"Randomly Coloring Constant Degree Graphs","258725170":"Near-Optimal Deterministic Algorithms for Volume Computation and Lattice Problems via M-Ellipsoids","2874224":"Quantum Computation and Lattice Problems","23647027":"Spectral norm of products of random and deterministic matrices","256481832":"Near-optimal deterministic algorithms for volume computation via M-ellipsoids","221444947":"Evaluating multiple attribute items using queries","222826794":"Uniform generation in spatial constraint databases and applications","234108816":"Similarity Measures on Preference Structures, Part II: Utility Functions","220345159":"The geometry of logconcave functions and sampling algorithms","222823460":"Simulated annealing in convex bodies and an O*(n4) volume algorithm","220573768":"A polynomial-time algorithm to approximately count contingency tables when the number of rows is constant","284068224":"A practical volume algorithm","242440963":"and On-line Methods in Machine Learning","38322488":"On singular values of matrices with independent rows","2138451":"Random Vectors in the Isotropic Position","2915931":"Optimal Outlier Removal in High-Dimensional Spaces","37988921":"A geometric theory of outliers and perturbation","252715884":"Conductance and Rapidly Mixing Markov Chains","2124704":"On weakly bounded empirical processes","222673349":"On the conditioning of random subdictionaries","220345250":"Counting Without Sampling: Asymptotics of the Log-Partition Function for Certain Statistical Physics Models","265756758":"Geometric Tools for Algorithms","220136349":"An Analysis of a Variation of Hit-and-Run for Uniform Sampling from General Regions SEKSAN KIATSUPAIBUL","264903491":"Randomized Algorithms for Analysis and Control of Uncertain Systems, with Applications","225784063":"Faster Mixing and Small Bottlenecks","220442543":"Simulated Annealing for Convex Optimization","259369721":"Blocking Conductance and Mixing in Random Walks","11448355":"Ten years on.","4374477":"A randomized cutting plane scheme for convex optimization","220345522":"Improved Bounds for Sampling Contingency Tables","231903296":"Random points in isotropic unconditional convex bodies","257196225":"Computational results of an O(n4) volume algorithm","221591212":"Hit-and-Run from a Corner","237502642":"The Risk Prole Problem for Stock Portfolio Optimization","24164333":"Quantitative estimates of the convergence of the empirical covariance matrix in Log-concave Ensembles","1960381":"Adaptive Simulated Annealing: A Near-optimal Connection between Sampling and Counting","2682508":"On The Complexity Of Computing Mixed Volumes","222562528":"Dispersion of Mass and the Complexity of Randomized Geometric Algorithms","225691862":"Approximation of convex sets by polytopes","240684272":"Volume Computation for Polytopes: Strategies and Performances","2393485":"On Numerical Solution of the Maximum Volume Ellipsoid Problem","221499039":"Fast Algorithms for Logconcave Functions: Sampling, Rounding, Integration and Optimization","11233798":"Issues in the Perioperative Management of the Elderly Patient with Cardiovascular Disease","4151953":"A new method for learning pseudo-Boolean functions with applications in terrorists profiling","2830233":"Hit-and-Run is Fast and Fun","225099480":"Empirical Processes with a Bounded Ψ1 Diameter","283466834":"Fuzzy ranking of human development: A proposal","46537087":"Games of fixed rank: A hierarchy of bimatrix games","222397946":"Similarity of Personal Preferences: Theoretical Foundations and Empirical Analysis","262353439":"Uniformly Generating Origin Destination Tables","222686203":"Asymptotic shape of a random polytope in a convex body","221590260":"The risk profile problem for stock portfolio optimization (extended abstract)","23935916":"Colouring Simple Hypergraphs","255078640":"Sampling Harmonic Concave Functions: The Limit of Convexity Based Isoperimetry","221544178":"Complexity of Approximating the Vertex Centroid of a Polyhedron.","24244151":"Keloid scarring, but not Dupuytren\u0027s contracture, is associated with unexplained carotid atherosclerosis","2485487":"Improved Complexity For Maximum Volume Inscribed Ellipsoids","226446767":"Computing Minimal Multi-homogeneous Bézout Numbers Is Hard","220115662":"Randomly coloring simple hypergraphs","231183382":"On approximation by projections of polytopes with few facets","45885551":"Randomized Interior Point methods for Sampling and Optimization","263006590":"Log-concavity and strong log-concavity: A review","4004072":"Quantum computation and lattice problems","24169127":"Thin Partitions: Isoperimetric Inequalities and Sampling Algorithms for some Nonconvex Families","221559785":"Simulatable auditing","227724623":"Improved Bounds for Sampling Contingency Tables","271631056":"A parallel implementation of an $$O^*(n^4)$$ O ∗ ( n 4 ) volume algorithm","265809207":"Eberle, A.: Error bounds for Metropolis-Hastings algorithms applied to perturbations of gaussian measures in high dimensions. Ann. Appl. Probab. 24(1), 337-377","221583828":"Recent Progress and Open Problems in Algorithmic Convex Geometry.","2845897":"Where to Start a Geometric Random Walk?","255639262":"Sampling convex bodies: A Random Matrix approach","220172284":"Approximating Fixed Points of Weakly Contracting Mappings","46381088":"General Epistatic Models of the Risk of Complex Diseases","2123206":"Counting without sampling. New algorithms for enumeration problems using statistical physics","225913244":"Decoupling and Partial Independence","258229128":"A probabilistic approach to the geometry of the ? p n -ball","259220382":"Efficient Random-Walk Methods for Approximating Polytope Volume","262274126":"Approximate Verification and Enumeration Problems","4065745":"Fractional Fourier transform techniques applied to active sonar","255642316":"Empirical processes with bounded \\psi_1 diameter","221499328":"Efficient Algorithms for Universal Portfolios","221590208":"A polynomial-time algorithm to approximately count contingency tables when the number of rows is constant","4870844":"Question selection for multi-attribute decision-aiding","4209079":"20 W from a 90-μm aperture laser diode","45863500":"On the Geometry of Differential Privacy","220133094":"A Randomized Cutting Plane Method with Probabilistic Geometric Convergence","228377701":"Releasing Private Contingency Tables","226347910":"Ellipsoid Approximation Using Random Vectors","2453467":"What Is the Complexity of Volume Calculation?","1957347":"Online convex optimization in the bandit setting: Gradient descent without a gradient","45856580":"The Limit of Convexity Based Isoperimetry: Sampling Harmonic-Concave Functions"},"index":671}