{"abs":"Evolutionary algorithms have been widely used to tackle multi-objective optimization problems. Incorporating preference information into the search of evolutionary algorithms for multi-objective optimization is of great importance as it allows one to focus on interesting regions in the objective space. Zitzler et al. have shown how to use a weight distribution function on the objective space to incorporate preference information into hypervolume-based algorithms. We show that this weighted information can easily be used in other popular EMO algorithms as well. Our results for NSGA-II and SPEA2 show that this yields similar results to the hypervolume approach and requires less computational effort.","title":"Weighted Preferences in Evolutionary Multi-objective Optimization","id":220935465,"url":"https://www.researchgate.net/publication/220935465_Weighted_Preferences_in_Evolutionary_Multi-objective_Optimization","names":["Tobias Friedrich","Trent Kroeger","Frank Neumann"],"references":{"220741544":"Reference Point Based Multi-Objective Optimization Using Evolutionary Algorithms","222540032":"Lecture Notes in Computer Science","216300449":"Evolutionary Algorithms for Solving Multi-Objective Problems Second Edition","3113162":"Incorporating A Priori Preferences in a Vector PSO Algorithm to Find Arbitrary Fractions of the Pareto Front of Multiobjective Design Problems","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","220742944":"Articulating User Preferences in Many-Objective Problems by Sampling the Weighted Hypervolume","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","41786737":"Efficient Covariance Matrix Update for Variable Metric Evolution Strategies","284004639":"Lecture Notes in Computer Science","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","221228633":"A Preference Based Interactive Evolutionary Algorithm for Multi-objective Optimization: PIE.","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","220740319":"Integrating user preferences with particle swarms for multi-objective optimization","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","220743411":"Non-even spread NSGA-II and its application to conflicting multi-objective compatible control.","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","221547241":"Reference Point-Based Particle Swarm Optimization Using a Steady-State Approach","220743285":"Using a distance metric to guide PSO algorithms for many-objective optimization","26768807":"A Preference-Based Evolutionary Algorithm for Multi-Objective Optimization"},"citedIn":{"257796220":"A multi-agent based model for collective purchasing in electronic commerce","260519846":"Parameters optimization of polygonal fuzzy neural networks based on GA-BP hybrid algorithm","268883079":"Post Pareto-optimal pruning algorithm for multiple objective optimization using specific extended angle dominance","260795720":"ENSURE: Long term digital preservation of Health Care, Clinical Trial and Financial data","282526804":"Weighted Method Based Trust Region-Particle Swarm Optimization for Multi-Objective Optimization","290906931":"User Preferences for Approximation-Guided Multi-objective Evolution","273001203":"Finding Robust Pareto-optimal Solutions Using Geometric Angle-Based Pruning Algorithm","282410136":"Evolutionary many-objective optimization: A quick-start guide","273846588":"Extending the Front: Designing RFID Antennas Using Multiobjective Differential Evolution with Biased Population Selection","26768807":"A Preference-Based Evolutionary Algorithm for Multi-Objective Optimization","260227741":"Linear fractional multi-objective optimization problems subject to fuzzy relational equations with a continuous Archimedean triangular norm"},"index":679}