{"abs":"Assuming that evolutionary multiobjective optimization (EMO) mainly deals with set problems, one can identify three core questions in this area of research: 1) how to formalize what type of Pareto set approximation is sought; 2) how to use this information within an algorithm to efficiently search for a good Pareto set approximation; and 3) how to compare the Pareto set approximations generated by different optimizers with respect to the formalized optimization goal. There is a vast amount of studies addressing these issues from different angles, but so far only a few studies can be found that consider all questions under one roof. This paper is an attempt to summarize recent developments in the EMO field within a unifying theory of set-based multiobjective search. It discusses how preference relations on sets can be formally defined, gives examples for selected user preferences, and proposes a general preferenceindependent hill climber for multiobjective optimization with theoretical convergence properties. Furthermore, it shows how to use set preference relations for statistical performance assessment and provides corresponding experimental results. The proposed methodology brings together preference articulation, algorithm design, and performance assessment under one framework and thereby opens up a new perspective on EMO.","title":"On Set-Based Multiobjective Optimization","id":262405508,"url":"https://www.researchgate.net/publication/262405508_On_Set-Based_Multiobjective_Optimization","names":["Eckart Zitzler","Lothar Thiele","Johannes Bader","IEEE Transactions on Evolutionary Computation"],"references":{"220741544":"Reference Point Based Multi-Objective Optimization Using Evolutionary Algorithms","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","3865145":"On measuring multiobjective evolutionary algorithm performance","3949503":"Scalable multi-objective optimization test problems","226145598":"Faster Hypervolume-Based Search Using Monte Carlo Sampling","225109103":"Finding Knees in Multi-objective Optimization","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","235709769":"Evaluating the quality of approximation to the non-dominated set","220380772":"Preferences and their Application in Evolutionary Multiobjective Optimisation","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","47842387":"Do Additional Objectives Make a Problem Harder?","216457263":"Lecture Notes in Computer Science","224645801":"Preference Incorporation in Multi-objective Evolutionary Algorithms: A Survey","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","2642725":"Evaluating the Quality of Approximations to the Non-Dominated Set","220741733":"Incorporation Of Fuzzy Preferences Into Evolutionary Multiobjective Optimization.","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","4939867":"Omni-optimizer: A generic evolutionary algorithm for single and multi-objective optimization","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","220742524":"Towards estimating nadir objective vector using evolutionary approaches","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","2811965":"Guidance in Evolutionary Multi-Objective Optimization","12473892":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","2239800":"On Measuring Multiobjective Evolutionary Algorithm Performance","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","220702008":"SPAM: Set Preference Algorithm for Multiobjective Optimization","216300934":"On metrics for comparing non-dominated sets","216300737":"On the convergence of multiobjective evolutionary algorithms","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","221025610":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","221271168":"Asymptotic Convergence of Some Metaheuristics Used for Multiobjective Optimization.","216457303":"Indicator-Based Selection in Multiobjective Search","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","216300368":"Integrating User Preferences into Evolutionary Multi-Objective Optimization","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","221228441":"Instance Generators and Test Suites for the Multiobjective Quadratic Assignment Problem","3865293":"Convergence Properties of Some Multi-Objective Evolutionary Algorithms","216301720":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm for Multiobjective Optimization","253248614":"A PREFERENCE-BASED INTERACTIVE EVOLUTIONARY ALGORITHM FOR MULTIOBJECTIVE OPTIMIZATION","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","4074689":"An evolution strategy with probabilistic mutation for multi-objective optimisation"},"citedIn":{"268821509":"Feedback-control operators for improved Pareto-set description: Application to a polymer extrusion process","265334230":"Selection of the Optimal Sizes of Analog Integrated Circuits by Fuzzy Sets Intersection","220740015":"Integrating decision space diversity into hypervolume-based multiobjective search","262272552":"Recombination of Similar Parents in SMS-EMOA on Many-Objective 0/1 Knapsack Problems","282937681":"Parallel many-objective evolutionary optimization using objectives decomposition","275551329":"Beam Search for integer multi-objective optimization","220288943":"An efficient Differential Evolution based algorithm for solving multi-objective optimization problems.","220740664":"A grid-based fitness strategy for evolutionary many-objective optimization","262391474":"The fuzzy-genetic system for multiobjective optimization","251388270":"Effects of 1Greedy S \\mathcal{S} -Metric-Selection on Innumerably Large Pareto Fronts","47750094":"Theoretically Investigating Optimal μ-Distributions for the Hypervolume Indicator: First Results For Three Objectives","260803740":"Multicriteria Optimization of A Long-Haul Routing and Scheduling Problem","258727538":"Assessing the evolution of learning capabilities and disorders with graphical exploratory analysis of surveys containing missing and conflicting answers","270698811":"Collaborative engineering among designers with different preferences: Application of the preference set-based design to the design problem of an automotive front-side frame","263989414":"Multiobjective particle swarm optimization based on dimensional update","271325750":"An interactive simple indicator-based evolutionary algorithm (I-SIBEA) for multiobjective optimization problems","221271214":"The logarithmic hypervolume indicator","257635397":"Diversity Guided Evolutionary Programming: A novel approach for continuous optimization","262914357":"On the Performance of Master-Slave Parallelization Methods for Multi-Objective Evolutionary Algorithms","275961580":"HC-MOEA: a Hierarchical Clustering approach for increasing the Solution’s Diversity in Multiobjective Evolutionary Algorithms","220702008":"SPAM: Set Preference Algorithm for Multiobjective Optimization","253958145":"A Challenge in the Operation of Distribution Smart Grids: The Global Optimization","262211715":"A New Multi-Objective Evolutionary Algorithm Based on a Performance Assessment Indicator","221007375":"A hypervolume based approach for minimal visual coverage shortest path","261393072":"On the performance of Recurring Multistage Evolutionary Algorithm for continuous function optimization","278619582":"A Correlation Analysis of Set Quality Indicator Values in Multiobjective Optimization","216300866":"Non-monotonicity of Observed Hypervolume in 1-Greedy S -Metric Selection","230712168":"Multiple Populations for Multiple Objectives: A Coevolutionary Technique for Solving Multiobjective Optimization Problems","216457295":"On Expected-Improvement Criteria for Model-based Multi-objective Optimization","221231109":"Designing combining classifier with trained fuser - Analytical and experimental evaluation","261302712":"Two-objective solution set optimization to maximize hypervolume and decision space diversity in multiobjective optimization","260721697":"Performance Metric Ensemble for Multiobjective Evolutionary Algorithms","257680110":"Enabling optimization in LCA: From \"ad hoc\" to \"structural\" LCA approach - Based on a biodiesel well-to-wheel case study","220701585":"Defining and Optimizing Indicator-Based Diversity Measures in Multiobjective Search","261208102":"A Multi-Objective Evolutionary Algorithm based on complete-linkage clustering to enhance the solution space diversity","260662718":"Two-Level Production Plan Decomposition Based on a Hybrid MOEA for Mineral Processing","47750112":"Lecture Notes in Computer Science","224408792":"Neural classifiers for schizophrenia diagnostic support on diffusion imaging data","220199847":"Evolution strategies and multi-objective optimization of permanent magnet motor","271366292":"Efficient multi-criteria optimization on noisy machine learning problems","224257127":"MO-Greedy: An Extended Beam-Search Approach for Solving a Multi-criteria Scheduling Problem on Heterogeneous Machines","256660343":"Approximation quality of the hypervolume indicator","263126933":"Multi-objective Reinforcement Learning with Continuous Pareto Frontier Approximation","284887111":"Solving Highly-Dimensional Multi-Objective Optimization Problems by Means of Genetic Gender","265799530":"TOWARDS ENHANCING SOLUTION SPACE DIVERSITY IN MULTI-OBJECTIVE OPTIMIZATION: A HYPERVOLUME-BASED APPROACH","235900977":"Probabilistic Method to Assess the Impact of Charging of Electric Vehicles on Distribution Grids","261520468":"Diversity Comparison of Pareto Front Approximations in Many-Objective Optimization","282936863":"Hybrid many-objective particle swarm optimization set-evolution","261118805":"An overview of the probability-based methods for optimal electrical distribution system reconfiguration","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","266653730":"On set-based local search for multiobjective combinatorial optimization","48416170":"On the Effect of Connectedness for Biobjective Multiple and Long Path Problems","259475518":"SS-ADC: Scatter search with adaptive diversity control","273229696":"Enhancing the scalability of multi-objective optimization via restricted Boltzmann machine-based estimation of distribution algorithm","221053542":"Ranked Tag Recommendation Systems Based on Logistic Regression.","264232948":"Anticipation in Multiple Criteria Decision-Making Under Uncertainty","220741223":"Convergence of Hypervolume-Based Archiving Algorithms","225624893":"Optimal k-Level Planarization and Crossing Minimization","262317805":"A Modified micro Genetic Algorithm for undertaking Multi-Objective Optimization Problems","224238349":"Recurring Two-Stage Evolutionary Programming: A Novel Approach for Numeric Optimization","257516680":"Scheduling issues in vehicle routing","47842446":"Analyzing Hypervolume Indicator Based Algorithms","264433558":"Automatic design of evolutionary algorithms for multi-objective combinatorial optimization","273918342":"Sets evolution-based particle swarm optimization for many-objective problems","241770161":"Convergence of Hypervolume-Based Archiving Algorithms II: Competitiveness","225836716":"A Hypervolume-Based Optimizer for High-Dimensional Objective Spaces","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","255564256":"Microsoft-CNRS Chair \"Optimization for Sustainable Development\", Activity Report 2009-2011","251238178":"Detection of heat flux failures in building using a soft computing diagnostic system","261447374":"Set-based genetic algorithms for solving many-objective optimization problems","262357118":"Bounding the Effectiveness of Hypervolume-Based (μ + λ)-Archiving Algorithms","235832912":"An efficient Differential Evolution based algorithm for solving multi-objective optimization problems","283551928":"Indicator-Based Selection","50842467":"Set-based Multiobjective Fitness Landscapes: A Preliminary Study","279138119":"A Design Method for Unexpected Circumstances: Application to an Active Isolation System","236946424":"Combining multicriteria analysis and tabu search for dial-a-ride problems","278401136":"Gender Approach to Multi-Objective Optimization of Detection Systems with Pre-selection of Criteria","220204745":"Integrating multi-objective genetic algorithm based clustering and data partitioning for skyline computation","282970423":"An Interactive Simple Indicator-Based Evolutionary Algorithm (I-SIBEA) for Multiobjective Optimization Problems","229077961":"Base Classifiers in Boosting-based Classification of Sequential Structures","268813429":"A comparative study of Pareto optimal approaches for distribution system reconfiguration","280851276":"Optimal μ-Distributions for the Hypervolume Indicator for Problems With Linear Bi-Objective Fronts: Exact and Exhaustive Results","235994081":"Pareto Optimal Reconfiguration of Power Distribution Systems Using a Genetic Algorithm Based on NSGA-II","216457236":"Set-based multi-objective optimization, indicators, and deteriorative cycles","216457232":"Investigating and Exploiting the Bias of the Weighted Hypervolume to Articulate User Preferences","259539854":"Directed Multiobjective Optimization Based on the Weighted Hypervolume Indicator","4035396":"Multiple layer asymmetric vertical comb-drive actuated scanning mirrors","280626752":"Confronting Tipping Points: Can Multi-objective Evolutionary Algorithms Discover Pollution Control Tradeoffs Given Environmental Thresholds?","256453810":"Studying Feedback Mechanisms for Adaptive Parameter Control in Evolutionary Algorithms","225775497":"Ranked Tag Recommendation Systems Based on Logistic Regression","222889399":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications","216457240":"Effects of 1-Greedy S-Metric-Selection on Innumerably Large Pareto Fronts","279257691":"R2-EMOA: Focused Multiobjective Search Using R2-Indicator-Based Selection"},"index":69}