{"abs":"We consider the usage of evolutionary algorithms for multiobjective programming (MOP), i.e. for decision problems with alternatives taken from a real-valued vector space and evaluated according to a vector-valued objective function. Selection mechanisms, possibilities of temporary fitness deterioration, and problems of unreachable alternatives for such multiobjective evolutionary algorithms (MOEAs) are studied. Theoretical properties of MOEAs such as stochastic convergence with probability 1 are analyzed.","title":"On the convergence of multiobjective evolutionary algorithms","id":216300737,"url":"https://www.researchgate.net/publication/216300737_On_the_convergence_of_multiobjective_evolutionary_algorithms","names":["Thomas Hanne","European Journal of Operational Research"],"references":{"226979079":"Multi-Objective Optimization Using Surrogates","221228399":"OCD: Online Convergence Detection for Evolutionary Multi-Objective Algorithms Based on Statistical Testing","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","227255247":"A survey of multicriteria optimization or the vector maximum problem, Part I: 1776–1960","3642928":"Multi-objective optimization by genetic algorithm: a review","237005545":"Simulation of Steady States in Dissipative Systems by Darwin\u0027s Paradigm of Evolution","223675100":"A general steady state distribution based stopping criteria for finite length genetic algorithms","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","224472044":"Online Convergence Detection for Multiobjective Aerodynamic Applications","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","3421242":"A Multi-objective Genetic Local Search Algorithm and Its Application to Flowshop Scheduling","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","216301297":"Evolutionsstrategie: Optimierung Technischer Systeme Nach Prinzipien Der Bilogischen Evolution","2627581":"Evolution Strategies for Vector Optimization","220740735":"A Cumulative Evidential Stopping Criterion for Multiobjective Optimization Evolutionary Algorithms ABSTRACT","241410356":"Automotive crashworthiness design using response surface-based variable screening and optimization","2365630":"A Hybrid Multi-Objective Evolutionary Approach to Engineering Shape Design","251880089":"Multiple Criteria Decision Making, Kyoto 1975","220702011":"A Convergence Criterion for Multiobjective Evolutionary Algorithms Based on Systematic Statistical Testing","2865846":"Hybrid Methods for Multi-Objective Evolutionary Algorithms","243779034":"Adaptation in Natural and Arti cial Systems","220045504":"Multiple Criteria Optimization: Theory, Computation and Application. N.Y., Wiley","226803557":"Scalarization in vector optimization","3418646":"Self-adaptive mutations lead to premature convergence","239392288":"A surrogate assisted parallel multiobjective evolutionary algorithm for robust engineering design. Eng Optim","226165021":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","2615425":"Evolutionary Computation and Convergence to a Pareto Front","220045365":"Multiobjective Optimization Using Evolutionary Algorithms. Wiley, New York","225222145":"A survey of vector optimization in infinite dimensional spaces, part II","223078437":"On Efficient Sets in Vector Maximum Problems — A Brief Survey","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","2609749":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations","222544049":"Response Surface Approximation of Pareto Optimal Front in Multi-objective Optimization","222630385":"Giannakoglou, K.C.: Design of optimal aerodynamic shapes using stochastic optimization methods and computational intelligence. Progress in Aerospace Sciences 38, 43-76","3865293":"Convergence Properties of Some Multi-Objective Evolutionary Algorithms","23794898":"Some properties of Pareto-optimal choices in decision problems","2364381":"Multiobjective Optimization using a Micro-Genetic Algorithm","224472152":"An Approach to Stopping Criteria for Multi-objective Optimization Evolutionary Algorithms: The MGBM Criterion","3418766":"Reducing the Run-Time Complexity of Multiobjective EAs: The NSGA-II and Other Algorithms","249314726":"Multi-Criteria Decision-Aid","220375001":"An Overview of Evolutionary Algorithms for Parameter Optimization","220669147":"Stopping Criteria for Finite Length Genetic Algorithms","267849163":"Assessing the Convergence Properties of NSGA-II for Direct Crashworthiness Optimization","226865464":"Cone Convexity, Cone Extreme Points and Non-Dominated Solutions in Decision Problems with Multiobjectives","222786745":"A General Method for Determining the Set of all Efficient Solutions of a Linear Vector Maximum Problem”, Eur. J. Opl. Res., 1, 307-322","224112229":"On the Convergence of Statistical Search","222515517":"New stopping criteria for genetic algorithms"},"citedIn":{"226011768":"Approximate Solutions in Space Mission Design","221228587":"Designing Multi-objective Variation Operators Using a Predator-Prey Approach.","225688695":"Decentralized Cooperative Optimization for Multi-criteria Decision Making","261054089":"A new principal curve algorithm and standard deviation clouds for non-parametric ordered data analysis","227035791":"Order Scheduling Models: An Overview","258724451":"When are multiobjective calibration trade-offs in hydrologic models meaningful?","220249385":"Convergence of Stochastic Search Algorithms to Finite Size Pareto Set Approximations","229550759":"A non‐dominance‐based online stopping criterion for multi‐objective evolutionary algorithms","2557485":"A Tutorial on Evolutionary Multiobjective Optimization","220381224":"An Investigation on Noisy Environments in Evolutionary Multiobjective Optimization","226110070":"Current and Future Research Trends in Evolutionary Multiobjective Optimization","241194094":"Joint Channel Estimation and Multiuser Detection for SDMA/OFDM Based on Dual Repeated Weighted Boosting Search","226211700":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","276412267":"Attraction and Diffusion in Nature-Inspired Optimization Algorithms","3865129":"Unified model for multi-objective evolutionary algorithms with elitism","265289924":"Low Complexity PSO-Based Multi-objective Algorithm for Delay-Constraint Applications","220215349":"Adaptive, convergent, and diversified archiving strategy for multiobjective evolutionary algorithms","220313398":"On convergence of the multi-objective particle swarm optimizers","225257847":"Multi-objective Optimization Using Differential Evolution: A Survey of the State-of-the-Art","220702011":"A Convergence Criterion for Multiobjective Evolutionary Algorithms Based on Systematic Statistical Testing","48198911":"New Model for Multi-Objective Evolutionary Algorithms","266222332":"Multidisciplinary scheduling: theory and applications. 1st international conference, MISTA ’03, Nottingham, UK, 13–15 August 2003. Selected papers","262405508":"On Set-Based Multiobjective Optimization","220739842":"Exploring the behavior of building blocks for multi-objective variation operator design using predator-prey dynamics","259982925":"Pareto archived dynamically dimensioned search with hypervolume-based selection for multi-objective optimization","2369041":"A Short Tutorial on Evolutionary Multiobjective Optimization","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","221228568":"A MOPSO Algorithm Based Exclusively on Pareto Dominance Concepts","224472152":"An Approach to Stopping Criteria for Multi-objective Optimization Evolutionary Algorithms: The MGBM Criterion","28352139":"Some Theoretical Properties of Evolutionary Algorithms under Partially Ordered Fitness Values","28352141":"Mutation Control and Convergence in Evolutionary Multi-Object Optimization","220702233":"Multiobjectivization by Decomposition of Scalar Cost Functions","3418742":"Guest editorial: Special issue on evolutionary multiobjective optimization","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","277972946":"Compromise Rank Genetic Programming for Automated Nonlinear Design of Disaster Management","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","224301849":"A primal-dual multiobjective evolutionary algorithm for approximating the efficient set","224182548":"On the Influence of the Number of Objectives on the Hardness of a Multiobjective Optimization Problem","4201480":"Multi-objective differential evolution - Algorithm, convergence analysis, and applications","276412208":"Attraction and diffusion in nature-inspired optimization algorithms","221420152":"An Improved Multiobjective Evolutionary Algorithm Based on Dominating Tree.","235745345":"Developing Parsimonious and Efficient Algorithms for Water Resources Optimization Problems","4219405":"Evolutionary multi-objective optimization: current state and future challenges","220741223":"Convergence of Hypervolume-Based Archiving Algorithms","2524535":"Archiving with Guaranteed Convergence and Diversity in Multi-Objective Optimization","4262422":"Scored Pareto MEC for Multi-Objective Optimization and Its Convergence","220314486":"Convergence of multi-objective evolutionary algorithms to a uniformly distributed representation of the Pareto front","222094692":"Multiobjective optimization using evolutionary algorithms","273640982":"Experiments with Human Integration in Asynchronous and Sequential Multi-agent Frameworks for Architecture Optimization","220739656":"Convergence of stochastic search algorithms to gap-free pareto front approximations","281823407":"Multi-objective analysis of computational models","226809313":"Evolutionary Multiobjective Optimization Algorithm as a Markov System","4251686":"On the Convergence of Multi-Objective Descent Algorithms","250890131":"Efficient evolutionary approach to approximate the Pareto-optimal set in multiobjective optimization, UPS-EMOA","282059174":"A survey and annotated bibliography of multiobjective combinatorial optimization","226138384":"Evolutionary Multi-Objective Optimization: A Critical Review","216301719":"A Tutorial on Evolutionary Multiobjective Optimization","220381009":"Cluster Guide Particle Swarm Optimization (CGPSO) for Underdetermined Blind Source Separation With Advanced Conditions","220381014":"Using unconstrained elite archives for multiobjective optimization","1765486":"Stochastic convergence of random search to fixed size Pareto set\napproximations","216300179":"Model Optimization with Evolutionary Algorithms","216300188":"Challenges for Contemporary Evolutionary Algorithms","216300189":"Challenges for Contemparary Evolutionary Algorithms","237586088":"Construction of an Optimal Linkage Arm Using Structural Optimization","220403362":"Global Multiobjective Optimization Using Evolutionary Algorithms","277298436":"Multi-Objective Particle Swarm Optimisation Methods.","4201417":"Modeling and convergence analysis of a continuous multi-objective differential evolution algorithm","268296566":"Strategies for Internet Route Control Past, Present, and Future","3419046":"Dominance-Based Multiobjective Simulated Annealing","221883565":"Borg: An Auto-Adaptive Many-Objective Evolutionary Computing Framework","220289972":"Stochastic convergence of random search methods to fixed size Pareto front approximations","242269929":"Design and Management of Complex Technical Processes and Systems by means of Computational Intelligence Methods A Predator-Prey Approach for Pareto-Optimization","227003420":"Multiobjective Combinatorial Optimization — Theory, Methodology, and Applications","220606393":"Evolutionary Optimization (Evopt): A Brief Review And Analysis.","243788071":"Analysis and applications of evolutionary multiobjective optimization algorithms","220739726":"Inside a predator-prey model for multi-objective optimization","220702093":"Convergence Rates of (1+1) Evolutionary Multiobjective Optimization Algorithms","220701836":"Approximate Solutions in Space Mission Design.","264700522":"Feature selection by multi-objective optimisation: Application to network anomaly detection by hierarchical self-organising maps","3418778":"Running Time Analysis of Multiobjective Evolutionary Algorithms on Pseudo-Boolean Functions","225218270":"Comparison of MCDM and EMO Approaches in Wastewater Treatment Plan Design","226497594":"Recent Trends in Evolutionary Multiobjective Optimization","258757335":"Evolutionary multiobjective optimization in water resources: The past, present, and future","220741780":"An analysis on recombination in multi-objective evolutionary optimization","221279117":"Resources Selection of Dynamic Alliance Based on Genetic Algorithm.","264744057":"A new selection metric for multiobjective hydrologic model calibration","225253036":"On Utilizing Infeasibility in Multiobjective Evolutionary Algorithms","2454246":"Evolutionary Search under Partially Ordered Fitness Sets","4074746":"Adaptive diversity maintenance and convergence guarantee in multiobjective evolutionary algorithms","38092672":"Statistical Methods for Convergence Detection of Multi-Objective Evolutionary Algorithms","235709893":"Scalable Multi-Objective Optimization","227224385":"Scheduling in Software Development Using Multiobjective Evolutionary Algorithms","281759745":"A Filter-Genetic Algorithm for Constrained Optimization Problems","241479087":"A Hybrid Algorithm for Dynamic Location Problems","231371265":"Multi-objective Decisions on Capacity Planning and Production−Inventory Control under Uncertainty","4879003":"A multiobjective evolutionary algorithm for scheduling and inspection planning in software development projects","269564864":"Computing the Set of Epsilon-Efficient Solutions in Multiobjective Space Mission Design","225602976":"The Convergence of a Multi-objective Evolutionary Algorithm Based on Grids","221006840":"On convergence of multi-objective Particle Swarm Optimizers.","220380918":"Guest editorial: special issue on evolutionary multiobjective optimization.","220689651":"Multiobjective Genetic Algorithms for Clustering - Applications in Data Mining and Bioinformatics.","229881446":"Approximating nondominated sets in continuous multiobjective optimization problems","221228538":"On Sequential Online Archiving of Objective Vectors","264932380":"Multiobjective programming and goal programming. Theoretical results and practical applications. Selected papers based on the presentations at the international conference on multiobjective programming and goal programming (MOP/GP 2006), Tours, France, June 12–14, 2006","29598745":"Theoretical Aspects of Evolutionary Multiobjective Optimization---A Review","2626292":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","226674526":"Approximating the \nε\n-Efficient Set of an MOP with Stochastic Search Algorithms","216301572":"Convergence Time Analysis for the Multi-objective Counting Ones Problem","273397675":"The Rolling Tide Evolutionary Algorithm: A Multiobjective Optimizer for Noisy Optimization Problems","45868377":"Techniques for Highly Multiobjective Optimisation: Some Nondominated Points are Better than Others","261500276":"An Investigation on Noisy Environments in Evolutionary Multi-Objective Optimization","40906642":"Computing Gap Free Pareto Front Approximations with Stochastic Search Algorithms","241638787":"Turbo Multi-User Detection for OFDM/SDMA Systems Relying on Differential Evolution Aided Iterative Channel Estimation","260799844":"Evolutionary-Algorithm-Assisted Joint Channel Estimation and Turbo Multiuser Detection/Decoding for OFDM/SDMA","281760036":"Comparison of various approaches in multi-objective particle swarm optimization (MOPSO): Empirical study","255580363":"Ecient evolutionary method to approximate the Pareto optimal set in multiobjective optimization","284004637":"Lecture Notes in Computer Science","216457236":"Set-based multi-objective optimization, indicators, and deteriorative cycles","3865293":"Convergence Properties of Some Multi-Objective Evolutionary Algorithms","220113382":"Convergence analysis of a self-adaptive multi-objective evolutionary algorithm based on grids","267117075":"Theory of Evolutionary Algorithms and Genetic Programming","221228500":"Global Multiobjective Optimization with Evolutionary Algorithms: Selection Mechanisms and Mutation Control","222870196":"A multiobjective evolutionary algorithm for approximating the efficient set","220701912":"Running Time Analysis of Multi-objective Evolutionary Algorithms on a Simple Discrete Optimization Problem","228344675":"Many‐objective groundwater monitoring network design using bias‐aware ensemble Kalman filtering, evolutionary optimization, and visual analytics"},"index":692}