{"abs":"In this paper we describe a method for improving genetic-algorithm-based optimization using reduced models. The main idea is to maintain a large sample of the points encountered in the course of the optimization divided into clusters. Least squares quadratic approximations are periodically formed of the entire sample as well as the big enough clusters. These approximations are used as a reduced model to compute cheap approximations of the fitness function through a two phase approach in which the point is first classified (into potentially feasible, infeasible or unevaluable) and then its fitness is computed accordingly. We then use the reduced models to speedup the GA optimization by making the genetic operators such as mutation and crossover more informed. The proposed approach is particularly suitable for search spaces with expensive evaluation functions, such as arise in engineering design. Empirical results in several engineering design domains demonstrate that the proposed metho...","title":"An Incremental-Approximate-Clustering Approach for Developing Dynamic Reduced Models for Design Optimization","id":2807889,"url":"https://www.researchgate.net/publication/2807889_An_Incremental-Approximate-Clustering_Approach_for_Developing_Dynamic_Reduced_Models_for_Design_Optimization","names":["Khaled Rasheed"],"references":{"226464504":"Design by natural selection","221591356":"Optimal Algorithms for Approximate Clustering","224627818":"A Simple Condition for the Convexity of Optimal Control over Networks with Delays","228453399":"Evaluation of Injection Island GA Performance on Flywheel Design Optimisation","4006128":"“Decentralized Control Information Structure Preserved under Feedback,”","220740966":"Metamodeling Techniques For Evolutionary Optimization of Computationally Expensive Problems: Promises and Limitations.","215755923":"In Numerical Receipts in C: The Art of Scientific Computing","2349484":"Learning to be Selective in Genetic-Algorithm-Based Design Optimization","201976281":"Using Genetic Algorithms in Engineering Design Optimization with Non-Linear Constraints","228598576":"Optimal distributed control with distributed delayed measurements","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","222592723":"Structured finite-dimensional controller design by convex optimization","2261304":"Gado: A Genetic Algorithm For Continuous Design Optimization","3031922":"Structured Optimal and Robust Control With Multiple Criteria: A Convex Solution","2356412":"An Adaptive Penalty Approach for Constrained Genetic-Algorithm Optimization","243776152":"The utility of nonlinear programming algorithms","243657637":"A Counterexample in Stochastic Optimum Control","266039355":"A Course in Robust Control Theory: A Convex Approach","240342705":"The use of a co-operative multi-level CHC GA for structural shape optimization","220779338":"Exact and Approximation Algorithms for Clustering (Extended Abstract).","261001961":"Numerical Recipes in C—The Art of Scientific Computing","221591837":"Incremental Clustering and Dynamic Information Retrieval.","3027014":"Solution of Some Nonclassical LQG Stochastic Decision Problems","2798171":"Virtual Genetic Algorithms: First Results","2336982":"High Performance Supersonic Missile Inlet Design Using Automated Optimization","224680349":"Team decision theory and information structures in optimal control problems: Part I","223938660":"Using Modeling Knowledge to Guide Design Space Search"},"citedIn":{"220741224":"Comparison Of Methods For Using Reduced Models To Speed Up Design Optimization.","5303060":"Local Search with Quadratic Approximations into Memetic Algorithms for Optimization with Multiple Criteria","221008933":"Projection-based local search operator for multiple equality constraints within genetic algorithms","41116025":"Algorithme intelligent d\u0027optimisation d\u0027un design structurel de grande envergure","47329560":"Métaheuristiques Coopératives : du déterministe au stochastique","242677117":"Meta Model Based EA for Complex Optimization","2862880":"Comparison of Methods for Developing Dynamic Reduced Models for Design Optimization","220742181":"Expensive optimization, uncertain environment: An EA-based solution","224572019":"An effective intelligent algorithm for stochastic optimization problem","221006522":"Local search with quadratic approximation in Genetic Algorithms for expensive optimization problems","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","220381108":"Local Function Approximation in Evolutionary Algorithms for the Optimization of Costly Functions","235892312":"Expensive Optimisation: A Metaheuristics Perspective","226600342":"A Survey of Fitness Approximation Methods Applied in Evolutionary Algorithms","220048519":"Hybrid Metaheuristics","3421614":"Multiobjective GA Optimization Using Reduced Models","220742835":"Constrained Multi-objective Optimization Using Steady State Genetic Algorithms","29637721":"Using Datamining Techniques to Help Metaheuristics: A Short Survey","265614475":"ADAPTIVE SURROGATE-ASSISTED EVOLUTION","220740087":"Efficient Clustering-Based Genetic Algorithms in Chemical Kinetic Modelling.","235903469":"Evolutionary Approaches to Expensive Optimisation","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","268270233":"An Investigation on Two Surrogate-based EAs","216771847":"Hybrid genetic algorithms using quadratic local search operators","224301936":"Surrogate based EA for expensive optimization problems","4075022":"DAFHEA: a dynamic approximate fitness-based hybrid EA for optimisation problems","3949581":"Comparison of methods for developing dynamic reduced models for design optimization","257635951":"Blood sugar regularization based evolutionary algorithm for data classification","220743377":"Reduced computation for evolutionary optimization in noisy environment"},"index":698}