{"abs":"Our goal is to detect all instances of a generic object class, such as a face, in greyscale scenes. The design of the algorithm is motivated by computational efficiency. The search is coarse-to-fine in both the exploration of poses and the representation of the object class. Starting from training examples, we recursively learn a hierarchy of spatial arrangements of edge fragments, graded by their size (sparsity). The arrangements have no a priori semantic or geometric interpretation. Instead, they are selected to be \"decomposable\": Each can be split into two correlated subarrangements, each of which can be further divided, etc. As a result, the probability of an arrangement of size k appearing on an object instance decays slowly with k. We demonstrate this both theoretically and in experiments in which detection means finding a sufficient number of arrangements of various sizes. 1. Avant-Projet IMEDIA, INRIA-Rocquencourt, Domaine de Voluceau, B.P.105, 78153 Le Chesnay. Supported in p...","title":"Graded Learning for Object Detection","id":2240462,"url":"https://www.researchgate.net/publication/2240462_Graded_Learning_for_Object_Detection","names":["Francois Fleuret"],"references":{"239744010":"3D Object Recognition From Geometric Queries","221364881":"Neural Network-Based Face Detection","220499751":"A Computational Model for Visual Selection","3192800":"Example Based Learning for View-Based Human Face Detection","3669633":"Locating faces using statistical feature detectors","35758457":"Decision tree algorithms for handwritten digit recognition /","221110772":"Finding Faces in Cluttered Scenes Using Labeled Random Graph Matching.","221619244":"What Size Net Gives Valid Generalization?","220659647":"Feature Extraction Faces Using Deformable Templates","3192490":"An Active Testing Model for Tracking Roads in Satellite Images","243763580":"The Nature Of Statistical Learning Theory","220499641":"Shape Quantization And Recognition With Randomized Trees.","2464475":"Training Support Vector Machines: an Application to Face Detection"},"citedIn":{"2985901":"Design, analysis, and engineering of video monitoring systems: An approach and a case study","7591015":"Real Time Pattern Matching Using Projection Kernels","221305047":"Probabilistic Search for Object Segmentation and Recognition.","237897366":"Accurate Face Detection Based on Coarse Segmentation and Fine Skin Color Adaption","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","226861470":"Probabilistic Search for Object Segmentation and Recognition","11395425":"Learning to Recognize Three-Dimensional Objects","3854182":"Learning to recognize objects","237494073":"A Dissertation Presented","237211324":"Modeles Generatifs et Efficacite Algorithmique pour la Prediction"},"index":71}