{"abs":"In this paper a bimodal discrete urban road network design problem with bus and car modes is investigated. The problem consists of decision making for lane addition to the existing streets, new street constructions, converting some two-way streets to one-way streets, lane allocation for two-way streets, and the allocation of some street lanes for exclusive bus lanes. Two objectives are considered in the problem: maximization of consumer surplus, and maximization of the demand share of the bus mode. The interaction of automobile and bus flows are explicitly taken into account and a modal-split/assignment model is used to obtain the automobile and bus flows in the deterministic user equilibrium state. The main contribution of the paper lies in proposing a new network design problem that combines the road network design decisions with the decision making for bus networks. The problem is formulated as a mathematical program with equilibrium constraints. A hybrid of genetic algorithm and simulated annealing, a hybrid of particle swarm optimization and simulated annealing, and a hybrid of harmony search and simulated annealing are proposed to solve the problem. Computational results for a number of test networks are presented and investigated. KeywordsBimodal network design–Multi-objective–Elastic demand–Hybrid metaheuristics–Exclusive bus lanes","title":"Bi-objective bimodal urban road network design using hybrid metaheuristics","id":226282138,"url":"https://www.researchgate.net/publication/226282138_Bi-objective_bimodal_urban_road_network_design_using_hybrid_metaheuristics","names":["Elnaz Miandoabchi","Reza Zanjirani Farahani","W. Y. Szeto","Central European Journal of Operations Research"],"references":{"225471216":"Comparing Backhauling Strategies in Vehicle Routing Using Ant Colony Optimization","223954906":"Congestion pricing for multi-modal transportation systems","222597441":"Simultaneously optimizing link tolls and signal settings in a road network","236235921":"Particle swarm optimization. ISTE","222576578":"Reserve Capacity Model of Optimal Signal Control with User Equilibrium Route Choice","227739028":"Time‐Dependent Discrete Network Design Frameworks Considering Land Use","222303690":"A model of urban transport management","3865142":"Comparing inertial weights and Constriction factor in particle swarm optimization","242933111":"Transit Assignment for Congested Public Transport System: An Equilibrium Model","245306514":"Genetic-Algorithms-Based Approach for Bilevel Programming Models","233185640":"Strategies for road network design over time: Robustness under uncertainty","220568628":"On the Optimal Strongly Connected Orientations of City Street Graphs IV: Four East-West Avenues or North-South Streets.","227952644":"Multiobjective Bilevel Optimization for Transportation Planning and Management Problems","233740924":"A meta-heuristic approach for solving the Urban Network Design Problem","220413232":"Selecting an Optimum Configuration of One-Way and Two-Way Routes","223840836":"Pricing and logit-based mode choice models of a transit and highway system with elastic demand","284978543":"Transit network design and scheduling: a global review","23527667":"Benefit Distribution and Equity in Road Network Design","23526515":"Network design: Selection and design of links and facility location","220164617":"A New Heuristic Optimization Algorithm: Harmony Search","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","229893547":"Using hybrid metaheuristics for the one‐way and two‐way network design problem","242910307":"On the optimal strongly connected orientations of city street graphs. III. Three east–west avenues or north–south streets","248987340":"Models and algorithms for road network design: a review and some new developments. Transp Rev","5153106":"A Study on Network Design Problems for Multi-modal Networks by Probit-based Stochastic User Equilibrium","229577777":"Network design of one-way streets with simulated annealing","277158171":"Decision-Making For Roadway Lane Designation Among Variable Modes","222772184":"A hybrid approach for optimal design of signalized road network","223118163":"A continuous equilibrium network design model and algorithm for transit systems","23527623":"An equivalent continuously differentiable model and a locally convergent algorithm for the continuous network design problem. Transportation Research B, 35, 83-105","220561285":"Reserve capacity of signal-controlled road network","222438374":"An Efficient Approach to Solving the Road Network Equilibrium Traffic Assignment Problem","227202351":"Application of Ant System to network design problem","46491491":"Robust improvement schemes for road networks under demand uncertainty","265260777":"A STUDY ON SETTING-UP A METHODOLOGY AND CRITERION OF EXCLUSIVE BUS LANE IN URBAN AREA","238831124":"On the optimal strongly connected orientations of city street graphs. II: Two east-west avenues or North—South Streets","230663831":"Urban Transportation Networks: Equilibrium Analysis With Mathematical Programming Methods","222018064":"Capacity reliability of a road network: An assessment methodology and numerical results","23527499":"Reserve Capacity of a Signal-Controlled Road Network","226825259":"A simulaton-based multi-objective genetic algorithm (SMOGA) for BOT network design problem","5159039":"The multi-criteria road network design problem in an urban area","222845305":"Modeling transfer and non-linear fare structure in multi-modal network","235782457":"Alpha Reliable Network Design Problem","2499600":"Implicit Enumeration of Hyperpaths in a Nested Logit Model for Transit Networks","233741273":"Optimisation models for the urban parking pricing problem","223462888":"Stochastic multi-objective models for network design problem","233216223":"Scenario-based multi-objective AVI reader location models under different travel demand patterns","257161324":"A non-smooth model for signalized road network design problems","222822664":"Sensitivity analysis of stochastic user equilibrium flows in a bi-modal network with application to optimal pricing","223864213":"Transportation network improvement and tolling strategies: The issue of intergeneration equity","4037374":"A simulation-based mult-objective genetic algorithm (SMOGA) for transportation network design problem","243783492":"The Traffic Assignment Problem for Multiclass-User Transportation Networks","220532710":"On the Optimal Strongly Connected Orientations of City Street Graphs I: Large Grids","23526947":"Approximate Algorithms for the Discrete Network Design Problem","239424387":"Transport network optimization in the Dutch integral transportation study","32165677":"Selecting an Optimum Configuration of One-Way and Two-Way Routes Using Tabu Search","23527712":"Network pricing optimization in multi-user and multimodal context with elastic demand","238196990":"New Methodology for Optimizing Transit Priority at the Network Level","220413293":"A Doubly Dynamic Schedule-based Assignment Model for Transit Networks","233156267":"Optimizing Contraflow Scheduling Problem: Model and Algorithm","239665415":"Network Design and Transportation Planning: Models and Algorithms","260305228":"Evaluation of Bus-Exclusive Lanes","245307087":"Microscopic Traffic Simulation Model-Based Optimization Approach for the Contraflow Lane Configuration Problem","220413297":"Implicit Enumeration of Hyperpaths in a Logit Model for Transit Networks","222236395":"Transportation Network Equilibrium, Design and Aggregation: Key Developments and Research Opportunities","235782613":"Stochastic Transportation Network Design Problem with Spatial Equity Constraint","223163925":"Hybrid meta-heuristic algorithms for solving network design problem","220373626":"Reliability-Based Transit Assignment for Congested Stochastic Transit Networks","245063234":"An efficient algorithm for optimal design of area traffic control with network flows","222241765":"Solution algorithm for the bi-level discrete network design problem","246814058":"Methods of Combining Modal Split and Equilibrium Assignment Models","3623274":"Particle swarm Optimization","222313890":"Heuristics for urban road network design: Lane layout and signal settings","226128924":"Very large street routing problem with mixed transportation mode","226165021":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","23526785":"Time-dependent transport network improvement and tolling strategies","239061716":"An Algorithm for the Discrete Network Design Problem","23527050":"Comparative tests of multimodal traffic equilibrium methods","257153825":"Multi-objective discrete urban road network design","242356870":"Adaptation In Natural And Artificial Systems","226338952":"Route stability in vehicle routing decisions: A bi-objective approach using metaheuristics","273453883":"Particle Swarm Optimization","222237383":"A subgradient optimization model for continuous road network design problem","225615626":"Two-way road network design problem with variable lanes","238836932":"An Efficient Method for Computing Traffic Equilibria in Networks With Asymmetric Transportation Costs","23527199":"A General Bilevel Linear Programming Formulation of the Network Design Problem,Transportation Research, vol. 22B, pp. 311-318","235890166":"Music-Inspired Harmony Search Algorithm: Theory and Applications","222658873":"Transit network design and scheduling: a global review. Transp Res Part A Policy Pract","225837960":"Bilevel programming in traffic planning: Models, methods and challenge. Journal of Global Optimization, 7, 381-405","222648890":"Bilevel programming applied to optimising urban transportation"},"citedIn":{"257196405":"A review of urban transportation network design problems","225099401":"Hybrid Evolutionary Metaheuristics for Concurrent Multi-Objective Design of Urban Road and Public Transit Networks","241733600":"Road Network Equilibrium Approaches to Environmental Sustainability","286653053":"The nonlinear equation system approach to solving dynamic user optimal simultaneous route and departure time choice problems","259294296":"Overview of Harmony Search algorithm and its applications in Civil Engineering","281231823":"Mixed network design using hybrid scatter search","271668540":"A bi-objective optimization approach for exclusive bus lane selection and scheduling design","270854090":"Time-dependent discrete road network design with both tactical and strategic decisions","276314551":"A nonlinear equation system approach to the dynamic stochastic user equilibrium simultaneous route and departure time choice problem","220291504":"Optimizing reserve capacity of urban road networks in a discrete Network Design Problem","257153825":"Multi-objective discrete urban road network design","259553963":"The Chemical Reaction Optimization Approach to Solving the Environmentally Sustainable Network Design Problem","257632396":"A Sustainable Road Network Design Problem with Land Use Transportation Interaction over Time","278014117":"A bi-objective turning restriction design problem in urban road networks","278323247":"A bi-level decision support system for uncertain network design with equilibrium flow","263162646":"Service Network Design for Rail-Mounted Vehicles","262677554":"Hybrid large neighborhood search for the bus rapid transit route design problem","275060511":"An intersection-movement-based stochastic dynamic user optimal route choice model for assessing network performance","260608179":"Transit assignment: Approach-based formulation, extragradient method, and paradox","271743950":"Analysis of interaction among land use, transportation network and air pollution using stochastic nonlinear programming","269936555":"Time-dependent transportation network design that considers health cost","273024536":"Bi-Objective Optimization Approach for Exclusive Bus Lane Scheduling Design"},"index":719}