{"abs":"In this paper we present an efficient and effective method of using surrogate approximations to explore the design space and capture the Pareto frontier during multiobjective optimization. The method employs design of experiments and metamodeling techniques (e.g., response surfaces and kriging models) to sample the design space, construct global approximations from the sample data, and quickly explore the design space to obtain the Pareto frontier without specifying weights for the objectives or using any optimization. To demonstrate the method, two mathematical example problems are presented. The results indicate that the proposed method is effective at capturing convex and concave Pareto frontiers even when discontinuities are present. After validating the method on the two mathematical examples, a design application involving the multiobjective optimization of a piezoelectric bimorph grasper is presented. The method facilitates multiobjective optimization by enabling us to efficiently and effectively obtain the Pareto frontier and identify candidate designs for the given design requirements.","title":"Efficient Pareto Frontier Exploration using Surrogate Approximations","id":227163790,"url":"https://www.researchgate.net/publication/227163790_Efficient_Pareto_Frontier_Exploration_using_Surrogate_Approximations","names":["Benjamin Wilson","David J Cappelleri","Timothy W. Simpson","Mary Frecker","Optimization and Engineering"],"references":{"220045467":"In: Multicriteria optimization for engineering design. Design Optimization","227090446":"Haftka, R.T.: Multidisciplinary aerospace design optimization: Survey of recent developments. Structural Optimization 14, 1-23","216301102":"Computationally inexpensive metamodel assessment strategies. AIAA J","229754557":"Defectiveness of Weighting Method in Multicriterion Optimization of Structures","247741576":"The Ability of Objective Functions to Generate Non-Convex Pareto Frontiers","2321134":"Local Approximation Of The Efficient Frontier In Robust Design","244423454":"Design by Shopping: A New Paradigm","220689140":"Microsystem Technology and Microrobots","2562483":"Enhanced Interactive Multiobjective Optimization Procedure: Local Preference Functions And Iterative Decision Making","227085212":"Approximation Concepts for Optimum Structural Design -A Review","236843208":"Kriging Models for Global Approximation in Simulation-Based Multidisciplinary Design Optimization","216756605":"Orthogonal Arrays for Computer Experiments, Integration and Visualization","38363487":"The Design and Analysis of Computer Experiments","246307705":"Genetic Algorithms with Multiple Objectives","240129415":"Multicriteria Optimization in Engineering: A Tutorial and Survey","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","243778009":"A note on weighted criteria methods for compromise solutions in multi-objective optimization","2675063":"A Comparison Of Approximation Modeling Techniques: Polynomial Versus Interpolating Models","236822466":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","265457357":"An efficient approach to multicriteria optimum design problems","250754768":"9 Computer experiments","235353891":"A Method to Determine Optimal Relative Weights for Pareto Solution Sets","2321478":"Local Approximation of the Efficient Frontier in Robust Design","2460803":"Normal-Boundary Intersection: A New Method for Generating the Pareto Surface in Nonlinear Multicriteria Optimization Problems","247065759":"Optimal Design of Smart Tools for Minimally Invasive Surgery","226165021":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","2556033":"Interactive Physical Programming: Tradeoff Analysis and Decision Making in Multicriteria Optimization","247075221":"Optimization Large Systems via Optimal Multicriteria Component Assembly","2752581":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","246900871":"Multiobjective Optimization Design with Pareto Genetic Algorithm","238191107":"Approximating Pareto Curves Using the Hyper-Ellipse","240129892":"Multiobjective Urban Planning Using Genetic Algorithm","227446330":"Soviet Multi-Objective Mathematical Programming Methods: An Overview","226610749":"A Closer Look at Drawbacks of Minimizing Weighted Sums of Objectives for Pareto Set Generation in Multicriteria Optimization Problems","225516876":"Metamodels for Computer-based Engineering Design: Survey and recommendations","224840024":"Response Surface Methodology (RSM): Process and Product Optimization Using Designed Experiments","245719578":"Comparison of Two Multiobjective Optimization Techniques with and within Genetic Algorithms","252598193":"Optimal Design of a PZT Bimorph Actuator for Minimally Invasive Surgery"},"citedIn":{"242330483":"Adaptive Hybrid Surrogate Modeling for Complex Systems","229550759":"A non‐dominance‐based online stopping criterion for multi‐objective evolutionary algorithms","255704886":"A surrogate-based multiobjective metaheuristic and network degradation simulation model for robust toll pricing","234266872":"Multiple surrogates and error modeling in optimization of liquid rocket propulsion components","224330064":"Automated Solution Selection in Multi-Objective Optimisation","255067686":"Metamodeling of Combined Discrete/Continuous Responses","261492611":"Jacobian matrix singularity based pareto front identification for multi-objective problems","242330475":"Surrogate Modeling of Complex Systems Using Adaptive Hybrid Functions","242330476":"A Comprehensive Measure of The Energy Resource Potential of A Wind Farm Site","291007302":"Managing Uncertainty of Product Data","280329899":"Semidefinite Approximations of Projections and Polynomial Images of SemiAlgebraic Sets","240830586":"Robust Design and Reliability-based Design Optimization","268186591":"Review of Metamodeling Techniques for Product Design with Computation- intensive Processes","267502558":"Multi-Objective Optimization of Film-Cooling Holes Considering Heat Transfer and Aerodynamic Loss","222814327":"Recent advances in surrogate-based optimization","262158738":"An Effective implementation of a symbolic-numeric cylindrical algebraic decomposition for quantifier elimination","258806616":"Multi-Objective Optimization of a Row of Film Cooling Holes Using an Evolutionary Algorithm and Surrogate Modeling","267644879":"A Design Methodology Enabling the Efficient High-Fidelity Design of Combined Cycle Power Plants","220825623":"An Evolutionary Algorithm with Spatially Distributed Surrogates for Multiobjective Optimization","261726118":"Approximating Pareto Curves using Semidefinite Relaxations","228858082":"A Kriging Metamodel Assisted Multi-Objective Genetic Algorithm for Design Optimization","238184565":"An Efficient Pareto Set Identification Approach for Multi-Objective Optimization on Black-Box Functions","229897716":"Enhanced multi‐objective optimization of a dimpled channel through evolutionary algorithms and multiple surrogate methods","259182650":"Multiobjective Design Optimization Using Multiple Adaptive Spatially Distributed Surrogates","221580413":"Multi-objective Particle Swarm Optimization Method Based on Fitness Function and Sequence Approximate Model","245425898":"Building Ecien t Response Surfaces of Aerodynamic Functions with Kriging and Cokriging","257153311":"Multi-objective simulation optimization using data envelopment analysis and genetic algorithm: Specific application to determining optimal resource levels in surgical services","27541738":"Using parameterized efficient sets to model alternatives for systems design decisions","258568998":"Cokriging for Robust Design Optimization","274969906":"Multi-objective optimization based on meta-models of an aeronautical hub including the ductile damage constraint","255661935":"Multi-Objective Design Exploration for Aerodynamic Configurations","260125143":"Engineering Design and Decision Making Models","271943022":"Applying the approximation method PAINT and the interactive method NIMBUS to the multiobjective optimization of operating a wastewater treatment plant","239545627":"Towards a conceptual design explorer using metamodeling approaches and constraint programming","242347820":"A multi-objective analysis of a special switched reluctance","221643625":"Application-aware management parallel simulation collections","273898764":"A survey on handling computationally expensive multiobjective optimization problems using surrogates: non-nature inspired methods","30861493":"Active/Passive Optimization of Helicopter Rotor Blades for Improved Vibration, Noise, and Performance Characteristics.","4035161":"RAF: a dynamic and efficient approach to fusion for multitarget tracking in CCTV surveillance","235709801":"Connectedness, regularity and the success of local search in evolutionary multi-objective optimization","226796771":"Evolutionary-based Meta-modelling: The Relevance of Using Approximate Models in Hydroinformatics","237384522":"Fuzzy Clustering Based Hierarchical Metamodeling for Design Optimization","256919100":"Interval multi-objective optimisation of structures using adaptive Kriging approximations. Comput Struct","271194692":"Implementation of metamodels in ship design","259784207":"Efficient Modelling and Simulation of Random Fields","44260053":"Optimization Formulation Based on Limited Data and RSM: An Approximation","51937890":"Demonstrating the Applicability of PAINT to Computationally Expensive\nReal-life Multiobjective Optimization","27522014":"An Efficient Robust Concept Exploration Method and Sequential Exploratory Experimental Design","224747233":"TEAM Workshop Problem 25: A Multiobjective Analysis","258802149":"Characterizing Human Spacecraft Safety and Operability Through a Minimum Functionality Design Methodology","283704417":"Review: population methods of Pareto set approximation in multi-objective optimization problem","279970619":"Exploring trade-offs in frequency allocation in a transit network using bus route patterns: Methodology and application to large-scale urban systems","30515295":"SURFACES DE REPONSE PAR KRIGEAGE POUR L\u0027OPTIMISATION DE FORMES AERODYNAMIQUES.","280932143":"An efficient robust design optimization approach using advanced surrogate models","277196050":"Robust Optimization and Sensitivity Analysis with Multi-Objective Genetic Algorithms: Single- and Multi-Disciplinary Applications","228666426":"Robust design optimization","225964502":"Minimum Effort Approximation of the Pareto Space of Convex Bi-Criteria Problems","242234834":"AD VANCED METHODS OF STOCHASTIC AND OPTIMIZATION IN INDUSTRIAL APPLICATIONS","225622230":"Knowledge Incorporation in Multi-objective Evolutionary Algorithms","226664743":"Approximation Methods in Multiobjective Programming","245426181":"Statistical Improvement Criteria for Use in Multiobjective Design Optimization","30513529":"Exploration en conception mécanique préliminaire des compromis entre contraintes architecturales véhicule et performances vibro-acoustiques agrégées","261228091":"Metamodel multi-objective optimization tool for mechatronic system design","228611339":"Composing Tradeoff Models for Multi-Attribute System-Level Decision Making","257524212":"Approximation assisted optimization of headers for new generation of air-cooled heat exchangers","257253115":"Trade-off analysis in multi-objective optimization using Chebyshev orthogonal polynomials","220741511":"A Pareto Following Variation Operator for Fast-Converging Multiobjective Evolutionary Algorithms","225691072":"Improving multi-objective genetic algorithms with adaptive design of experiments and online metamodeling","220950418":"Result reuse in design space exploration: A study in system support for interactive parallel computing.","235013304":"Using Application-Domain Knowledge in the Runtime Support of Multi-Experiment Computational Studies","245435934":"Comparison of Several Optimization Strategies for Robust Turbine Blade Design","223171725":"A novel multi-objective optimization method based on an approximation model management technique","283452453":"Multi-objective simulation optimization for selection and determination of order quantity in supplier selection problem under uncertainty and quality criteria","225763505":"Distributed optimization using virtual and real game strategies for multi-criterion aerodynamic design","4108793":"Model-based engineering design for space missions","286441429":"Weight Optimization of Mono Parabolic Leaf Spring","220308712":"A Trust-Region Algorithm for Bi-Objective Stochastic Optimization","216301102":"Computationally inexpensive metamodel assessment strategies. AIAA J","257335194":"Adaptive heuristic search algorithm for discrete variables based multi-objective optimization","225687230":"A computationally efficient metamodeling approach for expensive multiobjective optimization. Optim Eng 9:37-67","267865914":"Kriging-pareto front approach for the multi-objective exploration of metamaterial topologies","261348956":"The sample average approximation method for multi-objective stochastic optimization","6313904":"Design search and optimization in aerospace engineering","226634838":"Decision Making on Pareto Front Approximations with Inherent Nondominance","4074983":"Connectedness, regularity and the success of local search in evolutionary multi-objective optimization","34970313":"System architecture analysis and selection under uncertainty /","257335176":"Sequential approximate multi-objective optimization using radial basis function network. Struct Multidiscip Optim","259182480":"Multi-objective Optimization using Surrogate Assisted Evolutionary Algorithm","262841416":"Comparative analysis of Direct Adaptive-NSGA-II \u0026 NSGA-II Optimization Algorithms","237453504":"Review of Metamodeling Techniques in Support of Engineering Design Optimization","221528798":"Pareto Front Approximation with Adaptive Weighted Sum Method in Multiobjective Simulation Optimization.","224157361":"A Parallel Multiobjective Efficient Global Optimization: The Finite Element Method in Optimal Design and Model Development","254463450":"An effective implementation of a symbolic-numeric cylindrical algebraic decomposition for optimization problems","273192376":"Effectiveness of meta-models for multi-objective optimization of centrifugal impeller","270674131":"Zigzag Search for Continuous Multiobjective Optimization","222544049":"Response Surface Approximation of Pareto Optimal Front in Multi-objective Optimization","244348258":"Sampling Strategies for Computer Experiments: Design and Analysis","220677585":"Graphical and text-based design interfaces for parameter design of an I-beam, desk lamp, aircraft wing, and job shop manufacturing system","220199655":"An efficient multi-objective optimization method for black-box functions using sequential approximate technique. Appl Soft Comput","274461095":"Direct zigzag search for discrete multi-objective optimization"},"index":720}