{"abs":"The multivariate normal distribution is easy to implement in Mathematica. This article presents self-contained code which allows one to specify any multidimensional normal distributions. Its use is illustrated with examples and applications of the bivariate and trivariate normals. Random number generation is also covered.","title":"The Multivariate Normal Distribution","id":261662178,"url":"https://www.researchgate.net/publication/261662178_The_Multivariate_Normal_Distribution","names":["Alan Izenman","Technometrics"],"references":{"222372677":"Reduced-rank regression for the multivariate linear model. J Multivar Anal 5:248-264","241721876":"Simultaneous Confidence Regions for the Frequency Analysis of Multiple Time Series"},"citedIn":{"45650622":"Improving Biocatalyst Performance by Integrating Statistical Methods into Protein Engineering","226614152":"Application of numerical interval analysis to obtain self-validating results for multivariate probabilities in a massively parallel environment","3193405":"Face recognition using line edge map","224706411":"M-ary NCFSK with S+N selection diversity in correlated Rayleigh fading","222376785":"On the dynamics of asset prices and portfolios in a multiperiod CAPM","220089100":"On the number of local minima for the multidimensional assignment problem","3267618":"An Empirical Method of Dynamic Oligopoly Behavior Analysis in Electricity Markets","3084859":"Capacity bounds via duality with applications to multiple-antenna systems on flat-fading channels","2428988":"Calculating Value-at-Risk","239019557":"Approximations to Multivariate Normal Rectangle Probabilities Based on Conditional Expectations","2466874":"Comparison of Methods for the Computation of Multivariate Normal Probabilities","225143631":"Actuarial modelling of longitudinal claims data through GAMM’s: some methodological results","2199559":"Using error correction to determine the noise model","232396285":"Asymptotic sharpness of product-type inequalities for maxima of random variables with applications in multiple comparisons","220534541":"Revenue Management Games: Horizontal and Vertical Competition","241721920":"Bayes Optimal Designs for Two and Three-Level Factorial Experiments","220301065":"Comparison of hyperbolic and constant width simultaneous confidence bands in multiple linear regression under MVCS criterion","245186228":"Efficient vector outcrossing analysis of the excursion of a moored vessel","37999721":"Sequential optimization through adaptive design of experiments","227012525":"‘A powerful alternative to Williams’ test with application to toxicological dose-response relationships of normally distributed data","222553964":"On the exact distribution of linear combinations of order statistics from dependent random variables","239858298":"Useful Bounds on the Expected Maximum of Correlated Normal Variables","4872315":"A model for analyzing multi-channel distribution systems","238865423":"A New Approach to Determine the Pilot Sample Size in Two-Stage Sampling","226659254":"Modeling Globalization: A Spatial Econometric Analysis","258856792":"A characterization of multivariate normality through univariate projections","233206751":"On Some Association Measures in the Multivariate Normal Distribution","224676185":"BER of BFSK with Postdetection Switched Combining in Correlated Rayleigh Fading","260710327":"Novel Representations for the Equicorrelated Multivariate Non-Central Chi-Square Distribution and Applications to MIMO Systems in Correlated Rician Fading","2697239":"Semidefinite Relaxations, Multivariate Normal Distributions, and Order Statistics","232831455":"Bounds on the Bivariate Normal Distribution Function","220243743":"Copula-Based Multivariate Input Models for Stochastic Simulation","221289329":"New Representations for the Multivariate Weibull Distribution with Constant Correlation","223177484":"Inference for the model of several treatments and a control","254312811":"Recursive Integration Methodologies with Applications to the Evaluation of Multivariate Normal Probabilities","3847801":"Value-at-risk with heavy-tailed risk factors","240638480":"Experimental Results for Kuka Repeatability Measures and Comparison with the Stochastic Ellipsoid Approach","2532961":"Makin\u0027 Mixtures or A Comparison of Several Popular Likelihood-Based Models for Clustering and Other Applications","225202980":"Hybrid Estimation for Stochastic Piecewise Linear Systems","228291026":"Pricing CDOs with State Dependent Stochastic Recovery Rates","24060709":"On DS-optimal Design Matrices with Restrictions on Rows or Columns","230583794":"New Expectation-Maximization segmentation pipeline in Slicer 3","2134125":"Level crossings and other level functionals of stationary Gaussian processes","242986036":"The role of the covariance matrix in the least-squares estimation for a common mean","225422624":"Optimal Testing for Equicorrelated Linear Regression Models","222334225":"Some Remarks on the Supermodular Order","15391934":"How Many Subjects to Screen? A Practical Procedure for Estimating Multivariate Normal Probabilities for Correlated Variables","221069177":"Determination of the Repeatability of a Kuka Robot Using the Stochastic Ellipsoid Approach.","23631167":"Simultaneous Estimation in a Restricted Linear Model,","23524158":"Globalisation and Wage Differentials: A Spatial Analysis","233100221":"A Sequential Multi-Hypothesis Test for the Mean Function of a Discrete-Time Gaussian Process","5523976":"Joint One-Sided and Two-Sided Simultaneous Confidence Intervals","4082787":"Pricing of multi-product bundles to match supply and demand","5370894":"multcomp: Simultaneous Inference in General Parametric Models. URL","225199411":"On Two-Stage Comparisons with a Control Under Heteroscedastic Normal Distributions","228751299":"NORMAL MODE ANALYSIS AND GAUSSIAN NETWORK MODEL","12814498":"Joint Multipoint Linkage Analysis of Multivariate Qualitative and Quantitative Traits. I. Likelihood Formulation and Simulation Results","250755219":"Ch. 15. Effective sample sizes for T 2 control charts","24063244":"Multivariate normal integrals and contingency tables with ordered categories","221608784":"Improving the Exploration Strategy in Bandit Algorithms","13882548":"High-Resolution Random Mesh Algorithms for Creating a Probabilistic 3D Surface Atlas of the Human Brain","224154420":"Novel Simple Forms for Multivariate Nakagami-m Distributions with Generalized Correlation","23634182":"A remark on quadrant normal probability in high dimensions","2433616":"A Spectral Estimator of Arma Parameters from Thresholded Data","241721885":"Testing and Selecting for Equivalence With Respect to a Control","220172137":"Sufficient conditions for fast quasi-Monte Carlo convergence","260673022":"Novel Representations for the Bivariate Rician Distribution","4849717":"Rectangular and Wedge-Shape Multivariate Normal Probabilities","228608479":"Design for Postponement: A Comprehensive Characterization of Its Benefits Under Unknown Demand Distributions","220196704":"Hedging risks with interruptible load programs for a load serving entity","260673014":"New Representations for the Gaussian Class Multivariate Weibull Distribution with Constant Correlation and Applications","4204226":"Statistical timing analysis with two-sided constraints","238116018":"The Division of Labour within the Household: Is There any Escape from Traditional Gender Roles?","2337447":"Computing Multivariate Normal Probabilities Using Rank-1 Lattice Sequences","222530511":"Random assignment problems","227013386":"Evaluating Nearly Singular Multinormal Expectations with Application to Wave Distributions","47706694":"Comportamiento del estimador máximo verosímil para un parámetro k-dimensional en modelos con restricciones","220177291":"Collusion-Resistant Video Fingerprinting for Large User Group.","220225972":"Optimum crossing-point estimation of a sampled analog signal with a periodic carrier","24052730":"On multivariate Gaussian tails","249789045":"MINIMUM ERROR CONTRAST ENHANCEMENT","24060406":"A geometric approach to finite sample and large deviation properties in two-way ANOVA with spherically distributed error vectors","224951793":"Factorial graphical lasso for dynamic networks","223111638":"Comparison of a simple approximation for multinormal integration with an importance sampling-based simulation method","223682507":"Scale-invariant clustering with minimum volume ellipsoids","222000036":"Joint demand fulfillment probability in a multi-item inventory system with independent order-up-to policies","228139782":"A Scale Invariant Clustering using Minimum Volume Ellipsoids","3162287":"Performance of Two Dual-Branch Postdetection Switch-and-Stay Combining Schemes in Correlated Rayleigh and Rician Fading","223652848":"Some results on the multivariate truncated normal distribution","238865048":"Constant width simultaneous confidence bands in multiple linear regression with predictor variables constrained in intervals","45858334":"A central limit theorem via differential equations","263252246":"Monte Carlo Evaluations of Multivariate Normal Probabilities","23644622":"On inadmissibility of Hotelling T2-tests for restricted alternatives","237387415":"DEPENDENCE IN STOCHASTIC SIMULATION","23635930":"On the exact distribution of the maximum of dependent random variables","222768625":"Multistage methodologies for comparing several treatments with a control","220972945":"Novel representations for the multivariate non-central chi-square distribution with constant correlation and applications","220442527":"Stochastic Comparison of Random Vectors with a Common Copula","24063443":"Selective influence through conditional independence","49694772":"A performance evaluation framework for association mining in spatial data","259391408":"Control charts for time series","220172249":"Delayed Curse of Dimension for Gaussian Integration","222192633":"A hidden Markov model for modelling long-term persistence in multi-site rainfall time series 1. Model calibration using a Bayesian approach. J Hydrol 275(1-2):12-26","46494221":"Max-type rank tests, U-tests, and adaptive tests for the two-sample location problem -- An asymptotic power study","251563063":"CDO2 Pricing Using Gaussian Mixture Model with Transformation of Loss Distribution","228853608":"Early Statistical Timing Analysis with Unknown Within-Die Correlations","220087251":"Performance Analysis of Generalized Selection Combining in Generalized Correlated Nakagami-m Fading.","227631455":"Methods for Characterizing Variability and Uncertainty: Comparison of Bootstrap Simulation and Likelihood‐Based Approaches","4742790":"Minimum Area Confidence Set Optimality for Confidence Bands in Simple Linear Regression","222670224":"On Ranking and Selection from Independent Truncated Normal Distributions","220452342":"Regular Simplices and Gaussian Samples.","34735300":"Dependence in stochastic simulation models /","23644606":"Inequalities associated with intra-inter-class correlation matrices","228722548":"Hybrid Method for Quantifying and Analyzing Bayesian Belief Nets","229121904":"Fast Convergence of Quasi-Monte Carlo for a Class of Isotropic Integrals. Math. Comp., 70, 233, 297-306","228632440":"Rare event simulation techniques: An introduction and recent advances","232865084":"Sequential estimation via replicated piecewise stopping number in a tow—parameter exponential family of distributions","242997917":"Optimal simultaneous confidence bands in simple linear regression","2786498":"Modeling and Generating Random Vectors with Arbitrary Marginal Distributions and Correlation Matrix","23631232":"Conditional Iterative Proportional Fitting for Gaussian Distributions","242997905":"On principal points for location mixtures of spherically symmetric distributions","242961040":"Developments on MTP 2 properties of absolute value multinormal variables with nonzero means","2390217":"Portfolio Value-at-Risk with Heavy-Tailed Risk Factors","23644566":"Semi-parametric multivariate modelling when the marginals are the same","30449455":"Les tests de normalité de Lhoste","225270377":"Asymptotics and Bounds for Multivariate Gaussian Tails","228290207":"CDO Squared Pricing Using Gaussian Mixture Model with Transformation of Loss Distribution","239285063":"Some c-sample rank tests of homogeneity against umbrella alternatives with unknown peak","221497397":"Model Selection and Stability in k-means Clustering.","220304934":"Simple Expressions for the SER of Dual MRC in Correlated Nakagami-q (Hoyt) Fading","3662142":"A simple upper bound for blocking probabilities in large multi-rateloss networks","2468655":"Comparison of Methods for the Computation of Multivariate t Probabilities","224712814":"Early Analysis of Timing Margins and Yield","223130689":"Inequalities for stochastic models via supermodular orderings","243049841":"A probit model for multivariate random length ordinal data","225396832":"Reliability of redundant ductile structures with uncertain system failure criteria","227149466":"More General Weak and Strong Laws and the Delta Theorem","24080510":"Intertemporal stability of the European credit spread co-movement structure1","252489240":"A family of minimax rates for density estimators in continuous time","220576317":"The asymptotic efficiency of randomized nets for quadrature","259215976":"On the Expected Absolute Value of a Bivariate Normal Distribution","23794251":"Using principal component analysis in process performance for multivariate data","227167914":"Simulation of Time Series of Concentration Fluctuations in Atmospheric Dispersion Using a Correlation-distortion Technique","222857323":"On simulating exchangeable sub-Gaussian random vectors","220210179":"Parametric Sensitivity Analysis Using Large-Sample Approximate Bayesian Posterior Distributions","220534784":"Information Transparency of Business-to-Business Electronic Markets: A Game-Theoretic Analysis","23634521":"Verret, F.: The TP2 ordering of Kimeldorf and Sampson has the normal-agreeing property. Statistics and Probability Letters 57, 387-391","247334794":"A Monte Carlo Comparison of Three Tests of the Holland Hexagon","5613920":"Stochastic nonlinear image restoration using the wavelet transform","46479346":"Household Division of Labor : Is There Any Escape From Traditional Gender Roles ?","222006273":"Correlational kinetics I. General theory","249729497":"A Performance Analysis of the Minimax Multivariate Quality Control Chart","3337993":"Variations-Aware Low-Power Design and Block Clustering With Voltage Scaling","228664476":"USING FUZZY KNOWLEDGE OF A NUISANCE PARAMETER FOR HYPOTHESIS TESTING","233006813":"The Control Chart For Individual Observations From A Multivariate Non-Normal Distribution","226310205":"Window Double Barrier Options","3434357":"Performance of S + N Selection Diversity Receivers in Correlated Rician and Rayleigh Fading","255668350":"On the expected number of zeros of a random harmonic polynomial","224254494":"An analytical model for performance yield of nanoscale SRAM accounting for the sense amplifier strobe signal","254287468":"Testing Homogeneity of Uniform Scale Distributions Against Two-Sided and One-Sided Alternatives","228539098":"Hypothesis testing for an exchangeable normal distribution","2373985":"Action-Reaction Learning: Analysis and Synthesis of Human Behaviour","5213449":"Nonparametric Tests for Positive Quadrant Dependence","44286437":"A note on finding peakedness in bivariate normal distribution using Mathematica","220367972":"Probabilistic Abstract Interpretation of Imperative Programs using Truncated Normal Distributions","221525618":"Introduction to simulation input modeling","23634479":"Remarks on compound Poisson approximation of Gaussian random sequences","38348569":"Asymptotic comparison of step-down and step-up multiple test procedures based on exchangeable test statistics","238865261":"A Bayesian analysis for the multivariate point null testing problem","248867206":"Geometric Inequalities in Option Pricing","3317094":"Statistics of the RSS estimation algorithm for Gaussian measurement noise","228850939":"NUMERICAL COMPUTATION of HIGH DIMENSIONAL INTEGRALS for MULTIPLE COMPARISON PROBLEMS","3571567":"A New Method for Fast Carrier Phase Ambiguity Estimation","228973304":"Multivariate Design for Mass Customization of Consumer Products","239427867":"A Personal Tribute to Milton Sobel: Selecting the Best Treatment","233205433":"Surveillance of the covariance matrix of multivariate nonlinear time series","220569669":"On polynomial complexity of a stochastic algorithm for mixed zero-one programs","6796549":"Large-Sample Bayesian Posterior Distributions for Probabilistic Sensitivity Analysis","29844645":"Cluster analysis on uncertain data","4128093":"Performance analysis of the sample and compare receiver schemes for indoor high speed UWB system","226700518":"On the run length of a Shewhart chart for correlated data. Statistical Papers","254641739":"A Probabilistic Measure of Risk","226928364":"MCQMC Methods for Multivariate Statistical Distributions","28325084":"A Bayesian semiparametric latent variable model for binary, ordinal and continuous response","222285395":"Remarks on domination of maxima","4959014":"Ordering optimal proportions in the asset allocation problem with dependent default risks","245495759":"EWMA Control Charts for Monitoring Optimal Portfolio Weights","226343443":"Life Anuities with Stochastic Survival Probabilities: A Review","5207328":"A note on pseudolikelihood constructed from marginal densities","23631385":"Properties of Likelihood Inference for Order Restricted Models","4169547":"Variations-aware low-power design with voltage scaling. DAC’ 05","224396820":"State Estimation for Stochastic Linear Hybrid Systems with Continuous-State-Dependent Transitions: An IMM Approach","220576848":"Fast convergence of quasi-Monte Carlo for a class of isotropic integrals","3226439":"Early Analysis and Budgeting of Margins and Corners Using Two-Sided Analytical Yield Models","220428884":"Predicting properties of congestion events for a queueing system with fBm traffic.","242736384":"SIMULATING AND ANALYZING SPATIAL SKEW NORMAL RANDOM FIELDS","242393354":"On the analytical-numerical valuation of the American option","238716742":"On Some Characteristics of the Bivariate T-Distribution","225661965":"Defect detection in \nC\n-scan maps","35702184":"A statistical model of the area cleared by a landmine removal vehicle using real-time kinematic differential GPS and inertial sensing technologies /","244444955":"The Moment-Generating Function of the Minimum of Bivariate Normal Random Variables","232941161":"A New Multivariate Process Capability Vector","242997751":"Association of progressively Type-II censored order statistics","228670524":"A Multivariate Extension of Equilibrium Pricing Transforms: The Multivariate Esscher and Wang Transforms for Pricing Financial and Insurance Risks","31204419":"An Easy and Accurate Regression Model for Multiparty Electoral Data","222536924":"The impact of multiperiod planning horizons on portfolios and asset prices in a dynamic CAPM. J Math Econ 42, 565-593","221289135":"Novel Simple Forms for Multivariate Rayleigh and Rician Distributions with Generalized Correlation.","233179204":"A comparison of one-stage and two-stage Bayesian processes in engineering decision-making","243044830":"Application of Multiple Imputation in Analysis of Data from Clinical Trials with Treatment Related Dropouts","242469846":"Selection Sequentielle en Environnement Aleatoire Appliquee a l\u0027Apprentissage Supervise","2120071":"Default priors for Gaussian processes. Ann Stat","242442200":"Normal Distribution characterization s with applications Lecture Notes in Statistics 1995, Vol 100 Revised June 7, 2005 W lodzimierz Bryc Department of Mathematics University of Cincinnati P O Box 210025 Cincinnati, OH 45221-0025 e-mail","228734473":"Linear conic programming","226169559":"Simulation input data modeling","2300813":"Parallel neural net training on the KSR1","24017630":"Estimation of multivariate probit models by exact maximum likelihood","236268965":"Optimal Prediction of Forecast Error Covariances through Singular Vectors","241734105":"A Multivariate Williams-Type Trend Procedure","38140912":"Recursive integration methodologies with statistical applications","4872179":"An algorithm based on discrete response regression models suitable to correct the bias of non-response in surveys with several capture tries","222275716":"Dependence structures of multivariate Bernoulli random vectors","240644076":"Correlation Analysis of Ordered Observations From a Block-Equicorrelated Multivariate Normal Distribution","3885959":"Variance reduction techniques for value-at-risk with heavy-tailed risk factors","233293401":"Positive dependence of random variables with a common marginal distribution","24063697":"Uniform Test Assembly","220990098":"The Packet Delay in a MPLS Network Using \"1+1 Protection\"","222376702":"Autoregressive to anything: Time-series input processes for simulation","233331287":"On the connection between orthant probabilities and the first passage time problem","23505063":"Fair Value of Whole-Farm and Crop-Specific Revenue Insurance","24008367":"Making the best of best-of","50868941":"The Adjustment of the Type I Error Rate in Noninferiority Trials with -Margin Approach: Each of Two Different New Drugs is Approved with Two Independent Trials with the Same Active Control","237302253":"Statistical Applications in Genetics and Molecular Biology","1935827":"A traffic lights approach to PD validation","254439167":"Testing for selectivity in the dependence of random variables on external factors","238515682":"Degraded systems with multiple performance parameters subject to shocks","49733411":"Robust joint analysis allowing for model uncertainty in two-stage genetic association studies","222580882":"On the Existence of a Unique Price Equilibrium for Models of Product Differentiation","23744177":"Crop Yield and Price Distributional Effects on Revenue Hedging","242972576":"DS-optimal designs in one way ANOVA","23644853":"Total positivity order and the normal distribution","255659744":"Life insurance mathematics with random life tables","23942322":"The Decision of When to Buy a Frequently Purchased Good: A Multi-Period Probit Model","225385609":"Dual inexact fuzzy chance-constrained programming for planning waste management systems","46463778":"Land Retirement Program Design in the Presence of Crop Insurance Subsidies","221138121":"Multivariate Fairly Normal Traffic Model for Aggregate Load in Large-Scale Data Networks.","24049283":"A Comparison of Stock Market Mechanisms","254297797":"The likelihood approach for comparison of medical diagnostic system with multiple binary tests","46494519":"Expansions for the multivariate normal","233374236":"Capability Index Using Principal Components Analysis","254287582":"Correlation Analysis of Extreme Observations from a Multivariate Normal Distribution","220972764":"New simple solutions for the bivariate Rician PDF and CDF","254814408":"An Introduction to the Bivariate T-Distribution","2363869":"Modeling and Generating Multivariate Time Series with Arbitrary Marginals Using a Vector Autoregressive Technique","228487265":"The Stability of Simulation Based Estimation of the Multiperiod Multinominal Probit Model with Individual specific Covariates"},"index":725}