{"abs":"The budget network design problem and fixed-charge network design problem imply different economic pursuits on travel cost and construction cost and structure these two cost components in different ways. A more general version of these two classic formulations is the biobjective network design problem. This article discusses an exact solution strategy for the biobjective discrete network design problem with equilibrium constraints, which eliminates the inexactness and incompleteness deficiencies pertaining to heuristics or metaheuristics presented in previous research. In particular, we adapted and justified a dichotomic solution framework for the biobjective network design problem, in which the complete solution set of the problem can be exhausted by repeatedly solving a parameterized scalar problem and updating the parameter set. A generalized Benders decomposition method, a widely used solution strategy for nonlinear mixed integer programming problems, is further implemented in the solution framework, which offers an efficient algorithmic tool for solution of the scalar problem. Numerical results obtained from the example problems justify the solution optimality, completeness, and efficiency of the presented solution method. © 2014 Wiley Periodicals, Inc. NETWORKS, 2014","title":"Bicriterion Discrete Equilibrium Network Design Problem","id":258511393,"url":"https://www.researchgate.net/publication/258511393_Bicriterion_Discrete_Equilibrium_Network_Design_Problem","names":["Chi Xie","Networks"],"references":{"226807558":"Tailoring Benders decomposition for network design","4940493":"An Algorithm for the Bi-Criterion integer Programming Problem","23527008":"Multicriteria spatial price equilibrium network design: Theory and computational results","4941389":"A parametric approach to solving bicriterion shortest path problems","226535046":"Road user charging design: Dealing with multi-objectives and constraints","222072246":"The multi objective equilibrium network design problem revisited: a Simulated Annealing approach","243124849":"Transportation network research: Algorithmic and computational questions","24053859":"Benders, J.F., “Partitioning Procedures for Solving Mixed-variables Programming Problems,” Numerische Mathematik, 4, 238","245563439":"Incorporating Environmental Justice Measures into Equilibrium-Based Network Design","273975898":"Studies in the Economics of Transportation","226211700":"An Annotated Bibliography of Multiobjective Combinatorial Optimization","227952644":"Multiobjective Bilevel Optimization for Transportation Planning and Management Problems","222687958":"Internalizing emission externality on road networks. Transp Res, Part D Transp Environ","23527667":"Benefit Distribution and Equity in Road Network Design","246927265":"Network Design with Variable Cost Elements","220412987":"On a Paradox of Traffic Planning","248987340":"Models and algorithms for road network design: a review and some new developments. Transp Rev","229563279":"“Models of Transportation and Optimal Network Construction”","3031049":"Optimality and Non-Scalar-Valued Performance Criteria","216300483":"Multiobjective Optimization. Principles and Case Studies","227443878":"An Interactive Approach For Multi-Criterion Optimization with an Application to the Operation of an Academic Department","222570094":"A survey on Benders decomposition applied to fixed-charge network design problems","227253415":"The Pareto-optimal Solution Set of the Equilibrium Network Design Problem with Multiple Commensurate Objectives","230595730":"Studies in Economics of Transportation","256158953":"Multiobjective optimization in water resources systems","226825259":"A simulaton-based multi-objective genetic algorithm (SMOGA) for BOT network design problem","23527497":"Bicriterion traffic assignment: Efficient algorithms plus examples","222283024":"“Approximation of Convex Curves with Application to the Bicriteria Minimum Cost Flow Problem,”","5159039":"The multi-criteria road network design problem in an urban area","31945814":"A Bibliography on the Applications of Mathematical Programming Multiple Objective Methods","226977845":"Generalized Benders Decomposition","236736809":"Partitioning Procedures for Solving Mixed-Variable Programming Problems","227947168":"Multi‐objective combinatorial optimization problems: A survey","3029273":"Topological Optimization of Networks: A Nonlinear Mixed Integer Model Employing Generalized Benders Decomposition,” Working Paper, IEEE Transactions on Automatic Control, AC-27, 164-169","238197000":"Pareto Optimal Multiobjective Optimization for Robust Transportation Network Design Problem","244985888":"Application of multiple criteria decision making for network improvement","23526877":"A Discrete Transportation Network Design Problem with Combined Trip Distribution and Assignment","216300582":"Multicriteria Optimization","23526947":"Approximate Algorithms for the Discrete Network Design Problem","239424387":"Transport network optimization in the Dutch integral transportation study","227445449":"An Overview of Techniques Solving Multiobjective Mathematical Programs”","291741739":"BENEFIT-COST RATIOS FOR PROJECTS IN MULTIPLE OBJECTIVE INVESTMENT PROGRAMS","222747663":"The set of efficient solutions for multiple objective shortest path problems","223834522":"A bi-criterion dynamic user equilibrium traffic assignment model and solution algorithm for evaluating dynamic road pricing strategies","239665415":"Network Design and Transportation Planning: Models and Algorithms","229753696":"Exact and Approximate Algorithms for Optimal Network Design","243778262":"The Tra±c Assignment Problem: Models and Methods","245560049":"Travel Time Minimization Versus Reserve Capacity Maximization in the Network Design Problem","23540147":"Optimal Network Problem: A Branch-and-Bound Algorithm","242933282":"A Network Design Algorithm Using a Stochastic Incremental Traffic Assignment Approach","37596005":"A Dual Ascent Procedure for Large Scale Uncapacitated Network Design","222241765":"Solution algorithm for the bi-level discrete network design problem","223039530":"Multiobjective Design of Transportation Networks: Taxonomy and Annotation","222757154":"Multiobjective Transportation Network Design and Routing Problems","227444843":"Bicriteria Transportation Problem","226165021":"A New Method to Solve Generalized Multicriteria Optimization Problems using the Simple Genetic Algorithm","242932253":"A Capacity Improvement Lower Bound for Fixed Charge Network Design Problems","239061716":"An Algorithm for the Discrete Network Design Problem","227970811":"Network Synthesis and Optimum Network Design Problems: Models, Solution Methods and Applications. Networks, 19:313-360","226130455":"Uber ein Paradoxon der Verkehrsplanung","243762793":"Multiobjective Programming and Planning","257153852":"An interactive biobjective shortest-path approach: Searching for unsupported nondominated solutions","220413011":"Bicriterion Traffic Assignment: Basic Theory and Elementary Algorithms","235709948":"Cours D\u0027Economie Politique","44329301":"Optimization of transport networks / Peter A. Steenbrink","23527316":"A Location-Allocation Model and Algorithm for Evacuation Planning under Hurricane Flood Conditions","246927813":"Network synthesis and optimum network design problems: Models","231031478":"Modern Mathematical Methods for Physicists and Engineers","24065436":"Approximate solution methods for multiobjective combinatorial optimization","223029567":"An Interactive Approach to Identify the Best Compromise Solution for Two Objective Shortest Path Problems","240488751":"Benefit-Cost Ratios for Projects in Multiple Objective Investment Programs","216300574":"Mathematical Physics","274456870":"The Traffic Assignment Problem: Models and Methods"},"citedIn":{"283172097":"A Parsimonious Heuristic for the Discrete Network Design Problem","281455948":"A Clustering Algorithm for Bi-Criteria Stop Location Design with Elastic Demand"},"index":730}