{"abs":"Gaussian random fields (GRFs) are important building blocks in hierarchical models for spatial data, but there is no practically useful, principled approach for selecting the prior on their hyperparameters. The prior is typically chosen in an \\emph{ad-hoc} manner, which lacks theoretical justification, despite the fact that we know that the hyperparameters are not consistently estimable from a single realization and that there is sensitivity to the choice of the prior. We first use the recent Penalised Complexity prior framework to construct a practically useful, tunable, weakly informative joint prior on the range and the marginal variance for Mat\\\u0027ern GRFs with fixed smoothness. We then discuss how to extend this prior to a prior for a non-stationary GRF with covariates in the covariance structure.","title":"Interpretable Priors for Hyperparameters for Gaussian Random Fields","id":273067384,"url":"https://www.researchgate.net/publication/273067384_Interpretable_Priors_for_Hyperparameters_for_Gaussian_Random_Fields","names":["Geir-Arne Fuglstad","Daniel Simpson","Finn Lindgren","Håvard Rue"],"references":{"260946444":"Penalising model component complexity: A principled, practical approach to constructing priors","4742474":"Non-Gaussian Bayesian Geostatistical Modeling","227925526":"Bayesian estimation of semi-parametric non-stationary spatial covariance structure","30962641":"Problems With Likelihood Estimation of Covariance Functions of Spatial Gaussian Processes","46537493":"Approximate Bayesian Inference for Latent Gaussian Models by Using Integrated Nested Laplace Approximations","223636674":"Asymptotic properties of a maximum likelihood estimator with data from a Gaussian process","45868908":"Adaptive Bayesian estimation using a Gaussian random field with inverse Gamma bandwidth. The Annals of Statistics 37","236900105":"Objective Bayesian Analysis of Geometrically Anisotropic Spatial Data","246623535":"Kriging and Automated Variogram Modeling Within a Moving Window","227686092":"Considering covariates in the covariance structure of spatial processes","269416785":"Estimation of a non-stationary model for annual precipitation in southern Norway using replicates of the spatial field","251431452":"Variance modeling for nonstationary processes with temporal replications","231175655":"Accounting for spatially varying directional effects in spatial\ncovariance structures","259171538":"Spatial models with explanatory variables in the dependence structure","227375789":"An explicit link between Gaussian fields and Gaussian Markov random fields: The stochastic partial differential equation approach. Journal of the Royal Statistical Society, Series B, 73(4), 423-498","243637348":"Nonparametric Estimation of Nonstationary Spatial Covariance Structure","5686647":"Spatial Modelling Using a New Class of Nonstationary Covariance Functions.","284012750":"Does non-stationary spatial data always require non-stationary random fields?","254287115":"Lognormal and Moving Window Methods of Estimating Acid Deposition","4743918":"Objective Bayesian Analysis of Spatially Correlated Data","2120071":"Default priors for Gaussian processes. Ann Stat","4746787":"Inconsistent Estimation and Asymptotically Equal Interpolations in Model-Based Geostatistics","247644014":"Interpolation of Spatial Data: Some Theory of Kriging","236326246":"Exploring a New Class of Non-stationary Spatial Gaussian Random Fields with Varying Local Anisotropy","51888165":"Spatial models generated by nested stochastic partial differential\nequations, with an application to global ozone mapping","233747228":"Objective Bayesian analysis of spatial data with uncertain nugget and range parameters","229881286":"Objective Bayesian analysis of spatial data with measurement error","265900335":"Gaussian Measures","4772151":"Bayesian inference for non-stationary spatial covariance structure via spatial deformations"},"citedIn":{"260946444":"Penalising model component complexity: A principled, practical approach to constructing priors"},"index":739}