{"abs":"In a probabilistic analysis of a stochastic structure, it is important to identify the design point—the point of most probable failure. When both the resistance and load term of the limit state function are random, a modified joint probability density function is formulated, and the design point is obtained by searching for the maximum point of this function. The modification is done by introducing the finite element solution for the load term into the original basic joint probability density function of the random variables. For threshold value problems, the design point is obtained by searching for the maximum point of the original joint probability function, conditional upon the finite element solution being equal to the threshold value. Once the design point is identified, the index of reliability can be found using known techniques for structures with independent and dependent random variables, normally and non-normally distributed. The solution is obtained without the need for any derivatives of the load term with respect to the random variables, thus no modifications are required in the finite element code used. The solution requires an algorithm that finds the maximum value of the objective function in a well defined variable space. Several numerical examples are presented, including cases of random fields, which are discretized by stochastic finite element into random variables. The library module of design optimization of the finite element code employed (ANSYS) is used to find the design point. Applying the proposed method permits the designer to perform probabilistic analysis with computational tools already available.","title":"Direct computation of the design point of a stochastic structure using a finite element code","id":245211537,"url":"https://www.researchgate.net/publication/245211537_Direct_computation_of_the_design_point_of_a_stochastic_structure_using_a_finite_element_code","names":["Giora Maymon","Structural Safety"],"references":{"245284446":"Structural reliability under incomplete probability information. J Eng Mech ASCE","238180528":"Practical Structural Reliability Techniques","247419195":"Roark\u0027s Formulas For Stress and Strain","239386957":"Stochastic Finite Element Expansion for Random Media","284115810":"STOCHASTIC FINITE ELEMENT ANALYSIS.","239387028":"Probability Approximations by Log Likelihood Maximization","223216090":"Probability finite elements for nonlinear structural dynamics","223328794":"Practical random field discretization in stochastic finite element analysis","238315809":"Selection of Random Field Mesh in Finite Element Reliability Analysis","284294630":"Galerkin based response approach for reliability analysis","222588317":"New light on first- and second-order reliability methods","247650456":"Stochastic Finite Element Analysis of Simple Beams","265440265":"Structural Reliability Theory and Its Applications","257940484":"Structural Reliability Analysis, Prediction","245284547":"A Response Surface Approach for Reliability Analysis","222788388":"A critical appraisal of methods to determine failure probabilities. Structural Safety 4:293-309","245301372":"Basic Analysis of Structural Safety","35573940":"Stochastic finite element analysis /","250695962":"Probability of failure of structures without a closed-form failure function","245284529":"Neumann Expansion for Stochastic Finite Element Analysis","222310512":"Random fields and stochastic finite elements","222628087":"Fast Probability Integration by Three-Parameter Normal Tail Approximation","225805894":"Asymptotic approximations for multinormal domain and surface integrals","245284267":"Response of Uncertain Systems to Stochastic Excitation","226241478":"Response variables correlation in stochastic finite element analysis","246192849":"Finite Element Reliability of Geometrically Nonlinear Uncertain Structures","245302562":"Efficient Algorithm for Stochastic Structural Optimization","252261622":"The eigen value problem for structural system with statistical properties"},"citedIn":{"245185070":"Numerical discretization of stationary random processes","223416196":"“Response surface method using vector projeted sampling points”","276259553":"An efficient coupling of FORM and Karhunen–Loève series expansion","245210410":"Structural reliability analysis using a standard deterministic finite element code","251203555":"Plastic Buckling of Rectangular Plates with Random Material Properties and Random Loading: A Demonstration of Probabilistic Structural Analysis","245286596":"Finite Element-Based Structural Reliability Assessment Using Efficient Directional Simulation"},"index":749}