{"abs":"This paper develops a new approach to finding solutions to the subset sum problem. The subset sum problem is an important NP-complete problem in computer science which has applications in operations research, cryptography, and bin packing. A genetic algorithm is developed which easily solves this problem. The genetic algorithm begins with a randomly generated population of solutions and breeds a new population using the best elements of the previous population. Each generation of solutions produces better solutions to the subset-sum problem than the previous generation. It is shown that this approach will efficiently produce solutions to large (10,000 elements or more) subset sum problems. Various parameters of the algorithm are varied in order to improve its performance","title":"Solving large knapsack problems with a genetic algorithm","id":3662832,"url":"https://www.researchgate.net/publication/3662832_Solving_large_knapsack_problems_with_a_genetic_algorithm","names":["R. Spillman"],"references":{"220442787":"Fast Approximation Algorithms for Knapsack Problems","26657271":"Insulin glargine use and short-term incidence of malignancies: A population-based follow-up study in Sweden","26335638":"Currie, C. J., Poole, C. D. \u0026 Gale, E. A. The influence of glucose-lowering therapies on cancer risk in type 2 diabetes. Diabetologia 52, 1766-1777","220431178":"Solving Low-Density Subset Sum Problems","201976800":"On Solving Traveling Salesman Problems by Genetic Algorithms","283996103":"Genetic Algorithms In Search, Optimization, and Machine Learning","2751334":"A Genetic Algorithm for Bin Packing and Line Balancing","233172778":"Cryptanalysis of knapsack ciphers using genetic algorithms","201976582":"On Solving Travelling Saleman Problems by Genetic Algorithms","228057735":"Computers and Intractability: A Guide to NP-Completeness","225529665":"Worst-case analysis of greedy algorithms for the subset-sum problem","26814281":"Combined randomised controlled trial experience of malignancies in studies using insulin glargine","227445983":"A New Algorithm for the 0-1 Knapsack Problem","40025713":"Insulin glargine and cancer","220432022":"Fast Approximation Algorithms for the Knapsack and Sum of Subset Problems","220695890":"Computers and Intractability, A Guide To The Theory of NP-Completeness","4940381":"Approximation schemes for the subset-sum problem: Survey and experimental analysis","201976287":"A New Approach on the Traveling Salesman Problem by Genetic Algorithms","201976158":"Incorporating Problem Specific Knowledge into Genetic Algorithms","4354709":"Fast approximation algorithms for knapsack problems","239543676":"An Algorithm for Large Zero-One Knapsack Problems","7329683":"Increased Cancer-Related Mortality for Patients With Type 2 Diabetes Who Use Sulfonylureas or Insulin","242814052":"Worst-case analysis of an approximation scheme for the subset-sum problem"},"citedIn":{"44070242":"Visualizing High Dimensional Objective Spaces for Multi-Objective Optimization: A Virtual Reality Approach.","261053644":"A novel artificial bee colony algorithm for the knapsack problem","281101314":"Using Genetic Algorithm to Break Super-Pascal Knapsack Cipher","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","221547346":"A Method to Plan Group Tours with Joining and Forking","242282297":"Application of Articial Intelligence to Wireless Communications","3903888":"A set-oriented genetic algorithm and the knapsack problem","224645933":"On Solving Multiobjective Bin Packing Problems Using Particle Swarm Optimization","220289489":"On solving multiobjective bin packing problems using evolutionary particle swarm optimization","221008312":"Visualizing high dimensional objective spaces for multi-objective optimization: A virtual reality approach.","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","2930008":"Quantum-Inspired Evolutionary Algorithms","264822736":"A discrete artificial bee colony for multiple Knapsack problem","221007444":"Virtual reality high dimensional objective spaces for multi-objective optimization: An improved representation","242039540":"A genetic algorithm for layered multisource video distribution","261322090":"Paralleled Genetic Algorithm for Solving the Knapsack Problem in the Cloud","220217626":"A decision support system for luggage typesetting","220306718":"Solving the 0/1 knapsack problem using an adaptive genetic algorithm"},"index":753}