{"abs":"Simulation based algorithms are often used to calculate an accurate value for the system reliability of complex systems. These concepts are very appealing because of their inherent simplicity. This is even more emphasized when used in combination with an implicit limit state function, for which the outcome is calculated by means of a finite element analysis. One of the major disadvantages however is the large number of simulations required to obtain an accurate estimate of the failure probability. This might result in an unrealistic processing time, making the method unusable for practical purposes. To meet this disadvantage, reliability analysis based on simulation methods in combination with an adaptive low order polynomial response surface are often used. The applicability has been demonstrated extensively. Ideally, no functional form is preset. The objective of this paper is to further increase the efficiency of simulation based reliability algorithms. Therefore the low order polynomial response surfaces are extended using neural networks and splines. The reliability framework is presented, compared with traditional response surface methods and commented extensively. The overall behaviour of the technique is addressed referring to several benchmark examples.","title":"Benefit of splines and neural networks in simulation based structural reliability analysis","id":223532023,"url":"https://www.researchgate.net/publication/223532023_Benefit_of_splines_and_neural_networks_in_simulation_based_structural_reliability_analysis","names":["Luc Schueremans","Dionys A. Van Gemert","Structural Safety"],"references":{"253942211":"Gonorrhoeae glue","262562663":"Neural Network: A Comprehensive Foundation","256421930":"A sequential response surface method and its application in the reliability analysis of aircraft structural systems","223269739":"Comparison of response surface and neural network with other methods for structural reliability analysis","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","216300355":"Some New Three Level Designs for the Study of Quantitative Variables","267974288":"Structural Reliability Analysis of a Car Front Cradle with Multiple Design Criteria","224982370":"Neural Networks – A Comprehensive Foundation","241416232":"System reliability methods using advanced sampling techniques","222423661":"An improved response surface method for the determination of failure probability and importance measures","200656985":"Design and Analysis of Experiments (2nd Ed)","242399583":"Past, Present \u0026 Future of Simulation − − − − Based Structural Analysis","223592988":"A new look at the response surface approach for reliability analysis","256968766":"Improved response surface method and its application to stiffened plate reliability analysis","223284991":"Effect of response surface parameter variation on structural reliability estimates","200744645":"A Practical Guide to Spline","254221394":"Assessing the safety of existing structures: Reliability based assessment framework, examples and application","245210410":"Structural reliability analysis using a standard deterministic finite element code","244445737":"Time Variant Reliability Analysis Utilizing Response Surface Approach","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","229328945":"Cumulative formation of response surface and its use in reliability analysis","257940484":"Structural Reliability Analysis, Prediction","245284547":"A Response Surface Approach for Reliability Analysis"},"citedIn":{"229569964":"Splines and other Metamodels in Reliability Analysis","50225594":"Microbiota of cocoa powder with particular reference to aerobic thermoresistant spore-formers","245231003":"Application of Least Squares Support Vector Machine for Regression to Reliability Analysis","225588731":"Classification using least squares support vector machine for reliability analysis","268478540":"A new moving least square response surface method for structural reliability analysis","257392219":"A combined Importance Sampling and Kriging reliability method for small failure probabilities with time-demanding numerical models","222817033":"Probabilistic analysis of concrete cracking using neural networks and random fields","268624396":"Argumentwise invariant kernels for the approximation of invariant functions","49241632":"Simplified probabilistic non-linear assessment of existing railway bridges","228953078":"USING ROBUSTNESS AND SENSITIVITY EVALUATION FOR SETTING UP A RELIABLE BASEMENT FOR ROBUST DESIGN OPTIMIZATION","222201451":"Carboxymethylation of kappa-carrageenan for intestinal-targeted delivery of bioactive macromolecules","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","222231783":"Estimation of failure probabilities by local approximation of the limit state function","268389477":"Adaptive response surface approach using artificial neural networks and Moving Least Squares","230765659":"Doubly weighted moving least squares and its application to structural reliability analysis","273533718":"Reliability analysis and Response Based Design of a moored FPSO in West Africa","242185907":"A System Reliability Analysis Method for Offshore Wind Turbine Foundation","229688493":"Reliability analysis for elastoplastic mechanical structures under stochastic uncertainty","259164269":"LS-SVM and Monte Carlo methods based reliability analysis for settlement of soft clayey foundation","245058296":"Structural reliability analysis for implicit performance function using radial basis function network","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","257270001":"Probabilistic evaluation of ground-support interaction for deep rock excavation using artificial neural network and uniform design","240915322":"Probabilistic stability analyses of slopes using the ANN-based response surface","290480822":"Assessing small failure probabilities by AK–SS: An active learning method combining Kriging and Subset Simulation","251615704":"Is Vigna radiata suitable for the revegetation of fly ash landfills?","225655003":"Support vector machine for structural reliability analysis","256918136":"The encounter of interval and probabilistic approaches to structural reliability at the design point","281976935":"A hybrid algorithm for reliability analysis combining Kriging and subset simulation importance sampling","245305522":"Application of ANN-Based Response Surface Method to Prediction of Ultimate Strength of Stiffened Panels","282204835":"Minimizing thermal residual stresses in ceramic matrix composites by using DE and ANN-based response surface method","270390959":"Gaussian Process Machine-Learning Method for Structural Reliability Analysis","4219637":"Noninvasive estimation of maximum elastance from color-Doppler M-mode echocardiograms using support vector machines","224775891":"Carboxymethylation of Kappa-carrageenan for intestinal- targeted delivery of Bioactive macromolecules. Carbohydrate polymers","223425064":"Innovative seismic design optimization with reliability constraints","257440164":"Neural Networks Combined with Importance Sampling Techniques for Reliability Evaluation of Explosive Initiating Device","266749786":"Review and application of Artificial Neural Networks models in reliability analysis of steel structures","263913862":"Probability-based design optimization of dynamic systems","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation"},"index":760}