{"abs":"Reliability-based optimisation (RBO) is a powerful tool for including uncertainties in the optimisation process, in which structural and reliability analyses and optimisation algorithms based on mathematical or evolutionary computation concepts have to be combined effectively. This process is rather complicated and difficult to carry out for large structural systems such as steel offshore structures. In this paper, a calculation system of integrated algorithms for the RBO of the offshore towers is presented. The calculation process is composed of a structural analysis package (SAPOS) based on the finite element method, a reliability analysis program based on the first-order reliability method and an optimisation program based on sequential quadratic programming using the International Mathematics and Statistics Library. In the RBO analysis, multiple limit states based on different criteria are used to check a probable failure condition and to identify the limit state criterion. An offshore jacket-type structure is considered as an example to demonstrate the applicability of the implemented algorithm to realistic structural systems.","title":"Reliability-based optimisation of offshore jacket-type structures with an integrated-algorithms system","id":233463597,"url":"https://www.researchgate.net/publication/233463597_Reliability-based_optimisation_of_offshore_jacket-type_structures_with_an_integrated-algorithms_system","names":["Halil Karadeniz","Vedat Toğan","Ayse Daloğlu","Ton Vrouwenvelder","Ships and Offshore Structures"],"references":{"232346905":"Reliability-based optimization in structural engineering. Struct Saf","245077465":"A strategy for reliability-based optimization","236660920":"Methods of Structural Safety","27349026":"Finite element reliability methods using DIANA","265794417":"Method of Structural Safety","227080239":"Two basic problems in reliability-based structural optimization","233951862":"Interactive methodology for reliability-based structural design and optimization","223090379":"Computational Methods in Optimization Considering Uncertainties -- An Overview","239401997":"Optimization of Steel Monopod-Offshore-Towers Under Probabilistic Constraints","226848876":"Reliability-Based Optimization of Structural Systems","225101443":"Efficient reliability-based design optimization using a hybrid space with application to finite element analysis","223507288":"Optimisation of a steel tower for a wind turbine structure","229676221":"Probabilistic structural optimization","222030196":"Reliability based structural optimization: A simplified safety index approach","222489264":"Interactive stability-oriented reliability-based design optimization","245210410":"Structural reliability analysis using a standard deterministic finite element code","256974121":"Stochastic finite element analysis of steel structures","257940484":"Structural Reliability Analysis, Prediction"},"citedIn":{"241731932":"Effect of SCFs on S–N based fatigue reliability of multi-planar tubular DKT-joints of offshore jacket-type structures","245079526":"An integrated framework including distinct algorithms for optimization of offshore towers under uncertainties"},"index":761}