{"abs":"Received: [Enter date] Modelling of economic and ecological impacts of genetically modified crops is a demanding task. We present some preliminary attempts made for the purpose of the ECOGEN project \"Soil ecological and economic evaluation of genetically modified crops\". One of the goals of the project is to develop a computer-based decision support system for the assessment of economic and ecological impacts of using genetically modified crops, with special emphasis on soil biology and ecology. The decision support system will be based on a rule-based model incorporating both economic and ecological criteria. In this paper we present some preliminary results of developing the integral model and describe four specific sub-models. The first two sub-models are concerned with ecology and assess the ecological impacts of various types of weed and pest control, respectively. The other two sub-models assess the economic impacts of cropping systems at the farm and regional level, respectively. All the models were developed using a qualitative multi-attribute modelling methodology, supported by the software tool DEXi.","title":"Multi-Attribute Modelling of Economic and Ecological Impacts of Cropping Systems","id":228394697,"url":"https://www.researchgate.net/publication/228394697_Multi-Attribute_Modelling_of_Economic_and_Ecological_Impacts_of_Cropping_Systems","names":["Marko Bohanec","Sašo Džeroski","Martin Žnidaršič","Antoine Messean","Sara Scatasta","Justus H.H. Wesseler","Informatica"],"references":{"222418753":"A decision support system for farm planning using AgriSupport II","221686756":"Decision support.","241194997":"Data Mining and Decision Support, Integration and Collaboration","46508752":"Rent Creation and Distribution from Biotechnology Innovations: The Case of Bt Cotton and Herbicide-tolerant Soybeans in 1997","209805531":"Multi-Criteria Decision Making Methods: A Comparative Study","248907448":"ECOGEN–Soil ecological and economic evaluation of genetically modified crops"},"citedIn":{"222042700":"Modelling impacts of cropping systems: Demands and solutions for DEX methodology","232732447":"Development of DEX-HOP multi-attribute decision model for preliminary hop hybrids assessment","242286565":"EDITORIAL BOARDS, PUBLISHING COUNCIL","267264935":"Extending the Multi-Criteria Decision Making Method DEX","237032441":"Model evaluation of quality attributes for hops (Humulus lupulus L.)","250389958":"Multi-Attribute Modelling of Economic and Ecological Impacts of Agricultural Innovations on Cropping Systems","234038047":"A qualitative multi-attribute model for economic and ecological assessment of genetically modified crops","248907448":"ECOGEN–Soil ecological and economic evaluation of genetically modified crops","41714546":"Ex ante Assessment of the Sustainability of Alternative Cropping Systems: Implications for Using Multi-criteria Decision-Aid Methods - A Review"},"index":763}