{"abs":"Solving optimization problems with multiple (often conflicting) objectives is, generally, a very difficult goal. Evolutionary algorithms (EAs) were initially extended and applied during the mid-eighties in an attempt to stochastically solve problems of this generic class. During the past decade, a variety, of multiobjective EA (MOEA) techniques have been proposed and applied to many scientific and engineering applications. Our discussion\u0027s intent is to rigorously define multiobjective optimization problems and certain related concepts, present an MOEA classification scheme, and evaluate the variety of contemporary MOEAs. Current MOEA theoretical developments are evaluated; specific topics addressed include fitness functions, Pareto ranking, niching, fitness sharing, mating restriction, and secondary populations. Since the development and application of MOEAs is a dynamic and rapidly growing activity, we focus on key analytical insights based upon critical MOEA evaluation of current research and applications. Recommended MOEA designs are presented, along with conclusions and recommendations for future work.","title":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","id":12473892,"url":"https://www.researchgate.net/publication/12473892_Multiobjective_Evolutionary_Algorithms_Analyzing_the_State-of-the-Art","names":["David A. Van Veldhuizen","Gary B. Lamont","Evolutionary Computation"],"references":{"243667015":"Parallel GAs for Multiobjective Functions","220739625":"Construction of Test Problems for Multi-Objective Optimization.","237132897":"Genetic Algorithms for Multiobjective Op - timization: Formulation","2615407":"A Pareto Frontier for Full Stern Submarines via Genetic Algorithm","246961073":"Non-Linear System Identification with Multiobjective Genetic Algorithms","2362670":"A Survey of Parallel Genetic Algorithms","3411839":"Fleming, P.J.: Multiobjective optimization and multiple constraint handling with evolutionary algorithms — part I: A unified formulation. IEEE Transactions on Systems, Man, and Cybernetics, Part A: Systems and Humans 28(1), 26-37","243773771":"Multiobjective Evolutionary Algorithms: Classi cations","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","233117812":"Coello Coello, C.A.: Treating Constraints as Objective for Single-Objective Evolutionary Optimization. Engineering Optimization 32(3), 275-308","12809680":"Deb, K.: Multi-Objective Genetic Algorithms: Problem Difficulties and Construction of Test Problems. Evolutionary Computation 7, 205-230","3755949":"On a Multi-Objective Evolutionary Algorithm and Its Convergence to the Pareto Set","3625443":"Multi-objective genetic algorithms made easy: Selection, sharing and mating restriction","3810221":"Assessing the performance of multiobjective genetic algorithms for optimization of a batch process scheduling problem","220045511":"Multicriteria target vector optimization of analytical procedures using a genetic algorithm. Part I","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","2239554":"Evolutionary Search for Minimal Elements in Partially Ordered Finite Sets","216300806":"Multicriterion decision making","3623508":"GENOCOP III: A co-evolutionary algorithm for numerical optimization problems with nonlinear constraints","2265862":"From Genetic and Evolutionary Optimization to the Design of Conceptual Machines","201976493":"An Investigation of Niche and Species Formation in Genetic Function Optimization","227702263":"Evolutionary multiobjective optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","221025610":"Multiobjective Optimization and Multiple Constraint Handling with Evolutionary Algorithms: A Unified Formulation","2763393":"Multiobjective Optimization Using The Niche Pareto Genetic Algorithm","250735898":"C4.5 Multiobjective optimization","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","248392930":"Multiple Objective Decision Making—Methods and Applications: A State-of-the-Art Survey","2607050":"Finding Improved Wire-Antenna Geometries with Genetic Algorithms","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","201976957":"Evolutionary Algorithms in Theory and Practice","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","220885661":"A Multiple Criteria Genetic Algorithm for Containership Loading.","225783245":"Selective breeding in a multiobjective genetic algorithm","3754497":"Multi-objective genetic local search for minimizing the number of fuzzy rules for pattern classification problems","3418509":"Macready, W.G.: No Free Lunch Theorems for Optimization. IEEE Transactions on Evolutionary Computation 1(1), 67-82","2615708":"Multiobjective Evolutionary Algorithm Test Suites","36233939":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations.","223284724":"Multicriteria Target Vector Optimization of Analytical Procedures Using a Genetic Algorithm .1. Theory, Numerical Simulations and Application to Atomic Emission-Spectroscopy.","242372494":"Genetic algorithm in search","229937160":"Towards finding global representations of the efficient set in multiple objective Mathematical Programming","2791575":"A Comprehensive Survey of Evolutionary-Based Multiobjective Optimization Techniques","216457304":"Lecture Notes in Computer Science","243666680":"F1.9 Multicriterion decision making","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA"},"citedIn":{"10648739":"Genetic Diversity as an Objective in Multi-Objective Evolutionary Algorithms","225740150":"Immunity-based evolutionary algorithm for optimal global container repositioning in liner shipping","270395417":"Designing a solar powered Stirling heat engine based on multiple criteria: Maximized thermal efficiency and power","220866860":"An Evolutionary Algorithm Guided by Preferences Elicited According to the ELECTRE TRI Method Principles.","264971201":"Optimal Design of a Solar Driven Heat Engine Based on Thermal and Thermo-economic Criteria","11161760":"Improved Sampling of the Pareto-Front in Multiobjective Genetic Optimizations by Steady-State Evolution: A Pareto Converging Genetic Algorithm","264922074":"Genetic programming theory and practice IX. Selected papers based on the presentations at the 9th workshop, Ann Arbor, MI, USA, May 12–14, 2011. Foreword by Una-Maay O’Reilly","288827687":"Multiobjective evolutionary algorithm based on multimethod with dynamic resources allocation","226783637":"An interval algorithm for multi-objective optimization","242762346":"Diseño de Topologías Virtuales en Redes Ópticas. Un enfoque basado en Colonia de Hormigas","266451957":"Adaptivity in Data Stream Mining","221007160":"Variable interactions and exploring parameter space in an expensive optimisation problem: Optimising Short Term Conflict Alert","221196603":"Reference Set Metrics for Multi-Objective Algorithms","2811965":"Guidance in Evolutionary Multi-Objective Optimization","242367082":"Elitism, Sharing, and Ranking Choices in Evolutionary Multi-Criterion Optimisation","220200199":"Bargaining strategies designed by evolutionary algorithms","222563677":"Nojima, Y.: Analysis of Interpretability-Accuracy Tradeoff of Fuzzy Systems by Multiobjective Fuzzy Genetics-Based Machine Learning. International Journal of Approximate Reasoning 44, 4-31","236136968":"Efficient thinning regimes for Eucalyptus fastigata: multi-objective stand-level optimisation using the island model genetic algorithm. Ecol Model","237571636":"MULTIOBJECTIVE OPTIMIZATION OF DYNAMIC PROCESSES BY EVOLUTIONARY METHODS","221148467":"An Evolutionary Approach for Pareto-optimal Configurations in SOC Platforms","225970534":"Exploring Environmental and Economic Trade-offs Associated with Aggregate Recycling from Decommissioned Forest Roads","220702008":"SPAM: Set Preference Algorithm for Multiobjective Optimization","220742920":"A Specialized Island Model and Its Application in Multiobjective Optimization","263813019":"Multi-objective new product development by complete Pareto front and ripple-spreading algorithm","3949598":"Wire-antenna geometry design with multiobjective genetic algorithms","34471471":"Explicit building block multiobjective evolutionary computation : methods and applications /","264184733":"Application of multi-objective genetic algorithm for waste load allocation in a river basin","5297268":"Improving Locality in Binary Representation via Redundancy","46424802":"Abandoning Objectives: Evolution Through the Search for Novelty Alone","223696252":"Exploratory study of sorting particle swarm optimizer for multiobjective design optimization","3418142":"Multiobjective Evolutionary Optimization of DNA Sequences for Reliable DNA Computing","270395441":"Thermodynamic and thermo-economic analysis and optimization of performance of irreversible four-temperature-level absorption refrigeration","28242307":"Optimización paralela multiobjetivo de conjuntos de perceptrones multicapa para clasificación de patrones","226501037":"Crowding-measure-based multiobjective evolutionary algorithm for job shop scheduling","229732764":"Multi‐Objective Optimization in Distillation Unit: A Case Study","266162162":"A HYBRID SYSTEM OSCILLATOR FOR MULTIOBJECTIVE SUPPLIER SELECTION PROBLEM","6532179":"Diffusion tensor imaging: techniques and clinical applications.","226252109":"A problem space genetic algorithm in multiobjective optimization","257643374":"Multiobjective Harmony Search Algorithm Proposals","2364433":"Constraint Method-Based Evolutionary Algorithm (CMEA) for Multiobjective Optimization","4275318":"Assembly Process Planning Using a Multi-objective Optimization Method","4035588":"On the spectral singularities of watermarked audio","267723726":"ALGORITMO GENÉTICO PARA O PROBLEMA DE ESCALONAMENTO DE TAREFAS EM MÁQUINAS PARALELAS COM MÚLTIPLOS OBJETIVOS","240915040":"Tuning Methodologies for Parameterized Systems Design","233246169":"A multi-objective evolutionary programming approach to the ‘object location’ spatial analysis and optimisation problem within the urban water management domain","49656523":"Alcohol, ethnicity and service use in trauma patients: Challenges of presenting and interpreting effect modification","251705150":"T403 INFLUENCE OF EMOTIONALLY-LOADED VISUAL AND GUSTATORY STIMULI ON EXPERIMENTAL JAW-MUSCLE PAIN","257432422":"Design of particle-reinforced polyurethane mould materials for soft tooling process using evolutionary multi-objective optimization algorithms","276367419":"Estimation of Thermal Boundary Conditions by Using Hybrid Inverse Approach","220739948":"Evolutionary multi-objective quantum control experiments with the covariance matrix adaptation","224090396":"Design Optimization of a Delta-Like Parallel Robot through Global Stiffness Performance Evaluation","4201480":"Multi-objective differential evolution - Algorithm, convergence analysis, and applications","263968755":"Multi-objective adaptive clonal selection algorithm for solving optimal power flow considering multi-type FACTS devices and load uncertainty","221007205":"The evaluation line: A posteriori preference articulation approach","266334101":"MULTI-OBJECTIVE GENETIC ALGORITHM APPLICATION FOR MULTIRESERVOIR SYSTEM IN THE HAN RIVER BASIN","221228388":"A new MOEA for multi-objective TSP and its convergence property analysis","220666217":"Multi-objective location modeling of urban parks and open spaces: Continuous optimization","236855888":"Quantum Evolutionary Algorithm Based on Particle Swarm Theory in Multiobjective Problems","224606514":"A Favorable Weight-Based Evolutionary Algorithm for Multiple Criteria Problems","221228411":"A Micro-Genetic Algorithm for Multiobjective Optimization","280253666":"Final Published","249960126":"Multiobjective Learning Classifier Systems: An Overviews","3996774":"Evaluation of mutation heuristics for solving a multiobjective flexible job shop by an evolutionary algorithm","242405929":"Vitri - A Generic Framework for Engineering Decision Support Systems on Heterogeneous Computer Networks","245366468":"An Information-Theoretic Entropy Metric for Assessing Multi-Objective Optimization Solution Set Quality","222689561":"Three-objective genetic-based machine learning for linguistic rule extraction","226315555":"Diversity and Neuro-Ensemble","256680722":"A model-based methodology for the analysis and design of atomic layer deposition processes—Part III: Constrained multi-objective optimization","224076036":"A Tabu method to find the Pareto solutions of multiobjective optimal design problems in electromagnetics","221091186":"A GRASP Algorithm for the Multi-Objective Knapsack Problem.","220664135":"DCAF: an MPEG-21 dynamic content adaptation framework","226945511":"Multiobjective Prioritization in the Analytic Hierarchy Process by Evolutionary Computing","264971177":"Multi-Objective Thermodynamic-Based Optimization of Output Power of Solar Dish-Stirling Engine Implementing an Evolutionary Algorithm","3303504":"Pareto Evolutionary Neural Networks","267809684":"Joint inversion of surface waves and refracted P-and S-waves","224396546":"Interactive Evolutionary Multiobjective Search and Optimization of Set-Based Concepts","220199291":"A fast multi-objective evolutionary algorithm based on a tree structure","227702263":"Evolutionary multiobjective optimization","270395515":"Designing a solar powered Stirling heat engine based on multiple criteria: Maximized thermal efficiency and power","228874696":"Mapping Cores on Network-on-Chip","4251695":"Determination of Pruned Pareto Sets for the Multi-Objective System Redundancy Allocation Problem","220355917":"DECA: The doping-driven evolutionary control algorithm","221559109":"A Multiobjective Genetic Algorithm for the Class/Teacher Timetabling Problem","225385758":"A parallel global-local mixed evolutionary algorithm for multimodal function optimization based on domain decomposition","281631931":"Application of the Multi-Objective Pareto-Based Genetic Algorithm in Solving Geospatial Optimisation Problems","1772655":"Randomised Variable Neighbourhood Search for Multi Objective Optimisation","230342094":"A human‐like numerical technique for design of engineering systems","223345979":"Accurate CFD Driven Optimization of Lifting Surfaces for Wing-Body Configuration","225357081":"Heuristics for minimizing total completion time and maximum lateness on identical parallel machines with setup times. Journal of Intelligent Manufacturing 21(4): 439-449","51960673":"Digital Ecosystems: Ecosystem-Oriented Architectures","226217216":"Multiobjective optimization for classifier ensemble and feature selection: An application to named entity recognition","257227567":"Application of the multi-objective optimization and risk analysis for the sizing of a residential small-scale CCHP system","271962184":"Estimation of Thermal Boundary Conditions by Gradient Based and Genetic Algorythms","262317021":"Advances in Evolutionary Multi-objective Optimization","226979079":"Multi-Objective Optimization Using Surrogates","4201665":"A geologically-sound representation for evolutionary multi-objective subsurface identification","221228461":"MOLeCS: Using Multiobjective Evolutionary Algorithms for Learning","242029289":"Multiobjective Gaussian Particle Swarm Approach Applied to Multiloop PI Controller Tuning of a Quadruple-Tank System","220497313":"Use of symmetry and stability for data clustering","4042933":"A multiobjective evolutionary algorithm for solving vehicle routing problem with time windows","254230446":"Transient responses’ optimization by means of set-based multi-objective evolution","221228453":"A Multiobjective Evolutionary Algorithm for Deriving Final Ranking from a Fuzzy Outranking Relation","235694726":"An evolutionary multiobjective strategy for the effective management of groundwater resources","226671887":"Predictive Modeling on Multiple Marketing Objectives Using Evolutionary Computation","261232415":"Approximation of thermal boundary conditions as functions of temperature and local coordinates obtained during immersion quenching","273749214":"Optimal Design of a Solar-Driven Heat Engine Based on Thermal and Ecological Criteria","220289456":"Representation and management of MOEA populations based on graphs","261501699":"Urban Planning Decision Using Multi-objective Optimization Algorithm","239800028":"Design of an I-Beam using a deterministic multiobjective optimization algorithm","216301693":"Hydrological Predictions using data-driven models coupled with data preprocessing techniques","233799030":"Calculating Complete and Exact Pareto Front for Multiobjective Optimization: A New Deterministic Approach for Discrete Problems","221228468":"Constraint Method-Based Evolutionary Algorithm (CMEA) for Multiobjective Optimization.","228459781":"Solving Hard Multiobjective Problems with a Hybridized Method","221228431":"Different Multi-objective Evolutionary Programming Approaches for Detecting Computer Network Attacks","237310598":"RESUME DE MEMOIRE EN MAGISTER en GENIE MECANIQUE - PRODUCTIQUE OPTION : SYSTEMES DE PRODUCTION","281489508":"A Multi-population Hybrid Algorithm to Solve Multi-objective Remote Switches Placement Problem in Distribution Networks","222922221":"Modeling and optimization of a nuclear power plant secondary loop","256853990":"Multi-objective optimisation of a model of the decomposition of animal slurry in soil: Tradeoffs between simulated C and N dynamics","37245588":"Metaheuristic and Multiobjective Approaches for Space Allocation","260233005":"A new probabilistic canopy dynamics model (SLCD) that is suitable for evergreen and deciduous forest ecosystems","239547127":"MODELS AND METHODS FOR THE OPTIMAL DESIGN OF SUPERCONDUCTING POWER DEVICES","221228447":"Molecular Dynamics Optimizer.","270895254":"Information Discovery from Constraints for Evolutionary Computational Model","260233009":"Thermodynamic optimization of Stirling heat pump based on multiple criteria","47567457":"Chemoinformatics and Library Design","7049438":"Structural determination of the stable and meta-stable forms of atomoxetine HCl using single crystal and powder X-ray diffraction methods","23539167":"Using Evolutionary Algorithms to Generate Alternatives for Multiobjective Site-Search Problems","221228439":"Multiobjective Optimization in Linguistic Rule Extraction from Numerical Data.","2911381":"An Elitist Genetic Algorithm for Multiobjective","257391598":"Multi-objective optimization of linear multi-state multiple sliding window system","250887752":"VS AND VP DETERMINATION VIA JOINT INVERSION OF RAYLEIGH WAVES AND REFRACTION TRAVEL TIMES BY MEANS OF PARETO CRITERION AND EVOLUTIONARY ALGORITHMS","223576559":"Multi-Objective Calibration and Fuzzy Preference Selection of a Distributed Hydrological Model","238682874":"Title of Dissertation ENTROPY APPROACH TO METAMODELING, MULTI-OBJECTIVE GENETIC ALGORITHM, AND QUALITY ASSESSMENT OF SOLUTION SETS FOR","220204512":"Supply Estimation Using Coevolutionary Genetic Algorithms in the Spanish Electrical Market","223809942":"SIMAP: Intelligent System for Predictive Maintenance: Application to the health condition monitoring of a windturbine gearbox","224197021":"An Evolutionary Algorithm based on an outranking relation for sorting problems","224387482":"Stochastic Optimization of Magnetic Shields in Induction Heating Applications by Means of the FEM-DBCI Method and the SALHE Evolutionary Algorithm","242382523":"Multi-Objective Evolutionary Optimization of Gas Turbine Components","216457263":"Lecture Notes in Computer Science","263724913":"Determination of optimal operating conditions for a polymer electrolyte membrane fuel cell stack: Optimal operating condition based on multiple criteria","221161956":"Fitness Sharing Based on Angular Distances","224257421":"WebNeg: A Genetic Algorithm Based Approach for Service Negotiation","263968617":"Solving a new multi-objective multi-route flexible flow line problem by multi-objective particle swarm optimization and NSGA-II","224561585":"Interleaved Ultrawideband Antenna Arrays Based on Optimized Polyfractal Tree Structures","228838774":"A multi-objective evolutionary algorithm with a separate archive","223712640":"Guided local search as a network planning algorithm that incorporates uncertain traffic demands","27475316":"An adaptive framework for Internet-based distributed genetic algorithms","220646897":"A new multiobjective simulated annealing based clustering technique using symmetry","225456552":"Optimal Design of Water Distribution System by Multiobjective Evolutionary Methods","221228534":"Recombination of Similar Parents in EMO Algorithms","237476603":"A Multipurpose Evolutionary Algorithm Toolbox. User Manual","220199363":"The Williams and Otto Chemical Plant re-evaluated using a Pareto-optimal formulation aided by Genetic Algorithms","262367101":"Tabu-based evolutionary algorithm with negative selection for Pareto-optimization in distributed systems","282776580":"A novel harmony search algorithm with gaussian mutation for multi-objective optimization","221008371":"The sequential optimization-constraint multi-objective problem and its applications for robust planning of robot paths","224377279":"Unsupervised pixel classification in satellite imagery using a new multiobjective symmetry based clustering approach","245463616":"Do search and selection operators play important roles in Multi-objective Evolutionary Algorithms: A case study","221601236":"A New QoS Multicast Routing Model and Its Immune Optimization Algorithm","33774311":"Which Groundwater Remediation Objective is Better: A Realistic One or a Simple One?","261313399":"Multi-objective optimization problems: Method and application","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","260112231":"Multi-objective optimization of Stirling engine using non-ideal adiabatic method","221534675":"Shaping Realistic Neuronal Morphologies: An Evolutionary Computation Method.","221144519":"Fuzzy Multi-objective Evaluating Method for Hybrid Assembly Line Design","2832577":"An Evolution Strategy for Multiobjective Optimization","220773826":"A Quantum Inspired Evolutionary Framework for Multi-objective Optimization","1772785":"A Computational Study of Genetic Crossover Operators for Multi-Objective Vehicle Routing Problem with Soft Time Windows","258407308":"Advanced Data Mining and Applications","257739696":"Multi-objective voltage island floorplanning using sequence pair representation","221228482":"FastPGA: A Dynamic Population Sizing Approach for Solving Expensive Multiobjective Optimization Problems","220216781":"Using multi-population intelligent genetic algorithm to find the pareto-optimal parameters for a nano-particle milling process","223711672":"Optimal power system generation scheduling by multi-objective genetic algorithms with preferences","228555117":"Requerimientos de Qos en la Asignación Óptima de Lightpath Un enfoque multiobjetivo basado en MOEAs.","260501364":"Fitness Prediction Techniques for Scenario-Based Design Space Exploration","240521888":"Inferring groundwater system dynamics from hydrological time-series data","263094104":"QoS Aware Geographic Opportunistic Routing in Wireless Sensor Networks","281689148":"Multiobjective optimisation design for enterprise system operation in the case of scheduling problem with deteriorating jobs","225586565":"Multiobjective Optimization of Ensembles of Multilayer Perceptrons for Pattern Classification","265015100":"Cuckoo Search: A Brief Literature Review","226022785":"Comparison of Strategies for the Optimization/Innovation of Crankshaft Balance","220462554":"A GRASP algorithm for the multi-criteria minimum spanning tree problem","224177573":"An Interactive Territory Defining Evolutionary Algorithm: iTDEA","221008336":"On the locality of dominance and recombination in multiobjective evolutionary algorithms","221228499":"A Statistical Comparison of Multiobjective Evolutionary Algorithms Including the MOMGA-II","234054925":"Multi-objective optimisation of multipass turning by using a genetic algorithm","220699097":"Multi-label Ensemble Learning","220701734":"Multiobjective Optimization of Ensembles of Multilayer Perceptrons for Pattern Classification.","264834760":"Multi-objective optimisation of DMLS process parameters using evolutionary algorithm","272090419":"Contribution à l’intégration des cycles biogéochimiques dans les modèles de croissance forestiers à base phénoménologique. Dynamique saisonnière du couvert forestier et décomposition de la matière organique du sol.","225109103":"Finding Knees in Multi-objective Optimization","281182663":"Optimization performance and thermodynamic analysis of an irreversible nano scale Brayton cycle operating with Maxwell–Boltzmann gas","281401795":"FinalPublished with VolNumber","259892858":"Genetic Algorithm Based Multi-Objective Optimization of Process Parameters in Color Fast Finish Processes-A Textile Case Study","222415944":"Combining deliberative and computer-based methods for multi-objective land-use planning","257374814":"VS and VP vertical profiling via joint inversion of Rayleigh waves and refraction travel times by means of bi-objective evolutionary algorithm","228781224":"Preprint: Multi-objective Evolutionary Algorithm for the Optimization of Noisy Combustion Processes","245353365":"A Novel Approach to the Optimization of Reaction Rate Parameters for Methane Combustion Using Multi-Objective Genetic Algorithms","215678417":"Solution-processed polycrystalline copper tetrabenzoporphyrin thin-film transistors","222428237":"A multi-objective evolutionary algorithm approach for crusher optimisation and flowsheet design","2936096":"ROC Optimisation of Safety Related Systems","226116715":"Multi-Objective Optimization","257051200":"Multi-objective optimization of a vertical ground source heat pump using evolutionary algorithm","258543226":"Optimization of Power-Cycle Arrangements for Supercritical Water Cooled Reactors (SCWRS)","226813072":"A Hybrid Multiobjective Evolutionary Algorithm for Solving Vehicle Routing Problem with Time Windows","248182750":"Joint Inversion of surface wave dispersion curves and reflection travel times via multi-objective evolutionary algorithms","220286006":"Selection Based on the Pareto Nondomination Criterion for Controlling Code Growth in Genetic Programming","224309321":"A Multiobjective Evolutionary-Simplex Hybrid Approach for the Optimization of Differential Equation Models of Gene Networks","225751150":"Systems and control engineering","274956664":"Joint Analysis of Rayleigh-Wave Dispersion and HVSR of Lunar Seismic Data from the Apollo 14 and 16 Sites","255590944":"Multicriteria Decision Making for Production System Conceptual Design Using s-Pareto Frontiers","242367340":"Multiobjective Control: Linear Matrix Inequality Techniques and Genetic Algorithms Approach","225304691":"Self-organizing maps for Pareto optimization of airfoils","223110253":"Optimization of building thermal design and control by multi-criterion genetic algorithm","229026948":"Designing a new elitist nondominated sorted genetic algorithm for a multiobjective long term groundwater monitoring application","7806292":"Opacity Transfer Function Optimization for Volume-rendered Computed Tomography Images of the Prostate1","220955663":"A Survey on Interpretability-Accuracy (I-A) Trade-Off in Evolutionary Fuzzy Systems","239207268":"Time-Predefined and Trajectory-Based Search: Single and Multiobjective Approaches to Exam Timetabling","234166483":"Multi-objective optimization of a joule cycle for re-liquefaction of the Liquefied Natural Gas","237531919":"Feature Selection and Classifier Ensembles: A Study on Hyperspectral Remote Sensing Data Kenmerk Selectie en Classificatie Ensembles: Een Studie op Hyperspectrale Afstandswaarnemingsdata","220265480":"Multi-Objective Optimization of Particle Reinforced Silicone Rubber Mould Material for Soft Tooling Process","270698762":"Multi-Label Classification Based on Multi-Objective Optimization","221139975":"SDMOGA: A New Multi-objective Genetic Algorithm Based on Objective Space Divided.","3421470":"Multiobjective evolutionary algorithm for the optimization of noisy combustion processes","2519305":"Extensions to the Strength Pareto Evolutionary Algorithm.","220236817":"Find the \u0027Best\u0027 Solution from Multiple Analog Topologies via Pareto-Optimality","4027663":"Multiobjectives genetic snakes: application on audio-visual speech recognition","222542961":"A niched genetic algorithm to solve a pollutant emission reduction problem in the manufacturing industry: A case study","220199978":"Simultaneous concept-based evolutionary multi-objective optimization","238720780":"Multi-Objective Swarm Intelligent Systems - Theory \u0026 Experiences","46299134":"An Interactive Multicriteria Optimisation Approach to Scheduling","280253835":"Final Published","278325718":"Thermo-ecological analysis and optimization performance of an irreversible three-heat-source absorption heat pump","220742761":"Fuzzy Dominance Based Multi-objective GA-Simplex Hybrid Algorithms Applied to Gene Network Models","286371923":"A Phenomic Algorithm for Inference of Gene Networks Using S-Systems and Memetic Search","222929930":"MAkE: Multiobjective algorithm for k-way equipartitioning of a point set","257334802":"Chow, T.S.: A local multiobjective optimization algorithm using neighborhood field. Struct. Multi. Optim. 46, 853-870","225722416":"Multi-policy Optimization in Self-organizing Systems","226151486":"Regression Error Characteristic Optimisation of Non-Linear Models","220460133":"Dynamic Selection of a Video Content Adaptation Strategy from a Pareto Front","286051402":"A Multiobjective Phenomic Algorithm for Inference of Gene Networks","281766284":"Thermo-economic modeling and optimization of an irreversible solar-driven heat engine","226064434":"Accuracy, Parsimony, and Generality in Evolutionary Learning Systems via Multiobjective Selection","229888248":"An investigation on stream temperature analysis based on evolutionary computing","224133138":"A Territory Defining Multiobjective Evolutionary Algorithms and Preference Incorporation","220739706":"Reference point based multi-objective evolutionary algorithms for group decisions","3864942":"Handling preferences in evolutionary multiobjective optimization: A survey","271141245":"Optimization density power and thermal efficiency of an endoreversible Braysson cycle by using non-dominated sorting genetic algorithm","220669042":"SSPMO: A Scatter Tabu Search Procedure for Non-Linear Multiobjective Optimization","254242417":"A multi-objective hierarchical calibration procedure for land surface/ecosystem models","2897275":"Designing Crushers with a Multi-Objective Evolutionary Algorithm","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","273111325":"The bi-objective Pollution-Routing Problem","220286079":"Barrier Trees on Poset-Valued Landscapes","281292197":"Sensitivity of Algorithm Parameters and Objective Function Scaling in Multi-Objective Optimisation of Water Distribution Systems","216300934":"On metrics for comparing non-dominated sets","258454019":"Digital Ecosystems","4940076":"An empirical study on similarity-based mating for evolutionary multiobjective combinatorial optimization. Eur J Oper Res","216143243":"Bi-Criterion Optimization with Multi Colony Ant Algorithms","251907690":"An exploratory study of sorting particle swarm optimizer for multiobjective optimization","225111047":"A memetic algorithm for multi-objective dynamic location problems","229361881":"Insights on surface wave dispersion and HVSR: Joint analysis via Pareto optimality","225614848":"A GRASP heuristic for the multi-objective permutation flowshop scheduling problem","255646287":"An evolutionary technique for scheduling and allocation concurrency","225954820":"A Study on Distribution Preservation Mechanism in Evolutionary Multi-Objective Optimization","240780078":"Design of Virtual Topologies using the Elitist Team of Multiobjective Evolutionary Algorithms","228582633":"Evolutionary algorithms in control systems engineering: a survey. Control Eng Pract","254230097":"Adaptive multi-objective archive-based hybrid scatter search for segmentation in lung computed tomography imaging","216300947":"Capacitated Network Design Considering Survivability: An Evolutionary Approach","225227796":"Evolutionary multi-objective portfolio optimization in practical context","51211895":"Superior oblique tendon expansion with Achilles tendon allograft for treating Brown syndrome","4272442":"Differences of Structured Documents - Improving their Quality","221947974":"Multi-objective optimization of a cooling tower assisted vapor compression refrigeration system","222691384":"A hybrid multi-objective evolutionary algorithm for solving truck and trailer vehicle routing problems. Eur J Oper Res","230606016":"Comfort and energy consumption of hydronic heating radiant ceilings and walls based on CFD analysis","220176480":"Multi-Objective Optimization using Grid Computing","220219552":"Multi-objective feature selection by using NSGA-II for customer churn prediction in telecommunications","277298436":"Multi-Objective Particle Swarm Optimisation Methods.","223246534":"A survey on multi-constrained optimal path computation: Exact and approximate algorithms","261412380":"Fuzzy Evaluation of Alternatives-The Concept of Supporting Majority and Veto-Minority","261150232":"Coordinating Control Based on Multi-objective Intelligent Optimization for the Overall Lead-zinc Sintering Process","224618729":"A metaheuristic evolutionary method for electrical performance estimation of distribution networks","4074923":"A simplified artificial life model for multiobjective optimisation: A preliminary report","261309957":"Smart micro-grid optimization with controllable loads using particle swarm optimization","220599473":"A symmetry based multiobjective clustering technique for automatic evolution of clusters","257153732":"BSTBGA: a hybrid genetic algorithm for constrained multi-objective optimization problems. Comput Oper Res","5893569":"Prediction of transcription start sites based on feature selection using AMOSA.","281632084":"Application of the Pareto-Based Genetic Algorithm in Multi-Objective Location Analysis","3903910":"Hybrid Population-Based Metaheuristic Approaches For The Space Allocation Problem","280972578":"An Agent-Based Simulation of Residential Location Choice of Tenants in Tehran, Iran","227413008":"Various approaches in optimization of a typical pressurized water reactor power plant","220200064":"Enhanced Genetic Algorithm-Based Fuzzy Multiobjective Strategy to Multiproduct Batch Plant Design","2549127":"Dynamic Reconfiguration of Network Applications and Middleware Systems in the Bio-Networking Architecture","281928047":"Multi objective optimization of horizontal axis tidal current turbines, using Meta heuristics algorithms","251721382":"La importancia de la terapia conductual en el tratamiento de la obesidad","43479868":"Neural Networks: Computational Models and Applications","222832868":"Dynamic systems modelling using genetic programming","257432309":"Multi-objective approach based on grammar-guided genetic programming for solving multiple instance problems","229622786":"A Two-Leveled Multi-objective Symbiotic Evolutionary Algorithm for the Hub and Spoke Location Problem","241192909":"Reactive power optimization of power system based on multi-objective concordance evolutionary algorithm","220200113":"Multi-objective Distinct Candidates Optimization: Locating a few highly different solutions in a circuit component sizing problem","260110894":"Optimized graph-based segmentation for ultrasound images","282854771":"Thermodynamic modeling of hydrophobic interaction chromatography of biomolecules in the presence of salt","242309086":"Initial Sensor Network Design with a Multi-Objective Genetic Algorithm","220384397":"Multi-objective genetic local search algorithm using Kohonen\u0027s neural map","276238788":"Sequential interactive evolution for finding high-quality topologies","265919086":"Multi-Objective Optimization of Motor Vessel Route","288857216":"Multi-objective optimization for supply chain management problem: A literature review","4913650":"A bi-objective genetic algorithm approach to risk mitigation in project scheduling","2918805":"Feature Selection and Classifier Ensembles: A Study on Hyperspectral Remote Sensing Data","4075006":"In situ bioremediation of perchlorate-contaminated groundwater using a multi-objective parallel evolutionary algorithm","216300837":"Mating Scheme for Controlling the Diversity-Convergence Balance for Multiobjective Optimization","220311781":"Three-objective genetics-based machine learning for linguistic rule extraction.","37145587":"Evolutionary approaches to fuzzy modelling for classification","220884204":"Continuous data availability in instantaneous streaming networks","228447322":"Efficient Optimization of Reliable Two-Node Connected Networks: A Biobjective Approach","45706096":"RECONSTRUCTION OF GENE NETWORKS USING PHENOMIC ALGORITHMS","4074996":"A hybrid multiobjective evolutionary algorithm for solving truck and trailer vehicle routing problems","253645524":"Pumping Costs and Water Quality in the Battlefield of Optimal Operation of Water Distribution Networks","226044085":"Multiobjective Evolutionary Algorithms for Electric Power Dispatch Problem","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","223217822":"Multi-objective approach in thermoenvironomic optimization of a benchmark cogeneration","220741887":"A multi-objective evolutionary algorithm with weighted-sum niching for convergence on knee regions","245095244":"Review of Utilization of Genetic Algorithms in Heat Transfer Problems","262323829":"A hybrid algorithm based on particle swarm and chemical reaction optimization","270271947":"Unconventional Optimized Surface Wave Acquisition and Analysis: Comparative Tests in a Perilagoon Area","265491979":"Evolutionary algorithms for multiobjective evaluation of watershed management decisions","225767596":"A Dual-Objective Evolutionary Algorithm for Rules Extraction in Data Mining","261276238":"Preference-Based Evolutionary Multi-objective Optimization","3455466":"Evolutionary multi-objective optimization: A historical view of the field","4181472":"Research on A New Multiobjective Combinatorial Optimization Algorithm","263308881":"Multi-objective optimization of manufacturing cell design","2918861":"An Empirical Study on the Effect of Mating Restriction on the Search Ability of EMO Algorithms","224309436":"Contrast Enhancement and Intensity Preservation for Gray-Level Images Using Multiobjective Particle Swarm Optimization","252532462":"Three-Objective Genetic Algorithms for Designing Compact Fuzzy Rule-Based Systems for Pattern Classification Problems","6281659":"Molecular optimization using computational multi-objective methods","2390467":"Evolutionary Computation and Data Mining","222948526":"Parametrical mechanical design with constraints and preferences: Application to a purge valve","228615240":"Single-reservoir operating rules for a year using multiobjective genetic algorithm","220618959":"Procedural Texture Evolution Using Multi-objective Optimization.","276074911":"Optimizing the number of electrodes and spatial filters for Brain–Computer Interfaces by means of an evolutionary multi-objective approach","220981446":"Stopping Criteria for Ensembles of Evolutionary Artificial Neural Networks.","242683779":"OPTIMIZATION OF WATER RESOURCES SYSTEMS USING MULTI OBJECTIVE EVOLUTION STRATEGIES","221754562":"Design of a Fuzzy-based Decision Support System for Coronary Heart Disease Diagnosis","245463895":"Buffer and wiresizing optimization under the distributed RLC model with crosstalk constraint","3903937":"An evolutionary multi-objective local selection algorithm for customer targeting","270675423":"A Hybrid Multiobjective Differential Evolution Algorithm and Its Application to the Optimization of Grinding and Classification","43294570":"Multi-objective Optimisation of Cancer Chemotherapy Using Evolutionary Algorithms","224309408":"Efficient Fuzzy Evolutionary Algorithm-Based Approach for Solving the Student Project Allocation Problem","228918182":"Evolutionary Computation in Design and Manufacturing","2404908":"Full Elite Sets for Multi-Objective Optimisation","225269604":"On Multi-Objective Evolutionary Algorithms","2478633":"Pareto Evolutionary Neural Networks","221006624":"Adapting evolutionary dynamics of variation for multi-objective optimization","268325361":"A COMPUTATIONALLY-ASSISTED METHODOLOGY FOR RAPID EXPLORATION OF DESIGN POSSIBILITIES IN CONCEPTUAL DESIGN","239549527":"Extending the Computer Defense Immune System: Network Intrusion Detection With Multiobjective Evolutionary Programming Approach","2949694":"Improving the Performance of Trajectory-Based Multiobjective Optimisers by Using Relaxed Dominance","220593983":"Development of an engine crankshaft in a framework of computer-aided innovation","4075043":"Distributed processor allocation for discrete event simulation and digital signal processing using a multiobjective evolutionary algorithm","220637959":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons.","28669844":"Entwurf eines Systems zur Positionsbestimmung auf Basis von Entfernungsmessungen zu Referenzpunkten","262177153":"ICHEA for Discrete Constraint Satisfaction Problems","251089107":"Improved precedence preservation crossover for multi-objective job shop scheduling problem","220937997":"Formulation and a MOGA Based Approach for Multi-UAV Cooperative Reconnaissance.","262405508":"On Set-Based Multiobjective Optimization","220520195":"Quality-driven resource-adaptive data stream mining?","229695384":"Robust handling of non‐linear constraints for GA optimization of aerodynamic shapes","251239632":"Optimising Data-Driven Safety Related Systems","275589700":"Thermo-economic and thermodynamic analysis and optimization of a two-stage irreversible heat pump","277287597":"The multiobjective genetic . . . benchmark problems -- an analysis","262220170":"Multi-directional local search","233991129":"Multi-objective optimization with fuzzy measures and its application to flow-shop scheduling","5607038":"A Multi-Objective Evolutionary Algorithm Toolbox for Computer-Aided Multi-Objective Optimization","220403464":"Pruned Pareto-optimal sets for the system redundancy allocation problem based on prioritized objectives","225078087":"Strategies of multi-objective optimization in drug discovery and development","221929236":"Inverse Analysis in Civil Engineering: Applications to Identi?cation of Parameters and Design of Structural Material Using Mono or Multi-Objective Particle Swarm Optimization","227138470":"Priority Elicitation in the AHP by a Pareto Envelope-Based Selection Algorithm","251556049":"A comprehensive approach in optimization of a dual nuclear power and desalination system","235290678":"Applying of genetic algorithm for optimizing methane combustion reactions","227148731":"An Evolutionary Algorithm for Project Selection Problems Based on Stochastic Multiobjective Linearly Constrained Optimization","248808678":"Multiobjective Management of Ecosystem Services by Integrative Watershed Modeling and Evolutionary Algorithms","221570816":"Applying Multi-objective Evolutionary Algorithms to QoS-Aware Web Service Composition","238001178":"Thermodynamic and thermoeconomic optimization of a cooling tower-assisted ground source heat pump","220355355":"Optimization Models of Sound Systems Using Genetic Algorithms","263394697":"Distributed Query Plan Generation Using Multiobjective Genetic Algorithm","3950086":"Pareto multiobjective nonlinear regression modelling to aid CAPM analogous forecasting","220055334":"Automatic large-scale integrated circuit synthesis using allocation-based scheduling algorithm","282275567":"Thermodynamic analysis and performance optimization of irreversible Carnot refrigerator by using multi-objective evolutionary algorithms (MOEAs)","229369750":"Multiobjective genetic algorithm strategies for electricity production from generation IV nuclear technology","257052012":"Thermo-economic multi-objective optimization of solar dish-Stirling engine by implementing evolutionary algorithm","3904005":"MEA: A metapopulation evolutionary algorithm for multi-objective optimisation problems","45630599":"AMI Screening Using Linguistic Fuzzy Rules","260251074":"Artificial Mutation inspired Hyper-heuristic for Runtime Usage of Multi-objective Algorithms","3418741":"Considerations in engineering parallel multiobjective evolutionary algorithms. IEEE Trans Evol Comput","228995043":"Pareto-directed Interactive Concept-based Evolution","226790338":"Multiobjective structural optimization using a microgenetic algorithm","261469661":"Granular computing ranking method based multi-objective genetic algorithm","258176299":"Multi-objective optimization of a recuperative gas turbine cycle using non-dominated sorting genetic algorithm","264836481":"A multi-objective extension of the net flow rule for exploiting a valued outranking relation","2493039":"Genetic Chromodynamics For Obtaining Continuous Representation Of Pareto Regions","221953904":"Knowledge-informed Pareto simulated annealing for multi-objective spatial allocation","3418745":"Balance between genetic search and local search in memetic algorithms for multiobjective permutation flowshop scheduling. IEEE Trans Evol Comput","220392300":"A hybrid system for multiobjective problems - A case study in NP-hard problems","3421819":"Computational Intelligence in Product Design Engineering: Review and Trends","2485866":"Multiobjective Genetic Algorithm Applied To Benchmark Problems - An Analysis","27540470":"Niched-Pareto Genetic Algorithm for Aircraft Technology Selection Process","220740474":"Hybrid genetic algorithm for dynamic multi-objective route planning with predicted traffic in a real-world road network","8997597":"An Adaptive Sharing Elitist Evolution Strategy for Multiobjective Optimization","261715407":"ϵ-OA for the Solution of Bi-Objective Generalized Disjunctive Programming Problems in the Synthesis of Nonlinear Process Networks","224122636":"Electrical performance estimation of distribution networks considering voltage level measurements","51967311":"Quantum Control Experiments as a Testbed for Evolutionary\nMulti-Objective Algorithms","233178046":"High resolution material ablation and deposition with femtosecond lasers and applications to photomask repair. J. Mod. Optic. 51, 2781-2796","271203954":"Incorporation of Preferences, Adaptive Operators and Hybridization in Multi-Objective Evolutionary Algorithms","223166231":"Genetic local search for multi-objective flowshop scheduling problems","240919559":"A model for spatio-temporal network planning","263007729":"Multi-objective optimization of a Stirling engine with irreversibility consideration using Finite speed thermodynamics.","231370647":"Multiobjective Genetic Algorithm Optimization for Calculating the Reaction Rate Coefficients for Hydrogen Combustion","228654078":"Numerical experiments on Pareto-optimal task assignment representations by Tabu-based evolutionary algorithm","256195867":"Genetic Algorithms for Multi-objective Optimization: Application to a Multi-reservoir System in the Chi River Basin, Thailand","279314171":"Differential evolution for noisy multiobjective optimization","250103945":"Multicriterion Evolutionary Algorithm for Workload Balancing of the Web Bank Servers","3418709":"A weighted sum genetic algorithm to support multiple-party multi-objective negotiations","220777289":"Multimodality Image Registration by Particle Swarm Optimization of Mutual Information.","220380993":"Multiobjective Optimization of Safety Related Systems: An Application to Short-Term Conflict Alert.","251345048":"Evolution’s Niche in Multi-Criterion Problem Solving","229433288":"Parallel Optimisation Algorithms for Continuous, Non-Linear Numerical Simulations","284013192":"New version of a multi-algorithm genetically adaptive for multiobjective optimization","286476148":"A population-based algorithm for the bi-objective assembly line worker assignment and balancing problem","229944284":"Multi‐objective exergoeconomic optimization of an Integrated Solar Combined Cycle System using evolutionary algorithms","261770736":"A multiobjective optimization approach for location-allocation of clinics","245076213":"Design and optimization of a non-TEMA type tubular recuperative heat exchanger used in a regenerative gas turbine cycle","2504265":"Adapting Weighted Aggregation for Multiobjective Evolution Strategies","220381014":"Using unconstrained elite archives for multiobjective optimization","233885573":"Dynamic weighted aggregation for evolutionary multi-objective optimization: Why does it work and how?","224645910":"Concept-based IEC for Multi-objective Search with Robustness to Human Preference Uncertainty","223949615":"Various Approaches in Optimization of Multi Effects Distillation Desalination Systems Using a Hybrid Meta-Heuristic Optimization Tools","255575372":"A DISCRETE PARTICLE SWARM OPTIMIZER FOR CLUSTERING SHORT-TEXT CORPORA","26803183":"Multiobjective Optimization of an Electrostimulative Acetabular Revision System","4035141":"Color blending based on viewpoint and surface normal for generating images from any viewpoint using multiple cameras","220742481":"A pareto archive evolutionary strategy based radial basis function neural network training algorithm for failure rate prediction in overhead feeders","264971697":"Optimization of thermodynamic performance of Stirling Engine","224645913":"A Multi-Objective Genetic Algorithm with Controllable Convergence on Knee Regions","224259873":"Optimal strategies for multi objective games and their search by evolutionary multi objective optimization","242090002":"Optimizacion Multi-Objetivo y Computacion Grid","4283967":"Multi-Objective Genetic Algorithm to Support Class Responsibility Assignment","245134562":"Evolutionary multicriteria optimization in core designs: basic investigations and case study","233045916":"On Maximizing Solution Diversity in a Multiobjective Multidisciplinary Genetic Algorithm for Design Optimization","270223003":"Thermo-economic optimization of Stirling heat pump by using non-dominated sorting genetic algorithm","226621184":"Evolving Continuous Pareto Regions","3664564":"A 3 GHZ, 144 POINT PROBE FUTURE FOR AUTOMATIC IC WAFER TESTING","227309327":"Multi-Objective Genetic Algorithms for Vehicle Routing Problem with Time Windows","254303659":"Handling changes of performance requirements in multi-objective problems","220071834":"Parallel Multiobjective Optimization of Ensembles of Multilayer Perceptrons for pattern classification","222676928":"Optimization of heat pipe with axial “Ω”-shaped micro grooves based on a niched Pareto genetic algorithm (NPGA)","36426925":"起業支援の現場を見てわかったこと","269808275":"Survey on an Efficient Coverage and Connectivity of Wireless Sensor Networks using Intelligent Algorithms","250175584":"COMBUSTION PROCESS OPTIMIZATION USING EVOLUTIONARY ALGORITHM","250360933":"USING DIVERSITY TO GUIDE THE SEARCH IN MULTI-OBJECTIVE OPTIMIZATION","220384171":"Multi-objective optimization of a stochastic assembly line balancing: A hybrid simulated annealing algorithm","3418808":"Intelligent Evolutionary Algorithms for Large Parameter Optimization Problems","7471871":"Evaluating the ϵ-Dominance Based Multi-Objective Evolutionary Algorithm for a Quick Computation of Pareto-Optimal Solutions","229069608":"Robust design of high field magnets through Monte-Carlo analysis. Int J Comput Math Electr Electron Eng","234785646":"The formulation and optimization algorithm for mission scheduling problem of vehicles","223607744":"Multi-objective optimization of cutting parameters for drilling laminate composite materials by using genetic algorithms. Compos Sci Technol","242404581":"Multiobjective Evolutionary Optimisation of Small Wind Turbine Blades","247186467":"Many-Objective Optimization using Differential Evolution with Variable-Wise Mutation Restriction","3567278":"In-cache pre-processing and decode mechanisms for fine grain parallelism in SCISM","3418798":"A GA-Based Design Space Exploration Framework for Parameterized System-On-A-Chip Platforms","266799484":"Thermodynamic analysis and optimization of an irreversible Ericsson cryogenic refrigerator cycle","220743605":"A Similarity-Based Mating Scheme for Evolutionary Multiobjective Optimization","290430929":"Thermodynamic analysis and multi objective optimization of performance of solar dish Stirling engine by the centrality of entransy and entropy generation","229711662":"Introduction to Evolutionary Algorithms","251629663":"Predicting torsional strength of RC beams by using Evolutionary Polynomial Regression","228625153":"The orienteering problem with stochastic profits","228951815":"Multi-objective Synthesis of CMOS Operational Amplifiers using a Hybrid Genetic Algorithm","2521732":"New Evolutionary Algorithm for Multi-objective Optimization and its Application to Engineering Design Problems","255034769":"Multicriteria Genetic Tuning for the Optimization and Control of HVAC Systems","248952948":"Optimal design of artificial neural networks by a multi-objective strategy: groundwater level predictions. Hydrol Sci J","286821306":"A fuzzy simulated evolution algorithm for integrated manufacturing system design","265505143":"Distributed large-scale dimensional metrology. New insights","222329831":"Genetic algorithms for modelling and optimisation","233007940":"Pareto layer: Its formulation and search by way of evolutionary multi-objective optimization","221494171":"An Effective Dynamical Multi-objective Evolutionary Algorithm for Solving Optimization Problems with High Dimensional Objective Space","262169864":"A Hybrid Technique Using Multi-objective Particle Swarm Optimization and Random Forests for PROBE Attacks Detection in a Network","4870883":"A genetic-based framework for solving (multi-criteria) weighted matching problems","230637333":"Pareto evolution of gene networks: An algorithm to optimize multiple fitness objectives","220204940":"Evolving dynamic Bayesian networks with multi-objective genetic algorithms. Appl Intell","2524809":"Accuracy, Parsimony, and Generality in Evolutionary Learning Systems via Multiobjective Selection","224156652":"Hybrid algorithm for multi-objective optimization of PMSM using massively distributed finite element analysis","228655888":"Waste collection vehicle routing problem with time windows using multi-objective genetic algorithms","263895304":"Assessing Activity Pattern Similarity with Multidimensional Sequence Alignment Based on a Multiobjective Optimization Evolutionary Algorithm","272373384":"Extending Multi-objective Differential Evolution for Optimization in Presence of Noise","257051109":"Multi-objective optimal power flow with FACTS devices. Energy Conv Manage","221917056":"Rotor Design for High-Speed Flywheel Energy Storage Systems","226157508":"Multiple-Objective Genetic Algorithm Using the Multiple Criteria Decision Making Method TOPSIS","228524832":"Multi-criteria optimal design of residential ventilation systems","238680312":"Noninferior Surface Tracing Evolutionary Algorithm (NSTEA) for Multi Objective Optimization","24420277":"De Novo Drug Design Using Multiobjective Evolutionary Graphs","277286469":"Procedural Texture Evolution Using Multiobjective","257228182":"A Multi-objective optimal evolutionary algorithm based on tree-ranking","249341982":"Evolutionary design of decision trees","271539949":"A Genetic Algorithm for Unconstrained Multi-objective Optimization","225666992":"Multi-objective Learning Classifier Systems","281413122":"Inventory replenishment planning and staggering","265570578":"Applications of soft computing. Recend trends","220606432":"A Clustering-Based Niching Framework for the Approximation of Equivalent Pareto-Subsets.","254152161":"A Globus-Based Distributed Enumerative Search Algorithm for Multi-objective Optimization","288918512":"Thermodynamic analysis and optimization for an irreversible heat pump working on reversed Brayton cycle","221294586":"A Framework for Design Space Exploration of Parameterized VLSI Systems.","233045801":"A Contribution to the Uncertainty Analysis of Distributed Hydrological Models","271741688":"An archived multi-objective simulated annealing for a dynamic cellular manufacturing system","226087861":"An integrated multi-objective immune algorithm for optimizing the wire bonding process of integrated circuits","27544426":"A multi-objective stochastic approach to combinatorial technology space exploration","221001727":"Searching for knee regions in multi-objective optimization using mobile reference points","251621419":"Optimal control of distillation column using Non-Dominated Sorting Genetic Algorithm-II","3019512":"The Pareto Optimization of Ultra-Wideband Polyfractal Arrays","259993001":"Multi-objective highway alignment optimization incorporating preference information","220290043":"Evolving better population distribution and exploration in evolutionary multi-objective optimization","220484607":"Creating a Digital Ecosystem: Service Orientated Architectures with Distributed Evolutionary Computing","1773306":"MOOPPS: An Optimization System for Multi Objective Scheduling","237296838":"A MULTIOBJECTIVE GENETIC ALGORITHM APPLIED TO MULTIVARIABLE CONTROL OPTIMIZATION","221523926":"A Multi-agent Negotiation Model Applied in Multi-objective Optimization","223097770":"Economic environmental dispatch of hydrothermal power system","2616014":"Multicriteria Optimization with Export Rules for Mechanical Design","28355421":"Evolutionäre Algorithmen zwischen experimenteller und theoretischer Analyse","268043540":"A New Genetic Algorithm to Solve Effectively Highly Multi- Objective Problems: POGA","221163456":"A New Evolutionary Algorithm for Solving Multiobjective Optimization","220701640":"Lecture Notes in Computer Science","274072228":"Evolutionary multi-agent systems","221006814":"Optimization of turning process parameters using Multi-objective Evolutionary algorithm.","266721558":"Genetic chromodynamics for obtaining continuous representation of Pareto regions","224178088":"Nature-Inspired Design Techniques for Ultra-Wideband Aperiodic Antenna Arrays","224440213":"Multiobjective Optimization: An Educational Opportunity in Power Engineering","267176217":"A multivariable multiobjective predictive controller","259536270":"Multi-Objective Optimization of a Cross-Flow Plate Heat Exchanger Using Entropy Generation Minimization","4308665":"Memetic NSGA - A Multi-objective genetic algorithm for classification of microarray data","282134056":"Review sobre el diseño y la optimización de los Intercambiadores de Calor de Tubo y Coraza. Autores","2945750":"Pareto Multi-Objective Non-Linear Regression Modelling to Aid CAPM Analogous Forecasting","226762616":"Lecture Notes in Computer Science","220742615":"Healthy daily meal planner","241155232":"A Multi-Objective Evolutionary Algorithm with Extended MGG Model and Distance-Based Density Measure","221228591":"Lecture Notes in Computer Science","263329968":"Evolutionary Algorithms for Multi-Objective Optimization: Performance Assessments and Comparisons","232639193":"Optimal Web Service Selection based on Multi-Objective Genetic Algorithm","269728535":"CAFS: The Combined Adiabatic–Finite Speed thermal model for simulation and optimization of Stirling engines","221522482":"A Cluster-Based Evolutionary Algorithm for Multi-objective Optimization.","221017643":"Interactive Concept-based Search using MOEA: The Hierarchical Preferences Case.","257633363":"Optimal feeding profile for a fuzzy logic controller in a bioreactors using genetic algorithm","229039791":"COMPARATIVE STUDY OF SEVERAL MULTI-OBJECTIVE GENETIC ALGORITHMS","225505913":"New definition and calculation model for evolutionary multi-objective optimization","268674825":"Multi-type Green-space Modelling for Urban Planning using GA and GIS","242129248":"Effective Program Module Assignment in the Internet Banking by Tabu-based Evolutionary Algorithm","220199441":"Stopping criteria for ensemble of evolutionary artificial neural networks","263439521":"A Symbiotic Evolutionary Algorithm for Balancing and Sequencing Mixed Model Assembly Lines with Multiple Objectives","30513858":"Définition conceptuelle d\u0027avions : vers une optimisation multiobjectif, robuste et incertaine","281397206":"FinalPublished(Ansari-MultiObjective)","267946223":"PRELIMINARY ANALYSIS OF MULTI-OBJECTIVE GENETIC ALGORITHM APPLICATION FOR MULTIRESERVOIR SYSTEM","277291920":"The Measure of Pareto Optima. Applications to Multi-objective Metaheuristics","265916622":"Fuel Consumption Minimization Procedure of Sail-assisted Motor Vessel based on a Systematic Meshing of the Explored Area","221228599":"Minimal Sets of Quality Metrics","222176806":"A multi-objective evolutionary algorithm for reactive power compensation in distribution networks","271933231":"A multi-objective approach for a project scheduling problem with due dates and temporal constraints infeasibilities","237079868":"Structuration d\u0027ateliers hybrides","261440651":"Disease Diagnosis with a hybrid method SVR using NSGA-II","228549310":"Multiobjective Max-Min Ant System. An application to Multicast Traffic Engineering","233214661":"Optimal feeding profile in fed-batch bioreactors using a genetic algorithm","220835341":"Exploiting the Marginal Profits of Constraints with Evolutionary Multi-Objective Optimization Techniques.","220199478":"Basu, M.: Economic environmental dispatch of fixed head hydrothermal power systems using nondominated sorting genetic algorithm-II. Applied Soft Computing 11, 3046-3055","223518329":"Fuzzy controlled simulation optimization","35480880":"Active Processor Scheduling Using Evolutionary Algorithms","223284834":"A cascade optimization methodology for automatic parameter identification and shape/process optimization in metal forming simulation","3949331":"Evolving crushers","3418884":"Abido, M.A.: Multiobjective evolutionary algorithms for electric power dispatch problem. IEEE Trans. Evol. Comput. 10(3), 315-329","221228574":"Multicriteria Evolutionary Algorithm with Tabu Search for Task Assignment","239014157":"THE MULTI-CRITERION OPTIMIZATION OF BUILDING THERMAL DESIGN AND CONTROL","269302591":"A Multi-Objective Genetic Algorithm for constructing load-balanced virtual backbones in probabilistic Wireless Sensor Networks","269878053":"Improving the multi-objective evolutionary optimization algorithm for hydropower reservoir operations in the California Oroville–Thermalito complex","221024792":"Introduction to Evolutionary Multiobjective Optimization","241159531":"NSGA-II Algorithms for Multi-Objective Short-Term Hydrothermal Scheduling","220275220":"Scour depth modelling by a multi-objective evolutionary paradigm","262277271":"Multi-criterion, evolutionary and quantum decision making in complex systems","242443589":"Local Search Directions for Non-dominated Solutions in Cellular Multiobjective Genetic Algorithms","220645904":"Multi-class ROC analysis from a multi-objective optimisation perspective","221024794":"Consideration of Partial User Preferences in Evolutionary Multiobjective Optimization","3949317":"Effect of local search on the performance of cellular multiobjective genetic algorithms for designing fuzzy rule-based classification systems","235099448":"Explicit Building-Block Multiobjective Genetic Algorithms: Theory, Analysis, and Development","264672509":"Exploration of the Trade-Offs between Water Quality and Pumping Costs in Optimal Operation of Regional Multiquality Water Distribution Systems","3490571":"A 10 b 75 MHz subranging A/D converter","3567368":"Reliability analysis of a mine production system-a case study","223855126":"Genetic algorithms for optimisation of chemical kinetics reaction mechanisms","2366306":"Halftone Image Generation with Improved Multiobjective Genetic Algorithm","267569339":"A MEMORY-BASED GRASP HEURISTIC FOR THE MULTIOBJECTIVE MULTIDIMENSIONAL KNAPSACK PROBLEM","221420152":"An Improved Multiobjective Evolutionary Algorithm Based on Dominating Tree.","235050318":"Explicit Building Block Multiobjective Evolutionary Computation: Methods and Applications","51782747":"Feasibility of Identification of Gamma Knife Planning Strategies by Identification of Pareto Optimal Gamma Knife Plans","224204307":"Exploiting geographic opportunistic routing for soft QoS provisioning in wireless sensor networks \u003c10.1109/MASS.2010.5664017","223454721":"A dominance tree and its application in evolutionary multi-objective optimization","220283504":"A new multiobjective clustering technique based on the concepts of stability and symmetry","45226465":"Solving multi-objective scheduling problemsAn integrated systems approach","272102240":"Thermodynamic and thermo-economic analysis and optimization of an irreversible regenerative closed Brayton cycle","220200519":"Efficient maxima-finding algorithms for random planar samples","226202147":"Recent Developments in Evolutionary Multi-Objective Optimization","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","264533144":"Wasp Colony with a Multiobjective Local Optimizer for Dynamic Task Planning in a Production Plant","226193946":"Broadhurst, D.I. \u0026 Kell, D.B. Statistical strategies for avoiding false discoveries in metabolomics and related experiments. Metabolomics 2, 171-196","23456260":"Optimization of cDNA Microarray Experimental Designs Using an Evolutionary Algorithm","241461510":"Multi-objective automatic calibration of SWAT using NSGA-II","222705187":"Evolutionary algorithms for multi-objective energetic and economic optimization in thermal system design","275157761":"Current trends in evolutionary multi-objective optimization","275721992":"Optimal driving during electric vehicle acceleration using evolutionary algorithms","265523385":"Multiobjective Optimization for Optimal Design of Urban Drainage Systems","221161029":"Integrating preference based weighted sum into evolutionary multi-objective optimization","221228609":"Exploiting Comparative Studies Using Criteria: Generating Knowledge from an Analyst\u0027s Perspective.","220199536":"Multi-objective community detection in complex networks","2493270":"A New Evolutionary Approach for Multiobjective Optimization","221228638":"Application of Multi Objective Evolutionary Algorithms to Analogue Filter Tuning","257391652":"A two-stage preference-based evolutionary multi-objective approach for capability planning problems","220291668":"Multi-objective pump scheduling optimisation using evolutionary strategies","257307683":"Calibrating Indoor Positioning Systems With Low Efforts","260211956":"A multi-objective hyper-heuristic based on choice function","245439959":"Genetic Algorithms Applied to Multi-Objective Aerospace Shape Optimization","257226787":"Multi-objective approach in thermoenvironomic optimization of a small-scale distributed CCHP system with risk analysis","221228630":"multi-Multi-Objective Optimization Problem and Its Solution by a MOEA","282533805":"Multi-objective thermodynamic optimization of an irreversible regenerative Brayton cycle using evolutionary algorithm and decision making","4939568":"Local dominance and local recombination in MOEAs on 0/1 multiobjective knapsack problems. Eur J Oper Res","236970340":"Optimization of integrated urban wastewater systems using multi-objective evolution strategies","242360590":"Multi-Objective Optimisation for Information Access Tasks","238779719":"A proposal for an effective multiobjective non-dominated genetic algorithm: the OPTimised Multi-Objective Genetic Algorithm OPTIMOGA","250272108":"Optimization of Tank Model Parameters Using Multi-Objective Genetic Algorithm (I): Methodology and Model Formulation","221131428":"Multiobjective Simulated Annealing Based Approach for Feature Selection in Anaphora Resolution","264560712":"Multi-objective optimization of GPU3 Stirling engine using third order analysis","263892023":"Designing a solar powered Stirling heat engine based on multiple criteria: Maximized thermal efficiency and power","264971332":"Evaluation of the maximized power of a regenerative endoreversible Stirling cycle using the thermodynamic analysis","233375355":"Constrained optimization of aerodynamic shapes via minimization of total drag","3419046":"Dominance-Based Multiobjective Simulated Annealing","4307922":"A realistic approach to evolutionary multiobjective portfolio optimization","220070535":"Solving the Class Responsibility Assignment Problem in Object-Oriented Analysis with Multi-Objective Genetic Algorithms","237280696":"WAST ECOLLECTIO NVEHICL EROUTIN GPROBLE MWITH TIME WINDOW SUSIN GMULTI-OBJECTIV EGENETIC ALGORITHMS","220508859":"Computational Intelligence in Product Design Engineering: Review and Trends.","224089796":"Reactive Power Planning Using a Two-Level Optimizer Based on Multi-Objective Algorithms","229920277":"Various Criteria in Optimization of a Geothermal Air Conditioning System with a Horizontal Ground Heat Exchanger","232653436":"Optimization of Regional Coverage Reconnaissance Satellite Constellation by Improved NSGA-II Algorithm","243711266":"Modal Methodology for the Simulation and Optimization of the Free-Layer Damping Treatment of a Car Body","273352687":"Parameterizing Complex Reactive Force Fields Using Multiple Objective Evolutionary Strategies (MOES). Part 1: ReaxFF Models for Cyclotrimethylene Trinitramine (RDX) and 1,1-Diamino-2,2-dinitroethene (FOX-7)","4366309":"A multi-objective optimization framework for video compression and transmission","257051898":"Economic and environmental impacts of the energy source for the utility production system in the HDA process","4116374":"Design of optimal complex spreading codes for DS-CDMA using an evolutionary approach","223697661":"A hybrid intelligent system for multiobjective decision making problems","257351932":"Protein secondary structure prediction using DWKF based on SVR-NSGAII","4230123":"Guided architecture-based design optimisation of CBSs","257415419":"Application of the multi-objective optimization method for designing a powered Stirling heat engine: Design with maximized power, thermal efficiency and minimized pressure loss","4234221":"A Fast Nondominated Sorting Algorithm","283636554":"Sensitivity of Algorithm Parameters and Objective Function Scaling in Multi-Objective Optimisation of Water Distribution Systems","220718742":"Accuracy, Parsimony, and Generality in Evolutionary Learning Systems via Multiobjective Selection.","216300368":"Integrating User Preferences into Evolutionary Multi-Objective Optimization","245326123":"Set-based concept selection in multi-objective problems: Optimality versus variability approach","220777117":"MURMOEA: A Pareto Optimality Based Multiobjective Evolutionary Algorithm for Multi-UAV Reconnaissance Problem","258021588":"Hybrid Game Evolutionary Algorithm for Mission Path Planning of Aerial Survey Tasks","226490056":"“MOSS-II” Tabu/Scatter Search for Nonlinear Multiobjective Optimization","225792716":"Application of multi-objective genetic algorithms to multireservoir system optimization in the Han River basin","221153941":"Efficiently finding the \u0027Best\u0027 solution with multi-objectives from multiple topologies in topology library of analog circuit","277291832":"Evolutionary Computation Group","266684452":"Optimizing Multi-Objective Evolutionary Algorithms to Enable Quality-Aware Software Provisioning","251747523":"An efficient VLSI implementation of logarithmic signal processors","2374631":"Combining Hybrid Metaheuristics and Populations for the Multiobjective Optimisation of Space Allocation Problems","251589947":"Optimised design of energy efficient building façades via Evolutionary Neural Networks","222823040":"Genetic algorithm based multi-objective optimization of cutting parameters in turning process. Eng Appl Artif Intell","245079379":"Sensitivity analysis for decision-making using the MORE method—A Pareto approach","227542617":"Forest Road Erosion Control Using Multiobjective Optimization1","224645801":"Preference Incorporation in Multi-objective Evolutionary Algorithms: A Survey","241479087":"A Hybrid Algorithm for Dynamic Location Problems","257404060":"Tuning of PID controller based on a multiobjective genetic algorithm applied to a robotic manipulator","282133277":"Performance assessment and optimization of an irreversible nano-scale Stirling engine cycle operating with Maxwell-Boltzmann gas","221547236":"Robustness of Multi-objective Optimal Solutions to Physical Deterioration through Active Control","222670484":"The influence of the fitness evaluation method on the performance of multiobjective search algorithms","229037684":"A genetic programming methodology for the solution of the multiobjective cell-formation problem","233712188":"Use of different forms of symmetry and multi-objective optimization for automatic pixel classification in remote-sensing satellite imagery","224222862":"Pareto Optimization of Thinned Planar Arrays With Elliptical Mainbeams and Low Sidelobe Levels","263561312":"Cycle Network Planning: Towards a Holistic Approach Using Temporal Topology","251621673":"Control of TAME reactive distillation using Non-Dominated Sorting Genetic Algorithm-II","35928573":"Asset replacement considering environmental and economic objectives.","266633273":"Joint Analysis of Lunar Surface Waves - The Apollo 16 Dataset","225181322":"Multiobjective Optimization in Linguistic Rule Extraction from Numerical Data","227668594":"Multireservoir system optimization in the Han River basin using multi‐objective genetic algorithms","220403398":"An Application of a Multi-Objective Tabu Search Algorithm to a Bicriteria Flowshop Problem","273407904":"Optimising complex pylon structures with grammatical evolution","9050982":"Bounding the Effect of Noise in Multiobjective Learning Classifier Systems","245331313":"Multi-objective balancing of assembly lines by population heuristics","272889778":"Integrated optimization of hydroelectric energy in the upper and middle Yangtze River","234055169":"Multi-objective optimisation of cutting parameters for drilling aluminium AA1050","220403408":"A Cellular Genetic Algorithm with Disturbances: Optimisation Using Dynamic Spatial Interactions","223876779":"Multi-objective self-adaptive algorithm for highly constrained problems: Novel method and applications","267550726":"Optimal Reactive Power Dispatch Incorporating UPFC Devices using NSGA II Approach","277287794":"CIP-DATA LIBRARY TECHNISCHE UNIVERSITEIT EINDHOVEN","229000784":"The Multi-Objective Distinct Candidates Optimization approach","224301737":"Investigating hybrids of evolutionary search and linear discriminant analysis for authorship attribution","265186358":"Multi-Objective Optimisation of Safety Related Systems","256129212":"Evolutionary polynomial regression to alert rainfall-triggered landslide reactivation, Landslide (in press)","2364381":"Multiobjective Optimization using a Micro-Genetic Algorithm","222400187":"Optimal sensor positioning for large scale metrology applications","2873296":"Dominance Measures for Multi-Objective Simulated Annealing","227208822":"Evolutionary Optimization for Multiobjective Portfolio Selection under Markowitz’s Model with Application to the Caracas Stock Exchange","222534332":"Multi-objective Optimization using Genetic Algorithms: a Tutorial","263503947":"Integration of the environmental management aspect in the optimization of the design and planning of energy systems"},"index":766}