{"abs":"This paper presents a framework for the theoret-ical analysis of Estimation of Distribution Algorithms (EDA). Using this framework, derived from the VC-theory, we propose non-asymptotic bounds which depend on: 1) the population size, 2) the selection rate, 3) the families of distributions used for the modelling, 4) the dimension, and 5) the number of iterations. To validate these results, optimization algorithms are applied to a context where bounds on resources are crucial, namely Design of Experiments, that is a black-box optimization with very few fitness-values evaluations.","title":"Resource-Aware Parameterizations of EDA","id":228951393,"url":"https://www.researchgate.net/publication/228951393_Resource-Aware_Parameterizations_of_EDA","names":["Sylvain Gelly","Olivier Teytaud","Christian Gagné"],"references":{"7841015":"The Estimation of Distributions and the Minimum Relative Entropy Principle","10614881":"Artificial neural networks in the modeling and optimization of aspirin extended release tablets with Eudragit L 100 as matrix substance","3642935":"Adapting arbitrary normal mutation distributions in evolution strategies: The covariance matrix adaptation","220375075":"Completely Derandomized Self-Adaptation in Evolution Strategies","246929651":"Neural network and regression methods demonstrated in the design optimization of a subsonic aircraft","236487632":"Unconstrained minimization algorithms without computation of derivatives","216300590":"Metamodel—Assisted Evolution Strategies","220701677":"Accelerating the Convergence of Evolutionary Algorithms by Fitness Landscape Approximation.","3903856":"Managing approximate models in evolutionary aerodynamic design optimization","7841020":"Drift and Scaling in Estimation of Distribution Algorithms","2837734":"A Limited Memory Algorithm for Bound Constrained Optimization","2838054":"L-BFGS-B - Fortran Subroutines for Large-Scale Bound Constrained Optimization","235710019":"Problem Definitions and Evaluation Criteria for the CEC 2005 Special Session on Real-Parameter Optimization","222235824":"Evolutionary computation and Wright\u0027s equation","247074229":"Optimisation pour l\u0027\u0027apprentissage et apprentissage pour l\u0027\u0027optimisation","220743160":"Model-Assisted Steady-State Evolution Strategies","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","234786663":"Fast Training of Support Vector Machines Using Sequential Minimal Optimization","245251717":"Algorithmes \u0027evolutionnaires assist\u0027es par des m\u0027ethodes d\u0027\u0027apprentissage en grande dimension","239473819":"Computational Approaches for Aerosp. Design: The Pursuit of Excellence","2271805":"Representations Of Quasi-Newton Matrices And Their Use In Limited Memory Methods","3904026":"An efficient genetic algorithm with less fitness evaluation by clustering","247684512":"Surrogate models in aircraf design","220740621":"On Evolutionary Optimization with Approximate Fitness Functions.","226106204":"On Model-Based Evolutionary Computation","238677918":"Random Number Generation and Quasi-Monte Carlo Methods. SIAM, Philadelphia","30876208":"Data Mining - Practical Machine Learning Tools and Techniques with JAVA Implementations","4075030":"Global convergence of unconstrained and bound constrained surrogate-assisted evolutionary search in aerodynamic shape design","220742982":"Reducing Fitness Evaluations Using Clustering Techniques and Neural Network Ensembles","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","268597356":"A Dynamic Meta-Model Approach to Genetic Algorithm Solution of a Risk-Based Groundwater Remediation Design Model","220741144":"Not all linear functions are equally difficult for the compact genetic algorithm","220695511":"Neural Network Learning: Theoretical Foundations","230675276":"A Probablistic Theory of Pattern Recognition","215635881":"Population-Based Incremental Learning: A Method for Integrating Genetic Search Based Function Optimization and Competitive Learning","245904604":"Deterministic function learning within evolutionary algorithms","220740255":"Open BEAGLE: A new versatile C++ framework for evolutionary computations","4201592":"Experimental results for the special session on real-parameter optimization at CEC 2005: A simple, continuous EDA","221271177":"The Sensitivity of PBIL to Its Learning Rate, and How Detailed Balance Can Remove It.","223881505":"Lecture Notes in Economics and Mathematical Systems","220176614":"Faster convergence by means of fitness estimation","220176678":"Structure optimization of neural networks for evolutionary design optimization","3418575":"The Compact Genetic Algorithm","220589784":"Recent Progress in Unconstrained Nonlinear Optimization without Derivatives"},"citedIn":{"225167691":"Continuous Lunches Are Free Plus the Design of Optimal Optimization Algorithms","237253006":"Comparison-based algorithms: worst-case optimality, optimality w.r.t a bayesian prior, the intraclass-variance minimization in EDA, and implementations with billiards","5826083":"Comparison-Based Algorithms Are Robust and Randomized Algorithms Are Anytime"},"index":769}