{"abs":"Statistical emulators of computer simulators have proven to be useful in a variety of applications. The widely adopted model for emulator building, using a Gaussian process model with strictly positive correlation function, is computationally intractable when the number of simulator evaluations is large. We propose a new model that uses a combination of low-order regression terms and compactly supported correlation functions to recreate the desired predictive behavior of the emulator at a fraction of the computational cost. Following the usual approach of taking the correlation to be a product of correlations in each input dimension, we show how to impose restrictions on the ranges of the correlations, giving sparsity, while also allowing the ranges to trade off against one another, thereby giving good predictive performance. We illustrate the method using data from a computer simulator of photometric redshift with 20,000 simulator evaluations and 80,000 predictions.","title":"Efficient emulators of computer experiments using compactly supported correlation functions, with application to cosmology","id":51914869,"url":"https://www.researchgate.net/publication/51914869_Efficient_emulators_of_computer_experiments_using_compactly_supported_correlation_functions_with_application_to_cosmology","names":["Cari G. Kaufman","Derek R. Bingham","Salman Habib","Katrin Heitmann","Joshua A. Frieman","The Annals of Applied Statistics"],"references":{"251154840":"On Abel—Poisson type and Riesz means","4772045":"Bayesian Calibration of Computer Models","241212902":"Criteria of Polya type for radial positive definite functions","2120071":"Default priors for Gaussian processes. Ann Stat","4914189":"Approximating likelihoods for large spatial data sets","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","228789130":"Examples of adaptive MCMC","243048373":"Kriging with large data sets using sparse matrix techniques","239667584":"A Framework for Validation of Computer Models","222590254":"Compactly Supported Correlation Functions","2319535":"Objective Bayesian Analysis of Spatially Correlated Data","280293240":"Low-Rank Representations for Spatial Processes","49458431":"A tutorial on adaptive MCMC","2243276":"Quasi-Regression","228765709":"Covariance Tapering for Interpolation of Large Spatial Datasets","243026761":"A modeling approach for large spatial datasets","216756606":"Orthogonal Array-Based Latin Hypercubes","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","231006077":"Observational Evidence from Supernovae for an Accelerating Universe and a Cosmological Constant","216301661":"Screening, Predicting, and Computer Experiments","231060958":"Measurements of Ω and Λ from 42 High-Redshift Supernovae","225802153":"Spatial designs and properties of spatial correlation: Effects on covarance estimation","227369107":"Covariance Tapering for Likelihood-Based Estimation in Large Spatial Data Sets","248301107":"Variable Selection for Gaussian Process Models in Computer Experiments"},"citedIn":{"281998350":"A Physics-Based Emulator for the Simulation of Geophysical Mass Flows","258082179":"Massively Parallel Approximate Gaussian Process Regression","235765935":"Local Gaussian Process Approximation for Large Computer Experiments","266856357":"Calibrating a large computer experiment simulating radiative shock hydrodynamics","276175316":"Probabilistic quantification of hazards: A methodology using small ensembles of physics-based simulations and statistical surrogates","264921993":"Estimating sensitivity indices based on Gaussian process metamodels with compactly supported correlation functions","230666875":"Prediction and Computer Model Calibration Using Outputs From\nMulti-fidelity Simulators","265258439":"Evolving Bayesian Emulators for Structured Chaotic Time Series, with Application to Large Climate Models","262642767":"Emulating and calibrating the multiple-fidelity Lyon–Fedder–Mobarry magnetosphere–ionosphere coupled computer model","263499679":"Estimating Percentiles in Computer Experiments: A Comparison of Sequential-Adaptive Designs and Fixed Designs","224040074":"Computer Model Calibration Using the Ensemble Kalman Filter","282400455":"Posterior Belief Assessment: Extracting Meaningful Subjective Judgements from Bayesian Analyses with Complex Statistical Models","241724347":"Statistical Properties of Covariance Tapers","262969306":"Estimating Sensitivity Indices from Computer Simulator Output","221669294":"A Short Note on Gaussian Process Modeling for Large Datasets using\nGraphics Processing Units","259353869":"Large Covariance Estimation by Thresholding Principal Orthogonal Complements","265252310":"Speeding up neighborhood search in local Gaussian process prediction","257318924":"A robust Kriging model for predicting accumulative outflow from a mature reservoir considering a new horizontal well","232959548":"Analysis of Computer Experiments With Functional Response","263679081":"Spline-Based Emulators for Radiative Shock Experiments With Measurement Error"},"index":770}