{"abs":"Surrogate-assisted evolutionary algorithms have been widely utilized in science and engineering fields, while rare theoretical results were reported on how surrogates influence the performances of evolutionary algorithms (EAs). This paper focuses on theoretical analysis of a (1+1) surrogate-assisted evolutionary algorithm ((1+1)SAEA), which consists of one individual and pre-evaluates a newly generated candidate using a first-order polynomial model (FOPM) before it is precisely evaluated at each generation. By performing comparisons between a unimodal problem and a multi-modal problem, we rigorously estimate the variation of exploitation ability and exploration ability introduced via the FOPM. Theoretical results show that the FOPM employed to pre-evaluate the candidates sometimes accelerate the convergence of evolutionary algorithms, while sometimes prevents the individuals from converging to the global optimal solution. Thus, appropriate adaptive strategies of candidate generation and surrogate control are needed to accelerate the convergence of the (1+1)EA. Then, the accelerating effect of FOPM decreases monotonically with p, the probability of performing precise function evaluation when a candidate is pre-evaluated worse than the present individual.","title":"How can surrogates influence the convergence of evolutionary algorithms?","id":259170620,"url":"https://www.researchgate.net/publication/259170620_How_can_surrogates_influence_the_convergence_of_evolutionary_algorithms","names":["Yu Chen","Weicheng Xie","Xiufen Zou","Swarm and Evolutionary Computation"],"references":{"226979079":"Multi-Objective Optimization Using Surrogates","235308036":"Surrogate assisted local search in PMSM drive design","224049497":"Evolutionary Optimization of Computationally Expensive Problems via Surrogate Modeling","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","271880689":"Memetic algorithms and memetic computing optimization: A literature review","221024234":"Surrogate Deterministic Mutation: Preliminary Results","220381096":"Max-Min Surrogate-Assisted Evolutionary Algorithm for Robust Design","2385583":"A Rigorous Framework for Optimization of Expensive Functions by Surrogates","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","3810165":"Genetic crossover strategy using an approximation concept","223302878":"Progress in design optimization using evolutionary algorithms for aerodynamic problems","257739789":"An introduction and survey of estimation of distribution algorithms","2631230":"Informed operators: Speeding up genetic-algorithm-based design optimization using reduced models","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","228767803":"A minimal cost hybrid strategy for pareto optimal front approximation","233882605":"Generalizing surrogate-assisted evolutionary computation. IEEE Trans Evol Comput","220176770":"Memetic algorithm using multi-surrogates for computationally expensive optimization problems. Soft Comput","246122676":"Evolutionary optimization in uncertain environments","233556491":"Acceleration of the convergence speed of evolutionary algorithms using multi-layer neural networks","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","235255969":"Metamodeling Method Using Dynamic Kriging for Design Optimization","3421724":"Bioinformatics with soft computing","3418714":"A framework for evolutionary optimization with approximate fitness functions. IEEE Trans Evol Comput","43797802":"A Mono Surrogate for Multiobjective Optimization","220199655":"An efficient multi-objective optimization method for black-box functions using sequential approximate technique. Appl Soft Comput","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","3418893":"Max-min surrogate-assisted evolutionary algorithm for robust design","220661467":"Drift conditions for estimating the first hitting times of evolutionary algorithms"},"citedIn":{"271972964":"Multi-objective optimization of drive gears for power split device using surrogate models","263010896":"Performance Analysis of a (1+1) Surrogate-assisted Evolutionary Algorithm"},"index":774}