{"abs":"The Adaptive Multiple Importance Sampling (AMIS) algorithm is aimed at an optimal recycling of past simulations in an iterated importance sampling scheme. The difference with earlier adaptive importance sampling implementations like Population Monte Carlo is that the importance weights of all simulated values, past as well as present, are recomputed at each iteration, following the technique of the deterministic multiple mixture estimator of Owen and Zhou (2000). Although the convergence properties of the algorithm cannot be fully investigated, we demonstrate through a challenging banana shape target distribution and a population genetics example that the improvement brought by this technique is substantial.","title":"Adaptive Multiple Importance Sampling","id":45861000,"url":"https://www.researchgate.net/publication/45861000_Adaptive_Multiple_Importance_Sampling","names":["Jean-Marie Cornuet","Jean-Michel Marin","Antonietta Mira","Christian P. Robert","Scandinavian Journal of Statistics"],"references":{"1759003":"Convergence of adaptive mixtures of importance sampling schemes","228940071":"Cross-Entropy Method","2468774":"A Theory for Dynamic Weighting in Monte Carlo Computation","23306983":"Inferring population history with DIY ABC: a user-friendly approach to Approximate Bayesian","3361206":"Novel Approach to Nonlinear/Non-Gaussian Bayesian State Estimation","2762543":"Adaptive proposal distribution for random walk Metropolis algorithm. Comput Stat","220720288":"Optimally Combining Sampling Techniques for Monte Carlo Rendering","37623604":"Robust Mixture Modelling Using the t Distribution","2836794":"Population Monte Carlo","2453431":"A Sequential Particle Filter Method for Static Models","234140128":"Adaptive Importance Sampling for Estimation in Structured Domains","41909286":"Estimating and Projecting Trends in HIV/AIDS Generalized Epidemics Using Incremental Mixture Importance Sampling","1825409":"Sequential monte carlo samplers","3193130":"Assessing a mixture model for clustering with the integrated completed likelihood. IEEE Trans Pattern Anal Mach Intell","228721976":"Limit theorems for weighted samples with applications to Sequential Monte Carlo Methods","45624295":"Minimum variance importance sampling via Population Monte Carlo","222701030":"Model-based Cluster and Discriminant Analysis with the MIXMOD software","2241728":"Safe and Effective Importance Sampling","227009696":"Adaptive Importance Sampling in General Mixture Classes","8469673":"Multilocus Methods for Estimating Population Sizes, Migration Rates and Divergence Time, With Applications to the Divergence of Drosophila pseudoobscura and D. persimilis","215446267":"Monte Carlo Strategies in Scientic Computing","200744518":"Sequential Monte-Carlo Methods in Practice","2559189":"On Sequential Monte Carlo Sampling Methods for Bayesian Filtering","6895902":"A note on the accuracy of PAC-likelihood inference with microsatellite data","45622656":"Monte Carlo Statistical Methods","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160","226899903":"An Adaptive Importance Sampling Technique"},"citedIn":{"227522317":"Particle Markov Chain Monte Carlo . . .","276922885":"Layered Adaptive Importance Sampling","241756333":"Parallel hierarchical sampling: A general-purpose interacting Markov chains Monte Carlo algorithm","275650409":"Quantifying Precipitation Uncertainty for Land Data Assimilation Applications","277313035":"Adaptive Importance Sampling in Signal Processing","281202190":"Issues in the Multiple Try Metropolis mixing","277004303":"An Adaptive Population Importance Sampler: Learning From Uncertainty","45901041":"Bayesian Computational Methods","266558574":"Characterization of Uncertainty in Remotely-Sensed Precipitation Estimates","257701514":"Sequential Monte Carlo with Adaptive Weights for Approximate Bayesian Computation","280330280":"Gradient Importance Sampling","280102383":"slides of Layered Adaptive Importance Sampling (related to presentation of David Luengo in Oxford, June 2015)","283762228":"Generalized Multiple Importance Sampling","227657870":"Riemann manifold Langevin and Hamiltonian Monte Carlo methods. J. R. Stat. Soc. B 73, 123-214","45901023":"On computational tools for Bayesian data analysis","254405900":"A Survey of Sequential Monte Carlo Methods for Economics and Finance","45882586":"Comments on \"Particle Markov chain Monte Carlo\" by C. Andrieu, A. Doucet, and R. Hollenstein","264466468":"An adaptive population importance sampler","45885467":"Comments on \"Particle Markov Chain Monte Carlo\" by C. Andrieu, A. Doucet and R. Hollenstein","47637681":"Discussion of \"Riemann manifold Langevin and Hamiltonian Monte Carlo methods\u0027\u0027 by M. Girolami and B. Calderhead","23977796":"Bayesian Computational Methods","275363904":"Efficient Sequential Monte-Carlo Samplers for Bayesian Inference","234087001":"Approximate Bayesian computation via empirical likelihood","236578354":"Initializing adaptive importance sampling with Markov chains","261316984":"Adaptive importance sampling in particle filtering","228275312":"A Class of Adaptive EM-Based Importance Sampling Algorithms for Efficient and Robust Posterior and Predictive Simulation","280773011":"Adaptive Multiple Importance Sampling for Gaussian Processes","235359528":"Bayesian inference for the multivariate skew-normal model: a Population\nMonte Carlo approach","269722338":"Adaptive Importance Sampling via Stochastic Convex Programming","281850040":"A GRADIENT ADAPTIVE POPULATION IMPORTANCE SAMPLER","247928691":"Final gathering using adaptive multiple importance sampling","269722347":"Expectation propagation as a way of life","271749195":"Efficient Sequential Monte Carlo Sampling for Continuous Monitoring of a Radiation Situation","257338157":"Proposal adaptation in simulated annealing for continuous optimization problems","49907842":"Lack of confidence in ABC model choice","281145150":"Issues in the Multiple Try Metropolis mixing"},"index":780}