{"abs":"Many real-world optimization problems have several, usually conflicting objectives. Evolutionary multi-objective optimization usually solves this predicament by searching for the whole Pareto-optimal front of solutions, and relies on a decision maker to finally select a single solution. However, in particular if the number of objectives is large, the number of Pareto-optimal solutions may be huge, and it may be very difficult to pick one “best” solution out of this large set of alternatives. As we argue in this paper, the most interesting solutions of the Pareto-optimal front are solutions where a small improvement in one objective would lead to a large deterioration in at least one other objective. These solutions are sometimes also called “knees”. We then introduce a new modified multi-objective evolutionary algorithm which is able to focus search on these knee regions, resulting in a smaller set of solutions which are likely to be more relevant to the decision maker.","title":"Finding Knees in Multi-objective Optimization","id":225109103,"url":"https://www.researchgate.net/publication/225109103_Finding_Knees_in_Multi-objective_Optimization","names":["Juergen Branke","Kalyan Deb","Henning Dierolf","Matthias Osswald"],"references":{"3949503":"Scalable multi-objective optimization test problems","220380772":"Preferences and their Application in Evolutionary Multiobjective Optimisation","227443977":"A Class of Solutions for Group Decision Problems","226733706":"On characterizing the “knee” of the Pareto curve based on Normal-Boundary Intersection","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","28352092":"Multi-objective Genetic Algorithms : Problem Difficulties and Construction of Test Problems","2633240":"Multi-Objective Evolutionary Algorithms: Introducing Bias Among Pareto-Optimal Solutions","221271170":"Fitness Functions for Multiple Objective Optimization Problems: Combining Preferences with Pareto Rankings.","235709918":"Nonlinear Multiobjective Optimization","12809680":"Deb, K.: Multi-Objective Genetic Algorithms: Problem Difficulties and Construction of Test Problems. Evolutionary Computation 7, 205-230","216300368":"Integrating User Preferences into Evolutionary Multi-Objective Optimization","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","246830819":"Minimal Representation of Multiobjective Design Space Using a Smart Pareto Filter","265441447":"A Class of Solutions for Group Decision Problems","2811965":"Guidance in Evolutionary Multi-Objective Optimization","12473892":"Multiobjective Evolutionary Algorithms: Analyzing the State-of-the-Art","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II"},"citedIn":{"269275405":"A Knee Point Driven Evolutionary Algorithm for Many-Objective Optimization","276175733":"Preference representation using Gaussian functions on a hyperplane in evolutionary multi-objective optimization","6357350":"Multiobjective optimization in bioinformatics and computational biology. IEEE/ACM Trans Comput Biol Bioinform (TCBB) 4:279-292","276279167":"A New Evolutionary Multi-objective Algorithm for Convex Hull Maximization","273351491":"Many-objective optimization with corner-based search","260666240":"A Multiobjective Approach for Source Estimation in Fuzzy Networked Systems","270723371":"Learning Value Functions in Interactive Evolutionary Multiobjective Optimization","263734962":"Zhang Q. and Mahfouf M.: ‘A nature-inspired multi-objective optimisation strategy based on a new reduced space searching algorithm for the design of alloy steels’, Eng. Appl. Artif. Intell.","221147428":"Model-Based Multi-objective Safety Optimization","223029573":"Multicriteria decisions on interdependent infrastructure transportation projects using an evolutionary-based framework","262217902":"Agent-Based Simulation for Large-Scale Emergency Response: A Survey of Usage and Implementation","221205054":"I-EMO: An Interactive Evolutionary Multi-objective Optimization Tool","3418917":"An evolutionary approach to multiobjective clustering. IEEE Trans Evol Comput","267867878":"Efficient Robust Geotechnical Design of Drilled Shafts in Clay Using a Spreadsheet","220740660":"Embedded evolutionary multi-objective optimization for worst case robustness","267867883":"Gradient-based design robustness measure for robust geotechnical design","232626115":"Multi-Objective Optimization of Surface Grinding Process Using NSGA II","228953275":"Robust Bio-Active Peptide Prediction using Multi-Objective Optimization","262405508":"On Set-Based Multiobjective Optimization","220265480":"Multi-Objective Optimization of Particle Reinforced Silicone Rubber Mould Material for Soft Tooling Process","224367989":"Probability of error bounds for failure diagnosis and classification in hidden Markov models","220403464":"Pruned Pareto-optimal sets for the system redundancy allocation problem based on prioritized objectives","282610677":"Many-Objective Problems: Challenges and Methods","220176433":"Searching for knee regions of the Pareto front using mobile reference points","228810391":"Understanding knee points in bicriteria problems and their implications as preferred solution principles","221024792":"Introduction to Evolutionary Multiobjective Optimization","224177769":"Many-objective Distinct Candidates Optimization using Differential Evolution on centrifugal pump design problems","4375924":"Combining Multiobjective Fuzzy Clustering and Probabilistic ANN Classifier for Unsupervised Pattern Classification: Application to Satellite Image Segmentation","221024794":"Consideration of Partial User Preferences in Evolutionary Multiobjective Optimization","220381210":"Ensemble of Constraint Handling Techniques","280033160":"Use HypE to Hide Association Rules by Adding Items","257334892":"A modified directed search domain algorithm for multiobjective engineering and design optimization","229369750":"Multiobjective genetic algorithm strategies for electricity production from generation IV nuclear technology","257432422":"Design of particle-reinforced polyurethane mould materials for soft tooling process using evolutionary multi-objective optimization algorithms","220176735":"Adaptation and application of multi-objective evolutionary algorithms for rule reduction and parameter tuning of fuzzy rule-based systems. Soft Comput","261412565":"Multi-Objective Optimization of Formal Specifications","262304999":"Including preferences into a multiobjective evolutionary algorithm to deal with many-objective engineering optimization problems","220204903":"A multi-objective evolutionary algorithm for an effective tuning of fuzzy logic controllers in heating, ventilating and air conditioning systems. Appl Intell","4219400":"A hybrid fuzzy evolutionary algorithm for a multi-objective resource allocation problem","266388138":"Crushing analysis and numerical optimization of angle element structures under axial impact loading","228233681":"A Unified Market Segmentation Method for Generating Pareto Optimal Solutions Sets","229346278":"Decision making in multiobjective optimization aided by the multicriteria tournament decision method","224105750":"A classical-cum-Evolutionary Multi-objective optimization for optimal machining parameters","266388141":"Theoretical prediction and crashworthiness optimization of multi-cell triangular tubes","270723437":"Visualization of Pareto Front Approximations in Evolutionary Multiobjective Optimization: A Critical Review and the Prosection Method","275204919":"Toward High Performance Solution Retrieval in Multiobjective Clustering","257588747":"Higher and lower-level knowledge discovery from Pareto-optimal sets","265389952":"An integrated methodology for robustness analysis in feature fatigue problem","224674614":"A Multi-objective Evolutionary Methodology for an Interdependent Transportation Project Selection Problem","3153253":"MOMS-GA: A Multi-Objective Multi-State Genetic Algorithm for System Reliability Optimization Design Problems","272712724":"Robust design in geotechnical engineering – an update","233178046":"High resolution material ablation and deposition with femtosecond lasers and applications to photomask repair. J. Mod. Optic. 51, 2781-2796","221228407":"Exploiting the Trade-off — The Benefits of Multiple Objectives in Data Clustering","226202147":"Recent Developments in Evolutionary Multi-Objective Optimization","224175111":"Integration of Preferences in Hypervolume-Based Multiobjective Evolutionary Algorithms by Means of Desirability Functions","221228367":"Multi-Objective Distinct Candidates Optimization (MODCO): A Cluster-Forming Differential Evolution Algorithm","224472326":"Automatic Clustering with Multi-objective Differential Evolution Algorithms","275721992":"Optimal driving during electric vehicle acceleration using evolutionary algorithms","229033934":"Analysis of the impact of using different diversity functions for the subgroup discovery algorithm NMEEF-SD","254469187":"The Quality-Aware Service Selection Problem: An Adaptive Evolutionary Approach:Application to the Selection of Distributed Data and Software Services in the ATLAS Experiment","262286281":"A Multi-objective Optimization Energy Approach to Predict the Ligand Conformation in a Docking Process","287229296":"Clustering Using Multi-objective Differential Evolution Algorithms","221204575":"A parallel multi-objective Ab initio approach for protein structure prediction","220742234":"Evolutionary Multiobjective Optimization","224579856":"Multiobjective Genetic Algorithm-Based Fuzzy Clustering of Categorical Attributes","263496902":"Optimal Design of Titanium Alloys for Prosthetic Applications Using a Multiobjective Evolutionary Algorithm","233617311":"Influence of age on masonry bond strength and mortar microstructure","224580117":"Multiobjective Evolutionary Algorithm With Controllable Focus on the Knees of the Pareto Front","224645913":"A Multi-Objective Genetic Algorithm with Controllable Convergence on Knee Regions","221547338":"Bayesian Reliability Analysis under Incomplete Information Using Evolutionary Algorithms","262317021":"Advances in Evolutionary Multi-objective Optimization","282305452":"A knee-based multi-objective evolutionary algorithm: an extension to network system optimization design problem","6937065":"A multi-objective evolutionary approach to the protein structure prediction problem. J R Soc Interface 3:139-151","251917186":"MOMS-HDEA: A Multi-Objective MultiState Hybrid Differential Evolution Algorithm for System Reliability Optimization Design Problems","237325991":"A multi-objective evolutionary algorithm for determining optimal configurations of multi-task production systems","3418802":"Dynamic Multiobjective Optimization Problems: Test Cases, Approximations, and Applications","282540113":"Parameter Estimation for Coupled Hydromechanical Simulation of Dynamic Compaction Based on Pareto Multiobjective Optimization","263497523":"Application of imperialist competitive algorithm and neural networks to optimise the volume fraction of three-parameter functionally graded beams","273395660":"Utility Function-Based Real-Time Control of A Battery Ultracapacitor Hybrid Energy System","231743066":"Identifying the Preferred Subset of Enzymatic Profiles in Nonlinear Kinetic Metabolic Models via Multiobjective Global Optimization and Pareto Filters","263066405":"Genetic Algorithm–Based Design and Development of Particle-Reinforced Silicone Rubber for Soft Tooling Process","226442227":"Multiobjective evolutionary clustering of Web user sessions: A case study in Web page recommendation","220702135":"Approximating the Knee of an MOP with Stochastic Search Algorithms","268694419":"Electric vehicle range prediction for constant speed trip using multi-objective optimization","225973481":"Computational Studies of Peptide and Protein Structure Prediction Problems via Multiobjective Evolutionary Algorithms","228412684":"Preference-based Multi-objective distinct candidates optimization","224472308":"Evolutionary Image Segmentation Based on Multiobjective Clustering","284779375":"Preference Incorporation in Evolutionary Multiobjective Optimization: A Survey of the State-of-the-Art","291185600":"Biobjective robust optimization over the efficient set for Pareto set reduction","263089202":"Searching for Pareto-optimal solutions through dimensionality reduction for certain large-dimensional multi-objective optimization problems","272568226":"Design of a comfortable optimal driving strategy for electric vehicles using multi-objective optimization","283686261":"Calibration of empirical models considering model fidelity and model robustness — Focusing on predictions of liquefaction-induced settlements","271951531":"A direction based classical method to obtain complete Pareto set of multi-criteria optimization problems","258329796":"Organic Computing","267867990":"Robust Geotechnical Design of Earth Slopes Using Fuzzy Sets","277947189":"Multiobjective optimal design of friction stir welding considering quality and cost issues","254503309":"Performance Indices for Multiobjective Distinct Candidates Optimization (MODCO)","257051898":"Economic and environmental impacts of the energy source for the utility production system in the HDA process","265869425":"Distinct Candidates Optimization: A Novel Approach to Applied Evolutionary Multi-and Many-Objective Optimization","221196677":"Towards a Link between Knee Solutions and Preferred Solution Methodologies","220740227":"A robust evolutionary framework for multi-objective optimization","220200113":"Multi-objective Distinct Candidates Optimization: Locating a few highly different solutions in a circuit component sizing problem","249910358":"Multiobjective Graph Clustering with Variable Neighbourhood Descent","46510192":"Integrating prometheeii with the tchebycheff function for multi criteria decision making","273001203":"Finding Robust Pareto-optimal Solutions Using Geometric Angle-Based Pruning Algorithm","256484081":"Corner Based Many-Objective Optimization","224177823":"A parallel framework for multi-objective evolutionary optimization","227183695":"Modes of Problem Solving with Multiple Objectives: Implications for Interpreting the Pareto Set and for Decision Making","224645801":"Preference Incorporation in Multi-objective Evolutionary Algorithms: A Survey","262112334":"Software prototype for solving multi-objective machining optimization problems: Application in non-conventional machining processes","221001727":"Searching for knee regions in multi-objective optimization using mobile reference points","220689651":"Multiobjective Genetic Algorithms for Clustering - Applications in Data Mining and Bioinformatics.","252016848":"Evolutionary Multi-Objective Algorithm to effectively improve the performance of the classic tuning of fuzzy logic controllers for a heating, ventilating and Air Conditioning system","29603605":"Automatic Clustering Using a Synergy of Genetic Algorithm and Multi-objective Differential Evolution","220741887":"A multi-objective evolutionary algorithm with weighted-sum niching for convergence on knee regions","223138454":"Multi-Objective Differential Evolution for Automatic Clustering with Application to Micro-Array Data Analysis","270007245":"On the use of filters to facilitate the post-optimal analysis of the Pareto solutions in multi-objective optimization","255564256":"Microsoft-CNRS Chair \"Optimization for Sustainable Development\", Activity Report 2009-2011","265408780":"Techniques to Deal with Many-objective Optimization Problems Using Evolutionary Algorithms","285385698":"Simplified Robust Geotechnical Design of Soldier Pile-Anchor Tieback Shoring System for Deep Excavation","220444098":"Data Clustering Using Multi-objective Differential Evolution Algorithms","267844884":"A Multi-objective Procedure for Efficient Regression Modeling","266388227":"Theoretical prediction and crashworthiness optimization of multi-cell square tubes under oblique impact loading","251565083":"A comparative study of different approaches using an outranking relation in a multi-objective evolutionary algorithm","228928332":"On finding Pareto-optimal solutions through dimensionality. Reduction for certain large-dimensional multi-objective optimization problems","216457231":"Theory of the Hypervolume Indicator: Optimal μ-Distributions and the Choice of the Reference Point","260095593":"Application of data mining in multiobjective optimization problems","290511036":"R-LRFD: Load and resistance factor design considering robustness","282218815":"The Knee of the PARETO Frontier for Multi-Objective Optimization Design of Bio-Processes","284234268":"Robustness methodology to aid multiobjective decision making in the electricity generation capacity expansion problem to minimize cost and water withdrawal","238665931":"A Taxonomic Bit-Manipulation Approach to Genetic Problem Solving","272360136":"A method for capturing the entire fuzzy non-dominated set of a fuzzy multi-criteria optimization problem","229000784":"The Multi-Objective Distinct Candidates Optimization approach","220742367":"Multiobjective clustering with automatic k-determination for large-scale data","259539855":"Indicator-based Selection in Evolutionary Multiobjective Optimization Algorithms Based On the Desirability Index","270723288":"An Evolutionary Multiobjective Approach to Sparse Reconstruction","287406299":"A Knee-Based EMO Algorithm with an Efficient Method to Update Mobile Reference Points","222889399":"Hypervolume-based Multiobjective Optimization: Theoretical Foundations and Practical Implications","279257691":"R2-EMOA: Focused Multiobjective Search Using R2-Indicator-Based Selection"},"index":808}