{"abs":"State-trace methods have recently been advocated for exploring the latent dimensionality of psychological processes. These methods rely on assessing the monotonicity of a set of responses embedded within a state-space. Prince et al. (2012) proposed Bayes factors for state-trace analysis, allowing the assessment of the evidence for monotonicity within individuals. Under the assumption that the population is homogeneous, these Bayes factors can be combined across participants to produce a “group” Bayes factor comparing the monotone hypothesis to the non-monotone hypothesis. However, combining information across individuals without assuming homogeneity is problematic due to the nonparametric nature of state-trace analysis. We introduce group-level Bayes factors that can be used to assess the evidence that the population is homogeneous vs. heterogeneous, and demonstrate their utility using data from a visual change-detection task. Additionally, we describe new computational methods for rapidly computing individual-level Bayes factors.","title":"Bayes factors for state-trace analysis","id":282268554,"url":"https://www.researchgate.net/publication/282268554_Bayes_factors_for_state-trace_analysis","names":["Clintin P Davis-Stober","Richard Donald Morey","Matthew Gretton","Andrew Heathcote","Journal of Mathematical Psychology"],"references":{"227007493":"Accounts of the confidence-accuracy relation in recognition memory. Psychon Bull Rev, 7, 26-48","5305042":"The Dimensionality of the Remember-Know Task: A State-Trace Analysis","9329676":"Vocalization-at-presentation and immediate recall, with varying presentation-rates","20861308":"Verbal overshadowing of visual memories: Some things are better left unsaid. Cognit. Psychol. 22: 36-71","222828428":"Problematic effects of aggregation in z ROC analysis and a hierarchical modeling solution","26881756":"A dissociation between similarity effects in episodic face recognition","10863970":"What Can we Infer from Double Dissociations?","226033777":"On interpretation of interactions","229160801":"An R package for state-trace analysis","5407198":"Revisiting Evidence for Modularity and Functional Equivalence Across Verbal and Spatial Domains in Memory","38363783":"Laplace\u0027s 1774 Memoir on Inverse Probability","223883031":"State-trace analysis: A method of testing simple theories of causation","262024269":"State-trace analysis can be an appropriate tool for assessing the number of cognitive systems: A reply to Ashby (2014)","4904988":"Induced Binary Probabilities and the Linear Ordering Polytope: A Status Report","239742941":"1988: From Neuropsychology to Mental Structure","4904989":"Geometric and combinatorial properties of the polytope of binary choice probabilities","49619437":"Confidence Intervals from Normalized Data: A correction to Cousineau (2005)","40869047":"Separating Mnemonic Process From Participant and Item Effects in the Assessment of ROC Asymmetries","7378542":"Inequality Constrained Analysis of Variance: A Bayesian Approach.","44676343":"The dimensionality of perceptual category learning: A state-trace analysis","51724363":"Parsimonious Testing of Transitive or Intransitive Preferences: Reply to Birnbaum (2011) REPLY","51724362":"Testing Mixture Models of Transitive Preference: Comment on Regenwetter, Dana, and Davis-Stober (2011)","243768600":"Utility of Gains and Losses: Measurement-Theoretical and Experimental Ap-proaches","5245554":"Dimensions in data: Testing psychological models using state-trace analysis","243775842":"Bayesian Analysis of Constrained Parameter and Truncated Data Problems Using Gibbs Sampling","8234388":"Linear theory, dimensional theory, and the face-inversion effect","233531713":"Recollection and confidence in two-alterative forced choice episodic recognition","19801794":"Discovering Functionally Independent Mental Processes: The Principle of Reversed Association","51757754":"The Design and Analysis of State-Trace Experiments","238652808":"Bayesian Model Selection in Social Research","15525022":"Functional Equivalence of Verbal and Spatial Information in Serial Short-Term Memory","10268399":"The problem of inference from curves based on group data. Psychological Bulletin, 53, 134-140","2463953":"Numerical Computation Of Multivariate Normal Probabilities","13709414":"On the Relations among Different Measures of Visible and Informational Persistence","7364872":"Forward Inference Using Functional Neuroimaging: Dissociations Versus Associations","232174639":"Working Memory and Changing-State Hypothesis","263709134":"QTest: Quantitative Testing of Theories of Binary Choice","221950784":"On the meaning of statistical interactions","230709627":"A lexicographic semiorder polytope and probabilistic representations of choice","49764235":"Transitivity of Preferences","259721734":"Is state-trace analysis an appropriate tool for assessing the number of cognitive systems?","7327313":"An introduction to Bayesian hierarchical models with an application in theory of signal detection"},"citedIn":{"283448085":"A statistical test for equality of latent orders"},"index":812}