{"abs":"A learning account for the problem of object recognition is developed within the probably approximately correct (PAC) model of learnability. The key assumption underlying this work is that objects can be recognized (or discriminated) using simple representations in terms of syntactically simple relations over the raw image. Although the potential number of these simple relations could be huge, only a few of them are actually present in each observed image, and a fairly small number of those observed are relevant to discriminating an object. We show that these properties can be exploited to yield an efficient learning approach in terms of sample and computational complexity within the PAC model. No assumptions are needed on the distribution of the observed objects, and the learning performance is quantified relative to its experience. Most important, the success of learning an object representation is naturally tied to the ability to represent it as a function of some intermediate representations extracted from the image. We evaluate this approach in a large-scale experimental study in which the SNoW learning architecture is used to learn representations for the 100 objects in the Columbia Object Image Library. Experimental results exhibit good generalization and robustness properties of the SNoW-based method relative to other approaches. SNoW\u0027s recognition rate degrades more gracefully when the training data contains fewer views, and it shows similar behavior in some preliminary experiments with partially occluded objects.","title":"Learning to Recognize Three-Dimensional Objects","id":11395425,"url":"https://www.researchgate.net/publication/11395425_Learning_to_Recognize_Three-Dimensional_Objects","names":["Dan Roth","Ming-Hsuan Yang","Narendra Ahuja","Neural Computation"],"references":{"20856254":"Poggio, T. \u0026 Edelman, S. A network that learns to recognize 3D objects. Nature 343, 263−266","220499751":"A Computational Model for Visual Selection","238718393":"Pentland- \"eigenfaces for recognition","3854143":"Boosting Image Retrieval","225070191":"A Decision-Theoretic Generalization of On-Line Learning and an Application to Boosting","49711743":"Classifying Facial Actions","220343595":"Learning Boolean Functions in an Infinite Attribute Space","234793335":"A theory of the learnable. Commun ACM","3814325":"View-based 3D object recognition with support vector machines","222456530":"An Active Vision Architecture based on Iconic Representations","227201563":"Learning Quickly When Irrelevant Attributes Abound. A New Linear-threshold Algorithm","2925496":"Learning in the Presence of Malicious Errors","5595969":"The Nature Of Statistical Learning Theory","226823186":"On learning visual concepts and DNF formulae","216792818":"Comparison of learning algorithms for handwritten digit recognition","10832697":"Ullman, S. \u0026 Soloviev, S. Computation of pattern invariance in brain-like structures. Neural Net. 12, 1021−1036","1955072":"A Learning Approach to Shallow Parsing","12200741":"Models of object recognition","2620679":"Relational Representations that Facilitate Learning","2333952":"Comparison Of Learning Algorithms For Handwritten Digit Recognition","226894880":"A Winnow-Based Approach to Context-Sensitive Spelling Correction","3758751":"Probabilistic modeling of local appearance and spatial relationships for object recognition","239329253":"A network that learns to recognize 3D objects","3192856":"Support Vector Machines for 3D object recognition","222443115":"Equivalence of models for polynomial learnability","220660490":"Nayar, S.K.: Visual learning and recognition of 3D objects from appearance. Int. J. Comput. Vis. 14(1), 5-24","2639237":"Crowley, J.L.: Recognition without correspondence using multidimensional receptive field histograms. Int. J. Comput. Vis. 36(1), 31-50","13488482":"Large-scale tests of a keyed, appearance-based 3-D object recognition system","2435990":"Minimizing Binding Errors Using Learned Conjunctive Features","221591296":"Computational Learning Theory: Survey and Selected Bibliography","2263191":"Local Feature Analysis: A general statistical theory for object representation","221304710":"Learning to Recognize 3D Objects with SNoW","236736807":"Estimation of Dependences Based on Empirical Data","247575678":"REPRESENTATION AND RECOGNITION IN VISION.: By Shimon Edelman. 1999","4355197":"Learning Quickly When Irrelevant Attributes Abound: A New Linear-Threshold Algorithm","9964510":"The Perceptron: A Probabilistic Model For Information Storage And Organization in the Brain","221497598":"Redundant Noisy Attributes, Attribute Errors, and Linear-Threshold Learning Using Winnow.","220343922":"Support Vector Network","2769400":"The Perceptron algorithm vs. Winnow: linear vs. logarithmic mistake bounds when few input variables are relevant","221497447":"Equivalence of Models for Polynomial Learnability.","221619681":"Classification by Pairwise Coupling","222190436":"Decision Theoretic Generalizations of the PAC Model for Neural Net and Other Learning Applications","2373118":"Scaling Up Context-Sensitive Text Correction","3816672":"A cluster-based statistical model for object detection","3191787":"Learnable and Nonlearnable Visual Concepts","3192172":"On Learning to Recognize 3-D Objects from Examples","220181883":"On Learning to Recognize 3-D Objects from Examples.","221619409":"A SNoW-based face detector","226947811":"Toward Efficient Agnostic Learning","256075302":"Eigenfaces for Recognition. J Cogn Neurosci","227191648":"A Trainable System for Object Detection","2240462":"Graded Learning for Object Detection","2689604":"Learning to Resolve Natural Language Ambiguities: A Unified Approach","3631578":"Real-time 100 object recognition system","3758667":"Texture recognition using a non-parametric multi-scale statistical model","221591750":"Additive versus exponentiated gradient updates for linear prediction","221497540":"On Learning Visual Concepts and DNF Formulae","2606045":"View-Based 3D Object Recognition Using SNoW","14057645":"SEEMORE: Combining Color, Shape, and Texture Histogramming in a Neurally Inspired Approach to Visual Object Recognition","243782779":"A network that learns to recognize three-dimensional objects\" Nature 343 263-266","2799191":"Large Margin Classification Using the Perceptron Algorithm","221995973":"A decision-theoretic generalization of on-line learning and an application to boosting","12545473":"Minimizing Binding Errors Using Learned Conjunctive Features"},"citedIn":{"222678725":"Object recognition based on image sequences by using inter-feature-line consistencies","222829834":"Dynamics of Facial Expression Extracted Automatically from Video","224124958":"Cost-Sensitive Boosting","279074405":"Mapping to optimal regions; A new method for multi-class classification task to reduce complexity","239562893":"Faculty and Their Interests","268362800":"AdaBoost learning of shape and color features for object recognition","220464949":"Locality preserving and global discriminant projection with prior information","9077982":"Pattern Filtering for Detection of Neural Activity, with Examples from HVc Activity During Sleep in Zebra Finches","257093191":"Minimum Bayes error features for visual recognition","4150697":"Minimum Bayes Error Features for Visual Recognition by Sequential Feature Selection and Extraction","4119592":"Dynamics of Facial Expression Extracted Automatically from Video","6232585":"Object recognition by artificial cortical maps","3541153":"Intelligent pattern recognition in 3D vision for robot control","225137586":"The Kullback-Leibler Kernel as a Framework for Discriminant and Localized Representations for Visual Recognition","41039787":"Itti, L.: A bayesian model for efficient visual search and recognition. Vis. Res. 50(14), 1338-1352","8198113":"Learning to detect objects in images via a sparse Part-base representation","38112347":"A View-Based Approach to Three Dimensional Object Recognition","221305263":"Using Inter-feature-Line Consistencies for Sequence-Based Object Recognition","7211791":"Sparse representation for coarse and fine object recognition","261387447":"Comparison of methods for smile deceit detection by training AU6 and AU12 simultaneously","228875520":"Canadian Robotic Vision Special Issue Minimum Bayes Error Features for Visual Recognition","266557958":"Sparse distributed localised gradient fused features of objects","221475285":"Online Closure-Based Learning of Relational Theories","270632263":"Neighborhood Feature Line Segment for Image Classification","36226703":"Inference with classifiers : the phrase identification problem /","224292791":"Multi-Stage Optimal Component Analysis","272239696":"A new class of multi-stable neural networks: Stability analysis and learning process","260665573":"An improved LBP transfer learning for remote sensing object recognition","10698894":"Learning Optimized Features for Hierarchical Models of Invariant Object Recognition","3194334":"Distinct Multicolored Region Descriptors for Object Recognition","223333281":"Learning a locality discriminating projection for classification","224348079":"3D object recognition using multiple features and neural network","5618406":"Learning representations for object classification using multi-stage optimal component analysis","221612738":"Discovering Frequent Structured Patterns from String Databases: An Application to Biological Sequences","271976001":"A Real-Time and Effective Object Recognition and Localization Method","224292518":"Distinct Multi-Colored Region Descriptors for Object Recognition","32964558":"Inference with Classifiers: A Study of Structured Output Problems in Natural Language Processing","4014468":"Evolutionary feature design for object recognition with hierarchical networks","221908224":"Robot Vision in Industrial Assembly and Quality Control Processes","14057645":"SEEMORE: Combining Color, Shape, and Texture Histogramming in a Neurally Inspired Approach to Visual Object Recognition","242086609":"Learning Topology of Curves with Application to Clustering","221612616":"Experiments with Projection Learning","271462163":"Remote Sensing object recognition based on transfer learning","221304142":"Learning a Sparse Representation for Object Detection","4232575":"An improved SNoW based classification technique for head-pose estimation and face detection"},"index":818}