{"abs":"Rapid improvement in computing power, cheap sensing, and more flexible algorithms are facilitating increased development of real-time video surveillance and monitoring systems. The deployment of video understanding systems in certain critical applications in the real world can be done only if performance guarantees can be provided for these systems. This paper reviews past work on a systematic engineering methodology for vision systems performance characterization and illustrates how it can be adapted in practice to develop a real-time people detection and zooming system to meet given application requirements. A case study involving dual-camera real-time video surveillance is used to illustrate that by judiciously choosing the system modules and by performing a careful analysis of the influence of various tuning parameters on the system it is possible to perform proper statistical inference, to automatically set control parameters and to quantify performance limits","title":"Design, analysis, and engineering of video monitoring systems: An approach and a case study","id":2985901,"url":"https://www.researchgate.net/publication/2985901_Design_analysis_and_engineering_of_video_monitoring_systems_An_approach_and_a_case_study","names":["Michael Greiffenhagen","Dorin Comaniciu","Heinrich Niemann","Visvanathan Ramesh","Proceedings of the IEEE"],"references":{"220499751":"A Computational Model for Visual Selection","2985902":"Algorithms for cooperative multisensor surveillance","3193147":"Predicting performance of object recognition","221110950":"Toward the automatic generation of mathematical morphology procedures using predicate logic.","3504677":"On the sensitivity of geometric hashing","220464821":"Algorithmic modelling for performance evaluation","222439120":"Anything you can do, I can do better (No you can\u0027t)…","3501094":"The need for accuracy verification of machine vision algorithms and systems","255563567":"Pattern Theory: A Unifying Perspective","221363366":"Statistical Modeling and Performance Characterization of a Real-Time Dual Camera Surveillance System.","220465084":"Performance assessment of near perfect machines","221188533":"Propagating Covariance in Computer Vision.","257468612":"Performance Characterization in Computer Vision","220499641":"Shape Quantization And Recognition With Randomized Trees.","234251861":"Finding Edges and Lines in Images","247608673":"Special purpose automatic programming for 3D model-based vision","2773388":"Generic, Model-Based Estimation and Detection of Peaks in Image Surfaces","2419980":"Omnidirectional Video Camera","3191964":"On the Verification of Hypothesized Matches in Model-Based Recognition","3813396":"Global measures of coherence for edge detector evaluation","247089685":"Overview: Computer vision performance characterization","2513417":"Global Measures of Coherence for Edge Detector Evaluation","267022040":"Empirical Evaluation Techniques in Computer Vision","3135004":"Characterization of a fully resonant, 1-MHZ, 25-Watt, DC/DC converter fabricated in a rad-hard BiCMOS/high-voltage process","232128993":"Stochastic Geometry and Its Application","222751356":"Computer vision theory: The lack thereof","3192970":"Empirical Evaluation of Computer Vision Algorithms","2573468":"Error Characterization of the Factorization Method","3497866":"Automatic generation of simple morphological algorithms","221364465":"Error Analysis of Background Adaption.","3813499":"Comparison of edge detectors using an object recognition task","221111916":"Learning 3D object recognition strategies.","215439381":"Dialogue: Ignorance, Myopia, and Naivete in Computer Vision Systems","244958544":"Methodology for evaluation of image segmentation algorithms on medical images","2714597":"Graded Learning for Object Detection","235148756":"Natural Object Recognition","222481298":"Knowledge-based control of vision systems","2459251":"Advances in Cooperative Multi-Sensor Video Surveillance","3513068":"Random perturbation models and performance characterization in computer vision","225195148":"Probabilistic Modeling and Recognition of 3-D Objects","3192786":"A robust visual method for assessing the relative performance of edge-detection algorithms","221048655":"Use of Knowledge-Based Control for Vision Systems.","2577347":"Omnidirectional Vision Systems: 1998 PI Report","221513168":"Knowledge-Based Control Systems.","224839810":"An Introduction to the Boot-Strap","221361495":"Fundamental Bounds on Edge Detection: An Information Theoretic Evaluation of Different Edge Cues.","2240462":"Graded Learning for Object Detection","265366078":"Random Variables and Stochastic Processes","221678023":"Color Science: Concepts and Methods, Quantative Data and Formulae","225100575":"On the Verification of Hypothesized Matches in Model-Based Recognition","3560512":"Automatic selection of tuning parameters for feature extraction sequences","220464733":"Random perturbation models for boundary extraction sequence","221110484":"Optimal Polyline Tracking for Artery Motion Compensation in Coronary Angiography.","3192781":"Performance Assessment through Bootstrap","2394715":"Random Variables and Stochastic Processes"},"citedIn":{"251932551":"Towards using particle filtering for increasing error correction accuracy in traffic surveillance applications","261381522":"An adaptive method of model updating in MS tracking","224168539":"Design of fall detection system with floor pressure and infrared image","230731593":"Unsupervised markerless 3-DOF motion tracking in real time using a single low-budget camera","34510980":"Engineering, statistical modeling and performance characterization of a real-time dual camera surveillance system /","4267722":"Algorithm for Tracking of Fast Motion Objects with Adaptive Mean Shift","220845220":"A Spatio-Spectral Algorithm for Robust and Scalable Object Tracking in Videos","220598184":"Efficient and Low-Complexity Surveillance Video Compression Using Backward-Channel Aware Wyner-Ziv Video Coding","225166073":"3D Head Position Estimation Using a Single Omnidirectional Camera for Non-intrusive Iris Recognition","244002200":"Secure Internet examination system based on video monitoring","246407868":"IBM Smart Surveillance System (S3): An open and extensible architecture for smart video surveillance","270018956":"A Novel Approach Coloured Object Tracker with Adaptive Model and Bandwidth Using Mean Shift Algorithm","4222551":"An automatic monitoring approach for unsupervised parking lots in outdoors","289197227":"Automatic self-calibration of expressway surveillance camera under dynamic conditions","4343131":"An Intelligent Video Surveillance System Based on Multiple Model Particle Filtering","251958047":"A visual surveillance system for mobile robot using omnidirectional and PTZ cameras","289786969":"A robot vision system for visual surveillance","221667734":"Filling-Based Techniques Applied to Object Projection Feature Estimation","2851214":"Kernel-Based Object Tracking","228551737":"Classification of Moving Targets Based on Motion and Appearance in Real-Time","233942617":"Wavelet MACH filter for omnidirectional human activity recognition","220908802":"Algorithm for Tracking of Fast Motion Objects with Adaptive Mean Shift.","238981910":"Tracking head positions in three-dimensional space by using a single omnidirectional camera","287440907":"Object tracking using frame differencing and template matching","220094132":"System and software architectures of distributed smart cameras.","252016046":"Visual object tracking based on filtering methods","221410078":"An Experimental Framework for Evaluating PTZ Tracking Algorithms","220256525":"Visual object tracking by an evolutionary self-organizing neural network","51956407":"The Object Projection Feature Estimation Problem in Unsupervised\nMarkerless 3D Motion Tracking","288465280":"Adaptive Multi-model and entropy-based localization on context-aware robotic system","4340976":"Testing and validation of a multi-sensor distributed surveillance system","2882333":"Automating Cell Segmentation Evaluation with Annotated Examples","4268022":"A Content Protection Scheme for H.264-based Video Sequence","220465180":"IBM smart surveillance system (S3): Event based video surveillance system with an open and extensible framework","221315209":"An Active Head Tracking System for Distance Education and Videoconferencing Applications","224333670":"Distributing Essential Logical Deductions to Surveillance Personnel and a Video Recorder","234805056":"System and Software Architectures of Distributed Smart Cameras","267084628":"Robust decentralized multi-model adaptive template tracking","226855887":"Mean-Shift Object Tracking with a Novel Back-Projection Calculation Method","224393108":"An Object-Tracking Algorithm Based on Multiple-Model Particle Filtering With State Partitioning","4144370":"Videomonitoring systems for electric power substation equipments","232647184":"Real-Time Non-rigid Object Tracking Using CAMShift with Weighted Back Projection","286582874":"Particle Filtering-based tracking and localization on context-aware robotic system","232632210":"Metric distance transform for kernel based object tracking","229066102":"A Novel Approach Coloured Object Tracker with Adaptive Model and\nBandwidth using Mean Shift Algorithm","221127548":"MEAN-shift tracking algorithm with weight fusion strategy","3321569":"Smart video surveillance: exploring the concept of multiscale spatiotemporal tracking. IEEE Signal Process Mag","4238355":"A Customized Human Fall Detection System Using Omni-Camera Images and Personal Information","221239420":"Evolving a Self-Organizing Feature Map for Visual Object Tracking.","238697071":"Smart Video Surveillance","224119950":"Survey on Contemporary Remote Surveillance Systems for Public Safety","260001449":"Correlation, Kalman filter and adaptive fast mean shift based heuristic approach for robust visual tracking","272056672":"The Constructing of Integrated Remote Monitoring System for Cold Store","284078135":"Visual object tracking—classical and contemporary approaches","222166369":"Transductive local exploration particle filter for object tracking","3940705":"The systematic design and analysis cycle of a vision system: A case study in video surveillance","258549897":"Real-time Specified Object Tracking System under Complex Background","221225798":"A Novel Algorithm for Achieving a Light-Weight Tracking System","272572115":"Cooperative fusion particle filter tracker","243134739":"Omnidirectional visual surveillance","261485307":"Particle filtering enhanced human tracking on context-aware robotic system","265438269":"Advances in self-organizing maps. 8th international workshop, WSOM 2011, Espoo, Finland, June 13–15, 2011. Proceedings","241175828":"Maneuvering object tracking under large-area occlusive condition using mean shift embedded IMM filter","258407443":"Computer Vision - ACCV 2009","3359428":"Intelligent distributed surveillance systems: A review","220598495":"Communication Mechanisms and Middleware for Distributed Video Surveillance","220910421":"Managing linearity in radio front-ends"},"index":820}