{"abs":"In nonlinear deterministic parameter estimation, the maximum likelihood estimator (MLE) is unable to attain the Cramer-Rao lower bound at low and medium signal-to-noise ratios (SNR) due the threshold and ambiguity phenomena. In order to evaluate the achieved mean-squared-error (MSE) at those SNR levels, we propose new MSE approximations (MSEA) and an approximate upper bound by using the method of interval estimation (MIE). The mean and the distribution of the MLE are approximated as well. The MIE consists in splitting the a priori domain of the unknown parameter into intervals and computing the statistics of the estimator in each interval. Also, we derive an approximate lower bound (ALB) based on the Taylor series expansion of noise and an ALB family by employing the binary detection principle. The accurateness of the proposed MSEAs and the tightness of the derived approximate bounds are validated by considering the example of time-of-arrival estimation.","title":"Statistics of the MLE and Approximate Upper and Lower Bounds—Part I: Application to TOA Estimation","id":262452246,"url":"https://www.researchgate.net/publication/262452246_Statistics_of_the_MLE_and_Approximate_Upper_and_Lower_Bounds-Part_I_Application_to_TOA_Estimation","names":["Achraf Mallat","Sinan Gezici","Davide Dardari","Christophe Craeye","Luc Vandendorpe","IEEE Transactions on Signal Processing"],"references":{"3162679":"Threshold-Based Time-of-Arrival Estimators in UWB Dense Multipath Channels","226449527":"On a number-theoretic integration method","238742451":"Randomization of Number Theoretic Methods for Multiple Integration. SIAM Journal of Numerical Analysis, 13, 904-914","3081507":"“Some Lower Bounds on Signal Parameter Estimation,”","38367684":"Locally Best Unbiased Estimates","3077181":"Relations Between Belini-Tartara, Chazan-Zakai-Ziv, and Wax-Ziv Lower Bounds","3079098":"Extended Ziv-Zakai lower bound for vector parameter estimation","3319211":"Threshold region performance of maximum likelihood direction of arrival estimators. IEEE Trans Signal Process","224312640":"Bounds and algorithms for time delay estimation on parallel, flat fading channels","240192078":"Probability and Information Theory with Applications to Radar Pergamon","224145091":"Testbed for IR-UWB based ranging and positioning: Experimental performance and comparison to CRLBs","3081487":"A Useful form of the Barankin Lower Bound and its Application to PPM Threshold Analysis","40872653":"Unconditional Maximum Likelihood Performance At Finite Number Of Samples And High Signal To Noise Ratio","3177627":"Fundamental limitations in passive time-delay estimation--Part II: Wide-band systems","247334034":"Ratios of Normal Variables and Ratios of Sum of Uniform Variables","224395249":"Ranging With Ultrawide Bandwidth Signals in Multipath Environments","3082496":"Improved Lower Bounds on Signal Parameter Estimation","230663818":"Randomization of number theoretic methods for multiple integration","224719698":"UWB based positioning in multipath channels: CRBs for AOA and for hybrid TOA-AOA based methods","265494376":"The Maximum Variance of Restricted Unimodal Distributions","262452248":"Statistics of the MLE and Approximate Upper and Lower Bounds–Part II: Threshold Computation and Optimal Pulse Design for TOA Estimation","3085842":"Mean-Squared Error and Threshold SNR Prediction of Maximum-Likelihood Signal Parameter Estimation With Estimated Colored Noise Covariances","31400988":"On the Ratio of Two Correlated Normal Random Variables","226336441":"Fast Component-by-Component Construction, a Reprise for Different Kernels","224604708":"Ziv-Zakai Bound on Time-of-Arrival Estimation with Statistical Channel Knowledge at the Receiver","3313784":"Capon algorithm mean-squared error threshold SNR prediction and probability of resolution","3315064":"Realizable lower bounds for time delay estimation","5328923":"Bayesian Bounds for Parameter Estimation and Nonlinear Filtering/Tracking","3319929":"On the High-SNR Conditional Maximum-Likelihood Estimator Full Statistical Characterization","224731310":"Bounds on Error in Signal Parameter Estimation","265371805":"Introduction to Stochastic Process","243648203":"Principles of Communication Engineering","5142941":"Ratios of Normal Variables","2992121":"Performance Limitations and Error Calculations for Parameter Estimation","224730672":"A PPM/PM Hybrid Modulation System","3316580":"The Barankin bound and threshold behavior in frequency estimation","240966148":"Parameter Estimation for Waveforms in Additive Gaussian Noise","3315311":"Realizable lower bounds for time delay estimation. 2. Threshold phenomena","3081328":"An Upper Bound on Average Estimation Error in Nonlinear Systems","3343315":"Threshold Region Determination of ML Estimation in Known Phase Data-Aided Frequency Synchronization","3177297":"Fundamental limitations in passive time delay estimation--Part I: Narrow-band systems","224730759":"The Performance of a PPM/PM Hybrid Modulation System","3079245":"A Barankin-type lower bound on the estimation error of a hybrid parameter vector","3176918":"Delay Estimation Using Narrow-Band Processes","233274625":"Upper bounds for the variances of certain random variables","224650378":"A Survey of Time Delay Estimation Performance Bounds","265655358":"The theory of optimum noise immunity","224685704":"Improved Lower Bounds on Time-of-Arrival Estimation Error in Realistic UWB Channels","3081922":"Barankin Bounds on Parameter Estimation","3082459":"Single Tone Parameter Estimation From Discrete-Time Observations","2463953":"Numerical Computation Of Multivariate Normal Probabilities","3342926":"Nonasymptotic Statistical Performance of Beamforming for Deterministic Signals","242624905":"Fundamentals of Statistical Signal Processing, Vol. II: Detection Theory","4249151":"Ziv-Zakai Time Delay Estimation Bound for Ultra-Wideband Signals"},"citedIn":{"262452248":"Statistics of the MLE and Approximate Upper and Lower Bounds–Part II: Threshold Computation and Optimal Pulse Design for TOA Estimation"},"index":822}