{"abs":"Engineering problems presenting themselves in a multiobjective setting have become commonplace in most industries. In such situations the decision maker (DM) requires several solution options prior to selecting the best or the most attractive solution with respect to the current industrial circumstances. The weighted sum scalarization approach was employed in this work in conjunction with three metaheuristic algorithms: particle swarm optimization (PSO), differential evolution (DE) and the improved DE algorithm (GTDE) (which was enhanced using ideas from evolutionary game theory). These methods are then used to generate the approximate Pareto frontier to the nano-CMOS voltage-controlled oscillator (VCO) design problem. Some comparative studies were then carried out to compare the proposed method as compared to the standard DE approach. Examination on the quality of the solutions across the Pareto frontier obtained using these algorithms was carried out using the hypervolume indicator (HVI).","title":"Multiobjective design optimization of a nano-CMOS voltage-controlled oscillator using game theoretic-differential evolution","id":275773213,"url":"https://www.researchgate.net/publication/275773213_Multiobjective_design_optimization_of_a_nano-CMOS_voltage-controlled_oscillator_using_game_theoretic-differential_evolution","names":["Timothy Ganesan","Irraivan Elamvazuthi","P. Vasant","Applied Soft Computing"],"references":{"270980262":"Multi-objective Evolutionary Algorithm with Strong Convergence of Multi-area for Assembly Line Balancing Problem with Worker Capability","275633385":"An optimization method for NBTI-aware design of domino logic circuits in nano-scale CMOS","284702590":"Circuit interfaces and optimization for resistive nanosensors, nanosensing, materials and devices II","15733497":"The Evolution of Cooper anon","230642869":"Constrained structural design optimization via a parallel augmented Lagrangian particle swarm optimization approach","249920759":"Hybrid immune-simulated annealing algorithm for optimal design and manufacturing","6418295":"Covariance Matrix Adaptation for Multi-objective Optimization","267509607":"A Simulated Annealing Algorithm for Balancing a Disassembly Line","257337807":"A particle swarm optimization algorithm with neighborhood-based mutation for sequence-dependent disassembly line balancing problem","226340710":"A new algorithm and multi-response Taguchi method to solve line balancing problem in an automotive industry","261042195":"Fast analog design optimization using regression-based modeling and genetic algorithm: A nano-CMOS VCO case study","238652069":"Adaptation in Natural and Artificial Systems: An Introductory Analysis with Applications to Biology, Control and AI","222349285":"Extensions of TOPSIS for multi-objective large-scale nonlinear programming problems","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","263690522":"Hopfield differential evolution for multi-objective optimization of a cement-bonded sand mould system","246648860":"Differential Evolution: A Simple and Efficient Adaptive Scheme for Global Optimization Over Continuous Spaces","225753156":"Balancing large assembly lines by a new heuristic based on differential evolution method","257336547":"Yildiz, A.R.: Cuckoo search algorithm for the selection of optimal machine parameters in milling operations. Int. J. Adv. Manuf. Technol","220340372":"Modified Differential Evolution (MDE) for Optimisation of Non-Linear Chemical Processes","220729616":"Fast optimization of nano-CMOS mixed-signal circuits through accurate metamodeling","23573726":"Evolutionary Game Theory","222568190":"Structural optimization using evolutionary algorithms","220689692":"Game Theory: An Analysis of Conflict","222646265":"Impact of gate-oxide tunneling on mixed-signal design and simulation of a nano-CMOS VCO","216457304":"Lecture Notes in Computer Science","41146419":"Application of a Fuzzy Programming Technique to Production Planning in the Textile Industry","225588144":"Cuckoo search algorithm: a metaheuristic approach to solve structural optimization problems. Engineering with Computers","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","220867817":"An Evolutionary Game-Theoretical Approach to Particle Swarm Optimisation","220220260":"Bee colony intelligence in zone constrained two-sided assembly line balancing problem","279928938":"Multi-objective differential evolution on the GPU with C-CUDA","279897320":"Hybrid immune-simulated annealing algorithm for optimal design and manufacturing","224182549":"Differential Evolution: A Survey of the State-of-the-Art","224068375":"BSIM4 gate leakage model including source-drain partition","223313053":"Artificial Bee Colony (ABC) for multi-objective design optimization of composite structures","262175734":"Yildiz Ali R.: Optimization of cutting parameters in multi-pass turning using artificial bee colony-based approach. Inf. Sci. 220, 399-407","220777457":"Predicted-Velocity Particle Swarm Optimization Using Game-Theoretic Approach","257635643":"Yildiz A.R.: Hybrid Taguchi-differential evolution algorithm for optimization of multi-pass turning operations. Appl. Soft Comput. 13(3), 1433-1439","284702744":"Multiobjective optimization of cement-bonded sand mould system with differential evolution","220249665":"Hybrid Tabu Search Hopfield Recurrent ANN Fuzzy Technique to the Production Planning Problems: A Case Study of Crude Oil in Refinery Industry.","229134028":"Mixed variable structural optimization using Firefly Algorithm","257435453":"Hybrid neuro-swarm optimization approach for design of distributed generation power systems","220199544":"A multi-objective artificial immune algorithm for parameter optimization in support vector machine","261569021":"Synthesis of Antenna Arrays with an Efficient Multiobjective Differential Evolution Algorithm","256721057":"A comparative study of population-based optimization algorithms for turning operations. Information Sciences, 210, 81-88","222562987":"A novel hybrid immune algorithm for global optimization in design and manufacturing","257635629":"A new hybrid differential evolution algorithm for the selection of optimal machining parameters in milling operations","275998853":"Hybrid Tabu Search Hopfield Recurrent ANN Fuzzy Technique to the Production Planning Problems","222408506":"Computing Nash equilibria through computational intelligence methods"},"citedIn":{},"index":836}