{"abs":"Increasing interest in simultaneously optimizing many objectives (typically more than three objectives) of problems leads to the emergence of various many-objective algorithms in the evolutionary multi-objective optimization field. However , in contrast to the development of algorithm design, how to assess many-objective algorithms has received scant concern. Many performance indicators are designed in principle for any number of objectives, but in practice are invalid or infeasible to be used in many-objective optimization. In this paper, we explain the difficulties that popular performance indicators face and propose a performance comparison indicator (PCI) to assess Pareto front approximations obtained by many-objective algorithms. PCI evaluates the quality of approximation sets with the aid of a reference set constructed by themselves. The points in the reference set are divided into many clusters, and the proposed indicator estimates the minimum moves of solutions in the approximation sets to weakly dominate these clusters. PCI has been verified both by an analytic comparison with several well-known indicators and by an empirical test on four groups of Pareto front approximations with different numbers of objectives and problem characteristics.","title":"A Performance Comparison Indicator for Pareto Front Approximations in Many-Objective Optimization","id":280534179,"url":"https://www.researchgate.net/publication/280534179_A_Performance_Comparison_Indicator_for_Pareto_Front_Approximations_in_Many-Objective_Optimization","names":["Miqing Li","Shengxiang Yang","Xiaohui Liu"],"references":{"265021130":"A test problem for visual investigation of high-dimensional multi-objective search","269275405":"A Knee Point Driven Evolutionary Algorithm for Many-Objective Optimization","261520468":"Diversity Comparison of Pareto Front Approximations in Many-Objective Optimization","3418743":"Properties of an adaptive archiving algorithm for storing nondominated vectors. IEEE Trans Evol Comput","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","261141271":"Fuzzy-Based Pareto Optimality for Many-Objective Evolutionary Algorithms","28358328":"Lecture Notes in Computer Science","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","253359061":"Shift-Based Density Estimation for Pareto-Based Algorithms in Many-Objective Optimization","3419003":"On the Evolutionary Optimization of Many Conflicting Objectives","260621912":"Preference-Inspired Coevolutionary Algorithms for Many-Objective Optimization","274263562":"Behavior of Multiobjective Evolutionary Algorithms on Many-Objective Knapsack Problems","259084900":"Speeding up many-objective optimization by Monte Carlo approximations","220702002":"Enhancing Diversity for Average Ranking Method in Evolutionary Many-Objective Optimization","253348620":"A Grid-Based Evolutionary Algorithm for Many-Objective Optimization","264387359":"An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point-Based Nondominated Sorting Approach, Part I: Solving Problems With Box Constraints","51692937":"Diagnostic Assessment of Search Controls and Failure Modes in Many-Objective Evolutionary Optimization","220741943":"Study of preference relations in many-objective optimization","216300612":"Many-Objective Optimization: An Engineering Design Perspective","45868377":"Techniques for Highly Multiobjective Optimisation: Some Nondominated Points are Better than Others","224301948":"MSOPS-II: A general-purpose Many-Objective optimiser","220743243":"G-Metric: an M-ary quality indicator for the evaluation of non-dominated sets","226615652":"Scalable Test Problems for Evolutionary Multiobjective Optimization","265021421":"A Comparative Study on Evolutionary Algorithms for Many-Objective Optimization","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","260622137":"Using the Averaged Hausdorff Distance as a Performance Measure in Evolutionary Multiobjective Optimization","216457303":"Indicator-Based Selection in Multiobjective Search","2609749":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","224330083":"Evolutionary Many-Objective Optimization: A Short Review","3904004":"Failure of Pareto-based MOEAs: Does non-dominated really mean near to optimal?"},"citedIn":{"280534066":"Bi-goal evolution for many-objective optimization problems","284719460":"Pareto or Non-Pareto: Bi-Criterion Evolution in Multi-Objective Optimization"},"index":839}