{"abs":"Constrained parameter problems arise in a wide variety of applications, including bioassay, actuarial graduation, ordinal categorical data, response surfaces, reliability development testing, and variance component models. Truncated data problems arise naturally in survival and failure time studies, ordinal data models, and categorical data studies aimed at uncovering underlying continuous distributions. In many applications both parameter constraints and data truncation are present. The statistical literature on such problems is very extensive, reflecting both the problems’ widespread occurrence in applications and the methodological challenges that they pose. However, it is striking that so little of this applied and theoretical literature involves a parametric Bayesian perspective. From a technical viewpoint, this perhaps is not difficult to understand. The fundamental tool for Bayesian calculations in typical realistic models is (multidimensional) numerical integration, which often is problematic in unconstrained contexts and can be well-nigh impossible for the kinds of constrained problems we consider. In this article we show that Bayesian calculations can be implemented routinely for constrained parameter and truncated data problems by means of the Gibbs sampler. Specific models discussed include constrained multinormal parameters, constrained linear model parameters, ordered parameters in experimental family models, data and order restricted parameters from exponential distributions, straight line regression with censoring and bivariate grouped data models. Analysis of data sets illustrating the first two of these settings is provided.","title":"Bayesian Analysis of Constrained Parameter and Truncated Data Problems Using Gibbs Sampling","id":243775842,"url":"https://www.researchgate.net/publication/243775842_Bayesian_Analysis_of_Constrained_Parameter_and_Truncated_Data_Problems_Using_Gibbs_Sampling","names":["Alan E. Gelfand","Adrian F. M. Smith","Tai-Ming Lee","Journal of the American Statistical Association"],"references":{"232983811":"A Bayes estimator for ordered parameters and isotonic Bayesian graduation","245865479":"Density Estimation for Statistics and Data Analysis, Chapman and Hall, New York","261625017":"Density Estimation for Statistics and Data Analysis","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","261593363":"Stochastic Simulation","243049627":"Gibbs sampling for marginal posterior expectations","24099271":"Conjoint Analysis in Consumer Research: Issues \u0026 Outlook, Journal of Consumer Research, 5, 103-123","31205617":"Bayes Estimates in One-Way and Two-Way Models","24098302":"On the Design cf Choice Experiments Involving Multi-Factor Alternatives","267182429":"“Bayes Estimates for the Linear Model.”","239060397":"Order Restricted Statistical Inference","268490386":"Applications of a Method for the Efficient Computation of Posterior Distributions”, Applied Statistics, 31, 214-225","232961495":"On shrinkage estimation of the exponential location parameter","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","265429604":"Stochastic Simulation","267171866":"A new inadmissibility theorem with applications to estimation of survival and hazard rates and means in the scale parameter family","225304570":"Non-Uniform Random Variate Generation","40933482":"Discrete Multivariate Analysis: Theory and Practice","230876664":"Statistical Inference Under Order Restriction","244464104":"Hierarchical Bayesian Analysis of Change Point Problems","50335996":"Bayesian inference in statistical analysis.","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","245065445":"A Simple Method for Regression Analysis With Censored Data","243689785":"Illustration of Bayesian Inference in Normal Data Models Using Gibbs Sampling"},"citedIn":{"241817192":"BAYESIAN ORDER RESTRICTED METHODS WITH BIOMEDICAL APPLICATIONS","222636870":"Identifying Purchase-History Sensitive Shopper Segments Using Scanner Panel Data and Sequence Alignment Methods","233453038":"Bayesian inference for multinomial populations under stochastic ordering","228973472":"Bayesian analysis of multiple responses from an animal carcinogen mixture experiment","227735956":"Bayesian classification of Neolithic tools","33400303":"Posterior Analysis of Stochastic Frontier Models Using Gibbs Sampling","7997032":"A Class of Bayesian Shared Gamma Frailty Models with Multivariate Failure Time Data","222484308":"An Exact Likelihood Analysis of the Multinomial Probit Model","7997036":"Bayesian Monitoring of Clinical Trials with Failure-Time Endpoints","278828680":"A New Rejection Sampling Method for Truncated Multivariate Gaussian Random Variables Restricted to Convex Sets","7378542":"Inequality Constrained Analysis of Variance: A Bayesian Approach.","229659538":"Inference for some multivariate ARCH and GARCH models","268372444":"ADVANCING SEQUENTIAL MONTE CARLO FOR MODEL CHECKING, PRIOR SMOOTHING AND APPLICATIONS IN ENGINEERING AND SCIENCE","228711302":"A Gibbs sampler for inequality-constrained geostatistical interpolation and inverse modeling","228671881":"Bayesian cure rate model accommodating multiplicative and additive covariates","222904164":"Bayesian analysis of hierarchical linear mixed modeling using the multivariate t distribution","265799654":"Bayes analysis of a three-parameter Pareto distribution via sample based approaches","240521828":"Inference et validation bayesiennes d\u0027un modele de pluie journaliere en regime de mousson / Bayesian identification and validation of a daily rainfall model under monsoon conditions","227700640":"Data analytic methods for latent partially ordered classification models","2278422":"Physiological Pharmacokinetic Analysis Using Population Modeling and Informative Prior Distributions","226335049":"A review of Markov Chain Monte Carlo and information theory tools for inverse problems in subsurface flow","2443794":"A Hierarchical Bayesian Model To Predict The Duration Of Immunity Against Hib","267412425":"A Bayesian Hierarchical Model for Studying Inter-Occasion and Inter-Subject Variability in","238802434":"Bayesian inference for partially accelerated life tests using Gibbs sampling","226175297":"Bayesian Estimation for Inequality Constrained Analysis of Variance","5424744":"Constraining the general linear model for sensible hemodynamic response function waveforms","239808116":"BIEMS: A Fortran 90 Program for Calculating Bayes Factors for Inequality and Equality Constrained Models","257679130":"Evaluating the Equal-Interval Hypothesis with Test Score Scales","226798543":"Bayes Factors Based on Test Statistics Under Order Restrictions","223515422":"From inspection to process understanding and monitoring: a view on computer vision in manufacturing","44929250":"Inequality contrained hierarchical models","247837322":"The Value of Informative Priors in Bayesian Inference with Sparse Data","227746759":"Bayesian inference, Gibbs\u0027 sampler and uncertainty estimation in geophysics","247837341":"Brand Extension Strategy Planning: Empirical Estimation of Brand–Category Personality Fit and Atypicality","222627100":"Bayesian approach to estimation of ordered uniform scale parameters","223488267":"Equality and inequality constrained multivariate linear models: Objective model selection using constrained posterior priors","228094913":"Social moderation of the relation between community violence exposure and depressive symptoms in an urban adolescent sample.","221660522":"Fast simulation of truncated Gaussian distributions","243781849":"Bayesian Inference for Stable Distributions","24065329":"Performance study of marginal posterior density estimation via Kullback-Leibler divergence","250755245":"Bayesian Computation: From Posterior Densities to Bayes Factors, Marginal Likelihoods, and Posterior Model Probabilities","2366020":"Bayesian Clinical Trial Design For Categorical Endpoint Models","4720681":"Full bayesian inference for GARCH and EGARCH models","237345862":"Bayesian Identification of Optimal Portfolio Weights","3319892":"Separation of Non-Negative Mixture of Non-Negative Sources Using a Bayesian Approach and MCMC Sampling","237623873":"A Hierarchical Bayes Model for Ranked Conjoint Data","261628400":"Simultaneous estimation of gamma means in the presence of a nuisance parameter","257641783":"Augmenting discrete-choice data to identify common preference scales for inter-subject analyses","23274252":"Parameters of a Dose-Response Model Are on the Boundary: What Happens with BMDL?","43554536":"Inequality constrained normal linear models","2442323":"Monte Carlo Estimation of Bayesian Credible and HPD Intervals","12509382":"Statistical Analysis of Fisher et al. PBPK Model of Trichloroethylene Kinetics","271857741":"Bayesian Methods in Actuarial Science","24095509":"Comparing Theories Of Endogenous Protection: Bayesian Comparison Of Tobit Models Using Gibbs Sampling Output","265247668":"A simple Monte Carlo approach to Bayesian graduation","24052500":"A Method for Testing Nested Point Null Hypotheses Using Multiple Bayes Factor","264945994":"Generalized Maximum Entropy Estimation of Dynamic Programming Models with Sample Selection Bias","279773231":"A quadratic hierarchical Bayesian dynamic prediction model for infrastructure maintenance","8416260":"Bayesian Estimation of Survival Functions under Stochastic Precedence","227300618":"Simulation of truncated gamma variables","227119877":"Inequality Constrained Multilevel Models","233067370":"Predictive comparisons in ordinal models","24063457":"Markov Chain estimation for test theory without an answer key","222532044":"Relevance of functional flexibility for heterogeneous sales response models: A comparison of parametric and semi-nonparametric models","259119102":"Prior adjusted default Bayes factors for testing (in)equality constrained hypotheses","6583024":"Analysis on binary responses with ordered covariates and missing data","252389279":"MCMC algorithm, integrated four-dimensional seismic reservoir characterization and uncertainty analysis in a Bayesian framework","264020256":"The Risk Assessment and Prediction for the Mixed Deterioration in Cable Bridges Using a Stochastic Bayesian Modeling","227413776":"Bayesian inference for an item response model for modeling test anxiety","23696331":"Information Processing with Recursive Utility: Some Intriguing Results","36710551":"Comparison of cognitively diagnostic adaptive testing algorithms","24063429":"Bayesian estimation and model selection in ordered latent class models for polytomous IRT models","228519733":"Bayesian Variable Selection for Time Series Count Data","223313379":"Sensitivity analysis in ordered and restricted parameter models","222692840":"Variable selection for multivariate logistic regression models","241722073":"Bayesian Inference of Survival Probabilities, Under Stochastic Ordering Constraints","30515555":"Dynamique cérébrale en neuroimagerie fonctionnelle","12757104":"Bayesian analysis of prevalence with covariates using simulation-based techniques: Applications to HIV screening","2469023":"Incorporating Toxicity Grade Information in the Continual Reassessment Method","257199083":"Some results on the truncated multivariate t distribution","4991119":"A Bayesian Multiple Comparison Procedure for Order-Restricted Mixed Models","3925759":"Gibbs sampling optimization in underwater sound problems","227104590":"Simulation of right- and left-truncated gamma distribution by mixtures","14231582":"PopulationToxicokinetics of Tetrachloroethylene","229160801":"An R package for state-trace analysis","260948801":"Exploration of the use of Bayesian modeling of gradients for censored spatiotemporal data from the Deepwater Horizon oil spill","225834426":"Inequality Constrained Contingency Table Analysis","252233689":"Preprint of the Book Chapter: \"Bayesian Versus Frequentist Inference","13663745":"Generalized Linear Mixed Models in Dairy Cattle Breeding","4983966":"Relevance of Functional Flexibility for Heterogeneous Sales Response Models - A Comparision of Parametric and Seminoparametric Models","225329084":"Efficient algorithms for generating truncated multivariate normal distributions","4817052":"Bayesian multiple comparisons of simply ordered means using priors with a point mass","5556865":"An integrated approach to identify distribution of Oncomelania hupensis, the intermediate host of Schistosoma japonicum, in a mountainous region in China","232884024":"Do Delinquent Young Adults Have a High or a Low Level of Self-concept?","222640030":"The unemployment of ethnic minority groups in Netherlands","225980836":"Automating and evaluating reversible jump MCMC proposal distributions","265003286":"Can Affine Models Capture the Dynamics of Risk Premia and Volatility in Bond Yields?","3318508":"Two algorithms to segment white Gaussian data with piecewise constant variances","10858561":"Bayesian estimation in animal breeding using the Dirichlet process prior for correlated random effects","243769955":"Bayesian Estimation of Spatial Autoregressive Models","225701782":"An application of the mixed linear model and the Dirichlet process prior in veterinary medicine research","24126869":"Bayesian Analysis of Hazard Regression Models under Order Restrictions on Covariate Effects and Ageing","264930093":"Robust Bayesian Graphical Modeling Using Dirichlet t-Distributions. Contributed discussion.","226667882":"Bayesian analysis under order functions of parameters","12273233":"Bayesian analysis of an epidemiologic model of Plasmodium falciparum malaria infection in Ndiop, Senegal","238866647":"Bayesian analysis of an intervened poisson distribution","225670552":"A Bayesian approach to selection and ranking procedures: the unequal variance case","223334307":"The analysis of contingency tables under inequality constraint","257199545":"Reference priors for constrained rate models of count data","46179889":"The Highest Confidence Density Region and Its Usage for Joint Inferences about Constrained Parameters","228562796":"An Accept-Reject Algorithm For the Positive Multivariate Normal Distribution","281961530":"Bayes factors for state-trace analysis.","251342338":"Order-Constrained Bayes Inference for Dichotomous Models of Unidimensional Nonparametric IRT","228768601":"C-NORTA: A Rejection Procedure for Sampling from the Tail of Bivariate Distributions","251727869":"Order-Restricted Bayesian Estimation of the Age Composition of a Population of Atlantic Cod","226669700":"Modeling Rates of Bone Growth and Loss Using Order-Restricted Inference and Stochastic Change Points","17830424":"[Problems of genetic radiation hazards in man].","2132776":"Bayesian transformation hazard models","24052326":"Bayesian calibration in the estimation of the age of rhinoceros","251346418":"The exchangeable multinomial model as an approach to testing deterministic axioms of choice and measurement","46494152":"An Active Set Algorithm to Estimate Parameters in Generalized Linear Models with Ordered Predictors","227442305":"Bayesian Statistics and Marketing","260750490":"Dose-Response Modeling Under Simple Order Restrictions Using Bayesian Variable Selection Methods","222525520":"The Bayes factor for inequality and about equality constrained models","246784422":"Maximum-likelihood estimation for constrained- or missing-data models","38348636":"On Monte Carlo Methods for Estimating Ratios of Normalizing Constants","227222173":"Bayesian isotonic changepoint analysis","8690578":"Bayesian Inferences in the Cox Model for Order-Restricted Hypotheses","23634032":"Bayes inference for treatment effects with uncertain order constraints","228290178":"Can Affine Models Match the Moments in Bond Yields?","249047490":"Bayesian mixed‐effects model analysis of a censored normal distribution with animal breeding applications","223345748":"Bayesian inference in joint modelling of location and scale parameters of the t distribution for longitudinal data","239060769":"Importance-Weighted Marginal Bayesian Posterior Density Estimation","11359116":"The Rasch model, additive conjoint measurement, and new probabilistic measurement theory","228390079":"Comparison of MCMC methods for estimating GARCH models","230706405":"Exact Hamiltonian Monte Carlo for Truncated Multivariate Gaussians","227715252":"Cure rate models: A unified approach","5412728":"A fully Bayesian approach to the parcel-based detection-estimation of brain activity in fMRI","224839754":"Explaining the Gibbs sampler. Am Stat","254287364":"Maximum Likelihood Variance Components Estimation for Binary Data","2778374":"Methods for Approximating Integrals in Statistics with Special Emphasis on Bayesian Integration Problems","14491634":"MCMC methods for putative pollution source problems in environmental epidemiology","258995807":"논문","258995806":"A quadratic hierarchical Bayesian dynamic prediction model for infrastructure maintenance","261917865":"Offline and Online Search in Used Durables Markets","3872003":"Fast matching methods for inversion with underwater sound","220286492":"Bayesian Analysis of the Unobserved ARCH Model","228354268":"Continuous Contour Monte Carlo for Marginal Density Estimation With an Application to a Spatial Statistical Model","259553848":"Estimation of stationary autoregressive models with the Bayesian LASSO","4240641":"Simulation of postive normal variables using several proposal distributions","2286432":"Bayesian Modelling of Outstanding Liabilities Incorporating Claim Count Uncertainty","229012708":"A Bayesian Multiple Comparison Procedure for Simple Order-Restricted Mixed Models with Missing Values","227190985":"Gibbs sampler by sampling-importance-resampling","228559065":"Monte Carlo methods for Bayesian analysis of constrained parameter problems","23633967":"A Bayesian analysis for estimating the number of species in a population using nonhomogeneous Poisson process","238910327":"Long-term dependence with asymmetric conditional heteroscedasticity in stock returns","227094725":"Estimation of population pharmacokinetics using the Gibbs sampler","222946821":"The fitting of parameter-constrained demographic models","240802069":"A Bayesian Approach to Estimation of GPAs of University of Iowa Freshmen Under Order Restrictions","225033273":"Bayesian Biostatistics","228781296":"Bayesian analysis of conditional density functions: a limited information approach","51200094":"Latent class models for testing monotonicity and invariant item ordering for polytomous items","228167872":"MCMC Methods for Continuous-Time Financial Econometrics","282268554":"Bayes factors for state-trace analysis","227907786":"A new MCMC algorithm for seismic waveform inversion and corresponding uncertainty analysis","263163597":"Assessing phenotypic correlation through the multivariate phylogenetic latent liability model","263686353":"A Quantile Regression Analysis of the Effect of Farmers’ Attitudes and Perceptions on Market Participation","233024650":"Bayesian regression analysis of data with censored initiating and terminating times: Applications to AIDS","3557210":"Toward template-based tolerancing from a Bayesian viewpoint","228229876":"An Empirical Investigation of an Intensity-Based Model for Pricing CDO Tranches","2911583":"Bayesian Inferences on Shape Constrained Hormone","221141081":"Leveraging aggregate ratings for better recommendations.","223357997":"Dynamic modeling of bacteria in a pilot drinking-water distribution system","5068237":"A Bayesian Approach to Dynamic Tobit Models.","4719560":"A Bayesian Analysis of Autoregressive Time Series Panel Data","254288040":"Account-Level Modeling for Trade Promotion: An Application of a Constrained Parameter Hierarchical Model","2120097":"Multiprocess parallel antithetic coupling for backward and forward Markov Chain Monte Carlo","227375628":"Reliability and Risk-a Bayesian Perspective","49749375":"Estimating the Relative Excess Risk Due to Interaction A Bayesian Approach","267936370":"Shape shifters: simple asymmetric mixing densities for mixed logit models","226440946":"Influential data points in predictive logistic models","13996376":"Modelling of mortality data from a multi-centre study in Japan by means of Poisson regression with error in variables","263031843":"A Constrained Matrix-Variate Gaussian Process for Transposable Data","7904744":"A transformation approach for incorporating monotone or unimodal constraints","227253787":"Bayesian Versus Frequentist Inference","4816856":"EM-type algorithms for computing restricted MLEs in multivariate normal distributions and multivariate -distributions","40907235":"Bayesian hypothesis testing for psychologists: A tutorial on the Savage–Dickey method","10635576":"Expert judgment and occupational hygiene: Application to aerosol speciation in the nickel primary production industry","268525466":"Constrained Bayesian Estimation of Inverse Probability Weights for Non-monotone Missing Data","241724403":"Toward BlackBox Sampling: A Random-Direction Interior-Point Markov Chain Approach","260643368":"Inferences on lung cancer mortality rates based on reference priors under partial ordering","266194553":"Simultaneous Inference in Risk Assessment; a Bayesian Perspective","4914156":"Sequential classification on partially ordered sets","228634120":"Approximate Bayesian inference for quantiles","274869192":"Bayesian Analysis of an Epidemiologic Model of Plasmodium falciparum Malaria Infection in Ndiop, Senegal","222239380":"A Bayesian approach to testing decision making axioms","48319821":"Informative hypotheses. How to move beyond classical null hypothesis testing","222403820":"MCMC Algorithms for constrained variance matrices","291097847":"Bayesian Computations in Survival Models Via the Gibbs Sampler","254287512":"Maximum Likelihood Estimation Under Order Restrictions by the Prior Feedback Method","257940719":"Monte Carlo Methods in Bayesian Statistics","24063711":"A Robust Bayesian Approach for Structural Equation Models with Missing Data","267653701":"Probabilities, laws, and structures. Selected papers of four workshops organized by the ESF Research Networking Programme “The Philosophy of Science in a European Perspective” (PSE) in 2010","29860468":"Clusterwise Pricing in Stores of a Retail Chain","2421139":"A Mixture-Model Approach to the Analysis of Survival Data","260378674":"Statistical Analysis of Fracture-Length Distribution Sampled Under the Truncation and Censoring Effects","235004345":"Efficient Sampling from Truncated Bivariate Gaussians via the Box-Muller Transformation","2601375":"Estimating Ratios of Normalizing Constants for Densities with Different Dimensions","4791283":"Testing loglinear models with inequality constraints : A comparison of asymptotic, bootstrap, and posterior predictive p-values","246157584":"Facilitating the Gibbs Sampler: The Gibbs Stopper and the Griddy-Gibbs Sampler","254040216":"A UNIFIED BAYESIAN APPROACH FOR ANALYZING CORRELATED ORDINAL RESPONSE DATA","243026880":"On bilateral selection model and its application to inequality constrained problems","220504729":"Sampling Some Truncated Distributions Via Rejection Algorithms","257800931":"Inferring Upon Heterogeneous Associations in Dairy Cattle Performance Using a Bivariate Hierarchical Model","259570886":"Efficient Sampling Methods for Truncated Multivariate Normal and Student-t Distributions Subject to Linear Inequality Constraints","243103678":"[Bayesian Computation and Stochastic Systems]: Rejoinder","4765067":"Bayesian Inference For The Half-Normal And Half-T Distributions","6347683":"Bayesian methods for the analysis of inequality constrained contingency tables","24233653":"Parameter estimation in selected populations with missing data","264639503":"A Measure of Uncertainty regarding the Interval Constraint of Normal Mean Elicited by Two Stages of a Prior Hierarchy","291340950":"Selection Indices and Multivariate Analysis Show Similar Results in the Evaluation of Growth and Carcass Traits in Beef Cattle","243048371":"An index sampling algorithm for the bayesian analysis of a class of model selection problems","1781193":"A Short History of Markov Chain Monte Carlo: Subjective Recollections\nfrom Incomplete Data","240727950":"Relevance of Functional Flexibility for Heterogeneous Sales Response Models","24079501":"A Bayesian approach to dynamic Tobit models","225121423":"Bayesian estimation of the linear regression model with an uncertain interval constraint on coefficients","222288088":"The one-way layout with ordered parameters: A survey of advances since 1988","238227907":"Estimation of Electoral Disproportionality and Thresholds via MCMC1","228795985":"Who\u0027s Got the Coupon? Estimating Consumer Preferences and Coupon Usage from Aggregate Information","222414514":"Bayesian model selection of informative hypotheses for repeated measurements","27694163":"Bayesian computational methods for inequality constrained latent class analysis","7371141":"Bayesian Inferences on Umbrella Orderings","228693591":"BAYESIAN CONDITIONAL DENSITY ESTIMATION","268373001":"INFERENCIA EN POBLACIONES DONDE SE DESCONOCE LA CANTIDAD DE INFORMACIÓN PERDIDA","45863756":"Simulation of truncated normal variates","51858158":"A Bayesian order-restricted model for hormonal dynamics during menstrual cycles of healthy women","245570397":"The Bayesian Inference for Software Reliability Models Based on NHPP"},"index":841}