{"abs":"The performance of an Evolutionary Algorithm (EA) is greatly affected by the settings of its strategy parameters. An effective solution to the parameterisation problem is adaptive parameter control, which applies learning methods that use feedback from the optimisation process to evaluate the effect of parameter value choices and adjust the parameter values over the iterations. At every iteration of an EA, the performance of an EA is reported and employed by the feedback mechanism as an indication of the success of the parameterisation of the algorithm instance. Many approaches to collect information about the algorithm\u0027s performance exist in single objective optimisation. In this work, we review the most recent and prominent approaches. In multiobjective optimisation, establishing a single scalar which can report the algorithm\u0027s performance as feedback for adaptive parameter control is a complex task. Existing performance measures of multiobjective optimisation are generally used as feedback for the optimisation process. We discuss the properties of these measures and present an empirical evaluation of the binary hypervolume and ϵ+-indicators as feedback for adaptive parameter control.","title":"Studying Feedback Mechanisms for Adaptive Parameter Control in Evolutionary Algorithms","id":256453810,"url":"https://www.researchgate.net/publication/256453810_Studying_Feedback_Mechanisms_for_Adaptive_Parameter_Control_in_Evolutionary_Algorithms","names":["Aldeida Aleti","I. Moser"],"references":{"3114350":"Patnaik, L.M.: Adaptive probabilities of crossover and mutation in genetic algorithms. IEEE Trans. Syst. Man Cybern. 24, 656-667","3949503":"Scalable multi-objective optimization test problems","3865145":"On measuring multiobjective evolutionary algorithm performance","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","239799501":"The Kolmogorov-Smirnov Goodness-of-Fit Statistic with Discrete and Grouped Data","3642225":"Design space exploration using the genetic algorithm","269154243":"Comparison of Multi-Objective Evolutionary Algorithms for Long-Term Monitoring Design","220403369":"Autonomous operator management for evolutionary algorithms","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","2522154":"Why Quality Assessment of Multiobjective Optimizers Is Difficult","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","224330704":"Limitations of Existing Mutation Rate Heuristics and How a Rank GA Overcomes Them","221883565":"Borg: An Auto-Adaptive Many-Objective Evolutionary Computing Framework","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","228569093":"The Rank-scaled Mutation Rate for Genetic Algorithms","2239800":"On Measuring Multiobjective Evolutionary Algorithm Performance","2333240":"Multiobjective Function Optimization Using Nondominated Sorting Genetic Algorithms","51692937":"Diagnostic Assessment of Search Controls and Failure Modes in Many-Objective Evolutionary Optimization","221161037":"A Diversity Metric for Multi-objective Evolutionary Algorithms.","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","201976495":"Adapting Operator Probabilities in Genetic Algorithm","262405508":"On Set-Based Multiobjective Optimization","222681003":"Comparing state-of-the-art evolutionary multiobjective algorithms for long-term groundwater monitoring design. Advances in Water Resources, 29(6), 792-807","2609749":"Multiobjective Evolutionary Algorithms: Classifications, Analyses, and New Innovations","220885529":"What Have You Done for Me Lately? Adapting Operator Probabilities in a Steady-State Genetic Algorithm.","250697154":"AORCEA – An adaptive operator rate controlled evolutionary algorithm","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","220701522":"An Emperical Study on GAs “Without Parameters”","11161759":"Combining Convergence and Diversity in Evolutionary Multi-Objective Optimization","30869230":"Handbook Of Genetic Algorithms","220701848":"A Compass to Guide Genetic Algorithms"},"citedIn":{"281431829":"The Multiple Knapsack Problem Approached by a Binary Differential Evolution Algorithm with Adaptive Parameters","291972372":"Tutorial Sobre o Uso de Técnicas para Controle de Parâmetros em Algoritmos de Inteligência de Enxame e Computação Evolutiva"},"index":848}