{"abs":"Incluye bibliografía e índice","title":"Non-negative matrices and markov chains / E. Seneta","id":44478088,"url":"https://www.researchgate.net/publication/44478088_Non-negative_matrices_and_markov_chains_E_Seneta","names":["Eugene Seneta"],"references":{},"citedIn":{"225400430":"Boundaries of random walks on graphs and groups with infinitely many ends","275342760":"Which types of learning make a simple game complex?","221768884":"Context-free pairs of groups II - Cuts, tree sets, and random walks","44898088":"Actions of Z^k associated to higher rank graphs","45910971":"A Bootstrap Algebraic Multilevel method for Markov Chains","2100714":"Actions of ${\\mathbb Z}^k$ associated to higher rnak graphs","45907058":"Survival, Extinction and Approximation of Discrete-time Branching Random Walks","224238540":"A Deterministic Equivalent for the Analysis of Correlated MIMO Multiple Access Channels","229283067":"Trends and oscillations in tick population dynamics","24163172":"Zero-temperature limit of one-dimensional Gibbs states via renormalization: The case of locally constant potentials","220972477":"Graph theoretic models and tools for the analysis of dynamic wireless multihop networks","40220797":"Parallel Speed-Up of Monte Carlo Methods for Global Optimization","1771331":"Approximating critical parameters of branching random walks","224108611":"Learning Under Social Influence","221042101":"Asymmetric Information Diffusion via Gossiping on Static and Dynamic Networks","239534044":"STOCHASTIC NONLINEAR PERRON-FROBENIUS","24173162":"Approaching the Ground State of a Quantum Spin Glass using a Zero-Temperature Quantum Monte Carlo","228545412":"A Tour of Modern Image Processing","228885753":"Growth and ergodicity of context-free languages","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","3086092":"Spatial Capacity of Multiple-Access Wireless Networks","51889201":"Two-sided reflected Markov-modulated Brownian motion with applications\nto fluid queues and dividend payouts","226899054":"Distribution of Subdominant Eigenvalues of Matrices with Random Rows","257319551":"An annotated bibliography on convergence of matrix products and the theory of joint/generalized spectral radius","220886790":"Endogenous Control of DeGroot Learning.","7552030":"Persistence of viral infections on the population level explained by an immunoepidemiological model","51930089":"Agent Based Models and Opinion Dynamics as Markov Chains","256738170":"Normal forms for unary probabilistic automata","224220772":"Approximation and Limiting Behavior of Random Models"},"index":85}