{"abs":"a b s t r a c t In the present study, a modified variant of Differential Evolution (DE) algorithm for solving multi-objec-tive optimization problems is presented. The proposed algorithm, named Multi-Objective Differential Evolution Algorithm (MODEA) utilizes the advantages of Opposition-Based Learning for generating an ini-tial population of potential candidates and the concept of random localization in mutation step. Finally, it introduces a new selection mechanism for generating a well distributed Pareto optimal front. The perfor-mance of proposed algorithm is investigated on a set of nine bi-objective and five tri-objective bench-mark test functions and the results are compared with some recently modified versions of DE for MOPs and some other Multi Objective Evolutionary Algorithms (MOEAs). The empirical analysis of the numerical results shows the efficiency of the proposed algorithm.","title":"An efficient Differential Evolution based algorithm for solving multi-objective optimization problems","id":235832912,"url":"https://www.researchgate.net/publication/235832912_An_efficient_Differential_Evolution_based_algorithm_for_solving_multi-objective_optimization_problems","names":["Musrrat Ali","Patrick Siarry","Millie Pant"],"references":{"220741544":"Reference Point Based Multi-Objective Optimization Using Evolutionary Algorithms","4242497":"Opposition-Based Learning: A New Scheme for Machine Intelligence","3865145":"On measuring multiobjective evolutionary algorithm performance","220176795":"Multi-objective self-adaptive differential evolution with elitist archive and crowding entropy-based diversity measure. Soft Comput Fusion Found Method Appl","3418687":"A fast and elitist multiobjective genetic algorithm: NSGA-II. IEEE Trans Evolut Comput","223618776":"A comparative study of various meta-heuristic techniques applied to the multilevel thresholding problem","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","4939867":"Omni-optimizer: A generic evolutionary algorithm for single and multi-objective optimization","26850953":"Multi-Objective Differential Evolution Algorithm for Solving Engineering Problems","220742329":"Incorporating directional information within a differential evolution algorithm for multiobjective optimization","3949353":"Multiobjective optimization using a Pareto differential evolution approach","2478141":"The Self-Adaptive Pareto Differential Evolution","2239800":"On Measuring Multiobjective Evolutionary Algorithm Performance","216300868":"Scalable Test Problems for Evolutionary Multi-Objective Optimization","3949464":"The self-adaptive Pareto differential evolution algorithm","234802779":"Coello, C.A.C.: An updated survey of GA-based multi-objective optimization techniques. ACM Computing Surveys 32(2), 109-143","223684848":"Adaptive differential evolution algorithm for multiobjective optimization problems","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","262405508":"On Set-Based Multiobjective Optimization","221007493":"MODE-LD+SS: A novel Differential Evolution algorithm incorporating local dominance and scalar selection mechanisms for multi-objective optimization","4090135":"A comparative study of differential evolution, particle swarm optimization, and evolutionary algorithms on numerical benchmark problems, Evolutionary Computation CEC 2004. Congress on, vol 2. IEEE","46491882":"An improved multiobjective differential evolution based on Pareto-adaptive -dominance and orthogonal design","2246029":"Genetic Algorithms for Multiobjective Optimization: Formulation, Discussion, Generalization","246648860":"Differential Evolution: A Simple and Efficient Adaptive Scheme for Global Optimization Over Continuous Spaces","3904009":"PDE: A Pareto-frontier differential evolution approach for multi-objective optimization problems","3419015":"Opposition-based differential evolution. IEEE Trans Evol Comput","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","221008027":"Multi-objective optimization based on self-adaptive differential evolution algorithm","227201202":"Multi-Criteria Decision Making","220045346":"An Empirical Study of Evolutionary Techniques for Multiobjective Optimization in Engineering Design","220380898":"Opposition-Based Differential Evolution.","221228524":"DEMO: Differential Evolution for Multiobjective Optimization","45280500":"HypE: An Algorithm for Fast Hypervolume-Based Many-Objective Optimization","222402442":"Ali, M.M.: A numerical study of some modified differential evolution algorithms. Eur. J. Oper. Res. 169, 1176-1184","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","221175295":"Multiobjective Differential Evolution Based on Opposite Operation","235838553":"A comparative study of various meta-heuristic techniques applied to the multilevel thresholding problem","220119492":"Image thresholding based on Pareto multiobjective optimization","220702076":"A Multiobjective Differential Evolution Based on Decomposition for Multiobjective Optimization with Variable Linkages","221006832":"Multi-objective Optimization Using Self-adaptive Differential Evolution Algorithm","216300933":"The Pareto Archived Evolution Strategy: A New Baseline Algorithm for Pareto Multiobjective Optimisation","221494233":"A Novel Opposition-Based Multi-objective Differential Evolution Algorithm for Multi-objective Optimization","215757874":"The Pareto Archive Evolution Strategy: A New Baseline Algorithm for Multi-Objective Optimization","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","232644522":"A Modified Differential Evolution Algorithm and Its Application to Engineering Problems","4074951":"Pareto-based multi-objective differential evolution","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II","220403416":"A study on the use of non-parametric tests for analyzing the evolutionary algorithms\u0027 behaviour: A case study on the CEC\u00272005 Special Session on Real Parameter Optimization"},"citedIn":{"283703016":"An Approach to Solve Multi-criteria Supplier Selection While Considering Environmental Aspects Using Differential Evolution","257435481":"Application of covariance matrix adaptation–evolution strategy to optimal control of hepatitis B infection","276315257":"A new orthogonal evolutionary algorithm based on decomposition for multi-objective optimization","282270609":"Design of Three-Phase Induction Machine Using Differential Evolution Algorithm","277352397":"A Multiobjective Evolutionary Algorithm for Energy-Efficient Cooperative Spectrum Sensing in Cognitive Radio Sensor Network","275060003":"Opposition-based Multiple Objective Differential Evolution (OMODE) for optimizing work shift schedules","264002043":"Application of Cognitive Techniques to Network Management and Control","270723368":"A New Local Search-Based Multiobjective Optimization Algorithm","282631764":"Multi-objective Optimization of a Parallel Ankle Rehabilitation Robot Using Modified Differential Evolution Algorithm","285549896":"A Novel Multiple Objective Symbiotic Organisms Search (MOSOS) for Time-Cost-Labor Utilization Tradeoff Problem","268694477":"Hybrid multiple objective artificial bee colony with differential evolution for the time-cost-quality tradeoff problem","265789336":"Methods for Multi-Objective Optimization: An Analysis","273275654":"A Novel Hybrid Multi-Objective Population Migration Algorithm","2465269":"An Overview of Evolutionary Algorithms in Multiobjective Optimization","261342849":"Multi-objective optimization using a hybrid differential evolution algorithm","256970754":"Dynamic environmental economic dispatch using multiobjective differential evolution algorithm with expanded double selection and adaptive random restart","264289495":"Adaptive multiple evolutionary algorithms search for multi-objective optimal reactive power dispatch","275331838":"A Walk into Metaheuristics for Engineering Optimization: Principles, Methods and Recent Trends","257498497":"Real parameter optimization by an effective differential evolution algorithm","269387478":"A self-adaptive differential evolution algorithm for continuous optimization problems","260947924":"Mathematical analysis and solutions for multi-objective line-cell conversion problem","278323018":"Reconfiguration of satellite orbit for cooperative observation using variable-size multi-objective differential evolution","281887827":"Engineering design optimization using hybrid (DE-PSO-DE) algorithm","263957275":"Multiobjective Operation Optimization of Naphtha Pyrolysis Process Using Parallel Differential Evolution","273749809":"Opposition-Based Multiple-Objective Differential Evolution to Solve the Time–Cost–Environment Impact Trade-Off Problem in Construction Projects","275672076":"An Improved Differential Evolution Algorithm with Triangular Mutation for Global Numerical Optimization","236896701":"Unconventional initialization methods for differential evolution","257162224":"Structure control classification and optimization model of hollow carbon nanosphere core polymer particle based on improved differential evolution support vector machine","273499620":"RDEL: Restart Differential Evolution algorithm with Local Search Mutation for global numerical optimization","267456347":"Self-adaptive differential evolution algorithm with discrete mutation control parameters","260606755":"An efficient co-swarm particle swarm optimization for non-linear constrained optimization","271730329":"Modified differential evolution algorithm using a new diversity maintenance strategy for multi-objective optimization problems","262875143":"Multiobjective Differential Evolutionary Neural Network for Multi Class Pattern Classification","282069117":"Multi objective multi swarm PSO based feature selection in classification","284000988":"Optimal sub-band adaptive thresholding based edge preserved satellite image denoising using adaptive differential evolution algorithm","276922418":"A Modified Multi-Objective DE Algorithm with Application in Reinsurance Analytics","239944377":"Multiobjective Optimization Design of a Fractional Order PID Controller for a Gun Control System","288208472":"A novel hybrid optimizer for solving Economic Load Dispatch problem","256938406":"An improved multi-objective differential evolution with a termination criterion for optimizing chemical processes","274112161":"Evaluation of Combined Pareto Multiobjective Differential Evolution on Tuneable Problems","281175285":"Tsallis Entropy based Multilevel Thresholding for Colored Satellite Image Segmentation using Evolutionary Algorithms","283001445":"A multi-objective dynamic differential evolution algorithm based on population strategy","261124844":"Multiobjective differential evolution algorithm with opposition-based parameter control","259993410":"A review of opposition-based learning from 2005 to 2012","262426266":"Minimization of cost, sediment load, and sensitivity to climate change in a watershed management application"},"index":854}