{"abs":"Optimization problems can often be tackled with respect to several objectives. In such cases, there can be several incomparable Pareto-optimal solutions. Computing or approximating such solutions is a major challenge in algorithm design. Here, we show how to use an extended beam-search technique to solve a multi-criteria scheduling problem for heterogeneous machines. This method, called MO-Greedy (for Multi-Objective greedy), allows the design of a multi-objective algorithm when a single-objective greedy one is known. We show that we can generate, in a single execution, a Pareto front optimized with respect to the preferences specified by the decision maker. We compare our approach to other heuristics and an approximation algorithm and show that the obtained front is, on average, better with our method.","title":"MO-Greedy: An Extended Beam-Search Approach for Solving a Multi-criteria Scheduling Problem on Heterogeneous Machines","id":224257127,"url":"https://www.researchgate.net/publication/224257127_MO-Greedy_An_Extended_Beam-Search_Approach_for_Solving_a_Multi-criteria_Scheduling_Problem_on_Heterogeneous_Machines","names":["Louis-Claude Canon","E. Emmanuel"],"references":{"242916378":"Using beam search techniques for sequencing mixed-model assembly lines","263124175":"ParadisEO: A Framework for the Reusable Design of Parallel and Distributed Metaheuristics: Special Issue: New Advances on Parallel Meta-Heuristics for Complex Problems (Guest Editor: Enrique Alba)","29637893":"Evaluation and Optimization of the Robustness of DAG Schedules in Heterogeneous Environments","223798263":"A beam search heuristic method for mixed-model scheduling with setups","224309500":"A Fast Incremental Hypervolume Algorithm","49256909":"Introduction to algorithms","29648167":"Bi-objective Scheduling Algorithms for Optimizing Makespan and Reliability on Heterogeneous Systems","46491649":"New solution methods for single machine bicriteria scheduling problem: Minimization of average flowtime and number of tardy jobs","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","2605569":"PISA --- A Platform and Programming Language Independent Interface for Search Algorithms","262405508":"On Set-Based Multiobjective Optimization","4879042":"Bicriteria train scheduling for high-speed passenger railroad planning applications","247442902":"Introduction To Algorithms","3799251":"Task scheduling algorithms for heterogeneous processors","229763167":"Heuristic Estimation of the Efficient Frontier for a Bi‐Criteria Scheduling Problem","4279125":"Reliability and Scheduling on Systems Subject to Failures","220768893":"Bi-Objective Approximation Scheme for Makespan and Reliability Optimization on Uniform Parallel Machines","225592104":"A multi-objective iterated greedy search for flowshop scheduling with makespan and flowtime criteria","234544416":"The Harpy Speech Recognition System, PhD thesis","4914357":"Bicriteria Scheduling Problem Involving Total Tardiness and Total Earliness Penalties"},"citedIn":{"261389332":"MOHEFT: A multi-objective list-based method for workflow scheduling","271020901":"Dynamic group job shop scheduling","261526754":"Multi-ObjectiveWorkflow Scheduling: An Analysis of the Energy Efficiency and Makespan Tradeoff","271922351":"Multi-objective workflow scheduling in Amazon EC2","275579809":"Dynamic Pareto-optimal group scheduling in parallel machine shop","282598485":"Pareto tradeoff scheduling of workflows on federated commercial Clouds","261916978":"Multi-objective energy-efficient workflow scheduling using list-based heuristics"},"index":857}