{"abs":"We obtain rates of convergence of stochastic relaxation (heat bath algorithm) for continuous densities which have the form of bounded perturbations of Gaussian densities. The rates are calculated in the spaces of square integrable functions with respect to these desities in which the operator generated by the stochastic relaxation process has the form of a product of projections.","title":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","id":222367826,"url":"https://www.researchgate.net/publication/222367826_On_rates_of_convergence_of_stochastic_relaxation_for_Gaussian_and_non-Gaussian_distributions","names":["Yali Amit","Journal of Multivariate Analysis"],"references":{"247219245":"Practical and Mathematical Aspects of the Problem of Reconstructing Objects from Radiographs","243765427":"A Pattern Theoretical Study of Biological Shapes","231909716":"Improving Stochastic Relaxation for Gussian Random Fields","13277506":"Multigrid Monte Carlo method. Conceptual foundations","244416205":"A New Approach to the Limit Theory of Recurrent Markov Chains","242609128":"Structural Image Restoration Through Deformable Templates","23630599":"Comparing sweep strategies for stochastic relaxation"},"citedIn":{"1917916":"A theoretical comparison of the data augmentation, marginal augmentation and PX-DA algorithms","228605538":"Non-Centered Parameterisations for Hierarchical Models and Data Augmentation","242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","2516768":"Algorithms Based on Data Augmentation: A Graphical Representation and Comparison","2119719":"Accelerating diffusions. Ann Appl Prob","51887262":"Cross-Fertilizing Strategies for Better EM Mountain Climbing and DA\nField Exploration: A Graphical Guide Book","48167060":"On the Stationary Distribution of Iterative Imputations","257147229":"Applications of geometric bounds to the convergence rate of Markov chains on Rn","227512257":"Markov Chains and De‐initializing Processes","265209665":"Augmentation Schemes for Particle MCMC","239756954":"To Center or Not to Center: That is Not the Question — An Ancillarity-Sufficiency Interweaving Strategy (ASIS) for Boosting MCMC Efficiency","226539729":"Convergence assessment techniques for Markov chain Monte Carlo","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","2520884":"Coordinate Selection Rules for Gibbs Sampling","222469520":"Markov chain convergence: From finite to infinite","2697533":"Rate of Convergence of the Gibbs Sampler by Gaussian Approximation","239755230":"On the performance of the gibbs sampler for the multivariate normal distribution","228398537":"Norm comparisons for data augmentation","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","224342213":"A Bit of Information Theory, and the Data Augmentation Algorithm Converges","255667047":"Problemi Applicativi di Simulazione e Stima Parametrica in Modelli Spaziali Condizionali Gaussiani","220286523":"A case study in non-centering for data augmentation: Stochastic epidemics","238092075":"Nonreversible perturbations accelerate convergence","2868848":"Markov Chains and De-initialising Processes","263032816":"Attaining the Optimal Gaussian Diffusion Acceleration","247470302":"Seeking Efficient Data Augmentation Schemes via Conditional and Marginal Augmentation","2642998":"Analysis of systematic scan Metropolis algorithms using Iwahori-Hecke algebra techniques","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","227611763":"Updating Schemes, Correlation Structure, Blocking, and Parametization for the Gibbs Sampler","277679273":"Bayesian Computation Via Markov Chain Monte Carlo","243767457":"On inference for non-linear diffusion models using the Hastings-Metropolis algorithms","38348782":"On the convergence of the Markov chain simulation method. Ann. Statist., 24: 69-100","247779875":"The Art of Data Augmentation","263117702":"Markov Chains and De-initializing Processes","23631235":"On the Geometrical Convergence of Gibbs Sampler inRd","225141376":"Bayesian sequential inference for nonlinear multivariate diffusions","243776875":"Spatial Statistics and Bayesian Computing","4109395":"Shuffling by semi-random transpositions","242966101":"Convergence rate of Gibbs sampler and its application","2214798":"Stability of the Gibbs Sampler for Bayesian Hierarchical Models","1762088":"A General Framework for the Parametrization of Hierarchical Models","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","31382311":"Is Partial-Dimension Convergence a Problem for Inferences from MCMC Algorithms?","274764315":"Bayesian data analysis for agricultural exper"},"index":87}