{"abs":"The Gibbs sampler has been proposed as a general method for Bayesian calculation in Gelfand and Smith (1990). However, the predominance of experience to date resides in applications assuming conjugacy where implementation is reasonably straightforward. This paper describes a tailored approximate rejection method approach for implementation of the Gibbs sampler when nonconjugate structure is present. Several challenging applications are presented for illustration.","title":"An iterative Monte Carlo method for nonconjugate Bayesian analysis","id":226073479,"url":"https://www.researchgate.net/publication/226073479_An_iterative_Monte_Carlo_method_for_nonconjugate_Bayesian_analysis","names":["Bradley P. Carlin","Alan E. Gelfand","Statistics and Computing"],"references":{"243620229":"Accurate Approximations for Posterior Moments and Marginal Densities. — JASA, 81, 82-86","265672532":"Bayesian Inference for Generalized Linear and Proportional Hazards Models via Gibbs Sampling","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","261593363":"Stochastic Simulation","254287149":"Generalized Linear Models With Random Effects; A Gibbs Sampling Approach","22146202":"A Generalization of the Probit and Logit Methods for Dose Response Curves","38358978":"Natural Exponential Families with Quadratic Variance Functions: Statistical Theory","4895745":"Bayesian Inference in Econometric Models Using Monte Carlo Integration","38358405":"Conjugate Priors for Exponential Families","268490386":"Applications of a Method for the Efficient Computation of Posterior Distributions”, Applied Statistics, 31, 214-225","254332410":"Robust Empirical Bayes Analyses of Event Rates","241228851":"Tools for Statistical Inference: Observed Data and Data Augmentation Methods, Vol. 67 of Lecture Notes in Statistics","268168815":"Computing observed information by finite differences","225304570":"Non-Uniform Random Variate Generation","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","227907701":"The Calculation of the Dosage-Mortality Curve,\u0027\u0027","227103273":"Effcient generation of random variates via the ratio–of–uniforms method","245872004":"Derivative-free adaptive rejection sampling for Gibbs sampling","243048927":"The Implementation of the Bayesian Paradigm","243049627":"Gibbs sampling for marginal posterior expectations","239065044":"Handbook of Non-Linear Regression Models","220688406":"Statistical Decision Theory and Bayesian Analysis","224910613":"Adaptive Rejection Sampling for Gibbs Sampling","222865404":"Econometric illustrations of novel numerical integration strategies for Bayesian inference","246094110":"Estimating a Product of Means: Bayesian Analysis with Reference Priors","34020977":"The parametrisation of statistical models.","265429604":"Stochastic Simulation","271760261":"Progress with Numerical and Graphical Methods for Practical Bayesian Statistics","243687932":"Reference Posterior Distributions for Bayesian Inference","244464104":"Hierarchical Bayesian Analysis of Change Point Problems","239582331":"Stochastic Relaxation, Gibbs Distributions and the Bayesian Resoration of Images","243689785":"Illustration of Bayesian Inference in Normal Data Models Using Gibbs Sampling"},"citedIn":{"242407089":"Bayesian Computation Via the Gibbs Sampler and Related Markov Chain Monte Carlo Methods","222266491":"Bayesian inference of binary regression models with parametric link","226405880":"Random variate transformations in the Gibbs sampler: issues of efficiency and convergence","229869689":"Empirical Bayes Estimators for Spatially Correlated Incidence Rates","254396006":"Stylized Facts and Discrete Stochastic Volatility Models","51847750":"The Polya Tree Sampler: Toward Efficient and Automatic Independent Metropolis-Hastings Proposals","262291447":"Discretization-based direct random sample generation","223770368":"On Bayesian reliability analysis with informative priors and censoring","2620592":"BUGS Examples - Version 0.5 Volume 1","267560874":"An application of the theory of semi–Markov processes in simulation","38357609":"Markov Chains for Exploring Posterior Distributions","2573703":"Smooth Transition Garch Models: A Bayesian Perspective","24083724":"A Bayesian Adjustment for Covariate Misclassification with Correlated Binary Outcome Data","222429412":"On convergence of properly weighted samples to the target distribution","2757197":"Adaptation for Self Regenerative MCMC","2783885":"Adaptive Markov Chain Monte Carlo through Regeneration","265217252":"Subject-Specific and Population-Averaged Continuation Ratio Logit Models for Multiple Discrete Time Survival Profiles","5058275":"Smooth transition GARCH models: A Bayesian perspective","15358469":"Empirical Bayes Methods for Stabilizing Incidence Rates before Mapping","241475543":"Identification of Regeneration Times in MCMC Simulation, With Application to Adaptive Schemes","220504855":"Simulation from a Target Distribution Based on Discretization and Weighting","38322172":"Self regenerative Markov chain Monte Carlo with adaption","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","2816351":"Bayesian Analysis of Ordered Categorical Data From Industrial Experiments","222946943":"Bayesian Inference in Econometric Models with Symmetric Stable Disturbances","239442556":"Bayesian Analysis of Errors-in-Variables Regression Models","246157584":"Facilitating the Gibbs Sampler: The Gibbs Stopper and the Griddy-Gibbs Sampler","4902135":"Bayesian inference on GARCH models using Gibbs sampler","45289422":"A two-component nonlinear mixed effects model for longitudinal data, with application to gastric emptying studies","256660339":"An efficient and versatile approach to trust and reputation using hierarchical Bayesian modelling"},"index":874}