{"abs":"We are focusing on bound constrained global optimization problems, whose objective functions are computationally expensive black-box functions and have multiple local minima. The recently popular Metric Stochastic Response Surface (MSRS) algorithm proposed by \\cite{Regis2007SRBF} based on adaptive or sequential learning based on response surfaces is revisited and further extended for better performance in case of higher dimensional problems. Specifically, we propose a new way to generate the candidate points which the next function evaluation point is picked from according to the metric criteria, based on a new definition of distance, and prove the global convergence of the corresponding. Correspondingly, a more adaptive implementation of MSRS, named \"SO-SA\", is presented. \"SO-SA\" is is more likely to perturb those most sensitive coordinates when generating the candidate points, instead of perturbing all coordinates simultaneously. Numerical experiments on both synthetic problems and real problems demonstrate the advantages of our new algorithm, compared with many state of the art alternatives.}","title":"A General Stochastic Algorithmic Framework for Minimizing Expensive Black Box Objective Functions Based on Surrogate Models and Sensitivity Analysis","id":267338852,"url":"https://www.researchgate.net/publication/267338852_A_General_Stochastic_Algorithmic_Framework_for_Minimizing_Expensive_Black_Box_Objective_Functions_Based_on_Surrogate_Models_and_Sensitivity_Analysis","names":["Yilun Wang","Christine A. Shoemaker"],"references":{"220249123":"Improved scatter search for the global optimization of computationally expensive dynamic models","220669505":"A Stochastic Radial Basis Function Method for the Global Optimization of Expensive Functions","222676973":"Cannonsville Reservoir Watershed SWAT2000 Model Development Calibration and Validation","228885421":"Dynamically Dimensioned Search Algorithm for Computationally Efficient Watershed Model Calibration","220669229":"A Response Surface Approach to Beam Orientation Optimization in Intensity-Modulated Radiation Therapy Treatment Planning","2749603":"On the Convergence of Pattern Search Algorithms. SIAM J on Optimization 7: 1-25","226550378":"Global Optimization of Costly Nonconvex Functions Using Radial Basis Functions","2674306":"Direct Search Methods On Parallel Machines","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","216300668":"An Implicit Filtering Algorithm For Optimization Of Functions With Many Local Minima","267126870":"Radial basis functions: theory and implementations. Reprint of the 2003 hardback ed","222540952":"Algorithmic Construction of Symmetric Latin Hypercube Designs","225699304":"Stochastic global optimization methods. Part II: Multi level methods","220669176":"Scatter Search and Local NLP Solvers: A Multistart Framework for Global Optimization"},"citedIn":{},"index":875}