{"abs":"Chemical reactors represent probably the most hazardous units of chemical industry. Safety analysis of a chemical reactor requires basic knowledge of all particular processes which can be described by mathematical models. Most of the model parameters involved in the prediction of reactor behavior are uncertain. These uncertainties can cause discrepancies mainly in the prediction by models with nonlinear behavior and they can be the source of confusion in the design of chemical reactors and consequently also in the safety and operability analysis.The main aim of this work was to analyze the influence of uncertainties in the model parameters on the prediction of operating quantities by mathematical models with nonlinear behavior. Such analysis can be used for safety and operability analysis of an industrial catalytic ammonia reactor. The industrial fixed-bed reactor was used by a mathematical model with nine parameters. Analyses of the influence of uncertainty in a single model parameter and their combination were carried out by the Monte Carlo approach. It is shown that even a small uncertainty in one of the key parameters or in a combination of these key parameters can result in several steady states results of the operating quantities and can be the source of confusion in the design and consequently also in the safety and operability analysis.","title":"Influence of parameter uncertainty on modeling of industrial ammonia reactor for safety and operability analysis","id":257390821,"url":"https://www.researchgate.net/publication/257390821_Influence_of_parameter_uncertainty_on_modeling_of_industrial_ammonia_reactor_for_safety_and_operability_analysis","names":["P. Laššák","Juraj Labovský","Ĺ. Jelemenský","Journal of Loss Prevention in the Process Industries"],"references":{"222304770":"Fuzzy Sets as a Basis for Theory of Possibility","223084878":"A Case Study in Hybrid Process Safety Verification","244362198":"Comparative Assessment of the Dynamic Behaviour of an Exothermal Chemical Reaction Including Data Uncertainties","243784128":"Uncertainty in Geographic Information","227992286":"Analysing Uncertainty Propagation in GIS: Why is it not that Simple?","23885861":"Stochastic Processes And Filtering Theory","220649644":"A probabilistic framework for representing and simulating uncertain environmental variables","238181497":"An Introduction to Error Analysis: The Study of Uncertainty in Physical Measurement","230367658":"Multistability and Hysteresis in an Industrial Ammonia Reactor","3025340":"Recursive State Estimation: Unknown but Bounded Errors and System Inputs","224839861":"Geostatistics for Natural Resource Evaluation","227611780":"Analysis of Instability in an Industrial Ammonia Reactor","240410498":"Elicitation of Expert Opinions for Uncertainty and Risks","222051179":"Visualizing spatial data uncertainty using animation","220449332":"A general framework for error analysis in measurement-based GIS","245652222":"Chemical Reactor Analysis Design","223559629":"An integrated approach to early process hazard identification of continuous and batch plants with Statechart modelling and simulation","228448706":"Model-based HAZOP study of a real MTBE plant","273129880":"Applied Interval Analysis. Springer, London","225828439":"Monte Carlo Methods","222703008":"Modeling uncertainty in steady state diffusion problems via generalized polynomial chaos","202880304":"Random Number Generation and Monte Carlo Methods","32247685":"An Efficient Markov Chain Model for the Simulation of Heterogeneous Soil Structure","242817682":"Integrating Knowledge-Based and Mathematical Programming Approaches for Process Safety Verification","224683087":"Recursive state estimation: Unknown but bounded errors and system inputs","220649802":"A Generic Statistical Approach for Modelling Error of Geometric Features in GIS.","223310113":"Combining HAZOP with dynamic simulation—Applications for safety education","222382062":"Uncertainty and the Calculation of Safety-Related Parameters for Chemical Reactions","241249489":"POST-USE REVIEW: An Introduction to Error Analysis: The Study of Uncertainties in Physical Measurements","224839892":"Error Propagation in Environmental Modeling with GIS","40186896":"Upscaling and Downscaling Methods for Environmental Research","225397593":"HAZOP study of a fixed bed reactor for MTBE synthesis using a dynamic approach","222823025":"Mathematical model of a chemical reactor—useful tool for its safety analysis and design","51381802":"Boundary Conditions for Developing a Safety Concept for an Exothermal Reaction","223912354":"Latin Hypercube Sampling and the Propagation of Uncertainty in Analyses of Complex Systems, Technical Report, SAND2001-0417","223484653":"The Data Uncertainty Engine (DUE): A software tool for assessing and simulating uncertain environmental variables"},"citedIn":{"260440597":"Model-based hazard identification in multiphase chemical reactors","257846266":"Robust and optimal control approach for exothermic reactor stabilization","283115364":"Comparison of Robust Control Techniques for Use in Continuous Stirred Tank Reactor Control"},"index":883}