{"abs":"Gaussian processes provide a popular statistical modelling approach in various fields, including spatial statistics and computer experiments. Strategic experimental design could prove to be crucial when data are hard to collect. We use the Karhunen–Loève decomposition to study several popular design criteria. The resulting expressions are useful for understanding and comparing the criteria. A truncated form of the expansion is used to generate optimal designs. We give detailed results, including an error analysis, for the well-established integrated mean squared prediction error design criterion.","title":"Optimal designs for Gaussian process models |via spectral decomposition","id":265644734,"url":"https://www.researchgate.net/publication/265644734_Optimal_designs_for_Gaussian_process_models_via_spectral_decomposition","names":["Ofir Harari","David M. Steinberg","Journal of Statistical Planning and Inference"],"references":{"248562192":"Kernels of Trace Class Operators","50402307":"Gaussian Processes for Machine Learning (GPML) toolbox","225904882":"Computer experiments: A review","233373487":"Maximum Entropy Sampling","220320873":"Gaussian Processes for Ordinal Regression.","41781559":"Gaussian Process for Machine Learning","245893283":"Designs for Computer Experiments","236736850":"Spline Models of Observational Data","3060001":"Design and comparison of advanced semiconductor devices using computer experiments: Application to APD\u0027s and HEMT\u0027s","222215791":"Finite elements for elliptic problems with stochastic coefficients. Comput Methods Appl Mech Eng","221932969":"Statistics For Spatial Data","257016708":"The effect of the nugget on Gaussian process emulators of computer models","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","222662110":"Kriging metamodeling in simulation: a review. Eur J Oper Res","38363031":"Bayesian Experimental Design: A Review","227704780":"Design and Analysis for the Gaussian Process Model","216301381":"The Design and Analysis Computer Experiments","224309690":"Exploiting Correlation Kernels for EfÂ£cient Handling of Intra-Die Spatial Correlation, with Application to Statistical Timing","237548813":"Choosing the Sample Size of a Computer Experiment: A Practical Guide","229358467":"Batch sequential designs for computer experiments","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","224839774":"Statistic for Spatial Data","38359602":"Bayesian Optimal Designs for Linear Regression Models","243102979":"Data Analytic Tools for Understanding Random Field Regression Models","248301107":"Variable Selection for Gaussian Process Models in Computer Experiments","225560782":"Space-filling Latin hypercube designs for computer experiments"},"citedIn":{"281319429":"Gaussian Process Emulators for Computer Experiments with Inequality Constraints","270454589":"Variable Selection in Bayesian Semiparametric Regression Models","281408400":"Gaussian Process Emulators for Computer Experiments with Inequality Constraints","263015544":"A biologist, a statistician, and a bioinformatician walk into a conference room… and walk out with a great metagenomics project plan","281319339":"Gaussian Process Emulators for Computer Experiments with Inequality Constraints"},"index":885}