{"abs":"We study the domain geometry during spinodal decomposition of a 50:50 binary mixture in two dimensions. Extending arguments developed to treat nonconserved coarsening, we obtain approximate analytic results for the distribution of domain areas and perimeters during the dynamics. The main approximation is to regard the interfaces separating domains as moving independently. While this is true in the nonconserved case, it is not in the conserved one. Our results can therefore be considered as a \"first-order\" approximation for the distributions. In contrast to the celebrated Lifshitz-Slyozov-Wagner distribution of structures of the minority phase in the limit of very small concentration, the distribution of domain areas in the 50:50 case does not have a cutoff. Large structures (areas or perimeters) retain the morphology of a percolative or critical initial condition, for quenches from high temperatures or the critical point, respectively. The corresponding distributions are described by a cA-tau tail, where c and tau are exactly known. With increasing time, small structures tend to have a spherical shape with a smooth surface before evaporating by diffusion. In this regime, the number density of domains with area A scales as A1/2 , as in the Lifshitz-Slyozov-Wagner theory. The threshold between the small and large regimes is determined by the characteristic area A approximately t2/3. Finally, we study the relation between perimeters and areas and the distribution of boundary lengths, finding results that are consistent with the ones summarized above. We test our predictions with Monte Carlo simulations of the two-dimensional Ising model.","title":"Geometry of phase separation","id":38081623,"url":"https://www.researchgate.net/publication/38081623_Geometry_of_phase_separation","names":["Alberto Sicilia","Yoann Sarrazin","Jeferson J Arenzon","Alan J Bray","Leticia F. Cugliandolo","Physical Review E"],"references":{"1864798":"Theory of Phase Ordering Kinetics","13344847":"Monte Carlo study of growth in the two-dimensional spin-exchange kinetic Ising model","1872218":"Phase Separation Kinetics in a Model with Order-Parameter Dependent Mobility","13341314":"Numerical study of late-stage coarsening for off-critical quenches in the Cahn-Hilliard equation of phase separation","5617756":"Domain growth morphology in curvature-driven two-dimensional coarsening","235561283":"Theory and simulation of Ostwald ripening","200104742":"Theory of Dynamic Critical Phenomena","238919916":"Phase separation in an off-critical quench","13350751":"Corrections to Late-Stage Behavior in Spinodal Decomposition: Lifshiz–Slyozov Scaling and Monte Carlo Simulations","23710524":"Experimental Test of Curvature-Driven Dynamics in the Phase Ordering of a Two Dimensional Liquid Crystal","235557279":"Time evolution of a quenched binary alloy. III. Computer simulation of a two-dimensional model system, Phys. Rev. B. 13, 4328","235539743":"Late Stages of Spinodal Decomposition in Binary Mixtures","6331446":"Exact Results for Curvature-Driven Coarsening in Two Dimensions","1872522":"Breakdown of Scale Invariance in the Coarsening of Phase-Separating Binary Fluids","7388904":"Phase separation driven by surface diffusion: A Monte Carlo study","222457880":"A Microscopic Theory for Antiphase Domain Boundary Motion and Its Application to Antiphase Domain Coarsening","200105270":"Percolation Theory: An Introduction","200047088":"Percolation and Cluster DIstribution I. Cluster Multiple Labeling Technique and Critical Concentration Algorithm","13283223":"Theory and simulation of Ostwald ripening.","225828439":"Monte Carlo Methods","229258696":"Large scale simulations of the two-dimensional Cahn-Hilliard model","13345637":"Numerical Study of the Late Stages of Spinodal Decomposition","239660134":"Diffusion Constants Near the Critical Point for Time-Dependent Ising Models. Part III","282883373":"Time evolution of a quenched binary alloy: computer simulation of a two-dimensional model system","1835118":"Exact Results for the Universal Area Distribution of Clusters in Percolation, Ising, and Potts Models","243447478":"Domain growth controlled by interfacial transport in two-dimensional systems","223536740":"The Kinetics of Precipitation From Supersturated Sold Solutions","1864934":"Early stage scaling in phase ordering kinetics","234917114":"Free Energy of a Non-Uniform System. I. Interfacial Free Energy","13249521":"Scaling and fractal dimension of Ising clusters at the d\u003d2 critical point","13390064":"Correlations and Ostwald ripening","13291447":"Theory of unstable growth. II. Conserved order parameter","235461877":"Time evolution of a quenched binary alloy. II. Computer simulation of a three-dimensional model system, Phys. Rev. B. 12, 2000","231140088":"Geometric properties of two-dimensional coarsening with weak disorder"},"citedIn":{"278733724":"Percolation and coarsening in the bidimensional voter model","223991803":"Geometrical properties of Potts model during the coarsening regime","50397890":"Percolation of Diffusionally Evolved Two-Phase Systems","269116457":"Coarsening phenomena","243417061":"Metastable Phase Separation and Concomitant Solute Redistribution of Liquid Fe-Cu-Sn Ternary Alloy","47863005":"Quench dynamics of the 2d XY model","258740075":"In Situ Observation of Coarsening in a Phase-Separated Glass","224922404":"Crossover in growth laws for phase-separating binary fluids: Molecular dynamics simulations","254259627":"Effects of Domain Morphology on Kinetics of Fluid Phase Separation","257131934":"Surface-directed spinodal decomposition and enrichment in fluid mixtures: Molecular dynamics simulations: Kinetics of fluid mixtures at surfaces","51888345":"Universality in Fluid Domain Coarsening: The case of vapor-liquid\ntransition","228925642":"Coarsening in the Potts model: Out-of-equilibrium geometric properties","235388854":"Aging and Crossovers in Phase-Separating Fluid Mixtures","221965806":"A morphological study of cluster dynamics between critical points","222554902":"Topics in coarsening phenomena","49751010":"Scaling behavior of explosive percolation on the square lattice","278732616":"A novel coarsening mechanism of droplets in immiscible fluid mixtures","51653346":"Diffusive Domain Coarsening : Early Time Dynamics and Finite-Size Effects","43020617":"Curvature-driven coarsening in the two-dimensional Potts model","263707530":"Fragmentation and Limits to Dynamical Scaling in Viscous Coarsening: An Interrupted in situ X-Ray Tomographic Study"},"index":887}