{"abs":"An important task of uncertainty quantification is to identify {the probability of} undesired events, in particular, system failures, caused by various sources of uncertainties. In this work we consider the construction of Gaussian {process} surrogates for failure detection and failure probability estimation. In particular, we consider the situation that the underlying computer models are extremely expensive, and in this setting, determining the sampling points in the state space is of essential importance. We formulate the problem as an optimal experimental design for Bayesian inferences of the limit state (i.e., the failure boundary) and propose an efficient numerical scheme to solve the resulting optimization problem. In particular, the proposed limit-state inference method is capable of determining multiple sampling points at a time, and thus it is well suited for problems where multiple computer simulations can be performed in parallel. The accuracy and performance of the proposed method is demonstrated by both academic and practical examples.","title":"Gaussian process surrogates for failure detection: a Bayesian experimental design approach","id":281895996,"url":"https://www.researchgate.net/publication/281895996_Gaussian_process_surrogates_for_failure_detection_a_Bayesian_experimental_design_approach","names":["Hongqiao Wang","Guang Lin","Jinglai li"],"references":{"31646759":"Introduction to the mechanics of a continuous medium / L. A. Malvern.","43481745":"Finite Mixture Model","3082726":"A Nonparametric Estimation of the Entropy for Absolutely Continuous Distributions","223592988":"A new look at the response surface approach for reliability analysis","271513121":"The Cross-Entropy Method","24052159":"On the estimation of entropy","220649778":"“Kriging: A Method of Interpolation For Geographical Information Systems,”","226433195":"Polynomial Chaos for the Computation of Failure Probabilities in Periodic Problems","236843208":"Kriging Models for Global Approximation in Simulation-Based Multidisciplinary Design Optimization","273304476":"A Cross-Entropy Scheme for Mixtures","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","263047733":"Structural Reliability Methods","222042660":"CQ2RS: A new statistical approach to the response surface method for reliability analysis","256744276":"Multi-output local Gaussian process regression: Applications to uncertainty quantification","256744084":"Multi-output separable Gaussian process: Towards an efficient, fully Bayesian paradigm for uncertainty quantification","51890126":"Metamodel-based importance sampling for structural reliability analysis","29623261":"Adaptive Designs of Experiments for Accurate Approximation of Target Regions","253769405":"Efficient Global Reliability Analysis for Nonlinear Implicit Performance Functions","245284547":"A Response Surface Approach for Reliability Analysis","256918414":"Fast estimation of expected information gains for Bayesian experimental designs based on Laplace approximations","248560911":"Importance sampling in structural system","265414448":"Multivariate Stochastic Approximation Using a Simultaneous Perturbation Gradient Approximation","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","24051978":"Estimation of Entropy and Other Functionals of a Multivariate Density","244955839":"A Fast Efficient Response Surface Approach for Structural Reliability Problems","220320007":"Near-Optimal Sensor Placements in Gaussian Processes: Theory, Efficient Algorithms and Empirical Studies","51932401":"Simulation-based optimal Bayesian experimental design for nonlinear systems","220206985":"An efficient surrogate-based method for computing rare failure probability","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","226031060":"Sequential Monte Carlo for rare event estimation","222423661":"An improved response surface method for the determination of failure probability and importance measures","262369166":"KrigInv: An efficient and user-friendly implementation of batch-sequential inversion strategies based on Kriging","223651257":"A critical appraisal of reliability estimation procedures for high dimensions","228445426":"Bayesian Subset Simulation: a kriging-based subset simulation algorithm\nfor the estimation of small probabilities of failure","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","221966156":"Corrected Kriging Update Formulae for Batch-Sequential Data Assimilation","222780925":"A new adaptive importance sampling scheme","225331924":"The kriging update equations and their application to the selection of neighboring data","241707735":"Kriging-based adaptive Importance Sampling algorithms for rare event estimation"},"citedIn":{},"index":89}