{"abs":"Molecular geometric properties, such as volume, exposed surface area, and occurrence of internal cavities, are important inputs to many applications in molecular modeling. In this work we describe a very general and highly efficient approach for the accurate computation of such properties, which is applicable to arbitrary molecular surface models. The technique relies on a high performance ray casting framework that can be easily adapted to the computation of further quantities of interest at interactive speed, even for huge models.","title":"Measuring Properties of Molecular Surfaces Using Ray Casting","id":220951489,"url":"https://www.researchgate.net/publication/220951489_Measuring_Properties_of_Molecular_Surfaces_Using_Ray_Casting","names":["Mike Phillips","Iliyan Georgiev","Anna Hildebrandt","Stefan Nickels","Lukas Marsalek","Hans-Peter Lenhof"],"references":{"7436337":"BALLView: A tool for research and education in molecular modeling","226829188":"Van der Waals surface graphs and molecular shape","16648572":"Solvent accessible surface area and excluded volume in proteins. Analytical equations for overlapping spheres and implications for hydrophobic effect","220582566":"Molecular surfaces on proteins via beta shapes. Comput Aided Des","22864152":"Macromolecular Shape and Surface Maps by Solvent Extrusion","14459290":"The Contour-Buildup Algorithm to Calculate the Analytical Molecular Surface","225356392":"Deformable Smooth Surface Design","2435938":"The Protein Data Bank","20876345":"Triangulation algorithms for the representation of molecular surface properties","226048625":"Real-Time Triangulation of Molecular Surfaces","18349127":"Interpretation of Protein Structures - Total Volume, Group Volume Distributions and Packing Density","4375568":"RTfact: Generic concepts for flexible and high performance ray tracing","231449823":"Computation of Molecular Volume","233420476":"The Protein Data Bank","220252599":"An introduction to ray tracing.","23470001":"Cavities and Atomic Packing in Protein Structures and Interfaces","14932859":"Molecular skins: A new concept for quantitative shape matching of a protein with its small molecule mimics","215610881":"Exact and Efficient Analytical Calculation of the Accessible Surface Areas and Their Gradients for Macromolecules","20877095":"Molecular volumes and surfaces of biomacromolecules via GEPOL: A fast and efficient algorithm","270903100":"The Protein Data Bank","13543701":"Analytical shape computation of macromolecules: I. Molecular area and alpha shape","22811902":"Area, Volume, Packing, and Protein Structure","225828439":"Monte Carlo Methods","233487497":"Exact calculation of the volume and surface area of fused hard-sphere molecules with unequal atomic radii","220582477":"Triangulation of molecular surfaces","6245170":"Minimal molecular surfaces and their applications. J Comput Chem","44085069":"Molecular surface generation using a variable-radius solvent probe","4112464":"Guaranteed quality triangulation of molecular skin surfaces","220416786":"On the Analytical Calculation o van der Waals Surfaces and Volumes: Some Numerical Aspects.","6909338":"VADAR: A web server for quantitative evaluation of protein structure quality","47842924":"Rapid Software Prototyping in Computational Molecular Biology","5284454":"Metamol: high-quality visualization of molecular skin surface. J Mol Graph Model","11426008":"Novel computer program for fast exact calculation of accessible and molecular surface areas and average surface curvature","17635323":"The Interpretation of Protein Structure: Estimation of Static Accessibility","227886626":"Reduced SURFACE: An efficient way to compute molecular surfaces","16320192":"Solvent-Accessible Surfaces of Proteins and Nucleic Acids","266436696":"An Introduction to Ray Tracing","221360971":"Real-Time Ray Tracing of Complex Molecular Scenes.","228396711":"Realtime Ray Tracing on Current CPU Architectures","47861408":"Realtime Ray Tracing and Interactive Global Illumination","220417694":"Exact and Efficient Analytical Calculation of the Accessible Surface Areas and Their Gradients for Macromolecules","270311842":"Method of Numerical Integration","11451856":"Rapid Grid-Based Construction of the Molecular Surface and the Use of Induced Surface Charge to Calculate Reaction Field Energies: Applications to the Molecular Systems and Geometric Objects"},"citedIn":{"230202796":"Interactive Exploration of Protein Cavities","258819738":"Interactive Extraction and Tracking of Biomolecular Surface Features","47543404":"BALL - Biochemical algorithms library 1.3","236071800":"Between algorithm and model: different molecular surface definitions for the Poisson-Boltzmann based electrostatic characterization of biomolecules in solution. Commun Comput Phys","49826276":"GPU-powered tools boost molecular visualization","236193706":"A general and Robust Ray-Casting-Based Algorithm for Triangulating Surfaces at the Nanoscale"},"index":890}