{"abs":"In this dissertation, we investigate the conditions for the propagation and processing of temporal optical solitons in the rectangular geometry waveguides which are expected to play an important role as processing elements in optical communication systems. It is anticipated that the optical signals carrying information through optical fibers will be in the form of temporal soliton pulses, which can propagate undistorted for long distances under the condition that the dispersion is balanced by a nonlinearity in the optical fiber. An important parameter in the equation that governs temporal soliton propagation in a waveguide is the second derivative of the propagation vector with respect to the angular frequency, /omega, denoted by β/prime\u0027. We evaluate β/prime\u0027 for rectangular waveguides using a channel model of the waveguide, which takes into account the two transverse dimensions of the rectangular channel. Significant differences are found in the values of β/prime\u0027 obtained from our model and those obtained from the more traditional, one dimensional slab model. A major additional effort in the present thesis relates to the development of a theory of temporal soliton switching in a planar geometry nonlinear directional coupler. The theory is formulated in terms of the supermodes of the total structure, and again accounts for the two transverse dimensions of the channels. To accurately determine the coupling length and switching power of the nonlinear coupler, we apply corrections to the propagation constants of the supermodes that account for the non-zero electromagnetic fields in the outer corner regions of the waveguide channels. It is shown for the case of a SiO2 based nonlinear directional coupler operating at the central wavelength of 1.55 μm, that these corrections have a significant effect on both the coupling length and the switching power. Finally, we develop the conditions under which single mode rectangular waveguides can have zero dispersion at the optical communications wavelengths 1.31 μm or 1.55 μm, and discuss the end-to-end coupling of rectangular waveguides to the standard optical fibers used in optical communications. Our results are expected to serve as a guide for the design of planar geometry based processing elements in a variety of optical communications devices.","title":"Propagation and switching of light in rectangular waveguiding structures","id":234187441,"url":"https://www.researchgate.net/publication/234187441_Propagation_and_switching_of_light_in_rectangular_waveguiding_structures","names":["Anca L. Sala"],"references":{},"citedIn":{"243482675":"Analysis of crosstalk between single-mode rectangular optical waveguides","1980847":"Identification problems of muon and electron events in the Super-Kamiokande detector","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","252669418":"Chromatic dispersion in rectangular geometry waveguides","239758546":"Correlated two-electron momentum properties for helium to neon atoms","5528348":"Temporal Soliton Switching in a Rectangular Nonlinear Directional Coupler","234949128":"Correlated electron extracule densities in position and momentum spaces"},"index":891}