{"abs":"Models for the analysis of longitudinal data must recognize the relationship between serial observations on the same unit. Multivariate models with general covariance structure are often difficult to apply to highly unbalanced data, whereas two-stage random-effects models can be used easily. In two-stage models, the probability distributions for the response vectors of different individuals belong to a single family, but some random-effects parameters vary across individuals, with a distribution specified at the second stage. A general family of models is discussed, which includes both growth models and repeated-measures models as special cases. A unified approach to fitting these models, based on a combination of empirical Bayes and maximum likelihood estimation of model parameters and using the EM algorithm, is discussed. Two examples are taken from a current epidemiological study of the health effects of air pollution.","title":"Laird NM, Ware JHRandom-effects Models for Longitudinal Data. Biometrics 38:963-974","id":16029877,"url":"https://www.researchgate.net/publication/16029877_Laird_NM_Ware_JHRandom-effects_Models_for_Longitudinal_Data_Biometrics_38963-974","names":["Nan M. Laird","James H. Ware","Biometrics"],"references":{"272582975":"Missing Values in Experiments Analysed on Automatic Computers","243082367":"Marginal and Conditional Sufficiency","21980269":"Simultaneous Estimation of Parameters in Different Linear Models and Applications to Biometric Problems","222229946":"A generalization of the growth curve model which allows missing data","240119559":"Missing values in experiments analyzed on automatic computers","232510258":"Statistics for the Social Sciences","244958736":"A Missing Information Principle: Theory and Applications","246097735":"Estimation in Covariance Components Models","224840043":"Recovery of Inter-Block Information When Block Sizes are Unequal","215721461":"Maximum Likelihood From Incomplete Data Via The EM algorithm","243778376":"Bayesian Inference for Variance Components Using Only Error Contrasts","17392217":"Analysis of Growth and Dose Response Curves","238874413":"A Bayesian Approach to Growth Curve","242574660":"Least Square Theory Using an Estimated Dispersion Matrix and Its Application to Measurement of Signals","243082412":"Linear Regression with Randomly Dispersed Parameters","38358047":"Extension of the Gauss-Markov Theorem to Include the Estimation of Random Effects","17327120":"The Theory of Least Squares When the Parameters Are Stochastic and Its Application to the Analysis of Growth Curves","243713791":"Maximum Likelihood Approaches to Variance Component Estimation and to Related Problems: Rejoinder","243042561":"Computation of Variance Components Using the EM Algorithm"},"citedIn":{},"index":897}