{"abs":"Optimization of expensive computer models with the help of Gaussian process emulators in now commonplace. However, when several (competing) objectives are considered, choosing an appropriate sampling strategy remains an open question. We present here a new algorithm based on stepwise uncertainty reduction principles to address this issue. Optimization is seen as a sequential reduction of the volume of the excursion sets below the current best solutions, and our sampling strategy chooses the points that give the highest expected reduction. Closed-form formulae are provided to compute the sampling criterion, avoiding the use of cumbersome simulations. We test our method on numerical examples, showing that it provides an efficient trade-off between exploration and intensification.","title":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction","id":257299288,"url":"https://www.researchgate.net/publication/257299288_Multiobjective_optimization_using_Gaussian_process_emulators_via_stepwise_uncertainty_reduction","names":["Victor Picheny","Statistics and Computing"],"references":{"44842093":"DiceKriging , DiceOptim : Two R Packages for the Analysis of Computer Experiments by Kriging-Based Metamodeling and Optimization","222581573":"Bayesian emulation of complex multi-output and dynamic computer models","2215138":"Bayesian Treed Gaussian Process Models With an Application to Computer Modeling","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","4772045":"Bayesian Calibration of Computer Models","235709769":"Evaluating the quality of approximation to the non-dominated set","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","260278602":"Design and Modeling for Computer Experiments","5602970":"Dissecting apple tree architecture into genetic, ontogenetic and environmental effects: Mixed linear modelling of repeated spatial and temporal measures","221932969":"Statistics For Spatial Data","254331259":"Quantile-Based Optimization of Noisy Computer Experiments With Tunable Precision","2371187":"Genetic Optimization Using Derivatives","46587486":"Sequential design of computer experiments for the estimation of a\nprobability of failure","220133318":"The Correlated Knowledge Gradient for Simulation Optimization of Continuous Parameters using Gaussian Process Regression","228914365":"MAppleT: Simulation of apple tree development using mixed stochastic and biomechanical models","216300861":"A Taxonomy of Global Optimization Methods Based on Response Surfaces","3418862":"A faster algorithm for calculating hypervolume","220385854":"Multiscale Framework for Modeling and Analyzing Light Interception by Trees","258163201":"Fast calculation of multiobjective probability of improvement and expected improvement criteria for Pareto optimization","245426181":"Statistical Improvement Criteria for Use in Multiobjective Design Optimization","51969726":"Entropy Search for Information-Efficient Global Optimization","250920403":"Efficient Gaussian process regression for large datasets","216300483":"Multiobjective Optimization. Principles and Case Studies","237453504":"Review of Metamodeling Techniques in Support of Engineering Design Optimization","228438518":"Fast Parallel Kriging-Based Stepwise Uncertainty Reduction With Application to the Identification of an Excursion Set","261605115":"Influence of the variation of geometrical and topological traits on light interception efficiency of apple trees: Sensitivity analysis and metamodelling for ideotype definition","262369166":"KrigInv: An efficient and user-friendly implementation of batch-sequential inversion strategies based on Kriging","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","220702165":"Multiobjective Optimization on a Limited Budget of Evaluations Using Model-Assisted $\\mathcal{S}$ -Metric Selection","1960302":"An informational approach to the global optimization of expensive-to-evaluate functions","45913547":"Optimization Under Unknown Constraints","281602738":"Adaptive surrogate models for reliability analysis and reliability-based design optimization","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","4772151":"Bayesian inference for non-stationary spatial covariance structure via spatial deformations"},"citedIn":{"281985308":"A Bayesian subset simulation approach to constrained global optimization of expensive-to-evaluate black-box functions","264232948":"Anticipation in Multiple Criteria Decision-Making Under Uncertainty","264936662":"A new integral loss function for Bayesian optimization","282570552":"A Bayesian approach to constrained single- and multi-objective optimization"},"index":90}