{"abs":"We investigate self-diffusion in a classical fluid composed of two species which are distinguished through the color of their particles, either black or white, but are identical as regards their mechanical properties. Disregarding color the fluid is in thermal equilibrium. We show that if a single test particle in the one-component fluid moves asymptotically as Brownian motion, then the color density and current in certain classes of nonequilibrium states are related, on the appropriate macroscopic scale, through Fick\u0027s law, and the former is governed by the diffusion equation. If in addition several test particles move asymptotically as independent Brownian motions, then the colored fluid is, on a macroscopic scale, in local equilibrium with parameters governed by the solution of the diffusion equation.","title":"Microscopic basis for Fick\u0027s law of self-diffusion","id":226050635,"url":"https://www.researchgate.net/publication/226050635_Microscopic_basis_for_Fick\u0027s_law_of_self-diffusion","names":["Joel Lebowitz","Herbert Spohn","Journal of Statistical Physics"],"references":{"273575551":"Kinetic Theory of Classical Fluids","246864357":"Molecular Dynamics Techniques for Hard Core Systems","226487659":"Markov Partitions for dispersed billiards","234915732":"Brownian Motion in a Gas of Noninteracting Molecules","226268697":"Steady state self-diffusion at low density","38328462":"Time evolution of infinite classical systems with singular, long range, two body interactions","227095230":"Self-diffusion for particles with stochastic collisions in one dimension","226510648":"Time evolution of large classical systems","238903095":"Existence of time-evolution of v-dimensional statistical mechanics","245751790":"Computer studies on fluid systems of hard-core particles","243375182":"Joint diffusion on the line"},"citedIn":{"38351691":"A central limit theorem for reversible exclusion and zero-range particle systems","256703182":"Steady self-diffusion in classical gases","2856232":"The Direction of Time","264961996":"On rigorous Hydrodynamics, Self-diffusion and the Green-Kubo formulae","225639797":"The Direction of Time","1745682":"ThermoElectric Transport Properties of a Chain of Quantum Dots with Self-Consistent Reservoirs","226483255":"Microscopic derivation of a Markovian Master equation in a deterministic model of chemical reaction","239667521":"Scaling Dynamics of a Massive Piston in an Ideal Gas","226885004":"Self-Diffusion in Simple Models: Systems with Long-Range Jumps","1948500":"Hydrodynamic Limit of Brownian Particles Interacting with Short and Long Range Forces","222033008":"Microscopic origin of hydrodynamic equations: Derivation and consequences","229544956":"Diffusion of color in the simple exclusion process","11925479":"Coupled Normal Heat and Matter Transport in a Simple Model System","257690766":"Limit theorems for the position of a tagged particle in the stirring-exclusion process","258303728":"On Γ- And μ-space descriptions: Gibbs and Boltzmann entropies of symplectic coupled maps","233158911":"A test of the modified Enskog theory for self-diffusion","266548665":"PDE and materials. Abstracts from the workshop held September 24–30, 2006","225945196":"An invariance principle for reversible Markov processes. Applications to random motions in random environments.J Stat Phys","261700802":"Derivation of the Fick’s Law for the Lorentz Model in a Low Density Regime","266913268":"Diffusive Limit for the Random Lorentz Gas","272377500":"Asymptotic behavior of a tagged particle in the exclusion process on parallel lattices","227015973":"Exact solution of a deterministic model for isomerization kinetics","279347460":"Hydrodynamic Equation of Symmetric Simple Exclusion Processes","226346526":"Reaction-diffusion equations for interacting particle systems","231071841":"Energy transport and detailed verification of Fourier heat law in a chain of colliding harmonic oscillators","226268697":"Steady state self-diffusion at low density","1972791":"Classical Equations for Quantum Systems","236834612":"The Brownian motion as the limit of a deterministic system of hard-spheres","38329826":"Central limit theorem for additive functionals of reversible Markov processes and applications to simple exclusion, Commun. Math. Phys. 106, 1-19","225871772":"Stationary Boltzmann equation for a degenerate gas in a slab: Boundary value problem and hydrodynamics","226897965":"Heat conduction in caricature models of the Lorentz gas","1948461":"Perturbations of Noise: The Origins of Isothermal Flows","225641602":"Diffusions and random walks in random media","229011923":"Gaussian Convergence for Stochastic Acceleration of Particles in the Dense Spectrum Limit","227095230":"Self-diffusion for particles with stochastic collisions in one dimension","223618028":"Macroscopic Laws, Microscopic Dynamics, Time\u0027s Arrow and Boltzmann\u0027s Entropy","228013741":"On the time evolution of macroscopic systems","1838374":"Transport Properties of a Modified Lorentz Gas","282337134":"Scattering Processes and Transport Phenomena in Particle Systems","11315671":"Finite Thermal Conductivity in 1D Models Having Zero Lyapunov Exponents","223940642":"Initial growth of Boltzmann entropy and chaos in a large assembly of weakly interacting systems","1945377":"Diffusion laws, information and action principle","222520127":"On diffusivity of a tagged particle in asymmetric zero-range dynamics","1781094":"Diffusion Process in a Flow","2348189":"Diffusive Behavior Of Interacting Particle Systems.","2090849":"Fourier\u0027s Law for a Harmonic Crystal with Self-Consistent Stochastic Reservoirs"},"index":901}