{"abs":"Estimating rare event probability with accuracy is of great interest for safety and reliability applications. In this paper, we focus on rare events which can be modeled by a threshold exceedance of a deterministic input–output function with random inputs. Some parameters of this function or density parameters of input random variables may be fixed by an experimenter for simplicity reasons. From a risk analysis point of view, it is not only interesting to evaluate the probability of a critical event but it is also important to determine the impact of such tuning of parameters on the realization of a critical event, because a bad estimation of these parameters can strongly modify rare event probability estimations. In the present paper, we present an example of island particle algorithm referred to as sequential Monte Carlo square (SMC2). This algorithm gives an estimate of the law of random phenomena that leads to critical events. The principles of this statistical technique are described throughout this article and its results are analysed on different realistic aerospace test cases.","title":"An island particle algorithm for rare event analysis","id":284900779,"url":"https://www.researchgate.net/publication/284900779_An_island_particle_algorithm_for_rare_event_analysis","names":["Christelle Vergé","Jérôme Morio","Pierre Del Moral","Reliability Engineering [?] System Safety"],"references":{"274196694":"A duality formula for Feynman–Kac path particle models","227522317":"Particle Markov Chain Monte Carlo . . .","2469281":"Multilevel Splitting for Estimating Rare Event Probabilities","224049502":"Computational Approaches for Aerospace Design","3361206":"Novel Approach to Nonlinear/Non-Gaussian Bayesian State Estimation","268391801":"A Sharp First Order Analysis of Feynman-Kac Particle Models","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","242386046":"Estimation of Particle Transmission by Random Sampling","2449448":"Variance Reduction Techniques for Estimating Value-at-Risk","21374294":"Knowledge and Risk Perception Among Nuclear Power Plant Employees","222289965":"On Computation Methods for Structural Reliability Analysis","2453431":"A Sequential Particle Filter Method for Static Models","220674608":"Influence of input PDF parameters of a model on a failure probability estimation","220341819":"Computationally efficient black-box modeling for feasibility analysis","3772320":"RESTART: A straightforward method of fast simulation of rare event","220737205":"Implementation of Importance Splitting Techniques in Stochastic Petri Net Package","223858805":"Rackwitz, R.: A benchmark study on importance sampling techniques in structural reliability. Struct Safety 12, 255-76","235622440":"Monte Carlo Methods in Financial Engineering","236660920":"Methods of Structural Safety","264961263":"Sensitivity Analysis in Practice: A Guide to Assessing Scientific Models. Wiley, New York","37621654":"The Cross-Entropy Method: A Unified Approach to Combinatorial Optimization, Monte-Carlo Simulation and Machine Learning","233461312":"A Physically Based, Variable Contributing Area Model of Basin Hydrology / Un Modèle À Base Physique de Zone D\u0027appel Variable de L\u0027hydrologie Du Bassin Versant","220546446":"SampleSearch: Importance Sampling in presence of Determinism","226031060":"Sequential Monte Carlo for rare event estimation","220164786":"Experimental Design in Systems Biology, Based on Parameter Sensitivity Analysis Using a Monte Carlo Method: A Case Study for the TNF -Mediated NF- B Signal Transduction Pathway","222396913":"A new Cauchy-based black-box technique for uncertainty in risk analysis","222412529":"Efficient High-Dimensional Monte-Carlo Importance Sampling","200744518":"Sequential Monte-Carlo Methods in Practice","41035459":"The splitting method in rare event simulation","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","227694117":"Monte Carlo methods","238951685":"On parallel implementation of Sequential Monte Carlo methods: the island particle model","239582331":"Stochastic Relaxation, Gibbs Distributions and the Bayesian Resoration of Images","222448510":"Earthquake risk as a stochastic process","259572152":"Uniform Ergodicity of the Particle Gibbs Sampler","222305920":"A general procedure for first/second-order reliabilitymethod (FORM/SORM)","222834177":"Application of Subset Simulation Methods to Reliability Benchmark Problems","230663919":"Limiting Forms of the Frequency Distribution of the Largest or Smallest Member of a Sample","230872595":"Parameter Estimation in Engineering \u0026 Science","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","51915982":"On the Concentration Properties of Interacting Particle Processes","41222435":"Monte Carlo Statistical Method","266943935":"A survey of rare event simulation methods for static input-output models","29596955":"Genetic Genealogical Models in Rare Event Analysis","243104929":"A Two-Step branching splitting model under cost constraint for rare event analysis","221525992":"On the Efficiency of the Splitting and Roulette Approach for Sensitivity Analysis.","3020145":"A quick simulation method for excessive backlogs in network of queues","265815481":"An Introduction to Rare Event Simulation","224877317":"Equation of State Calculations by Fast Computing Machines","210222819":"Simulation and the Monte Carlo Method","23418114":"Robust Adaptive Importance Sampling for Normal Random Vectors","232405682":"Adaptive directional stratification for controlled estimation of the probability of a rare event","245079154":"Non-parametric adaptive importance sampling for the probability estimation of a launcher impact position","275722245":"Probability of failure sensitivity with respect to decision variables","231743804":"Rare event simulation","223053477":"Explicit output-feedback nonlinear predictive control based on black-box models","254287814":"Nonparametric Importance Sampling","222527794":"Identification of pre-sliding and sliding friction dynamics: Grey box and black-box models","31285161":"Sequence Alignment, Parameter Sensitivity, and the Phylogenetic Analysis of Molecular Data","48182441":"SMC2: An efficient algorithm for sequential analysis of state space models","38361151":"Extremal Theory for Stochastic Processes","226303365":"Efficient Simulation of Light-Tailed Sums: an Old-Folk Song Sung to a Faster New Tune...","265348266":"Applied Probability and Queues","233990793":"Feynman-Kac Formulae: Genealogical and Interacting Particle Systems With Applications","284675338":"Particle Markov chain Monte Carlo methods (with discussion)","4213821":"Limit theorems for the multilevel splitting algorithm in the simulation of rare events","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","275730449":"A Primer for the Monte Carlo Method.","228370915":"Some recent improvements to importance splitting","220313310":"A Class of Optimum Improtance Sampling Strategies."},"citedIn":{},"index":91}