{"abs":"I discuss algorithms for simulating many-fermion systems via global updatings of auxiliary fields followed by an accept-reject stage which eliminates finite-step-size errors. When the system size is larger than the correlation length, these procedures should require computer time growing only slightly faster than linearly with the system volume V. A corrected Langevin scheme should asymptotically display a V4/3 behavior, while the hybrid Monte Carlo scheme can behave as V5/4. I present some tests of the latter algorithm on a simple model of interacting electrons on a two-dimensional lattice.","title":"Global Monte Carlo algorithms for many-fermion systems","id":13330566,"url":"https://www.researchgate.net/publication/13330566_Global_Monte_Carlo_algorithms_for_many-fermion_systems","names":["Michael Creutz","Physical review D: Particles and fields"],"references":{"226684099":"The Green’s functions of quantised fields","13330569":"Tuning the hybrid Monte Carlo algorithm","13331273":"Testing an exact algorithm for simulation of fermionic QCD","13333352":"Langevin simulation of lattice field theories. Phys. Rev. D 32, 2736","200105001":"Equation of State by Fast Computing Machines","29512773":"A proposal for Monte Carlo simulations of fermionic systems","13257569":"Langevin Simulation Including Dynamical Quark Loops","13258657":"Simulations and Speculations on Gauge Theories with Many Fermions","222461641":"The theory of hybrid stochastic algorithms","13331109":"Species doubling and transfer matrices for fermionic fields","243471149":"Microcanonical Simulation of Fermionic Systems","13353656":"Two-dimensional Hubbard model: Numerical simulation study","13257853":"Hybrid Stochastic Differential Equations Applied to Quantum Chromodynamics","222729054":"Monte Carlo integration for lattice gauge theories with fermions. Phys. Lett. B 99, 333","13348759":"New algorithm for the numerical simulation of fermions","243682712":"Electron Correlations in Narrow Energy Bands. III. An Improved Solution"},"citedIn":{"222337609":"A comparison of numerical algorithms for dynamical fermions","226325619":"The Langevin Equation for Generalized Coordinates","231115734":"Simulating Strongly Correlated Electron Systems with Hybrid Monte Carlo","265687232":"Low Energy Continuum and Lattice Effective Field Theories","231027167":"Non-perturbative calculations in the Standard Model","1987330":"Polynomial Hybrid Monte Carlo algorithm for lattice QCD with an odd number of flavors","243352481":"Monte Carlo algorithms for QCD","259186003":"Testing and tuning symplectic integrators for Hybrid Monte Carlo algorithm in lattice QCD","1987898":"Direct simulations of small multi-fermion systems","227276719":"Implicit Solvent Electrostatics in Biomolecular Simulation","225608278":"Dynamical fermions","239667564":"Acceptances and autocorrelations in hybrid Monte Carlo","222449508":"Critique of practical methods for computer evaluation of the hadron spectrum","222488682":"Hubbard model with Lüscher fermions","226930862":"Biomolecular Sampling: Algorithms, Test Molecules, and Metrics","225291078":"MCMC using Hamiltonian dynamics","222622057":"Lattice QCD simulations beyond the quenched approximation","256600698":"Multi-grid Monte Carlo (II). Two-dimensional XY model","1923631":"Higher representations on the lattice: Numerical simulations, SU(2) with adjoint fermions","50401843":"Confinement, chiral symmetry, and the lattice","259853135":"Hybrid Monte Carlo with non-uniform step size","222507383":"New possibilities for QCD at finite density","13329150":"Higher-order discretizations and the Metropolis step","231023088":"Two Algorithms and Lattice U(1) Model","237778714":"Molecules, and Metrics","226709428":"Numerical Methods for Calculating the Potential of Mean Force","267481291":"New algorithms for macromolecular simulation. Selected papers based on the presentation at 4th international symposium, Leicester, UK, August 18–21, 2004","222524792":"Exploring the HMC trajectory-length dependence of autocorrelation times in lattice QCD","1914406":"Ground state energy at unitarity","268402882":"Separable Shadow Hybrid Monte Carlo Method","226634687":"Towards Fast and Reliable Quantum Chemical Modelling of Macromolecules","7173676":"Testing and tuning symplectic integrators for the hybrid Monte Carlo algorithm in lattice QCD.","13330569":"Tuning the hybrid Monte Carlo algorithm","226872514":"Approach to Thermal Equilibrium in Biomolecular Simulation","13288578":"Hybrid Monte Carlo method for Condensed-Matter Systems","220856162":"Improved Sampling for Biological Molecules Using Shadow Hybrid Monte Carlo","38440710":"Towards the Confirmation of QCD on the Lattice","223402525":"Status of lattice gauge theory calculations","223039493":"Systematic errors of Lüscher\u0027s fermion method and its extensions","34497630":"Improved sampling of configuration space of biomolecules using shadow hybrid Monte Carlo [electronic resource] /","234201253":"Physics Goals of the QCD Teraflop Project","253738060":"Dynamics of Langevin Simulations","222443797":"Study of the decoupling of heavy fermions in a Z2 scalar-fermion model","256625171":"Hybrid Monte Carlo simulation of four flavour QCD at finite temperature","38072344":"A separable shadow Hamiltonian hybrid Monte Carlo method","13277591":"Remarks on global Monte Carlo algorithms","1990720":"The Kramers equation simulation algorithm I. Operator analysis","51913798":"Large-N reduction in QCD with two adjoint Dirac fermions","238947169":"Simulating QCD with dynamical Wilson and staggered fermions","222475805":"Kramers equation algorithm for simulations of QCD with two flavors of Wilson fermions and gauge group SU (2 )","230991524":"Numerical simulations in particle physics","228547327":"New Hybrid Monte Carlo Methods for Efficient Sampling: from Physics to Biology and Statistics","222470694":"Multi-grid Monte Carlo (III). Two-dimensional O(4)-symmetric non-linear σ-model","227196642":"Modeling and Simulation Based Approaches for Investigating Allosteric Regulation in Enzymes","223194918":"Lattice gauge theories and Monte Carlo algorithms","243268115":"Breaking of chiral symmetry in compact QED in the strong coupling limit","45849301":"Mitigating the sign problem for non-relativistic fermions on the lattice","235558525":"Kramers equation simulation algorithm. II. Application to the Gross-Neveu model","225354000":"Lattice simulations for light nuclei: Chiral effective field theory at leading order","1990811":"Full QCD on APE100 Machines","226762755":"An investigation of the 2D attractive Hubbard model","13277506":"Multigrid Monte Carlo method. Conceptual foundations","13277507":"QCD with dynamical Wilson fermions","252099724":"Higher order hybrid Monte Carlo","234878579":"Grassmann algebra and fermions in the lattice: A simple example","222455245":"The acceptance probability in the hybrid Monte Carlo method. Phys. Lett. B 242, 437","29523027":"Dynamical critical properties of the Hybrid Monte Carlo algorithm","24014847":"Dynamical simulation of N\u003d1 supersymmetric Yang-Mills theory with domain wall fermions","223119833":"How to beat critical slowing-down: 1990 update","226502424":"Exploring the Connection Between Synthetic and Natural RNAs in Genomes: A Novel Computational Approach","259090409":"Hybrid nested sampling algorithm for Bayesian model selection applied to inverse subsurface flow problems","222202277":"The QCD finite temperature transition and hybrid Monte Carlo","222862548":"Hamiltonian evolution for the hybrid Monte Carlo algorithm","243352613":"Some recent results on lattice fermions","222481892":"Progress on lattice QCD algorithms","235505327":"Electronic correlations near a Peierls–charge-density-wave transition","222015900":"Introduction to algorithms for Monte Carlo simulations and their application to QCD","13328994":"Biased Monte Carlo algorithms on unitary groups","51956659":"The No-U-Turn Sampler: Adaptively Setting Path Lengths in Hamiltonian\nMonte Carlo","226719279":"Replica-Exchange-Based Free-Energy Methods","226826806":"Membrane Protein Simulations: Modelling a Complex Environment","23637712":"Hadron Spectroscopy with Dynamical Chirally Improved Fermions","29522811":"A generalized guided Monte Carlo algorithm","1988002":"Advanced Algorithms for the Simulation of Gauge Theories with Dynamical Fermionic Degrees of Freedom","13275252":"Comparison of exact hybrid and Langevin algorithms for QCD with Kogut-Susskind fermions","44642155":"Molecular packing and chemical association in liquid water simulated using ab initio hybrid Monte Carlo and different exchange-correlation functionals","1993949":"Choice of Integrator in the Hybrid Monte Carlo Algorithm","1993179":"Imaginary chemical potential and finite fermion density on the lattice","222497413":"Full QCD with the Lüscher local bosonic action","244179526":"Improved sampling of configuration space of biomolecules using shadow hybrid monte carlo","1993683":"Transfer Matrices and Lattice Fermions at Finite Density","226003370":"Overcoming Energetic and Time Scale Barriers Using the Potential Energy Surface","222443669":"Hybrid Monte Carlo algorithm as applied to dynamical Wilson fermion","40825273":"The finite temperature phase transition in four flavour QCD on an 8×12 3 lattice","222410394":"Lattice simulations for few- and many-body systems","237355257":"Ecological Sampling of Gaze Shifts","222474652":"Progress in Lattice Field Theory Algorithms","1990910":"Hybrid Monte Carlo Simulation of Polymer Chains","226800998":"Quantum Chemistry Simulations of Glycopeptide Antibiotics","225850001":"New Distributed Multipole Metdhods for Accurate Electrostatics in Large-Scale Biomolecular Simulations","2704064":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","1991410":"Hubbard Model with Luscher fermions","1988593":"Finite Temperature QCD with Domain Wall Fermions","257429416":"Finite Element Model Updating Using the Shadow Hybrid Monte Carlo Technique","243352437":"Looking for the effects of dynamical quarks","2156244":"Nuclear Lattice Simulations with Chiral Effective Field Theory","241199256":"SU(2) Higgs models with dynamical fermions at zero and finite temperature","222672316":"Shadow hybrid Monte Carlo: An efficient propagator in phase space of macromolecules. J. Comput. Phys. 200, 581-604","51912929":"Precision benchmark calculations for four particles at unitarity","1989604":"Chiral properties of dynamical Wilson fermions","1854182":"Superfluidity and excitations at unitarity","257076137":"Particle Metropolis Hastings using Langevin dynamics","13250356":"Higher-order hybrid Monte Carlo algorithms"},"index":910}