{"abs":"A general cluster updating algorithm for Monte Carlo simulations is presented. The method contains arbitrary probability functions which can be used to minimize the relaxation time. It is applicable to systems where the interaction energy has a global (discrete or continuous) symmetry. Special cases cover standard site-by-site updating as well as the cluster updating method proposed by Swendsen and Wang for Ising and Potts models.","title":"General Cluster Updating Method for Monte Carlo Simulations","id":13250886,"url":"https://www.researchgate.net/publication/13250886_General_Cluster_Updating_Method_for_Monte_Carlo_Simulations","names":["Ferenc Niedermayer","Physical Review Letters"],"references":{"13333352":"Langevin simulation of lattice field theories. Phys. Rev. D 32, 2736","223932187":"Stochastic quantization versus the microcanonical ensemble: Getting the best of both worlds","13251951":"Lattice field theory as a percolation process","200104872":"The Critical Properties of the Two-Dimensional XY Model","13256204":"Multigrid Monte Carlo Method for Lattice Field Theories","210269742":"Ordering, Metastability and Phase Transitions in Two-Dimensional Systems","243207576":"Testing accelerated stochastic algorithms in two dimensions The SU(3) × SU(3) spin model","243554380":"Critical Slowing Down in the Kinetic Ising Model","200105284":"Monte Carlo study of weighted percolation clusters relevant to the Potts model","222983936":"Kasteleyn P.W.: On the random cluster model I. Introduction and relation to other models. Physica D 57, 536-564","13254310":"Nonuniversal Critical Dynamics in Monte Carlo Simulation","243207411":"Accelerating hybrid stochastic algorithm for spin models","235446596":"Linear and nonlinear critical slowing down in the kinetic Ising model: High-temperature series","241365521":"Using Renormalization-Group Ideas in Monte Carlo Sampling","252315156":"Critical relaxation of the three-state Potts model","13251989":"Simulations without critical slowing down","253270343":"Application of the Real-Space Renormalization Group to Dynamic Critical Phenomena"},"citedIn":{"224709604":"Dynamical behavior of the Niedermayer algorithm applied to Potts models","6329825":"A New Monte Carlo Method and Its Implications for Generalized Cluster Algorithms","255953479":"Improving the efficiency of Monte Carlo simulations of systems that undergo temperature-driven phase transitions","258092266":"Embedded dynamics for 4 theory","13277506":"Multigrid Monte Carlo method. Conceptual foundations","231113166":"The ground state of the ±J spin glass from a heuristic matching algorithm","13244486":"Application of cluster algorithms to spin glasses","1990419":"Embedding Z(3) in SU(3)","46775623":"Critical clusters and efficient dynamics for frustrated spin models","232718541":"Bond Disorder Induced Criticality of the Three-Color Ashkin-Teller Model","243352853":"The exact mass gap in D\u003d2 asymptotically free field theories and related experimental results","223119833":"How to beat critical slowing-down: 1990 update","1992459":"Cluster algorithms","10842803":"Neuron recognition by parallel Potts segmentation","232718409":"Proposal of a Checking Parameter in the Simulated Annealing Method\nApplied to the Spin Glass Model","13298387":"Simulations without critical slowing down: Ising and three-state Potts models","13250154":"Collective Monte Carlo Updating for Spin Systems","45900573":"Extending canonical Monte Carlo methods II","13247080":"Cluster dynamics for fully frustrated systems","266945226":"Collective translational and rotational Monte Carlo cluster move for general pairwise interaction","13293167":"Three-state antiferromagnetic Potts models: A Monte Carlo study","45900570":"Extending canonical Monte Carlo methods","2759693":"Monte Carlo Methods in Statistical Mechanics: Foundations and New Algorithms","223079009":"Numerical simulation of the O(4)-symmetric φ4-model in the symmetric phase","39393139":"Optimized multicanonical simulations: A proposal based on classical fluctuation theory","222268436":"Critical slowing down","261732402":"Collective translational and rotational Monte Carlo moves for attractive particles","270595723":"Efficient energy cumulants for the Baxter–Wu model","222114832":"Acceleration methods for Monte Carlo computer simulations","222151698":"Cluster formulation for frustrated spin models","256600698":"Multi-grid Monte Carlo (II). Two-dimensional XY model","265327201":"Advanced Markov Chain Monte Carlo Methods: Learning from Past Samples","13287678":"Wolff algorithm and anisotropic continuous-spin models: An application to the spin–van der Waals model","243208009":"Multigrid Monte Carlo for a bose field in an external gauge field","231402365":"Electrostatic analogy for surfactant assemblies","13277426":"Dynamic critical behavior of Wolff\u0027s collective-mode Monte Carlo algorithm for the two-dimensional O(n) nonlinear model","252559541":"Acceleration Algorithms in Monte Carlo Simulations in Statistical Physics","13249139":"Nature of the prewetting critical point","243764029":"New monte carlo methods for improved efficiency of computer simulations in statistical mechanics","259303118":"Cluster Monte Carlo Algorithms for Diluted Spin Glasses","13282673":"Microcanonical renormalization-group simulation of Ising systems","13249526":"Embedded dynamics for phi4 theory.","13386224":"Monte Carlo study of induced bond orientational ordering in two-dimensional liquid-crystal models","226609853":"Simulation of condensed phases using the Distributed Array Processor","5639146":"Schoen, M. Fluid bridges confined between chemically nanopatterned solid substrates. Phys. Chem. Chem. Phys. 10, 223-256","222476675":"Accelerated Monte Carlo by embedded cluster dynamics","234109879":"Swendsen-Wang dynamics for Potts model on a dynamically triangulated random surface.","251588922":"Scaling properties of the Baxter–Wu model","239623823":"Improving the improved estimator in O(N) spin models","243357126":"Mean field critical behaviour for the frustrated percolation model","230823562":"Critical behavior of the three-dimensional bond-diluted Ising spin glass: Finite-size scaling functions and universality","13312002":"Generalized cluster algorithms for frustrated spin models","235600707":"Mixed cluster Monte Carlo algorithms for the Blume-Emery-Griffiths model","222503561":"Nonlocal Monte Carlo algorithms for statistical physics applications","13271814":"Swendsen-Wang update algorithm for the Symanzik improved σ model","222142577":"An updating scheme for the loop-cluster algorithm for the anisotropic Heisenberg antiferromagnet","222909318":"Mass gap, scaling and universality in the d \u003d 2 O(3) σ-model","222585611":"Cluster Monte Carlo Algorithms","234201253":"Physics Goals of the QCD Teraflop Project","260011055":"Critical energy distribution function of the Baxter–Wu model","262995836":"The effect of quenched bond disorder on first-order phase transitions","222604949":"The critical 2D Ising model in a magnetic field. A Monte Carlo study using a Swendesen-Wang algorithm","229316088":"Cluster algorithms for the generalized 3d, 3q Potts model","13234972":"Accelerating diffusive nonequilibrium processes in discrete spin systems","220104520":"Parallel Computing Comes of Age: Supercomputer Level Parallel Computations at Caltech.","243268133":"Goldstone boson mass generated non-perturbatively by finite temperature in d\u003d2+1","13248913":"Cluster algorithms in the O(4) φ 4 theory in four dimensions","223806987":"Frustration, connectivity, and the glass transition","45907042":"Numerical simulation study of the dynamical behavior of the Niedermayer algorithm","222748953":"Finite-size effects, goldstone bosons and critical exponents in the d \u003d 3 Heisenberg model","13293739":"Percolation properties of the Wolff clusters in planar triangular spin models","1867518":"Percolation and cluster Monte Carlo dynamics for spin models","231678506":"Aggregation Behavior of a Lattice Model for Amphiphiles","257235888":"Unexpected results in asymptotically free quantum field theories","1853306":"Continuous phase transition of a fully frustrated XY model in three dimensions","13314860":"Cluster Monte Carlo dynamics for the antiferromagnetic Ising model on a triangular lattice","222440747":"Perfect lattice action for asymptotically free theories","224515338":"Monte Carlo simulations of CsMnBr3","222861347":"A new cluster algorithm for the Baxter–Wu model","231147307":"Mapping of frustrated spin systems into percolation models and Monte Carlo cluster dynamics","221665626":"An ideal toy model for confining, walking and conformal gauge theories: the O(3) sigma model with ϑ-term","243208082":"The spectrum and potential in lattice CPN","243356274":"Clusters in the three-dimensional Ising model with a magnetic field","6644502":"Optimized multicanonical simulations: a proposal based on classical fluctuation theory.","12238543":"Cluster update algorithm and recognition","13383348":"Coherent-incoherent transition and relaxation in condensed-phase tunneling systems","226909053":"Single-cluster Monte Carlo dynamics for the Ising model","7387148":"Fast Flat-Histogram Method for Generalized Spin Models","222087361":"Swendsen-Wang Monte Carlo study of the Ising model with external field","13291956":"General cluster Monte Carlo dynamics","222464317":"Virtual Bond Percolation for Ising Cluster Dynamics","280383817":"Advances in Chemical Physics: Monte Carlo Methods in Chemical Physics, Volume 105"},"index":914}