{"abs":"For structural systems with both epistemic and aleatory uncertainties, the effect of epistemic uncertainty on failure probability is measured by the variance based sensitivity analysis, which generally needs a “triple-loop” crude sampling procedure to solve and is time consuming. Thus, the Kriging method is employed to avoid the complex sampling procedure and improve the computational efficiency. By utilizing the Kriging predictor model, the conditional expectation of failure probability on the given epistemic uncertainty can be calculated efficiently. Compared with the Sobol’s method, the proposed one can ensure reasonable accuracy of results but with lower computational cost. Three examples are employed to demonstrate the reasonability and efficiency of the proposed method.","title":"An application of the Kriging method in global sensitivity analysis with parameter uncertainty","id":257162246,"url":"https://www.researchgate.net/publication/257162246_An_application_of_the_Kriging_method_in_global_sensitivity_analysis_with_parameter_uncertainty","names":["Pan Wang","Zhenzhou Lu","Zhangchun Tang","Applied Mathematical Modelling"],"references":{"239373191":"Application of low-discrepancy sampling method in structural reliability analysis","229702964":"A Robust Measure of Uncertainty Importance for Use in Fault Tree System Analysis","216549487":"Local and Global Sensitivity Analysis for a Reactor Design with Parameter Uncertainty","223204998":"An uncertainty importance measure using a distance metric for the change in a cumulative distribution function","6740457":"Measuring Uncertainty Importance: Investigation and Comparison of Alternative Approaches","220674608":"Influence of input PDF parameters of a model on a failure probability estimation","257101641":"Efficient structural reliability methods considering incomplete knowledge of random variable distributions","245078917":"Importance Measures in Global Sensitivity Analysis of Nonlinear Models","233783664":"Emulation of a complex global aerosol model to quantify sensitivity to uncertain parameters","245079099":"An approximate sensitivity analysis of results from complex computer models in the presence of epistemic and aleatory uncertainties","250754768":"9 Computer experiments","257006962":"AK-MCS: An active learning reliability method combining Kriging and Monte Carlo Simulation","11287754":"Sensitivity Analysis for Importance Assessment,\u0027\u0027","216756493":"Survey of Sampling-Based Methods for Uncertainty and Sensitivity Analysis","269567671":"Global Sensitivity Analysis Using Moving Least Squares for Models with Correlated Parameters","222535147":"Global sensitivity indices for nonlinear mathematical models and their Monte Carlo estimates. Math Comput Sim 55(1-3):271-280","223212772":"Structural optimization using Kriging approximation","222402096":"Making best use of model evaluations to compute sensitivity indices. Comput Phys Commun","229323418":"An efficient computational method for global sensitivity analysis and its application to tree growth modelling","223449312":"An approximate epistemic uncertainty analysis approach in the presence of epistemic and aleatory uncertainties","220257174":"Variance based sensitivity analysis of model output. Design and estimator for the total sensitivity index. Comput Phys Commun","256688564":"Efficient sampling methods for global reliability sensitivity analysis","216301661":"Screening, Predicting, and Computer Experiments","222239745":"Precision design of roll-forging die and its application in the forming of automobile front axles","223906278":"Application of Kriging method to structural reliability"},"citedIn":{"276091188":"An efficient Kriging method for global sensitivity of structural reliability analysis with non-probabilistic convex model","276174308":"Emulator Model–Based Analytical Solution for Reliability Sensitivity Analysis","276512488":"Application of Rejection Sampling based methodology to variance based parametric sensitivity analysis","262110154":"A novel method for importance measure analysis in the presence of epistemic and aleatory uncertainties","270987507":"Efficient structural reliability analysis method based on advanced Kriging model","277649465":"Global sensitivity analysis for model with random inputs characterized by probability-box","262985034":"Extended Monte Carlo Simulation for Parametric Global Sensitivity Analysis and Optimization","282490752":"An efficient numerical simulation method for the evaluation of global sensitivity analysis with parameter uncertainty","279211885":"An active learning Kriging model for hybrid reliability analysis with both random and interval variables","282204060":"Efficient numerical simulation method for evaluations of global sensitivity analysis with parameter uncertainty","261102463":"Sobol′ sensitivity analysis of NAPL-contaminated aquifer remediation process based on multiple surrogates"},"index":920}