{"abs":"The mechanistic-empirical pavement design guide (MEPDG) includes a software tool to perform the large number of calculations involved in the design of pavement structures. Large number of input parameters from traffic, materials, and climate are required to use MEPDG. Data collection to accomplish calibration and implementation of MEPDG may be done more efficiently focusing on the most sensitive parameters. This research studies the sensitivity of MEPDG to traffic input parameters on two flexible pavements using the techniques for sensitivity of complex computer codes with Latin hypercube sampling, rank transformation, standardised regression coefficients, and Gaussian stochastic models. The results showed that roughness, rutting, and bottom-up cracking as predicted by MEPDG are sensitive to variations of two-way average annual daily traffic (AADT), traffic growth, dual tyre spacing, percent trucks in the design direction, percent of heavy vehicles, traffic wander, and percent of trucks in design lane. Variations of operational speed, average axle width, and mean wheel location showed no significant effects on the same MEPDG outputs. The results of the sensitivity were used to define recommended hierarchical levels for traffic input.","title":"Sensitivity of the mechanistic-empirical pavement design guide to traffic inputs: A space-filling approach","id":271622394,"url":"https://www.researchgate.net/publication/271622394_Sensitivity_of_the_mechanistic-empirical_pavement_design_guide_to_traffic_inputs_A_space-filling_approach","names":["Armando Orobio","John P. Zaniewski","Road Materials and Pavement Design"],"references":{"216301381":"The Design and Analysis Computer Experiments","284536374":"Design and Analysis of Experiments.","245563398":"Sensitivity of Axle Load Spectra in the Mechanistic-Empirical Pavement Design Guide for Washington State","245561674":"Estimating the Sensitivity of Design Input Variables for Rigid Pavement Analysis with a Mechanistic-Empirical Design Guide","233167852":"Effect of M-E Design Guide Inputs on Flexible Pavement Performance Predictions","200656985":"Design and Analysis of Experiments (2nd Ed)","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","245561871":"Effect of Load Spectra on Mechanistic-Empirical Flexible Pavement Design","243779016":"The Use of Rank Transform in Regression","238047009":"Impact of Traffic Data on the Pavement Distress Predictions using the Mechanistic Empirical Pavement Design Guide","245561975":"Sensitivity of NCHRP 1-37A pavement design to traffic input","269529544":"Sampling-Based Sensitivity Analysis of the Mechanistic-Empirical Pavement Design Guide Applied to Material Inputs","245306470":"Sensitivity analysis of computer models: World Bank HDM-III model","216301661":"Screening, Predicting, and Computer Experiments","271754859":"Probabilistic Numerical Simulation of Pavement Performance using MEPDG","245562008":"Part 2: Flexible Pavements: Pilot Study in Sampling-Based Sensitivity Analysis of NCHRP Design Guide for Flexible Pavements","16114350":"Sensitivity Analysis of a Model for the Environmental Movement of Radionuclides"},"citedIn":{"284196243":"Sensitivity of flexible pavement design to Michigan’s climatic inputs using pavement ME design","273403747":"Variability characterisation of input parameters in pavement performance evaluation"},"index":923}