{"abs":"We study convergence properties of pseudo-marginal Markov chain Monte Carlo algorithms [Andrieu and Roberts, Ann. Statist. 37 (2009) 697--725]. We find that the asymptotic variance of the pseudo-marginal algorithm is always at least as large as that of the marginal algorithm. We show that if the marginal chain is geometrically ergodic and the weights (normalised estimates of the target density) are uniformly bounded, then the pseudo-marginal chain is geometric. We consider also unbounded weight distributions and recover polynomial convergence rates in more specific cases, when the marginal algorithm is uniformly ergodic, an independent Metropolis-Hastings or a random-walk Metropolis targeting a super-exponential density with regular contours. Our results on geometric and polynomial convergence rates imply central limit theorems. We also prove that under general conditions, the asymptotic variance of the pseudo-marginal algorithm converges to the asymptotic variance of the marginal algorithm if the accuracy of the estimators is increased.","title":"Convergence properties of pseudo-marginal Markov chain Monte Carloalgorithms","id":231609430,"url":"https://www.researchgate.net/publication/231609430_Convergence_properties_of_pseudo-marginal_Markov_chain_Monte_Carloalgorithms","names":["Christophe Andrieu","Matti Vihola","The Annals of Applied Probability"],"references":{"263156975":"Annealed Importance Sampling Reversible Jump MCMC Algorithms","227522317":"Particle Markov Chain Monte Carlo . . .","279693864":"Geometric ergodicity and hybrid Markov chains","38384771":"Computable convergence rates for sub-geometric ergodic Markov chains","243037046":"The Spectrum of the Independent Metropolis–Hastings Algorithm","232697237":"Variance bounding and geometric ergodicity of Markov chain Monte Carlo for approximate Bayesian computation","4772293":"Exact and computationally efficient likelihood-based estimation for discretely observed diffusion processes","2118639":"Baxendale, P.H.: Renewal theory and computable convergence rates for geometrically ergodic Markov chains. Ann. Appl. Probab. 15(1B), 700-738","225989992":"Nonlocal Monte Carlo algorithm for self-avoiding walks with fixed endpoints","51912840":"Nonasymptotic bounds on the estimation error of MCMC algorithms","2269174":"A Note on Metropolis-Hastings Kernels for General State Spaces","31403274":"Monte Carlo Sampling Methods Using Markov Chains and Their Application","31081996":"Optimum Monte-Carlo Sampling Using Markov Chains","1737229":"On the Ergodicity of the Adaptive Metropolis Algorithm on Unbounded Domains","24168169":"The pseudo-marginal approach for effcient Monte Carlo computations","2113722":"Practical Drift Conditions for Subgeometric Rates of Convergence","38339733":"Polynomial Convergence Rates of Markov Chains","227707404":"MC\u0027s for MCMC\u0027ists","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","227425005":"Geometric ergodicity of Metropolis algorithms","2349384":"Geometric Convergence and Central Limit Theorems for Multidimensional Hastings and Metropolis Algorithms","225081349":"Coupled MCMC with a randomized acceptance probability","51957673":"Markovian stochastic approximation with expanding projections","1737000":"Variance bounding Markov chains","2842974":"Geometric Ergodicity and Hybrid Markov Chains","10652634":"Beaumont MA. Estimation of population growth or decline in genetically monitored populations. Genetics 164: 1139-1160"},"citedIn":{"259572152":"Uniform Ergodicity of the Particle Gibbs Sampler","264160764":"Perfect simulation using atomic regeneration with application to Sequential Monte Carlo","275055334":"A note on one of the Markov chain Monte Carlo novice\u0027s questions","256376004":"Quantitative convergence rates for sub-geometric Markov chains","258818603":"Approximate Inference for Observation Driven Time Series Models with Intractable Likelihoods","276923083":"Sequential Bayesian inference for implicit hidden Markov models and current limitations","291353622":"Bayesian model comparison with un-normalised likelihoods","232697237":"Variance bounding and geometric ergodicity of Markov chain Monte Carlo for approximate Bayesian computation","232062873":"Efficient implementation of Markov chain Monte Carlo when using an unbiased likelihood estimator","236124482":"On the particle Gibbs sampler","273158042":"Convergence of Sequential Monte Carlo-based Sampling Methods","284218797":"The iterated auxiliary particle filter","261065488":"Noisy Monte Carlo: Convergence of Markov chains with approximate transition kernels","257028465":"On non-negative unbiased estimators","274094454":"Stability of Noisy Metropolis-Hastings","277967859":"On particle Gibbs sampling","261952439":"Establishing some order amongst exact approximations of MCMCs","261369087":"Conditional convex orders and measurable martingale couplings","257142847":"On the efficiency of pseudo-marginal random walk Metropolis algorithms","259441094":"Uniform Ergodicity of the Iterated Conditional SMC and Geometric Ergodicity of Particle Gibbs samplers","277335223":"Particle ancestor sampling for near-degenerate or intractable state transition models","284096861":"The Correlated Pseudo-Marginal Method","258818974":"The Alive Particle Filter","283273878":"Tractable Bayesian teaching","279062934":"Bayesian computation: a summary of the current state, and samples backwards and forwards","249316198":"Partial Ordering of Inhomogeneous Markov Chains with Applications to Markov Chain Monte Carlo Methods","271855369":"Bayesian computation: a perspective on the current state, and sampling backwards and forwards","263018832":"Conditional convex orders and measurable martingale couplings","274730206":"The Metropolis—Hastings Algorithm"},"index":929}