{"abs":"This paper addresses the issue of estimating the expectation of a real-valued random variable of the form $X \u003d g(\\mathbf{U})$ where $g$ is a deterministic function and $\\mathbf{U}$ can be a random finite- or infinite-dimensional vector. Using recent results on rare event simulation, we propose a unified framework for dealing with both probability and mean estimation for such random variables, \\ie linking algorithms such as Tootsie Pop Algorithm (TPA) or Last Particle Algorithm with nested sampling. Especially, it extends nested sampling as follows: first the random variable $X$ does not need to be bounded any more: it gives the principle of an ideal estimator with an infinite number of terms that is unbiased and always better than a classical Monte Carlo estimator -- in particular it has a finite variance as soon as there exists $k \\in \\mathbb{R} \u003e 1$ such that $E[X^k] \u003c \\infty$. Moreover we address the issue of nested sampling termination and show that a random truncation of the sum can preserve unbiasedness while increasing the variance only by a factor up to 2 compared to the ideal case. We also build an unbiased estimator with fixed computational budget which supports a Central Limit Theorem and discuss parallel implementation of nested sampling, which can dramatically reduce its computational cost. Finally we extensively study the case where $X$ is heavy-tailed.","title":"Point Process-based Monte Carlo Estimation","id":269876959,"url":"https://www.researchgate.net/publication/269876959_Point_Process-based_Monte_Carlo_Estimation","names":["Clément Walter","Statistics and Computing"],"references":{"283028954":"Unbiased Estimation with Square Root Convergence for SDE Models","264854211":"Combinatorial analysis of the adaptive last particle method","29601545":"Rare event simulation for a static distribution","245199761":"Adaptive Multilevel Splitting for Rare Event Analysis","242386046":"Estimation of Particle Transmission by Random Sampling","264995908":"Modeling Extremal Events: For Insurance and Finance","51965640":"Random construction of interpolating sets for high dimensional\nintegration","227446046":"Importance Sampling for Stochastic Simulations","262983676":"Moving Particles: a parallel optimal Multilevel Splitting method with application in quantiles estimation and meta-model based algorithms","45889711":"Diffusive Nested Sampling","226111854":"On the Lambert W Function","228983550":"Discussion of nested sampling for Bayesian computations by John Skilling","225348983":"Simulation and Estimation of Extreme Quantiles and Extreme Probabilities","2355513":"The Asymptotic Efficiency of Simulation Estimators. Op. Res. 40:505-520","220244349":"Multilevel Monte Carlo Path Simulation","225194098":"Estimating the Mean of Heavy-Tailed Distributions","228364221":"Skilling, J.: Nested sampling for general Bayesian computation. Bayesian Anal. 1(4), 833-860","1753790":"A Nested Sampling Algorithm for Cosmological Model Selection","227464427":"Properties of nested sampling","268209561":"M Carlo Statistical Methods","280901401":"Exact sampling with coupled Markov chains and applications to statistical mechanics","43170613":"Estimating the Conditional Tail Expectation in the Case of Heavy-Tailed Losses","46461987":"A general method for debiasing a Monte Carlo","265572862":"An overview and open research topics in statistics of univariate extremes","226031060":"Sequential Monte Carlo for rare event estimation","48202223":"On statistical uncertainty in nested sampling","41035459":"The splitting method in rare event simulation","260367478":"Superposition Enhanced Nested Sampling","267221919":"Using TPA for Bayesian inference","222546544":"Estimation of Small Failure Probabilities in High Dimensions by Subset Simulation","23634257":"Estimating the mean of a heavy tailed distribution","238951685":"On parallel implementation of Sequential Monte Carlo methods: the island particle model","256061887":"Robust Estimation for Average Treatment Effects","220286431":"Efficient Monte Carlo simulation via the generalized splitting method","220345500":"Exact sampling with couple Markov chains and applications to statistical mechanics"},"citedIn":{},"index":93}