{"abs":"A strategy for using Genetic Algorithms (GAs) to solve NP-complete problems is presented. The key aspect of the approach taken is to exploit the observation that, although all NP-complete problems are equally difficult in a general computational sense, some have much better GA representations than others, leading to much more successful use of GAs on some NP-complete problems than on others. Since any NP-complete problem can be mapped into any other one in polynomial time, the strategy described here consists of identifying a canonical NP-complete problem on which GAs work well, and solving other NP-complete problems indirectly by mapping them onto the canonical problem. Initial empirical results are presented which support the claim that the Boolean Satisfiability Problem (SAT) is a GAeffective canonical problem, and that other NPcomplete problems with poor GA representations can be solved efficiently by mapping them first onto SAT problems. 1. Introduction One approach to discussin...","title":"Using Genetic Algorithms to Solve NP-Complete Problems","id":2718690,"url":"https://www.researchgate.net/publication/2718690_Using_Genetic_Algorithms_to_Solve_NP-Complete_Problems","names":["Kenneth A. De","Jong William","William Spears"],"references":{"220885711":"Job Shop Scheduling with Genetic Algorithms.","216545901":"Genetic Algorithms in Search, Optimization, and Machine Learning. Menlo Park, CA: Addison-Wesley","242575582":"GENESIS: A system for using genetic search procedures","243665386":"Genetic Algorithms in Searching","35578608":"An Analysis of the Behavior of a Class of Genetic Adaptive Systems","228057735":"Computers and Intractability: A Guide to NP-Completeness","201976377":"Bin Packing with Adaptive Search","201976411":"A Study of Permutation Crossover Operators on the Traveling Salesman Problem","220426448":"A Method for Obtaining Digital Signatures and Public-Key Cryptosystems. Commun ACM","242356870":"Adaptation In Natural And Artificial Systems","2423730":"Genetic Algorithms and the Traveling Salesman Problem","220885628":"Reducing Bias and Inefficienry in the Selection Algorithm.","220045412":"Adoption in Natural and Artificial System","201976370":"Alleles, Loci, and the Traveling Saleman Problem","201976372":"Genetic Algorithms: A 10 Year Perspective","243779034":"Adaptation in Natural and Arti cial Systems"},"citedIn":{"220606244":"Systematic versus Local Search and GA Techniques for Incremental SAT.","267998714":"Multi-Objectivization in Genetic Algorithms","3786812":"Combining cellular genetic algorithms and local search for solving satisfiability problems","221438773":"Improved Multiprocessor Task Scheduling Using Genetic Algorithms.","2253354":"A Genetic Algorithm To Solve The Timetable Problem","2567727":"The Fitness Function And Its Impact On Local Search Methods","30531032":"Quantum Genetic Optimization","3418657":"Parallel hybrid method for SAT that couples genetic algorithms and local search","2443824":"A NN Algorithm for Boolean Satisfiability Problems","248540871":"Abstract heuristic search methods for graph partitioning","256707924":"Function-Described Graphs for Structural Pattern Recognition","3652140":"A NN algorithm for Boolean satisfiability problems","226846105":"The Design and Implementation of a Framework for Automatic Modularization of Software Systems","6680184":"Connectivity independent protein-structure alignment: A hierarchical approach","2763275":"Toward More Powerful Recombinations","256597359":"Optimal clustering of power networks using genetic algorithms","2532354":"A Synthesizable VHDL Coding of a Genetic Algorithm","220701954":"Improving the Performance of Evolutionary Algorithms for the Satisfiability Problem by Refining Functions.","224301947":"A novel genetic algorithm for the Layout Optimization Problem","224666947":"Utilizing Genetic Algorithms for the Optimal Design of Electromagnetic Devices","220249865":"The Turkish Army Uses Simulation to Model and Optimize Its Fuel-Supply System","221356317":"Efficient Attributed Graph Matching and Its Application to Image Analysis.","227209127":"Design of laminate composite layups using genetic algorithms","259654484":"Fine Grained Tournament Selection for the Simple Plant Location Problem","4867172":"Performance characteristics of alternative genetic algorithmic approaches to the traveling salesman problem using path representation: An empirical study","3756041":"Intelligent control based on genetic algorithms-case study on mobile robot","6082671":"THE UNIVERSITY AND THE WAR.","2384402":"Detecting Multiple Outliers in Regression Data Using Genetic Algorithms","228975005":"An E cient Approach Integrating Genetic Algorithm, Linear Programming, and Ordinal Optimization for Linear Mixed Integer Programming Problems","222484351":"Design and Natural Science Research on Information Technology","227116980":"Heuristic Methods for Evolutionary Computation Techniques","220599576":"Median graphs: A genetic approach based on new theoretical properties","261647271":"A genetic algorithm-based approach to cell composition and layout design problems","2804331":"Solving the Satisfiability Problem by a Parallel Cellular Genetic Algorithm","221300594":"On the Allocation of Documents in Multiprocessor Information Retrieval Systems.","3296880":"Efficient subgraph isomorphism detection: a decomposition approach. IEEE Trans Knowl Data Eng","234786749":"Teaching students to use genetic algorithms to solve optimization problems","220316514":"AST Pre-Processing For The Sliding Window Method Using Genetic Algorithms.","221231467":"Learning Based Approach for Optimal Clustering of Distributed Program\u0027s Call Flow Graph","2321509":"A New Population-Based Method for Satisfiability Problems","3317881":"Genetic algorithm approach to fixed-order mixed HI/HVQ optimal deconvolution filter designs","267802042":"Nature-Inspired Search Techniques for Combinatorial Optimization Problems (Ph.D. Thesis)","220686698":"Efficient and secure cryptographic systems based on addition chains: Hardware design vs. software/hardware co-design","30865819":"Otimização de modelo de fadiga multiaxial por meio de algoritmo genético","236259928":"Solving a Public Sector Sustainable Supply Chain Problem: A Genetic Algorithm Approach","234816945":"Natural selection and mating constraints with genetic algorithms","228557777":"Fine grained tournament selection for the simple plant location problem","220180305":"Cross-pollinating parallel genetic algorithms for multiobjective search and optimization","220866939":"Encoding Graphs for Genetic Algorithms: An Investigation Using the Minimum Spanning Tree Problem.","3560034":"Efficient graph based representation of multi-valued functions with an application to genetic algorithms","225173310":"Improving the Performance of a Genetic Algorithm Using a Variable-Reordering Algorithm","228854771":"A Performance Comparison of Five Algorithms for Graph Isomorphism","263598060":"A Real-World Scheduling Problem Using Genetic Algorithms","2241602":"Applying Genetic Algorithms to the State Assignment Problem: A case Study","220382016":"Modelling of job-shop scheduling with multiple quantitative and qualitative objectives and a GA/TS mixture approach","283072189":"The CutMAG as a new hybrid method for multi-edge grinder design optimisation","228965827":"A Novel Reconfigurable Processor for Multi way Circuit partitioning Using Genetic Algorithm","233722760":"On Handling Ephemeral Resource Constraints in Evolutionary Search","260945893":"Flexible Job Shop Scheduling with Sequence-dependent Setup and Transportation Times by Ant Colony with Reinforced Pheromone Relationships","3418717":"Genetic-fuzzy approach to the Boolean satisfiability problem","3505756":"Discovery of maximal distance codes using genetic algorithms","220999495":"Manipulating Subpopulations of Feasible and Infeasible Solutions in Genetic Algorithms.","242406943":"Genetic algorithms for automated test assembly","2356301":"Solving The Uncapacitated Warehouse Location Problem By SGA With Add-Heuristic","266031541":"A memetic hybrid method for the Molecular Distance Geometry Problem with incomplete information","2772058":"On Decentralizing Selection Algorithms","229665216":"A Genetic Algorithm for Channel Assignment Problems","220886872":"Pattern-Based Data Compression","2448470":"The Search for Satisfaction","234793866":"Solving combinatorial optimization problems using parallel simulated annealing and parallel genetic algorithms","2836063":"Evolutionary Algorithms for the Satisfiability","8904946":"Step-by-Step Calculation of All Maximum Common Substructures Through a Constraint Satisfaction Based Algorithm.","221050708":"Automatic Realization of SOA Deployment Patterns in Distributed Environments","3512398":"HYPERGEN-a distributed genetic algorithm on a hypercube","2529371":"In Proc. of the 1995 ACM/SIGDA Third Int. Symposium on Field-Programmable Gate Arrays, pp. 53--59 53 HGA: A Hardware-Based Genetic Algorithm","228848093":"A comparison of a genetic algorithm and a depth first search algorithm applied to Japanese nonograms","4367420":"An Extended Library of Hardware Modules for Genetic Algorithms, with Applications to DNA Sequence Matching","228943653":"Simulating gender separation and mating constraints for genetic algorithms","2375333":"Parallel Genetic Algorithms Based on Coevolution","2618532":"CBR Assisted Explanation of GA Results","3929784":"Genetic algorithm restricted by Tabu Lists in Data Mining","4114618":"Analysing the effects of Combining Fitness Scaling and Inversion in Genetic Algorithms","2372769":"Genetic Programming Operators Applied to Genetic Algorithms","3224248":"GRCA: A hybrid genetic algorithm for circuit ratio-cut partitioning","221024167":"Representations, Fitness Functions and Genetic Operators for the Satisfiability Problem.","225181664":"Finding Worst-Case Instances of, and Lower Bounds for, Online Algorithms Using Genetic Algorithms","2295983":"A Hardware Engine for Genetic Algorithms","34529411":"Intelligent Decision Support System for USDA Forest Service Aerial Spray Management /","220833209":"Intra and Extra-Generational Schemes for Combining Crossover Operators.","2937533":"Evolving Logic Programs to Classify Chess-Endgame Positions","3161255":"Genetic Algorithm to Solve Optimum TDMA Transmission Schedule in Broadcast Packet Radio Networks","237723779":"A Genetic Algorithm for Constrained Statistical Matching","2258571":"Using Problem Generators to Explore the Effects of Epistasis","4042902":"Cooperation of decision-theoretic agents in the context of multi-agent systems","237348490":"SFERES 1 Un framework pour la conception de systèmes multi-agents adaptatifs SFERES 1 A framework for designing adaptive multi- agent systems","226721580":"Heuristic solution approaches for combined-job sequencing and machine loading problem in flexible manufacturing systems","3996300":"Intelli-agent: simulation environment for cooperating intelligent agents","267594050":"Implementation of Genetic Algorithms Into Development of Mechatronic Multi-Edge’s Grinder Design","3324035":"Design of piecewise maps for chaotic spread-spectrum communications using genetic programming","7149276":"GAME: Detecting cis-regulatory elements using a genetic algorithm","3413120":"Genetic-based search for error-correcting graph isomorphism. IEEE Trans Syst Man Cybern B Cybern","265011582":"Chapter 2 The Generalisation and Solving of Timetable Scheduling Problems","2301589":"An Overview of Genetic Algorithms : Part 1, Fundamentals","220856211":"Evolutionary State Assignment for Synchronous Finite State Machines.","2446494":"Adaptive Penalty Methods For Genetic Optimization Of Constrained Combinatorial Problems","220812180":"Improved Knowledge Acquisition for High-Performance Heuristic Search.","220949396":"Parallel Genetic Algorithm for Search and Constrained Multi-Objective Optimization.","220934036":"Data Fusion and Feature Selection for Alzheimer’s Diagnosis","33831110":"Scheduling of manufacturing systems based on extreme value theory and genetic algorithms /","220644325":"A large database of graphs and its use for benchmarking graph isomorphism algorithms","220701666":"Genetic Algorithms and Highly Constrained Problems: The Time-Table Case.","220472289":"New heuristic solution procedures for the uniform graph partitioning problem: Extensions and evaluation","242370229":"System Requirements Analysis for the US. Army Rock Island Arsenal Tool Management System","2355946":"Genetic Algorithm for Designing a Spread-Spectrum Radar Polyphase Code","2756838":"A NN Algorithm for Hard Satisfiability Problems+","2741989":"Genetic Algorithms And Highly Constrained Problems: The Time-Table Case","225235363":"A superior evolutionary algorithm for 3-SAT","274085511":"Performance Evaluation of CPU Scheduling Technique With an Efficient Genetic Algorithm","220833264":"Linear Inequality Control Rules in State-Space Planning: Beyond the first order predicate calculus.","222062054":"Genetic algorithm crossover operators for ordering applications. Comput Operat Res","3606252":"Scalability problems of genetic search","41401515":"A Comparative Runtime Analysis of Heuristic Algorithms for Satisfiability Problems","259654567":"Genetic Algorithm for Designing a Spread-Spectrum Radar Polyphase Code","228429120":"A hybrid genetic algorithm for the satisfiability problem","6954676":"GASAT: A Genetic Local Search Algorithm for the Satisfiability Problem","275657904":"Assertion of Purity, Quality and Availability of Ice Cream","256822703":"A decision tree approach to graph and subgraph isomorphism detection. Pattern Recogn","221589975":"A hybrid evolutionary-graph approach for finding functional network paths","223739824":"Quantum cooperative search algorithm for 3-SAT","220377540":"A genetic algorithm for optimized feature selection with resource constraints in software product lines","228337531":"Cellular Memetic Algorithms","234780436":"High-performance hardware design and implementation of genetic algorithms","2470094":"Genetic Algorithms and Financial Crises in Emerging Markets","220833223":"Templating Optimal Orthopedic Implant Using a Decision-Support System.","228939594":"Do not kill unfeasible individuals","2488533":"Solving The Simple Plant Location Problem By Genetic Algorithm","242388099":"Synthesis of Minimum-Cost Multilevel Logic Networks via Genetic Algorithm","224646034":"Cellular Genetic Algorithms and Local Search for 3-SAT problem on Graphic Hardware","220833240":"Developing Surrogate Simulation Models for Computationally Intensive Real World Application.","224646033":"Investigation Of A New Genetic Algorithm Designed For System-On-Chip Realization","221024222":"Recombination Operators for Satisfiability Problems","221630919":"Incremental Knowledge Acquisition for Improving Probabilistic Search Algorithms","221048280":"Minimal Addition Chain for Efficient Modular Exponentiation Using Genetic Algorithms","2239191":"On the Effectiveness of Genetic Search in Combinatorial Optimization","26588525":"Genetic Algorithms in Application to the Geometry Optimization of Nanoparticles","221494223":"Hybridizing Evolutionary Negative Selection Algorithm and Local Search for Large-Scale Satisfiability Problems.","2796330":"Using Genetic Algorithms for Concept Learning","3829050":"Genetic algorithms encoding study and a sufficient convergence condition of GAs","224650850":"Comparison of three Algorithms for solving the Convergent Demand Responsive Transportation Problem","238087477":"F1.2 Management applications and other classical optimization problems","263880895":"Parallel Genetic-Based Hybrid Pattern Matching Algorithm for Isolated Word Recognition","220375077":"A Hierarchy of Evolution Programs: An Experimental Study","225869425":"Scaling Up Inductive Logic Programming: An Evolutionary Wrapper Approach","3043623":"Graph partitioning using learning automata. IEEE Trans Comput","2304297":"A Comparative Study of Genetic Search","271195941":"Title/Research Topic:A Scheduling Procedure for Sports Clubs using Genetic Algorithms","234014434":"Metaheuristics: A Bibliography","220226097":"An heuristic search technique for fixed frequency assignment in non-homogeneous demand systems","256091218":"A novel Hybrid RBF Neural Networks model as a forecaster","221704740":"Vehicle Routing with Time Windows using Genetic Algorithms","220464689":"Genetic algorithms for clustering in machine vision","255588909":"IRT Test Assembly Using Genetic Algorithms","220381237":"Parallel hybrid method for SAT that couples genetic algorithms and local search.","250871268":"Tabu Search Algorithms for Multimodal and Multi-Objective Function Optimizations","2529086":"A Genetic Algorithm Model for Mission Planning and Dynamic Resource Allocation of Airborne Sensors","220350522":"An object-oriented database design for improved performance","2940727":"Evolution of Logic Programs: Part-of-Speech Tagging","34018587":"Algorithmes génétiques hybrides pour l\u0027optimisation combinatoire /","220998704":"Designing Telecommunications Networks Using Genetic Algorithms and Probabilistic Minimum Spanning Trees","220268549":"Solving the Satisfiability Problem by a Parallel Celluar Genetic Algorithm.","220932620":"Graph matching using Random Walks.","250890204":"Mealy finite state machines: An evolutionary approach","220073524":"Allocating Data and Operations to Nodes in Distributed Database Design","220801027":"Genetic Algorithms for Belief Network Inference: The Role of Scaling and Niching.","3628316":"Genetic algorithm to generate and evaluate assembly plans","228947092":"Evolutionary Algorithms and Constraint Satisfaction: Definitions, Survey, Methodology, and Research Directions","220375056":"Changing Representations During Search: A Comparative Study of Delta Coding","2264854":"A Clausal Genetic Representation And Its Evolutionary Procedures For Satisfiability Problems","2373405":"Large Population or Many Generations for Genetic Algorithms? Implications in Information Retrieval","239918966":"Timetabling with Genetic Algorithms","220988438":"Heterogeneous Multiagent Architecture for Dynamic Triage of Victims in Emergency Scenarios","253128746":"The Significance of the Evaluation Function in Evolutionary Algorithms","236179246":"Genetic Algorithms Performance Between Different Selection Strategy in Solving TSP","220867095":"Evolutionary Computing for the Satisfiability Problem","236179245":"Genetic Algorithm Performance with Different Selection Strategies in Solving TSP","221032044":"An Empirical Comparison of Two Evolutionary Methods for Satisfiability Problems.","221601908":"A Multiobjective Resources Scheduling Approach Based on Genetic Algorithms in Grid Environment","2769769":"Simulated Annealing for Hard Satisfiability Problems","228744420":"Algoritmos Evolutivos-Estudio de Escalabilidad sobre el Problema COUNTSAT","228981486":"Accurate Calculation of Deme Sizes for a Parallel Genetic Scheduling Algorithm","7730494":"Exact and approximate graph matching using random walks.","232651408":"Designing a Framework for Distributing Serial Applications","226552527":"A Hybrid approach for integer programming combining genetic algorithms, linear programming and ordinal optimization","255609960":"PATTERN IDENTIFICATION OF TIME SERIES EVENTS: A PARALLEL GENETIC ALGORITHM APPROACH","262409968":"Steiner systems and the Boolean satisfiability problem","221252709":"Minimal Addition-Subtraction Sequences for Efficient Pre-processing in Large Window-Based Modular Exponentiation Using Genetic Algorithms","3970916":"System modeling and design using genetic programming","221581422":"Minimal Addition-Subtraction Chains Using Genetic Algorithms.","2706294":"Using Neural Networks And Genetic Algorithms As Heuristics For NP-Complete Problems","2747722":"Reducing Epistasis in Combinatorial Problems by Expansive Coding","221135434":"Evolutionary Techniques for Hierarchical Clustering Applied to Microarray Data","4068187":"Evolutionary time scheduling","3776350":"The fitness function and its impact on local search methods","220988491":"A J-MADeM Agent-Based Social Simulation to Model Urban Mobility","221000772":"Determinant factorization and cycle basis: encoding schemes for the representation of spanning trees on incomplete graphs.","49592221":"A Dynamic Distributed Double Guided Genetic Algorithm for Optimization and Constraint Reasoning","2769728":"Evaluating and Improving Steady State Evolutionary Algorithms on Constraint Satisfaction Problems","2739013":"Lossless and Lossy Data Compression","41545495":"Diseño de la topología de una red ad-hoc","220669001":"Placing Text Labels on Maps and Diagrams Using Genetic Algorithms With Masking","221000797":"Approximation techniques for variations of the p-median problem","2323287":"CH-SAT: A Complete Heuristic Procedure for Satisfiability Problems","220279387":"Multiobjective genetic algorithm partitioning for hierarchical learning of high-dimensional pattern spaces: A learning-follows-decomposition strategy","221161557":"Markov chain analysis of genetic algorithms for 3-SAT problem.","30530733":"QGA: a Quantum Genetic Algorithm","2358111":"Using Genetic Algorithms to Generate Steiner Triple Systems","3755961":"Selection pressure and performance in spatially distributed evolutionary algorithms","3418549":"A genetic algorithm for the multiple destination routing problems","220536487":"A New Encoding Scheme and a Framework to Investigate Genetic Clustering Algorithms.","222563523":"A discipline of evolutionary programming","2828194":"Unsatisfied Variables in Local Search","220403369":"Autonomous operator management for evolutionary algorithms","3692980":"Solving 3-SAT by GAs adapting constraint weights","241181681":"Non-linear constrained optimal control problem: A hybrid PSO-GA-Based discrete augmented lagrangian approach","3418528":"Using genetic algorithms in process planning for job shop machining","223595719":"An accurate parallel genetic algorithm to schedule tasks on a cluster","224742643":"An accurate and efficient parallel genetic algorithm to schedule tasks on a cluster","266047555":"Diseño e Implementación de Algoritmos Genéticos Celulares para Problemas Complejos","289157796":"Using Neural Networks and Genetic Algorithms as Heuristics for NP-Complete Problems","225716973":"Evolutionary Synthesis of Synchronous Finite State Machines","257448129":"HW/SW co-design of reconfigurable hardware-based genetic algorithm in FPGAs applicable to a variety of problems","222259876":"Evolution Based Learning in a Job Shop Scheduling Environment","277298971":"A Clausal Genetic Representation and its Evolutionary Procedures for Satisfiability Problems","2297278":"HGA: A Hardware-Based Genetic Algorithm","257396426":"An evolutionary computational model applied to cluster analysis of DNA microarray data","3113871":"Genetic Algorithms Approach to a Negotiation Support System","223410416":"Improve genetic operators for structural engineering optimization","225873623":"Application of Estimation of Distribution Algorithms for Nuclear Fuel Management","220380800":"A genetic algorithm for the multiple destination routing problems.","262366721":"Learning and verifying safety constraints for planners in a knowledge-impoverished system","3721627":"A Parallel Multi-Phase Implementation of Simulated Annealing for the Traveling Salesman Problem","3301787":"Genetic Evolution of the Topology and Weight Distribution of Neural Networks","228581428":"Large-scale ecosystem management as a complex systems problem: Multi-objective optimisation with spatial constraints","224119030":"A hybrid genetic algorithm for the channel routing problem","220999299":"Scheduling of Multi-Product Fungible Liquid Pipelines Using Genetic Algorithms.","221057181":"An Enhanced Fuzzy-Genetic Algorithm to Solve Satisfiability Problems","225320668":"Swarm Intelligence — Searchers, Cleaners and Hunters","220204179":"Programming for modular reconfigurable robots","234818636":"A genetic algorithm for packing in three dimensions","220549782":"Hardware implementation of a novel genetic algorithm","220080298":"Case-based reasoning assisted explanation of genetic algorithm results","221183642":"A Nested Genetic Algorithm for Distributed Database Design.","221047960":"An Application of Genetic Algorithms to Course Scheduling at the United States Army War College.","221047963":"Evolutionary RSA-Based Cryptographic Hardware Using the Co-Design Methodology","2745744":"Solving Combinatorial Problems Using Evolutionary Algorithms","2403230":"Solving The Subset Interconnection Design Problem Using Genetic Algorithms","3755909":"Genetic algorithm for broadcast scheduling in packet radio networks","3507080":"GIDEON: a genetic algorithm system for vehicle routing with time windows","228828700":"A Hybrid Hopfield Network-Imperialist Competitive Algorithm for Solving the SAT Problem","2485734":"Solving the Three-Star Tree Isomorphism Problem Using Genetic Algorithms","41545148":"Subgrafs d\u0027energia mínima en xarxes ad-hoc","257574556":"GA-based cloud resource estimation for agent-based execution of bag-of-tasks applications","267723325":"A HYBRID GENETIC-GREEDY APPROACH TO THE SKILLS MANAGEMENT PROBLEM","220907746":"A Genetic Algorithm for Satisfiability Problem in a Probabilistic Logic: A First Report","220349172":"Software/Hardware Co-Design of Efficient and Secure Cryptographic Hardware.","220740336":"A Genetic Algorithm with Tabu Search for Multimodal and Multiobjective Function Optimization.","233647671":"A genetic algorithm based process planning system for mould base","51243218":"Simplivariate Models: Uncovering the Underlying Biology in Functional Genomics Data","34735090":"A reconfigurable hardware implementation of genetic algorithms for VLSI CAD design [microform].","3153872":"Channel Assignment Through Evolutionary Optimization","226751072":"Non-standard methods in evolutionary computation","228915779":"On the Complexity of Physical Problems and a Swarm Algorithm for k-Clique Search in Physical Graphs","2627520":"How Good Are Genetic Algorithms At Finding Large Cliques: An Experimental Study","225665695":"Bayesian Classifiers in Optimization: An EDA-like Approach","257674421":"An evolutionary algorithm for broadcast scheduling in wireless multihop networks","3529691":"The Allocation of Documents in Multiprocessor Information Retrieval Systems: An Application of Genetic Algorithms","220923099":"Hardware Implementation of Genetic Algorithms for VLSI Design.","3828168":"Evolutionary potential timetables optimization by means of geneticand greedy algorithms","238428100":"Evolutionary Algorithms in Combinatorial Optimization","3193284":"On median graphs: Properties, algorithms, and applications","3693006":"Robust encodings in genetic algorithms: A survey of encoding issues.","4036554":"Genetic algorithm solution for the intelligent turret assembly system","220403418":"Using a Hybrid Genetic-Algorithm/Branch and Bound Approach to Solve Feasibility and Optimization Integer Programming Problems","11452245":"Evolutionary Algorithms for the Satisfiability Problem","2635221":"Using Neural Networks and Genetic Algorithms as Heuristics for NP-Complete Problems","286887143":"Determining profitability for ngati whakaue tribal lands inc. farms by developing a sustainable land management plan"},"index":942}