{"abs":"The integration of optimization methodologies with computational analyses/simulations has a profound impact on the product design. Such integration, however, faces multiple challenges. The most eminent challenges arise from high-dimensionality of problems, computationally-expensive analysis/simulation, and unknown function properties (i.e., black-box functions). The merger of these three challenges severely aggravates the difficulty and becomes a major hurdle for design optimization. This paper provides a survey on related modeling and optimization strategies that may help to solve High-dimensional, Expensive (computationally), Black-box (HEB) problems. The survey screens out 207 references including multiple historical reviews on relevant subjects from more than 1,000 papers in a variety of disciplines. This survey has been performed in three areas: strategies tackling high-dimensionality of problems, model approximation techniques, and direct optimization strategies for computationally-expensive black-box functions and promising ideas behind non-gradient optimization algorithms. Major contributions in each area are discussed and presented in an organized manner. The survey exposes that direct modeling and optimization strategies to address HEB problems are scarce and sporadic, partially due to the difficulty of the problem itself. Moreover, it is revealed that current modeling research tends to focus on sampling and modeling techniques themselves and neglect studying and taking the advantages of characteristics of the underlying expensive functions. Based on the survey results, two promising approaches are identified to solve HEB problems. Directions for future research are also discussed.","title":"Survey of modeling and optimization strategies to solve high-dimensional design problems with computationally-expensive black-box functions","id":226923694,"url":"https://www.researchgate.net/publication/226923694_Survey_of_modeling_and_optimization_strategies_to_solve_high-dimensional_design_problems_with_computationally-expensive_black-box_functions","names":["Songqing Shan","Gary Wang","Structural and Multidisciplinary Optimization"],"references":{"3130415":"Space Mapping: The State of the Art","2369062":"Optimal Model-Based Decomposition Of Powertrain System Design","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","257821524":"Design of Computer Experiments for Metamodel Generation","245893283":"Designs for Computer Experiments","254331173":"Influential Observations and Outliers in Regression","254042923":"Use of Kriging Models to Approximate Deterministic Computer Models","4193323":"Parallel Gray code optimization for high dimensional problems","228738485":"Ch. 7. A review of design and modeling in computer experiments","243710111":"Optimal Design of Mechanical Engineering Systems","3130418":"Fast Parameter Optimization of Large-Scale Electromagnetic Objects Using DIRECT with Kriging Metamodeling","250148086":"Quasi-regression for visualization and interpretation of black box functions","226258786":"General Foundations of High Dimensional Model Representations","285697817":"Nonparametric Bayesian regression","2630664":"Dennis Jr, J.E.: A pattern search filter method for nonlinear programming without derivatives. SIAM J. Optim. 14(4), 980-1010","220473600":"An adaptive and dynamic dimensionality reduction method for high-dimensional indexing","260161445":"Fitting Multivariate Regression Functions by Interaction Spline Models","226624431":"Review of the Space Mapping Approach to Engineering Optimization and Modeling","221318940":"Global Optimization - Stochastic or Deterministic?","238845450":"Trends And Challenges In System Design Optimization","225929537":"A Knowledge-Based Approach To Response Surface Modelling in Multifidelity Optimization","225516876":"Metamodels for Computer-based Engineering Design: Survey and recommendations","236833312":"A Concept Exploration Method For Determining Robust Top-Level Specifications","2494566":"A Hybrid Aggressive Space-Mapping Algorithm for EM Optimization","4261893":"Global Sensitivity Analysis of Predictor Models in Software Engineering","249841315":"Adaptive response surface method - A global optimization scheme for approximation-based design problems","4006010":"Adaptive dimension reduction for clustering high dimensional data","225490232":"A global structural optimization technique using an interval method","261592543":"Evolutionary Operation : A Method for Increasing Industrial Productivity","245366485":"A Formal Two-Phase Method for Decomposition of Complex Design Problems","2242166":"Detecting Near Linearity in High Dimensions","230872981":"A Review of Response Surface Methodology: A Literature Survey","258705202":"Efficient Input-Output Model Representations","258430781":"A Review of Techniques for Parameter Sensitivity Analysis of Environmental Models","226755550":"Optimization by Simulated Annealing: Quantitative Studies","260406235":"Projection Pursuit Regression","2662519":"Fuzzy Move Limit Evaluation In Structural Optimization","232381883":"Global optimization in path synthesis based on design space reduction","3425367":"Bayesian surrogates for integrating numerical, analytical, and experimental data: Application to inverse heat transfer in wearable computers","3076682":"Applying The Design Structure Matrix To System Decomposition And Integration Problems: A Review And New Directions","241509888":"Screening the Input Variables to a Computer Model Via Analysis of Variance and Visualization","215446192":"A Central Limit Theorem for Latin Hypercube Sampling","38359584":"Interaction Spline Models and Their Convergence Rates","272161362":"Principal Components Analysis","241385996":"Mode Pursuing Sampling Method for Discrete Variable Optimization on Expensive BlackBox Functions","245366512":"Design Optimization of Hierarchically Decomposed Multilevel Systems Under Uncertainty","6026283":"Optimization by Simulated Annealing,” Science 220, 671-680","235172977":"A Trust Region Strategy for Equality Constrained Optimization","245365482":"A Genetic Algorithm for Scheduling and Decomposition of Multidisciplinary Design Problems","242932749":"Applying Experimental Design and Regression Splines to High-Dimensional Continuous-State Stochastic Dynamic Programming","227076081":"Variable-complexity response surface approximations for wing structural weight in HSCT design","242389519":"Factorial Sampling Plans for Preliminary Computational Experiments","263480777":"Mode-pursuing sampling method for global optimization on expensive black-box functions","2909778":"Continuous Nonlinear Dimensionality Reduction By Kernel Eigenmaps","238184525":"Tree-Based Dependency Analysis in Decomposition and Re-decomposition of Complex Design Problems","265427282":"Bayesian design and analysis of computer experiments: Two examples","231663951":"An Efficient Chemical Kinetics Solver Using High Dimensional Model Representation","38367432":"Orthogonal Arrays of Strength two and three","250652274":"Multilevel parallelism for optimization on MP computers: Theory and experiment","4772045":"Bayesian Calibration of Computer Models","236235921":"Particle swarm optimization. ISTE","239393484":"A review on design, modeling and applications of computer experiments. IIE Trans. 38: 273-291","2385583":"A Rigorous Framework for Optimization of Expensive Functions by Surrogates","3955383":"Optimization with joint space reduction and extension induced by kinematic limits for redundant manipulators","239060145":"A General Framework for Decomposition Analysis in Optimal Design","257334727":"Approximation methods in multidisciplinary analysis and optimization: A panel discussion","238125218":"A Unified Search Framework for Large-scale Blackbox Optimization","38359261":"On Projection Pursuit Regression","230873429":"Experimental Design: Review and Comment","245429818":"Structural Design Optimization Status and Direction","227319575":"Comparative Studies of Metamodeling Techniques Under Multiple Modeling Criteria","2637450":"A Network Reliability Approach To Optimal Decomposition Of Design Problems","222817262":"A Global Sensitivity Analysis Tool for the Parameters of Multi-Variable Catchment Models","269223586":"Machine system design optimization strategies based on expansion and contraction of design spaces","246648860":"Differential Evolution: A Simple and Efficient Adaptive Scheme for Global Optimization Over Continuous Spaces","242487493":"Axiomatic Design: Advances and Applications","239065741":"A Nonlinear Mapping for Data Structure Analysis","2330775":"SVMTorch: Support Vector Machines for Large-Scale Regression Problems","216301661":"Screening, Predicting, and Computer Experiments","2646166":"Support Vector Machines for Large-Scale Regression Problems","32140584":"Hierarchical Parallel Processes of Genetic Algorithms for Design Optimization of Large-Scale Products","3120869":"An aggressive approach to parameter extraction","216301102":"Computationally inexpensive metamodel assessment strategies. AIAA J","3121406":"Space-mapping optimization of microwave circuits exploiting surrogate models","226207662":"Space exploration and global optimization for computationally intensive design problems: A rough set based approach","3753708":"Dimensionality reduction by random mapping: Fast similarity computation for clustering","234372399":"Knowledge Discovery in Aerodynamic Design Space for Flyback-Booster Wing Using Data Mining","3119858":"EM-ANN Models for Microstrip Vias and Interconnects in Dataset Circuits","233242424":"Global response approximation with radial basis functions","230872860":"Recent Advances in Nonlinear Experimental Design","222135261":"Exploratory Designs for Computational Experiments","277287527":"Decomposition Of Simultaneous Analysis And Design Models","226314141":"Multilevel parallel optimization using massively parallel structural dynamics","226216344":"Lipschitzian Optimisation Without the Lipschitz Constant","226972002":"High Dimensional Model Representations Generated from Low Dimensional Data Samples. I. mp-Cut-HDMR","235069159":"Two-Level Multifactor Designs for Detecting the Presence of Interactions","264857903":"Blind Kriging: A New Method for Developing Metamodels","237453504":"Review of Metamodeling Techniques in Support of Engineering Design Optimization","5589170":"Ant System: Optimization by a colony of cooperating agents. IEEE Trans Syst Man Cybernetics - Part B","222849957":"Bayesian-validated computer-simulation surrogates for optimization and design: Error estimates and applications","2243276":"Quasi-Regression","270253803":"Evolutionary Operation: A Method for Increasing Industrial Productivity","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","242356870":"Adaptation In Natural And Artificial Systems","265681709":"D-Optimality for Regression Designs: A Review","238624960":"Multidimensional Visualization and Its Application to a Design by Shopping Paradigm","23575450":"Two point exponential approximation method for structural optimization","2951379":"Global optimization using the DIRECT algorithm in Matlab","254287318":"Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments","30870312":"Genetic Algorithms in Search, Optimization and Machine Learning. Addison-Wesley, Boston, MA","227078282":"A method for using legacy data for metamodel-based design of large-scale systems","38359887":"Additive Regression and Other Nonparametric Models","243710344":"Decomposition and Representation Methods in Mechanical Design","255920209":"Combining global and local approximations","245366669":"Understanding the Effects of Model Uncertainty in Robust Design With Computer Experiments","38363487":"The Design and Analysis of Computer Experiments","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","245424568":"New Adaptive Move-Limit Management Strategy for Approximate Optimization, Part 2","236534528":"A Bayesian Approach to the Design and Analysis of Computer Experiments","223373387":"A factorized high dimensional model representation on the nodes of a finite hyperprismatic regular grid","236495111":"Risk methodology for geologic disposal of radioactive waste: small sample sensitivity analysis techniques for computer models, with an application to risk assessment","4853102":"Additive Interactive Regression Models: Circumvention of the Curse of Dimensionality","220244494":"A Fictitious Play Approach to Large-Scale Optimization","255052295":"Evaluation of a Graphical Design Interface for Design Space Visualization","228799135":"Analytical metamodel-based global sensitivity analysis and uncertainty propagation for robust design","226754236":"Automatic evaluation of move-limits in structural optimization","2321763":"Hierarchical Decomposition Synthesis In Optimal Systems Design","228934887":"A New Variable-Fidelity Optimization Framework Based on Model Fusion and Objective-Oriented Sequential Sampling","5900060":"Screening Parameters of Pulmonary and Cardiovascular Integrated Model with Sensitivity Analysis","3045219":"A Nonlinear Mapping for Data Structure Analysis","238394232":"Small Sample Sensitivity Analysis Techniques For Computer-Models, With An Application To Risk Assessment","50927704":"Principal Components Analysis Tutorial","7297338":"Random Sampling-High Dimensional Model Representation (RS-HDMR) and Orthogonality of Its Different Order Component Functions","2240885":"Assessing Linearity in High Dimensions","223281176":"Efficient input—output model representations","236842821":"Statistical Approximations for Multidisciplinary Design Optimization: The Problem of Size","222297190":"Parallel radial basis function methods for the global optimization of expensive functions","242611503":"A Study of the Group Screening Method","2317176":"Comparative Studies Of Metamodeling Techniques Under Multiple Modeling Criteria","3119476":"Electromagnetic Optimization Exploiting Aggressive Space Mapping","3121010":"Hybrid aggressive space-mapping algorithm for EM optimization","3623274":"Particle swarm Optimization","222869015":"Quasi-regression with shrinkage","239578406":"Algorithms for Computing the Sample Variance: Analysis and Recommendations","220669505":"A Stochastic Radial Basis Function Method for the Global Optimization of Expensive Functions","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","255916583":"Two-level multifactor designs for detecting the presence of interactions","237384522":"Fuzzy Clustering Based Hierarchical Metamodeling for Design Optimization","238878028":"Efficiency of a Global Optimization Algorithm","247834033":"Matrix-based decomposition algorithms for engineering applications: The survey and generic framework","8227595":"Mapping high-dimensional data onto a relative distance plane - a novel, exact method for visualizing and characterizing high-dimensional patterns. Journal of Biomedical Informatics 37, 366-379","220045412":"Adoption in Natural and Artificial System","233927306":"Target cascading in optimal system design. J Mech Des (Trans ASME)","225467405":"A Constraint Mapping Approach to the Structural Optimization of an Expensive Model using Surrogates","245425119":"Engineering Design Optimization Using Interior-Point Algorithms","253452440":"New Adaptive Move-Limit Management Strategy for Approximate Optimization, Part 1","238584766":"Optimization and Experiments: A Survey","227090446":"Haftka, R.T.: Multidisciplinary aerospace design optimization: Survey of recent developments. Structural Optimization 14, 1-23","2326442":"Multilevel Parallel Optimization Using Massively Parallel Structural Dynamics","244441883":"Sensitivity Estimates for Nonlinear Mathematical Models","242980336":"Hybrid high dimensional model representation (HHDMR) on the partitioned data","223564511":"Surrogate-based analysis and optimization","2360235":"Using Principal Component Analysis Modeling to Monitor Temperature Sensors in a Nuclear Research Reactor","216756580":"Orthogonal Column Latin Hypercubes and Their Application in Computer Experiments","243763989":"Optimal Model-Based Partitioning of Powertrain System Design","245829939":"D-Optimality for Regression Designs: A Review","236626319":"Trust Region Augmented Lagrangian Methods for Sequential Response Surface Approximation and Optimization","216756606":"Orthogonal Array-Based Latin Hypercubes","231629915":"High Dimensional Model Representations","216756605":"Orthogonal Arrays for Computer Experiments, Integration and Visualization","2469298":"Nonparametric Bayesian Regression Methods","239886805":"Bayesian Design and Analysis of Computer Experiments: Use of Derivatives in Surface Prediction","2317753":"Optimal Hierarchical Decomposition Synthesis Using Integer Programming","241731059":"Design Optimization under Parameter Uncertainty for General BlackBox Models","2646452":"Hierarchical Overlapping Coordination for Large-Scale Optimization by Decomposition","221653143":"Discovering additive structure in black box functions","222490346":"Minimax and Maximin Distance Designs","3118978":"Space Mapping Technique for Electromagnetic Optimization","3043228":"Approximation, Dimension Reduction, and Nonconvex Optimization Using Linear Superpositions of Gaussians","226591282":"A Hypergraph Framework For Optimal Model-Based Decomposition Of Design Problems","225138909":"Development of visual design steering as an aid in large-scale multidisciplinary design optimization. Part II: Method validation","2556318":"Reduced Sampling For Construction Of Quadratic Response Surface Approximations Using Adaptive Experimental Design","222678271":"An efficient algorithm for constructing optimal design of computer experiments","38360050":"Nonparametric Bayesian regression. Ann Stat 14:934-953","216301407":"Global versus local search in constrained optimization of computer models","252078269":"A Trust Region Algorithm for Nonlinearly Constrained Optimization","220416668":"Nonlinear Mapping of Massive Data Sets by Fuzzy Clustering and Neural Networks","223128712":"Mode Pursing Sampling Method for Discrete Variable Optimization on Expensive Black-box Functions,","2468835":"Simulation Based Bayesian Nonparametric Regression Methods","226159805":"Global optimization methods for engineering applications: A review","230872587":"Experimental Design and Observation for Large Systems","224759466":"Aggressive Space Mapping for Electromagnetic Design","246202749":"Flexible Parsimonious Smoothing and Additive Modeling","228454476":"High dimensional model representation","216300850":"On Sequential Sampling for Global Metamodeling in Engineering Design","4672415":"Sensitivity analysis and multidisciplinary optimization for aircraft design - Recent advances and results","245848443":"Decomposition of the Design Process","231522833":"Random Sampling−High Dimensional Model Representation (RS−HDMR) with Nonuniformly Distributed Variables: Application to an Integrated Multimedia/Multipathway Exposure and Dose Model for Trichloroethylene","2364409":"DECOMPOSITION OF SIMULTANEOUS ANALYSIS AND DESIGN MODELS Nestor Michelena Tao Jiang Panos Papalambros","235709905":"A Comparison of Three Methods for Selecting Vales of Input Variables in the Analysis of Output From a Computer Code","38363031":"Bayesian Experimental Design: A Review","242092465":"Partitioned, Multilevel Response Surfaces for Modeling Complex Systems","236822466":"Comparison Of Response Surface And Kriging Models For Multidisciplinary Design Optimization","261404279":"A Tutorial on Principal Component Analysis","228339829":"Analysis of Decomposability and Complexity for Design Problems in the Context of Decomposition","283632907":"Design Space Reduction for Multi-Objective Optimization and Robust Design Optimization Problems","245424973":"Bilevel Integrated System Synthesis with Response Surfaces","245366130":"A Hierarchical Decomposition Scheme for the Topological Synthesis of Articulated Gear Mechanisms","238162396":"Development of visual design steering as an aid in large-scale multidisciplinary design optimization. Part I: Method development","2495432":"An Aggressive Approach to Parameter Extraction","229352027":"A recursive algorithm for finding HDMR terms for sensitivity analysis","244348258":"Sampling Strategies for Computer Experiments: Design and Analysis","3120605":"A trust region agressive space mapping algorithm for EM optimization","2558932":"Parallel Processing In Sequential Approximate Optimization","239402416":"A formal approach to specifications in conceptual design. Trans ASME J Mech Des","38359473":"Multi-Variate Adaptive Regression Splines (with Discussion)","3882951":"Multilevel optimization for large-scale circuit placement"},"citedIn":{"220096284":"An approximation method to model multivariate interpolation problems: Indexing HDMR","48856170":"Optimizing Soil Hydraulic Parameters in RZWQM2 under Fallow Conditions","251357048":"Constancy maximization based weight optimization in high dimensional model representation for multivariate functions","276367229":"Multi-Objective Aerodynamic Optimization Design and Data Mining of a High Pressure Ratio Centrifugal Impeller","260442883":"Flood inference simulation using surrogate modelling for the Yellow River multiple reservoir system","271019436":"Optimizing an HIV testing program using a system dynamics model of the continuum of care","276443249":"An adaptive SVR-HDMR model for approximating high dimensional problems","261059714":"On-Line Production Cost Optimization in High Performance Machining Operations through AI Techniques","288874040":"High Dimensional Kriging Metamodelling Utilising Gradient Information","254230327":"Combining radial basis function surrogates and dynamic coordinate search in high-dimensional expensive black-box optimization","282223171":"Meta model-based global design optimization and exploration method","278185606":"Response Surfaces with Discounted Information for Global Optima Tracking in Dynamic Environments","241709694":"A comparative study of the scalability of alternative metamodelling techniques","241040837":"Efficient design of experiments for structural optimization using significance screening","259890661":"SO-I: A surrogate model algorithm for expensive nonlinear integer programming problems including global optimization applications","283199737":"Enhancing material efficiency of energy absorbers through graded thickness structures","259096555":"A robust and efficient triangulation-based optimization algorithm for stochastic black-box systems","267454058":"Sensitivity Analysis for Computationally Expensive Models using Optimization and Objective-oriented Surrogate Approximations","234061935":"Comparing sampling strategies for aerodynamic Kriging surrogate models","257296585":"Factorized form of the indexing HDMR method for multivariate data modeling","51948989":"Requirements for a New Detector at the South Pole Receiving an\nAccelerator Neutrino Beam","275259213":"Finding a Robust Configuration for the AEDB Information Dissemination Protocol for Mobile Ad Hoc Networks","262949254":"Special Section on Multidisciplinary Design Optimization: Multidisciplinary Design Optimization of Dynamic Engineering Systems","221508380":"An Overview of Design Challenges and Methods in Aerospace Engineering","282754282":"Multilevel field-development optimization using a sequence of upscaled models","276235078":"A Domain Decomposition Approach for Uncertainty Analysis","257591534":"Multivariate data modelling through Piecewise generalized HDMR method","272492424":"Designing scalable product families by the radial basis function–high-dimensional model representation metamodelling technique","279737241":"Efficient matrix-free GPU implementation of Fixed Grid Finite Element Analysis","224203883":"Current Status of Ant Colony Optimization Algorithm Applications","261024057":"Improved non-intrusive polynomial chaos for reliability analysis under hybrid uncertainty","278964760":"Reducing MCMC Computational Cost with a Two Layered Bayesian Approach","265813868":"Registrar: A complete-memory operator to enhance performance of genetic algorithms","220215197":"Adaptive MLS-HDMR metamodeling techniques for high dimensional problems","267332049":"Robust optimisation of CO2 sequestration strategies under geological uncertainty using adaptive sparse grid surrogates","275956300":"A global optimization algorithm for simulation-based problems via the extended DIRECT scheme","274640667":"Constructive cooperative coevolutionary optimisation for interacting production stations","263005546":"Metamodeling in Multidisciplinary Design Optimization: How Far Have We Really Come?","270597479":"Efficient adaptive response surface method using intelligent space exploration strategy","251176240":"Fluctuation free multivariate integration based logarithmic HDMR in multivariate function representation","226925646":"Two-level refined direct optimization scheme using intermediate surrogate models for electromagnetic optimization of a switched reluctance motor","262161768":"A prior-knowledge input LSSVR metamodeling method with tuning based on cellular particle swarm optimization for engineering design","272015231":"Development of multi-metamodels to support surface water quality management and decision making","270053330":"Tracking global optima in dynamic environments with efficient global optimization","283765154":"Querying Bayesian networks to design experiments with application to 1AGY serine esterase protein engineering","251762129":"Computer aided design of asymmetric e-plane bandpass filters with improved stopband performance","263593316":"Modification of DIRECT for high-dimensional design problems","282482949":"An Efficient Optimisation Technique Using Adaptive Spectral High-Dimensional Model Representation: Application to CO Sequestration Strategies","271991394":"Evaluation of industrial machine design improvement ideas using characteristic-based hierarchical optimisation strategies","49643552":"Considerations for parameter optimization and sensitivity in climate models","263062907":"Hierarchical stochastic metamodels based on moving least squares and polynomial chaos expansion: Application to the multiobjective reliability-based optimization of space truss structures","263244902":"Constrained optimization by radial basis function interpolation for high-dimensional expensive black-box problems with infeasible initial points","288700652":"An enhanced RBF-HDMR integrated with an adaptive sampling method for approximating high dimensional problems in engineering design","230933785":"A Bayesian approach for the stochastic modeling error reduction of magnetic material identification of an electromagnetic device","258849463":"No Free Lunch Theorem and Bayesian probability theory: two sides of the same coin. Some implication for black-box optimization and metaheuristics","267396778":"Deterministic approaches for solving practical black-box global optimization problems","263380713":"A hybrid variable-fidelity global approximation modelling method combining tuned radial basis function base and kriging correction","233871023":"A new fitness estimation strategy for particle swarm optimization","273898764":"A survey on handling computationally expensive multiobjective optimization problems using surrogates: non-nature inspired methods","257591099":"Small scale high dimensional model representation","287292286":"Knowledge-Based Surrogate Modeling in Engineering Design Optimization","228965959":"Investigating the Significance of “One-to-Many” Mappings in Multiobjective Optimization","254230340":"A novel algorithm of maximin Latin hypercube design using successive local enumeration","281349922":"An adaptive global variable fidelity metamodeling strategy using a support vector regression based scaling function","285965923":"An Initialization Strategy for High-Dimensional Surrogate-Based Expensive Black-Box Optimization","285886691":"Review of surrogate modeling in water resources","245367242":"Metamodeling for High Dimensional Simulation-Based Design Problems","260317166":"PROGRESS: Progressive Reinforcement-Learning-Based Surrogate Selection","264961313":"Modeling and optimization. Theory and applications. Selected contributions from the MOPTA 2012 conference, Bethlehem, PA, USA, July 30 – August 1, 2012","256688551":"High dimensional model representation (HDMR) coupled intelligent sampling strategy for nonlinear problems","285700586":"Fitness Estimation Based Particle Swarm Optimization Algorithm for Layout Design of Truss Structures","274553907":"High Dimensional Model Representation With Principal Component Analysis","225398940":"A Matrix Based Indexing HDMR method for multivariate data modelling","258926749":"Response Surface Methods for Efficient Aerodynamic Surrogate Models","271945676":"A new approach for multivariate data modelling in orthogonal geometry","258724624":"Review of surrogate modeling in water resources Water Resources Research 48:n/a-n/a","275378322":"A Decomposition Method for Exploiting Parallel Computing Including the Determination of an Optimal Number of Subsystems","253651301":"Securing high resolution grayscale facial captures using a blockwise coevolutionary GA","227342321":"Efficient Response Surface Methods Based on Generic Surrogate Models","271445970":"Multiobjective optimisation on a budget: Exploring surrogate modelling for robust multi-reservoir rules generation under hydrological uncertainty","251554561":"Iterative improvement of Bayesian parameter estimates for an engine model by means of experimental design","274714656":"The numerical solution of elliptic partial differential equations with fuzzy coefficients"},"index":944}