{"abs":"Let \\( \\Phi \u003d \\left\\{ {{\\Phi _n}} \\right\\} \\)be a Markov chain on a half-line [0, ∞) that is stochastically ordered in its initial state. We find conditions under which there are explicit bounds on the rate of convergence of the chain to a stationary limit π: specifically, for suitable rate functions r which may be geometric or subgeometric and “moments” f ≥ 1, we find conditions under which $$ r\\left( n \\right)\\mathop {\\sup }\\limits_{|g| \\leqslant f} |{E_x}\\left[ {g\\left( {{\\Phi _n}} \\right)} \\right] - \\pi \\left( g \\right)| \\leqslant M\\left( x \\right) $$for all n and all x. We find bounds on r ( n ) and M(x) both in terms of geometric and subgeometric “drift functions”, and in terms of behaviour of the hitting times on {0} and on compact sets [0 c ] for c \u003e 0. The results are illustrated for random walks and for a multiplicative time series model.","title":"Explicit Rates of Convergence of Stochastically Ordered Markov Chains","id":2358116,"url":"https://www.researchgate.net/publication/2358116_Explicit_Rates_of_Convergence_of_Stochastically_Ordered_Markov_Chains","names":["D. J. Scott","R L Tweedie"],"references":{"200111118":"Markov Chains and Stochastic Stability","264966253":"Subgeometric Rates of Convergence of f-Ergodic Markov Chains","247633348":"Stability of Markovian Processes I: Criteria for Discrete-Time Chains","38362158":"Geometric Ergodicity and R-positivity for General Markov Chains","227423974":"The rate of convergence in Orey\u0027s theorem for Harris recurrent Markov chains with applications to renewal theory","38339971":"Computable exponential convergence rates for stochastically ordered Markov processes","246316357":"Geometric Convergence Rates for Stochastically Ordered Markov Chains","2353262":"Computable Bounds for Geometric Convergence Rates of Markov Chains","230596176":"Comparison Methods for Queues and other Stochastic Models. Wiley, New York","226926889":"On coupling of discrete renewal processes","222387026":"Geometric Ergodicity of Harris Recurrent Markov Chains with Applications to Renewal Theory","268609719":"Criteria for rates of convergence of Markov chains, with application to queueing and storage theory","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","227816908":"Random Coefficient Autoregressive Processes: A Markov Chain Analysis of Stationarity and Finiteness of Moments","244522700":"Uniform Estimates for Geometric Ergodicity of Recurrent Markov Chains"},"citedIn":{"236651515":"Explicit Rates of Exponential Convergence for Semimartingale Reflected Brownian Motion with Jumps in the Positive Orthant and for Competing Levy Particles","226920134":"Sample-path optimality and variance-maximization for Markov decision processes","265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","2646281":"Simulating The Invariant Measures Of Markov Chains Using Backward Coupling At Regeneration Times","283975662":"Fixed point theorems and explicit estimates for convergence rates of continuous time Markov chains","2123684":"Computable Convergence Rates for Subgeometrically Ergodic Markov Chains","243013816":"Bias optimality and strong n () discount optimality for Markov decision processes","225182538":"Zero-sum stochastic games with average payoffs: New optimality conditions","51969361":"The rate of convergence to stationarity for M/G/1 models with admission\ncontrols via coupling","38384771":"Computable convergence rates for sub-geometric ergodic Markov chains","265188771":"Computable bounds for subgeometric ergodicity","2335502":"Rates of convergence of stochastically monotone and continuous time Markov models","238857362":"Another set of conditions for Markov decision processes with average sample-path costs","2118639":"Baxendale, P.H.: Renewal theory and computable convergence rates for geometrically ergodic Markov chains. Ann. Appl. Probab. 15(1B), 700-738","25415891":"Dr. Whorton\u0027s Response","243047692":"Markov Decision Processes with Variance Minimization: A New Condition and Approach","227017521":"Explicit Convergence Rates of the Embedded M/G/1 Queue","243047585":"Another Set of Conditions for Strong n (n \u003d −1, 0) Discount Optimality in Markov Decision Processes"},"index":947}