{"abs":"This is a continuation of the study, begun by Ceccherini-Silberstein and Woess (2009) [5], of context-free pairs of groups and the related context-free graphs in the sense of Muller and Schupp (1985) [22]. The graphs under consideration are Schreier graphs of a subgroup of some finitely generated group, and context-freeness relates to a tree-like structure of those graphs. Instead of the cones of Muller and Schupp (1985) [22] (connected components resulting from deletion of finite balls with respect to the graph metric), a more general approach to context-free graphs is proposed via tree sets consisting of cuts of the graph, and associated structure trees. The existence of tree sets with certain \"good\" properties is studied. With a tree set, a natural context-free grammar is associated. These investigations of the structure of context free pairs, resp. graphs are then applied to study random walk asymptotics via complex analysis. In particular, a complete proof of the local limit theorem for return probabilities on any virtually free group is given, as well as on Schreier graphs of a finitely generated subgoup of a free group. This extends, respectively completes, the significant work of Lalley (1993, 2001) [18,20].","title":"Context-free pairs of groups II - Cuts, tree sets, and random walks","id":221768884,"url":"https://www.researchgate.net/publication/221768884_Context-free_pairs_of_groups_II_-_Cuts_tree_sets_and_random_walks","names":["Wolfgang Woess"],"references":{"236164754":"The Algebraic Theory of Context-Free Languages","228816673":"Random walks on regular languages and algebraic systems of generating functions","245158296":"Accessibility and Groups of Cohomological Dimension One","268019133":"Random Walks on Infinite Graphs and Groups","266994671":"Groups acting on graphs. Reprint of the 1989 hardback ed","220688226":"Semirings, Automata, Languages","221423032":"Discrete Random Walks on One-Sided ``Periodic\u0027\u0027 Graphs","220154259":"Growth-sensitivity of context-free languages","220442156":"Cutting up graphs","242443041":"Non-Negative Matrices and Markov Chains","220074827":"Vertex-Transitive Graphs and Accessibility","240008664":"Full Banach mean values on countable groups","268606683":"Random Walks and Periodic Continued Fractions","250602997":"Finitely generated groups with M. Hall property","225777390":"Random Walks on Trees with Finitely Many Cone Types","228885753":"Growth and ergodicity of context-free languages","38360596":"Finite Range Random Walk on Free Groups and Homogeneous Trees","247330528":"Random Walks on Infinite Graphs and Groups -- a Survey on Selected topics","45881692":"Context-free pairs of groups I: Context-free pairs and graphs","38390251":"Context-free languages, groups, the theory of ends, second-order logic, tiling problems, cellular automata, and vector addition systems","221543703":"Random Tries","265565495":"Finitely generated groups with the M. Hall property","264951278":"Sur la loi des grands nombres et le rayon spectral d’une marche aléatoire","247678118":"Sur la loi des grands nombres et le rayon spectral d\u0027\u0027une marche aleatoire","225808924":"Return probabilities for random walk on a half-line","31122672":"Correction to \u0027Subgroups of Surface Groups are almost Geometric\u0027","44478088":"Non-negative matrices and markov chains / E. Seneta","227150181":"Singularities of the Green function of a random walk on a discrete group","242361757":"Introduction to Formal Language Theory","247666353":"Subgroups of Surface Groups are Almost Geometric","222468144":"Context-free languages and random walks on groups","222139978":"On the entropy of contex-free languages","265428651":"Groups, the Theory of ends, and context-free languages","2559708":"Analytic Combinatorics","222040643":"The theory of ends, pushdown automata, and second-order logic","220693528":"Analytic Combinatorics."},"citedIn":{"45881692":"Context-free pairs of groups I: Context-free pairs and graphs","51989563":"Groups, Graphs, Languages, Automata, Games and Second-order Monadic\nLogic","265762848":"Formulae and Asymptotics for Coefficients of Algebraic Functions","258841940":"Asymptotic Entropy of Random Walks on Regular Languages over a Finite Alphabet","266175908":"Random Walks on Co-Compact Fuchsian Groups","253272791":"Random Walk on a Co-Compact Fuchsian Group"},"index":964}