{"abs":"This paper introduces a hierarchical annealing algorithm which addresses the very large computational costs associated with simulated annealing for the synthesis of binary images. In real-world examples, the large configuration space of such models has led to the disappointing performance of annealing approaches. Our method essentially approaches different natural scales in the image separately and in a hierarchical manner. We demonstrate orders-of-magnitude improvement compared to existing results, and discuss the inherent computational difficulties encountered with these types of approaches.","title":"Hierarchical Annealing for Synthesis of Binary Images","id":225980396,"url":"https://www.researchgate.net/publication/225980396_Hierarchical_Annealing_for_Synthesis_of_Binary_Images","names":["Simon K. Alexander","Paul Fieguth","Marios A. Ioannidis","Edward R. Vrscay","Mathematical geosciences"],"references":{"200033900":"Equation of state calculations for fast computing machines","220183196":"“A Renormalisation Group Approach to Image Processing Problems”","238903096":"Complete analyticity for 2D Ising completed","226938371":"Time-Dependent Diffusion and Surface-Enhanced Relaxation in Stochastic Replicas of Porous Rock","221669680":"Stochastic Relaxation, Gibbs Distributions,and the Bayesian Restoration of Images","13277506":"Multigrid Monte Carlo method. Conceptual foundations","200105062":"L. Onsager, Crystal Statistics. I. A Two-Dimensional Model with an Order-Disorder Transition, Physical Review, 1944, 65, 117–149","223828956":"Fast simulated annealing","226343024":"Practical considerations in the application of simulated annealing to stochastic simulation","43441816":"Computation of the Linear Elastic Properties of Random Porous Materials with a Wide Variety of Microstructure","13326427":"Transport properties of heterogeneous materials derived from Gaussian random fields: Bounds and simulation","222475600":"Algorithm for computing the effective linear elastic properties of heterogeneous materials: Three-dimensional results for composites with equal phase Poisson ratios","13324639":"Structure-property correlations in model composite materials","13233373":"Synchrotron Computed Microtomography of Porous Media: Topology and Transports","287674812":"SESIMIRA - a new geological tool for 3D modelling of heterogeneous reservoirs","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","225310797":"Macroscopic Conductivity of Vugular Porous Media","263369106":"North Sea Oil \u0026 Gas Reservoirs - III","239361765":"Modelling two-phase equilibrium in three-dimensional porous microstructures","222995561":"Flow in Simulated Porous Media","239493346":"Dead leaves models: From space tessellation to random functions","231675108":"Simulated Annealing as a Method for the Determination of the Spatial Distribution of a Condensable Adsorbate in Mesoporous Materials","222404204":"Characterisation of irregular spatial structures by parallel sets and integral geometric measures","270443185":"Markov Chains: Gibbs Fields, Monte Carlo Simulation, and Queues","220728858":"Hierarchical Annealing for Random Image Synthesis","232128993":"Stochastic Geometry and Its Application","234039880":"Monte Carlo Methods In Geophysical Inverse Problems","234014515":"Fast simulated annealing","200105001":"Equation of State by Fast Computing Machines","7477051":"Stochastic Reconstruction of Particulate Media from Two-Dimensional Images","226610632":"One- and Two-Phase Permeabilities of Vugular Porous Media","13254529":"Scattering properties of a model bicontinuous structure with a well defined length scale","253535953":"The Formation Factor of Reconstructed Porous Media","227172805":"Stochastic simulation of categorical variably using a classification algorithm and simulated annealing","1950028":"Roberts AP: ‘Statistical reconstruction of three-dimensional porous media from two-dimensional images’, Phys. Rev. E, , 56","243478868":"Flow Phenomena in Rocks: From Continum Models to Fractals, Percolation, Cellular Automata and Simulated Anneling","221472111":"Parameterized Hierarchical Annealing for Scientific Models","4087779":"Hierarchical annealing for scientific models","28174541":"Statistical grid-based facies reconstruction and modelling for sedimentary bodies. Alluvial-palustrine and turbiditic examples. Geol Acta 5:199-230","235558376":"Reconstructing Random Media","223497399":"Permeability and Electrical Conductivity of Porous Media from 3D Stochastic Replicas of the Microstructure","226163869":"Electrical Resistivity Index in Multiphase Flow through Porous Media","222517035":"Impact of geometrical properties on permeability and fluid phase distribution in porous media","11925466":"Efficient reconstruction of multiphase morphologies from correlation functions","223388068":"Permeability of spatially correlated porous media","237878875":"Levitz, P. Off-lattice reconstruction of porous media: critical evaluation, geometrical confinement and molecular transport. Adv. Colloid Interf. Sci. 77, 71-106","31696277":"Markov Chains : Gibbs Fields, Monte Carlo Simulation, and Queues / P. Brémaud.","8560891":"Angstrom-to-millimeter characterization of sedimentary rock microstructure","236331880":"Random Heterogeneous Media: Microstructure and Macroscopic Properties","226368513":"Electrical Conductivity and Percolation Aspects of Statistically Homogeneous Porous Media","3191631":"Renormalization group approach to image processing problems"},"citedIn":{"222654452":"Statistical fusion of two-scale images of porous media","224217791":"Synthesis of Remote Sensing Label Fields Using a Tree-Structured Hierarchical Model","268425802":"Hidden Hierarchical Markov Fields for Image Modeling","260441875":"Stable-phase method for hierarchical annealing in the reconstruction of porous media images","235514161":"Microstructural degeneracy associated with a two-point correlation function and its information content","221472701":"Hierarchical Sampling with Constraints","233941550":"Frozen-State Hierarchical Annealing"},"index":970}