{"abs":"To approximate the Pareto front, most existing multiobjective evolutionary algorithms store the non-dominated solutions found so far in the population or in an external archive during the search. Such algorithms often require a high degree of diversity of the stored solutions and only a limited number of solutions can be achieved. By contrast, model-based algorithms can alleviate the requirement on solution diversity and in principle, as many solutions as needed can be generated. This paper proposes a new model-based method for representing and searching non-dominated solutions. The main idea is to construct Gaussian process based inverse models that map all found non-dominated solutions from the objective space to the decision space. These inverse models are then used to create offspring by sampling the objective space. To facilitate inverse modeling, the multivariate inverse function is decomposed into a group of univariate functions, where the number of inverse models is reduced using a random grouping technique. Extensive empirical simulations demonstrate that the proposed algorithm exhibits robust search performance on a variety of medium to high dimensional multiobjective optimization test problems. Additional non-dominated solutions are generated a posteriori using the constructed models to increase the density of solutions in the preferred regions at a low computational cost.","title":"A Multiobjective Evolutionary Algorithm Using Gaussian Process-Based Inverse Modeling","id":270960934,"url":"https://www.researchgate.net/publication/270960934_A_Multiobjective_Evolutionary_Algorithm_Using_Gaussian_Process-Based_Inverse_Modeling","names":["Ran Cheng","Yaochu Jin","Kaname Narukawa","Bernhard Sendhoff","IEEE Transactions on Evolutionary Computation"],"references":{"3949503":"Scalable multi-objective optimization test problems","220380974":"Multiobjective optimization problems with complicated Pareto sets, MOEA/D and NSGA-II","3421242":"A Multi-objective Genetic Local Search Algorithm and Its Application to Flowshop Scheduling","221228449":"MOPED: A Multi-objective Parzen-Based Estimation of Distribution Algorithm for Continuous Problems","242367203":"Flexible and efficient Gaussian process models for machine learning","256442073":"Hyper-heuristics: A survey of the state of the art","226116715":"Multi-Objective Optimization","261189763":"A Gaussian Process Surrogate Model Assisted Evolutionary Algorithm for Medium Scale Expensive Optimization Problems","220499767":"Dimension Reduction by Local Principal Component Analysis","221008825":"Improving hypervolume-based multiobjective evolutionary algorithms by using objective reduction methods","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","261165962":"A multiobjective evolutionary algorithm based on decomposition and probability model","224211267":"Decomposition-Based Memetic Algorithm for Multiobjective Capacitated Arc Routing Problem","2240388":"Thiele, L.: Multiobjective Evolutionary Algorithms: A Comparative Case Study and the Strength Pareto Approach. IEEE Trans. on Evolutionary Computation 3, 257-271","225478614":"Multiobjective Estimation of Distribution Algorithms","221228424":"The Hypervolume Indicator Revisited: On the Design of Pareto-compliant Indicators Via Weighted Integration.","260498593":"A Survey on Multiobjective Evolutionary Algorithms for the Solution of the Portfolio Optimization Problem and Other Finance and Economics Applications","230712168":"Multiple Populations for Multiple Objectives: A Coevolutionary Technique for Solving Multiobjective Optimization Problems","220701837":"The Pareto Envelop-based Selection Algorithm for Multi-Objective Optimization","222030993":"SMS-EMOA: multiobjective selection based on dominated hypervolume. Eur J Oper Res","31170934":"Finding Zeros by Multilevel Subdivision Techniques","2528520":"Multi-Objective Mixture-based Iterated Density Estimation Evolutionary Algorithms","262236305":"The naive MIDEA: a baseline multi-objective EA","216457303":"Indicator-Based Selection in Multiobjective Search","216301392":"Multiple Objective Optimization with Vector Evaluated Genetic Algorithms","216301009":"Estimation Distribution Algorithms: A New Tool for Evolutionary Computation","3419010":"RM-MEDA: A Regularity Model-Based Multiobjective Estimation of Distribution Algorithm","3418888":"A review of multiobjective test problems and a scalable test problem toolkit. IEEE Trans Evol Comput","224330083":"Evolutionary Many-Objective Optimization: A Short Review","216301146":"Lecture Notes in Computer Science","216457304":"Lecture Notes in Computer Science","221228395":"Covering Pareto Sets by Multilevel Evolutionary Subdivision Techniques","220743532":"Solving complex high-dimensional problems with the multi-objective neural estimation of distribution algorithm","3418736":"Thierens, D.: The balance between proximity and diversity in multiobjective evolutionary algorithms. IEEE Transactions on Evolutionary Computation 7(2), 174-188","41781559":"Gaussian Process for Machine Learning","255485424":"A Computational Study of Representations in Genetic Programming to Evolve Dispatching Rules for the Job Shop Scheduling Problem","227065795":"Jin, Y.: A Comprehensive Survey of Fitness Approximation in Evolutionary Computation. Soft Computing 9(1), 3-12","264427657":"An Evolutionary Many-Objective Optimization Algorithm Using Reference-Point Based Nondominated Sorting Approach, Part II: Handling Constraints and Extending to an Adaptive Approach","2837095":"On the Dynamics of Evolutionary Multi-Objective Optimisation","3575291":"A Niched Pareto Genetic Algorithm for Multi-Objective Optimization","262605034":"Decomposition of a Multiobjective Optimization Problem Into a Number of Simple Multiobjective Subproblems","260523722":"Active Learning of Pareto Fronts","242919220":"Deb, K.: Multiobjective Optimization Using Nondominated Sorting in Genetic Algorithms. Evolutionary Computation 2(3), 221-248","220313199":"Large scale evolutionary optimization using cooperative coevolution","4090095":"Voronoi-based estimation of distribution algorithm for multi-objective optimization","216457268":"Indicator-based evolutionary algorithm with hypervolume approximation by achievement scalarizing functions","266476598":"Multi-Objective Optimization Using Evolutionary Algorithms. Wiley, New York","257635855":"A regularity model-based multiobjective estimation of distribution algorithm with reducing redundant cluster operator","220514418":"Surrogate-assisted evolutionary computation: Recent advances and future challenges","267482407":"Experiments with Mixtures: DESIGNS, Models and the Analysis of Mixture Data","220514419":"Multi-objective evolutionary algorithms: a survey of the state of the art. Swarm Evol Comput 1:32-49","4201752":"A model-based evolutionary algorithm for Bi-objective optimization","3418989":"MOEA/D: A Multiobjective Evolutionary Algorithm Based on Decomposition","4074983":"Connectedness, regularity and the success of local search in evolutionary multi-objective optimization","220381049":"A Fast Way of Calculating Exact Hypervolumes","2386811":"SPEA2: Improving the Strength Pareto Evolutionary Algorithm","2918861":"An Empirical Study on the Effect of Mating Restriction on the Search Ability of EMO Algorithms","3418839":"Evolutionary Optimization in Uncertain Environments—A Survey","222405031":"Jaszkiewicz, A.: Genetic Local Search for Multi-Objective Combinatorial Optimization. European Journal of Operational Research 137, 50-71","260621792":"A Review of the Application of Multiobjective Evolutionary Fuzzy Systems: Current Status and Further Directions","224242870":"Yao, X.: Cooperatively coevolving particle swarms for large scale optimization. IEEE Trans. Evol. Comput. 16(2), 210-224","224579855":"On the Complexity of Computing the Hypervolume Indicator","220310732":"Achieving balance between proximity and diversity in multi-objective evolutionary algorithm","261045345":"An Energy-Based Sampling Technique for Multi-Objective Restricted Boltzmann Machine","233529605":"Increasing the Density of Available Pareto Optimal Solutions","2504265":"Adapting Weighted Aggregation for Multiobjective Evolution Strategies","220885593":"Genetic Algorithms for Multiobjective Optimization: FormulationDiscussion and Generalization.","227242104":"Price, K.: Differential Evolution - A Simple and Efficient Heuristic for Global Optimization Over Continuous Spaces. Journal of Global Optimization 11(4), 341-359","233885573":"Dynamic weighted aggregation for evolutionary multi-objective optimization: Why does it work and how?","264387256":"Multiobjective Estimation of Distribution Algorithm Based on Joint Modeling of Objectives and Variables","2526557":"A fast and elitist multi-objective genetic algorithm: NSGA II"},"citedIn":{"289825861":"A Reference Vector Guided Evolutionary Algorithm for Many-Objective Optimization","270961021":"Adaptive Reference Vector Generation for Inverse Model Based Evolutionary Multiobjective Optimization with Degenerate and Disconnected Pareto Fronts","280916755":"Multi-objective ensemble generation"},"index":972}