{"abs":"The effect of a Gaussian process parameter known as the nugget, on the development of computer model emulators is investigated. The presence of the nugget results in an emulator that does not interpolate the data and attaches a non-zero uncertainty bound around them. The limits of this approximation are investigated theoretically, and it is shown that they can be as large as those of a least squares model with the same regression functions as the emulator, regardless of the nugget’s value. The likelihood of the correlation function parameters is also studied and two mode types are identified. Type I modes are characterised by an approximation error that is a function of the nugget and can therefore become arbitrarily small, effectively yielding an interpolating emulator. Type II modes result in emulators with a constant approximation error. Apart from a theoretical investigation of the limits of the approximation error, a practical method for automatically imposing restrictions on its extent is introduced. This is achieved by means of a penalty term that is added to the likelihood function, and controls the amount of unexplainable variability in the computer model. The main findings are illustrated on data from an Energy Balance climate model.","title":"The effect of the nugget on Gaussian process emulators of computer models","id":257016708,"url":"https://www.researchgate.net/publication/257016708_The_effect_of_the_nugget_on_Gaussian_process_emulators_of_computer_models","names":["Ioannis Andrianakis","Peter Challenor","Computational Statistics \u0026 Data Analysis"],"references":{"236012721":"Energy Balance Climate Models","45904702":"A Computationally Stable Approach to Gaussian Process Interpolation of\nDeterministic Computer Simulation Data","2609572":"Monte Carlo Implementation of Gaussian Process Models for Bayesian Regression and Classification","4772045":"Bayesian Calibration of Computer Models","4743918":"Objective Bayesian Analysis of Spatially Correlated Data","261001961":"Numerical Recipes in C—The Art of Scientific Computing","227615641":"Probabilistic sensitivity analysis of complex models: A Bayesian approach","239667584":"A Framework for Validation of Computer Models","2319535":"Objective Bayesian Analysis of Spatially Correlated Data","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","31303344":"Predicting the Output from a Complex Computer Code When Fast Approximations Are Available","45919505":"The Role of the Nugget Term in the Gaussian Process Method","237747967":"A new class of semiparametric semivariogram and nugget estimators","229881286":"Objective Bayesian analysis of spatial data with measurement error","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","226789843":"On the condition number of covariance matrices in kriging, estimation, and simulation of random fields","45931398":"Cases for the Nugget in modelling computer experiments","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","37405927":"Numerical Recipes in FORTM: The Art of Scientific Computing","228339939":"Diagnostics for Gaussian Process Emulators"},"citedIn":{"265258439":"Evolving Bayesian Emulators for Structured Chaotic Time Series, with Application to Large Climate Models","268752136":"On the condition number anomaly of Gaussian correlation matrices","257592087":"An $$\\mathcal O (N \\log N)$$ O ( N log N ) Fast Direct Solver for Partial Hierarchically Semi-Separable Matrices","282400455":"Posterior Belief Assessment: Extracting Meaningful Subjective Judgements from Bayesian Analyses with Complex Statistical Models","266376755":"Sequential Design with Mutual Information for Computer Experiments (MICE): Emulation of a Tsunami Model","266562928":"Practical options for selecting data-driven or physics-based prognostics algorithms with reviews","281874456":"Reduced dimensional Gaussian process emulators of parametrized partial differential equations basedon Isomap","262961780":"Experimental design for the validation of kriging metamodels in computer experiments","263026677":"Global sensitivity analysis of Indian Monsoon during the Pleistocene","271511799":"Computer emulation with non-stationary Gaussian processes","265252310":"Speeding up neighborhood search in local Gaussian process prediction","270647102":"Bayesian History Matching of Complex Infectious Disease Models Using Emulation: A Tutorial and a Case Study on HIV in Uganda","270454589":"Variable Selection in Bayesian Semiparametric Regression Models","271511557":"Computer emulation with non-stationary Gaussian processes","265644734":"Optimal designs for Gaussian process models |via spectral decomposition","274142394":"Exploratory ensemble designs for environmental models using k-extended Latin Hypercubes","256070253":"Computer emulation with non-stationary Gaussian processes","260993313":"Calibration of Complex Computer Simulators using Likelihood Emulation","269280638":"Asymptotic analysis of covariance parameter estimation for Gaussian processes in the misspecified case","279309842":"Gaussian process hyper-parameter estimation using parallel asymptotically independent Markov sampling","234168780":"Cross Validation and Maximum Likelihood estimation of hyper-parameters of Gaussian processes with model misspecification","257391020":"Methodology for global sensitivity analysis of consequence models","258699984":"Estimating Multiparameter Partial Expected Value of Perfect Information from a Probabilistic Sensitivity Analysis Sample: A Nonparametric Regression Approach","269520620":"Convex Combination of Gaussian Processes for Bayesian Analysis of Deterministic Computer Experiments","264129728":"Global sensitivity analysis of the climate-vegetation system to astronomical forcing: An emulator-based approach","280883266":"Global sensitivity analysis of the climate–vegetation system to astronomical forcing: an emulator-based approach"},"index":976}