{"abs":"This paper addresses the use of experimental data for calibrating a computer model and improving its predictions of the underlying physical system. A global statistical approach is proposed in which the bias between the computer model and the physical system is modeled as a realization of a Gaussian process. The application of classical statistical inference to this statistical model yields a rigorous method for calibrating the computer model and for adding to its predictions a statistical correction based on experimental data. This statistical correction can substantially improve the calibrated computer model for predicting the physical system on new experimental conditions. Furthermore, a quantification of the uncertainty of this prediction is provided. Physical expertise on the calibration parameters can also be taken into account in a Bayesian framework. Finally, the method is applied to the thermal-hydraulic code FLICA 4, in a single phase friction model framework. It allows to improve the predictions of the thermal-hydraulic code FLICA 4 significantly.","title":"Calibration And Improved Prediction Of Computer Models By Universal Kriging","id":234140352,"url":"https://www.researchgate.net/publication/234140352_Calibration_And_Improved_Prediction_Of_Computer_Models_By_Universal_Kriging","names":["François Bachoc","Guillaume Bois","Josselin Garnier","Jean-Marc Martinez","Nuclear science and engineering: the journal of the American Nuclear Society"],"references":{"51957151":"Bayesian Optimization Using Sequential Monte Carlo","29621892":"Tapenade 2.1 user\u0027s guide","239667584":"A Framework for Validation of Computer Models","41781559":"Gaussian Process for Machine Learning","228780015":"Efficient Emulators for Multivariate Deterministic Functions","243778376":"Bayesian Inference for Variance Components Using Only Error Contrasts","229896035":"Kriging and cross‐validation for massive spatial data","277919301":"Best-Estimate Model Calibration and Prediction Through Experimental Data Assimilation - II: Application to a Blowdown Benchmark Experiment","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","216301381":"The Design and Analysis Computer Experiments","23630794":"The Asymptotic Distribution of REML Estimators","233169217":"Bayesian Validation of Computer Models","274336638":"Best-Estimate Model Calibration and Prediction Through Experimental Data Assimilation - I: Mathematical Framework","2444232":"Bayesian Calibration of Complex Computer Models","220411340":"Combining Field Data and Computer Simulations for Calibration and Prediction","226970613":"Cross validation of Kriging in a unique neighborhood","223935980":"FLICA-4: A three-dimensional two-phase flow computer code with advanced numerical methods for nuclear applications","26501985":"Thermal-Hydraulic System Codes in Nulcear Reactor Safety and Qualification Procedures","228980306":"Gradient-Enhanced Universal Kriging for Uncertainty Propagation","11977806":"Predictive Approaches for Choosing Hyperparameters in Gaussian Processes","221995968":"The Elements of Statistical Learning. Springer-Verlag, New York","224840090":"Interpolation of Spatial Data: Some Theory For Kriging","242389519":"Factorial Sampling Plans for Preliminary Computational Experiments","31354848":"Maximum Likelihood Estimation of Models for Residual Covariance in Spatial Regression","4749622":"An efficient methodology for modeling complex computer codes with Gaussian processes","283147102":"Evaluation and propagation of the 239Pu fission cross-section uncertainties using a Monte Carlo technique","51992230":"Verification of Computer Codes in Computational Science and Engineering"},"citedIn":{"269280638":"Asymptotic analysis of covariance parameter estimation for Gaussian processes in the misspecified case","272350067":"Polynomial-Chaos-Based Kriging","272359280":"Polynomial-Chaos-based Kriging","279223695":"Validation metric of degradation model with dynamic performance"},"index":977}