{"abs":"This paper describes the development and analysis of finite-volume methods for the Landau-Lifshitz Navier-Stokes (LLNS) equations and related stochastic partial differential equations in fluid dynamics. The LLNS equations incorporate thermal fluctuations into macroscopic hydrodynamics by the addition of white-noise fluxes whose magnitudes are set by a fluctuation-dissipation relation. Originally derived for equilibrium fluctuations, the LLNS equations have also been shown to be accurate for non-equilibrium systems. Previous studies of numerical methods for the LLNS equations focused primarily on measuring variances and correlations computed at equilibrium and for selected non-equilibrium flows. In this paper, we introduce a more systematic approach based on studying discrete equilibrium structure factors for a broad class of explicit linear finite-volume schemes. This new approach provides a better characterization of the accuracy of a spatio-temporal discretization as a function of wavenumber and frequency, allowing us to distinguish between behavior at long wavelengths, where accuracy is a prime concern, and short wavelengths, where stability concerns are of greater importance. We use this analysis to develop a specialized third-order Runge Kutta scheme that minimizes the temporal integration error in the discrete structure factor at long wavelengths for the one-dimensional linearized LLNS equations. Together with a novel method for discretizing the stochastic stress tensor in dimension larger than one, our improved temporal integrator yields a scheme for the three-dimensional equations that satisfies a discrete fluctuation-dissipation balance for small time steps and is also sufficiently accurate even for time steps close to the stability limit. Comment: Significant revisions from v1 including a new 3D method. Now 50 pages, submitted to CAMCOS","title":"On the Accuracy of Finite-Volume Schemes for Fluctuating Hydrodynamics","id":45856557,"url":"https://www.researchgate.net/publication/45856557_On_the_Accuracy_of_Finite-Volume_Schemes_for_Fluctuating_Hydrodynamics","names":["Aleksandar Donev","Eric Vanden-Eijnden","Alejandro L. Garcia","John Bell","Communications in Applied Mathematics and Computational Science"],"references":{"226640903":"The Numerical Approximation of Stochastic Partial Differential Equations","2215972":"Weak order for the discretization of the stochastic heat equation","13277506":"Multigrid Monte Carlo method. Conceptual foundations","11382820":"Brownian ratchets: Darwin\u0027s motors","220207017":"Spatially adaptive stochastic numerical methods for intrinsic fluctuations in reaction-diffusion systems","228858670":"High-order I-stable centered difference schemes for viscous compressible flows","260574979":"The Direct Simulation Monte Carlo Method","24265954":"Bridging fluctuating hydrodynamics and molecular dynamics simulations of fluids","6358896":"The importance of fluctuations in fluid mixing","1942028":"Fluctuating lattice Boltzmann","252135956":"Computational uctuating uid dynamics","45881384":"Stochastic Eulerian-Lagrangian Methods for Fluid-Structure Interactions with Thermal Fluctuations and Shear Boundary Conditions","242084475":"Algorithm Refinement for Fluctuating Hydrodynamics","253525252":"“Hydrodynamic Fluctuations Near the Convection Threshold,”","5915585":"Embedding molecular dynamics within fluctuating hydrodynamics in multiscale simulations of liquids","248864718":"Course of Theoretical Physics Vol","9066794":"Sensitivity of explosion to departure from partial equilibrium","1870910":"Stochastic differential equations for non-linear hydrodynamics","13236714":"Short-time motion of colloidal particles: Numerical simulation via a fluctuating Lattice–Boltzmann equation","1874616":"Brownian motors","252716340":"Handbook of Stochastic Methods: For Physics, Chemistry and the Natural Sciences","13254754":"Fluctuating hydrodynamics in a dilute gas","8463789":"Hybrid method for simulating front propagation in reaction-diffusion systems","222653044":"A Stochastic Immersed Boundary Method for Fluid-Structure Interactions at Microscopic Length Scales","1829674":"Spurious diffusion in particle simulations of the Kolmogorov flow","6366928":"Hybrid method coupling fluctuating hydrodynamics and molecular dynamics for the simulation of macromolecules","215514347":"A Practical Guide to Pseudospectral Method","24288196":"Total Variation Diminishing Runge-Kutta Schemes.","222494202":"A Family of High Order Finite Difference Schemes with Good Spectral Resolution","227134641":"Microscopic models of hydrodynamic behavior","226773949":"Fluctuating hydrodynamics and principal oscillation pattern analysis","2971158":"Handbook of stochastic methods for physics, chemistry and the natural sciences","267187154":"Numerical Solution of the Navier–Stokes Equations","268887111":"Kolmogorov equations for stochastic PDEs","6448171":"Universality Crossover of the Pinch-Off Shape Profiles of Collapsing Liquid Nanobridges in Vacuum and Gaseous Environments","220385896":"A Hybrid Particle-Continuum Method for Hydrodynamics of Complex Fluids","228352087":"On the foundations of the stochastic immersed boundary method","2164460":"Thermally Induced Fluctuations Below the Onset of Rayleigh-B\\\u0027enard Convection","6449581":"Fluctuating hydrodynamic modeling of fluids at the nanoscale","230946579":"The Fluctuation-dissipation theorem","222488464":"Lele, S.K.: Compact Finite Difference Schemes with Spectral-like Resolution. Journal of Computational Physics 103(1), 16-42","222469649":"A second-order projection method for the Navier–Stokes equations","51992522":"Numerical Calculation of Time-Dependent Viscous Incompressible Flow of Fluid With Free Surface","13230879":"Thermally Induced Fluctuations below the Onset of Rayleigh-Bénard Convection.","243360854":"Direct numerical simulation of the Brownian motion of particles by using fluctuating hydrodynamic equations","246797805":"Mechanics: Volume I of Course of Theoretical Physics","12372836":"Formation, Stability, and Breakup of Nanojets","252385106":"An adaptive projection method for the incompressible Navier-Stokes equations","8634712":"Nanohydrodynamics simulations: An atomistic view of the Rayleigh-Taylor instability","222458143":"Matching numerical simulations to continuum field theories: A lattice renormalization study","231851535":"Compressibility effects in the hydrodynamic theory of Brownian motion","226412190":"Numerical integration of the fluctuating hydrodynamic equations","222294751":"The Piecewise Parabolic Method (PPM) for Gas-Dynamical Simulations. JCP, 54","11198152":"Dynamics of Liquid Nanojets","8128537":"Rectification of thermal fluctuations in ideal gases","5915580":"Statistical mechanics of the fluctuating Lattice Boltzmann equation","12226003":"Hydrodynamic fluctuations in the Kolmogorov flow: Nonlinear regime","45848400":"Computational fluctuating fluid dynamics","13381922":"Dynamic structure factor in a nonequilibrium fluid: A molecular-dynamics approach","23464073":"Nonreflecting boundaries for ultrasound in fluctuating hydrodynamics of open systems","8268303":"Microscopic Analysis of a Thermal Brownian Motor","227511166":"Non-equilibrium behavior of equilibrium reservoirs in molecular simulations","235631609":"The fluctuation-dissipation theorem","223699238":"Time dependent correlation functions and mode-mode coupling theories. Physics Reports, 19, 63-139","6160941":"Numerical methods for the stochastic Landau-Lifshitz Navier-Stokes equations","11397848":"Hydrodynamic fluctuations in the Kolmogorov flow: Linear regime","262162135":"A Numerical Method for the Incompressible Navier–Stokes Equations Based on An Approximate Projection","222528187":"Algorithm refinement for the stochastic Burgers’ equation","232977439":"Fluctuation-induced and Nonequilibrium-induced Bifurcations in a Thermochemical System","13231543":"Direct Measurement of Hydrodynamic Fluctuations in a Binary Mixture"},"citedIn":{"233836148":"Temporal Integrators for Fluctuating Hydrodynamics","269721239":"Smoothed particle hydrodynamics model for Landau-Lifshitz-Navier-Stokes and advection-diffusion equations","230593849":"Fluctuating hydrodynamics for multiscale modeling and simulation: Energy and heat transfer in molecular fluids","258840039":"Spatially Adaptive Stochastic Methods for Fluid-Structure Interactions Subject to Thermal Fluctuations in Domains with Complex Geometries","269877023":"Direct control of the small-scale energy balance in 2D fluid dynamics","269876255":"Low Mach Number Fluctuating Hydrodynamics of Multispecies Liquid Mixtures","51214470":"Diffusive Transport by Thermal Velocity Fluctuations","262949152":"A reversible mesoscopic model of diffusion in liquids: From giant fluctuations to Fick\u0027s law","233980258":"Inertial coupling for point particle fluctuating hydrodynamics","249317706":"Fluctuating ideal-gas lattice Boltzmann method with fluctuation dissipation theorem for nonvanishing velocities","259090918":"Time asynchronous relative dimension in space method for multi-scale problems in fluid dynamics","264898514":"A new non-linear two-time-level Central Leapfrog scheme in staggered conservation-flux variables for fluctuating hydrodynamics equations with GPU implementation","267338870":"Finite element discretization of non-linear diffusion equations with thermal fluctuations","234941210":"Hydrodynamic fluctuations in a particle‐continuum hybrid for complex fluids","253305989":"Enhancement of Diffusive Transport by Nonequilibrium Thermal Fluctuations","51676849":"Coarse-graining Brownian motion: From particles to a discrete diffusion equation","51676850":"Generalized Langevin dynamics of a nanoparticle using a finite element approach: Thermostating with correlated noise","264276585":"Modeling Multi-phase Flow using Fluctuating Hydrodynamics","51537336":"Fluctuating hydrodynamics for multiscale simulation of inhomogeneous fluids: Mapping all-atom molecular dynamics to capillary waves","277079721":"Modeling nanoscale hydrodynamics by smoothed dissipative particle dynamics","244989878":"Minimal model for acoustic forces on Brownian particles","267214659":"Fluctuating Multicomponent Lattice Boltzmann Model","270475568":"Energy-conserving dissipative particle dynamics for mesoscopic heat transfer simulations","259510470":"Incorporating shear into stochastic Eulerian–Lagrangian methods for rheological studies of complex fluids and soft materials","260394039":"Brownian dynamics of immersed bodies by a meshfree particle method for incompressible fluctuating hydrodynamics","51643822":"Nanoparticle Brownian motion and hydrodynamic interactions in the presence of flow fields","233885771":"Low Mach Number Fluctuating Hydrodynamics of Diffusively Mixing Fluids","45865862":"A Thermodynamically-Consistent Non-Ideal Stochastic Hard-Sphere Fluid","47338351":"Cross Correlators and Galilean Invariance in Fluctuating Ideal Gas Lattice Boltzmann Simulations","290211341":"Brownian dynamics of rigid particles in an incompressible fluctuating fluid by a meshfree method","262945000":"New two-level leapfrog scheme for modeling the stochastic Landau-Lifshitz equations","51933151":"Staggered Schemes for Fluctuating Hydrodynamics","220385896":"A Hybrid Particle-Continuum Method for Hydrodynamics of Complex Fluids","230620915":"A hybrid formalism combining fluctuating hydrodynamics and generalized Langevin dynamics for the simulation of nanoparticle thermal motion in an incompressible fluid medium","249321868":"Temporal Multiscale Approach for Nanocarrier Motion with Simultaneous Adhesion and Hydrodynamic Interactions in Targeted Drug Delivery","258573880":"Fluctuating Hydrodynamics and Direct Simulation Monte Carlo","257430414":"A dynamic mesh refinement technique for Lattice Boltzmann simulations on octree-like grids","258065336":"Livescu D.: Numerical simulations of two-fluid turbulent mixing at large density ratios and applications to the Rayleigh-Taylor instability. Philos. Trans. R. Soc. A 371, 20120185","259996698":"Hybrid molecular–continuum methods: From prototypes to coupling software","281576365":"Coupling a nano-particle with isothermal fluctuating hydrodynamics: Coarse-graining from microscopic to mesoscopic dynamics","241626381":"Motors and drives for improving energy efficiency","278344444":"Fluctuating hydrodynamics of multi-species reactive mixtures","49837589":"Fluctuating lattice-Boltzmann model for complex fluids","258573574":"Computer Experiments on the Onset of Turbulence","222650037":"Stochastic Eulerian Lagrangian Methods for Fluid-Structure Interactions with Thermal Fluctuations","260441840":"Fluctuating hydrodynamics of multispecies reactive mixtures","259718662":"Staggered Schemes for Fluctuating Hydrodynamics","278403556":"A Hybrid Molecular Dynamics/Fluctuating Hydrodynamics Method for Modelling Liquids at Multiple Scales in Space and Time","257504292":"A SPH-based particle model for computational microrheology","40755856":"Modeling the nanoscale viscoelasticity of fluids by bridging non-Markovian fluctuating hydrodynamics and molecular dynamics simulations"},"index":979}