{"abs":"The data augmentation (DA) algorithm is a simple and powerful tool in statistical computing. In this note basic information theory is used to prove a nontrivial convergence theorem for the DA algorithm.","title":"A Bit of Information Theory, and the Data Augmentation Algorithm Converges","id":224342213,"url":"https://www.researchgate.net/publication/224342213_A_Bit_of_Information_Theory_and_the_Data_Augmentation_Algorithm_Converges","names":["Yaming Yu","IEEE Transactions on Information Theory"],"references":{"261662232":"Elements of Information Theory","242503284":"The Calculation of Posterior Distributions by Data Augmentation: Rejoinder","220220640":"Information Theory and Statistics: A Tutorial","265978139":"Information geometry and alternating minimization procedures","224910629":"Sampling-Based Approaches to Calculate Marginal Densities","221669680":"Stochastic Relaxation, Gibbs Distributions,and the Bayesian Restoration of Images","256476485":"Maximum Likelihood from Incomplete Data Via the EM Algorithm (with discussion). J. Roy","38362523":"I-Divergence Geometry of Probability Distributions and Minimization Problems. Annals of Probability, Vol. 3, No. 1, pp. 146-158","221995817":"Maximum Likelihood from Incomplete Data Via EM Algorithm","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","3862190":"Limits of information, Markov chains, and projection","244475332":"On the Convergence of Successive Substitution Sampling","3084724":"Information projections revisited","247931354":"Elements of information theory (2. ed.)","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","247470302":"Seeking Efficient Data Augmentation Schemes via Conditional and Marginal Augmentation","38357609":"Markov Chains for Exploring Posterior Distributions","227664115":"The EM Algorithm—An Old Folk Song Sung to a Fast New Tune (with Discussion)","245804736":"Correlation structure and convergence rate of the Gibbs sampler with various scans","38357614":"Rejoinder: Markov Chains for Exploring Posterior Distributions","247779875":"The Art of Data Augmentation","226182428":"Convergence of Markov Chains in Information Divergence","224773133":"Elements of Information Theory. Wiley","267697944":"Espousing Classical Statistics with Modern Computation: Sufficiency, Ancillarity and An Interweaving Generation of MCMC","271512963":"The EM algorithm - An old folk-song sung to a fast new tune","238307227":"Real Analysis Third edition","268678715":"An information-theoretical proof of limit theorems for reversible Markov processes"},"citedIn":{"45851823":"Monotonic convergence of a general algorithm for computing optimal designs. Ann. Statist. 38(3), 1593-1606"},"index":981}