{"abs":"Let U be a given function defined on R^d and \\pi(x) be a density function proportional to \\exp -U(x). The following diffusion X(t) is often used to sample from \\pi(x), dX(t)\u003d-\\nabla U(X(t)) dt+\\sqrt2 dW(t),\\qquad X(0)\u003dx_0. To accelerate the convergence, a family of diffusions with \\pi(x) as their common equilibrium is considered, dX(t)\u003d\\bigl(-\\nabla U(X(t))+C(X(t))\\bigr) dt+\\sqrt2 dW(t),\\qquad X(0)\u003dx_0. Let L_C be the corresponding infinitesimal generator. The spectral gap of L_C in L^2(\\pi) (\\lambda (C)), and the convergence exponent of X(t) to \\pi in variational norm (\\rho(C)), are used to describe the convergence rate, where \\lambda(C)\u003d Sup{real part of \\mu\\dvtx\\mu is in the spectrum of L_C, \\mu is not zero}, {-2.8cm}\\rho(C) \u003d Inf\\biggl{\\rho\\dvtx\\int | p(t,x,y) -\\pi(y)| dy \\le g(x) e^{\\rho t}\\biggr}.Roughly speaking, L_C is a perturbation of the self-adjoint L_0 by an antisymmetric operator C\\cdot\\nabla, where C is weighted divergence free. We prove that \\lambda (C)\\le \\lambda (0) and equality holds only in some rare situations. Furthermore, \\rho(C)\\le \\lambda (C) and equality holds for C\u003d0. In other words, adding an extra drift, C(x), accelerates convergence. Related problems are also discussed.","title":"Accelerating diffusions. Ann Appl Prob","id":2119719,"url":"https://www.researchgate.net/publication/2119719_Accelerating_diffusions_Ann_Appl_Prob","names":["Chii-Ruey Hwang","Shu-Yin Hwang-Ma","Shuenn-Jyi Sheu","The Annals of Applied Probability"],"references":{"265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","22861727":"[Functional analysis].","234816156":"One-Parameter Semigroups of Positive Operators","38348782":"On the convergence of the Markov chain simulation method. Ann. Statist., 24: 69-100","2106699":"Ergodic convergence rates of Markov processes--eigenvalues, inequalities and ergodic theory","230801964":"Perturbation Theory of Linear Operators","23630599":"Comparing sweep strategies for stochastic relaxation","243765672":"Strategies for improving MCMC","246251933":"From Markov Chains to Non-Equilibrium Particle Systems","235324276":"Existence of the spectral\ngap for elliptic operators","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","3315937":"Conditional-mean estimation via jump-diffusion processes in multiple target tracking/recognition","38362909":"Accelerating Gaussian Diffusions","243785073":"Inferences on transformation groups generating patterns on rigid motions","227585608":"Pointwise estimates and quasilinear parabolic equations","2702129":"(Nonsymmetric) Dirichlet Operators On L\u0026sup1;: Existence, Uniqueness And Associated Markov Processes","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","2643316":"On Regularity Of Transition Probabilities And Invariant Measures Of Singular Diffusions Under Minimal Conditions","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","247028007":"On the average-case analysis of dynamic Monte Carlo schemes"},"citedIn":{"257013104":"Accelerating Brownian motion on NN-torus","279968686":"Generalisation of the Eyring-Kramers transition rate formula to irreversible diffusion processes","263237778":"Variance reduction for diffusions","278323797":"Heat kernels for generalized Ornstein–Uhlenbeck operators","45919028":"Some Remarks on Weighted Logarithmic Sobolev Inequality","233835992":"Optimal Non-reversible Linear Drift for the Convergence to Equilibrium of a Diffusion","266004722":"Accelerating reversible Markov chains","266376938":"Variance reduction for irreversible Langevin samplers and diffusion on graphs","278733910":"Variance Reduction using Nonreversible Langevin Samplers","256607463":"Violation of detailed balance accelerates relaxation","258753506":"Geometrically Constructed Markov Chain Monte Carlo Study of Quantum Spin-phonon Complex Systems","261289218":"Irreversible Langevin samplers and variance reduction: A large deviations approach","228565326":"Large Time Behavior of Solutions of Hamilton--Jacobi--Bellman Equations with Quadratic Nonlinearity in Gradients","228095945":"General Construction of Irreversible Kernel in Markov Chain Monte Carlo","264969176":"On the Optimal Transition Matrix for Markov Chain Monte Carlo Sampling","242441319":"Accelerating Monte Carlo Markov processes","51959886":"Basic Estimates of Stability Rate for One-Dimensional Diffusions","51917359":"A trajectorial interpretation of the dissipations of entropy and Fisher information for stochastic differential equations","257367631":"On the convexity of the entropy along entropic interpolations","243080864":"The behavior of the spectral gap under growing drift","263032816":"Attaining the Optimal Gaussian Diffusion Acceleration"},"index":982}