{"abs":"Iterative imputation, in which variables are imputed one at a time each given a model predicting from all the others, is a popular technique that can be convenient and flexible, as it replaces a potentially difficult multivariate modeling problem with relatively simple univariate regressions. In this paper, we begin to characterize the stationary distributions of iterative imputations and their statistical properties. More precisely, when the conditional models are compatible (defined in the text), we give a set of sufficient conditions under which the imputation distribution converges in total variation to the posterior distribution of a Bayesian model. When the conditional models are incompatible but are valid, we show that the combined imputation estimator is consistent.","title":"On the Stationary Distribution of Iterative Imputations","id":48167060,"url":"https://www.researchgate.net/publication/48167060_On_the_Stationary_Distribution_of_Iterative_Imputations","names":["Jingchen Liu","Andrew Gelman","Jennifer Lynn Hill","Yu-Sung Su","Biometrika"],"references":{"227464452":"Parametric fractional imputation for missing data analysis","254284581":"The Efficiency of Logistic Regression Compared to Normal Discriminant Analysis","2118639":"Baxendale, P.H.: Renewal theory and computable convergence rates for geometrically ergodic Markov chains. Ann. Appl. Probab. 15(1B), 700-738","38363224":"Inference From Iterative Simulation Using Multiple Sequences","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","246221176":"Formalizing Subjective Notions About the Effect of Nonrespondents in Sample Surveys","2868221":"Rosenthal, J.S.: Minorization conditions and convergence rates for Markov chain Monte Carlo. J. Am. Stat. Assoc. 90, 558-566","265443275":"Multiple Imputation After 18+ Years","221669036":"Small-sample degrees of freedom with multiple imputation. Biometrika, 86, 948-955","31373635":"Large-sample theory for parametric multiple imputation procedures. Biometrika","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","31361470":"Maximum Likelihood Estimation via the ECM Algorithm: A General Framework","243103324":"Partially Collapsed Gibbs Samplers","200111118":"Markov Chains and Stochastic Stability","239294884":"Functional Compatibility, Markov Chains, and Gibbs Sampling with Improper Posteriors","247518826":"Significance Levels From Repeated p-Values With Multiply-Imputed Data","31303345":"Inference for Imputation Estimators","23780231":"Multiple Imputation of Missing Values: Update of ICE","38360359":"Asymptotic Results for Multiple Imputation","23630599":"Comparing sweep strategies for stochastic relaxation","246902471":"Rubin DBMultiple Imputation for Nonresponse in Surveys. New York: J Wiley \u0026 Sons","228988240":"Multiple Imputation with Diagnostics (mi) in R: Opening Windows into the Black Box","38363070":"Multiple-Imputation Inferences with Uncongenial Sources of Input","2113435":"Finite sample properties of multiple imputation estimator","24096594":"Multiple imputation of missing data"},"citedIn":{"280695163":"Handling missing data in matched case-control studies using multiple imputation","283556004":"Adjusting Survey Response Distributions Using Multiple Imputation: A Simulation with External Validation","258373922":"A Structured Prediction Approach for Missing Value Imputation","255174834":"Dual imputation model for incomplete longitudinal data","266396679":"Multiple Imputation of Missing Categorical and Continuous Values via Bayesian Mixture Models with Local Dependence","278390235":"Combining fractional polynomial model building with multiple imputation","260373033":"Joint modelling rationale for chained equations","282999504":"Multiply imputing missing values in data sets with mixed measurement scales using a sequence of generalised linear models","232697329":"Multiple imputation of covariates by fully conditional specification: Accommodating the substantive model. Statistical Methods in Medical Research","255956595":"The impact of missing data on analyses of a time-dependent exposure in a longitudinal cohort: A simulation study","273315870":"Multiple Imputation of Multilevel Missing Data--Rigor Versus Simplicity","276509582":"MI Double Feature: Multiple Imputation to Address Nonresponse and Rounding Errors in Income Questions","255695370":"Multiple imputation for an incomplete covariate that is a ratio","263760802":"Are Independent Parameter Draws Necessary for Multiple Imputation?"},"index":983}