{"abs":"We analyse computational efficiency of Metropolis-Hastings algorithms with AR(1) process proposals. These proposals include, as a subclass, discretized Langevin diffusion (e.g. MALA) and discretized Hamiltonian dynamics (e.g. HMC). By including the effect of Metropolis-Hastings we extend earlier work by Fox and Parker, who used matrix splitting techniques to analyse the performance and improve efficiency of AR(1) processes for targeting Gaussian distributions. Our research enables analysis of MCMC methods that draw samples from non-Gaussian target distributions by using AR(1) process proposals in Metropolis-Hastings algorithms, by analysing the matrix splitting of the precision matrix for a local Gaussian approximation of the non-Gaussian target.","title":"Efficiency and computability of MCMC with Langevin, Hamiltonian, and other matrix-splitting proposals","id":270906136,"url":"https://www.researchgate.net/publication/270906136_Efficiency_and_computability_of_MCMC_with_Langevin_Hamiltonian_and_other_matrix-splitting_proposals","names":["Richard A. Norton","Colin Fox"],"references":{"239546247":"MCMC methods for diffusion bridges","221661751":"MCMC Methods for Functions: Modifying Old Algorithms to Make Them Faster","243767297":"Springer Series in Operations Research","271512969":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","13277506":"Multigrid Monte Carlo method. Conceptual foundations","2704064":"Probabilistic Inference Using Markov Chain Monte Carlo Methods","245481576":"Inverse problems: A Bayesian perspective","38373539":"Exponential Convergence of Langevin Distributions and Their Discrete Approximations","50235701":"Optimal scaling and diffusion limits for the Langevin algorithm in high dimensions. Ann. Appl. Probab. 22, 2320-2356","227672958":"Optimal scaling of discrete approximations to Langevin diffusions. J R Stat Soc Ser B (Stat Methodol)","45897328":"Optimal tuning of the Hybrid Monte-Carlo Algorithm","282494905":"Optimal scaling of discrete approximations to Langevin diffusions","267437407":"Convergence in Variance of Chebyshev Accelerated Gibbs Samplers","259058976":"Mathematical Method of Classical Mechanics","45866217":"Optimal scalings for local Metropolis--Hastings chains on nonproduct targets in high dimensions","276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","265181051":"MCMC-Based Image Reconstruction with Uncertainty Quantification","262302298":"Numerical integrators for the Hybrid Monte Carlo method","2583743":"Weak Convergence And Optimal Scaling Of Random Walk Metropolis Algorithms","38326865":"Optimal Scaling for Various Metropolis-Hastings Algorithms","262986800":"Numerical Integrators for the Hybrid Monte Carlo Method"},"citedIn":{"276296293":"Accelerated Gibbs sampling of normal distributions using matrix splittings and polynomials","279968982":"Fast sampling in a linear-Gaussian inverse problem"},"index":988}