{"abs":"To sample from distributions in high dimensional spaces or finite large sets di- rectly is not feasible in practice, especially when the corresponding densities are known up to normalizing constants only. One has to resort to approximations. A Markov process with the underlying distribution as its equilibrium is often used to generate an approximation (\"MCMC\"). How good the approximation is de- pends on the approximating Markov process and on the specific criterion used for comparison. One may investigate the convergence properties of some particular Monte Carlo Markov processes, or compare the convergence rate within a family of Markov processes (with the same equilibrium) w.r.t. dierent","title":"Nonreversible perturbations accelerate convergence","id":238092075,"url":"https://www.researchgate.net/publication/238092075_Nonreversible_perturbations_accelerate_convergence","names":["Chii-Ruey Hwang","Shuenn-Jyi Sheu","Ma Shu-Yin Hwang"],"references":{"265465075":"Tweedie, R.L.: Rates of convergence of the Hastings and Metropolis algorithms. Ann. Stat. 24, 101-121","22861727":"[Functional analysis].","234816156":"One-Parameter Semigroups of Positive Operators","254332493":"Stochastic Differential Equations and Diffusion Processes","266703341":"Lecture Notes in Statistics","265955283":"On some quadratic perturbation of Ornstein-Uhlenbeck processes","2106699":"Ergodic convergence rates of Markov processes--eigenvalues, inequalities and ergodic theory","260161226":"Convergence Rates of the Gibbs Sampler, the Metropolis Algorithm and Other Single-Site Updating Dynamics","2357455":"Geometric and Subgeometric Convergence of Diffusions with Given Stationary Distributions, and Their Discretizations","230801964":"Perturbation Theory of Linear Operators","23630599":"Comparing sweep strategies for stochastic relaxation","246251933":"From Markov Chains to Non-Equilibrium Particle Systems","235324276":"Existence of the spectral\ngap for elliptic operators","268019627":"On regularity of transition probabilities and invariant measures of singular diffusions under minimal conditions","222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","38362909":"Accelerating Gaussian Diffusions","227585608":"Pointwise estimates and quasilinear parabolic equations","38348784":"Convergence properties of the Gibbs sampler for perturbations of Gaussians","38362960":"Optimal Spectral Structure of Reversible Stochastic Matrices, Monte Carlo Methods and the Simulation of Markov Random Fields","247028007":"On the average-case analysis of dynamic Monte Carlo schemes"},"citedIn":{"258753506":"Geometrically Constructed Markov Chain Monte Carlo Study of Quantum Spin-phonon Complex Systems"},"index":990}