{"abs":"Real-world optimization problems often require the consideration of multiple contradicting objectives. These multiobjective problems are even more challenging when facing a limited budget of evaluations due to expensive experiments or simulations. In these cases, a specific class of multiobjective optimization algorithms (MOOA) has to be applied. This paper provides a review of contemporary multiobjective approaches based on the singleobjective meta-model-assisted ’Efficient Global Optimization’ (EGO) procedure and describes their main concepts. Additionally, a new EGO-based MOOA is introduced, which utilizes the S\\mathcal{S} -metric or hypervolume contribution to decide which solution is evaluated next. A benchmark on recently proposed test functions is performed allowing a budget of 130 evaluations. The results point out that the maximization of the hypervolume contribution within a real multiobjective optimization is superior to straightforward adaptations of EGO making our new approach capable of approximating the Pareto front of common problems within the allowed budget of evaluations.","title":"Multiobjective Optimization on a Limited Budget of Evaluations Using Model-Assisted $\\mathcal{S}$ -Metric Selection","id":220702165,"url":"https://www.researchgate.net/publication/220702165_Multiobjective_Optimization_on_a_Limited_Budget_of_Evaluations_Using_Model-Assisted_mathcalS_-Metric_Selection","names":["Wolfgang Ponweiser","Tobias Wagner","Dirk Biermann","Markus Vincze"],"references":{"4201537":"Multi-objective evolutionary optimization of subsonic airfoils by kriging approximation and evolution control","220375075":"Completely Derandomized Self-Adaptation in Evolution Strategies","3418871":"ParEGO: A Hybrid Algorithm With On-Line Landscape Approximation for Expension Multiobjective Optimization Problems","235709769":"Evaluating the quality of approximation to the non-dominated set","3418737":"Performance Assessment of Multiobjective Optimizers: An Analysis and Review","28358328":"Lecture Notes in Computer Science","220701486":"Lecture Notes in Computer Science","216300591":"Metamodel-assisted Multiobjective Optimisation Strategies and Their Application in Airfoil Design","216301160":"Metamodel-assisted SMS-EMOA applied to airfoil optimization tasks","221228384":"An EMO Algorithm Using the Hypervolume Measure as Selection Criterion","216300535":"A fast elitist non-dominated sorting genetic algorithm for multi-objective optimization: NSGA-II. KANGALRep. No. 200001","2523573":"A Fast Elitist Non-dominated Sorting Genetic Algorithm for Multi-objective Optimization: NSGA-II","43472452":"Multidisciplinary Design Optimisation of Unmanned Aerial Systems (UAS) using Meta model Assisted Evolutionary Algorithms","265574083":"Design and analysis of computer experiments. With comments and a rejoinder by the authors","12473894":"Comparison of Multiobjective Evolutionary Algorithms: Empirical Results","221228406":"Multiobjective Optimization on a Budget of 250 Evaluations","2634673":"Multiobjective Optimization Using Evolutionary Algorithms --- A Comparative Case Study","221008054":"Model-based Optimization Revisited: Towards Real-World Processes","224645825":"An Improved Dimension-Sweep Algorithm for the Hypervolume Indicator","216301383":"Exploration of Metamodeling Sampling Criteria for Constrained Global Optimization","245426181":"Statistical Improvement Criteria for Use in Multiobjective Design Optimization","235709802":"Efficient Global Optimization of Expensive Black-Box Functions","4201703":"Efficient global optimization (EGO) for multi-objective problem and data mining","237453504":"Review of Metamodeling Techniques in Support of Engineering Design Optimization","38363493":"[Design and Analysis of Computer Experiments]: Rejoinder","225237917":"Efficient Global Optimization of Expensive Black-Box Functions","2570964":"Local-Search and Hybrid Evolutionary Algorithms for Pareto Optimization","216457301":"Evolutionary Algorithms for Multiobjective Optimization: Methods And Applications. Shaker Verlag, Aachen","2575571":"Evolutionary Algorithms for Multiobjective Optimization: Methods and Applications","221006937":"Clustered Multiple Generalized Expected Improvement: A Novel Infill Sampling Criterion for Surrogate Models","3418892":"Single-and multiobjective evolutionary optimization assisted by gaussian random field metamodels. IEEE Trans Evol Comput","216457304":"Lecture Notes in Computer Science"},"citedIn":{"221228399":"OCD: Online Convergence Detection for Evolutionary Multi-Objective Algorithms Based on Statistical Testing","220381030":"Expensive Multiobjective Optimization by MOEA/D With Gaussian Process Model","38092675":"Multi-objective optimization with controlled model assisted evolution strategies","257335184":"A benchmark of kriging-based infill criteria for noisy optimization","257299288":"Multiobjective optimization using Gaussian process emulators via stepwise uncertainty reduction","259086142":"A solution process for simulation-based multiobjective design optimization with an application in the paper industry","265599047":"Dynamic Real-Time Substrate Feed Optimization of Anaerobic Co-Digestion Plants","262328308":"An evolution strategy assisted by an ensemble of local Gaussian process models","270539639":"On the estimation of Pareto fronts from the point of view of copula theory","264653596":"Multi-objective nonlinear model predictive substrate feed control of a biogas plant","265209813":"Faster Computation of Expected Hypervolume Improvement","289980307":"Hydrosystem optimization on a budget: Investigating the potential of surrogate based optimization techniques","285886691":"Review of surrogate modeling in water resources","216457295":"On Expected-Improvement Criteria for Model-based Multi-objective Optimization","235679398":"Mehrkriterielle sequentielle Parameteroptimierung für Anwendungsprobleme mit stark limitiertem Budget","232767669":"Model-assisted Multi-criteria Tuning of an Event Detection Software under Limited Budgets","282425720":"Kriging-based infill sampling criterion for constraint handling in multi-objective optimization","259184028":"A Case Study on Multi-Criteria Optimization of an Event Detection Software under Limited Budgets","282570552":"A Bayesian approach to constrained single- and multi-objective optimization","281320363":"Multi-point Efficient Global Optimization using Niching Evolution Strategy","261054334":"Hypervolume-based expected improvement: Monotonicity properties and exact computation","272374601":"Multi objective optimization of computationally expensive multi-modal functions with RBF surrogates and multi-rule selection","271366292":"Efficient multi-criteria optimization on noisy machine learning problems","258724624":"Review of surrogate modeling in water resources Water Resources Research 48:n/a-n/a","288058838":"Surrogate-enhanced evolutionary annealing simplex algorithm for effective and efficient optimization of water resources problems on a budget","282448042":"Statement of Problem of Pareto Frontier Management and Its Solution in the Analysis and Synthesis of Optimal Systems","271445970":"Multiobjective optimisation on a budget: Exploring surrogate modelling for robust multi-reservoir rules generation under hydrological uncertainty","226716412":"Kriging Is Well-Suited to Parallelize Optimization"},"index":993}