{"abs":"In recent years, a variety of extensions and refinements have been developed for data augmentation (DA) based model fitting routines. These developments aim to ex- tend the application, improve the speed, and/or simplify the implementation of DA methods, such as the deterministic EM algorithm for mode finding and stochastic methods including the DA algorithm and the method of auxiliary variable for posterior sampling. In this paper we graphically illustrate and compare a number of these extensions all of which aim to maintain the simplicity and computation stability of their predecessors. We also show the applicability of DA methods for handling complex models with highly hierarchical structure, using a high-energy high-resolution spectral imaging model for data from a new generation of satellite telescopes, such as the soon to be launched Chandra space observatory.","title":"Algorithms Based on Data Augmentation: A Graphical Representation and Comparison","id":2516768,"url":"https://www.researchgate.net/publication/2516768_Algorithms_Based_on_Data_Augmentation_A_Graphical_Representation_and_Comparison","names":["David A van Dyk","Xiao-li Meng L"],"references":{"222367826":"On rates of convergence of stochastic relaxation for Gaussian and non-Gaussian distributions","228588201":"Fitting Mixed-Effects Models Using Efficient EM-Type Algorithms","2469075":"Auxiliary Variable Methods for Markov Chain Monte Carlo with Applications","228589752":"Nesting EM algorithms for computational efficiency","243776875":"Spatial Statistics and Bayesian Computing","256476485":"Maximum Likelihood from Incomplete Data Via the EM Algorithm (with discussion). J. Roy","3315454":"Space-Alternating Generalized Expectation-Maximization Algorithm","220182914":"Geman, D.: Stochastic relaxation, Gibbs distribution, and the Bayesian restoration of images. IEEE Trans. Pattern Anal. Mach. Intell. PAMI-6(6), 721-741","3326364":"Penalized Maximum-Likelihood Image Reconstruction Using Space-Alternating Generalized EM Algorithms"},"citedIn":{"51890727":"EM algorithm and variants: an informal tutorial","264674014":"Statistical guarantees for the EM algorithm: From population to sample-based analysis"},"index":994}